{
    "subreddit": "Binance",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uddnlz",
            "title": "is there a fee for trading crypto?",
            "url": "https://www.reddit.com/r/binance/comments/uddnlz/is_there_a_fee_for_trading_crypto/",
            "author": "sawx6",
            "created_utc": 1651092929.0,
            "score": 3,
            "num_comments": 12,
            "subreddit": "binance",
            "selftext": "if i buy and sell between currencies, is there a fee?",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uic00r",
            "title": "Crypto Asset Manager Valkyrie Launches Avalanche Trust for Accredited Investors; The addition follows the firm unveiling its first multi-coin investment vehicle last month",
            "url": "https://valkyriecryptofunds.com/avax",
            "author": "EusebiaGoldstein",
            "created_utc": 1651685737.0,
            "score": 18,
            "num_comments": 2,
            "subreddit": "binance",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uicz7t",
            "title": "Binance coin: Here’s what an increase in whale activity means for BNB investors",
            "url": "https://www.reddit.com/r/binance/comments/uicz7t/binance_coin_heres_what_an_increase_in_whale/",
            "author": "Milan765",
            "created_utc": 1651688391.0,
            "score": 15,
            "num_comments": 8,
            "subreddit": "binance",
            "selftext": "Do you consider yourself a crypto Degen? Do you tell your friends and relatives that you think altcoins like Binance Coin (BNB) are a good investment? Well, you should know that BNB has had its greatest grouping of whale transactions since early March in the last several days. \n\nYou should be aware as a Degen that this is a sign of a price direction change. In case you missed it, here's a recap of the coin's performance during the last month.\n\nBNB is a stable coin of the largest cryptocurrency platform in the world, Binance. Binance is the trading place of a wide variety of cryptos including Bitcoin, Ethereum, Dogecoin, Shiba Inu which together with Dogecoin are meme coins, Axie Infinity, Decentraland (a play to earn token just like Axie Infinity), Elitecoin which is a coin that functions in the travel and hospitality space, Sandbox which is a NFT play to earn token and so on.\n\nBNB fell 13% in 30 days after starting in April with a price index of $450. This coin was trading for $391.95 at the time of publication, up 1.89 percent in the last 24 hours. \n\nThe currency began the month with a bullish run on a 50 EMA. Increased accumulation was continuous until mid-April, when a reversal occurred, while maintaining a position below the price. The 50 EMA line was above the price at the time of publication, indicating that distribution was still going on.\n\nThe RSI's location throughout the same time period also supports this claim. The RSI began the month at 60 and has since been trending lower into the 50 neutral level and below. This stood at 44.66 at the time of writing.\n\nSimilarly, during the course of a month, the coin's trading volume dropped by 45 percent. Trading volumes peaked at 2.71 billion at the beginning of April, but were down to 1.4 billion at the time of publication. This indicated a drop in the coin's trading volume over a 30-day period. \n\nFurthermore, the market capitalization of the BNB Coin fell by 12% in a 30-day period. The market capitalization was $64 billion at the time of writing. \n\nIn the last few days, on-chain data revealed an uptick in whale activity. Whales accumulated a lot of money on the 28th and 29th of April for transactions exceeding 100k. However, there has been a decline. At this time of this writing, this stood at 12 after recording a high of 122 just four days ago.\n\nIn addition, the Network's Daily Active Addresses hit a new high of 16,929 and a new low of 11,427 in the last 30 days. This was 2,419 at the time of writing, and it is anticipated to increase to as high as 10,000 by the end of the day.",
            "stickied": false,
            "comments": [
                {
                    "id": "i7ck0gg",
                    "author": "POVTips",
                    "score": 13,
                    "created_utc": 1651701332.0,
                    "response": "BNB is not a stable coin.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7crri5",
                    "author": "vaper_32",
                    "score": 6,
                    "created_utc": 1651704559.0,
                    "response": "Answer the question from the title.. what does it F-ing mean for investors??",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uiiren",
            "title": "[Academic] Survey on DeFi adoption. Prizes Included to incentivize responses",
            "url": "https://www.reddit.com/r/binance/comments/uiiren/academic_survey_on_defi_adoption_prizes_included/",
            "author": "No-Willingness9553",
            "created_utc": 1651704484.0,
            "score": 17,
            "num_comments": 8,
            "subreddit": "binance",
            "selftext": "**\\[Academic\\] The Survey is about DeFi (Decentralized Finance) adoption.** No need to be an expert on the topic. I would be much appreciated if you could spend some time filling out this survey. **5 prizes of 20$** each are being given away to respondents that finish the survey and hand over an email so that I can contact them to deliver the prize in the best way possible.\n\nHere goes the link to the survey: [https://novaims.eu.qualtrics.com/jfe/form/SV\\_3UzP5e3lMtFHvXU](https://novaims.eu.qualtrics.com/jfe/form/SV_3UzP5e3lMtFHvXU)\n\nThank you so much for your time!\n\nP.S. - **This is not a self-promotion/advertising post!** **Academic research is not my job** and I have no financial interest underlying the post. **The prizes only serve to encourage you to fill in the survey and are not mandatory.** You can always fill in the survey and never share any personal information whatsoever.",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uife6k",
            "title": "France Gives Binance Go-Ahead to Run Crypto Exchange",
            "url": "https://maxbit.cc/france-gives-binance-go-ahead-to-run-crypto-exchange/",
            "author": "bitdex",
            "created_utc": 1651695019.0,
            "score": 9,
            "num_comments": 7,
            "subreddit": "binance",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uifhoe",
            "title": "Volatility Trading Algorithm for Short-Term Crypto Traders",
            "url": "https://www.reddit.com/r/binance/comments/uifhoe/volatility_trading_algorithm_for_shortterm_crypto/",
            "author": "KryptoSC",
            "created_utc": 1651695286.0,
            "score": 6,
            "num_comments": 7,
            "subreddit": "binance",
            "selftext": "Intended Audience: This post is intended for cryptocurrency traders who engage in short-term trading strategies as well as those with a technical background that can assess the merits of algorithmic trading strategies.\n\nCryptocurrency Risk Disclosure: Cryptocurrency is highly speculative in nature, involves a high degree of risk, such as volatile market price swings, market manipulation, flash crashes, and cybersecurity risks. Cryptocurrency is not regulated or is lightly regulated in most countries. Cryptocurrency trading can lead to large, immediate and permanent loss of financial value. You should have appropriate knowledge and experience before engaging in cryptocurrency trading.\n\nMy Background: I'm a CFA Charterholder, statistician, python programmer, and a long-time crypto arbitrage trader. I hate risk and I hate losing money. I sought out on how to make consistent trading profits in the stock market and cryptocurrency space at the lowest risk possible. I believe I have solved this problem or at least have come very close, but you be the judge.\n\nAlgorithmic Trading Strategy: Volatility Scalp Trading\n\nI champion simplicity over complexity. The trading algorithm does not involve AI, machine learning, back-testing, parameter-tuning, etc. Due to the nature of the trading algorithm, the concept of a losing trade does not apply.\n\nTrading History and Results:\n\nI've been using my trading algorithm for 18 months in the cryptocurrency space and for 12 months in the stock market. It has returned for me 41% trading profits in cryptocurrencies and 10% trading profits in stocks (this is in addition to capital gains/losses).\n\nThe Algorithm Details:\n\nSell 1% of your holdings for every 1.5% price increase and buy back 1.0125% of your holdings with every 1.5% price decrease.\n\nExplanation of Algorithm and Why It's Advantageous:\n\nLet's use a simple example of a portfolio that has 5000 MATIC coins @ $1.0720 ($5,360 portfolio value)and the price increases 1.5%. The algorithm will sell 50 MATIC @ $1.0881 for $54.40. Then the algorithm's next trade will be to sell 49.5 MATIC @ $1.104 for $54.67 OR to buy 50.625 MATIC @ $1.0720 for $54.27. Let's say the price drops back to $1.072. The algorithm has now generated $0.13 cash and accumulated 0.625 MATIC coins. The back and forth selling and buying provides 1.5% gross profit where I chose to use 1.25% of the profit for coin/stock accumulation and the remaining 0.25% for cash accumulation, but you can adjust what portion to use for cash accumulation.\n\nScenario Consequences of the Algorithm:\n\n\\- Extreme Bull Market Scenario:\n\nIf MATIC shoots to $100 a coin, the algorithm will keep selling MATIC and the user will have 233.187 MATIC left in their account and $37,847 cash for a total portfolio value of $61,291. The algorithm is designed to not cannibalize the user's holdings even if the price shoots to a $1 million as long as 1% of the holdings is not exceeded. However, this scenario generates the risk of foregone profits. If the user never sold from the beginning, they would have 5000 MATIC @ $100 for a total portfolio value of $500,000, generating foregone profits of $438,709.\n\n\\- Sideways Market Scenario:\n\nThis is the perfect scenario for this trading algorithm as the price keeps going up and down within an upper and lower bound. Trading profits are constantly generated and coins are constantly accumulated, achieving far superior results than just buying and holding.\n\n\\- Bear Market Scenario:\n\nThis is where the trading algorithm can get into big trouble, because if left unchecked it can wipe out the cash in a portfolio as it keeps buying the coin/stock as the price drops. To mitigate the loss of capital, I have implemented two price floors. One is for the coin. By default, I set it to 30% below current market price. In this example, I would set a price floor at $0.7504 for MATIC. This would instruct the algorithm to not execute any further buy orders below this price. The other price floor would be for the cash level of the entire account. For example, if the user has $2000 cash with the 5000 MATIC coins, then the user can enforce a price floor at $1,500. That means the algorithm will not execute any buy trades for any coins/stocks if the amount of available cash falls below $1,500. These two safeguards help the portfolio withstand to some degree a market crash.\n\nContinuity of the Algorithm:\n\nThe algorithm is designed not to skip sell/buy trades of any intermediate price points if the price becomes much higher or lower. For example, if the last trade of MATIC was a sell at 1.104 and the application was switched off for 2 days and now the price of MATIC is $1.25 then the application will pick up right where it left off selling at $1.1206, $1.1374, and so on until it catches up. Skipping intermediate sells/buys would throw off the equilibrium of the trading portfolio, potentially overbuying and underselling a coin or vice versa.\n\nHow I've Handled the Cryptocurrency Winter Since December 2021:\n\nDuring the cryptocurrency market crash in December 2021, both price floors were triggered and I had lengthy periods of no trading activity while I waited for prices to recover. During the bear market when the price floors were triggered, I adopted a strategy of only executing buy trades on crypto coins that were at least 20% below the last traded price. This wide gap differential compensated for the lack of trading volume and allowed the portfolio to start trading again sooner when prices recovered.\n\nPolling Requirements of the Algorithm:\n\nThe algorithm checks for latest market price of coin/stock every 2 seconds. Polling as high as every 60 seconds should be also be adequate, but you may miss out on some trading opportunities, especially short-lived price spikes. Query as often as you can without surpassing the exchange's API rate limit or use websockets. API rate limits vary widely between exchanges, but typical API rate limits are between 60 - 200 API calls per minute.\n\nObserved Weaknesses of the Algorithm:\n\nFungibility or a Massive Position is Required. Since the algorithm sells 1% less than the prior trade or buys 1.25% more than the prior trade, being able to trade with fractional units (such as buying/selling 1.23456 units of something) is a necessity, otherwise the precision of selling/buying the exact quantities start to break down. Most cryptos on the exchange are highly fungible with quantity decimal places 4 to 8 units out. For stocks, I used Alpaca as my brokerage firm and they allowed fractional trading on most stocks, but it wasn't allowed on certain stocks and I would need to own 7000 shares for the algorithm to trade smoothly on those stocks.\n\nHighly Sensitive to Transaction Costs. Since the margin of profit between a round-trip buy and sell trade is 1.5%, the transaction costs would need to be under 0.25% in order to come out with a net profit of at least 1%. Most of my crypto trading occurred on Binance US (with BNB token enabled for paying transaction fee) which had a 0.0675% transaction cost on each trade. Alpaca had no transaction costs for stock trading.\n\nObserved Strengths of the Algorithm:\n\nLimit Order Surpluses. The algorithm would only submit a sell or buy order only when it verified that there was sufficient quantity in the bid or ask to clear the trade. As a result, most trades executed on average 0.1% better than the limit price. Furthermore, the rate of unfilled/open limit orders was less than 0.006%.\n\nConclusions of the Algorithm:\n\nAfter trading it live for 18 months in cryptocurrency and 12 months in stocks, here's what I have to say about it. The algorithm has performed well in both cryptos and stocks. Cryptos are much more volatile than stocks so in a typical day I would see about 5 buys and 5 sells for each crypto coin and about 1 trade a day for low-volatile value stocks and about 2-3 trades a day for higher beta growth stocks. For stocks, the algorithm acted more or less as an aggressive portfolio rebalancer on steroids. Cryptos are highly correlated, they all tend to go up together and down together. With stocks, there's less correlation between them when diversified enough, so when some stocks are going up, the cash generated from sell trades are used to buy the other stocks that are going down when buy trades are triggered.\n\nAdditional Reference:\n\nAdditional details, visuals, and an introductory video can be referenced at [www.krytposcalper.com](https://www.krytposcalper.com/)\n\nOverall conclusion:\n\nNo trading algorithm is perfect and I do not claim mines to be either. However, I challenge anyone to state a superior algorithm that has a superior risk-reward ratio than the one I proposed. I am happy with what I created and its results and will plan to continue using this while I have money in cryptos and stocks. The algorithm is very simple and any mid-level programmer can replicate it and trade for him/herself. However, many people do not know or have the time to program such an application, so a website has been created for others to download and use the product (for cryptocurrencies only, not stocks), so they can leverage this application.\n\nI welcome the community's scrutiny and feedback. I hope to engage in a discussion that can help identify unobserved weaknesses and improve/optimize the algorithm. Thank you.",
            "stickied": false,
            "comments": []
        }
    ]
}