{
    "subreddit": "CryptoTechnology",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "oazn17",
            "title": "Technical Question",
            "url": "https://www.reddit.com/r/CryptoTechnology/comments/oazn17/technical_question/",
            "author": "twestedglin",
            "created_utc": 1625066829.0,
            "score": 3,
            "num_comments": 24,
            "subreddit": "CryptoTechnology",
            "selftext": "*Please excuse my usage of 'token' or 'NFT' in the wrong context if that is the case below! Also the use of cigars in the example is not important, it's the theory of the idea - creating a digital store of memories tied to an item.*\n\nI have a basic understanding of NFTs. I have minted some purely for experimentation purposes. I have dabbled on various NFT market places and galleries.\n\nMy question and also an idea is as follows; take a box of cigars that contains 12 cigars. I received these cigars as a gift. On the bottom of the box is a QR code which I can scan in 'CigarDapp'. This action transfers a token of ownership for the cigar (i know this can be done currently). However this token of ownership operates like a digital photo album and it comes with some media from the cigarmaker, maybe a little video of one of my cigars being rolled.\n\nI will take the cigars and smoke them over time, some of those will be special occasions. I would like to be able to add further media to the token record via cigar dapp, ie when I finish the box of twelve cigars I can access my token which now holds a library of media that I've enjoyed with the cigar.\n\nIs this type of 'expandable NFT' possible or being done?\n\nAny one have any hints!?",
            "stickied": false,
            "comments": [
                {
                    "id": "h3liynk",
                    "author": "the_good_time_mouse",
                    "score": 3,
                    "created_utc": 1625082272.0,
                    "response": "You can add pages to a website, yes.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}