{
    "subreddit": "CryptoTechnology",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "skxnj2",
            "title": "Why are DeFi coins like Cardano, CRD Network, Polkadot, Kusari, and Solana going to be better than ETH 2.0?",
            "url": "https://www.reddit.com/r/CryptoTechnology/comments/skxnj2/why_are_defi_coins_like_cardano_crd_network/",
            "author": "NelsonStearman",
            "created_utc": 1644033965.0,
            "score": 3,
            "num_comments": 40,
            "subreddit": "CryptoTechnology",
            "selftext": "I get why they are better than Ethereum now, but what separates them from Ethereum's POS model? Is it just a race to try and outpace Ethereum before it implements its POS model? Will the technology be the same? Or do they have something that separates them from Ethereum 2.0?",
            "stickied": false,
            "comments": [
                {
                    "id": "hvoht8m",
                    "author": "LucidiK",
                    "score": 8,
                    "created_utc": 1644053024.0,
                    "response": "Haha defi coins like...\n\nProceeds to list a series of layer ones. \n\n\nNone of the projects you listed are \"defi projects\".  They are settlement layers. The things you are looking for are the tokens on these networks that give you partial ownership of the protocols they came from.\n\nThe things you listed ARE competing with Ethereum (no idea which will win but current bets are on ETH). The Defi projects are not.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hvnvv9y",
                    "author": "AtHeartEngineer",
                    "score": 4,
                    "created_utc": 1644037747.0,
                    "response": "Your honor, leading question",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hvnryj5",
                    "author": "ChineseCracker",
                    "score": 13,
                    "created_utc": 1644035607.0,
                    "response": "'defi coins like Cardano' lol\n\nyou can't do jack on Cardano - definitely not defi.\n\nETH2 will not solve the scaling issue that Ethereum has. Thee are additional steps planned to eventually scale.... but nobody knows that this will actually happen.\n\nChains like Avalanche, and polkadot have a fundamentally different approach as they're multichain.\n\nChains like harmony are basically what the final version of Ethereum is supposed to look like. with sharding (kind of like temporary sub-chains) \n\nSolana on the other hand is on the completely opposite end of the spectrum. It just tried to build the fastest single-L1-chain without any shards or different layers.\n\nAnd I don't know what CRD  network or Kusari are.\n\nAt the end of the day it's about having the chain with the most desirable dapps. So it matters where the developers are and which chain builds the most exciting stuff. It's not going to be one chain future - multiple chains will coexist and interoperable",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}