{
    "subreddit": "Binance",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ukliyk",
            "title": "Crypto Runner Front Run Bot Web Solution BSC Chain",
            "url": "https://www.reddit.com/r/binance/comments/ukliyk/crypto_runner_front_run_bot_web_solution_bsc_chain/",
            "author": "Old-Property-7639",
            "created_utc": 1651954883.0,
            "score": 101,
            "num_comments": 0,
            "subreddit": "binance",
            "selftext": "**WORLD PREMIERE: Crypto Runner**\n\nCrypto Runner brings forward a unique and creative trading artificial intelligence solution that is the first of its kind in the cryptocurrency field. This solution is supported by an algorithm that does frontrunning, or getting ahead of previous transactions that are still in the MEM pool, by adjusting GAS costs to purchase at a discount and then sell at a premium after the initially intended transaction. In addition, Crypto Runner is available on both the BSC Smart Chain and the Ethereum network.\n\n**Uncovering the Potential of Crypto Runner**\n\nSo far, Crypto Runner has proved itself to be a prolific initiative. Since mid-2021, the Crypto Runner team has been building and testing its code and Tech Stack. The algorithm was soft launched in early October 2021 and has experienced an average monthly rise of 15.4 %, or around 2-4 % weekly. This code works for its users 24 hours a day, anticipating and capitalising on global possibilities.\n\n**Mechanisms of Crypto Runner**\n\nCrypto Runner is sustained by bots, which are pre-programmed programs that enable you to fully automate your trading. Overall, the program is based on a newly created front-running algorithm. A front-running bot scans pending transactions and pays a higher gas charge for miners to execute its transaction first, thereby front-running a substantial deal that would impact market pricing.\n\nRather than monitoring every market move and waiting for the optimal moment to purchase and sell, the bot will analyse market data and execute asset transactions on your behalf.\n\nCrypto Runner remains on the cutting edge of the crypto field due to their ongoing collaboration with developers with over 20 years of expertise, marketing gurus, and devoted staff.\n\n**Access Crypto Runner**\n\nTheir business model offers different plans. You can choose between the Premium and the Basic package. A trial version is also available for interested parties, which includes a 7-day trial.\n\n**Useful Information:**\n\nAre you willing to embark on this unique blockchain journey and acquire unprecedented profits? Learn more about this breakthrough algorithm that seeks to disrupt the blockchain realm by following the channels of Crypto Runner:\n\n🤖 Web DAPP: [https://crypto-runner.app/](https://crypto-runner.app/)\n\n🌐 Website: [https://crypto-runner.com/](https://crypto-runner.com/)",
            "stickied": false,
            "comments": [],
            "sentiment_analysis": 0
        },
        {
            "id": "uka7vg",
            "title": "Anyone else notice binance now shows buys and sells?",
            "url": "https://i.redd.it/ts6u9d5c31y81.jpg",
            "author": "Mannit578",
            "created_utc": 1651918175.0,
            "score": 92,
            "num_comments": 52,
            "subreddit": "binance",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i7nubb9",
                    "author": "eiskonig",
                    "score": 35,
                    "created_utc": 1651918817.0,
                    "response": "Always has, you need to tick the order history box to enable this view.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7nuwib",
                            "author": "Tight-Implement-3664",
                            "score": 5,
                            "created_utc": 1651919321.0,
                            "response": "How do you do that i cant find it",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7nyxf7",
                                    "author": "eiskonig",
                                    "score": 18,
                                    "created_utc": 1651922466.0,
                                    "response": "I'll use the op image as reference to guide you, do you see the reversed arrows on the right side, right above value 4145, 97, you click on them, a new interface called \"chart settings\" shows up, tick order history there and it will now display all you past buy/sell operation.",
                                    "depth": 3,
                                    "comments": [],
                                    "sentiment_analysis": 0
                                }
                            ],
                            "sentiment_analysis": 0
                        }
                    ],
                    "sentiment_analysis": 0
                },
                {
                    "id": "i7nwj14",
                    "author": "Virtuousbro93",
                    "score": 25,
                    "created_utc": 1651920634.0,
                    "response": "Five years late bud.",
                    "depth": 1,
                    "comments": [],
                    "sentiment_analysis": 0
                },
                {
                    "id": "i7o7bb4",
                    "author": "creatiiive7",
                    "score": 8,
                    "created_utc": 1651927872.0,
                    "response": "Its been there ever since the second world war",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7oc14n",
                            "author": "ChargedStork",
                            "score": 3,
                            "created_utc": 1651930432.0,
                            "response": "Lmfao 😂",
                            "depth": 2,
                            "comments": [],
                            "sentiment_analysis": 1
                        }
                    ],
                    "sentiment_analysis": 0
                },
                {
                    "id": "i7o5kz4",
                    "author": "HomosapienHomie",
                    "score": 4,
                    "created_utc": 1651926866.0,
                    "response": "Bruh? Always has been.",
                    "depth": 1,
                    "comments": [],
                    "sentiment_analysis": 0
                },
                {
                    "id": "i7obj10",
                    "author": "JaggedMan78",
                    "score": 5,
                    "created_utc": 1651930172.0,
                    "response": "nothing new",
                    "depth": 1,
                    "comments": [],
                    "sentiment_analysis": 0
                },
                {
                    "id": "i7oruhd",
                    "author": "sq018",
                    "score": 3,
                    "created_utc": 1651937940.0,
                    "response": "we get it u just want to flex your entries",
                    "depth": 1,
                    "comments": [],
                    "sentiment_analysis": 0
                }
            ],
            "sentiment_analysis": 0
        },
        {
            "id": "ukjo04",
            "title": "Binance Announces Crypto Education Initiatives in India",
            "url": "https://www.reddit.com/r/binance/comments/ukjo04/binance_announces_crypto_education_initiatives_in/",
            "author": "Livid_Toe_721",
            "created_utc": 1651949167.0,
            "score": 15,
            "num_comments": 1,
            "subreddit": "binance",
            "selftext": "Binance recently announced the concurrent launch of three educational initiatives that will help educate Indian investors and students about cryptocurrency and the blockchain ecosystem.\n\nThe crypto exchange company stated that Indian regulators and policymakers recognize the lack of crypto education as an area of concern as it deters people from adopting crypto.\n\nThe first of the education initiatives will target the student demographic and is titled “Blockchain for Good.” This platform will give students the chance to come up with solutions for making crypto more obtainable and inclusive.\n\nThe third initiative will be a learn-to-earn program that will allow people to earn crypto all while learning about the crypto and blockchain ecosystem. The head of APAC at Binance, Leon Foong, stated that “we hope to create the right incentives for users to do more thorough research and make better-informed investment decisions.”\n\nBinance has also partnered with top-tier university, the Indian Institute of Technology Delhi (IIT Delhi) as a title sponsor for its cultural fest Rendezvous. The fest will showcase use cases which includes non-fungible token (NFTs) tickets like Solis, YellowHeart and Wicket are doing. They also offer certificates as well as proof-of-attendance protocol (POAP).",
            "stickied": false,
            "comments": [],
            "sentiment_analysis": 0
        },
        {
            "id": "ukj307",
            "title": "Binance commits $500m for Elon Musk’s Twitter takeover",
            "url": "https://www.reddit.com/r/binance/comments/ukj307/binance_commits_500m_for_elon_musks_twitter/",
            "author": "Sariah_jb",
            "created_utc": 1651947414.0,
            "score": 16,
            "num_comments": 4,
            "subreddit": "binance",
            "selftext": "Binance, the world's largest cryptocurrency exchange and the trading place of a wide variety of cryptos including NFT utility tokens like Decentraland, Sandbox, Quint and so on, has pledged $500 million to assist Elon Musk in his acquisition of Twitter. \n\nIn a May 4 filing, the firm is one of several financiers who claimed they will contribute to Musk's ownership of the social networking site. \n\nAccording to FN London, Musk's plan to take Twitter private has received support from 19 investors, who have promised a total of $7.1 billion.\n\nAccording to a filing with the US Securities and Exchange Commission (SEC) on Thursday, Tesla CEO Elon Musk has received funds from 18 firms to buy Twitter Inc. \n\nIn connection with his proposed acquisition of Twitter, Musk received equity commitment letters from these investors on May 4 \"providing for an aggregate of about $7.139 billion in fresh finance commitments,\" according to the SEC filing. \n\nSequoia Capital Fund, which pledged $800 million, crypto exchange Binance, which committed $500 million, AH Capital Management (aka Andreessen Horowitz, a16z), which committed $400 million, and Fidelity, which committed over $300 million, are among the list of investors.\n\nBinance said independently on Thursday that it \"plans to contribute $500 million in Twitter buyout alongside Elon Musk.\" Changpeng Zhao (CZ), the company's CEO, said: \n\n“We're ecstatic to be able to assist Elon in realizing a new Twitter vision... We intend to help connect social media and web3 together, as well as expand the use and use of crypto and blockchain technologies.\"",
            "stickied": false,
            "comments": [],
            "sentiment_analysis": 0
        },
        {
            "id": "ukiqii",
            "title": "BINANCE READY TO CONQUER FRANCE.",
            "url": "https://www.reddit.com/r/binance/comments/ukiqii/binance_ready_to_conquer_france/",
            "author": "Last-Ad1050",
            "created_utc": 1651946402.0,
            "score": 14,
            "num_comments": 1,
            "subreddit": "binance",
            "selftext": "Binance secures regulatory approval in France and is ready to operate a tracing platform in the country according to a press release from France AMF.\n\nAccording to Binance blog post it is now a registered Digital Asset service provider in France and will be permitted to hold digital assets, facilitate their purchase, sell to other firms (plastiks, SET, and ZEELOOP), and exchange such assets. Binance will be permitted to operate a trading platform for its digital assets. \n\nHaving obtained a provisional approval to operate as a broker-based in virtual assets the company is expanding its global operations especially in Abu Dhabi. The company gained approval to operate in Bahrain, Dubia, and Abu Dhabi in March, 2022. \n\nBinance founder Changpeng Zhao said at the Financial Times Crypto and Digital Assets summits in April, that when the company started that they wanted to embrace the decentralized philosophy of no office, no corporate entities, and no headquarters, but according to the founder he said the company now have a traditional structure because they want to get a license to enable them operate well as a broker-based in digital assets. He also said the company has invested over U$$108 million in its operation in France, which includes their partnership with Paris-based startup incubator station.\n\nThe U.S Interest Rate Hike\nEvents in China, and India have also weighed on Crypto Price increase as crypto soar higher following U.S. central bank rate hike. On May 4th there was hope for Bitcoin and other cryptocurrencies. As at that day the largest crypto by Market Cap was trading at $39,600 while the second largest crypto by Market Cap (Ethereum) was trading at $2,93",
            "stickied": false,
            "comments": [],
            "sentiment_analysis": 0
        },
        {
            "id": "ukikbx",
            "title": "The first beta of the Apollo DAO Creator Contest is now live!!",
            "url": "https://apollocreatorscrypto.com/creatorcontest",
            "author": "blixale",
            "created_utc": 1651945868.0,
            "score": 18,
            "num_comments": 0,
            "subreddit": "binance",
            "selftext": "",
            "stickied": false,
            "comments": [],
            "sentiment_analysis": 0
        },
        {
            "id": "uk3pus",
            "title": "I guess it's over! Didn't even get to click it",
            "url": "https://i.redd.it/tt8vjno9vyx81.jpg",
            "author": "sulestrange",
            "created_utc": 1651891248.0,
            "score": 64,
            "num_comments": 34,
            "subreddit": "binance",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i7npuqu",
                    "author": "pinton96",
                    "score": 18,
                    "created_utc": 1651914788.0,
                    "response": "Winner is probably Binance itself",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7nzz5a",
                            "author": "SpagettiGaming",
                            "score": 4,
                            "created_utc": 1651923232.0,
                            "response": "Or a bot /bots",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7o0480",
                                    "author": "Peensuck555",
                                    "score": 3,
                                    "created_utc": 1651923333.0,
                                    "response": "you needed kyc to participate",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i7o89be",
                                            "author": "gamblingenhusiast",
                                            "score": 3,
                                            "created_utc": 1651928411.0,
                                            "response": "People could still use bots.",
                                            "depth": 4,
                                            "comments": [],
                                            "sentiment_analysis": 0
                                        }
                                    ],
                                    "sentiment_analysis": 0
                                }
                            ],
                            "sentiment_analysis": 0
                        }
                    ],
                    "sentiment_analysis": 0
                },
                {
                    "id": "i7nngxk",
                    "author": "gta12368",
                    "score": 10,
                    "created_utc": 1651912598.0,
                    "response": "For those asking, the last person to click the button wins a full bitcoin. There is a one minute countdown timer, and everytime someone clicks it, the timer resets. You only had two chances to click, one woth your binance account, and another through Twitter. Each click was guaranteed a free nft. The last one to click before it actually reaches 0, wins.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7nq23t",
                            "author": "chronoz000",
                            "score": 3,
                            "created_utc": 1651914979.0,
                            "response": "how do u even access these events, i was on Binance website the whole day and I didn't even get to see this",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7nqydn",
                                    "author": "gta12368",
                                    "score": 3,
                                    "created_utc": 1651915810.0,
                                    "response": "It started around mid-March I think. I got word of it through their Twitter. I actually forgot about it, wasn't even able to click it.",
                                    "depth": 3,
                                    "comments": [],
                                    "sentiment_analysis": 0
                                }
                            ],
                            "sentiment_analysis": 0
                        }
                    ],
                    "sentiment_analysis": 0
                },
                {
                    "id": "i7n93d0",
                    "author": "True_Ebb5857",
                    "score": 12,
                    "created_utc": 1651900932.0,
                    "response": "what is this???????? i never saw this??????",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7nhqza",
                            "author": "OG_tame",
                            "score": 5,
                            "created_utc": 1651907611.0,
                            "response": "I also want to know what this is",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7nqf9m",
                                    "author": "TheFamousHesham",
                                    "score": 8,
                                    "created_utc": 1651915317.0,
                                    "response": "Trust me. You don’t.\n\nIt was the silliest game in history.",
                                    "depth": 3,
                                    "comments": [],
                                    "sentiment_analysis": 0
                                }
                            ],
                            "sentiment_analysis": 0
                        }
                    ],
                    "sentiment_analysis": 0
                }
            ],
            "sentiment_analysis": 0
        },
        {
            "id": "uk3tzh",
            "title": "[Including Scan Result Link] Crypto/NFT Investment Portfolio Tracker Template for Excel | Cryptocurrencies, NFTs, and more | Live Data & Calculations",
            "url": "https://www.reddit.com/r/binance/comments/uk3tzh/including_scan_result_link_cryptonft_investment/",
            "author": "1nferno18",
            "created_utc": 1651891644.0,
            "score": 47,
            "num_comments": 7,
            "subreddit": "binance",
            "selftext": "Hello,\n\nThis is a spreadsheet I made to easily keep track of my investments. I've decided to share it for free as a give back to the community.\n\n&#x200B;\n\n𝐅𝐞𝐚𝐭𝐮𝐫𝐞𝐬\n\n\\-------------\n\n[https://www.youtube.com/watch?v=gIlkqdGDb8s](https://www.youtube.com/watch?v=gIlkqdGDb8s)\n\n&#x200B;\n\n𝐇𝐨𝐰 𝐢𝐭 𝐰𝐨𝐫𝐤𝐬 (𝐆𝐮𝐢𝐝𝐞 𝐢𝐧𝐜𝐥𝐮𝐝𝐞𝐝)\n\n\\-------------------------------------------\n\n1. Portfolio’s Currency is selected.\n2. History is inputted either with a CSV file or manually (Transactions, Trades, Dividends).\n3. Each investment’s information is specified (Asset Class, Region, Sector, etc.)\n4. All data are then calculated automatically based on the above information.\n\n&#x200B;\n\nhttps://preview.redd.it/rgujbac50zx81.jpg?width=2700&format=pjpg&auto=webp&s=c043b10a9909f13458aff7916d3f49c976093bec\n\nhttps://preview.redd.it/ndf1zec50zx81.jpg?width=2700&format=pjpg&auto=webp&s=1dceef8a6fe75efeb893eea3748182b22d66a700\n\nhttps://preview.redd.it/cgtuhmc50zx81.jpg?width=2700&format=pjpg&auto=webp&s=e7dcd720f5ad3f146bd7adfac33fd989510b01f8\n\nhttps://preview.redd.it/ci4n5dc50zx81.jpg?width=2700&format=pjpg&auto=webp&s=16f60b380d74d1df2dbcd92753af62187d7c920f\n\nhttps://preview.redd.it/1p01fjc50zx81.jpg?width=2700&format=pjpg&auto=webp&s=46c2934892c06458482c6917928f83a85f3c9dbc\n\n&#x200B;\n\n𝟏𝟕 𝐓𝐚𝐛𝐬/𝐒𝐡𝐞𝐞𝐭𝐬\n\n\\----------------------\n\n(w/Automatic calculation unless stated otherwise)\n\n✦ Dashboard\n\n✦ Portfolio\n\n✦ Desired Portfolio (Manual Input)\n\n✦ Pies\n\n✦ Allocation\n\n✦ Tickers Info (Manual Input)\n\n✦ Crypto and NFT Portfolios\n\n✦ Transactions/Trades/Dividends History (Manual Input)\n\n✦ Returns\n\n✦ Dividends\n\n✦ Calculators\n\n✦ Valuation\n\n✦ Screener\n\n✦ Annual Reports\n\n✦ Watchlist (Manual Input)\n\n✦ Customization and Info\n\n✦ Guide\n\n&#x200B;\n\n𝐃𝐨𝐰𝐧𝐥𝐨𝐚𝐝 𝐋𝐢𝐧𝐤\n\n\\----------------------\n\n[https://www.dropbox.com/t/Nzkbi4zzqzITB7M5](https://www.dropbox.com/t/Nzkbi4zzqzITB7M5)\n\n&#x200B;\n\nScan Result:\n\n[https://www.virustotal.com/gui/file/e4c553b69d87513d5795272eb76338adb7c4441fecaa67797951df3a766660f3](https://www.virustotal.com/gui/file/e4c553b69d87513d5795272eb76338adb7c4441fecaa67797951df3a766660f3)",
            "stickied": false,
            "comments": [],
            "sentiment_analysis": 0
        },
        {
            "id": "ukc8js",
            "title": "like If you can relate 😀🔶️",
            "url": "https://i.redd.it/cwltgclvr1y81.jpg",
            "author": "RIBKA-BINANCE",
            "created_utc": 1651926428.0,
            "score": 4,
            "num_comments": 1,
            "subreddit": "binance",
            "selftext": "",
            "stickied": false,
            "comments": [],
            "sentiment_analysis": 0
        },
        {
            "id": "uk8t49",
            "title": "So if i stake above the 10% apy 2000$ cap will i still get the 10% on my 2000$ and then 3% on everything above that or will everything fall into the 3% tier?",
            "url": "https://i.redd.it/t6hd760yj0y81.jpg",
            "author": "Mormuuh",
            "created_utc": 1651911726.0,
            "score": 5,
            "num_comments": 11,
            "subreddit": "binance",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i7npy0f",
                    "author": "MemoryEXE",
                    "score": 4,
                    "created_utc": 1651914874.0,
                    "response": "Yes! For the first 2,000usdt you get 10%, any amount above 2,000usdt will get the next tier and so on.",
                    "depth": 1,
                    "comments": [],
                    "sentiment_analysis": 0
                }
            ],
            "sentiment_analysis": 0
        },
        {
            "id": "ujprwq",
            "title": "Cardano Adoption Is Surging, According to Coin Bureau – Here's Its Forecast on the Future of the Ethereum Competitor - The Daily Hodl",
            "url": "https://dailyhodl.com/2022/05/06/cardano-adoption-is-surging-according-to-coin-bureau-heres-its-forecast-on-the-future-of-the-ethereum-competitor/",
            "author": "Mother-Meat-1378",
            "created_utc": 1651850262.0,
            "score": 7,
            "num_comments": 9,
            "subreddit": "binance",
            "selftext": "",
            "stickied": false,
            "comments": [],
            "sentiment_analysis": 0
        },
        {
            "id": "ujt5qh",
            "title": "NEXO on binance",
            "url": "https://www.reddit.com/r/binance/comments/ujt5qh/nexo_on_binance/",
            "author": "MisterTunk",
            "created_utc": 1651859578.0,
            "score": 4,
            "num_comments": 3,
            "subreddit": "binance",
            "selftext": "When will it be possible to transfer NEXO from and to binance with bep2 network?",
            "stickied": false,
            "comments": [],
            "sentiment_analysis": 0
        },
        {
            "id": "ujkpfw",
            "title": "Binance futures - battle",
            "url": "https://www.reddit.com/r/binance/comments/ujkpfw/binance_futures_battle/",
            "author": "NorbeeNorbee",
            "created_utc": 1651834204.0,
            "score": 4,
            "num_comments": 9,
            "subreddit": "binance",
            "selftext": "Soo ive been playing around with 50$ in the futures, specifically the battle. And i watched the training vid etc but i still dont understand what marks the winner, WHEN either of the final limits is not met. For example i go short position so if the BTC reaches 37000$ i win, if it reaches 37200$ my opponent wins. I get that, but how is the winner/loser determined when either of these is not met within 5 minutes? Logically i would say the one whos closer to the short or long price so in this case middle ground is 37100$ so 37101$ and more - long wins, 37099$ and less - short wins. But it seems totally random so far...",
            "stickied": false,
            "comments": [],
            "sentiment_analysis": 0
        },
        {
            "id": "ujiyzx",
            "title": "USDD will be launched by TRON DAO in collaboration with blockchain leaders.",
            "url": "https://www.reddit.com/r/binance/comments/ujiyzx/usdd_will_be_launched_by_tron_dao_in/",
            "author": "Leather_Care_997",
            "created_utc": 1651826545.0,
            "score": 5,
            "num_comments": 11,
            "subreddit": "binance",
            "selftext": "USDD will be launched by TRON DAO in collaboration with blockchain leaders.\n\n## JUSTIN SUN, FOUNDER OF TRON, HAS ANNOUNCED THE LAUNCH OF DEFI STABLECOIN USDD VIA THE TRON DAO RESERVE ON THURSDAY, MAY 5. USDD WAS LISTED ON EXCHANGES LIKE SUNSWAP, UNISWAP, PANCAKESWAP AND ELLIPSIS AMONG THE FIRST. THROUGH BTTC, THE INITIAL TOTAL SUPPLY OF 66,560,006.61 WILL BE DISTRIBUTED OVER TRON, ETHEREUM, AND THE BNB CHAIN. \n\n## HTTPS://OLYMPUSDAONOW.COM/CRYPTO-BILLIONAIRE-FOUNDER-TRON-DAO-JUSTIN-SUN-DECENTRALIZED-STABLECOIN-USDD-LISTING-ON-SUNSWAP-UNISWAP-PANCAKESWAP-MAY-2022/",
            "stickied": false,
            "comments": [],
            "sentiment_analysis": 0
        },
        {
            "id": "ujdefl",
            "title": "binance is ecstatic about BTC’s price action",
            "url": "https://i.redd.it/tcw0uet9orx81.jpg",
            "author": "mitchthebaker",
            "created_utc": 1651804147.0,
            "score": 4,
            "num_comments": 11,
            "subreddit": "binance",
            "selftext": "",
            "stickied": false,
            "comments": [],
            "sentiment_analysis": 0
        },
        {
            "id": "ujs2k2",
            "title": "Binance.com or Binance.org?",
            "url": "https://www.reddit.com/r/binance/comments/ujs2k2/binancecom_or_binanceorg/",
            "author": "davidonutshell",
            "created_utc": 1651856588.0,
            "score": 4,
            "num_comments": 8,
            "subreddit": "binance",
            "selftext": "Recently got to binance.org and it seems like a slightly different website. Is it legit or unsafe?",
            "stickied": false,
            "comments": [],
            "sentiment_analysis": 0
        }
    ]
}