{
    "subreddit": "CoinBase",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uiwl4v",
            "title": "unable to buy",
            "url": "https://www.reddit.com/r/CoinBase/comments/uiwl4v/unable_to_buy/",
            "author": "rainbowthrowaway5678",
            "created_utc": 1651754551.0,
            "score": 5,
            "num_comments": 23,
            "subreddit": "CoinBase",
            "selftext": "I tried to buy crypto yesterday and I did it fine a couple months ago but now I tried the same thing again on the same crypto and it keeps saying \"user is unable to buy\" \n\nI try to go on the browser and it just says \"connection issues\" \n\nwhat's going on?",
            "stickied": false,
            "comments": [],
            "sentiment_analysis": 0
        },
        {
            "id": "ujgkic",
            "title": "I've paid why can't I access my account yet? It’s been a week",
            "url": "https://www.reddit.com/r/CoinBase/comments/ujgkic/ive_paid_why_cant_i_access_my_account_yet_its/",
            "author": "reymi199719",
            "created_utc": 1651815831.0,
            "score": 4,
            "num_comments": 20,
            "subreddit": "CoinBase",
            "selftext": "Case number #11633309 & #11692512\n\n\nThis is super frustrating to the point that when this is resolved I might never use coinbase again.\n\nI've never had problems with depositing through my current bank but got slammed with the pop up that I had Issues with my bank and have to pay the difference.\n\nI click resolve and it then says I can transfer assets instead of money from my bank. I went ahead and did that since it wasn't much. I now get stuck with \"payment pending\" we are still waiting for funds from a recent\npayment. Your account will be restored as soon as we receive funds.\n\nFunny thing is when I go to the transfers it has the transfer marked as completed. How long does it take? I've been reading from anywhere from 1 day to pretty much never",
            "stickied": false,
            "comments": [],
            "sentiment_analysis": 0
        },
        {
            "id": "ujcldg",
            "title": "New card rewards",
            "url": "https://www.reddit.com/r/CoinBase/comments/ujcldg/new_card_rewards/",
            "author": "Infamous_Ad_4648",
            "created_utc": 1651801491.0,
            "score": 6,
            "num_comments": 12,
            "subreddit": "CoinBase",
            "selftext": "Just a guess but I think we will know what the new card rewards will be shortly. The card portion of the app will be undergoing maintenance between 11:00-11:15 pacific time. \n\nAll card transactions will be declined during that time period also.",
            "stickied": false,
            "comments": [],
            "sentiment_analysis": 0
        },
        {
            "id": "uixder",
            "title": "Big blue trade button on Coinbase app covers my Bitcoin history",
            "url": "https://www.reddit.com/r/CoinBase/comments/uixder/big_blue_trade_button_on_coinbase_app_covers_my/",
            "author": "SevereTrouble9303",
            "created_utc": 1651757044.0,
            "score": 3,
            "num_comments": 19,
            "subreddit": "CoinBase",
            "selftext": "On my iphone in the app, when I look for my bitcoin purchase history, a big blue ”Trade” button covers my bitcoin history in my wallet. This doesn’t happen when I look at my Litecoin history, the trade button is further down. \nHow can I move the trade button to see my bitcoin purchase history?",
            "stickied": false,
            "comments": [],
            "sentiment_analysis": 0
        }
    ]
}