{
    "subreddit": "CryptoTechnology",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "rigzqz",
            "title": "See the lead dev of Syscoin talk about their new Ethereum based NEVM backed by Bitcoins PoW on Wendy O show 6pm UTC",
            "url": "https://www.reddit.com/r/CryptoTechnology/comments/rigzqz/see_the_lead_dev_of_syscoin_talk_about_their_new/",
            "author": "Cedarplankton",
            "created_utc": 1639746209.0,
            "score": 3,
            "num_comments": 171,
            "subreddit": "CryptoTechnology",
            "selftext": "[the official post hints of a new partnership.](https://twitter.com/syscoin/status/1471812428916682754?s=21)\n\n\n\nSyscoin is attempting to offer more than other L1s by continuing to maintain the security and decentralisation of PoW network and there are no more secure networks than Bitcoins. By being mergemined with  up to 25% of BTC hash rate it maintains one of the most secure networks on the planet whilst using no extra power at all which means it is also the greenest. In Syscoin 4.3 they have also added chainlocks on the masternode layer to ensure extra security against 51% and MEV meaning it could be classed as the most secure. \n\nWhen Ethereum finally pivots to PoS then the devs believe it will again retain the favourism of the majority of developers and other L1s will have to become rollups themselves on other networks to survive. Syscoin will provide an alternative to this by being PoW. \n\nThere will be talks on how zkrollups will effect the buidl mode of next couple of years as we are approaching fully evm compatible rollups. \n\nAlso there will be an announcement of a new partnership at the end!\n\nJag has been responsible for helping on projects ranging from Dogecoin to Coinbase to Dash and Matic. Also delivered the first BTC to ETH bridge, ZDAG and regulation compliant tech.",
            "stickied": false,
            "comments": [
                {
                    "id": "hoxnfgf",
                    "author": "choowits",
                    "score": 5,
                    "created_utc": 1639758231.0,
                    "response": "How can it claim being green if it uses BTC hashpower?",
                    "depth": 1,
                    "comments": [],
                    "sentiment_analysis": 0
                }
            ],
            "sentiment_analysis": 0
        },
        {
            "id": "r4cpbq",
            "title": "I think that blockchain technology might one of the most diverse technologies in its use cases.",
            "url": "https://www.reddit.com/r/CryptoTechnology/comments/r4cpbq/i_think_that_blockchain_technology_might_one_of/",
            "author": "Mandrake_m2",
            "created_utc": 1638129086.0,
            "score": 3,
            "num_comments": 102,
            "subreddit": "CryptoTechnology",
            "selftext": "It’s being used everywhere and in everything. From art, to sports, to gaming, to dApps with real world use cases, blockchain technology is honestly unstoppable.\n\nI wish I learned coding so I could get in on this technology as well. In fact there are already some crypto projects like Studyum working on creating a crypto compatible educational platform for students and teachers so hopefully more platforms like this one start popping up.\n\nI’m sure blockchain’s take over is inevitable. It’s already in wide use even though it’s still a very young technology.",
            "stickied": false,
            "comments": [
                {
                    "id": "hmgv3un",
                    "author": "No-Courage-1202",
                    "score": 6,
                    "created_utc": 1638145003.0,
                    "response": "Only internet has wider usage, but in the future the two will become synonymous",
                    "depth": 1,
                    "comments": [],
                    "sentiment_analysis": 0
                }
            ],
            "sentiment_analysis": 0
        }
    ]
}