{
    "subreddit": "CryptoTechnology",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "re66yu",
            "title": "Zenon Network embedded a msg in the first Taproot block on BTC. This is also likely the final clue for a sizeable reward now that Alphanet has launched, but time is running out and no one from the community has solved it yet.",
            "url": "https://www.reddit.com/r/CryptoTechnology/comments/re66yu/zenon_network_embedded_a_msg_in_the_first_taproot/",
            "author": "drinkmoreapples",
            "created_utc": 1639248872.0,
            "score": 3,
            "num_comments": 151,
            "subreddit": "CryptoTechnology",
            "selftext": "So leading up to the launch of the new network there were several clues that ended up providing the first 8 words of a 12 word seed. There are four more out there, maybe in a tweet or maybe in the Taproot block but it's way above my head so I've decided to plead with this sub to see if the brains around here have what it takes. \n\nThe wallet, Syrius, is available to download from zenon.network and I'm available in dm if anyone actually into this sort of thing but there has been a deadline set for the 21st of December so hopefully it gets solved. Good luck",
            "stickied": false,
            "comments": [],
            "sentiment_analysis": 0
        },
        {
            "id": "na762s",
            "title": "Benefits of a centralized vs decentralized exchange? EOS and Bullish.com",
            "url": "https://www.reddit.com/r/CryptoTechnology/comments/na762s/benefits_of_a_centralized_vs_decentralized/",
            "author": "blasetoys",
            "created_utc": 1620765731.0,
            "score": 3,
            "num_comments": 10,
            "subreddit": "CryptoTechnology",
            "selftext": "What are some purported benefits of a centralized vs decentralized exchange? As some of you may already know, block.one is building a new exchange called Bullish. \n\nIt is confirmed that it will be on the EOS blockchain.\nhttps://www.coindesk.com/thiel-novogratz-back-10b-funding-for-block-ones-new-crypto-exchange-subsidiary?fbclid=IwAR1cIy0t_gPKty0w-ekUWOGYIDCs0bGZOO8EjJ6AwYnc7Pzy4FyZ23DM9TI\n\nI am unfamiliar with the matter, but what are some pros and cons of centralized vs decentralized exchanges? I know that centralized may have more liquidity, but decentralized platforms are becoming more robust nowadays. Open to hearing everyone's thoughts.",
            "stickied": false,
            "comments": [
                {
                    "id": "gxrx3ls",
                    "author": "magus-21",
                    "score": 3,
                    "created_utc": 1620766156.0,
                    "response": "Centralized exchange benefits:\n\n* Generally lower fees (especially for small volumes)\n* Generally better exchange rates\n* Faster transactions\n* Better tools/price tracking\n* Access to API for automated trading\n* Way more cross-chain pairs (e.g. can directly trade BTC with ETH, or ETH with BCH, etc.)\n   * Newer DEX blockchains like THORchain are starting to allow cross-chain trrading\n* Basically, everything is cheaper, easier, and faster\n\nDecentralized exchange benefits:\n\n* Better security (your keys, your coins)\n* Generally more choices (more obscure tokens/coins available on DEXes)\n* No KYC\n* Better security\n* Less prone to outages due to traffic (although fees/transaction times might go up)\n* Less regulation (i.e. coins won't randomly disappear because of some bad news)\n* Better security\n\nI really can't overstate how much more secure DEXes are. In a large DEX it's going to be very hard to pull off a rugpull, and because everything is secured on a blockchain, it can't really be hacked the way a centralized exchange can be.\n\nThat said, the conveniences of CEXes is just too large to ignore, especially for small time retail investors. Most DEXes are on Ethereum, and gas fees make trading small amounts implausibly expensive. I like being able to buy $5-10 at a time on Gemini or Coinbase Pro and only be charged a few cents, whereas on a DEX I'd have to pay $20+ for a trade.",
                    "depth": 1,
                    "comments": [],
                    "sentiment_analysis": 0
                }
            ],
            "sentiment_analysis": 0
        }
    ]
}