{
    "subreddit": "CryptoTechnology",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "qs8p1c",
            "title": "Project feedback - please let m know what you think!",
            "url": "https://www.reddit.com/r/CryptoTechnology/comments/qs8p1c/project_feedback_please_let_m_know_what_you_think/",
            "author": "Temporary-Humor3538",
            "created_utc": 1636714419.0,
            "score": 3,
            "num_comments": 82,
            "subreddit": "CryptoTechnology",
            "selftext": "My team and I started a project to reward people for their data. \n\nThese days big companies build apps for free in exchange we agree to give our data for free. But how much is our data really worth, well a lot. There is a reason why the biggest companies atm are tech companies. \n\nWe believe people should be rewarded for sharing their data which makes the apps and platforms work in the first place. \n\nWhat would Facebook be without its users, how well would google maps work when no one is using it. They need our data and input to make their product.\n\nThis is why we started [www.mapmetics.org](https://www.mapmetics.org), to create the first navigation system that rewards users for their data.\n\nPlease let me know what you all think, the more feedback we get, the better we can make our idea. We want to build a community that believes that we should get a fair share of our data.\n\nplease leave your comments good or bad, all feedback helps to improve our product. \n\nThanks a lot very much appreciated, your the best!",
            "stickied": false,
            "comments": [],
            "sentiment_analysis": 0
        },
        {
            "id": "q3sx53",
            "title": "Syscoin has been regularly meeting with the SEC to discuss their onchain Notary feature",
            "url": "https://www.reddit.com/r/CryptoTechnology/comments/q3sx53/syscoin_has_been_regularly_meeting_with_the_sec/",
            "author": "Cedarplankton",
            "created_utc": 1633678514.0,
            "score": 3,
            "num_comments": 48,
            "subreddit": "CryptoTechnology",
            "selftext": "Syscoin met with SEC last week to discuss Syscoin’s notary feature and how it can enable securities usecases and how it disrupts the need for custodians. It was very positive and educational and they are looking forward on working with policy makers to start spreading awareness of innovative compliance techniques onchain. \nThey now have a good standing with the SEC after multiple meetings as they continue to educate on new possibilities regarding compliance onchain. They are looking for issuers that would like clear guidance (even a no-action) as they  can work with them to bring it to life.\nUnicorn type usecases are possible today, on the mainnet of Syscoin through the SPT layer. Custody-free solutions such as stock token trading (think tsla stock tokenized), broker-free security token offerings, wrapped compliant tokens, compliant stable coins and more.",
            "stickied": false,
            "comments": [],
            "sentiment_analysis": 0
        }
    ]
}