{
    "subreddit": "CryptoTechnology",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "riv3c9",
            "title": "Token Creation - Company Recommendation?",
            "url": "https://www.reddit.com/r/CryptoTechnology/comments/riv3c9/token_creation_company_recommendation/",
            "author": "Rare_Protection",
            "created_utc": 1639787842.0,
            "score": 4,
            "num_comments": 212,
            "subreddit": "CryptoTechnology",
            "selftext": "Can anyone recommend a consulting company for creating a token?\n\nWould like someone reliable I can trust to recommend a good blockchain to put it on, secure code, recommend tokenomics, etc.\n\nHas anyone worked with a company they recommend?\n\nI'm completely new to token development but would like one created for this business. Or if anyone has any good information they'd like to share regarding token development I'm not afraid to read it ..I come from the tech world (:",
            "stickied": false,
            "comments": [],
            "sentiment_analysis": 0
        },
        {
            "id": "rh5n1w",
            "title": "how do phishing hacks work?",
            "url": "https://www.reddit.com/r/CryptoTechnology/comments/rh5n1w/how_do_phishing_hacks_work/",
            "author": "saultdon",
            "created_utc": 1639592594.0,
            "score": 3,
            "num_comments": 151,
            "subreddit": "CryptoTechnology",
            "selftext": "was exploring etherscan and discovered filtering by tags where a tag of \"Phish / Hack\" exists. Very handy.\n\nhow exactly does a phishing hack work once a token like [FF9.io](https://etherscan.io/token/0x34278F6f40079eae344cbaC61a764Bcf85AfC949) is in someone's wallet?\n\ni'm assuming the goal is to drain the recipients wallet somehow? Is it via exploit or social engineering?",
            "stickied": false,
            "comments": [
                {
                    "id": "hoqp38m",
                    "author": "fudginreddit",
                    "score": 3,
                    "created_utc": 1639629156.0,
                    "response": "Idk how phishing works in the context of crypto, but I can't imagine it's any different than normal.\n\nMake a fake copy of a reputable website, ask to connect wallet, drain wallet.",
                    "depth": 1,
                    "comments": [],
                    "sentiment_analysis": 0
                }
            ],
            "sentiment_analysis": 0
        },
        {
            "id": "qwtd5m",
            "title": "Consider what would happen if the educational system adopted dApps.",
            "url": "https://www.reddit.com/r/CryptoTechnology/comments/qwtd5m/consider_what_would_happen_if_the_educational/",
            "author": "-Aporia",
            "created_utc": 1637252562.0,
            "score": 3,
            "num_comments": 77,
            "subreddit": "CryptoTechnology",
            "selftext": "What an incredible experience that would be. The educational system is in desperate need of reform. It's incredibly hierarchical and centralized. For both students and teachers, replacing it with a decentralized platform would be a game changer. And it's not like this is an outlandish concept.\n\nSome companies, such as Studyum, are already working on developing a dApp that gives students the impression that they are investing in a class rather than simply registering.\n\nAnd students and teachers are rewarded in native tokens for doing a good job, so that, in my opinion, would be a terrific sort of incentive.\n\nIf this goes through, it might have a major impact. It might be the start of a new era of education and learning, and I'm all for it.",
            "stickied": false,
            "comments": [
                {
                    "id": "hl50nu8",
                    "author": "belsaurn",
                    "score": 12,
                    "created_utc": 1637253980.0,
                    "response": "I'm sorry, but decentralizing education is not a good idea. Possibly for adults returning to school or upgrading it might work but there would be some many different things that would need to be addressed before anything like that could happen. Here are a few of them: \n\nWho would set the curriculum and ensure it meets the local standards? \n\nWho sets up the standardized testing so students can qualify for university or college? \n\nWhat is to stop misinformation from being introduced into the system if it is voted in by the governance system?\n\nHow do you grade subjective subjects, like creative writing or art?\n\nWhat happens when different areas of the world want to teach different perspectives on historical events? \n\nThose just came to mind off the top of my head.",
                    "depth": 1,
                    "comments": [],
                    "sentiment_analysis": 0
                }
            ],
            "sentiment_analysis": 0
        },
        {
            "id": "qg491a",
            "title": "Blockchain technology suggestion",
            "url": "https://www.reddit.com/r/CryptoTechnology/comments/qg491a/blockchain_technology_suggestion/",
            "author": "memeshroudblack",
            "created_utc": 1635247396.0,
            "score": 3,
            "num_comments": 111,
            "subreddit": "CryptoTechnology",
            "selftext": "I want to make a token for my business I have all the things ready for it but I am not able to choose between blockchain technology!!! I don't want to use ETH as its gas fee will not be good for my customer base! which technology out of POLKADOT, BINANCE, TRON, XLM, ADA, and Solana should use and where can I know their gas fee!!",
            "stickied": false,
            "comments": [
                {
                    "id": "hi3rxf7",
                    "author": "bannakaffalatta2",
                    "score": 7,
                    "created_utc": 1635250005.0,
                    "response": "Would your business even benefit from having a token? And if so, there are many types of tokens with many different use cases, if gas fees are your sole consideration a centralized blockchain like BSC would work. I would suggest you research more before making business decisions though",
                    "depth": 1,
                    "comments": [],
                    "sentiment_analysis": 0
                },
                {
                    "id": "hi3zmu8",
                    "author": "german_bruce_lee",
                    "score": 4,
                    "created_utc": 1635254112.0,
                    "response": "Check out Algorand. Carbon-negative, 0.001 Algo per transaction (~ 0.002 USD), ~4.5s finality, 4- (soon 5-) digit transactions per second. Its team consists of multiple MIT Professors, Turing Award winners, and a Nobel Prize winner as Economical advisor.\n\nhttps://www.algorand.com/\n\nhttps://www.algorand.com/about/our-team\n\nhttps://algorand.foundation/",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hi4fphm",
                            "author": "BrenTheBert",
                            "score": 3,
                            "created_utc": 1635261094.0,
                            "response": "Nano: 0 USD fee, ~1s finality, ~3 digit tps (I'm not positive on the tps)",
                            "depth": 2,
                            "comments": [],
                            "sentiment_analysis": 0
                        }
                    ],
                    "sentiment_analysis": 0
                }
            ],
            "sentiment_analysis": 0
        },
        {
            "id": "n0kdgw",
            "title": "Rationale behind indivisible UXTOs",
            "url": "https://www.reddit.com/r/CryptoTechnology/comments/n0kdgw/rationale_behind_indivisible_uxtos/",
            "author": "superzamp",
            "created_utc": 1619631741.0,
            "score": 5,
            "num_comments": 2,
            "subreddit": "CryptoTechnology",
            "selftext": "I am trying to understand exactly how bitcoin transactions work and especially UXTOs. Quoting from Antonopoulos' _Mastering Bitcoin_,\n\n> Although UTXO can be any arbitrary value, once created it is indivisible just like a coin that cannot be cut in half. If a UTXO is larger than the desired value of a transaction, it must still be consumed in its entirety and change must be generated in the transaction\n\nWhat exactly is the rationale behind indivisible UXTOs, and what problem do they solve?\n\n[(source)](https://www.oreilly.com/library/view/mastering-bitcoin/9781491902639/ch05.html)\n\nThanks!",
            "stickied": false,
            "comments": [
                {
                    "id": "gw7hpuj",
                    "author": "Neophyte-",
                    "score": 3,
                    "created_utc": 1619637665.0,
                    "response": "UTXO (unspent transaction output) is what you have in your wallet that makes up your bitcoin balance. they are what you see going into your wallet (transaction inputs) received from a different wallet (their transaction outputs). \n\nWhen sending bitcoin you send one or more UTXOs the amount you need needs to be larger or equal to the amount to be spent + fee. you cannot divide up the UTXO, so if the amount to be spent is larger, what you get back is change (an input that becomes a new UTXO). this is where it gets a bit confusing since technically its true UTXO isnt divisible but when sending a transaction a new utxo will be created.\n\nfor example you have a wallet containing 1.5 bitcoin made up of 3 transaction inputs received from an exchange which are now UTXOs in your wallet 1.5btc = 0.5,0.3,0.7.\n\nYou want to send 1.4 bitcoin to wallet xyz. the transaction is created using all UTXOs so you send 1.5btc, but the amount is larger than 1.4 so you receive back 0.1btc as change back. in block explorers it looks like you are sending this back to yourself. on the recipient side he will recieve all 3 outputs as inputs but 0.3 input  will be created as a utxo of 0.2 for the recipient since you got 0.1 back in change. the change is a new UTXO in your wallet to be spent which is now your bitcoin balance\n\nyou can think of it as spending a 20$ bill to pay for a 15$ item, you receive 5$ bill back in change.",
                    "depth": 1,
                    "comments": [],
                    "sentiment_analysis": 0
                }
            ],
            "sentiment_analysis": 0
        }
    ]
}