{
    "subreddit": "CryptoTechnology",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "r5tizq",
            "title": "Consider what would happen if the educational system adopted dApps.",
            "url": "https://www.reddit.com/r/CryptoTechnology/comments/r5tizq/consider_what_would_happen_if_the_educational/",
            "author": "-Aporia",
            "created_utc": 1638296076.0,
            "score": 3,
            "num_comments": 125,
            "subreddit": "CryptoTechnology",
            "selftext": "What an incredible experience that would be. The educational system is in desperate need of reform. It's incredibly hierarchical and centralized. For both students and teachers, replacing it with a decentralized platform would be a game changer. And it's not like this is an outlandish concept.\n\nSome companies, such as Studyum, are already working on developing a dApp that gives students the impression that they are investing in a class rather than simply registering. And students and teachers are rewarded in native tokens for doing a good job, so that, in my opinion, would be a terrific sort of incentive.\n\nIf this goes through, it might have a major impact. It might be the start of a new era of education and learning, and I'm all for it.",
            "stickied": false,
            "comments": [
                {
                    "id": "hmp8mqq",
                    "author": "InTheEndEntropyWins",
                    "score": 5,
                    "created_utc": 1638301090.0,
                    "response": "This sounds kind of like gamifying education, which could be good, but sounds a bit like China's social score.",
                    "depth": 1,
                    "comments": [],
                    "sentiment_analysis": 0
                },
                {
                    "id": "hmowrq7",
                    "author": "FilmVsAnalytics",
                    "score": 5,
                    "created_utc": 1638296368.0,
                    "response": "Paying students and teachers currency to do a good job is... Pretty far out.",
                    "depth": 1,
                    "comments": [],
                    "sentiment_analysis": 0
                },
                {
                    "id": "hms5onl",
                    "author": "AgentMonkey47",
                    "score": 5,
                    "created_utc": 1638355354.0,
                    "response": "Cool but why do you need a blockchain?",
                    "depth": 1,
                    "comments": [],
                    "sentiment_analysis": 0
                }
            ],
            "sentiment_analysis": 0
        }
    ]
}