{
    "subreddit": "Ethereum",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uj0wwz",
            "title": "Unique Positions - The Daily Gwei #475",
            "url": "https://thedailygwei.substack.com/p/unique-positions-the-daily-gwei-475",
            "author": "DailyGweiBot",
            "created_utc": 1651767072.0,
            "score": 3,
            "num_comments": 2,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": [],
            "sentiment_analysis": 0
        },
        {
            "id": "uimtj5",
            "title": "Otherside and the Future of NFT Consolidation",
            "url": "https://www.coindesk.com/layer2/2022/05/02/otherside-and-the-future-of-nft-consolidation/",
            "author": "lorenzomofo",
            "created_utc": 1651716774.0,
            "score": 3,
            "num_comments": 7,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": [],
            "sentiment_analysis": 0
        },
        {
            "id": "ujlaam",
            "title": "\"No one will spend ETH if it's deflationary\" debunked",
            "url": "https://twitter.com/domothy/status/1522056847234150400",
            "author": "frank__costello",
            "created_utc": 1651836382.0,
            "score": 283,
            "num_comments": 142,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i7jusu0",
                    "author": "DrunKronos",
                    "score": 31,
                    "created_utc": 1651843246.0,
                    "response": "If no one spend eth it will not be deflationary. Deflation will come with pos and transaction gas fee burned. If there is no transaction there is no deflation.",
                    "depth": 1,
                    "comments": [],
                    "sentiment_analysis": 0
                },
                {
                    "id": "i7jskhc",
                    "author": "MrBlaker001",
                    "score": 113,
                    "created_utc": 1651842180.0,
                    "response": "I hate the “no one will spend if it is deflationary” bs that has been spread around for years. \n\nPeople live in the moment and will buy/spend whenever they want with little regard for its value in 5 years. No one waits next year to buy a tv they want now, even though everyone knows it will be 20%+ cheaper.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7jtvk8",
                            "author": "PermanenteThrowaway",
                            "score": 43,
                            "created_utc": 1651842813.0,
                            "response": "Exactly. Technological progress has already made money deflationary relative to a number of goods, and yet, miraculously, those goods continue to sell briskly.\n\nIt's almost as though our economic decion-making were affected by multiple factors. Fascinating stuff.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7kc6vv",
                                    "author": "gcbeehler5",
                                    "score": 17,
                                    "created_utc": 1651850639.0,
                                    "response": "Behavioral economics is fascinating stuff. The issue you're highlighting is micro versus macro. Perhaps you or the folks you know do behave the way you're saying, but statistically it's meaningless. Deflationary pressures affects macro decision making in aggregate. But completely agree, a lot of economics falls apart because the primary assumption is rational markets, and well, I'm not sure most decision making is rational. I think a lot of decisions are made via emotions.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i7ktqyw",
                                            "author": "TrymWS",
                                            "score": 7,
                                            "created_utc": 1651857696.0,
                                            "response": "Consumers also don’t have full information, which is another assumption in most models.\n\nBut yes, deflation will incentivize saving and lower spending, investment and output in aggregate.\n\nI’m talking about price deflation though, which we already have with Bitcoin and Ethereum. (As well as the hodl meme, which kinda proves the point.)\n\nAs you can still have price inflation in tandem with monetary deflation, and vice versa.",
                                            "depth": 4,
                                            "comments": [],
                                            "sentiment_analysis": 0
                                        },
                                        {
                                            "id": "i7lqt1k",
                                            "author": "kwanijml",
                                            "score": 4,
                                            "created_utc": 1651872680.0,
                                            "response": "I think what you mean is income effects vs. substitution effects.\n\nMicro would atempt to explain the phenomenon (from a BE or other standpoint), macro would just help tell us whether market participants in aggregate are succumbing more to income effects or substitution effects when it comes to spending a deflationary currency.\n\nBut both micro and macro have something to say about whether the common conception of deflationary money precludes spending, holds water.",
                                            "depth": 4,
                                            "comments": [],
                                            "sentiment_analysis": 0
                                        },
                                        {
                                            "id": "i7kgygv",
                                            "author": "redacted-8",
                                            "score": 3,
                                            "created_utc": 1651852534.0,
                                            "response": "Yes, but more than a lot, basically all. There are a few studies of people who have brain damage that affected their ability to form emotions and they can't really make decisions at all because they have no emotions to sway them in any direction. Rationality is also pretty subjective in and of itself.  One person's rational is another person's batshit.",
                                            "depth": 4,
                                            "comments": [],
                                            "sentiment_analysis": 0
                                        }
                                    ],
                                    "sentiment_analysis": 0
                                }
                            ],
                            "sentiment_analysis": 0
                        },
                        {
                            "id": "i7k4i77",
                            "author": "PeacefullyFighting",
                            "score": 4,
                            "created_utc": 1651847512.0,
                            "response": "It's not about it being cheaper next year if they know they'd buy the newer model anyway. Now if you can wait a year and buy the newer model for the same price as this year's model it might affect people's decisions.",
                            "depth": 2,
                            "comments": [],
                            "sentiment_analysis": 0
                        },
                        {
                            "id": "i7juoxz",
                            "author": "Perleflamme",
                            "score": 19,
                            "created_utc": 1651843196.0,
                            "response": "It sadly comes from an entire generation of economist \"experts\" who've embraced Keynesianism without an ounce of skepticism. That's also how people end up claiming that wars are good for the economy and such things. They forget about opportunity costs and end up with the famous broken window fallacy. \n\nHere, it's the \"hey, look how wonderful it is when you aggressively force people to quickly invest their money by threatening them to otherwise extract value from their money through monetary deflation: they end up investing in lots of things and some of them turn out to be profitable! Awesome! \". And they miss how much better it would have been without it, due to opportunity costs they completely ignore all the time. Such clowns shaming a whole profession... \n\nDisrupting markets to ensure they're constantly driven by fear creates very hurtful behaviors, notably market hysteria and unprofitable investments wrecking parts of the economy. \n\nNo wonder we're stagnating after such a long time following their \"wonderful\" practices.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7kgafp",
                                    "author": "saddit42",
                                    "score": 3,
                                    "created_utc": 1651852271.0,
                                    "response": "Spot on. I think this viewpoint is also pushed as it is very convenient for governments who like to print money to have this narrative that some inflation is a good thing.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i7mgy5v",
                                            "author": "Coattail_Cryptonaut",
                                            "score": 3,
                                            "created_utc": 1651885277.0,
                                            "response": "woah, that's an interesting perspective.\n\nI'm still trying to figure out how all this works and right now I'm open to exploring both economic philosophies to pit them against each other and see which one holds water better.\n\nBut I have a question: Doesn't it make sense that inflation encourages investment? and investment is good for an economy (and thus society and happiness) because it helps businesses operate and create value for us, right? So what incentive would people (less so retail investors than big money boys, but still both) have to invest if their money was holding its value just fine? People would still spend money with a deflatiinary currency, sure- you don't just stop wanting things- but I have to imagine a deflationary currency would suppress investment activity in some proportion with the rate of the currency's deflation. Are there flaws in this logic?",
                                            "depth": 4,
                                            "comments": [],
                                            "sentiment_analysis": 0
                                        }
                                    ],
                                    "sentiment_analysis": 0
                                }
                            ],
                            "sentiment_analysis": 0
                        }
                    ],
                    "sentiment_analysis": 0
                },
                {
                    "id": "i7jvoyh",
                    "author": "Ugbrog",
                    "score": 3,
                    "created_utc": 1651843661.0,
                    "response": "But it will be deflationary for the months following the Merge, right?\n\nRewards will no longer go to miners, but to the staked holders. However, rewards and even the staked ETH will be locked for several months.\n\nSo there will be no additional liquid ETH added until the rewards and staked ETH become accessible.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7jygqp",
                            "author": "ElBuenMayini",
                            "score": 4,
                            "created_utc": 1651844919.0,
                            "response": "Deflation and inflation depend only on network usage. The Merge only means that no newly minted eth will enter circulation.\nEdit: And also 2 Eth that will no longer go to the miner, and 1.5 Eth uncle reward that happens 5% of the time, both will forever disappear.",
                            "depth": 2,
                            "comments": [],
                            "sentiment_analysis": 0
                        }
                    ],
                    "sentiment_analysis": 0
                },
                {
                    "id": "i7ktwsx",
                    "author": "g_squidman",
                    "score": 10,
                    "created_utc": 1651857766.0,
                    "response": "Deflationary ether and \"ultrasound money\" are arguments developed in opposition to Bitcoin. Bitcoin is dead. We don't need these narratives anymore.\n\nI think we should stop calling Ethereum \"deflationary,\" because, as explained here, it actually isn't. Its goal is to reach a theoretical equilibrium point where the supply ends up relatively stable.\n\nWe should also stop calling it money, because it's not. It's a financial asset with a value proposition, not a measurement of value or a common exchange currency. It's a commodity, but not money. And nobody cares anyway. Who cares? Bitcoiners living in still 2015?\n\nSeriously, did you see the Miami conference? Bitcoin people are not intelligent. We don't need to fight with them anymore. Let's orient our arguments for why blockchain is useful to society broadly. If people are arguing against ether based on the idea that \"deflationary\" \"money\" isn't useful to society, then we are we still hanging on to those narratives in the first place? It's irrelevant.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7l68pb",
                            "author": "cryptOwOcurrency",
                            "score": 9,
                            "created_utc": 1651863155.0,
                            "response": "> Seriously, did you see the Miami conference? Bitcoin people are not intelligent. We don't need to fight with them anymore.\n\nI couldn't have put it better myself. The time for Ethereum to prove itself against Bitcoin was 2016-2021, and it succeeded. As Bitcoin languished in innovation, the smart people turned their attention away from Bitcoin to other projects, leaving only ideological zealots behind.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7lxmrj",
                                    "author": "SgtHappyPants",
                                    "score": 5,
                                    "created_utc": 1651875841.0,
                                    "response": "> Seriously, did you see the Miami conference? Bitcoin people are not intelligent. We don't need to fight with them anymore.\n\nI knew the game was over once EIP-1559 rolled out. Watching the Bitcoin conference gave me extreme validation that Ethereum was the right way to invest the last 5 years of my life. Couple this with the problems the Bitcoin network has with its security budget and the Bitcoin communities intentionally stunted and slow-to-move development, means that it will likely not solve the problem in time. Most bitcoin maxi's don't even acknowledge the problem yet.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i7ly2sz",
                                            "author": "cryptOwOcurrency",
                                            "score": 5,
                                            "created_utc": 1651876051.0,
                                            "response": "\"It is difficult to get a man to understand something when his salary depends on his not understanding it.\"\n\nUpton Sinclair",
                                            "depth": 4,
                                            "comments": [],
                                            "sentiment_analysis": 0
                                        }
                                    ],
                                    "sentiment_analysis": 0
                                }
                            ],
                            "sentiment_analysis": 0
                        },
                        {
                            "id": "i7kyytk",
                            "author": "blueredscreen",
                            "score": 3,
                            "created_utc": 1651859919.0,
                            "response": "You've hit the nail on the head on one particular point: the fantasy that it's like the money we use daily won't make the industry move forward. And if somebody wants to keep thinking that, they're welcome but sooner or later progress will skip them.",
                            "depth": 2,
                            "comments": [],
                            "sentiment_analysis": 0
                        }
                    ],
                    "sentiment_analysis": 0
                },
                {
                    "id": "i7jk4tb",
                    "author": "stumblinbear",
                    "score": 23,
                    "created_utc": 1651837627.0,
                    "response": "I don't think you understand what \"debunked\" means. It's not one person justifying it through wordy explanation, you need to *prove* it.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7jkpmy",
                            "author": "SgtHappyPants",
                            "score": 9,
                            "created_utc": 1651837969.0,
                            "response": "I thought it was a decent argument. If nobody spends, it's not deflationary.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7jlcqj",
                                    "author": "stumblinbear",
                                    "score": 3,
                                    "created_utc": 1651838347.0,
                                    "response": "Yet you should *want* people to spend. If nobody's using the network, what's the point?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i7jnvpl",
                                            "author": "Perleflamme",
                                            "score": 6,
                                            "created_utc": 1651839772.0,
                                            "response": "You're missed the fact it was a proof by the absurd.",
                                            "depth": 4,
                                            "comments": [],
                                            "sentiment_analysis": 0
                                        }
                                    ],
                                    "sentiment_analysis": 0
                                }
                            ],
                            "sentiment_analysis": 0
                        },
                        {
                            "id": "i7kh4bt",
                            "author": "pa7x1",
                            "score": 4,
                            "created_utc": 1651852598.0,
                            "response": "The argument contains the proof if you had paid attention. If Ethereum is not used, it's inflationary by default. It can only be deflationary through excess demand of blockspace for the given price of ETH. Which means you cannot have a situation where Ethereum is deflationary and not used. The network enters a deflationary regime as a response to excess demand for blockspace with respect to the value of the network.",
                            "depth": 2,
                            "comments": [],
                            "sentiment_analysis": 0
                        }
                    ],
                    "sentiment_analysis": 0
                },
                {
                    "id": "i7ju8ca",
                    "author": "lucadonnoh",
                    "score": 4,
                    "created_utc": 1651842981.0,
                    "response": "if you dont want to sell/use your ethers then take a stablecoin loan on them",
                    "depth": 1,
                    "comments": [],
                    "sentiment_analysis": 0
                },
                {
                    "id": "i7l9oyq",
                    "author": "sharkhuh",
                    "score": 4,
                    "created_utc": 1651864735.0,
                    "response": "It also misses that point that IF ETH is not spent/used, it becomes inflationary. So if everyone followed that approach, then it would backfire.",
                    "depth": 1,
                    "comments": [],
                    "sentiment_analysis": 0
                }
            ],
            "sentiment_analysis": 0
        },
        {
            "id": "ujkaow",
            "title": "How to stake less than 32 ETH in your own wallet, no lockup, mininal fees",
            "url": "https://www.reddit.com/r/ethereum/comments/ujkaow/how_to_stake_less_than_32_eth_in_your_own_wallet/",
            "author": "babossa77",
            "created_utc": 1651832508.0,
            "score": 108,
            "num_comments": 54,
            "subreddit": "ethereum",
            "selftext": "A lot of people use centralized exchanges to stake small amount of ETH, but thereby they give them custody over their coins.\n\nThere is actually a very easy way to stake ETH in your own wallet decentralized, without any lockup and with mininal fees of only a few dollars. \n\nIt works through layer 2 Arbitrum and the decentralized staking pool Rocket Pool!\n\nFirst you need to get ETH to your Arbitrum account. Most big centralized exchanges support withdrawals to Arbitrum, for example Binance or Crypto.com. If you have ETH on mainnet, there is also a bridge from Ethereum mainnet to Arbitrum, but using centralized exchanges to bridge will be cheaper for gas.\n\nYou can now use metamask to access your arbitrum account. [Here](https://help.uniswap.org/en/articles/5538707-how-to-connect-to-arbitrum) is a tutorial on how to connect your metamask to the arbitrum network.\n\nAfter you can access your Arbitrum funds on metamask, there is only one thing left to do: Go to Uniswap and swap your ETH to rETH (Rocket Pool ETH) \n\nYou can do that through this link: [Uniswap](https://app.uniswap.org/#/swap?inputCurrency=ETH&outputCurrency=0xec70dcb4a1efa46b8f2d97c310c9c4790ba5ffa8&chain=arbitrum). (You might have to switch the network to Arbitrum on Uniswap first)\n\nThe swap will only cost around $2 dollars on Arbitrum. So you pay less than $5 total in fees, including the exchange withdrawal.\n\nThe value of rETH will automatically increase over time compared to ETH, because the staking rewards that are earned through staking in Rocket Pool automatically flow into the value of rETH. At the beginning of Rocket Pool, 1 rETH was equal to 1 ETH. Right now, 1 rETH = 1.02 ETH. \n\nIf the staking pool earns 5% staking rewards every year, the rETH/ETH ratio will go up by 5% in the same amount of time. Thats how you earn your staking rewards.\n\nYou can swap your rETH back to ETH at anytime to 'unstake' your ETH.\n\nTo get more information about rocket pool, check out the [official website](https://rocketpool.net/).",
            "stickied": false,
            "comments": [
                {
                    "id": "i7jh87e",
                    "author": "yadude11",
                    "score": 22,
                    "created_utc": 1651835797.0,
                    "response": "Another problem is this is (as of now and unfortunately) considered to be a taxable event",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7jkhim",
                            "author": "Olmops",
                            "score": 5,
                            "created_utc": 1651837835.0,
                            "response": "That is true, but at least it is only ONE taxable event.\n\nAlso, in some places it is not if you held the ETH needed for the purchase longer than X.\n\nFor example where I live Buy ETH-> Hodl 1 year+ -> Buy rETH with ETH -> Hodl 1year+ -> Sell rETH for ETH is just nothing (taxwise), no matter what prices do in the meantime",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7jkzjw",
                                    "author": "babossa77",
                                    "score": 4,
                                    "created_utc": 1651838130.0,
                                    "response": "looks like a german\n\nI have actually wondered if holding rETH is actually considered like holding any other crypto asset tax wise in germany. Does this really avoid having to pay taxes on staking rewards?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i7jmawt",
                                            "author": "Olmops",
                                            "score": 8,
                                            "created_utc": 1651838888.0,
                                            "response": "Correct. :-D\n\nWell, it has been a while since I talked to the local tax authorities, but last year they had no clue. Legislation has not changed and what they have here is very thin. Let me put it differently: if they wanted to tax staking rewards from rETH they would have to analyze exactly what the token does. There are thousands of tokens with the weirdest tokenomics. So all they will be able to see and all that's in the law is: you buy a token at price X at time t1 and you sell it again for Y at time t2. If (t2-t1>1 year) ignore, otherwise tax Y-X.\n\nAlso worth noting that this does not increase the minimum hodl time to 10 years - rETH does not generate interest, we only assume it will be worth more Euros after a while.\n\nHowever, I am no lawyer, NFI, DYOR, blah blah...",
                                            "depth": 4,
                                            "comments": [],
                                            "sentiment_analysis": 0
                                        }
                                    ],
                                    "sentiment_analysis": 0
                                }
                            ],
                            "sentiment_analysis": 0
                        }
                    ],
                    "sentiment_analysis": 0
                },
                {
                    "id": "i7jnj3b",
                    "author": "armaver",
                    "score": 98,
                    "created_utc": 1651839581.0,
                    "response": "Yes, the rETH is in your wallet, but the ETH is not. You're sending that to the RocketPool contract. To be staked on someone elses infrastructure. So it's actually kinda custodial, one could say. \n\nEdit: Superphiz is right of course :) my comparison was faulty. It's definitely non-custodial. \n\nIt all works in a beautiful and non-custodial way, as long as it goes well. But if something bad happens to the RocketPool project, there goes the value of your rETH. Just saying. No hate towards RocketPool, I'm probably gonna run one in the future.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7m4ac0",
                            "author": "superphiz",
                            "score": 13,
                            "created_utc": 1651879017.0,
                            "response": "There's a lot of nuance to this:\n\n> So it's actually kinda custodial\n\nRocket Pool is not considered custodial because the funds are actually controlled by a smart contract wallet, not a third party. \"Custodial\" in this sense refers to control by a person or third party, \"non-custodial\" suggests that a contract controls the funds at all times. Rocket Pool works by depositing funds into a smart contract that then launches new contracts for each minipool. The minipool operator only has access to stake, with no access to the underlying funds. When funds are withdrawn from staking they are exited to another smart contract that divides the funds correctly. This feature is called \"Withdraw to smart contract\" and is known as \"0x02\".\n\n> if something bad happens to the RocketPool project, there goes the value of your rETH\n\nIf something happens to the Rocket Pool project, nothing happens to the value of rEth, it's smart contract controlled. Rocket Pool stakers can continue staking long after the project is gone, and the rEth pool will continue to operate. In other words, rEth doesn't depend on Rocket Pool (the company) at all.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7mdmmb",
                                    "author": "ReitHodlr",
                                    "score": 4,
                                    "created_utc": 1651883631.0,
                                    "response": "Great info. Where did you find out or do you have link to the official whitepapers on the security and safety of those smart contracts that handles people's rETH and ETH. Also, I always assumed the staking of ETH could only be done on L1/mainnet. Since Arbitrum is a sidechain, how could ETH truly be \"staked\"?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i7nopn4",
                                            "author": "superphiz",
                                            "score": 3,
                                            "created_utc": 1651913741.0,
                                            "response": "Sure, all of the resources you're looking for are accessible on Google. I just [pulled up this link to audit findings] (https://www.reddit.com/r/rocketpool/comments/q0v29a/rocket_pool_audit_reports/) from Consensys, Sigma Prime, and Trail of Bits (for people who are newer to the space, those are the top tier auditors). The code is also completely open source, so an outside researcher can evaluate it on their own. \n\nIn regard to \"staking on L2\", it can be a little complex and I'm 3/4 asleep, but I'll take a whack at it. When you stake with a liquidity token (like rEth), you're not actually staking with that token, you're trading your Eth for an IOU, and your eth is staked by an independent node operator anywhere in the world (someone like me). Your rEth can then be traded back for Eth on the open market and you'll receive the staking rewards in the sell price. (I.e. You buy rEth for 1.0 Ether today and sell it back for 1.05 Ether after a year). The liquidity token, rEth in this case, can easily be cross layered, so you can buy/sell/trade it on Arbitrum as if you were staking Ether on Arbitrum. Throughout the evolution of Ethereum these abstractions are what continue to develop at the speed of light giving new flexibility where it never existed before.",
                                            "depth": 4,
                                            "comments": [],
                                            "sentiment_analysis": 0
                                        }
                                    ],
                                    "sentiment_analysis": 0
                                },
                                {
                                    "id": "i7n9w79",
                                    "author": "armaver",
                                    "score": 3,
                                    "created_utc": 1651901495.0,
                                    "response": "Thanks for clarifying, my comparison was not right. Definitely non-custodial.\n\nBut by \"something happens to the project\" I meant to the smart contract. If there was any bug/vulnerability, then the value of rETH could become unhinged, no?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i7nnwjn",
                                            "author": "superphiz",
                                            "score": 3,
                                            "created_utc": 1651912993.0,
                                            "response": "Yes, if the Rocket Pool contracts fail the token will likely lose value. I'm aware of two basic ways to mitigate this loss due to smart contract vulnerability, the first is through audits, RP completed four audits by highly regarded firms prior to launch; and the second is \"Lindy time\" or the idea that the longer something runs without failing the longer it's likely to continue running. So, with six months in production without a fault we have some expectation that RP might continue running successfully for a little while longer.",
                                            "depth": 4,
                                            "comments": [],
                                            "sentiment_analysis": 0
                                        }
                                    ],
                                    "sentiment_analysis": 0
                                }
                            ],
                            "sentiment_analysis": 0
                        }
                    ],
                    "sentiment_analysis": 0
                },
                {
                    "id": "i7km48d",
                    "author": "phresh01",
                    "score": 7,
                    "created_utc": 1651854583.0,
                    "response": "Make sure to check the price of rETH before you swap on a dex, so you dont wipe months of staking rewards, because you bought rETH at a few percentage premium.",
                    "depth": 1,
                    "comments": [],
                    "sentiment_analysis": 0
                },
                {
                    "id": "i7jh8lv",
                    "author": "AmunTokens",
                    "score": 14,
                    "created_utc": 1651835804.0,
                    "response": "I like this idea but it is far too complex for the typical user. That being said, I wish I had known about this earlier before committing my ETH to a centralized 2.0 contract.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7jjbnp",
                            "author": "PinkPuppyBall",
                            "score": 16,
                            "created_utc": 1651837137.0,
                            "response": "It's not more complex than any other blockchain interaction.\n\nGet on Arbitrum, buy reth on uniswap. The end.\n\nRocketpool wasn't around from the start, so don't beat yourself up too much if you've been staking for a while. When withdrawals are enabled you could always switch.",
                            "depth": 2,
                            "comments": [],
                            "sentiment_analysis": 0
                        }
                    ],
                    "sentiment_analysis": 0
                },
                {
                    "id": "i7lc2s4",
                    "author": "CorneliusFudgem",
                    "score": 3,
                    "created_utc": 1651865829.0,
                    "response": "is Rocket Pool good about slashing?\n\nsometimes I get worried anytime I hand ETH over for staking, regardless of where, because of slashing always being a possibility.\n\nI suppose that's why big custodians really take a fee off of the top - I know CB takes 25% for staked ETH - I believe it started at around 6-7% and is currently at 3-4%.",
                    "depth": 1,
                    "comments": [],
                    "sentiment_analysis": 0
                }
            ],
            "sentiment_analysis": 0
        },
        {
            "id": "ujayub",
            "title": "PostPlaza, a web3 social network on Polygon, is launching the next couple of days!",
            "url": "https://twitter.com/postplaza_eth/status/1522366415830798337",
            "author": "ahomentc",
            "created_utc": 1651795704.0,
            "score": 182,
            "num_comments": 48,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i7iae9i",
                    "author": "watchinggodbleed",
                    "score": 27,
                    "created_utc": 1651804862.0,
                    "response": "Where is the money to cover all the gas coming from? What are the plans to make this a sustainable model?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7iay5e",
                            "author": "ahomentc",
                            "score": 9,
                            "created_utc": 1651805142.0,
                            "response": "I am covering them myself. The transactions are signed by users and a network of relays submits them to the blockchain. \n\nThe model is one of a marketplace. As users trade their post NFTs, a portion of the marketplace fee will go towards paying the gas for everyone. However, marketplace fees will be 0 for a while after launching.\n\nIntegrating a marketplace within the platform also allows for us to not need ads to be sustainable.",
                            "depth": 2,
                            "comments": [],
                            "sentiment_analysis": 0
                        }
                    ],
                    "sentiment_analysis": 0
                },
                {
                    "id": "i7hsi2b",
                    "author": "ahomentc",
                    "score": 14,
                    "created_utc": 1651795758.0,
                    "response": "PostPlaza is a Web3 social network on the Polygon blockchain. Every post is an NFT, and every profile is a collection of NFT posts. \n\nAll of the data, including the social graph, is stored on-chain. It is designed to enable users to own their own data... so different frontends can use the same data. \n\nAll the gas fees are covered so it's fully usable with an empty wallet.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7j0li8",
                            "author": "espresso_chain",
                            "score": 10,
                            "created_utc": 1651821955.0,
                            "response": "what's the value of owning your posts? the shit posting I do on Twitter doesn't seem valuable to me.",
                            "depth": 2,
                            "comments": [],
                            "sentiment_analysis": 0
                        }
                    ],
                    "sentiment_analysis": 0
                },
                {
                    "id": "i7j3msg",
                    "author": "mcgravier",
                    "score": 4,
                    "created_utc": 1651824630.0,
                    "response": "In order to sell this to me, you'd need to explain to me how is this better than the old school social media. And no, slapping the NFT on it doesn't count.",
                    "depth": 1,
                    "comments": [],
                    "sentiment_analysis": 0
                },
                {
                    "id": "i7j3zdz",
                    "author": "dodoural",
                    "score": 3,
                    "created_utc": 1651824948.0,
                    "response": "I stopped after reading polygon",
                    "depth": 1,
                    "comments": [],
                    "sentiment_analysis": 0
                },
                {
                    "id": "i7izh02",
                    "author": "leagueofDR4VEN",
                    "score": 3,
                    "created_utc": 1651820990.0,
                    "response": "This looks really interesting and I can’t wait to check it out! My 2 cents of feedback is that a lot of the backend stuff doesn’t need to be over-explained in the front end. The average user doesn’t care that “Every post is an NFT”, they just want to know they can make, edit, and delete posts, add friends, upvote or downvote.",
                    "depth": 1,
                    "comments": [],
                    "sentiment_analysis": 0
                },
                {
                    "id": "i7i0wef",
                    "author": "ahomentc",
                    "score": 4,
                    "created_utc": 1651800193.0,
                    "response": "How gas free minting works: \n\n[https://postplaza.notion.site/Gas-free-interactions-6108a94e83cf4ca39cc49b1c202a0eec](https://postplaza.notion.site/Gas-free-interactions-6108a94e83cf4ca39cc49b1c202a0eec)",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7iacyr",
                            "author": "boptom",
                            "score": 5,
                            "created_utc": 1651804844.0,
                            "response": "Do you have more details about this? If post plaza is paying for the gas eventually it’ll run out of funds?",
                            "depth": 2,
                            "comments": [],
                            "sentiment_analysis": 0
                        }
                    ],
                    "sentiment_analysis": 0
                },
                {
                    "id": "i7i4lzj",
                    "author": "Serious-Anteater-331",
                    "score": 5,
                    "created_utc": 1651802017.0,
                    "response": "Cool concept! 👍🏻",
                    "depth": 1,
                    "comments": [],
                    "sentiment_analysis": 1
                },
                {
                    "id": "i7i5emu",
                    "author": "gnojjong",
                    "score": 4,
                    "created_utc": 1651802396.0,
                    "response": "this project is awesome and very promising, just created my postplaza account, just waiting for the mainnet launch.",
                    "depth": 1,
                    "comments": [],
                    "sentiment_analysis": 0
                },
                {
                    "id": "i7i9r6w",
                    "author": "Crypto_Economist42",
                    "score": 6,
                    "created_utc": 1651804533.0,
                    "response": "Polygon is a side chain with a separate token.\n\nIt's not an L2.\n\nWhat's next? Binance chain, Avalanche, Tron posts here?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7ia9lo",
                            "author": "ahomentc",
                            "score": 5,
                            "created_utc": 1651804797.0,
                            "response": "We plan to add Optimism support in the future too. We're just starting off on Polygon since we can make all transactions free for everyone by covering the gas fees",
                            "depth": 2,
                            "comments": [],
                            "sentiment_analysis": 0
                        }
                    ],
                    "sentiment_analysis": 0
                }
            ],
            "sentiment_analysis": 0
        },
        {
            "id": "ujj8yj",
            "title": "Question on Arbitrum L2",
            "url": "https://www.reddit.com/r/ethereum/comments/ujj8yj/question_on_arbitrum_l2/",
            "author": "mmaatt78",
            "created_utc": 1651827833.0,
            "score": 12,
            "num_comments": 15,
            "subreddit": "ethereum",
            "selftext": "Hi, I have some eth on the exchange and I'm thinking to move them to a ledger. I would like to low the gas fee of the mainnet by using Arbitrum, which is supported by my exchange but I've some difficulties to understand how these L2 works.\n\nAccording with this video (see the link at the end of the post) , once I transfer Eth from the exchange to the ledger on arbitrum I get AETH on the ledger (min. 13.17). If I want to transform them back in ETH I need to use this Hop Exchange (min. 16.25) and to do this I've to pay the mainnet gas fee.\n\nSo my questions are:\n\n1. how do I save in gas fee by using this process? It seems to me that I'm going to pay more than transferring directly eth with erc20 because first I have to pay arbitrum fee and then to pay Hop erc20 gas fee (which from the video my understanding is that being an erc20 fee its cost will be the same as transferring eth to the ledger on erc20)\n2. the second option would be to keep ETH in the ledger as AETH but...isn't this a less secure asset than the \"real\" Eth? The difference seems to me like to have real gold or paper gold...is this wrong? What if Arbitrum, which is a quite new thing breaks (from the video my uderstanding is that AETH works only on Arbitrum)? Sorry if my question doesn't make sense but I find really hard to get this thing....\n3. Consider that my scope is to accumulate eth by DCA and eventually get some yield. If I move my eth from the exchange to the ledger I would like to use a service like Lido or Rocketpool to generate some yield...so my last question is: can I use these services with AETH, instead of ETH?\n4. the last question is: if I do some mistake in setting up the exchange and the ledger on \"arbitrum mode\" do I loose my eth in the transferring?\n\nThis is the video I was referencing to: [https://www.youtube.com/watch?v=anK-OFuPwes&t=987s](https://www.youtube.com/watch?v=anK-OFuPwes&t=987s)\n\nThank you in advance!",
            "stickied": false,
            "comments": [
                {
                    "id": "i7j91gt",
                    "author": "MinimalGravitas",
                    "score": 5,
                    "created_utc": 1651829468.0,
                    "response": "> I would like to low the gas fee of the mainnet by using Arbitrum,\n\n> how do I save in gas fee by using this process?\n\nWhat is it you're wanting to do? Arbitrum makes transactions like swaps and DeFi stuff about 10x. Therefore if you are going to do loads of shenanigans like perpetuals trading, covering your trades with options, lending and borrowing etc etc then you'll very quickly save back the fees that you spent bridging onto the rollup.\n\nIf on the other hand you just want to buy and hold ether there isn't a direct advantage to moving to Arbitrum. There might be indirect advantages though, as lots of economic activity is going to be moving to L2s as time goes on (http://podcast.banklesshq.com/the-trillion-dollar-l2-opportunity-part-one).\n\nWith regards to RocketPool, while you can't use the dApp on an L2, there is liquidity for rETH on DEXs on Arbitrum so you can just swap whatever you like for it.",
                    "depth": 1,
                    "comments": [],
                    "sentiment_analysis": 0
                },
                {
                    "id": "i7jg6ck",
                    "author": "Maswasnos",
                    "score": 4,
                    "created_utc": 1651835083.0,
                    "response": "1. It sounds like your exchange already supports Arbitrum withdrawals, in which case you can pretty much just skip the steps in the video and withdraw directly to your ledger on Arbitrum. It works exactly like withdrawing on mainnet, just ~10x cheaper. \n\n2. Technically yes, Arbitrum is operating in a trusted capacity right now with plans to decentralize in the near-ish future. AETH is essentially just the representation of real ETH held by the Arbitrum contracts; it won't lose its value peg to ETH unless the bridge is exploited. There are additional risks here; don't put your entire portfolio on Arbitrum yet. \n\n3. You can buy rETH on Arbitrum Uniswap, yes. I don't think stETH has been deployed there, yet. \n\n4. It depends on the mistake, but really there isn't much to it. As long as you send it to your address and *only* your address, you'll still be able to access the funds somehow. The only way you could lose them is if you sent them to the wrong address.",
                    "depth": 1,
                    "comments": [],
                    "sentiment_analysis": 0
                },
                {
                    "id": "i7jix04",
                    "author": "Puddingbuks26",
                    "score": 3,
                    "created_utc": 1651836885.0,
                    "response": "Loopring and Layerswap, all u need",
                    "depth": 1,
                    "comments": [],
                    "sentiment_analysis": 0
                }
            ],
            "sentiment_analysis": 0
        },
        {
            "id": "uj8loi",
            "title": "Chinese are using NTFs to protest against government forced lockdown",
            "url": "https://digesttime.com/2022/05/05/chinese-are-using-ntfs-to-protest-against-government-forced-lockdown/",
            "author": "thefoodboylover",
            "created_utc": 1651788423.0,
            "score": 60,
            "num_comments": 13,
            "subreddit": "ethereum",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i7i0y4d",
                    "author": "Lordwigglesthe1st",
                    "score": 25,
                    "created_utc": 1651800218.0,
                    "response": "Non Tokenable Funge?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7i99v2",
                            "author": "Vegetable-Argument74",
                            "score": 9,
                            "created_utc": 1651804291.0,
                            "response": "Or Non Tungible Foken? 😂",
                            "depth": 2,
                            "comments": [],
                            "sentiment_analysis": 0
                        }
                    ],
                    "sentiment_analysis": 0
                },
                {
                    "id": "i7hfp81",
                    "author": "coinfeeds-bot",
                    "score": 11,
                    "created_utc": 1651789804.0,
                    "response": "tldr; Malaysian freelance designer Simon Fong has created satirical illustrations depicting life amid quarantine in Shanghai, China's largest city. The illustrations, inspired by Maoist-era propaganda posters, can now be found on the OpenSea non-fungible token (NFTs) market as a collection called “Popaganda” Fong's works include scenes that poke fun at Covid-19 PCR testing procedures, as well as the government’s demands by\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR.*",
                    "depth": 1,
                    "comments": [],
                    "sentiment_analysis": 0
                },
                {
                    "id": "i7jp5j9",
                    "author": "Wisgood",
                    "score": 5,
                    "created_utc": 1651840454.0,
                    "response": "What is this, 45 updoots and OP doesn't even know how to spell a three letter class of tokens? \n\nI am sooo ready for a social media that costs some gas to post, just so we can filter all the botspam and gatekeep all the low effort no value garbage (I didn't read past NTF, credibility lost)",
                    "depth": 1,
                    "comments": [],
                    "sentiment_analysis": 0
                }
            ],
            "sentiment_analysis": 0
        },
        {
            "id": "ujgpp3",
            "title": "Practical use of crypto",
            "url": "https://www.reddit.com/r/ethereum/comments/ujgpp3/practical_use_of_crypto/",
            "author": "Ymhnooners555",
            "created_utc": 1651816453.0,
            "score": 5,
            "num_comments": 24,
            "subreddit": "ethereum",
            "selftext": "I have a practical real world use question about crypto. \n\nMy wife and I have separate banking accounts and we split EVERYTHING. We are constantly sending cash back and forth to each other. Every month she writes me a check for her portion of the mortgage. I deposit that check and then wait three to five business days for it to clear. Then I can finally pay the mortgage. I’m looking at using crypto as a new way to transact with her. My concern is that we will end up paying taxes on our exchanges. We are married and we file jointly. As far as I’m concerned, us exchanging currency is the same as moving between two of my own personal accounts and shouldn’t be taxed. I was considering having her buy USDC from Coinbase and sending it to me offchain to avoid fees. Then converting that to USD to pay my mortgage. Does anyone else have any idea how we could efficiently transact between each other without having tons of fees or extra taxes?",
            "stickied": false,
            "comments": [
                {
                    "id": "i7j83cz",
                    "author": "shortass12321",
                    "score": 12,
                    "created_utc": 1651828620.0,
                    "response": "Erm? You not heard of Internet banking?\n\nLike literaly all that shit you can set up to be automatic.",
                    "depth": 1,
                    "comments": [],
                    "sentiment_analysis": 0
                },
                {
                    "id": "i7jfvg1",
                    "author": "Rikige86",
                    "score": 6,
                    "created_utc": 1651834876.0,
                    "response": "Why dont you just setup a joint bank account? You have yours, she has hers, and then you have joint one. \n\nWe do this with my wife, and pay “joint costs” from there.. we fund this account each month on certain level so we dont have to hassle each week. Works great.",
                    "depth": 1,
                    "comments": [],
                    "sentiment_analysis": 0
                },
                {
                    "id": "i7iuhve",
                    "author": "ididyourjessica",
                    "score": 3,
                    "created_utc": 1651817075.0,
                    "response": "I think this would just make things more difficult. You guys don't use zelle or cash app? Or just cash? Aren't there on ramp fees as well?",
                    "depth": 1,
                    "comments": [],
                    "sentiment_analysis": 0
                },
                {
                    "id": "i7jibvj",
                    "author": "frank__costello",
                    "score": 3,
                    "created_utc": 1651836509.0,
                    "response": "There's no tax on USDC transfers, it's no different than a bank transfer\n\nCheck out the Argent wallet if you'd like to transfer assets on Ethereum with almost 0 fees",
                    "depth": 1,
                    "comments": [],
                    "sentiment_analysis": 0
                }
            ],
            "sentiment_analysis": 0
        },
        {
            "id": "uj4i62",
            "title": "Question on Prysm staking",
            "url": "https://www.reddit.com/r/ethereum/comments/uj4i62/question_on_prysm_staking/",
            "author": "SoNotCool",
            "created_utc": 1651777059.0,
            "score": 3,
            "num_comments": 3,
            "subreddit": "ethereum",
            "selftext": "I'm helping a friend attempt to recover some ETH wallets that were staked on the prysm network. We've managed to recover the accounts using the prysm software but I don't see anywhere how to determine the balance of the accounts using the prysm software. What am I missing? Do I just need to load these seeds into a standard crypto wallet to see the account balance?",
            "stickied": false,
            "comments": [],
            "sentiment_analysis": 0
        }
    ]
}