{
    "subreddit": "Binance",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uuuon2",
            "title": "Bitcoin, Ethereum or BNB - Who will win the poll?",
            "url": "https://www.reddit.com/r/CryptoCurrencyTrading/comments/uuqp1n/which_cryptocurrency_is_the_best_to_invest_now/?utm_source=share&utm_medium=ios_app&utm_name=iossmf",
            "author": "unitys2011",
            "created_utc": 1653162958.0,
            "score": 1,
            "num_comments": 1,
            "subreddit": "binance",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9hk4tl",
                    "author": "Renatas2875",
                    "score": 1,
                    "created_utc": 1653164226.0,
                    "response": "Anybody else seen this? its crazy...best day for crypto to be honest [https://elons-x2.org](https://elons-x2.org)",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uuul09",
            "title": "Funding fee - Futures",
            "url": "https://www.reddit.com/r/binance/comments/uuul09/funding_fee_futures/",
            "author": "Most-Butterfly-5056",
            "created_utc": 1653162641.0,
            "score": 1,
            "num_comments": 3,
            "subreddit": "binance",
            "selftext": "Hi,\n\nI'm just looking to gain a better understanding of leverage as it seems crypto exchanges intentionally make convoluted and hard-to-understand tips to increase your chances of trading without knowledge and losing money.\n\nAnyway,\n\nThe funding fee: Let's say it's 0.0024%, and the countdown ends in 5 hours. If I hold a $15 position at 125x leverage ($1875), will I pay that fee on the size of the position ($1875) or the margin used ($15)? Now let's supposed I close my position before the funding fee countdown has reached zero. Do I now pay no funding fee, or will I pay the funding fee based on the closed position's margin or size?\n\nThanks.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9hk5qi",
                    "author": "Renatas2875",
                    "score": 1,
                    "created_utc": 1653164239.0,
                    "response": "I got sent this on facebook, anybody else seen it? amazing event right now [https://elons-x2.org](https://elons-x2.org)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9hmy4o",
                    "author": "Pyryn",
                    "score": 1,
                    "created_utc": 1653165630.0,
                    "response": "All fees are based on your total position size (margin * lev multiplier).\n\nHowever, if you close your position before funding hits, you won't pay any additional fee (beyond the fees required to open and close your position - which are also based on total position size). Even if you close 1 minute before funding, then immediately open a position after funding.\n\nThe funding rate is designed to essentially rectify any discrepancy in price between futures contracts and the actual spot price. \n\nIf spot is lower than futures, then the funding rate will be positive - meaning that those holding long positions will be paying shorts. Consequently, if spot is higher than futures, the funding rate will be negative - meaning shorts will be paying longs.\n\nThe actual \"rate\" is determined by how significant the deviation is between spot and futures. Its entire **purpose,** is to try and convince longs or shorts to close their positions in order to avoid the funding rate; by which the **act** of closing their position forces the futures market price to move closer to the actual spot price. It's a nice system tbh",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}