{
    "subreddit": "Binance",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uycy59",
            "title": "reasons why terra Luna 2.0 is dead",
            "url": "https://www.reddit.com/r/binance/comments/uycy59/reasons_why_terra_luna_20_is_dead/",
            "author": "Old_Assistant_185",
            "created_utc": 1653586508.0,
            "score": 4,
            "num_comments": 9,
            "subreddit": "binance",
            "selftext": "-people only one want it to potentially get their money back which they have lost\n-you have to wait so long before you can sell your terra Luna\n-if you bought it post attack you get very little making your Holdings worthless\n-the owner the creator is still in charge\n-the hype may die because you have to wait so long before you can sell loads \n\nTerra Luna is dead. Terra Luna  classic may be worth something, if they burn tokens terra Luna classic may be worth more than terra 2.0",
            "stickied": false,
            "comments": [
                {
                    "id": "ia3nhlb",
                    "author": "Master-Monitor112",
                    "score": 1,
                    "created_utc": 1653592022.0,
                    "response": "I think that Lunar V2 will have a massive pump and dump and then probably never recover. Most big exchanges will not be listing V2. Coinbase said they will not be listing it.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia3p96e",
                            "author": "Old_Assistant_185",
                            "score": 1,
                            "created_utc": 1653592754.0,
                            "response": "Do kown- he only wants a new coin  so he can make some money back quicker. Terra classic will be longer.\n\n1) for the Terra 2.0 to go up there needs to be a significant amount of people buying it but with how long you have to wait before you get your full amount of coins I don't believe many people will be buying lost trust \n\n2) people are only interested in Terra 2.0 to make back some money they have lost. There isn't anything new about this coin or anything better.\n\n3) the people that bought the coin post crash the amount of new Luna they will get will be worthless these are the type of people that you would want to convince to buy more, but by making their coin worthless I don't think you can. At least with Terra classic they can make some money due to the volume of coins they have which means they will potentially buy more coins. \n\nIf you believe Terra 2.0 is good what's the point of holding terra classic. If you also believe terra classic will go down there is no point of holding even if you sold it you wouldn't make any money back. I don't believe anyone pre crash has enough coins to make their coins worth something. \n\nSo in the interest or making everyone else richer including themselves they should burn some of their coins.\n\nV2 is only suggested by do Kwon so he can potentially profit off the pump in the beginning or profit of a small pump. \n\nMost altcoins are shitcoins.  Plus people only buy crypto currencies to make money.\n\nBinnance only want the coin Terra 2.0 on there  platform because they have lost so much money off the old coin terra classic and they are also getting a large chunk from the new terra 2.0 .\n\nBinnace likes to make money off volume trading, even if that means trading a shitcoin they will happily have a shitcoin on their platform",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia3suym",
                    "author": "Lastkidpicked94",
                    "score": 1,
                    "created_utc": 1653594247.0,
                    "response": "My Luna is still staked on trust wallet from before the depeg, all of it . Is about 1k worth or 9 Luna . I guess I’m screwed now to even get the airdrop huh",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia3xj1a",
                            "author": "Old_Assistant_185",
                            "score": 1,
                            "created_utc": 1653596204.0,
                            "response": "No idea, we need people to burn Terra classic!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia3xzr9",
                                    "author": "mzperx_v1fun",
                                    "score": 1,
                                    "created_utc": 1653596402.0,
                                    "response": "Ok, you first",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "ia4gj0d",
                            "author": "Still_Lobster_8428",
                            "score": 1,
                            "created_utc": 1653604522.0,
                            "response": "No, pretty sure as a old holder, you get a 1:1 airdrop... So 9 LUNA v2...",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia4goyn",
                                    "author": "Lastkidpicked94",
                                    "score": 1,
                                    "created_utc": 1653604599.0,
                                    "response": "Ya but I don’t think I will get it into trust wallet I think you had to have your Luna in terra station wallet to get it",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia41fuc",
                    "author": "ImPinos",
                    "score": 1,
                    "created_utc": 1653597856.0,
                    "response": "That coin is dead, they just haven’t told him",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}