{
    "subreddit": "Binance",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "v160v9",
            "title": "Binance set to move into Europe",
            "url": "https://www.reddit.com/r/binance/comments/v160v9/binance_set_to_move_into_europe/",
            "author": "Moigis",
            "created_utc": 1653933841.0,
            "score": 27,
            "num_comments": 6,
            "subreddit": "binance",
            "selftext": "Exchange of cryptocurrencies Binance has registered as a virtual asset service provider with Organismo Agenti e Mediator, a regulatory body in Italy that keeps track of financial agents' licenses.\n\nThe acceptance of cryptocurrencies by the general public requires clear and effective regulation, \"Changpeng Zhao, CEO of Binance, stated in a statement. \"We appreciate the Ministry of Economy and Finance's and the team's work in defining and enforcing the rules for operating in Italy with complete openness.\n\nCoinDesk is a media outlet that works for the best journalistic standards and adheres to a stringent editorial norm. It is the leading source of news and information about cryptocurrencies, digital assets, and the future of money. Binance is a cryptocurrency exchange where users can purchase, sell, and trade cryptocurrencies like Bitcoin, Ethereum, Dogecoin, Faith Tribe, etc.\n\nDigital Currency Group's CoinDesk is an autonomous operational entity that invests in cryptocurrencies and blockchain businesses. Certain CoinDesk workers, particularly editorial staff, may earn DCG ownership in stock appreciation rights, which typically vest over a multi-year period, as part of their pay. Journalists from CoinDesk are not permitted to buy DCG shares outright.\n\nAfter being labeled \"unauthorised\" by the financial authority CONSOB in July, the company can now sell crypto services in Italy. Last year, Binance was also barred from selling derivatives to Italians. The decision comes only weeks after Binance received regulatory permission from the AMF in France and licenses in Bahrain and Dubai as part of its worldwide development.",
            "stickied": false,
            "comments": [
                {
                    "id": "ialxlgn",
                    "author": "anon221911",
                    "score": 1,
                    "created_utc": 1653958473.0,
                    "response": ">CoinDesk is a media outlet that works for the best journalistic standards\n\n😂",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}