{
    "subreddit": "Binance",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ux46gf",
            "title": "fruads gonna get sued",
            "url": "https://i.redd.it/i325c4szei191.jpg",
            "author": "Jacobrevell",
            "created_utc": 1653435457.0,
            "score": 0,
            "num_comments": 3,
            "subreddit": "binance",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9vnozq",
                    "author": "Expert-Hamster-3146",
                    "score": 1,
                    "created_utc": 1653440906.0,
                    "response": "“If there are money”\n\n“We thank you very much”\n\nTelling you to withdraw now or within x date\n\nThey’ve obviously caught people with this scam, how do people fall for this? It’s so obvious",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9w01nk",
                            "author": "Atsoc1993",
                            "score": 1,
                            "created_utc": 1653446747.0,
                            "response": "I have no idea what I’m looking at… what am I looking at? Why is his gf in the post…",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "ux46og",
            "title": "Stolen BNB",
            "url": "https://www.reddit.com/r/binance/comments/ux46og/stolen_bnb/",
            "author": "Furranky",
            "created_utc": 1653435475.0,
            "score": 1,
            "num_comments": 20,
            "subreddit": "binance",
            "selftext": "This is just a story that happened about 20 hours ago as of writing, I've used metamask since around January, and I have used it mostly to dip my toes in the world of crytpo, now I checked in today my wallet balance after login in on my metamask wallet and noticed that my BNB balance was 0, I proceded to check on bscan in case it was just a bug or a glitch... it wasn't turns out my BNB was transferred to another wallet (0x3a1b182b9EA644E393578955C061AA383a9302C7).\n\n20 hours ago I was at work so I know there was no way of me doing this by accident hence the reason why I said it was stolen. While the amount stolen was mostly insignificant, about 9usd worth, it is still an annoyance having a balance of 0 since that makes me unable to pay fees until I buy more.\n\nIs there a lesson to learn from this? besides buying a hardware wallet... TXN hash is 0x83f8bbdf3c5bbcd7f8fc5e29796d5112b49a8221be21ca63ff661311421828da in case someone wants to see it, not sure if this would help anyone in anyway but yeh, just wanted to share o/",
            "stickied": false,
            "comments": [
                {
                    "id": "i9x1qmv",
                    "author": "BinanceCSHelp",
                    "score": 1,
                    "created_utc": 1653473517.0,
                    "response": "Hello there, we are so sorry for what happened to you. Firstly we so suggest you to reach the Metamask team to secure your wallet first. Furthermore, you may check more security tips via [https://www.binance.com/en/support/faq/c-7?navId=7#26](https://www.binance.com/en/support/faq/c-7?navId=7#26) posted on Binance website. Hope this can help. Should you have any further questions please feel free to reach us anytime. Kind regards.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9vnhd1",
                    "author": "RubberyTheology",
                    "score": 3,
                    "created_utc": 1653440805.0,
                    "response": "The link you sent is also a scam\nLink \n\nFucking scammer y’all are  piece of shit",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9vqi98",
                            "author": "Furranky",
                            "score": 2,
                            "created_utc": 1653442249.0,
                            "response": "I didn't send any links :c",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9vqpsm",
                                    "author": "RubberyTheology",
                                    "score": 3,
                                    "created_utc": 1653442351.0,
                                    "response": "Not you I was referring to tall_run2814 the link he sent it is a scam link nobody should open it",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9w1384",
                                            "author": "Furranky",
                                            "score": 3,
                                            "created_utc": 1653447254.0,
                                            "response": "guess I'll add it to my list of scams.. geez those come by the dozen it seems :/",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i9vw4pr",
                                            "author": "marvinrabbit",
                                            "score": 1,
                                            "created_utc": 1653444889.0,
                                            "response": "That would have been much more apparent if you had replied in that chain and made the \"you\" that person and not OP.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9vd4vh",
                    "author": "jevolution",
                    "score": 1,
                    "created_utc": 1653435867.0,
                    "response": "Surely there is a lesson to be learnt. What have you used this wallet for in the past (think exchanges, dapps etc) and how did you store your seed phrase?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9vem0c",
                            "author": "Furranky",
                            "score": 1,
                            "created_utc": 1653436568.0,
                            "response": "seed phrase I only having it typed physically in a paper sheet in my home drawer, as for exchanges and dapps, I've used it on pancakeswap, I used it for a couple of nft games, bombcrypto, luna rush and space crypto (regret this one) and that's all I can remember tbh",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9x9cbb",
                    "author": "Still_Not-Sure",
                    "score": 1,
                    "created_utc": 1653478951.0,
                    "response": "I’d suggest get an authenticator and do 2FA…. Get a good email. . Proton Mail is pretty good.. If someone changes your password.. they make your older emails unnopenable. If you pay it’s even better. Use VPN, that’s like basic.. Proton mail has a VPN.. Although I suggest getting a VPN from some shady country. \n\nCold wallet is best\n\nGet a new Wallet.. Don’t use the at one again.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9vffbz",
                    "author": "Tall_Run_2814",
                    "score": -6,
                    "created_utc": 1653436955.0,
                    "response": "Wallets cannot be hacked you either:\n\n1. Gave your seed to someone or keep it stored on an electronic device that can be hacked\n2. Connected your wallet to a shady site and approved a contract that gave them access to withdraw your crypto \n\nBurn that wallet and never use it again and always use a site like [https://app.unrekt.net/](https://app.unrekt.net/) to revoke your smart contracts after you connect your wallet",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}