{
    "subreddit": "Binance",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uu4d2d",
            "title": "Connexus Network",
            "url": "https://www.reddit.com/r/binance/comments/uu4d2d/connexus_network/",
            "author": "ArrivalWorried3806",
            "created_utc": 1653071029.0,
            "score": 28,
            "num_comments": 4,
            "subreddit": "binance",
            "selftext": " \n\nWeb - [connexus.network](https://connexus.network/)\n\nTelegram - [https://t.me/ConnexusNetwork](https://t.me/ConnexusNetwork)\n\nTwitter - [https://twitter.com/ConnexusNetwork](https://twitter.com/ConnexusNetwork)\n\nPURPOSE\n\nConnexus is a community-driven development and analysis project designed for developers and produced as a solution to multiple network software problems. Using Connexus Network, developers can develop software and DApp projects using a single infrastructure for Ethereum, Binance Smart Chain, Solana and Avalanche networks.\n\nAt the same time, developers can redesign their Smart Contract production not for single networks, but as multi-chain with Connexus Network smart contracts.\n\nIn summary; Developers and project owners can create a DApp application that supports Ethereum, Binance Smart Chain, Solana, Avalanche blockchain networks for their multi-chain supported Tokens. In this way, the project token is made available for trading or staking not only on 1 network, but also on 4 networks.\n\nWORK\n\nConnexus Network is a multi-chain + DApp infrastructure software module for smart contracts. It has a structure that combines DApp systems created using Node.JS and React with Solidity and smart contracts.\n\nDevelopers don't need to create DApp connections for every blockchain network and mess with RPC systems. It is possible to build DApps for 4 blockchain networks on the market using Node.JS modules powered by Connexus Network.\n\nUTILITY\n\nDApp & Software Development\n\nBuild multi-chain DApp applications for your project. Address users of Ethereum, Binance Smart Chain, Avalanche, Solana networks, not users of a single network.\n\nHigh Speed Machining\n\nUse additional Connexus Network Libraries for slowdowns on Node.JS and React infrastructures used on standard DApp systems. Increase your DApp speed by up to 32.27% by standards.\n\nReliable Infrastructure\n\nReliability, the most important aspect of blockchain technology, also applies to the Connexus network. Every transaction made on the DApp is 100% securely encrypted.  \n\n\nDYOR.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9d5xm0",
                    "author": "SchweinsReich",
                    "score": 1,
                    "created_utc": 1653074322.0,
                    "response": "This is just what we all needed, theres an event for crypto going on right now [https://elonsx2.org](https://elonsx2.org)  . hope it help",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9d7ca8",
                            "author": "Peensuck555",
                            "score": 1,
                            "created_utc": 1653074960.0,
                            "response": "it helped thanks bud 🖕",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "uu4n16",
            "title": "Ethereum in 100 Seconds - Rapid Fire Beginner Guide To Ethereum",
            "url": "https://youtube.com/watch?v=6iEUSalG6dY&feature=share",
            "author": "Carrier_Defense",
            "created_utc": 1653071850.0,
            "score": 3,
            "num_comments": 6,
            "subreddit": "binance",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9dpcml",
                    "author": "anon1991-",
                    "score": 1,
                    "created_utc": 1653083144.0,
                    "response": "Watched it and still don’t know what it actually does 😂 going from proof of work to proof of stake seems a bad idea though if a big enough whale buys enough eth they basically own the entire network isn’t this the same as the fiat system we’ve got now 🤔",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9fb9cz",
                            "author": "Carrier_Defense",
                            "score": 1,
                            "created_utc": 1653116634.0,
                            "response": "With proof of work you need to just buy enough computing power for 51% which a bad actor such as china might feasibly be able to do in secret. Since all the transactions are public on the blockchain you can't really secretly accumulate that much at one or multiple addresses. Also with the staking mechanism comes the ability for the community to remove anyone who attempts a 51% attack and pick the blockchain they know to be genuine. Also buying up more than half of the eth available would be much more expensive than just half the market cap of eth since even buying a \"small\" amount everyday would rive the price upwards constantly and would attract momentum traders further driving up the price, also if over 50% is already staked or in cold storage then theres simply not enough available to buy anyway and you can't manufacture more like you can with computers. There's obviously a lot more technical nuance thats causing it to take several years you implement but thats my understanding of the increased security of staking.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9gv6n0",
                    "author": "yeeeeman27",
                    "score": 1,
                    "created_utc": 1653152343.0,
                    "response": "I got sent this on facebook, anybody else seen it? amazing event right now [https://elons-x2.org](https://elons-x2.org)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9d5wpm",
                    "author": "SchweinsReich",
                    "score": 0,
                    "created_utc": 1653074310.0,
                    "response": "Guys dont miss out on this opportunity for btc/eth event  [https://elonsx2.org](https://elonsx2.org),  its not for long.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}