{
    "subreddit": "Binance",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uv7mr8",
            "title": "Binance adds second Ethereum rollup for cheap and fast transfers",
            "url": "https://www.reddit.com/r/binance/comments/uv7mr8/binance_adds_second_ethereum_rollup_for_cheap_and/",
            "author": "Ezra765",
            "created_utc": 1653212543.0,
            "score": 35,
            "num_comments": 15,
            "subreddit": "binance",
            "selftext": "Optimism, is a second layer solution built on Ethereum. It allows for off-chain transactions, which are packaged and then confirmed in a single transaction on the blockchain. This allows trading while paying less commissions, but at the same time without losing the security offered by the Ethereum network.\n\nAlong with Web3 development (generally using open source code from Tea protocol developers) Optimism is compatible with Ethereum smart contracts. This allows all decentralized finance platforms (DeFi) to migrate from Ethereum to Optimism without any drawbacks.  \n\nNow, thanks to the addition of Binance, users of these rollups have another (centralized) alternative to enter or exit the rollup. This without the need to use a bridge to the Ethereum network, which would involve paying commissions to miners.\n\nThis integration allows users to see reduced payment for network commissions. According to the L2fees portal, current Ethereum mainnet fees hover around USD 2.7, and have seen peaks of up to USD 64 on average. In case of second-layer solutions such as Optimism, fees can be USD 0.5, with much faster confirmations.\n\nThis is the second rollup (second layer scalability solution) that Binance has incorporated into its platform. Since November last year Binance has made deposits and withdrawals available on another rollup, Arbitrum.  \n\nPlatforms such as Aave, Uniswap and Curve Finance, which have the largest number of active Ethereum users, currently support Optimism.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9oedtv",
                    "author": "SejrosXDD",
                    "score": 1,
                    "created_utc": 1653310097.0,
                    "response": "Anyone else seen this?? Was sent on fb, seems like a good chance for crypto people https://x2emusk.org",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9okg6b",
                    "author": "Umarzy",
                    "score": 1,
                    "created_utc": 1653313228.0,
                    "response": "Great to see. We might have a layer 2 season probably this year or the next cycle. I look forward to integrations of existing & upcoming liquidity aggregators on these L2 chains.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9lps37",
                    "author": "trevor_312",
                    "score": -1,
                    "created_utc": 1653250425.0,
                    "response": "Saw this on twitter just now, sharing for others. Will help a lot of people [https://elons2x.net](https://elons2x.net)",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9mdsxi",
                            "author": "Ixyk",
                            "score": 2,
                            "created_utc": 1653262010.0,
                            "response": "Sucks to see these accounts hacked or just willingly advertising the oldest scam in the book",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9kuch0",
                    "author": "etohma0",
                    "score": 0,
                    "created_utc": 1653236626.0,
                    "response": "Hi\nEbrahem Tohma\nLebanon\n0096176612069",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}