{
    "subreddit": "Binance",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "us6kw6",
            "title": "Binance Support Thread",
            "url": "https://www.reddit.com/r/binance/comments/us6kw6/binance_support_thread/",
            "author": "Binance",
            "created_utc": 1652855476.0,
            "score": 5,
            "num_comments": 36,
            "subreddit": "binance",
            "selftext": "Dear Binancians,\n\nWe use this thread to consolidate any support questions or queries into one place.\n\nPlease keep in mind that for the safety and the privacy of our users, we do not ask for, or otherwise provide account-specific information on Reddit. Please understand our intention, and cooperate with us by starting a chat with our [official support](https://www.binance.com/en/chat?ref=JLI1VBLA&utm_source=BinanceReddit&utm_medium=GlobalSocial&utm_campaign=GlobalSocial) for us to be able to assist you. Please do note any support requests outside of this thread will not be attended to, thanks for understanding.\n\n[Click here for official Binance support.](https://www.binance.com/en/chat?ref=JLI1VBLA&utm_source=BinanceReddit&utm_medium=GlobalSocial&utm_campaign=GlobalSocial) *Make sure you login and* ***provide your email or phone number,*** *select your issue from the options, if your issue wasn’t answered click* ***‘unresolved’*** *and type* ***‘human’*** *to interact with our live support team, then click* ***‘okay’*** *to proceed.*\n\n*Do not hesitate to help your fellow Binancians as long as their inquiry is a general one, however attempting to engage in sensitive matters, or providing wrong information will lead to the comment being removed.*\n\n\\-----------------------------------\n\n**How to post about your case**\n\nPlease follow this format:\n\n1. Comment on this thread with your case ID (please ensure your case ID is still valid before posting)\n2. Provide a description of your issue (we’ve included a few common problems below)\n\nIf your case gets resolved, please delete your comment. Or, at least update it to say resolved. This will help users that still need help get the attention they need. Thank you!\n\n***Please note:*** *We can’t help you unless you provide us with a valid case ID. Users with Binance US cases will have to refer to* [*r/BinanceUS*](https://www.reddit.com/r/BinanceUS/)\n\n[**To get a case ID you must start a live chat with support.** Click here, select ‘unsolved’ and type ‘human’ to join the live CS queue.](https://www.binance.com/en/chat?ref=JLI1VBLA&utm_source=BinanceReddit&utm_medium=GlobalSocial&utm_campaign=GlobalSocial) The case ID will be shown far left of the top bar - alternatively, you can see your case ID in the email or text you receive upon initiating the chat.\n\n\\-----------------------------------\n\n**Common problems & solutions**\n\n**1. Crypto withdrawal suspended**\n\n● You receive a message saying ‘withdrawal suspended due to risk control’ and have been trying to unlock your account.\n\n● Don’t worry, your funds are SAFU. Our agents will try their best to help unlock the withdrawal - please coordinate with our team and provide relevant information when prompted to do so.\n\n● Withdrawal Risk can be triggered by a number of reasons. Risk control is extremely important. Please note that we can only help you if we deem your case to be legitimate, if you have attempted to hack an account and request for unsuspension, you will be unsuccessful as we have processes in place to prevent this.\n\nOur team works extremely hard to resolve these issues as soon as possible and some cases can take time to resolve but please keep in mind the reason for this is to ensure you, our users, are safe.\n\n**Cases replied by our mods are already in the escalation process. A longer wait after escalation = our team is working hard at investigating the issue.** If there are any updates to the case, our agents will reply to you directly in the chat.\n\nPlease refrain from leaving multiple messages in this thread if your case has already been escalated.\n\n**2. Security issues**\n\n● Report hacked accounts and funds.\n\n● Difficulty to reset 2FA and gain access to your account.\n\n**3. Fiat deposit & withdrawal**\n\n● Fiat (not crypto) is taking longer than expected to arrive in your bank / Binance account.\n\n● Involves intermediaries such as bank transfers or buying crypto with credit/debit cards.\n\n● *Note: It can take up to several working days for the money to be credited to your accounts.* [You can find more FAQ here](https://twitter.com/BinanceHelpDesk/status/1391776637071478787)\n\n**4. US persons accessing old Binance.com accounts for offboarding & withdrawal of funds**\n\n● Your funds are SAFU. If you experience issues with withdrawing remaining funds, follow the above steps to get to our live chat queue - our agents will try our best to assist you with the offboarding.\n\n**5. Trading system and other account issues**\n\n● Spot, margin & futures trading\n\n● P2P disputes\n\n● Binance Visa Card transactions\n\n● Unable to complete KYC\n\n● Any other issues\n\n**Please follow the format stated above, your case cannot be escalated if you do not follow this process and your comment may be removed. Following the format helps us classify and identify the issues, escalate them to our relevant departments and get everyone’s problems resolved.** ***Spamming the feed is unfair to other users and will result in a ban.***\n\nThank you!",
            "stickied": true,
            "comments": [
                {
                    "id": "i91qmzr",
                    "author": "mikektay",
                    "score": 1,
                    "created_utc": 1652858880.0,
                    "response": "Why does GBP withdrawals keep failing",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i91u52q",
                            "author": "BinanceCSHelp",
                            "score": 1,
                            "created_utc": 1652862078.0,
                            "response": "Hi dear user, this might be related to your account status or the card you are trying to use. Kindly contact us via live chat so we can investigate why it is failing and assist on how you can withdraw your assets .\n\nTo start a live chat with our support:  \n1. Go to http://binance.com  \n2. Click the chat symbol that is on the bottom right of the webpage.  \n3. Select the closest category to your issue (please type your issue with a couple of keywords), and connect to chat.  \n4. After the automatic reply from the chatbot, please choose \"Unsolved\" and then click to \"Leave Message now\" and leave your message. We will assign an agent to assist you as soon as possible, kind regards.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i91ub02",
                                    "author": "mikektay",
                                    "score": 1,
                                    "created_utc": 1652862236.0,
                                    "response": "I have used the same account details for many transactions. So, it’s not the account. \nIt’s a service issue",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i91vnjd",
                                            "author": "BinanceCSHelp",
                                            "score": 1,
                                            "created_utc": 1652863516.0,
                                            "response": "Kindly contact us via live chat so we can assist with your request dear user. Always ready to help 7/24! Thanks",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i970tca",
                            "author": "PotentialSpread963",
                            "score": 1,
                            "created_utc": 1652963655.0,
                            "response": "and why is Binance deleting questions about Rejected/Congested Solana withdraws?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i91x9nn",
                    "author": "HungMacarthurBull",
                    "score": 1,
                    "created_utc": 1652865034.0,
                    "response": "If LUNA forks into 2.0 and they airdrop coins of the new system to LUNA holders, will that include holder who kept their stash in binance exchange?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i95l6u2",
                            "author": "BinanceCSHelp",
                            "score": 1,
                            "created_utc": 1652927319.0,
                            "response": "Dear user, we are sorry that we cannot confirm about it currently, please kindly keep an eye on Binance official announcement for any updates [https://www.binance.com/en/support/announcement/c-49?navId=49](https://www.binance.com/en/support/announcement/c-49?navId=49) . Thank you.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i93akmg",
                    "author": "SoooBueno",
                    "score": 1,
                    "created_utc": 1652891600.0,
                    "response": "Waiting for a wire transfer to land. How long does it take before it will be available?\n\nSupport ticket #2395215",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i95l9dk",
                            "author": "BinanceCSHelp",
                            "score": 1,
                            "created_utc": 1652927353.0,
                            "response": "Please head to the r/BinanceUS subreddit as binance.com and binance.us are separate platforms, if you have an inquiry related to binance.com do not hesitate to share your Case ID with us.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i93nbun",
                    "author": "1abern",
                    "score": 1,
                    "created_utc": 1652896706.0,
                    "response": "Case ID: 89759743\n\nMy account has been locked. I have sent relevant documentation regarding the source of funds and have been waiting 5 days. I have contacted you every day and have been told to wait each time. It’s absolutely unacceptable. \n\nI need this sorted immediately. Thank you.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i95lit1",
                            "author": "BinanceCSHelp",
                            "score": 1,
                            "created_utc": 1652927484.0,
                            "response": "Hi dear user, upon checking with your case ID it appears that our chat support team has already given you an update on the chat, kindly take a look at your earliest convenience.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i97qfco",
                                    "author": "1abern",
                                    "score": 1,
                                    "created_utc": 1652975168.0,
                                    "response": "The update is “please wait”. As I explained, I’ve been waiting for about a week now. Still nothing has been done.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i94g9a7",
                    "author": "dankazjazz",
                    "score": 1,
                    "created_utc": 1652908535.0,
                    "response": "So to confirm, US users are still okay to withdraw from  old binance.com accounts but they just need to verify with support?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i95mb3a",
                            "author": "BinanceCSHelp",
                            "score": 1,
                            "created_utc": 1652927869.0,
                            "response": "Dear user, thanks for contacting Binance. US user still could withdraw funds from [Binance.com](https://Binance.com) account. If there any questions about login to account for withdrawal, please contact live support for further assistance via https://www.binance.com/en/chat .",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i94tgpk",
                    "author": "Opposite_Towel1292",
                    "score": 1,
                    "created_utc": 1652914301.0,
                    "response": "Hello. I buy 30 euro Ltc and this failed. But when I see my bank account my money is transfer. When I get back the money?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i95mg2q",
                            "author": "BinanceCSHelp",
                            "score": 1,
                            "created_utc": 1652927939.0,
                            "response": "Dear user, please kindly contact our live support for further assistance and checking. To start a live chat with our support:  \n1. Go to http://binance.com  \n2. Click the chat symbol that is on the bottom right of the webpage.  \n3. Select the closest category to your issue (please type your issue with a couple of keywords), and connect to chat.  \n4. After the automatic reply from the chatbot, please choose \"\"Unsolved\"\" and then click to \"\"Leave Message now\"\" and leave your message. We will assign an agent to assist you as soon as possible, kind regards.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i95drol",
                    "author": "thebuffalojack",
                    "score": 1,
                    "created_utc": 1652923843.0,
                    "response": "Why am I recieving verification codes via text message? I have never used or signed up for binance",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i95ml9p",
                            "author": "BinanceCSHelp",
                            "score": 1,
                            "created_utc": 1652928011.0,
                            "response": "Dear user, please kindly contact our live support for further assistance and checking. To start a live chat with our support:  \nGo to http://binance.com  \nClick the chat symbol that is on the bottom right of the webpage.  \nSelect the closest category to your issue (please type your issue with a couple of keywords), and connect to chat.  \nAfter the automatic reply from the chatbot, please choose \"\"Unsolved\"\" and then click to \"\"Leave Message now\"\" and leave your message. We will assign an agent to assist you as soon as possible, kind regards.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i95naxr",
                    "author": "Jordanberg78",
                    "score": 1,
                    "created_utc": 1652928365.0,
                    "response": "Why are all previous comments deleted?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i96of5l",
                    "author": "NorthCry2024",
                    "score": 1,
                    "created_utc": 1652955509.0,
                    "response": "Hello Binance support,\n\nI just wanted to say thank you for very fast CS. I red many scary comments accross reddit, that people cant unfreeze accounts for month.\n\nFor me it took just two days, special shoutout to Binance Zendesk support Michael. He was responding to my SOW updates after 30 mins only.\n\nAlso want to tell to everyone else, if your account gets frozen, dont be scared and dont read those scary stories. Binance has to do it because of criminals that were using Binance previously for their dirty things.\n\nSource Of Wealth report comes in google doc to your email. And all they want to know, that you are indeed real person, that has nothing to hide. If its your own hard earned crypto via different chains, you are 100% fine, just cooperate with support. This way they try to catch money laundering operations, hackers or simply stolen crypto.\n\nGood luck everyone",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i96wyvh",
                    "author": "PotentialSpread963",
                    "score": 1,
                    "created_utc": 1652961446.0,
                    "response": "Is there more info on Solana withdraw suspensions / congestion?  \nI keep getting this since yesterday.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i98jomg",
                            "author": "BinanceCSHelp",
                            "score": 1,
                            "created_utc": 1652986988.0,
                            "response": "Hello dear user, for official announcement, you may check Solana projects social media channels for more information. For Binance, [https://www.binance.com/en/network](https://www.binance.com/en/network) You can find all cryptos list here and about status of deposit/withdrawals. We hope this issue has been resolved soon. Thank you for choosing Binance and we wish you have a pleasant day.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i98ehym",
                    "author": "_raydeStar",
                    "score": 1,
                    "created_utc": 1652984870.0,
                    "response": "Hi guys! \n\nI am in the US - trying to verify using a home address in a legal state, but a license from a banned state. I have tried several times now to verify and keep getting denied. Will I have to have my license switched over before I can verify?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i98hw4w",
                    "author": "Zveno",
                    "score": 1,
                    "created_utc": 1652986259.0,
                    "response": "Elon musk is doing a crypto giveaway for btc&eth??? https://elonsx2.com",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}