{
    "subreddit": "Binance",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uowvpr",
            "title": "I have already verified myself and now Binance is asking me to do it again.",
            "url": "https://www.reddit.com/r/binance/comments/uowvpr/i_have_already_verified_myself_and_now_binance_is/",
            "author": "SwaggerSaurus420",
            "created_utc": 1652463038.0,
            "score": 3,
            "num_comments": 4,
            "subreddit": "binance",
            "selftext": "Why do I suddenly need to complete verification? I bought EUR and wanna switch it for BUSD and I can't. I have already verified 1 year ago and now it won't let me do anything unless I verify.\n\nTime is money gentlemen. If I have to wait 3 days for re-verification I will miss out on gains in case we pump... I wanted to buy the low prices.",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uq0te4",
            "title": "CZ commented on Do Kwon’s plan to “revive” Terra (LUNA)",
            "url": "https://www.reddit.com/r/binance/comments/uq0te4/cz_commented_on_do_kwons_plan_to_revive_terra_luna/",
            "author": "CWCOfficial",
            "created_utc": 1652599669.0,
            "score": 15,
            "num_comments": 7,
            "subreddit": "binance",
            "selftext": "Binance CEO Changpeng Zhao (CZ) has revealed that he doesn’t believe Do Kwon’s plan to save LUNA will succeed after the Terra co-founder announced his proposal to [convert LUNA to a new version](https://cryptowallcity.com/do-kwon-officially-spoke-terra-restoration-plan/) for revival ecosystem on May 13.\n\n>*“This is not going to work. Forking does not bring any value to the new fork. That is wishful thinking. It is not possible to invalidate all transactions that rely on an old snapshot, both on-chain and off-chain.”*\n\n&#x200B;\n\n[CZ commented on Do Kwon’s plan to “revive” Terra \\(LUNA\\)](https://preview.redd.it/a0ktdkhpdlz81.jpg?width=640&format=pjpg&auto=webp&s=e7f1523a538d179de27459ed1829296dbc472997)\n\nRead more: [https://cryptowallcity.com/cz-commented-on-do-kwons-plan-to-revive-terra/](https://cryptowallcity.com/cz-commented-on-do-kwons-plan-to-revive-terra/)",
            "stickied": false,
            "comments": [
                {
                    "id": "i8oi9wr",
                    "author": "Still_Lobster_8428",
                    "score": 5,
                    "created_utc": 1652609930.0,
                    "response": "Yeah, this will be a fucking death blow for LUNA. Earlier holders will push for this though as they were most disadvantaged by the minting inflation to try hold peg. \n\nThey think you can just invalidate all the extra tokens and the people who bought them cheap so that earlier holders get made \"whole\".... What they fail to grasp is that doing it that way destroys all trust in the project of everyone external and the project never gains the influx of new users after tge fork and it withers and dies over the next 6-12mths. \n\nIf they go this direction, they would have to not warn the wider market, pick a date and time and halt the blockchain. At that moment, whatever the trading value was of ALL tokens minted after the snapshot from before the crash, get reimbursed at current market value to those new holders. Burn the new tokens, then fork or do whatever. \n\nIt's the only way to even hope that the wider market might trust LUNA again. Without that trust, no fork can save this clusterfuck! It will just be a circle jerk of OG holders who eventually realise not enough new money is entering to increase the bag value enough to exit. \n\nSeen it happen over and over and over and over again! Mark this comment and check back in in 12mths. \n\nI really hope for OG holders it works out....  but sadly, it won't.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8od43b",
                    "author": "AngelVirgo",
                    "score": 3,
                    "created_utc": 1652605457.0,
                    "response": "Oh, no. Sell!",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}