{
    "subreddit": "Binance",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uv8mp6",
            "title": "80,000 bitcoins missing: What's left in Luna's reserve wallet?",
            "url": "https://www.reddit.com/r/binance/comments/uv8mp6/80000_bitcoins_missing_whats_left_in_lunas/",
            "author": "ElizaAdalynn343",
            "created_utc": 1653217074.0,
            "score": 34,
            "num_comments": 7,
            "subreddit": "binance",
            "selftext": "The Luna Foundation Guard (LFG) also shared a promise to \"compensate the remaining UST users, smallest holders first,\" with the remaining assets.\n\nHowever, there is no record of any re-purchase, compensation or token burning on Terra to restore part of the price, a system inspired by Shiba Inu, Axs or Minosis Token, a system that has been effective.\n\nIn short, 80,081 Bitcoin (BTC) or 99.61% of the bitcoins that LFG held in custody, have left the fund. The group confirmed the sale of \"33,206 BTC for a total of $1,164,018,521 $UST\" in a tweet. The remaining 47,188 BTC are unaccounted for, while 313 BTC remain in reserve.\n\nInterestingly, LFG has not sold a single Binance Coin (BNB) or Avalanche (AVAX), holding around 40,000 and 2,000,000 of each token, respectively.\n\nMeanwhile, cryptocurrency enthusiasts with staking LUNA tokens should see LUNA returned to their wallets in the next 20 days. However, it will be worth less: LUNA's price has fallen more than 99% from its highs, and currently sits at $0.0002.\n\nWhat was once a $50 billion ecosystem now has a total reserve balance of $82 million, prompting popular influencer Cobie to simply respond to the thread with, \"Bruh.\"",
            "stickied": false,
            "comments": [
                {
                    "id": "i9k8xen",
                    "author": "RawDick",
                    "score": -4,
                    "created_utc": 1653226861.0,
                    "response": "DYOR… funds were used to defend the peg.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9kbbye",
                            "author": "Prob_Pooping",
                            "score": 3,
                            "created_utc": 1653228072.0,
                            "response": "He's saying there's no evidence of it. Screenshots of excel sheets or pdfs aren't transaction numbers or wallet addresses to track the funds leaving the ecosystem.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9kud8p",
                                    "author": "Crafty_Enthusiasm_99",
                                    "score": 1,
                                    "created_utc": 1653236635.0,
                                    "response": "That's the point of the Blockchain. Why can't they just share the wallet addresses?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9kwhmx",
                                            "author": "Prob_Pooping",
                                            "score": 1,
                                            "created_utc": 1653237517.0,
                                            "response": "That's my point.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9kf405",
                            "author": "Atsoc1993",
                            "score": 1,
                            "created_utc": 1653229897.0,
                            "response": "Someone’s late to the party lol, still reading those tweets?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9kf9vu",
                    "author": "zionmatrixx",
                    "score": 0,
                    "created_utc": 1653229970.0,
                    "response": "https://dashboard.lfg.org/",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uv8l80",
            "title": "card cashback",
            "url": "https://www.reddit.com/r/binance/comments/uv8l80/card_cashback/",
            "author": "nelly-meli",
            "created_utc": 1653216875.0,
            "score": 3,
            "num_comments": 25,
            "subreddit": "binance",
            "selftext": "Hello\n\nI'm new to binance, i m coming from crypto.com after they have changed the cashback on their cards, after i struggle a lot to find away to transfer some funds without to pay fees that is insane cause it cancels the cashback you get if you pay them, top-up have 1.8% fees when on crypto is 0% i tried some small transactions to see how it works, haven't purchase any bnb yet i want to test the product first  so I'm with the 0.1% cashback, and I'm glad I did not purchased yet any bnb cause something seems it doesn't work ok, made a small purchase but says -- on cashback field, 0.1% is very small so i can not complain for the money i didn't received but that it is worried me is the cashback system seems it doesn't work, small amount or not i must had some cashback on my account, transactions was 2 days ago, on crypto.com cashback is immediately after some seconds on your account, so if you see cro is down it is a nice opportunity to use your card to receive more cro as cashback, I don't know if i get at all the cashback here but also id i get it , it is not the same, immediate cashback vs after 2-3 days cashback it is a huge different, on first situation you are the one who choose when you got your cashback and on what price and on binance situation binance decides , example when price of bnb goes up it is a good opportunity for them to pay you the cashback... Not good at all",
            "stickied": false,
            "comments": [
                {
                    "id": "i9jv2dw",
                    "author": "ah__there_is_another",
                    "score": 3,
                    "created_utc": 1653218067.0,
                    "response": "you're right, you do not get cash back on all purchases with the binance card. i have both, and sticking to cdc card for as long as i can",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}