{
    "subreddit": "Binance",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "upquak",
            "title": "What would have happaned to my luna?",
            "url": "https://www.reddit.com/r/binance/comments/upquak/what_would_have_happaned_to_my_luna/",
            "author": "Zetless",
            "created_utc": 1652563746.0,
            "score": 5,
            "num_comments": 5,
            "subreddit": "binance",
            "selftext": "I had 77 nillion luna i bought at the absolute bottom for 100 usd, i sold it for 220 usd 12 hours later before binance removed it. If i dodnt sell my luna then woul i still hace had 77 million luna now?",
            "stickied": false,
            "comments": [
                {
                    "id": "i8mgtsp",
                    "author": "godbog_",
                    "score": 3,
                    "created_utc": 1652564688.0,
                    "response": "atm sits at 0,00047BUSD, your bag would worth 36k now :,)",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8mi20v",
                            "author": "Zetless",
                            "score": 3,
                            "created_utc": 1652565262.0,
                            "response": "Damn thats sucks",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "up8ivm",
            "title": "Coingecko, Quickswap, Etherscan...etc. Compromised",
            "url": "https://www.reddit.com/r/binance/comments/up8ivm/coingecko_quickswap_etherscanetc_compromised/",
            "author": "FlameOfGod",
            "created_utc": 1652499058.0,
            "score": 3,
            "num_comments": 5,
            "subreddit": "binance",
            "selftext": "Please be advised that a variety of exchanges and crypto service sites are currently under direct attack. Some sites, such as QuickSwap, are confirmed as compromised.\n\nSites that have been reported as being at risk of being compromised include DexTools, CoinGecko, EtherScan, and QuickSwap.\n\nCurrent recommendation is that if you are able to disconnect your wallet from these sites you should do so until the scope and success rate of these attacks is able to be confirmed and contained.\n\nIf you receive a request for connection on a site you would not normally expect to see one (ie as your wallet is already showing as connected) please regard it as suspicious and take appropriate precautions.\n\nThese attacks are primarily targeting the sites themselves, so it is recommended you check the twitter feeds and other social media channels for the sites you use to confirm any developments.",
            "stickied": false,
            "comments": []
        }
    ]
}