{
    "subreddit": "Binance",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "v0iqnd",
            "title": "Binance denies that it was approached by Russian authorities to hand over client data: Report",
            "url": "https://www.reddit.com/r/binance/comments/v0iqnd/binance_denies_that_it_was_approached_by_russian/",
            "author": "Bria_Hartley4567",
            "created_utc": 1653853350.0,
            "score": 28,
            "num_comments": 4,
            "subreddit": "binance",
            "selftext": "According to Reuters, the regional chief of Binance, the world's largest cryptocurrency exchange, met with Russia's financial intelligence agency in Moscow. It was ordered to pass over data about the country's consumers. According to texts exchanged by the regional head to a business colleague. The Russian authorities requested names and addresses to assist them in fighting crime. \n\n\nThe events from April 2022, when Rosfinmonitoring or Rosfin, a Russian agency, was on the  trail of millions of dollars in Bitcoin. It, raised by jailed Russian opposition leader Alexei Navalny, was detailed in the report. According to a person close to the situation, Navalny was using the cash to support attempts to uncover corruption in the Vladimir Putin-led administration. \n\n\nGleb Kostarev, Binance's head of operations in eastern Europe and Russia, agreed to supply Rosfin with the information requested. According to texts between Kostarev and another business colleague. Kostarev explained to the associate that he didn't have much of a choice and had no choice but to comply. Kostarev did not answer when contacted. \n\n\nBinance claims that Russian authorities never approached them over Navalny and that the exchange was actively pursuing compliance in Russia. The ETF will allow retail investors to get into the crypto ecosystem, and their money can be used by institutional investors for investing in upcoming booming industries like NFTs, Web 3.0, where companies like Faith Tribe, OpenSea, Polygon, etc, are making a lot of progress.\n\n\nCrypto material works exceptionally well in business media. Binance is accustomed to being the center of attention as the market leader. We may disagree with how we or crypto are depicted occasionally, but journalists frequently collaborate with us to educate readers. Binance appeared to be trying to create relations with the Russian government, according to the chat between Kostarev and the business colleague. Reuters questioned former workers, ex-business partners, and crypto industry officials. \n\n\nMoreover, text messages made by Kostarev to others outside the company were scrutinized to substantiate the exchange's behind-the-scenes operations. Despite the existing restrictions placed against Russia's banks and other businesses. Cryptonary stated that the exchange aims to grow in Russia and neighboring nations.",
            "stickied": false,
            "comments": [
                {
                    "id": "iagurtt",
                    "author": "SpagettiGaming",
                    "score": 1,
                    "created_utc": 1653856933.0,
                    "response": "Lol sure",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iah4cny",
                    "author": "zakpreto",
                    "score": 1,
                    "created_utc": 1653861650.0,
                    "response": "Source: my ass",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}