{
    "subreddit": "Binance",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uzxj1r",
            "title": "How safe is ANC to trade",
            "url": "https://www.reddit.com/r/binance/comments/uzxj1r/how_safe_is_anc_to_trade/",
            "author": "WonderFactory",
            "created_utc": 1653776360.0,
            "score": 0,
            "num_comments": 6,
            "subreddit": "binance",
            "selftext": "ANC is currently the 3rd most traded crypto on Binance but how safe is it to trade. I traded Luna a bit this week and luckily didn't have any holding of Luna when Binance suspended trading. Is there any chance something similar could happen to ANC? As I understand it's based on UST Terra so is it possible Binance could suddenly suspend trading of ANC like they did Terra Luna?\n\n I'm happy to accept the risk of the price going up and down quickly as you can always sell before things get too bad but being suddenly unable to sell is a whole new level of risk",
            "stickied": false,
            "comments": [
                {
                    "id": "iad4dlz",
                    "author": "littlegreenfish",
                    "score": 2,
                    "created_utc": 1653777653.0,
                    "response": "If you don't trust it, scalp it on 1m timeframe and keep your trusted USDC or USDT or BUSD. \n\nI learnt my lesson to always scalp any coin that has been around for less than 3 years.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaeruvh",
                            "author": "WonderFactory",
                            "score": 1,
                            "created_utc": 1653817156.0,
                            "response": "I have been doing this which seems to me an acceptable risk, just was worried after Luna was suddenly removed from binance if the same could happen with ANC.\n\n Buying it with the intention of holding it for a few minutes when being stuck with it as Binance stop trades like they did with luna worries me. I sold some Luna about an hour before binance stopped all trades, I had no idea they'd do that so I was just lucky.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iaexyh3",
                                    "author": "littlegreenfish",
                                    "score": 1,
                                    "created_utc": 1653822520.0,
                                    "response": "The truth is that it could happen to ANY coin. Even ETH and BTC. You never know. \n\nIf you're scalping, you could possibly get out before any downtrend. If you have a decent strategy, you'll always be safe. Binance never stops trades if the price is on the way up. If you're trading the downtrend, you could end up in a messed up situation.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iafv2x5",
                    "author": "Remote-Annual-676",
                    "score": 1,
                    "created_utc": 1653840422.0,
                    "response": "Listen to your gut.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}