{
    "subreddit": "Binance",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "urm27u",
            "title": "BUSD vs DAI - Which Stablecoin is better? 🤔",
            "url": "https://www.reddit.com/r/binance/comments/urm27u/busd_vs_dai_which_stablecoin_is_better/",
            "author": "Simple_hold_wallet",
            "created_utc": 1652792833.0,
            "score": 1,
            "num_comments": 0,
            "subreddit": "binance",
            "selftext": "# What Is BUSD?\n\n[BUSD](https://coinmarketcap.com/currencies/binance-usd/) is a stablecoin launched by Paxos and Binance. Paxos utilizes blockchain technology to make their stablecoin as a service product to outside companies. They also have a gold-pegged stablecoin PAX Gold (PAXG). BUSD and PAXG tokens are regulated by The New York State Department of Financial Services.\n\n[BUSD](https://simplehold.io/blog/article/BUSD-VS-DAI?utm_source=social&utm_medium=reddit&utm_campaign=education_post) is a fiat-pegged stablecoin that uses a U.S. dollar peg. When the price of the U.S. dollar rises or falls, the price of BUSD does the same in an equal ratio. This is a classic model of stablecoin.  \nBUSD’s bullet points:\n\n1. BUSD is a digital-fiat currency that was issued as an ERC20 token but it also supports BEP-2. \n2. BUSD plays a crucial role in transactions, payments, and Decentralised Finance (DeFi).\n3. It is pegged to the U.S. Dollar and is regulated and approved by NYDFS together with Paxos.\n4. BUSD is based within the [Ethereum](https://www.sashares.co.za/ethereum/) blockchain, it runs on a highly scalable blockchain known as the Fincubate (FCB) Financial Blockchain, which uses Graphene technology for high throughput, and supports high-frequency financial applications.\n5. Behind each BUSD, there is a US Dollar in capital reserve. Thus, 100% of BUSD which is in circulation has a corresponding USD asset in the custody of a third party.\n6. It is a part of Binance’s Venus project, which is designed to accelerate development as well as integration of stablecoins in the global economy.\n7. Binance, in partnership with other international financial corporations, offers to its users to invest in credit cards and other cryptocurrencies via its platform. As for BUSD, it can only be purchased with a credit card.\n\nhttps://preview.redd.it/k9grgugk91091.png?width=1600&format=png&auto=webp&s=d6a42d3f6ee843038bd28b3f9699e11943fd02a3\n\n# What Is DAI?\n\n[Dai](https://coinmarketcap.com/currencies/multi-collateral-dai/) is a kind of unique because it is an Ethereum-based stable coin (ERC-20 token) that has a value equal to one U.S. dollar. This is possible by utilizing an automatic system of smart contracts on the Ethereum blockchain. The Dai stablecoin price is pegged to the U.S. dollar and is collateralized by many other cryptocurrencies. \n\nAmong the pros that we can find in this currency can be mentioned:\n\n1. It is a secure, decentralized stablecoin with a long history of security.\n2. It does not depend on banks, being a totally different stablecoin than USDT. To put it straight, there is no risk of the bank closing or owning the account that supports the entire protocol, nor is it required to trust that these funds exist in the bank.\n3. It maintains the creation of decentralized ways of exchange and financing. Actually, DAI is one of the most accepted currencies in the DeFi world and DEX today.\n4. Its proven stability gives confidence while having an operation with this currency. Even in the worst case, MakerDAO has been able to provide stability at acceptable values and even has improved stability over time.\n5. It is highly accessible and respects its user's privacy. Anyone can access the system without KYC or giving their data to a third party.\n6. Ability to generate credit and interest for the credit, which makes it a rather a strong option for investment.\n7. It is one of the largest DeFi ecosystems in the world, with a value that exceeds over 1400 billion U.S. dollars.\n8. It is a widely supported stablecoin on various exchanges.\n\n# BUSD and DAI Compared\n\n**BUSD** could be considered a better option if you prefer trusted reserves. In terms of regulations, BUSD is the better option. If you are using Binance for your crypto activities, you gain even more as BUSD is already part of the Binance.\n\nAs it is regulated, the risk is lower, especially if authorities are placing more restrictions upon stablecoins. In case you trade across various platforms and buy less-known coins, BUSD may not be there. The token is available only on bigger exchanges. If you don’t want to be somehow restricted and are eager to have total control of your assets, then BUSD is not an ideal option for you as well.\n\n**DAI** is more of a decentralized stablecoin, as it is not backed by any fiat currencies but instead by many different cryptocurrencies.\n\nSo, there is no central authority that controls the reserves, that’s why the stablecoin can be called a decentralized, and governments can’t regulate it as much as BUSD.\n\nWorth noting that DAI has lower availability of trading pairs compared to BUSD, so it limits its use cases for trading with other cryptocurrencies.\n\nThanks for reading! The full article available through the link - [https://simplehold.io/blog/article/BUSD-VS-DAI?utm\\_source=social&utm\\_medium=reddit&utm\\_campaign=education\\_post](https://simplehold.io/blog/article/BUSD-VS-DAI?utm_source=social&utm_medium=reddit&utm_campaign=education_post)",
            "stickied": false,
            "comments": []
        },
        {
            "id": "urmbl1",
            "title": "Seems like Do Kwon has some serious plan in his mind",
            "url": "https://i.redd.it/ote164lie1091.png",
            "author": "rody143",
            "created_utc": 1652793652.0,
            "score": 0,
            "num_comments": 2,
            "subreddit": "binance",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8xyvqa",
                    "author": "scleeq",
                    "score": 1,
                    "created_utc": 1652793887.0,
                    "response": "At this point I feel like mans just ranting honestly.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "urmaru",
            "title": "Linqto",
            "url": "https://www.reddit.com/r/binance/comments/urmaru/linqto/",
            "author": "EYESWIDEOPEN017",
            "created_utc": 1652793583.0,
            "score": 0,
            "num_comments": 1,
            "subreddit": "binance",
            "selftext": "https://www.linqto.com/signup?r=gekd4ajay3 \n\nThis is what you have to have in order to virtually watch the Nodl cash app’s first I think conference. Sign up to listen for free. No cost to anyone that has the Linqto app.\n\nThis is what you get and what referring gets you NOT to shabby there!!\n\nShare your personal referral link with your friends.\nThey sign up and get $250. They complete a purchase, and you get $750. Simple.",
            "stickied": false,
            "comments": []
        },
        {
            "id": "urm76y",
            "title": "Crypto/NFT Investment Portfolio Tracker Template for Excel | Live Data & Calculations",
            "url": "https://www.reddit.com/r/binance/comments/urm76y/cryptonft_investment_portfolio_tracker_template/",
            "author": "BloodSting",
            "created_utc": 1652793277.0,
            "score": 1,
            "num_comments": 1,
            "subreddit": "binance",
            "selftext": "Hello,\n\nThis is a template I made to easily keep track of my investments. I've decided to share it for free as a give back to the community.\n\n&#x200B;\n\n𝐅𝐞𝐚𝐭𝐮𝐫𝐞𝐬\n\n\\-------------\n\n[https://www.youtube.com/watch?v=gIlkqdGDb8s](https://www.youtube.com/watch?v=gIlkqdGDb8s)\n\n&#x200B;\n\n𝐇𝐨𝐰 𝐢𝐭 𝐰𝐨𝐫𝐤𝐬 (𝐆𝐮𝐢𝐝𝐞 𝐢𝐧𝐜𝐥𝐮𝐝𝐞𝐝)\n\n\\-------------------------------------------\n\n1. Portfolio’s Currency is selected.\n2. History is inputted either with a CSV file or manually (Transactions, Trades, Dividends).\n3. Each investment’s information is specified (Asset Class, Region, Sector, etc.)\n4. All data are then calculated automatically based on the above information.\n\n&#x200B;\n\nhttps://preview.redd.it/evyfwx7ed1091.jpg?width=2700&format=pjpg&auto=webp&s=aa5ee877096e6a03e963dda75134b8e843de71b6\n\nhttps://preview.redd.it/9h6ao18ed1091.jpg?width=2700&format=pjpg&auto=webp&s=4355245284a3ed31a058fdce077aafff6cf9ebeb\n\nhttps://preview.redd.it/e7vhax7ed1091.jpg?width=2700&format=pjpg&auto=webp&s=c41f22003e52a8a05b613a7fbd87a0c279f99666\n\nhttps://preview.redd.it/4y0y648ed1091.jpg?width=2700&format=pjpg&auto=webp&s=c3e6152631e23549e1456273c5a856aabf703348\n\nhttps://preview.redd.it/xbhet08ed1091.jpg?width=2700&format=pjpg&auto=webp&s=09a5b601972480b9aa0bdd29a7506f376cc19518\n\n𝐃𝐨𝐰𝐧𝐥𝐨𝐚𝐝 𝐋𝐢𝐧𝐤\n\n\\----------------------\n\n[https://drive.google.com/uc?export=download&id=1lNMbqMq5iNhrsF-TEr5aQtDTwfDRAqdC](https://drive.google.com/uc?export=download&id=1lNMbqMq5iNhrsF-TEr5aQtDTwfDRAqdC)\n\nRAR Password: *invest*",
            "stickied": false,
            "comments": []
        },
        {
            "id": "urm36o",
            "title": "Gala Games May Mayhem $4 Million in Prices!!",
            "url": "https://www.reddit.com/r/binance/comments/urm36o/gala_games_may_mayhem_4_million_in_prices/",
            "author": "EstablishmentNo8393",
            "created_utc": 1652792923.0,
            "score": 0,
            "num_comments": 1,
            "subreddit": "binance",
            "selftext": "&#x200B;\n\nhttps://preview.redd.it/cfg0s46ec1091.png?width=745&format=png&auto=webp&s=9ad4ac138d061fa6ea733691ba87bec83cf26b89\n\nThe gaming platform Gala Games is giving away huge prices in different tournaments or even just for playing their free to play games until the end of may. Three of these games are eligible for earning real money, first being spider tanks with up to $1.5 mill in prices. Only thing you have to do is play the game, which is completely free to play.\n\n&#x200B;\n\nhttps://preview.redd.it/z04lac0wb1091.png?width=762&format=png&auto=webp&s=62ccf8808c439c65eed9555aba31f8eea8d6ef74\n\nSecond being their well known game Town Star with up to $2 mill in prices. The $2 mill will be split equally in 4 tournaments next is starting today on May 17th 2022 and the last will be on May 24th, so hurry up and grap those prices!\n\n&#x200B;\n\nhttps://preview.redd.it/xvcev5d3c1091.png?width=725&format=png&auto=webp&s=9e2f7fa17cc614ed4127efbfe99b555388227535\n\nThe top 2000 players will spit a price pool paid in gala each tournament. For example 1st place will get $15000 and places 1001-2000 will get $50 each. You can easily get in the top 2000 without any NFTs or skins, so u have to spend exactly zero money to get the chance to win at least $50. There will also be additional bonus prizes for random placements each week, even on the p2e servers!\n\n&#x200B;\n\nhttps://preview.redd.it/p8568ka5c1091.png?width=505&format=png&auto=webp&s=86ceb6243d3307d206171d39ed6a888a4ac385a1\n\nThey are also giving away a free Flour Storage NFT for everyone who plays town star at least three days before May comes to an end.\n\nLast game with huge prices will be Town Crush, a Town Star themed Candy Crush version. The game will launch today on May 17th and you have to complete all 12 new levels of Town Crush to take part in splitting a pool of $400.000 in GALA. But theres a catch, u have to be a gala gold member here, gold membership is for a lifetime and costs around 50$ and will bring u a lot free stuff over time, so if your into gaming consider purchasing the gold membership.\n\n&#x200B;\n\nhttps://preview.redd.it/anejv9r9c1091.png?width=726&format=png&auto=webp&s=d3286f74e2d8b04472c1fe3f56ad2362d0ab0adc\n\nI personally didnt spend money on anything except the gold membership and i ranked top 2000 in Town Star in the first two tournaments, so im at +50$ so far. Also i wont miss the $400.000 pool in Town Crush, im kinda curious how much everyone who completes the 12 levels will get.\n\nYou should also have in mind that the prices are paid in GALA and the whole market being really low means theres a high possibility that the 50$ in GALA now will be 100$ in GALA soon or even more considering the fact that GALA is worth about 8ct right now but was at 60ct already.\n\nHeres a link which will give me a free NFT if at least 10 people sign up, so it would be much appreciated <3\n\n[https://gala.fan/WLF4Ss0e4](https://gala.fan/WLF4Ss0e4)",
            "stickied": false,
            "comments": []
        }
    ]
}