{
    "subreddit": "Binance",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uq3oi6",
            "title": "What's happening to the BSC network?",
            "url": "https://www.reddit.com/r/binance/comments/uq3oi6/whats_happening_to_the_bsc_network/",
            "author": "Eileen755",
            "created_utc": 1652612378.0,
            "score": 11,
            "num_comments": 4,
            "subreddit": "binance",
            "selftext": "Although the Binance Smart Chain network announced a change of its nomenclature on the 15th of February 2022, from Binance Smart Chain to BNB chain, but nonetheless, I guess a number of people still have BSC pinned to their heart… which isn't a bad one though\n\nAccording to the Binance webpage, BNB chain pledged its commitment that it would remain a network that is  open, multi-chain, permissionless and also decentralized.\n\nBut taking a good look beneath the chain and its figures, one would definitely have to ask if the BNB chain is still really in good health or it is gradually caving in to pressure from more recent Blockchain networks.\n\nAccording to a report available on www.nasdaq.com, as at December 2021, BSC had its All time high of daily active address to be 2.27million… but a more recent check done in May 2022 shows a staggering figure of just a tip above 1million daily active address.\n\nAlso, according to Defi Llama, the Total Value Locked (TVL) which is an indicator of how much money is deposited on a network or specific protocol per time showed that as at May 2021, BSC came second in comparison with all other players in the defi market having a 21.78%... fast forward to January 2022, BSC had caved to around 7%.\n\nWell, with the eruption of more recent Blockchain networks such as avalanche, Polygon, zetrix and Solana which boasts of far lower transaction fees, is it possible that the glory days of BSC are finally coming to its end?",
            "stickied": false,
            "comments": []
        }
    ]
}