{
    "subreddit": "Binance",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "urlti8",
            "title": "BUSD vs DAI - Which Stablecoin is better? 🤔",
            "url": "https://www.reddit.com/r/binance/comments/urlti8/busd_vs_dai_which_stablecoin_is_better/",
            "author": "Simple_hold_wallet",
            "created_utc": 1652792069.0,
            "score": 45,
            "num_comments": 45,
            "subreddit": "binance",
            "selftext": "# What Is BUSD?\n\n[BUSD](https://coinmarketcap.com/currencies/binance-usd/) is a stablecoin launched by Paxos and Binance. Paxos utilizes blockchain technology to make their stablecoin as a service product to outside companies. They also have a gold-pegged stablecoin PAX Gold (PAXG). BUSD and PAXG tokens are regulated by The New York State Department of Financial Services.\n\n[BUSD](https://simplehold.io/blog/article/BUSD-VS-DAI?utm_source=social&utm_medium=reddit&utm_campaign=education_post) is a fiat-pegged stablecoin that uses a U.S. dollar peg. When the price of the U.S. dollar rises or falls, the price of BUSD does the same in an equal ratio. This is a classic model of stablecoin.  \nBUSD’s bullet points:\n\n1. BUSD is a digital-fiat currency that was issued as an ERC20 token but it also supports BEP-2. \n2. BUSD plays a crucial role in transactions, payments, and Decentralised Finance (DeFi).\n3. It is pegged to the U.S. Dollar and is regulated and approved by NYDFS together with Paxos.\n4. BUSD is based within the [Ethereum](https://www.sashares.co.za/ethereum/) blockchain, it runs on a highly scalable blockchain known as the Fincubate (FCB) Financial Blockchain, which uses Graphene technology for high throughput, and supports high-frequency financial applications.\n5. Behind each BUSD, there is a US Dollar in capital reserve. Thus, 100% of BUSD which is in circulation has a corresponding USD asset in the custody of a third party.\n6. It is a part of Binance’s Venus project, which is designed to accelerate development as well as integration of stablecoins in the global economy.\n7. Binance, in partnership with other international financial corporations, offers to its users to invest in credit cards and other cryptocurrencies via its platform. As for BUSD, it can only be purchased with a credit card.\n\nhttps://preview.redd.it/k9grgugk91091.png?width=1600&format=png&auto=webp&s=d6a42d3f6ee843038bd28b3f9699e11943fd02a3\n\n# What Is DAI?\n\n[Dai](https://coinmarketcap.com/currencies/multi-collateral-dai/) is a kind of unique because it is an Ethereum-based stable coin (ERC-20 token) that has a value equal to one U.S. dollar. This is possible by utilizing an automatic system of smart contracts on the Ethereum blockchain. The Dai stablecoin price is pegged to the U.S. dollar and is collateralized by many other cryptocurrencies. \n\nAmong the pros that we can find in this currency can be mentioned:\n\n1. It is a secure, decentralized stablecoin with a long history of security.\n2. It does not depend on banks, being a totally different stablecoin than USDT. To put it straight, there is no risk of the bank closing or owning the account that supports the entire protocol, nor is it required to trust that these funds exist in the bank.\n3. It maintains the creation of decentralized ways of exchange and financing. Actually, DAI is one of the most accepted currencies in the DeFi world and DEX today.\n4. Its proven stability gives confidence while having an operation with this currency. Even in the worst case, MakerDAO has been able to provide stability at acceptable values and even has improved stability over time.\n5. It is highly accessible and respects its user's privacy. Anyone can access the system without KYC or giving their data to a third party.\n6. Ability to generate credit and interest for the credit, which makes it a rather a strong option for investment.\n7. It is one of the largest DeFi ecosystems in the world, with a value that exceeds over 1400 billion U.S. dollars.\n8. It is a widely supported stablecoin on various exchanges.\n\n# BUSD and DAI Compared\n\n**BUSD** could be considered a better option if you prefer trusted reserves. In terms of regulations, BUSD is the better option. If you are using Binance for your crypto activities, you gain even more as BUSD is already part of the Binance.\n\nAs it is regulated, the risk is lower, especially if authorities are placing more restrictions upon stablecoins. In case you trade across various platforms and buy less-known coins, BUSD may not be there. The token is available only on bigger exchanges. If you don’t want to be somehow restricted and are eager to have total control of your assets, then BUSD is not an ideal option for you as well.\n\n**DAI** is more of a decentralized stablecoin, as it is not backed by any fiat currencies but instead by many different cryptocurrencies.\n\nSo, there is no central authority that controls the reserves, that’s why the stablecoin can be called a decentralized, and governments can’t regulate it as much as BUSD.\n\nWorth noting that DAI has lower availability of trading pairs compared to BUSD, so it limits its use cases for trading with other cryptocurrencies.\n\nThanks for reading! The full article available through the link - [https://simplehold.io/blog/article/BUSD-VS-DAI?utm\\_source=social&utm\\_medium=reddit&utm\\_campaign=education\\_post](https://simplehold.io/blog/article/BUSD-VS-DAI?utm_source=social&utm_medium=reddit&utm_campaign=education_post)",
            "stickied": false,
            "comments": [
                {
                    "id": "i8yjgn8",
                    "author": "iamjide91",
                    "score": 16,
                    "created_utc": 1652802794.0,
                    "response": "DAI over BUSD for me.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8yr520",
                    "author": "Sixhaunt",
                    "score": 11,
                    "created_utc": 1652805928.0,
                    "response": "If you are using binance or the Binance-Smart-Chain then BUSD makes sense since it's usable directly for things while DAI isn't used for pairings on the exchange and on the chain they typically use BUSD for things so it has the liquidity in DEXs and stuff too. If you are on ETH then DAI makes sense and if you are elsewhere then it's really up to you. Both are pretty damn safe",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8z02m8",
                            "author": "no_choice99",
                            "score": 8,
                            "created_utc": 1652809509.0,
                            "response": "On the top of that, there is 0 trading fee if using busd on binance, whereas there is a ''small'' fee if using dai.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8z203k",
                                    "author": "Sixhaunt",
                                    "score": 2,
                                    "created_utc": 1652810282.0,
                                    "response": "I didn't know that! That will actually make a difference in my trading so thank-you!",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8z39gp",
                                            "author": "no_choice99",
                                            "score": 3,
                                            "created_utc": 1652810790.0,
                                            "response": "As long as you use limit orders, it should work (google it if you want the exact details, essentially it's a special limited ''gift'' from binance that gets extended over time, over and over).",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i8z7ia0",
                                    "author": "Daikataro",
                                    "score": 0,
                                    "created_utc": 1652812525.0,
                                    "response": "I don't think it's always zero.\n\nAfter the USDT reveal, I always do my trading in BUSD. Sometimes I get a zero fee which is nice, and sometimes I get the promotional 0.075% fee deducted from my BNB reserves.\n\nExactly how they decide is anyone's guess.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8z89zr",
                                            "author": "Zwiebel1",
                                            "score": 2,
                                            "created_utc": 1652812842.0,
                                            "response": "Its only zero maker fee, not taker.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i90m3tt",
                                                    "author": "kinnth",
                                                    "score": 1,
                                                    "created_utc": 1652834782.0,
                                                    "response": "Makers enter an order on the book above or below the current price. Takers immediately sell at the current price",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i90smcz",
                                                            "author": "Zwiebel1",
                                                            "score": 1,
                                                            "created_utc": 1652837850.0,
                                                            "response": "You probably wanted to answer that to the one asking for an ELI5, not me.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i8zc2kh",
                                                    "author": "Daikataro",
                                                    "score": 1,
                                                    "created_utc": 1652814390.0,
                                                    "response": "ELI5?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8zfksc",
                                                            "author": "__HumbleBee__",
                                                            "score": 3,
                                                            "created_utc": 1652815825.0,
                                                            "response": "Liquidity Maker vs. Liquidity Taker.\n\nAs far as I know, limit orders are considered maker and market orders are considered taker, since you take away from the liquidity of the market.",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "i90rsyg",
                                                            "author": "Zwiebel1",
                                                            "score": 2,
                                                            "created_utc": 1652837466.0,
                                                            "response": "Limit orders = maker.\n\nMarket orders = taker.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8yvqk0",
                    "author": "DrXaos",
                    "score": 7,
                    "created_utc": 1652807780.0,
                    "response": "Government regulation or Binance fuckery is more likely to hit BUSD than DAI.  Hackers are more likely to hit DAI but so far the code seems solid.\n\nYou can’t directly fund DAI from a non-crypto fiat bank account, it is only inside a crypto system that gets Chainlink information on exchange rates.\n\nBoth seem safe under current circumstances.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8z14uq",
                    "author": "Lee911123",
                    "score": 7,
                    "created_utc": 1652809927.0,
                    "response": "BUSD is backed by 96% Cash reserves and 4% US Treasuries (aka US government bonds)\n\nDAI is collateralized at a rate of 150% with other crypto assets (from BTC, ETH, and popular stablecoins like TUSD, PAX, and USDC)\n\nBUSD is backed by regulators (from multiple countries) and also run by the most centralized company in the crypto space\n\nAnd DAI is maintained and controlled by MakerDAO, which relies on governance votes for its reserves/assets\n\n\nThen on one side you have USDC, which is issued by Circle and Coinbase, and if you’re wondering- they’re pretty listed as the same company \n\nUSDC reserves are a bit more complicated, but I hope this blog helps - \n\n[https://cdn-blog.seedly.sg/wp-content/uploads/2021/09/21203928/220821-Ultimate-Guide-to-Stablecoins.png](https://cdn-blog.seedly.sg/wp-content/uploads/2021/09/21203928/220821-Ultimate-Guide-to-Stablecoins.png)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8yn03d",
                    "author": "Vayu0",
                    "score": 21,
                    "created_utc": 1652804267.0,
                    "response": "UST for me.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8yvju6",
                            "author": "Extra-Needleworker48",
                            "score": 8,
                            "created_utc": 1652807705.0,
                            "response": "ok buying",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8zixyi",
                            "author": "FDisk80",
                            "score": 7,
                            "created_utc": 1652817209.0,
                            "response": "I hear it's cheap now.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8zrd03",
                                    "author": "Extra-Needleworker48",
                                    "score": 1,
                                    "created_utc": 1652820707.0,
                                    "response": "yeah kinda not stable lol",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8zu0he",
                                            "author": "FDisk80",
                                            "score": 3,
                                            "created_utc": 1652821820.0,
                                            "response": "Unstable Coin. Hmm, could be a thing. Good for day trading.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8zuerq",
                                                    "author": "Extra-Needleworker48",
                                                    "score": 2,
                                                    "created_utc": 1652821991.0,
                                                    "response": "Yep, agree, making something since last Friday on that",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8zbszp",
                    "author": "KinggArthurr",
                    "score": 3,
                    "created_utc": 1652814283.0,
                    "response": "Busd",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ytdjl",
                    "author": "Prior-Painting2956",
                    "score": 2,
                    "created_utc": 1652806824.0,
                    "response": "Usdc",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8z8ltd",
                    "author": "Responsible_Basis_59",
                    "score": 2,
                    "created_utc": 1652812976.0,
                    "response": "Why doesn't BUSD support trading pairs such as BNBUP BNBDOWN, BTCDOWN, etc.. Why do I have to buy USDT?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8zt80e",
                    "author": "grimreaperxc",
                    "score": 2,
                    "created_utc": 1652821482.0,
                    "response": "Don't have anything against DAI and I really avoid using the ETH blockchain at all costs but at least with BUSD, I can easily say CZ and Binance have a crapload of money that's at least 3 times the market cap size of BUSD. I can't say the same thing about Tether for example. \n\nAnd I would always have to worry about the `freaking ridiculous rip-off` amount of fees that come with the ETH blockchain if I use DAI.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9067ky",
                    "author": "lunchtimeMMMMMM",
                    "score": 2,
                    "created_utc": 1652827212.0,
                    "response": "BUSD only.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i90b9w4",
                    "author": "hatetheproject",
                    "score": 1,
                    "created_utc": 1652829600.0,
                    "response": "Seems to me that collateralising with crypto is dumb as hell, what if crypto goes down?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i91m74q",
                            "author": "boyscoutsgravelly",
                            "score": 1,
                            "created_utc": 1652855134.0,
                            "response": "buy more and thank me later.\n\njust like ppl braging how solana is this and that, but solana doesn't stand a chance next to kadena and kaddex, those are facts...want link, hit me up\n\nppl keep investing in things with no future, this is part of the reason we are here",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i90f6p5",
                    "author": "Dangerous_Forever640",
                    "score": 1,
                    "created_utc": 1652831484.0,
                    "response": "TOR is a pretty good stable too from Hector…\n\nAPY for staking is paid back in FTM so the supply isn’t inflated…",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i918j8r",
                    "author": "Johndrc",
                    "score": 1,
                    "created_utc": 1652845814.0,
                    "response": "Dai",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i91ixaq",
                    "author": "crexcent",
                    "score": 1,
                    "created_utc": 1652852603.0,
                    "response": "After the UST incident. I think you need to diversify if you plan to use stable coins for long-term savings for interests.\n\nIf you are for just short-term trading, just use whatever you want (the one with more liquidity/ more trading pairs/less trading fees   on the chain you want to farm.)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8yx33j",
                    "author": "leirmunumms",
                    "score": -6,
                    "created_utc": 1652808319.0,
                    "response": "Thank me later ❤️🙏 https://www.youtube.com/watch?v=tDZtBzqow6Q",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ypyqf",
                    "author": "StrangerDistinct6378",
                    "score": -4,
                    "created_utc": 1652805455.0,
                    "response": "Support the Luna burn\n\nhttps://agora.terra.money/t/proposal-burn-and-remedy-fee-with-each-luna-transaction/12176",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8z2j98",
                            "author": "Lee911123",
                            "score": 2,
                            "created_utc": 1652810493.0,
                            "response": "just let it die ffs, not all coins were meant to survive\n\ndont try to kick a dead horse dude",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8z99l5",
                                    "author": "StrangerDistinct6378",
                                    "score": 1,
                                    "created_utc": 1652813244.0,
                                    "response": "If this had happened to you then you would probably change your tune. No reason for you to say anything negative. Get over yourself.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8z9z16",
                                            "author": "Lee911123",
                                            "score": 1,
                                            "created_utc": 1652813534.0,
                                            "response": "I’ve been rugged multiple times in the past, and I’ve seen solid projects go down 94% from the cycle peak to bottom, it’s pretty much why diversification is very important in crypto (and even better if you’re diversified into other asset classes)\n\nand imo, everyone needs btc in their portfolio to hedge against bear markets since btc usually doesn’t perform as bad in markets like these\n\nand if you’re unaware of which coin i’m referring to, it’s Ethereum from back in 2018, I wasn’t invested back then, but I’ve got friends who were balls deep in crypto at that time, and things weren’t the best irl for them either",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8zc7sv",
                                                    "author": "StrangerDistinct6378",
                                                    "score": 2,
                                                    "created_utc": 1652814449.0,
                                                    "response": "Bought my first amount of BTC in 2016. I've been in the game for a while and have been rugged also. There is still no reason telling people who lost a considerable investment just days ago to shut up about it. Luna is a top 10 coin that went to zero in a matter of hours. If you don't want to see posts about Luna why are you on a crypto sub?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8zvhao",
                                                            "author": "Topacogluahmet",
                                                            "score": 2,
                                                            "created_utc": 1652822442.0,
                                                            "response": "exactly",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i905mnz",
                    "author": "EmperorCip",
                    "score": 0,
                    "created_utc": 1652826942.0,
                    "response": "All of them are 💩",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}