{
    "subreddit": "Binance",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "u01ox8",
            "title": "Excuse me? Iphone 14.5?",
            "url": "https://i.redd.it/izfm0nrbdks81.jpg",
            "author": "Step_bro1999",
            "created_utc": 1649536479.0,
            "score": 3,
            "num_comments": 23,
            "subreddit": "binance",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i42wh1f",
                    "author": "davidhepworth_",
                    "score": 13,
                    "created_utc": 1649537266.0,
                    "response": "iPhone 14,5 is the model identifier for the phone. Each Apple product has a model identifier, the iPhone 12 is 13,2.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "tz0ded",
            "title": "Hacked? Free Money? Confused.",
            "url": "https://www.reddit.com/r/binance/comments/tz0ded/hacked_free_money_confused/",
            "author": "MessyCans",
            "created_utc": 1649413339.0,
            "score": 3,
            "num_comments": 39,
            "subreddit": "binance",
            "selftext": " so probably ~1 year ago, I tried to buy some eth to get into a crypto currency game. When I realized binance could take a week+ to actually give me the crypto, I did not go through with the purchase. I contacted binance support and told them to cancel it. Months later I realized they gave me the crypto even tho i didnt pay (but obviously couldnt withdrawl) Fast forward to now, I'm getting multiple emails. \n\nFirst email says I sold 0.xxxx ETH. Second confirming I just paid back my chargeback amount and they will restore access to my account. Last email just says \"Thank you for your deposit. To confirm its status, please visit your deposit and withdrawal history.\" I'm so confused, because I have no tried to log into my binance for months. \n\nFor reference, eth went up 50% since i initially bought the amount from almost a year ago, so Its saying i still have money in my binance even tho I never paid for shit. What should i do? I dont want this to affect my taxes and stuff. should I tell binance to cancel my account or something?",
            "stickied": false,
            "comments": [
                {
                    "id": "i3vsbwk",
                    "author": "swsquid",
                    "score": 10,
                    "created_utc": 1649413797.0,
                    "response": "You move it to a different wallet and enjoy your free money.  Wtf kind of question is this",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i3vsok5",
                    "author": "atomicgirlwonder",
                    "score": 3,
                    "created_utc": 1649414053.0,
                    "response": "Why would it take a week? Sounds fishy.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ukfbt2",
            "title": "Can I top up EUR to my Visa Binance card?",
            "url": "https://www.reddit.com/r/binance/comments/ukfbt2/can_i_top_up_eur_to_my_visa_binance_card/",
            "author": "nicklolololololol",
            "created_utc": 1651936294.0,
            "score": 8,
            "num_comments": 25,
            "subreddit": "binance",
            "selftext": "After the CDC slashed rewards, I'm looking into Binance Visa Card in combo with Curve card to have a decent cashback (holding 1 BNB) on my day to day transactions. Now, it's unclear to me if I can only buy crypto on the Visa Binance Card and pay with that, or I can also top up FIAT and pay with EUR? If so, what is the process?",
            "stickied": false,
            "comments": [
                {
                    "id": "i7ove76",
                    "author": "zyro99",
                    "score": 4,
                    "created_utc": 1651939515.0,
                    "response": "Use SEPA for deposit and then you can pay with EUR without fee. If you pay with crypto (is also possible, but not necessary) you may have a 0,9% fee.\n\nI moved also from CDC :)",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}