{
    "subreddit": "Binance",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "urt163",
            "title": "CZ Says Binance Supports Proposal to Compensate LUNA Retail Users First",
            "url": "https://www.reddit.com/r/binance/comments/urt163/cz_says_binance_supports_proposal_to_compensate/",
            "author": "Boucherdku",
            "created_utc": 1652812376.0,
            "score": 57,
            "num_comments": 9,
            "subreddit": "binance",
            "selftext": "According to Bitcoin.com https://news.bitcoin.com/cz-says-binance-supports-proposal-to-compensate-luna-retail-users-first/ \nBinance CEO Changpeng Zhao (CZ) tweeted after his exchange was chastised for its handling of LUNA tokens that any compensation for LUNA holders must prioritize protecting the interests of retail users. He claimed that Binance has already taken the lead by opting to be compensated last. The Luna Crash affected Bitcoin which saw a drop from 30,000 to 25,000 and this in turn affected most cryptos especially those with large ecosystems like Solana and Exeno. This is a story for another day however \n\nZhao revealed to his followers in the most recent Twitter thread in which he addresses the controversy surrounding the LUNA token crash that Binance had received 15 million LUNA tokens in exchange for a $3 million investment. The LUNA, whose value once peaked at $1.6 billion, \"still sits on the address we received at,\" according to the Binance CEO. \"I've never moved or sold anything.\" \n\nSimilarly, the 12,000,000 UST earned by Binance through staking remain at the same address, according to Zhao. He claimed they were never moved or sold.\n\nDespite holding significant amounts of both LUNA and the UST stablecoin, Zhao stated that the Binance team agreed to prioritize compensating retail users first. He stated: \n\nNow comes the crucial part. To set a good example for PROTECTING USERS, Binance will let this go and request that the Terra project team compensate retail users first, and Binance second, if at all. Binance fully supports this proposal (after a 5-minute discussion).\n\nIn response to CZ's endorsement of a compensation plan first proposed by a Twitter user known as Persian Capital, some of Binance CEO CZ's followers argued that this approach was incorrect because it would disadvantage those heavily invested in LUNA. SEIF Motawi, a Twitter user, stated: \n\n\"This is completely incorrect. What about those who put money into LUNA and lost their entire life savings? \"Do they not deserve to be compensated as well?\" \n\n\"Brilliant!\" said another user, Veronica. Those of us who purchased UST or luna and transferred it to Binance, Metamask, or another platform, for example, were duped. Make the rich richer while making the poor poorer! excellent work.\" \n\nYea However, some users who claim to have lost funds are praising the position taken by the Binance CEO, but ask if this proposal can be implemented.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8zgt4c",
                    "author": "zionmatrixx",
                    "score": 13,
                    "created_utc": 1652816327.0,
                    "response": "Terra's entire Legal Team has resigned.\n\nGrowing sentiment Do Kwon may have committed fraud.\n\nhttps://www.theblockcrypto.com/post/147390/terraform-labs-legal-team-resigns-after-ust-collapse",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i90xiap",
                            "author": "CutoutThrowAwayMan",
                            "score": 1,
                            "created_utc": 1652840160.0,
                            "response": "I don't know if one equals the other. I might consider that they resigned for a variety of reasons other than Do Kwon committed fraud. Project fails, legal team decides there are better opportunities and moves on for example.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i914wcm",
                            "author": "Yoloballsdeep",
                            "score": 1,
                            "created_utc": 1652843830.0,
                            "response": "Unless you don't consider Ponzi schemes fraud then it is definitely fraud. 20% APY on Anchor like wtf did you really think this is legit? Some people were making 80% APY using MIM. How is this sustainable? You can't just create wealth out of thin air.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8zq4hc",
                    "author": "E-renter",
                    "score": 3,
                    "created_utc": 1652820196.0,
                    "response": "CZ and Binance are legit and so good for the crypto space",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i915cbo",
                            "author": "Yoloballsdeep",
                            "score": 1,
                            "created_utc": 1652844055.0,
                            "response": "Cult of personality",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i904s54",
                            "author": "aepac",
                            "score": -4,
                            "created_utc": 1652826559.0,
                            "response": "Why?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i914663",
                    "author": "Yoloballsdeep",
                    "score": 1,
                    "created_utc": 1652843450.0,
                    "response": "CZ bail out",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i902x4u",
                    "author": "Master-Monitor112",
                    "score": -4,
                    "created_utc": 1652825704.0,
                    "response": "At least no uk retailers invested. I guess it ended up being a good thing after all that uk retailers were banned from investing into crypto.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i90ku16",
                    "author": "o3accordv6spac",
                    "score": -1,
                    "created_utc": 1652834185.0,
                    "response": "thank me later🙏❤️ https://www.youtube.com/watch?v=tDZtBzqow6Q",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}