{
    "subreddit": "Binance",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "upnl8d",
            "title": "Binance On Friday Resumed Spot Trading for LUNA and UST Post Crash After Multiple Decimals had been added. Will Luna ever Recover?",
            "url": "https://www.reddit.com/r/binance/comments/upnl8d/binance_on_friday_resumed_spot_trading_for_luna/",
            "author": "ElizaAdalynn343",
            "created_utc": 1652553844.0,
            "score": 15,
            "num_comments": 8,
            "subreddit": "binance",
            "selftext": "Binance crypto exchange has announced that it resumed spot trading for LUNA/BUSD and UST/BUSD trading pairs. Starting today, 14:00 (UTC), the exchange has recommenced spot trading. Additionally, deposits and withdrawals for LUNA and UST will also be unbolted simultaneously with the trading.  \n\nLUNA actually shook me and obviously the entire crypto world when its price value plummeted to a worse stage. As of now, LUNA is registered at a price of $0.00005108, with a nearly 99% downtick.  Along with the latest market dip that had seen many tokens like FTM, ALGO, ZTX and MATIC experience lowest prices since 2021. \nLUNA on the other hand has crashed massively during the last couple of days. From an all-time high of around $119, LUNA crashed down to the above-mentioned price at the moment of writing this article.  The price demise of LUNA was accompanied with the stablecoin TerraUSD crash, which went down to $0.1 at the current moment. One might argue that the crash of TerraUSD led LUNA to fall to unimaginable lows.  Yet with all that happening during the last week,\n LUNA seems to be recovering. Do Kwon, the founder of Terraform Labs, announced its recovery plans in a series of tweets.  Yes it's a dead coin but being at its lowest, wouldn't it be worth the risk to throw in some few $ and see what happens?",
            "stickied": false,
            "comments": []
        },
        {
            "id": "upmdx6",
            "title": "The Elliott wave rule of alteration forecasts a $70 target price for the Binance currency. Will BNB fall that low?",
            "url": "https://www.reddit.com/r/binance/comments/upmdx6/the_elliott_wave_rule_of_alteration_forecasts_a/",
            "author": "Megan76566",
            "created_utc": 1652550231.0,
            "score": 9,
            "num_comments": 7,
            "subreddit": "binance",
            "selftext": "According to FXStreet, https://www.fxstreet.com/cryptocurrencies/news/elliott-waves-rule-of-alteration-suggests-a-70-target-for-the-binance-coin-price-202205132113?_gl=1*1ibmh3e*_ga*YW1wLVBMNm1xOWxCT2dxVHFGaFJuNzdVTDlkS3V4bVVfNGpKMWVoSjJ3ajQ5U0tXUnJuRGFka1lUbTNvUjZDSmFWZWk. \n\nThe Binance coin price provides several grounds to believe that a macro bottom might occur inside the $70 price range. According to Elliott Wave theory, corrections after an impulsive wave should have different price action. For example, if wave 2 is corrective, deep in price retracement, and takes little time to complete, wave four will usually be shallow in price retracement and can take a long period to complete the corrective structure.  It should be noted that the cryptocurrency market is generally in decline with bitcoin moving from 31,000 mark to 25,000 mark in the space of 24 hours on the 11th - 12th of May before rising back to the 29,000 mark 24 hours later. This has affected other cryptos one way or the other including Solana which is a large ecosystem that powers a lot of NFTs and Quint which also powers NFT and has a good ecosystem.\n\nBinance coin prices show shallow wave two corrections dating back to 2016. Even the current impulsive rebound that began after the Pandemic lows depicts shallow corrections with relatively brief times to complete the corrective structures. As a result, the Binance Coin Price is likely to undergo a time-consuming deep wave four correction.\n\nA Fibonacci retracement level of 61.8 percent around the $700 all-time high since the epidemic lows predicts a retracement level of $77. As a result, the bearish macro thesis is more complicated. The downturn could take months or even years to play out, but it is unquestionably a plausible scenario that long-term investors should be aware of. \n\nNonetheless, markets rarely fall in a straight line. The BNB price may experience attractive countertrend rallies in the coming weeks. The current bearish downtrend is invalidated at $357. If the bulls can break through this level, the BNB price might hit $470, representing a 75% rise over the current Binance coin price.",
            "stickied": false,
            "comments": []
        },
        {
            "id": "upjgkx",
            "title": "Australia’s first Bitcoin and Ethereum ETFs launched by Cboe Australia and ETF Securities",
            "url": "https://www.theblockcrypto.com/linked/146958/australias-first-bitcoin-and-ethereum-etfs-launched-by-cboe-australia-and-etf-securities?utm_source=coinmarketcap&utm_medium=rss",
            "author": "Puzzleheaded_Top_794",
            "created_utc": 1652541710.0,
            "score": 3,
            "num_comments": 1,
            "subreddit": "binance",
            "selftext": "",
            "stickied": false,
            "comments": []
        }
    ]
}