{
    "subreddit": "Binance",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uwazr4",
            "title": "Unable to verify",
            "url": "https://www.reddit.com/r/binance/comments/uwazr4/unable_to_verify/",
            "author": "ReZMeee",
            "created_utc": 1653341635.0,
            "score": 2,
            "num_comments": 15,
            "subreddit": "binance",
            "selftext": "Hey everyone, I have been trying to withdraw my fiat into my bank account for some time now but in order to do that Binance stated that I must verify my identity again (I did that once before) I tried verifying around 5 times and every time it failed. Does anyone have any solutions or ideas, or has this happened to someone other than me?",
            "stickied": false,
            "comments": [
                {
                    "id": "i9s4ijk",
                    "author": "BinanceCSHelp",
                    "score": 1,
                    "created_utc": 1653376173.0,
                    "response": "First of all, we would like to express our sincere apology for any inconvenience caused.\n\nBinance requires all users to complete Identity Verification to increase their account security and to comply with countries’ regulations. Therefore, you might be asked to re-verify your Binance account from time to time. For example, we require existing users to perform Identity Verification again after we upgrade our compliance standards to be fully aligned with the latest regulation\n\nWe're very sorry that we cannot gather or provide any account-specific information for user privacy and security here on Reddit, thus we really appreciate it if you can reach us directly on our Live Chat Support Channel [www.binance.com/en/chat](https://www.binance.com/en/chat) , if you have done so, we kindly ask for the case ID, please share it here and we will check and follow up to you.\n\n  \nThank you so much for your understanding",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9sk4ak",
                    "author": "Realistic_Honey_407",
                    "score": 2,
                    "created_utc": 1653390031.0,
                    "response": "Try binance pay and sell your coin to someone you trust",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9qnkfi",
                    "author": "Master-Monitor112",
                    "score": 1,
                    "created_utc": 1653346097.0,
                    "response": "Everyone in the UK had to get verified again this year.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9r2j2x",
                    "author": "succulent_viability",
                    "score": 1,
                    "created_utc": 1653353467.0,
                    "response": "Have you tried to withdraw through p2p … if they tell you to verify means your verification den was not solid .. so best you can do is to validate your Binance",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9y0qo1",
                            "author": "ReZMeee",
                            "score": 1,
                            "created_utc": 1653491921.0,
                            "response": "I cant withdraw anything because I need to verify my account, which I cannot due to the problem occurring to me.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9sb284",
                    "author": "EinarTh97",
                    "score": 1,
                    "created_utc": 1653382182.0,
                    "response": "I'm having the same problems. All they say is that the picture might be poorly visible or the background too cluttered. \n\nI've tried multiple times, and i don't think i can take better pictures than i already have, and it STILL doesn't work.\n\nI even tried using the pictures i previously used to get myself verified. It worked the first time, so why the hell doesn't it work again? \n\nI haven't figured out how to contact Binance for help either. I just find the same stupid tutorials on how to verify your account, and it doesn't work.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9y0m6l",
                            "author": "ReZMeee",
                            "score": 2,
                            "created_utc": 1653491870.0,
                            "response": "That is also exactly what is happening to me, the same message regarding how poorly the pictures are taken. I have tried to verify around 5 - 7 times and all of the tries failed.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9zuse5",
                                    "author": "EinarTh97",
                                    "score": 1,
                                    "created_utc": 1653518688.0,
                                    "response": "I got an answer from them that they only accept national IDs or passports. I think that's my problem.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}