{
    "subreddit": "Binance",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uowvpr",
            "title": "I have already verified myself and now Binance is asking me to do it again.",
            "url": "https://www.reddit.com/r/binance/comments/uowvpr/i_have_already_verified_myself_and_now_binance_is/",
            "author": "SwaggerSaurus420",
            "created_utc": 1652463038.0,
            "score": 3,
            "num_comments": 6,
            "subreddit": "binance",
            "selftext": "Why do I suddenly need to complete verification? I bought EUR and wanna switch it for BUSD and I can't. I have already verified 1 year ago and now it won't let me do anything unless I verify.\n\nTime is money gentlemen. If I have to wait 3 days for re-verification I will miss out on gains in case we pump... I wanted to buy the low prices.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8hvz40",
                    "author": "ValuableFew3231",
                    "score": 1,
                    "created_utc": 1652473798.0,
                    "response": "It's good that you have verified yourself. Now let Binance verify you.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uq0te4",
            "title": "CZ commented on Do Kwon’s plan to “revive” Terra (LUNA)",
            "url": "https://www.reddit.com/r/binance/comments/uq0te4/cz_commented_on_do_kwons_plan_to_revive_terra_luna/",
            "author": "CWCOfficial",
            "created_utc": 1652599669.0,
            "score": 26,
            "num_comments": 25,
            "subreddit": "binance",
            "selftext": "Binance CEO Changpeng Zhao (CZ) has revealed that he doesn’t believe Do Kwon’s plan to save LUNA will succeed after the Terra co-founder announced his proposal to [convert LUNA to a new version](https://cryptowallcity.com/do-kwon-officially-spoke-terra-restoration-plan/) for revival ecosystem on May 13.\n\n>*“This is not going to work. Forking does not bring any value to the new fork. That is wishful thinking. It is not possible to invalidate all transactions that rely on an old snapshot, both on-chain and off-chain.”*\n\n&#x200B;\n\n[CZ commented on Do Kwon’s plan to “revive” Terra \\(LUNA\\)](https://preview.redd.it/a0ktdkhpdlz81.jpg?width=640&format=pjpg&auto=webp&s=e7f1523a538d179de27459ed1829296dbc472997)\n\nRead more: [https://cryptowallcity.com/cz-commented-on-do-kwons-plan-to-revive-terra/](https://cryptowallcity.com/cz-commented-on-do-kwons-plan-to-revive-terra/)",
            "stickied": false,
            "comments": [
                {
                    "id": "i8oi9wr",
                    "author": "Still_Lobster_8428",
                    "score": 10,
                    "created_utc": 1652609930.0,
                    "response": "Yeah, this will be a fucking death blow for LUNA. Earlier holders will push for this though as they were most disadvantaged by the minting inflation to try hold peg. \n\nThey think you can just invalidate all the extra tokens and the people who bought them cheap so that earlier holders get made \"whole\".... What they fail to grasp is that doing it that way destroys all trust in the project of everyone external and the project never gains the influx of new users after tge fork and it withers and dies over the next 6-12mths. \n\nIf they go this direction, they would have to not warn the wider market, pick a date and time and halt the blockchain. At that moment, whatever the trading value was of ALL tokens minted after the snapshot from before the crash, get reimbursed at current market value to those new holders. Burn the new tokens, then fork or do whatever. \n\nIt's the only way to even hope that the wider market might trust LUNA again. Without that trust, no fork can save this clusterfuck! It will just be a circle jerk of OG holders who eventually realise not enough new money is entering to increase the bag value enough to exit. \n\nSeen it happen over and over and over and over again! Mark this comment and check back in in 12mths. \n\nI really hope for OG holders it works out....  but sadly, it won't.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8qgyb5",
                            "author": "viemzee",
                            "score": 2,
                            "created_utc": 1652645444.0,
                            "response": "You are right. Worst than that, holders that will recover their coins will mass sell the instant they get it to recover their loss. Luna will tank again to the same level we see now. And that time, no one will buy it back at low levels.\n\nThe only way out for Luna, if that is even a possibility, is moving forward from where it is now. Find a niche somewhere and gradually crawl out of the hole it buried itself in.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8od43b",
                    "author": "AngelVirgo",
                    "score": 6,
                    "created_utc": 1652605457.0,
                    "response": "Oh, no. Sell!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ou0ua",
                    "author": "TREDA87",
                    "score": 4,
                    "created_utc": 1652618411.0,
                    "response": "What your CEO has done in the case of Luna is a crime, normally your platform should be subject to audit and search, you are normally the number 1 platform in the world, while your actions have shown quite the opposite. You announced the end of trading on the Luna pairs, without putting it in the form of a message on the interface \"Trades\" of the application, while you know that the traders at the time are all on the charts, know that we are not always on Twitter, reddit or Binance announcement ... So you play with the tools, to create this scam, the proof is that Luna to drop a thousandth in not even 20min, from 0.045 usdt to 0 usdt You have created wealth for a few (yours) and you have swindled money to others. What happened with the Terra Luna Foundation is surely a strategic, technical and financial problem. But you, it's totally different, you have created a panic situation (snowball effect) to create the opportunity in a malicious way. I believe that Binance users should stop believing in your official announcements.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8shad7",
                            "author": "iscreamezy",
                            "score": 1,
                            "created_utc": 1652682506.0,
                            "response": "💯 well said.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8ok7a1",
                    "author": "Confident_Scallion_9",
                    "score": 2,
                    "created_utc": 1652611544.0,
                    "response": "It would be interesting to see what happens 🙂 it's a lottery",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ow55d",
                    "author": "dman1314",
                    "score": 2,
                    "created_utc": 1652619640.0,
                    "response": "Scumbs will always be scumbags!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8pxhq8",
                    "author": "ChilligansIsland76",
                    "score": 1,
                    "created_utc": 1652636824.0,
                    "response": "Upvote.  Great points.  I think it would be better to burn.  A lot of double dipping could occur or pre-collapse investors also buying the dip.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8q3i7p",
                            "author": "OshoBaadu",
                            "score": 1,
                            "created_utc": 1652639465.0,
                            "response": "Very true.  Most would have jumped back in for the killing.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8qq355",
                    "author": "Independent_Sky_1512",
                    "score": 1,
                    "created_utc": 1652649426.0,
                    "response": ".",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8qsssn",
                    "author": "GMxD69",
                    "score": 1,
                    "created_utc": 1652650603.0,
                    "response": "Buy & hold",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8r4bm0",
                    "author": "LukyLukyLu",
                    "score": 1,
                    "created_utc": 1652655882.0,
                    "response": "my plan to revive luna coin:\n\nrename it to tesla stock.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8sa0tb",
                    "author": "Asleep_Win_8650",
                    "score": 1,
                    "created_utc": 1652677277.0,
                    "response": "Shinobiverse will launch on PINKSALE on the 17th of May! \n\nIt is an open-world P2E Unreal Engine/ Unity realistic graphics RPG. Shinobi is a Triple-A gaming project that fully integrates NFTs with In-game economy. Earn cryptocurrency while playing a quality game.\n\nThe team is Kyced and doxxed, if interested join the telegram: https://t.me/shinobiversegame\n\nCheck out their office and studio: https://youtu.be/fMOmfAqSKRY\n\nWeb: www.shinobiverse.io\nTwitter: https://twitter.com/Shinobiverse_io\n\nPresale link: https://www.pinksale.finance/#/launchpad/0xc5175b363763047D456ABCFEfD06198D6E32fEe0?chain=BSC",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i90b6a2",
                    "author": "Blackhat323",
                    "score": 1,
                    "created_utc": 1652829553.0,
                    "response": "Be aware of the Revive Terra scam link going around. I know multiple people who approved transactions on MM today for an \"airdrop\" and lost their funds.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}