{
    "subreddit": "Binance",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uu522f",
            "title": "BNB Chain offers another lifeline to Terra ecosystem projects",
            "url": "https://www.reddit.com/r/binance/comments/uu522f/bnb_chain_offers_another_lifeline_to_terra/",
            "author": "ElizaAdalynn343",
            "created_utc": 1653073054.0,
            "score": 33,
            "num_comments": 21,
            "subreddit": "binance",
            "selftext": "Binance will welcome migration and offer support to Terra ecosystem (LUNA) projects following the breakup this month of the decentralized finance platform (DeFi) and its algorithmic stablecoin.\n\nIt was a matter of hours before it became clear that after Terra's massive collapse, large amounts of funds withdrawn from Terra were moved to BNB, more precisely to Stader, the Minosis Token project or various decentralized protocoins such as PancakeSwap for staking.\n\nWell the BNB blockchain (BNB) has committed to provide investment and support to projects that are considering migrating from the Terra ecosystem following the biggest black swan event to hit the cryptocurrency space in recent years.\n\nStader Labs will become one of the first projects in the Terra ecosystem to begin integrating into the BNB blockchain. The company builds liquid betting solutions on four blockchains, namely Solana (SOL), Near (NEAR), Fantom (FTM) and Hedera (HBAR), and is poised to offer BNB liquid betting through a recently announced partnership.\n\nUsers will be able to make BNB stakes on Stader and receive returns through the platform, while the company will also issue a staking derivative representing BNB's holdings as stakes, which users can use on DeFi protocols.\n\nBinance is not the only cryptocurrency company offering support to beleaguered projects within the Terra ecosystem. Telos has also announced its support for Terra ecosystem developers and projects this week and will work to accelerate migrations of decentralized applications, or DApps, that were operating in the Terra ecosystem - including investments, marketing support and technical assistance.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9d668a",
                    "author": "otavio1209",
                    "score": 1,
                    "created_utc": 1653074429.0,
                    "response": "Blz",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9exjwe",
                    "author": "prokeep15",
                    "score": 1,
                    "created_utc": 1653106375.0,
                    "response": "Black swan event implies no one saw this coming. \n\nHelen Keller and Ray Charles saw $Luna inevitability failure coming.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9gunv8",
                    "author": "yeeeeman27",
                    "score": 1,
                    "created_utc": 1653152109.0,
                    "response": "I got sent this on facebook, anybody else seen it? amazing event right now [https://elons-x2.org](https://elons-x2.org)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9nu33z",
                    "author": "ShabbySuburb",
                    "score": 1,
                    "created_utc": 1653294655.0,
                    "response": "20% was UST in my stablecoins portfolio. I held it on Anchor. I took them out when the course went down to $0.95, deciding to protect myself from spilling lower. I just happy that I swapped them to BUSD and added the same 20% to BUSD LP on wowswap",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9oeyn7",
                    "author": "SejrosXDD",
                    "score": 1,
                    "created_utc": 1653310410.0,
                    "response": "Its crazy... anybody else seen this? best day for crypto to be honest [https://x2emusk.org](https://x2emusk.org)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9rgql9",
                    "author": "Nervous_Key_4158",
                    "score": 1,
                    "created_utc": 1653360339.0,
                    "response": "I'm already down by 10k$ and  couldn't participate if i wanted to. Would be avoiding stablecoins for now and stick with p2e like shiryo and axie infinity.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ejxz6",
                    "author": "Asleep_Win_8650",
                    "score": 0,
                    "created_utc": 1653098739.0,
                    "response": "Currently aped on @BabyLunaInuERC🚀\n\n$BLI is Deflationary token on the #ETH #Blockchain that offer rewards to the holders.\n\nLiquidity locked for 30 Days\n\nJoin Telegram :\nhttps://t.me/BabyLunaInuErc",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}