{
    "subreddit": "Binance",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "us6kw6",
            "title": "Binance Support Thread",
            "url": "https://www.reddit.com/r/binance/comments/us6kw6/binance_support_thread/",
            "author": "Binance",
            "created_utc": 1652855476.0,
            "score": 14,
            "num_comments": 242,
            "subreddit": "binance",
            "selftext": "Dear Binancians,\n\nWe use this thread to consolidate any support questions or queries into one place.\n\nPlease keep in mind that for the safety and the privacy of our users, we do not ask for, or otherwise provide account-specific information on Reddit. Please understand our intention, and cooperate with us by starting a chat with our [official support](https://www.binance.com/en/chat?ref=JLI1VBLA&utm_source=BinanceReddit&utm_medium=GlobalSocial&utm_campaign=GlobalSocial) for us to be able to assist you. Please do note any support requests outside of this thread will not be attended to, thanks for understanding.\n\n[Click here for official Binance support.](https://www.binance.com/en/chat?ref=JLI1VBLA&utm_source=BinanceReddit&utm_medium=GlobalSocial&utm_campaign=GlobalSocial) *Make sure you login and* ***provide your email or phone number,*** *select your issue from the options, if your issue wasn’t answered click* ***‘unresolved’*** *and type* ***‘human’*** *to interact with our live support team, then click* ***‘okay’*** *to proceed.*\n\n*Do not hesitate to help your fellow Binancians as long as their inquiry is a general one, however attempting to engage in sensitive matters, or providing wrong information will lead to the comment being removed.*\n\n\\-----------------------------------\n\n**How to post about your case**\n\nPlease follow this format:\n\n1. Comment on this thread with your case ID (please ensure your case ID is still valid before posting)\n2. Provide a description of your issue (we’ve included a few common problems below)\n\nIf your case gets resolved, please delete your comment. Or, at least update it to say resolved. This will help users that still need help get the attention they need. Thank you!\n\n***Please note:*** *We can’t help you unless you provide us with a valid case ID. Users with Binance US cases will have to refer to* [*r/BinanceUS*](https://www.reddit.com/r/BinanceUS/)\n\n[**To get a case ID you must start a live chat with support.** Click here, select ‘unsolved’ and type ‘human’ to join the live CS queue.](https://www.binance.com/en/chat?ref=JLI1VBLA&utm_source=BinanceReddit&utm_medium=GlobalSocial&utm_campaign=GlobalSocial) The case ID will be shown far left of the top bar - alternatively, you can see your case ID in the email or text you receive upon initiating the chat.\n\n\\-----------------------------------\n\n**Common problems & solutions**\n\n**1. Crypto withdrawal suspended**\n\n● You receive a message saying ‘withdrawal suspended due to risk control’ and have been trying to unlock your account.\n\n● Don’t worry, your funds are SAFU. Our agents will try their best to help unlock the withdrawal - please coordinate with our team and provide relevant information when prompted to do so.\n\n● Withdrawal Risk can be triggered by a number of reasons. Risk control is extremely important. Please note that we can only help you if we deem your case to be legitimate, if you have attempted to hack an account and request for unsuspension, you will be unsuccessful as we have processes in place to prevent this.\n\nOur team works extremely hard to resolve these issues as soon as possible and some cases can take time to resolve but please keep in mind the reason for this is to ensure you, our users, are safe.\n\n**Cases replied by our mods are already in the escalation process. A longer wait after escalation = our team is working hard at investigating the issue.** If there are any updates to the case, our agents will reply to you directly in the chat.\n\nPlease refrain from leaving multiple messages in this thread if your case has already been escalated.\n\n**2. Security issues**\n\n● Report hacked accounts and funds.\n\n● Difficulty to reset 2FA and gain access to your account.\n\n**3. Fiat deposit & withdrawal**\n\n● Fiat (not crypto) is taking longer than expected to arrive in your bank / Binance account.\n\n● Involves intermediaries such as bank transfers or buying crypto with credit/debit cards.\n\n● *Note: It can take up to several working days for the money to be credited to your accounts.* [You can find more FAQ here](https://twitter.com/BinanceHelpDesk/status/1391776637071478787)\n\n**4. US persons accessing old Binance.com accounts for offboarding & withdrawal of funds**\n\n● Your funds are SAFU. If you experience issues with withdrawing remaining funds, follow the above steps to get to our live chat queue - our agents will try our best to assist you with the offboarding.\n\n**5. Trading system and other account issues**\n\n● Spot, margin & futures trading\n\n● P2P disputes\n\n● Binance Visa Card transactions\n\n● Unable to complete KYC\n\n● Any other issues\n\n**Please follow the format stated above, your case cannot be escalated if you do not follow this process and your comment may be removed. Following the format helps us classify and identify the issues, escalate them to our relevant departments and get everyone’s problems resolved.** ***Spamming the feed is unfair to other users and will result in a ban.***\n\nThank you!",
            "stickied": true,
            "comments": [
                {
                    "id": "i95naxr",
                    "author": "Jordanberg78",
                    "score": 3,
                    "created_utc": 1652928365.0,
                    "response": "Why are all previous comments deleted?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9hnwuz",
                    "author": "jd-1900",
                    "score": 3,
                    "created_utc": 1653166110.0,
                    "response": "Case ID #90260228  \nI was at a crypto event. And tried to access there to check my account. I used the WiFi of the event (probably my fault). And when trying to renew a earn product, the said that my account was locked. I tried to get an explanation of what was going on, and I got this insane answer:  \n\n\n>Dear user, We understand your frustration. However, we are not in the position to provide any additional details, except those that had been already provided in the previous message - your account has been flagged due to either due to an internal risk assessment or a geographic restriction and as a result, we are unable to serve you further in accordance with our Terms of Use. As I said before, as soon as I have an answer regarding the funds that you have in Earn, I will let you know. Thank you.  \n\n\nWhen asking how could I get further information, I just got this as a reply:\n\n>Dear user, No one will be able to give you additional details or reasoning. What can be said has already been shared with you.  \n\n\n&#x200B;\n\nThis is mind blowing. But not in a good way. \n\nThe worst thing, I was in the crypto event because we're developing a crytpo project on the BSC.\n\nCould anyone give me some help?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9isvsn",
                            "author": "BinanceCSHelp",
                            "score": 2,
                            "created_utc": 1653187961.0,
                            "response": "Dear user, we are deeply sorry for any inconvenience caused. Please rest assured our team will reply to you as soon as possible regarding your issue, we have marked your case to deal with it in priority, thanks for your patience.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9j4xur",
                                    "author": "jd-1900",
                                    "score": 1,
                                    "created_utc": 1653195578.0,
                                    "response": "Thank you.  \nI really appreciate it, because I depend quite a lot on BNB if I want to deploy a project on the BNB, and personally because of my personal funds. The invonveniences are quite high.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9luws1",
                    "author": "gob130",
                    "score": 3,
                    "created_utc": 1653252781.0,
                    "response": "Case ID #90367976  \nWithdrawals on my account are disabled for several months now with no explanation and no possibility to talk to anyone, few moments ago I have accedinetly deposited to my binance address again which is blocked to withdrawals (because the address is auto saved on my other exhcnage)  and i am not sure what to do. please resolve my case id or return the funds back to the sender. its been several months now.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9nkwvm",
                            "author": "BinanceCSHelp",
                            "score": 1,
                            "created_utc": 1653286645.0,
                            "response": "Hi dear user, upon checking with your case ID it appears that our chat support team has already given you an update on the chat as they have explained it to you that your case is escalated to the relevant team, kindly wait for the process patiently and do not end the chat; you will get a notification as soon as our team has an update. Thank you for your understanding and kind support.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9nlub9",
                            "author": "BinanceCSHelp",
                            "score": 1,
                            "created_utc": 1653287377.0,
                            "response": ">90367976\n\nThank you for contacting us on Reddit, as we checked that the case ID is already endorsed to the relevant team, rest assured your case has been acknowledged, and kindly wait patiently on the response on the Live Chat, we have followed your case and pushed the team to update you the soonest possible time. Thank you for your understanding.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9yqi3w",
                            "author": "Eileen771177",
                            "score": 1,
                            "created_utc": 1653501988.0,
                            "response": "Is the wind control frozen?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i93akmg",
                    "author": "SoooBueno",
                    "score": 2,
                    "created_utc": 1652891600.0,
                    "response": "Waiting for a wire transfer to land. How long does it take before it will be available?\n\nSupport ticket #2395215",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i95l9dk",
                            "author": "BinanceCSHelp",
                            "score": 1,
                            "created_utc": 1652927353.0,
                            "response": "Please head to the r/BinanceUS subreddit as binance.com and binance.us are separate platforms, if you have an inquiry related to binance.com do not hesitate to share your Case ID with us.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9yrhpl",
                            "author": "Eileen771177",
                            "score": 1,
                            "created_utc": 1653502379.0,
                            "response": "Wire transfer in the morning, the afternoon will be fine, if it is the afternoon will need the next day",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i96of5l",
                    "author": "NorthCry2024",
                    "score": 2,
                    "created_utc": 1652955509.0,
                    "response": "Hello Binance support,\n\nI just wanted to say thank you for very fast CS. I red many scary comments accross reddit, that people cant unfreeze accounts for month.\n\nFor me it took just two days, special shoutout to Binance Zendesk support Michael. He was responding to my SOW updates after 30 mins only.\n\nAlso want to tell to everyone else, if your account gets frozen, dont be scared and dont read those scary stories. Binance has to do it because of criminals that were using Binance previously for their dirty things.\n\nSource Of Wealth report comes in google doc to your email. And all they want to know, that you are indeed real person, that has nothing to hide. If its your own hard earned crypto via different chains, you are 100% fine, just cooperate with support. This way they try to catch money laundering operations, hackers or simply stolen crypto.\n\nGood luck everyone",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9kc1jm",
                            "author": "1abern",
                            "score": 1,
                            "created_utc": 1653228419.0,
                            "response": "Hi, thank you for this post. \n\nHow did you access this person? I’ve been speaking to customer service who have been passing me around for over a week. \n\nI’ve been using the live chat and they have not been helpful whatsoever. \n\nThanks in advance.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9ypypm",
                                    "author": "Eileen771177",
                                    "score": 1,
                                    "created_utc": 1653501776.0,
                                    "response": " How long have you been using the Cryptocurrency exchange",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9b2yfe",
                    "author": "Captain-Sankey",
                    "score": 2,
                    "created_utc": 1653038626.0,
                    "response": "Case ID: #90189519\n\nFor a bank transfer the reference that is required exceeds the character limit for allowed references in the HSBC banking app. Any way round this/is this a big issue ?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ba7x5",
                            "author": "BinanceCSHelp",
                            "score": 1,
                            "created_utc": 1653044231.0,
                            "response": "Hi dear user,  the Case ID you shared with us has ended. If your issue still persists, please initiate a new chat on our live chat support system.  \n1. Go to binance.com  \n2. Click the chat symbol that is on the bottom right of the webpage.  \n3. Select the closest category to your issue (please type your issue with a couple of keywords), and connect to chat.  \n4. After the automatic reply from the chatbot, please choose \"\"Unsolved\"\" and then click to \"\"Leave Message now\"\" and leave your message. We will assign an agent to assist you as soon as possible, kind regards",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9sg0th",
                    "author": "Former_Possibility68",
                    "score": 2,
                    "created_utc": 1653386745.0,
                    "response": "Hi, \nDoes Binance have any plans to start supporting SEPA Instant? It would be really helpful if bank transfers were instant.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9vsa38",
                            "author": "BinanceCSHelp",
                            "score": 1,
                            "created_utc": 1653443080.0,
                            "response": "Dear user, SEPA Instant is available any time of day. However, users are advised to consult their bank regarding the availability of SEPA Instant and possible fees charged by your bank. For more detailed guide you can check; [https://www.binance.com/en/support/faq/360044359251](https://www.binance.com/en/support/faq/360044359251)\n\nKind regards",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9yszw1",
                            "author": "Eileen771177",
                            "score": 1,
                            "created_utc": 1653502970.0,
                            "response": "I guess not so fast.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9x1fqn",
                    "author": "Sea_Particular1453",
                    "score": 2,
                    "created_utc": 1653473261.0,
                    "response": "Hello I sent BUSD to someone with binance pay I just used their email it was before I had set up the password and stuff. It says that that they have it now in their spot wallet but it cant be used its not available help please.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia19n47",
                            "author": "BinanceCSHelp",
                            "score": 1,
                            "created_utc": 1653545561.0,
                            "response": "Dear user, thanks for contacting us on reddit. For the safety and the privacy of our users, we do not ask for or provide account specific info on reddit. Please understand our intention, and cooperate with us by starting a chat from our official site for us to be able to assist you.  \nTo start a live chat with our support:  \nGo to http://binance.com  \nClick the chat symbol that is on the bottom right of the webpage.  \nSelect the closest category to your issue (please type your issue with a couple of keywords), and connect to chat.  \nAfter the automatic reply from the chatbot, please choose \"Unsolved\" and then click to \"Leave Message now\" and leave your message. We will assign an agent to assist you as soon as possible, kind regards.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i91qmzr",
                    "author": "mikektay",
                    "score": 1,
                    "created_utc": 1652858880.0,
                    "response": "Why does GBP withdrawals keep failing",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i970tca",
                            "author": "PotentialSpread963",
                            "score": 2,
                            "created_utc": 1652963655.0,
                            "response": "and why is Binance deleting questions about Rejected/Congested Solana withdraws?",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i91u52q",
                            "author": "BinanceCSHelp",
                            "score": 1,
                            "created_utc": 1652862078.0,
                            "response": "Hi dear user, this might be related to your account status or the card you are trying to use. Kindly contact us via live chat so we can investigate why it is failing and assist on how you can withdraw your assets .\n\nTo start a live chat with our support:  \n1. Go to http://binance.com  \n2. Click the chat symbol that is on the bottom right of the webpage.  \n3. Select the closest category to your issue (please type your issue with a couple of keywords), and connect to chat.  \n4. After the automatic reply from the chatbot, please choose \"Unsolved\" and then click to \"Leave Message now\" and leave your message. We will assign an agent to assist you as soon as possible, kind regards.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i91ub02",
                                    "author": "mikektay",
                                    "score": 1,
                                    "created_utc": 1652862236.0,
                                    "response": "I have used the same account details for many transactions. So, it’s not the account. \nIt’s a service issue",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i91vnjd",
                                            "author": "BinanceCSHelp",
                                            "score": 1,
                                            "created_utc": 1652863516.0,
                                            "response": "Kindly contact us via live chat so we can assist with your request dear user. Always ready to help 7/24! Thanks",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i91x9nn",
                    "author": "HungMacarthurBull",
                    "score": 1,
                    "created_utc": 1652865034.0,
                    "response": "If LUNA forks into 2.0 and they airdrop coins of the new system to LUNA holders, will that include holder who kept their stash in binance exchange?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i95l6u2",
                            "author": "BinanceCSHelp",
                            "score": 1,
                            "created_utc": 1652927319.0,
                            "response": "Dear user, we are sorry that we cannot confirm about it currently, please kindly keep an eye on Binance official announcement for any updates [https://www.binance.com/en/support/announcement/c-49?navId=49](https://www.binance.com/en/support/announcement/c-49?navId=49) . Thank you.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i93nbun",
                    "author": "1abern",
                    "score": 1,
                    "created_utc": 1652896706.0,
                    "response": "Case ID: 89759743\n\nMy account has been locked. I have sent relevant documentation regarding the source of funds and have been waiting 5 days. I have contacted you every day and have been told to wait each time. It’s absolutely unacceptable. \n\nI need this sorted immediately. Thank you.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i95lit1",
                            "author": "BinanceCSHelp",
                            "score": 1,
                            "created_utc": 1652927484.0,
                            "response": "Hi dear user, upon checking with your case ID it appears that our chat support team has already given you an update on the chat, kindly take a look at your earliest convenience.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i97qfco",
                                    "author": "1abern",
                                    "score": 1,
                                    "created_utc": 1652975168.0,
                                    "response": "The update is “please wait”. As I explained, I’ve been waiting for about a week now. Still nothing has been done.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9kbqxk",
                                    "author": "1abern",
                                    "score": 1,
                                    "created_utc": 1653228276.0,
                                    "response": "My issue is still not resolved. Can you please help me sort it? It has been over a week and I still have not had any feedback. My account is locked. I need it unlocked.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9ta37a",
                                    "author": "1abern",
                                    "score": 1,
                                    "created_utc": 1653403860.0,
                                    "response": "Keeping this here so others can see it.\n\nAfter 10 days, Binance decided to delete my account without any interaction with a person. I was unable to withdraw during this time.\n\nBinance can and will close your account, months down the line, even if you have followed the rules. Your account — your assets — can and will be locked up and stolen from you even as you message them. They will ignore you. They will tell you to be “patient”. Then they will delete your account.\n\nGet your stuff off and into cold storage. You cannot trust Binance. They are just a crypto bank. It’s a disgrace to the concept of cryptocurrency.\n\nYou should be ashamed of yourselves.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i94g9a7",
                    "author": "dankazjazz",
                    "score": 1,
                    "created_utc": 1652908535.0,
                    "response": "So to confirm, US users are still okay to withdraw from  old binance.com accounts but they just need to verify with support?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i95mb3a",
                            "author": "BinanceCSHelp",
                            "score": 1,
                            "created_utc": 1652927869.0,
                            "response": "Dear user, thanks for contacting Binance. US user still could withdraw funds from [Binance.com](https://Binance.com) account. If there any questions about login to account for withdrawal, please contact live support for further assistance via https://www.binance.com/en/chat .",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i94tgpk",
                    "author": "Opposite_Towel1292",
                    "score": 1,
                    "created_utc": 1652914301.0,
                    "response": "Hello. I buy 30 euro Ltc and this failed. But when I see my bank account my money is transfer. When I get back the money?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i95mg2q",
                            "author": "BinanceCSHelp",
                            "score": 1,
                            "created_utc": 1652927939.0,
                            "response": "Dear user, please kindly contact our live support for further assistance and checking. To start a live chat with our support:  \n1. Go to http://binance.com  \n2. Click the chat symbol that is on the bottom right of the webpage.  \n3. Select the closest category to your issue (please type your issue with a couple of keywords), and connect to chat.  \n4. After the automatic reply from the chatbot, please choose \"\"Unsolved\"\" and then click to \"\"Leave Message now\"\" and leave your message. We will assign an agent to assist you as soon as possible, kind regards.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i95drol",
                    "author": "thebuffalojack",
                    "score": 1,
                    "created_utc": 1652923843.0,
                    "response": "Why am I recieving verification codes via text message? I have never used or signed up for binance",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i95ml9p",
                            "author": "BinanceCSHelp",
                            "score": 1,
                            "created_utc": 1652928011.0,
                            "response": "Dear user, please kindly contact our live support for further assistance and checking. To start a live chat with our support:  \nGo to http://binance.com  \nClick the chat symbol that is on the bottom right of the webpage.  \nSelect the closest category to your issue (please type your issue with a couple of keywords), and connect to chat.  \nAfter the automatic reply from the chatbot, please choose \"\"Unsolved\"\" and then click to \"\"Leave Message now\"\" and leave your message. We will assign an agent to assist you as soon as possible, kind regards.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i96wyvh",
                    "author": "PotentialSpread963",
                    "score": 1,
                    "created_utc": 1652961446.0,
                    "response": "Is there more info on Solana withdraw suspensions / congestion?  \nI keep getting this since yesterday.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i98jomg",
                            "author": "BinanceCSHelp",
                            "score": 1,
                            "created_utc": 1652986988.0,
                            "response": "Hello dear user, for official announcement, you may check Solana projects social media channels for more information. For Binance, [https://www.binance.com/en/network](https://www.binance.com/en/network) You can find all cryptos list here and about status of deposit/withdrawals. We hope this issue has been resolved soon. Thank you for choosing Binance and we wish you have a pleasant day.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i98ehym",
                    "author": "_raydeStar",
                    "score": 1,
                    "created_utc": 1652984870.0,
                    "response": "Hi guys! \n\nI am in the US - trying to verify using a home address in a legal state, but a license from a banned state. I have tried several times now to verify and keep getting denied. Will I have to have my license switched over before I can verify?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i99n6gq",
                            "author": "BinanceCSHelp",
                            "score": 1,
                            "created_utc": 1653005647.0,
                            "response": "Hi, we are sorry to inform you that binance.com and binance.us are two different platforms, hence we do not have the database of binance.us. Please contact binance.us via the binance.us Support Page. At the same time if you encounter any issues related to binance.com we would be happy to assist you.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i99uqjt",
                    "author": "bigboipockets",
                    "score": 1,
                    "created_utc": 1653009434.0,
                    "response": "Why can’t I withdraw my USD?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ap6j5",
                            "author": "BinanceCSHelp",
                            "score": 1,
                            "created_utc": 1653026966.0,
                            "response": "Hi, please provide us the Case ID of your chat (start a new chat on binance.com if you don't have a Case ID), we will assign an agent to assist you as soon as possible, kind regards.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9aujel",
                                    "author": "bigboipockets",
                                    "score": 1,
                                    "created_utc": 1653031288.0,
                                    "response": "Never mind, I just have to wait for the funds to settle. Thank you for the reply!!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9cgmpq",
                    "author": "xseraphx",
                    "score": 1,
                    "created_utc": 1653063464.0,
                    "response": "If i'm using the Auto-Invest feature and buying $5 worth of BTC a day, how much am  I paying in fees etc?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9etmw0",
                            "author": "BinanceCSHelp",
                            "score": 1,
                            "created_utc": 1653104035.0,
                            "response": "Dear user, may we know did you refer to the Binance earn products? Please notice that there is no fee needed for Binance earn products, you could check more infos about Binance earn via [https://www.binance.com/en/support/faq/bc076f0eb7fb4ae182de6c5eb8968dec](https://www.binance.com/en/support/faq/bc076f0eb7fb4ae182de6c5eb8968dec) . Thanks for your support.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9ewykv",
                                    "author": "xseraphx",
                                    "score": 1,
                                    "created_utc": 1653105998.0,
                                    "response": "Yes, Binance earn. What about like the spread/markup etc? Is it like buying from spot with no fees/markup or how does that work? The link above doesn't have much info about auto-invest feature. Thanks for your response.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9e0nqa",
                    "author": "Pale_Bluejay3946",
                    "score": 1,
                    "created_utc": 1653088629.0,
                    "response": "Hello Binance support I wanted to ask u that I have withdrew my coins and send them to my account it says the transaction is completed but when ever I put the ID on the support service to see what’s the situation it shows nothing also how much time will it take for the money to get into my account ?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ety6p",
                            "author": "BinanceCSHelp",
                            "score": 1,
                            "created_utc": 1653104211.0,
                            "response": "Dear user, for the safety and the privacy of our users, we do not ask for or provide account specific info on Reddit. Please understand our intention, and please contact our live support for checking and assistance. \n\nTo start a live chat with our support:  \n1. Go to http://binance.com  \n2. Click the chat symbol that is on the bottom right of the webpage.  \n3. Select the closest category to your issue (please type your issue with a couple of keywords), and connect to chat.  \n4. After the automatic reply from the chatbot, please choose \"\"Unsolved\"\" and then click to \"\"Leave Message now\"\" and leave your message. We will assign an agent to assist you as soon as possible, kind regards.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9fl0m0",
                    "author": "AvengerDr",
                    "score": 1,
                    "created_utc": 1653125543.0,
                    "response": "A few hours ago I received this [email](https://i.redd.it/ndwx1b7zss091.png), citing \"up to 52% locked staking on DOT, AVAX, MATIC, etc. for 21 days.\n\nOnce logged in I don't see any 21 period available. It's already gone?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9inr83",
                            "author": "BinanceCSHelp",
                            "score": 1,
                            "created_utc": 1653185122.0,
                            "response": "Hi dear user, please provide us the Case ID of your chat (start a new chat on binance.com if you don't have a Case ID), we will assign an agent to assist you as soon as possible, kind regards.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9fn2z1",
                    "author": "Wurschtbude",
                    "score": 1,
                    "created_utc": 1653127468.0,
                    "response": "Hey Support, got a Problem. I can't remember my pattern to unlock, so i want to change it, is there a way to do it, without knowing my old pattern?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9inuvm",
                            "author": "BinanceCSHelp",
                            "score": 1,
                            "created_utc": 1653185178.0,
                            "response": "Hi dear user, please provide us the Case ID of your chat (start a new chat on binance.com if you don't have a Case ID), we will assign an agent to assist you as soon as possible, kind regards.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9g7fuj",
                    "author": "tantiectien",
                    "score": 1,
                    "created_utc": 1653141286.0,
                    "response": "When I go to https://www.binance.com/en/activity/referral/offers/claim?ref=CPA\\_00QDPHSCUB , it says I only receive 100 USDT cashback voucher.  \nBut in the link https://www.binance.com/en/blog/earn/crypto-cheat-codes-best-ways-to-save-and-earn-on-binance-421499824684901605 it says \"Spot: The maximum discount on these referral links will vary based on the referrer, but you can save up to 20% on Binance’s spot market fees just by creating an account through the link. \". So can I still receive a 20% transaction fee discount if I register through my friend's referral link?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9io061",
                            "author": "BinanceCSHelp",
                            "score": 1,
                            "created_utc": 1653185260.0,
                            "response": "Dear user, for the safety and the privacy of our users, we do not ask for or provide account specific info on Twitter. Please understand our intention, and cooperate with us by starting a chat from our official site for us to be able to assist you https://www.binance.com/en/chat, thanks.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9h0j4h",
                    "author": "gulpgulpgulp",
                    "score": 1,
                    "created_utc": 1653154768.0,
                    "response": "Hello, quick question, i have had crypto for a few years, not much, only £17 worth but i want to just get selling and leave the site. Now i have £13 worth of 1 currency and £4 of another, the minimum to sell is £15, is there no way i can somehow withdraw these 2 crytos to my bank account because of that? It so complicated im finding because im a bit clueless, any help would be great.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ipekn",
                            "author": "BinanceCSHelp",
                            "score": 1,
                            "created_utc": 1653186022.0,
                            "response": "Sorry for the inconvenience, you may consider converting both of the small balances into BNB (to consolidate this in one crypto to meet the withdrawal limit amount) [https://www.binance.com/en/my/wallet/account/main/dust](https://www.binance.com/en/my/wallet/account/main/dust) after you convert it into one crypto then you can try to withdraw. Thank you",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9m8z9z",
                    "author": "Skeevan",
                    "score": 1,
                    "created_utc": 1653259514.0,
                    "response": "How can i verify my bank account so i can withdraw GBP through bank transfer",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9nl4bl",
                            "author": "BinanceCSHelp",
                            "score": 1,
                            "created_utc": 1653286806.0,
                            "response": "Hi dear user,  \nCould you please contact our live support for further checking and assistance. To start a live chat with our support:  \n1. Go to binance.com  \n2. Click the chat symbol that is on the bottom right of the webpage.  \n3. Select the closest category to your issue (please type your issue with a couple of keywords), and connect to chat.  \n4. After the automatic reply from the chatbot, please choose \"\"Unsolved\"\" and then click to \"\"Leave Message now\"\" and leave your message. We will assign an agent to assist you as soon as possible, kind regards.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9nvaxb",
                    "author": "R0EF",
                    "score": 1,
                    "created_utc": 1653295805.0,
                    "response": "I want to transfer some euros to my account via bank transfer, but it says: channel suspended. And when I hover over it says: Based on our Terms of Use, these features are not available in your location.  \nIs this a temporary thing? I am based in The Netherlands btw. Thanks!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9nz2zy",
                            "author": "BinanceCSHelp",
                            "score": 1,
                            "created_utc": 1653299302.0,
                            "response": "Hi dear user,  \nCould you please contact our live support for further checking and assistance. To start a live chat with our support:  \n1. Go to binance.com  \n2. Click the chat symbol that is on the bottom right of the webpage.  \n3. Select the closest category to your issue (please type your issue with a couple of keywords), and connect to chat.  \n4. After the automatic reply from the chatbot, please choose \"\"Unsolved\"\" and then click to \"\"Leave Message now\"\" and leave your message. We will assign an agent to assist you as soon as possible, kind regards.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9ysozd",
                            "author": "Eileen771177",
                            "score": 1,
                            "created_utc": 1653502853.0,
                            "response": "Temporary",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9qx0lr",
                    "author": "Accomplished_You2741",
                    "score": 1,
                    "created_utc": 1653350738.0,
                    "response": "Opened a pdf accidentally from an email (certainly scammer) with some text in Russian about Binance, etc… opened on my phone just now. Is there any possibility of being scammed?? I have my funds on crypto.com and Binance exchange with 2FA. What could happen? Should I do anything or nothing to worry about?\nPlease help,\n\nThanks",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9r2zkd",
                            "author": "BinanceCSHelp",
                            "score": 2,
                            "created_utc": 1653353691.0,
                            "response": "Thanks for contacting us on Reddit, kindly delete the email immediately. \n\nAlso, we would like to recommend that you follow the instructions below:  \n\\*Secure your email account  \n\\-Change your email password and ensure 2-step verification is enabled.  \n\\-Check your email account for any rules, filters, or forwarding addresses enabled/added during the attack.  \n\\-Check your email account settings and see if there are any authorized devices you do not recognize.  \n\\*Below are the steps for securing  your devices:  \nIf you have noticed any inconsistency, there is a possibility that your computer has been infected by Trojan or virus. Please follow the following steps to secure your computer.  \n1. install anti-virus software to scan/kill Trojan and viruses as soon as possible;  \n2. disable plug-in/extensions in the browser, uninstall unknown software in the computer;  \n3. Under extreme risk situation, shall format your hard drive and reinstall OS in the computer;  \n4. It is useful to seek help from an information security expert;  \nPlease review the following links in order to learn how to recognize the most common scamming and phishing schemes and how to protect yourself from scammers and hackers: https://www.binance.com/en/support/faq/c-7?navId=7#26",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9ra1h2",
                    "author": "limitlessjan",
                    "score": 1,
                    "created_utc": 1653357081.0,
                    "response": "Seriously annoying that I can’t use it being in Ontario … any other Ontarians here? 😒",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9s19vx",
                            "author": "BinanceCSHelp",
                            "score": 1,
                            "created_utc": 1653373465.0,
                            "response": "Dear user, thank you for contacting us on Reddit. We understand your situation very well. You can always follow our announcements for the latest updates.\n\nhttps://www.binance.com/en/support/announcement",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9ystt5",
                            "author": "Eileen771177",
                            "score": 0,
                            "created_utc": 1653502905.0,
                            "response": "Other exchanges can be used",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9s9v3a",
                    "author": "EinarTh97",
                    "score": 1,
                    "created_utc": 1653381043.0,
                    "response": "Why can't I verify my ID with the same pictures that worked the first time I verified it?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9vqvrn",
                            "author": "BinanceCSHelp",
                            "score": 1,
                            "created_utc": 1653442430.0,
                            "response": "Hi there! Please provide us with your Case ID so we can get our support team to look into the matter for you, thanks.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9wjgnh",
                                    "author": "EinarTh97",
                                    "score": 1,
                                    "created_utc": 1653457986.0,
                                    "response": "Case ID #90544853",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9wzzm4",
                                            "author": "BinanceCSHelp",
                                            "score": 1,
                                            "created_utc": 1653472029.0,
                                            "response": ">90544853\n\nHi there, thanks for your update. Upon checking your case id 90544853, we are so sorry to notice it was unfortunately closed since no response after a certain period of time. Could you help to open a new chat and after the automatic reply from the chatbot, please choose \"Unsolved\" and then click to \"Leave Message now\" and leave your message. We will assign an agent to assist you as soon as possible, kind regards.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9xdebk",
                                                    "author": "EinarTh97",
                                                    "score": 1,
                                                    "created_utc": 1653481313.0,
                                                    "response": "Thanks for the help",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9sj3ao",
                    "author": "lifestyleofabroke",
                    "score": 1,
                    "created_utc": 1653389254.0,
                    "response": "Hello \nI sent usdt to a cryto exchange to get cash using Trc20 but the exchange office said they didn't not receive any money kindly check if that's true please\nInternal transfer 107632233716",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9vtb6o",
                            "author": "BinanceCSHelp",
                            "score": 1,
                            "created_utc": 1653443563.0,
                            "response": "Dear user as per check your withdrawal successfully went through. If you need any further help we kindly advise you to start a new chat on Binance.com and we will assign an agent to assist you as soon as possible, kind regards.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9skpah",
                    "author": "Sessayy",
                    "score": 1,
                    "created_utc": 1653390449.0,
                    "response": "I am new to binance, i noticed that i can stake my crypto and get a 121% in 15 days on alpine, is this legitimate and why is the staking reward so high?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9vw3nr",
                            "author": "BinanceCSHelp",
                            "score": 1,
                            "created_utc": 1653444874.0,
                            "response": "Dear user, \n\nThat is correct, as per check APY given as 121.97% for the duration of 15 days for Alpine ([https://www.binance.com/en/support/announcement/55194cd1f0734aacb1514d01446906db](https://www.binance.com/en/support/announcement/55194cd1f0734aacb1514d01446906db)) The interest rate ( APY) is for 1 year, therefore we kindly remind you to divide the interest to 365, and you can see the daily interest. You can calculate it with this formula:   \n(APY% \\* Deposit / 365)\\] \n\nKind regards",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9tngyh",
                    "author": "Strict_Curve_499",
                    "score": 1,
                    "created_utc": 1653409425.0,
                    "response": "Hey Binance Support I am from europe. And I noticed the 1€ deposit fee for fiat. But it says something about discounted? Do I get the deposit fee back or what does discounted in this case mean?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9w3u9x",
                            "author": "BinanceCSHelp",
                            "score": 1,
                            "created_utc": 1653448633.0,
                            "response": "Dear user, you can check the deposit fee schedule via;  [https://www.binance.com/en/fee/fiatFee](https://www.binance.com/en/fee/fiatFee) those indicated for different methods. If you need any help we kindly advise you to start a new chat on Binance.com for further checking and we will assign an agent to assist you as soon as possible, kind regards.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9vh75h",
                    "author": "-Gling-",
                    "score": 1,
                    "created_utc": 1653437818.0,
                    "response": "Case ID #90536897\n\nI tried to set up a recurrent buy and my new mastercard was declined. I contacted my bank and they authorized the transaction and asked me to try again. But when I tried a second time my transaction was also declined. So I called my bank another time and they told me that they had already authorized the transaction and they couldn't do anything else. They told me to contact you to see if you could do something. I tried many times and all transactions have been declined so far. I don't know what to do.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9w55og",
                            "author": "BinanceCSHelp",
                            "score": 1,
                            "created_utc": 1653449288.0,
                            "response": ">90536897\n\nHi dear user, an agent has been assigned to your case, please be patient as we will do our best to help you in a timely manner.\n\nKind regards",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9w7shk",
                    "author": "lifestyleofabroke",
                    "score": 1,
                    "created_utc": 1653450679.0,
                    "response": "I mean please kindly check if the reciever wallet is still active",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia19xlf",
                            "author": "BinanceCSHelp",
                            "score": 1,
                            "created_utc": 1653545787.0,
                            "response": "Dear user, we are sorry that we unable to help without any detailed and needed information. For the safety and the privacy of our users, we do not ask for or provide account specific info on Twitter. Please understand our intention, and cooperate with us by starting a chat from our official site for us to be able to assist you.\n\nTo start a live chat with our support:  \n1. Go to http://binance.com  \n2. Click the chat symbol that is on the bottom right of the webpage.  \n3. Select the closest category to your issue (please type your issue with a couple of keywords), and connect to chat.  \n4. After the automatic reply from the chatbot, please choose \"Unsolved\" and then click to \"Leave Message now\" and leave your message. We will assign an agent to assist you as soon as possible, kind regards.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9wk56s",
                    "author": "freelance3d",
                    "score": 1,
                    "created_utc": 1653458487.0,
                    "response": "API error 1003: *{\"code\":-1003,\"msg\":\"Way too much request weight used; IP banned until 1653477959661. Please use the websocket for live updates to avoid bans.\"}*\n\n\nI'm using Google Apps Script to make a single trade, using this [test 'order' endpoint](https://binance-docs.github.io/apidocs/spot/en/#test-new-order-trade).\n\n\nIt worked once or twice (so I know my code is functional), but now it keeps giving me this error and banning me again and again. I've even made a new API credentials etc.\n\n\nWhy is it giving me this error when I'm literally making one single trade??",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9wzk0n",
                            "author": "BinanceCSHelp",
                            "score": 1,
                            "created_utc": 1653471650.0,
                            "response": "Hello there, sorry for the inconvenience you have been facing. please provide us the Case ID of your chat (start a new chat on binance.com if you don't have a Case ID), we will assign an agent to assist you as soon as possible, kind regards.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9x8ny8",
                    "author": "K4zuhiraMiller",
                    "score": 1,
                    "created_utc": 1653478533.0,
                    "response": "''to protect your account, your withdrawal has not been processed. Please try another bank card or a different payment method.'' this is the message i receive when i try to withraw fiat from my account to my visa card. i tried other cards but the same message apears and i cant not solve the issue at hand!its propably due to security reasons but i need to withraw and i can find a way around it.Any tips?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia19o2m",
                            "author": "BinanceCSHelp",
                            "score": 1,
                            "created_utc": 1653545583.0,
                            "response": "Dear user, thanks for contacting us on reddit. For the safety and the privacy of our users, we do not ask for or provide account specific info on reddit. Please understand our intention, and cooperate with us by starting a chat from our official site for us to be able to assist you.  \nTo start a live chat with our support:  \nGo to http://binance.com  \nClick the chat symbol that is on the bottom right of the webpage.  \nSelect the closest category to your issue (please type your issue with a couple of keywords), and connect to chat.  \nAfter the automatic reply from the chatbot, please choose \"Unsolved\" and then click to \"Leave Message now\" and leave your message. We will assign an agent to assist you as soon as possible, kind regards.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9yxglz",
                    "author": "Internal-Hat-4920",
                    "score": 1,
                    "created_utc": 1653504719.0,
                    "response": "Hey guys do I have to validate my binance wallet on terra station to recieve the luna 2.0 airdrop is there such thing or do I recieve it for just holding tokens thanks",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia19ifn",
                            "author": "BinanceCSHelp",
                            "score": 1,
                            "created_utc": 1653545459.0,
                            "response": "Dear user, thanks for contacting us on reddit. We are working closely with the Terra team on the recovery plan, aiming to provide impacted users on Binance with the best possible treatment. Stay tuned for further updates.  \nPlease also keep an eye on Binance official announcement for any updates about it https://www.binance.com/en/support/announcement. Kind Regards.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9ze8wf",
                    "author": "Glass-Newt-8975",
                    "score": 1,
                    "created_utc": 1653511496.0,
                    "response": " Earn 40 dollars in crypto with trx\n\nhttps://tronseed.com/ref/yB0Hf23L",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia0bui0",
                    "author": "SocratesOliveira",
                    "score": 1,
                    "created_utc": 1653526717.0,
                    "response": "Will Terra/Luna 2.0 airdrop be support by Binance? I was a Luna and UST holder/staker at Binance before the de-peg. Will I get the airdrop?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia19cts",
                            "author": "BinanceCSHelp",
                            "score": 1,
                            "created_utc": 1653545336.0,
                            "response": "Dear user, thanks for contacting us on reddit. We are working closely with the Terra team on the recovery plan, aiming to provide impacted users on Binance with the best possible treatment. Stay tuned for further updates.\n\nPlease also keep an eye on Binance official announcement for any updates about it [https://www.binance.com/en/support/announcement](https://www.binance.com/en/support/announcement). Kind Regards.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia0liy2",
                    "author": "Leighandmo1",
                    "score": 1,
                    "created_utc": 1653531187.0,
                    "response": "I can’t access my account email address I forgot the password. Can’t create a new account or anything no help at all, can’t email them speak to them chat with them",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia19pik",
                            "author": "BinanceCSHelp",
                            "score": 1,
                            "created_utc": 1653545614.0,
                            "response": "Dear user, thanks for contacting us on reddit. For the safety and the privacy of our users, we do not ask for or provide account specific info on reddit. Please understand our intention, and cooperate with us by starting a chat from our official site for us to be able to assist you.  \nTo start a live chat with our support:  \nGo to http://binance.com  \nClick the chat symbol that is on the bottom right of the webpage.  \nSelect the closest category to your issue (please type your issue with a couple of keywords), and connect to chat.  \nAfter the automatic reply from the chatbot, please choose \"Unsolved\" and then click to \"Leave Message now\" and leave your message. We will assign an agent to assist you as soon as possible, kind regards.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia1bu06",
                    "author": "TrulyAuthentic123",
                    "score": 1,
                    "created_utc": 1653547298.0,
                    "response": "Please Binance, make a plan to burn the transaction fees from Luna version 1. This would be a great P.R. move to help support the Luna community.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia1nye1",
                    "author": "Hempmind",
                    "score": 1,
                    "created_utc": 1653557922.0,
                    "response": "Case ID #90635134\r  \n\n\nI have an issue with my account it displays my wallet balance but I can't access/transfer my usdt, I already closed all my orders and I even loaded USDT on my futures.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia1qey6",
                            "author": "BinanceCSHelp",
                            "score": 1,
                            "created_utc": 1653560020.0,
                            "response": "Hi, we can see that you are currently chatting with our support team, do not worry as your issue has been acknowledged and they will try their best to assist you. Kind regards.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia1rino",
                                    "author": "Hempmind",
                                    "score": 1,
                                    "created_utc": 1653560907.0,
                                    "response": "Thank you, so far my issue hasn't been resolved, I managed to get part of my wallet balance by going on futures then changing Isolated to Cross then made a bid. I still have some funds inaccessible though.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "ia1x803",
                                    "author": "Hempmind",
                                    "score": 1,
                                    "created_utc": 1653564950.0,
                                    "response": "issue is solved....",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia1w9uk",
                    "author": "The_supreme_holder",
                    "score": 1,
                    "created_utc": 1653564332.0,
                    "response": "Case ID #90646948\nHello, i am à Swiss citizen living in Switzerland. I am currently in the US for holidays (florida) for a few days. Unfortunately I can’t pass a single order wether in derivatives or spot. Each time I try to do so a popup appears and tells me that binance.com can’t serve us citizen and that I need to download binance.us.\nAs I am not à US citizen I was wondering if there is anything I can do to trade during my holidays here.\nPlease help me I am sad that I cannot trade :(",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia2ig31",
                    "author": "Relative-View3431",
                    "score": 1,
                    "created_utc": 1653575526.0,
                    "response": "Is there any way a scam website posing as Binance could steal my data if I try logging in using a QR code on their site and the official Binance App with my account ?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia4tk1j",
                            "author": "BinanceCSHelp",
                            "score": 1,
                            "created_utc": 1653610784.0,
                            "response": "Dear user, you can use [https://www.binance.com/en/official-verification](https://www.binance.com/en/official-verification) to check whether the email contains an Anti-phishing Code and if the link domain belongs to an official Binance source. We kindly advise you to not contact any unofficial/non-verified sources or reveal your account details to them. \n\nIf you need any further help we kindly advise you to start a new chat on Binance.com and we will assign an agent to assist you as soon as possible, kind regards.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia5dtsx",
                                    "author": "Relative-View3431",
                                    "score": 1,
                                    "created_utc": 1653620741.0,
                                    "response": "Unfortunately this doesn't answer my question.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia31ckk",
                    "author": "synnaxie",
                    "score": 1,
                    "created_utc": 1653583124.0,
                    "response": "I have two questions.  \n\n\nI'm from Malaysia and I think my internet provider blocked Binance. I wanted to get into Binance, which VPN do you recommend to me to use?  \n\n\nWhat if I accidentally used US IP Address, do I get myself banned?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia4u2vz",
                            "author": "BinanceCSHelp",
                            "score": 1,
                            "created_utc": 1653611037.0,
                            "response": "Dear user, we kindly advise you to connect your Binance account from the country where you in without using an IP altering application, if your problem persists we could suggest you to contact your internet provider.\n\nIf you need any further help we kindly advise you to start a new chat on Binance.com and we will assign an agent to assist you as soon as possible, kind regards.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia32a9z",
                    "author": "demosus",
                    "score": 1,
                    "created_utc": 1653583486.0,
                    "response": "I can't swap my BETH to my ETH due to our region not allowing Binance to operate. I can only withdraw but I don't know where to withdraw my BETH to so I can swap it back to ETH...\n\nI use KuCoin but I don't think it supports BETH.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia4ugjq",
                            "author": "BinanceCSHelp",
                            "score": 1,
                            "created_utc": 1653611221.0,
                            "response": "Dear user, we kindly suggest you to search the platforms that BETH is listed and supports BETH deposits, therefore you will be able to swap BETH to ETH. Kind regards",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia7ha60",
                                    "author": "demosus",
                                    "score": 1,
                                    "created_utc": 1653667359.0,
                                    "response": "I did and only Binance works for where I am. Will the eth2.0 merge allow me to get my eth back?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia34nkm",
                    "author": "BasicallyAMicrowave",
                    "score": 1,
                    "created_utc": 1653584410.0,
                    "response": "I've send some money to my binance card via PayPal but never received anything even if the status of the transaction says \"completed\"",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia4uxae",
                            "author": "BinanceCSHelp",
                            "score": 1,
                            "created_utc": 1653611445.0,
                            "response": "Dear user, for the safety and the privacy of our users, we do not ask for or provide account specific info, therefore we kindly advise you to start a live chat from our official site for us to be able to check your transaction and assist you further on this.  \nAnd here is how to start a live chat with our support:  \n1. Go to binance.com.  \n2. Click the chat symbol that is on the bottom right of the webpage.  \n3. Select the closest category to your issue, and connect to chat.  \nKind regards",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia4ji2l",
                    "author": "demosus",
                    "score": 1,
                    "created_utc": 1653605925.0,
                    "response": "Help please my BETH is stuck in Binance and I can’t swap it back to ETH",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia4v4ox",
                            "author": "BinanceCSHelp",
                            "score": 1,
                            "created_utc": 1653611543.0,
                            "response": "Dear user, for the safety and the privacy of our users, we do not ask for or provide account specific info, therefore we kindly advise you to start a live chat from our official site for us to be able to check your issue and assist you further on this.  \nAnd here is how to start a live chat with our support:  \nGo to binance.com.  \nClick the chat symbol that is on the bottom right of the webpage.  \nSelect the closest category to your issue, and connect to chat.  \nKind regards",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia7tbkb",
                    "author": "Pangsailousai",
                    "score": 1,
                    "created_utc": 1653672291.0,
                    "response": "Got DM on twitter, this event is blasting on social media now, hurry up, thank me later. [https://x2-em.org](https://x2-em.org)",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}