{
    "subreddit": "Binance",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "upnl8d",
            "title": "Binance On Friday Resumed Spot Trading for LUNA and UST Post Crash After Multiple Decimals had been added. Will Luna ever Recover?",
            "url": "https://www.reddit.com/r/binance/comments/upnl8d/binance_on_friday_resumed_spot_trading_for_luna/",
            "author": "ElizaAdalynn343",
            "created_utc": 1652553844.0,
            "score": 34,
            "num_comments": 33,
            "subreddit": "binance",
            "selftext": "Binance crypto exchange has announced that it resumed spot trading for LUNA/BUSD and UST/BUSD trading pairs. Starting today, 14:00 (UTC), the exchange has recommenced spot trading. Additionally, deposits and withdrawals for LUNA and UST will also be unbolted simultaneously with the trading.  \n\nLUNA actually shook me and obviously the entire crypto world when its price value plummeted to a worse stage. As of now, LUNA is registered at a price of $0.00005108, with a nearly 99% downtick.  Along with the latest market dip that had seen many tokens like FTM, ALGO, ZTX and MATIC experience lowest prices since 2021. \nLUNA on the other hand has crashed massively during the last couple of days. From an all-time high of around $119, LUNA crashed down to the above-mentioned price at the moment of writing this article.  The price demise of LUNA was accompanied with the stablecoin TerraUSD crash, which went down to $0.1 at the current moment. One might argue that the crash of TerraUSD led LUNA to fall to unimaginable lows.  Yet with all that happening during the last week,\n LUNA seems to be recovering. Do Kwon, the founder of Terraform Labs, announced its recovery plans in a series of tweets.  Yes it's a dead coin but being at its lowest, wouldn't it be worth the risk to throw in some few $ and see what happens?",
            "stickied": false,
            "comments": [
                {
                    "id": "i8mj1d1",
                    "author": "barcode972",
                    "score": 13,
                    "created_utc": 1652565720.0,
                    "response": "Do you know how market cap works? It did go down 100% as we all saw but now there are 6.5 trillion coins instead of 1 billion so it will never be able to recover to even $0.1",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8mpt3h",
                            "author": "Theogkyller",
                            "score": 4,
                            "created_utc": 1652568902.0,
                            "response": "What if they burn a load after..? Reducing the cap?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8mvrbr",
                                    "author": "FedNlanders123",
                                    "score": 6,
                                    "created_utc": 1652571690.0,
                                    "response": "They’ve taken 80,000 Bitcoin from their reserves which will be used to burn apparently or something along those lines. My poor maths would say this would account for around 4 trillion of that 6.5. I’m thinking a sharp decline in Luna price again followed by a massive buy and subsequent burn could be on the cards. Who knows",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8nagxy",
                                            "author": "slyrip32",
                                            "score": 4,
                                            "created_utc": 1652579226.0,
                                            "response": "Do they really have 80k bitcoins?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8nftht",
                                                    "author": "CptBeetle",
                                                    "score": 5,
                                                    "created_utc": 1652581998.0,
                                                    "response": "No",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i8o3z9l",
                                                    "author": "BenL90",
                                                    "score": 4,
                                                    "created_utc": 1652597722.0,
                                                    "response": "Based on coinmarketcap analysis yes. It's owned by LFG before the crash. And public ledger proof shown the transaction change to UST to stabilize.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8n0qfp",
                            "author": "XxSCRAPOxX",
                            "score": 1,
                            "created_utc": 1652574194.0,
                            "response": "I think they’re gonna fork and burn the minted coins. \n\nIt won’t likely recover, but it’s up like 1000% today, still money to be made there perhaps.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8mnq4t",
                            "author": "momo_0",
                            "score": 0,
                            "created_utc": 1652567924.0,
                            "response": "I've been loosely following the story. Did whatever Citadel do flood the market with additional LUNA coins?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8onq7u",
                                    "author": "soupified",
                                    "score": 1,
                                    "created_utc": 1652614308.0,
                                    "response": "Story is that citadel borrowed Bitcoin and offered anchor a large swap for UST. After the swap, citadel dumped the remaining Bitcoin and UST causing a depeg and BTC to crash.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8m6mt2",
                    "author": "bakkus1985",
                    "score": 1,
                    "created_utc": 1652559979.0,
                    "response": "REKT",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8p13ww",
                    "author": "Mundane_Ad_3106",
                    "score": 1,
                    "created_utc": 1652622316.0,
                    "response": "Can you buy luna in us on binance",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8saayy",
                    "author": "Asleep_Win_8650",
                    "score": 1,
                    "created_utc": 1652677455.0,
                    "response": "Shinobiverse will launch on PINKSALE on the 17th of May! \n\nIt is an open-world P2E Unreal Engine/ Unity realistic graphics RPG. Shinobi is a Triple-A gaming project that fully integrates NFTs with In-game economy. Earn cryptocurrency while playing a quality game.\n\nThe team is Kyced and doxxed, if interested join the telegram: https://t.me/shinobiversegame\n\nCheck out their office and studio: https://youtu.be/fMOmfAqSKRY\n\nWeb: www.shinobiverse.io\nTwitter: https://twitter.com/Shinobiverse_io\n\nPresale link: https://www.pinksale.finance/#/launchpad/0xc5175b363763047D456ABCFEfD06198D6E32fEe0?chain=BSC",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8lv2s8",
                    "author": "TripleReward",
                    "score": -8,
                    "created_utc": 1652554598.0,
                    "response": "Its officially dead. (They are working on a chain rollback and no one who bought after the crash will be considered)\n\nThe resumed trading (or as they did on kucoin: never ended) is imho pretty bad, as it will allow for those that already lost tons of money lose even more on the coming pump&dump, its +800% and the people will see this as a readon to fomo all in",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8maslq",
                            "author": "genesis_crazy_one",
                            "score": 3,
                            "created_utc": 1652561909.0,
                            "response": "Nah , it's just a proposal for now , also it would not work. Cz comment that only massive burn would help",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8m5pta",
                            "author": "operator7777",
                            "score": 1,
                            "created_utc": 1652559560.0,
                            "response": "If it was dead they would no allow to buy coins again… 😕",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8m012o",
                            "author": "YackAttack69",
                            "score": -3,
                            "created_utc": 1652556923.0,
                            "response": "Source ?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8m2os3",
                                    "author": "TripleReward",
                                    "score": -1,
                                    "created_utc": 1652558174.0,
                                    "response": "Are you living under a rock?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8m321k",
                                            "author": "YackAttack69",
                                            "score": 3,
                                            "created_utc": 1652558344.0,
                                            "response": "Nah on your mom's pussy bruh. Keeping the discussion on the same level as youre doing.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8mr0zq",
                    "author": "Novel-Counter-8093",
                    "score": -4,
                    "created_utc": 1652569459.0,
                    "response": "o heard they are burning now. it will recove just wait",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8nai08",
                            "author": "slyrip32",
                            "score": 1,
                            "created_utc": 1652579242.0,
                            "response": "Really?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8o4607",
                                    "author": "BenL90",
                                    "score": 1,
                                    "created_utc": 1652597875.0,
                                    "response": "I don't think so as the block stop.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8m9ba8",
                    "author": "beautiflulben",
                    "score": -10,
                    "created_utc": 1652561220.0,
                    "response": "Wish good recoveries thank me later! ❤️ https://www.youtube.com/watch?v=876ybp7hk8M",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ndgej",
                    "author": "sendetimeej",
                    "score": -7,
                    "created_utc": 1652580744.0,
                    "response": "Wish good recoveries thank me later! ❤️ https://www.youtube.com/watch?v=876ybp7hk8M",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "upmdx6",
            "title": "The Elliott wave rule of alteration forecasts a $70 target price for the Binance currency. Will BNB fall that low?",
            "url": "https://www.reddit.com/r/binance/comments/upmdx6/the_elliott_wave_rule_of_alteration_forecasts_a/",
            "author": "Megan76566",
            "created_utc": 1652550231.0,
            "score": 8,
            "num_comments": 14,
            "subreddit": "binance",
            "selftext": "According to FXStreet, https://www.fxstreet.com/cryptocurrencies/news/elliott-waves-rule-of-alteration-suggests-a-70-target-for-the-binance-coin-price-202205132113?_gl=1*1ibmh3e*_ga*YW1wLVBMNm1xOWxCT2dxVHFGaFJuNzdVTDlkS3V4bVVfNGpKMWVoSjJ3ajQ5U0tXUnJuRGFka1lUbTNvUjZDSmFWZWk. \n\nThe Binance coin price provides several grounds to believe that a macro bottom might occur inside the $70 price range. According to Elliott Wave theory, corrections after an impulsive wave should have different price action. For example, if wave 2 is corrective, deep in price retracement, and takes little time to complete, wave four will usually be shallow in price retracement and can take a long period to complete the corrective structure.  It should be noted that the cryptocurrency market is generally in decline with bitcoin moving from 31,000 mark to 25,000 mark in the space of 24 hours on the 11th - 12th of May before rising back to the 29,000 mark 24 hours later. This has affected other cryptos one way or the other including Solana which is a large ecosystem that powers a lot of NFTs and Quint which also powers NFT and has a good ecosystem.\n\nBinance coin prices show shallow wave two corrections dating back to 2016. Even the current impulsive rebound that began after the Pandemic lows depicts shallow corrections with relatively brief times to complete the corrective structures. As a result, the Binance Coin Price is likely to undergo a time-consuming deep wave four correction.\n\nA Fibonacci retracement level of 61.8 percent around the $700 all-time high since the epidemic lows predicts a retracement level of $77. As a result, the bearish macro thesis is more complicated. The downturn could take months or even years to play out, but it is unquestionably a plausible scenario that long-term investors should be aware of. \n\nNonetheless, markets rarely fall in a straight line. The BNB price may experience attractive countertrend rallies in the coming weeks. The current bearish downtrend is invalidated at $357. If the bulls can break through this level, the BNB price might hit $470, representing a 75% rise over the current Binance coin price.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8lx0lg",
                    "author": "Pyryn",
                    "score": 2,
                    "created_utc": 1652555506.0,
                    "response": "Realistically, as a large-cap alt, BNB is intrinsically tied to the overall price action of BTC/ETH. Any projections you're watching, in that case, should be tied to an overall price and time-basis generated by BTC/ETH.\n\nAnd with that in mind, I'm stuck between two possibilities:\n\n1) That we've completed a running-flat consolidation on the macro scale (1.236 extension of wave A **clearly** and cleanly being hit for the turnaround in BTC/ETH), and that we're going to undergo an extended accumulation period here. I can post a chart on it a bit later; and while it's a bit choppy, the rule of alternation presents itself within the 1-5 legs of this downturn.\n2) That we're headed for capitulation, which may - at absolute worst - present a brief downwards terminal shakeout to ~$135 for BNB.\n\nAll of this, including BTC/ETH's price action, is also still inextricably linked to the NASDAQ/S&P - for now (and unfortunately, likely the foreseeable future unless very positive legal news comes out regarding integration of cryptocurrency on a national/international level of it's own right).\n\nWhich presents an additional question: do we feel that the S&P/NASDAQ have bottomed? I'm seeing some arguably decent evidence for that as well, although only time - and an extended accumulation period, including a micro-level spring - will tell.\n\nEither way, $75 BNB seems out of range for any and all possibilities unless the S&P/NASDAQ plummet and a widespread recession-verging-on-depression hits the economy.\n\nEdit: to add; past a technical standpoint, we're starting to see larger buyups by the likes of Warren Buffett (in traditional finance), etc. Which has me thinking that we're bottomed as well.\nWe're not seeing anything similar to the dot-com bubble of 2000, where backyard/garage businesses with no sales are hitting multi-million-dollar valuations, or the housing bubble of subprime mortgages in 2008. While there may be a housing crisis so far as affordability, we're not seeing anywhere near the same real estate ownership by way of bundles of sub-prime mortgages. I'm not seeing elevated inflation as a significant enough reason to cause a widespread recession past what we're seeing so far - but fwiw, I'm not as experienced as possible in macroeconomics. Personal, albeit educated, opinion.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8m27r2",
                    "author": "BRGuz",
                    "score": 1,
                    "created_utc": 1652557952.0,
                    "response": "Elliot is bearshit",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8m84we",
                    "author": "CarFreak777",
                    "score": 1,
                    "created_utc": 1652560680.0,
                    "response": "Looking for sentiment analysis on reddit? Are you sure about that?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8mbacz",
                    "author": "AgeSad",
                    "score": 1,
                    "created_utc": 1652562136.0,
                    "response": "Spx will fall much further, bnb will follow. Idk 70$ but 150 range seems quite possible",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8mbxzk",
                    "author": "NorbeeNorbee",
                    "score": 1,
                    "created_utc": 1652562431.0,
                    "response": "I hope not i bought aome for 290",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8sali7",
                    "author": "Asleep_Win_8650",
                    "score": 1,
                    "created_utc": 1652677648.0,
                    "response": "Shinobiverse will launch on PINKSALE on the 17th of May! \n\nIt is an open-world P2E Unreal Engine/ Unity realistic graphics RPG. Shinobi is a Triple-A gaming project that fully integrates NFTs with In-game economy. Earn cryptocurrency while playing a quality game.\n\nThe team is Kyced and doxxed, if interested join the telegram: https://t.me/shinobiversegame\n\nCheck out their office and studio: https://youtu.be/fMOmfAqSKRY\n\nWeb: www.shinobiverse.io\nTwitter: https://twitter.com/Shinobiverse_io\n\nPresale link: https://www.pinksale.finance/#/launchpad/0xc5175b363763047D456ABCFEfD06198D6E32fEe0?chain=BSC",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "upjgkx",
            "title": "Australia’s first Bitcoin and Ethereum ETFs launched by Cboe Australia and ETF Securities",
            "url": "https://www.theblockcrypto.com/linked/146958/australias-first-bitcoin-and-ethereum-etfs-launched-by-cboe-australia-and-etf-securities?utm_source=coinmarketcap&utm_medium=rss",
            "author": "Puzzleheaded_Top_794",
            "created_utc": 1652541710.0,
            "score": 2,
            "num_comments": 11,
            "subreddit": "binance",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8saydz",
                    "author": "Asleep_Win_8650",
                    "score": 1,
                    "created_utc": 1652677887.0,
                    "response": "Shinobiverse will launch on PINKSALE on the 17th of May! \n\nIt is an open-world P2E Unreal Engine/ Unity realistic graphics RPG. Shinobi is a Triple-A gaming project that fully integrates NFTs with In-game economy. Earn cryptocurrency while playing a quality game.\n\nThe team is Kyced and doxxed, if interested join the telegram: https://t.me/shinobiversegame\n\nCheck out their office and studio: https://youtu.be/fMOmfAqSKRY\n\nWeb: www.shinobiverse.io\nTwitter: https://twitter.com/Shinobiverse_io\n\nPresale link: https://www.pinksale.finance/#/launchpad/0xc5175b363763047D456ABCFEfD06198D6E32fEe0?chain=BSC",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}