{
    "subreddit": "Binance",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "sm22eo",
            "title": "How to receive USDT from 10 USDT Cash Back Voucher",
            "url": "https://www.reddit.com/r/binance/comments/sm22eo/how_to_receive_usdt_from_10_usdt_cash_back_voucher/",
            "author": "G4brriel",
            "created_utc": 1644168109.0,
            "score": 15,
            "num_comments": 71,
            "subreddit": "binance",
            "selftext": "Hey,\n\nI've recently re-verified my Binance account. I have received the unsellable NFT and 10 USDT Cash Back Voucher. Am I the only one that is unaware of how to use this voucher and receive the cashback?\n\nThe details of how to use it aren't helpful at all.\n\nIf someone is able to run me through it like a child that would be much appreciated!",
            "stickied": false,
            "comments": [
                {
                    "id": "hvyp43v",
                    "author": "drash_o0n",
                    "score": 3,
                    "created_utc": 1644252481.0,
                    "response": "Full Ts&Cs are pasted below, but you activate it in the rewards center then it credits you cashback in USDT equal to the amount of spot trading fees you incurred, capped at 10 USDT per day.\n\nBut given Binance's spot fees for the majority of retail users are 0.1% (slightly less if you use BNB to pay them) you'd need to do $10,000 worth of spot trading in a day to see that 10 USDT cashback.\n\nSo a very small 'bonus'.\n\n&#x200B;\n\nVoucher introduction:\n\n1.The voucher can be activated to enjoy the corresponding cashback in the amount equal to the trading fee of the Spot each day. The cashback will be distributed to the user's spot account in USDT the following day of the user's trading.The maximum cashback amount of one user equals the face value of this voucher, which will be deducted each day according to the cashback distribution until depletion or the expiry of the cashback reward time.\n\n2.The voucher is valid until: xxxx. Reward time:14 days.\n\nActivation:\n\n1. Activate the Cashback Voucher in Reward Center.\n2. The cashback equals to the trading fee of the Spot each day will be distributed to your spot account in USDT the following day of your trading.\n3. You may visit Wallet - Transaction History - Distribution or click “Detail” on the voucher for more information on the cashback distribution history each day.\n4. If you activate multiple Cashback Vouchers at the same time, the vouchers will be deducted according to the order of redemption (first redemption, first burn). In addition to the expiry date of the redemption of the cashback voucher, you will also be subject to the cashback reward time, where you will not be able to apply or use the remaining balance of the cashback vouchers in any way once it has expired.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hvyzq83",
                            "author": "G4brriel",
                            "score": 1,
                            "created_utc": 1644256613.0,
                            "response": "I'm just holding some coins in my account so turns out it was worthless for me. Appreciate u posting this.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hvu4nvt",
                    "author": "TryonTriptik",
                    "score": 2,
                    "created_utc": 1644169884.0,
                    "response": "I also need to know this...",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hvv6yle",
                    "author": "unethicalorange",
                    "score": 2,
                    "created_utc": 1644185260.0,
                    "response": "Some people have said they were able to cash them in, not sure, just know it can be used to avoid tx fees when trading",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hvxo7ny",
                            "author": "G4brriel",
                            "score": 1,
                            "created_utc": 1644235227.0,
                            "response": "I've got no clue, appreciate the input.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hvvhxf1",
                    "author": "Ok_Sky3155",
                    "score": 2,
                    "created_utc": 1644189903.0,
                    "response": "How did you verified I'm trying to verify for ages doesn't mean binance don't accept new user",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hvxopov",
                            "author": "G4brriel",
                            "score": 1,
                            "created_utc": 1644235555.0,
                            "response": "Previous users must re-verify to continue using their account. Not sure if the 'reward' is accessible to a new user? I know that business accounts and a few other types are exempt from the reward.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hvxyf2q",
                            "author": "Elegant-Conflict2370",
                            "score": 1,
                            "created_utc": 1644241080.0,
                            "response": "I have recently created an account and was able to verify it without any issues. I think you should contact the support for assistance on this",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hw2kw01",
                                    "author": "Ok_Sky3155",
                                    "score": 1,
                                    "created_utc": 1644321160.0,
                                    "response": "Thank you I should try that out",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hvy05s5",
                    "author": "conorsoliga",
                    "score": 1,
                    "created_utc": 1644241948.0,
                    "response": "I thought it was just money off trading fees tbh",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hvy5r7x",
                            "author": "G4brriel",
                            "score": 1,
                            "created_utc": 1644244550.0,
                            "response": "How does that work as cashback then? Do you receive a portion of the fees you would have had to spend as a maximum 10 USDT Spot? Just trying to understand it all",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hwi1gp5",
                                    "author": "fbloise",
                                    "score": 1,
                                    "created_utc": 1644585639.0,
                                    "response": "Basically is exactly that, its a refund of fees paid when trading using the spot (aka market) in the trading screen. Useless for most of us and deceptive use of the word \"cashback\", haha classic Binance.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hvyp3o9",
                    "author": "Possible_prosper",
                    "score": 1,
                    "created_utc": 1644252477.0,
                    "response": "I can't verify my account and I have some funds their, they said I already have an account verified with this name and they won't let me change my name 😭😭I am in pains",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hvzh79s",
                    "author": "UJ_Reddit",
                    "score": 1,
                    "created_utc": 1644263421.0,
                    "response": "I verified but for some reason it’s still restricted me…",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hw2tcpe",
                    "author": "Mariaannie",
                    "score": 1,
                    "created_utc": 1644326142.0,
                    "response": "Whale Hunt is here to conquer the Binance Smart Chain. We will go on to deliver the best Web3 Gaming ever seen before! \n \nSame Dev of Foxboy that did 2.5million ath.💸💸💸 \n \nWith over 15 years of programming experience, Math has been through it all, coding for banks, E-commerce websites, and most recently developing Crypto projects.💎💎💎\n\n✅ CG + CMC Applied ✅\n\n🕹 Play 2 earn game coming mid march 🕹 \n \nKyced at coinmooner.💯 \n \nBuy tax: 14% \nSell tax: 14% \n \nTG: whalehuntbsc",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}