{
    "subreddit": "Binance",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "v0irl0",
            "title": "Binance learned this from LUNA's demise, say CZ",
            "url": "https://www.reddit.com/r/binance/comments/v0irl0/binance_learned_this_from_lunas_demise_say_cz/",
            "author": "Noemimb",
            "created_utc": 1653853433.0,
            "score": 30,
            "num_comments": 7,
            "subreddit": "binance",
            "selftext": "The collapse of Terra LUNA and TerraUSD costed investors over $40 billion in losses and shook the entire sector. As the crypto world digests the fallout from the network's collapse, some insiders claim \"I told you so,\" whereas others regret their support for the once-popular cryptocurrency.\n\nBinance is among the world's largest cryptocurrency exchanges. The exchange was chastised for halting LUNA and UST withdrawals early in the crash. It said the change was necessary due to network congestion, but it angered many investors. Binance is a cryptocurrency exchange that allows users to buy, sell, and trade cryptocurrencies like Bitcoin, Ethereum, Dogecoin, Faith Tribe, etc.\n\nCZ has stressed a theme of openness and user safety since then. \"Binance will let this go and urge the Terra project team to reimburse the retail users first, Binance last, if ever,\" he tweeted.\n\nZhao slammed Terraform Labs' response to the situation once further, calling the company's choice to utilize LFG's Bitcoin reserves to support UST when it lost its peg \"dumb.\" Teams should \"always be operationally incredibly responsive,\" he stressed.\n\nHe also mentioned the need for stablecoin regulation before concluding with a look forward to the space's future. While incidents like the one with LUNA and UST are unfortunate, he added, \"we are dedicated to playing a critical role in establishing a sustainable, enriched blockchain environment for everybody.\"\n\nApart from that, Galaxy digital’s CEO Mike Novogratz also had to say something interesting. \"My tattoo will be a continual reminder that venture investment demands humility,\" Galaxy Digital CEO, who was so impressed with Terra that he got a LUNA wolf tattoo, told shareholders. \"It was a tremendous concept that failed,\" he continued.",
            "stickied": false,
            "comments": []
        },
        {
            "id": "v0j3or",
            "title": "Binance Gets Clearance To Operate In Italy After 2021 Ban",
            "url": "https://www.reddit.com/r/binance/comments/v0j3or/binance_gets_clearance_to_operate_in_italy_after/",
            "author": "Bonilladke",
            "created_utc": 1653854437.0,
            "score": 24,
            "num_comments": 6,
            "subreddit": "binance",
            "selftext": "Binance announced on Friday that its legal unit in Italy had registered with the country's regulator as the cryptocurrency exchange seeks to gain traction in Europe. \n\nBinance, the world's largest cryptocurrency exchange by daily trading volume and the trading place of cryptos that double down as a token and as a transaction network like Concordium and Solana, has registered as a digital asset service provider with Organismo Agenti e Mediatori, an Italian regulatory agency in charge of overseeing financial institution listings. \n\nBinance recently received permission to operate in France, where the exchange's management had previously indicated that the company might establish a European headquarters.\n\nThe registration of the company in Italy may increase the exchange's accountability and reduce the likelihood of money laundering. \n\nBinance CEO Changpeng Zhao stated in a statement: \n\n\"Clear and effective regulation is critical for cryptocurrency mainstream adoption... We thank the Ministry of Economy and Finance and the OAM for their efforts in emphasizing and controlling the requirements for conducting business in Italy in full transparency.\"\n\nBinance is one of 14 virtual asset operators registered with the OAM, the Italian regulatory body that oversees crypto operators. \n\nThe regulatory approval is a significant step forward in the crypto exchange's expansion strategy for Italy, allowing the company to strengthen its presence in the country by opening offices and hiring more locals.\n\nBinance has become the first company in the European Union to be registered in France. The company is also seeking registration in Austria, Portugal, Spain, the Netherlands, and Switzerland. \n\nIn March, Binance received permits from Abu Dhabi, Bahrain, and Dubai. Several regulators, including those from the United Kingdom, Germany, and Italy, issued warnings to the company the previous year, alleging that the exchange was operating without a license in their respective jurisdictions.\n\nThe 13 other crypto platforms currently registered with the OAM are Bitpanda, CryptoSmart Srl, Tensora Srl, Young Platform, and Blockeras Srl. According to the OAM, approximately 28 more operators have submitted preliminary pre-registration applications. \n\nMeanwhile, according to a survey conducted in Italy last year, a significant number of respondents are unlikely to invest in cryptocurrency. According to Statista, roughly four out of every ten people polled are interested in bitcoin but are unsure how to get started. \n\nA recent OAM survey found that 11% of respondents had no clear knowledge of cryptocurrencies, while 64% claimed to have \"good financial understanding\" and an interest in investing in cryptocurrencies.",
            "stickied": false,
            "comments": []
        }
    ]
}