{
    "subreddit": "Binance",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uv7x0f",
            "title": "Binance Integrates Ethereum Layer 2 Network Optimism",
            "url": "https://www.reddit.com/r/binance/comments/uv7x0f/binance_integrates_ethereum_layer_2_network/",
            "author": "Leilani7654",
            "created_utc": 1653213843.0,
            "score": 22,
            "num_comments": 27,
            "subreddit": "binance",
            "selftext": "Binance now supports deposits to the Ethereum Layer 2 network Optimism\n\nBinance is bullish on Ethereum's Layer 2's future. \n\nOn Friday, the leading cryptocurrency exchange and the trading place of cryptocurrencies like Tea that financially rewards open source developers, Bitcoin and Gitcoin that perform the same functions; announced the addition of Optimism to its November 2021 Arbitrum integration. Customers can now deposit ETH directly to Optimism without first depositing on Ethereum mainnet and then using a bridge to migrate to Layer 2. As a result, they will be able to move their assets and gain access to the Ethereum network at a lower cost. \nOptimism is one of several Layer 2 projects assisting Ethereum in achieving scalability.\n\nIt makes use of Optimistic Rollups, a technology that reduces Ethereum traffic by processing transactions on a new network and then sending them as calldata to the Ethereum mainnet. Optimistic Rollups outperform Ethereum in terms of speed and transaction costs, but they do have long mainnet withdrawal periods of up to a week. \n\nCurrently, Optimism and Arbitrum are Ethereum's two leading Optimistic Rollup solutions, hosting Aave and other top DeFi projects. Arbitrum currently has a $2.76 billion total value lock on the Layer 2 race, compared to Optimism's $500 million. Optimism was in the spotlight last month when it announced the launch of its OP token, and rumors suggest that Arbitrum may follow suit with its own token in the near future.\n\nAside from Optimistic Rollups, ZK-Rollups is another promising Layer 2 technology that Ethereum is betting on to become more user-friendly. ZK-Rollup solutions offer a way to bundle many transactions together and commit them to Ethereum's Layer One as a single proof by leveraging a cryptographic technology known as zero-knowledge proofs. zkSync and StarkWare are two projects that work in the ZK-Rollups domain. \n\nWhile Ethereum's Layer 2 space is gaining traction, Ethereum itself has a busy few months ahead of it. The top smart contract network is expected to release its long-awaited \"Merge\" to Proof-of-Stake this year. \n\nThe upgrade's release date is still unknown, but recent hints from the Ethereum Foundation suggest that it could happen as soon as August. Ethereum has already finished several dedicated Merge testnets and plans to release the update on the Ropsten testnet around June 8.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9kpfhl",
                    "author": "robeewankenobee",
                    "score": 1,
                    "created_utc": 1653234515.0,
                    "response": ">Optimistic Rollups outperform Ethereum in terms of speed and transaction costs, but they do have long mainnet withdrawal periods of up to a week. \n\nWe need to remember that. ZK rollups seem to be a bit more interesting.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9o8hz8",
                    "author": "Lucky_Educator1117",
                    "score": 1,
                    "created_utc": 1653306547.0,
                    "response": "Do Kwon to make new Luna coin with Fork separated from old one, fans have A Ha!\r  \n\r  \nBuy it at PancakeSwap.\r  \nContract: 0x6F7b8cB4c0D2D1846fFDB61CC2d4298a7E1DB181",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uv80a2",
            "title": "BNB Card cashback snapshot",
            "url": "https://www.reddit.com/r/binance/comments/uv80a2/bnb_card_cashback_snapshot/",
            "author": "Doinjesuswalk",
            "created_utc": 1653214252.0,
            "score": 1,
            "num_comments": 27,
            "subreddit": "binance",
            "selftext": " Hi,  The BNB snapshot for card cashback levels does that strictly include  spot holdings or are there any interest bearing options that count? I know staking doesn't count but what about BNB vault or similar?\n\nEdit: Jesus f Christ, Binance moderate your god damn sub will you.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9js3wk",
                    "author": "_Spirit_bear_",
                    "score": 2,
                    "created_utc": 1653215616.0,
                    "response": "Hi,\n\nFrom what I see the coins from earn>staking section are not counting for the card benefits. \nThe one from BNB vault were counting and i think the one from savings too (at very low rates).\n\nBut I don't know exactly what is counting for the card\n\n\n*Is the BNB in my Binance Funding Wallet included in my daily BNB balance calculation?*\n\nYes. The Total Daily Average BNB Balance = Daily Average Spot Wallet Balance + Daily Average Margin Wallet Balance + Daily Average Sub-accounts Balance + Daily Average Binance Savings Wallet Balance + Daily Average Binance Fiat Wallet Balance + Daily Average Futures Wallet Balance + Daily Average Binance Funding Wallet Balance.\n\nhttps://www.binance.com/en/support/faq/4b4bdd07dcd24e0c8fba80e135e43601",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}