{
    "subreddit": "Binance",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uq7zxc",
            "title": "Remember to be careful in the crypto world and beware of scams. Here is the list of the most common scams and how to avoid them",
            "url": "https://www.reddit.com/r/binance/comments/uq7zxc/remember_to_be_careful_in_the_crypto_world_and/",
            "author": "SimpleSwapExchange",
            "created_utc": 1652627142.0,
            "score": 5,
            "num_comments": 4,
            "subreddit": "binance",
            "selftext": "**Imposter scam**\n\nScammers pretend to be moderators, admins or developers, message you and ask for your private key. *Remember to never share your private key to anyone. Always check whether you’re talking to the real admin.*\n\n**Phishing & fake website**\n\nScammers create fake websites of exchange platforms or crypto wallets. *Always carefully check the URL, domain, quality of the website, design etc.*\n\n**Fake app**\n\nFake apps can be placed in Google Play and the App Store. *Always check the reviews and number of downloads, research the developer.* \n\n**Giveaway scam**\n\nScammers promise to multiply the cryptocurrency sent to them. *Never send money to an unknown person or project. Always research a project.*\n\n**Trader scam**\n\nScammers can tell you about their return and ask to follow their advice. *Do not believe in unrealistic guaranteed returns, always do your own research. Avoid poorly written, incomplete or non-existent whitepaper.*",
            "stickied": false,
            "comments": [
                {
                    "id": "i8sa1cq",
                    "author": "Asleep_Win_8650",
                    "score": -1,
                    "created_utc": 1652677286.0,
                    "response": "Shinobiverse will launch on PINKSALE on the 17th of May! \n\nIt is an open-world P2E Unreal Engine/ Unity realistic graphics RPG. Shinobi is a Triple-A gaming project that fully integrates NFTs with In-game economy. Earn cryptocurrency while playing a quality game.\n\nThe team is Kyced and doxxed, if interested join the telegram: https://t.me/shinobiversegame\n\nCheck out their office and studio: https://youtu.be/fMOmfAqSKRY\n\nWeb: www.shinobiverse.io\nTwitter: https://twitter.com/Shinobiverse_io\n\nPresale link: https://www.pinksale.finance/#/launchpad/0xc5175b363763047D456ABCFEfD06198D6E32fEe0?chain=BSC",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8syc0x",
                            "author": "Viruss01",
                            "score": 1,
                            "created_utc": 1652697333.0,
                            "response": "Boi totally missed the topic...",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8qq3iz",
                    "author": "Independent_Sky_1512",
                    "score": 0,
                    "created_utc": 1652649430.0,
                    "response": ".",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}