{
    "subreddit": "Binance",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uxol2u",
            "title": "Dubai Close To Be Global Crypto-hub, Supports Major Crypto Businesses: Are We Gonna See Even More Improvement In UAE’s Economy?",
            "url": "https://www.reddit.com/r/binance/comments/uxol2u/dubai_close_to_be_global_cryptohub_supports_major/",
            "author": "Bourneser",
            "created_utc": 1653505646.0,
            "score": 78,
            "num_comments": 15,
            "subreddit": "binance",
            "selftext": "One of the aftermath of the recent launch of the ‘Dubai Metaverse Strategy’ which concentrates on the developments in the digital economy and leveraging opportunities within the metaverse, is that Dubai is gearing up to host the first MENA headquarters of the world’s largest cryptocurrency exchange, Binance.  \n\nAccording to a recent study published by Checkout.com, around 54% of people in this region think that crypto must be used as currency rather than merely an investment asset. \n\nThis ratio is 9% higher than the global average of 45% and 11% higher than the USA’s average of 43%.  From launching the Crypto Credibility Campaign for students to entering the metaverse by establishing Dubai’s Virtual Assets Regulatory Authority’s MetaHQ and making it the first regulatory to step into the emerging world of Web 3.0, Dubai has been constantly in news for making headlines in the crypto space. \n\n With this news of Binance planning to set up its first MENA headquarters in Dubai, which already achieved the Virtual Asset Licence to enable the firm to implement crypto-based services in Dubai, several other exchanges are expected to set up their shop in the region.  \n\nSpeaking of this announcement, Binance’s Regional Head of MENA, Richard Teng mentioned how the regulators in Dubai see that supporting the development of crypto-assets is crucial in developing web3 ecosystems like Hive, Solis, Aragon, etc. Binance to start operations in Dubai HQ next month. Is something big coming to Dubai?  Source: https://coinquora.com/dubai-close-to-be-global-crypto-hub-supports-major-crypto-businesses/",
            "stickied": false,
            "comments": [
                {
                    "id": "ia1bx66",
                    "author": "EfficientArm649",
                    "score": 1,
                    "created_utc": 1653547367.0,
                    "response": "Syscoin",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia1tjbs",
                    "author": "useemrlymad",
                    "score": 1,
                    "created_utc": 1653562436.0,
                    "response": "LUNABAI ready to scam the shit our of you",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ze5cj",
                    "author": "Glass-Newt-8975",
                    "score": -6,
                    "created_utc": 1653511455.0,
                    "response": " Earn 40 dollars in crypto with trx\n\nhttps://tronseed.com/ref/yB0Hf23L",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}