{
    "subreddit": "Binance",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "oidazw",
            "title": "Binance removed the option to delete your account without telling anyone",
            "url": "https://www.reddit.com/r/binance/comments/oidazw/binance_removed_the_option_to_delete_your_account/",
            "author": "SDali27",
            "created_utc": 1626039904.0,
            "score": 45,
            "num_comments": 118,
            "subreddit": "binance",
            "selftext": "Since Binance is currently facing a lot of pressure from various governments to give up user data, I decided that my data is no longer safe with this company and wanted to delete my account. \n\n&#x200B;\n\nThat's when I realized that they removed the option to delete the one's Binance account. Merely the option to disable your account is still available. This, however, merely restricts the access on the user level and has no effect on the storage of your data. \n\n&#x200B;\n\nI messaged the support about this, but they didn't or couldn't answer my questions and kept referring me back to the 'disable account' option. Here is a screenshot of the chat with the support: [https://gyazo.com/b3cb3293ea2de01540c7da6dca732c89](https://gyazo.com/b3cb3293ea2de01540c7da6dca732c89)\n\n&#x200B;\n\nI am not a legal expert, but I'm pretty sure that what they are doing is illegal and violates the General Data Protection Regulation (GDPR). You can't just take away people's option to close their accounts without telling them beforehand. \n\n&#x200B;\n\nIt would be nice to know what the rest of the community thinks about this.",
            "stickied": false,
            "comments": [
                {
                    "id": "h4uw7ct",
                    "author": "vaidasy",
                    "score": 4,
                    "created_utc": 1626043399.0,
                    "response": "It's legal because it is in Terms and conditions it is reason why you accept them before registering ...",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "h4wbppy",
                            "author": "SDali27",
                            "score": 5,
                            "created_utc": 1626075782.0,
                            "response": "When I registered the delete account option was still available. Only recently did they remove it without notice. I think there is a good chance that this is not covered in the ToS or was only added recently.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "h4v3poy",
                    "author": "ThePuteh",
                    "score": 3,
                    "created_utc": 1626047149.0,
                    "response": "No man , the delete account still available ...",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "h4vb3uq",
                            "author": "PlentyProfit6774",
                            "score": 0,
                            "created_utc": 1626051098.0,
                            "response": "No it’s not…if so tell us how ???",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "h4vbt3i",
                                    "author": "ThePuteh",
                                    "score": 2,
                                    "created_utc": 1626051475.0,
                                    "response": "Go to Setting > Security > Manage Account ?\n\n[Acc Deleting ?](https://ibb.co/NVWXRh1)",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "h4whdui",
                                            "author": "Mybaobaoma",
                                            "score": 1,
                                            "created_utc": 1626081243.0,
                                            "response": "Still there",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "h5mbguc",
                                                    "author": "ThePuteh",
                                                    "score": 1,
                                                    "created_utc": 1626607595.0,
                                                    "response": "Hm .. its weird .. people told that the Delete option were removed , and i saw that Delete option is there ... or you want me to experimenting my Delete Option to delete my account ? Lol ... for further info , ask Binance ...",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "hgggviq",
                            "author": "Gobliins2",
                            "score": 1,
                            "created_utc": 1634109414.0,
                            "response": "Not in the web interface",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "h4uzjge",
                    "author": "TheShibangelist",
                    "score": 3,
                    "created_utc": 1626045005.0,
                    "response": "It's not against GDPR, cause they don't share your data ( we hope ) but store it for later audits. \nNot covering for them but i guess they are covered  by the Terms And Conditions or some silent acceptance via some mail they sent you showing some new feature but hiding on the last page this fact and with the statement: please delete your account within x hours/days. Not deleting results in your acceptance of this new \"feature\" they added",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "h4wcv0g",
                            "author": "SDali27",
                            "score": 2,
                            "created_utc": 1626076867.0,
                            "response": "If they added it to the ToS they probably did it as you described. I just have never witnessed any online platform taking away peoples option to delete their account. It seems kinda shady to me.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "h4weliy",
                                    "author": "TheShibangelist",
                                    "score": 1,
                                    "created_utc": 1626078535.0,
                                    "response": "I know entities adding it not taking it away so i agree with you",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "h53ew9r",
                    "author": "Daejz",
                    "score": 6,
                    "created_utc": 1626218700.0,
                    "response": "I successfully deleted my account today, but it's not as easy as it should be. On the website the option to delete the account is completely missing and in the app (while still there) it's not functional (can't hit submit or anything).\n\nI contacted the chat support and the initial response was 'not possible, but you can disable the account' too. I had to tell the guy that I insist on my right to erasure (right to be forgotten) according to the GDPR and suddenly he was able to delete my account after I provided proof of ownership over the account.\n\nEdit: From the [Binance Privacy Policy](https://www.binance.com/en/privacy):\n> 8.3 Right to Erasure (Right to be Forgotten)\n> You have the right to request the erasure of your personal data under certain circumstances.\n\nHopefully the 'certain circumstances' will work for you too.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "h54txed",
                            "author": "SDali27",
                            "score": 1,
                            "created_utc": 1626251786.0,
                            "response": "You are the MVP my friend. Will try this today!",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hasewdx",
                            "author": "binbirnar",
                            "score": 2,
                            "created_utc": 1630233709.0,
                            "response": "Under certain circumstances obviously means to send them more data. I was asked to send a selfie to proof the ownership, which I didn't. I asked them to use another way with the already existing data they already have, so at the end they refused to delete my very own data.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hdixkrf",
                            "author": "iNo_fensif",
                            "score": 2,
                            "created_utc": 1632093530.0,
                            "response": "Thanks a lot man, I also managed to delete it today!\n\nThey told me FIVE times it was impossible even tho I insisted, but instantly did it (after proving ownership/taking a selfie) once I pulled \"I insist on my right to erasure (right to be forgotten) according to the GDPR European law Article 17\" lmao",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hdkwu6x",
                                    "author": "Faraday32",
                                    "score": 1,
                                    "created_utc": 1632139061.0,
                                    "response": "Worked for me too!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "hj9nru7",
                            "author": "ytkaaa",
                            "score": 2,
                            "created_utc": 1636024323.0,
                            "response": "They deleted point 8.3…",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hkbbtvq",
                            "author": "Answer_Jeff",
                            "score": 2,
                            "created_utc": 1636709360.0,
                            "response": "This worked for me - UK based.  Took maybe 10 mins end to end.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hdb4tr4",
                            "author": "FullyMild",
                            "score": 1,
                            "created_utc": 1631952673.0,
                            "response": "I did all these things and got extremely close but they ended up rejecting my request. I’m from Aus, do you think changing my VPN to the EU that would potentially change things?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hvrcu1j",
                                    "author": "someones_login",
                                    "score": 1,
                                    "created_utc": 1644106455.0,
                                    "response": "just in case you still want to delete it, I was finally able to get mine deleted after talking to support and stating Australian Privacy Principle 11. Still got the usual bs but it worked.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "hdkwsei",
                            "author": "Faraday32",
                            "score": 1,
                            "created_utc": 1632139030.0,
                            "response": "Get this man a beer. Or a line off a hooker's thigh. Or whatever he wants. The above just got my account permanently deleted!",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "he6ckb9",
                            "author": "Used-Shift9107",
                            "score": 1,
                            "created_utc": 1632539337.0,
                            "response": "Thank you so much!!! I was after them for a year trying to delete but no luck. It took me 10min with using your advice. I realy love seeing the “email is wrong “ when i try to log in . Thanks a lot",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hvb7vu3",
                            "author": "Hefty-Ad-1656",
                            "score": 1,
                            "created_utc": 1643827783.0,
                            "response": "Thank You Very Much.. Because of this Information I was able to delete my Binance Account",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8bowrn",
                            "author": "Jadzia626",
                            "score": 1,
                            "created_utc": 1652366922.0,
                            "response": "Just wanted to say that this method still works. Thanks a lot!\n\nI first tried to just ask for deletion. They refused, as others have reported. However, after coming across this thread, I tried again. Citing both their own ToS and GDPR, they didn't even protest this time.\n\nThey did claim that GDPR didn't apply in my country (not EU, but in EEA), which I pointed out was incorrect, and that was it.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "h4wg34f",
                    "author": "Puck_2016",
                    "score": 1,
                    "created_utc": 1626079972.0,
                    "response": "Why would it matter? They are likely required to keep your info anyway.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "h4wiog4",
                    "author": "Mysterious_Bug13",
                    "score": 1,
                    "created_utc": 1626082496.0,
                    "response": "Perhaps it depends on whether you are in USA or using the phone app?\n\nI'm in UK using desktop version. On the security page, under Account Activity, I can only see an option to disable account, not delete.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "h4yvqqr",
                    "author": "SealFlavor",
                    "score": 1,
                    "created_utc": 1626126548.0,
                    "response": "If you were able to delete your account and all it's data that would allow you to get the signups bonus over and over again.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hhbpov1",
                    "author": "substn5",
                    "score": 3,
                    "created_utc": 1634704328.0,
                    "response": "They asked for a selfie to delete my account!!! Doesn't that STINK of corrupt data gathering? I didn't give it to them, here the full chat... \n\nHi, CS Eka here. Thank you for waiting our response. In order to assist you, could you please clarify the issue details here?\n\n\nHi, please delete all data associated with the account email XXXXXX@XXX.com\n\n￼\n\nPlease bear with me for a moment while I'm checking this for you.\n\n￼\n\nMay I know why you disable the account and want to delete the data sir?\n\n\nNo, thanks\n\n￼\n￼\n￼\n\nRegarding inquiry, we are apologise as we cant delete the data immediately, based on our terms of use, you agree to allow us to keep a record of that information during the period for which your account is active and within five (5) years after your account is closed, in compliance with global industry standards on data storage. You can refer here for more details https://www.binance.com/en/terms\n\n\nNope.\nYour policy: 8.3 Right to Erasure (Right to be Forgotten) You have the right to request the erasure of your personal data under certain circumstances.\nMy protection: I insist on my right to erasure (right to be forgotten) according to the GDPR\n\n\nI reside in the EU. Please delete.\n\n￼\n\nPlease wait for a moment while I check with my team if we can do that\n\n\nThank you.\n\n￼\n\nPlease provide a selfie with your face entirely shown in it and holding a clear handwritten note. The note content is \"Today is date/month/year, delete my Binance account (xxx@xxx.com/phone number)\".\n\n\nYou don't currently have a photo of my face, so I'm not providing one now. I will provide a photo of a note with the date, my account email, and the requested message. That is all.\n\n￼\n\nDear sir, based on our SOP you need to provide it as requested so that we can proceed with account deletion\n\n￼\n[[ Image sent of note with no selfie ]]\n\nAccepted?\n\n￼\n\nWe are apologise sir, please provide a selfie with your face entirely shown in it and holding the clear handwritten note as requested so that we can proceed with account deletion\n\n\nShow me in your SOP where it requires a \"selfie\"\n\n\nPlease and thank you\n\n￼\n\nDear sir, please be understand that we have our own SOP to proceed with any action, and we cant provide it to users as it only for internal use. Kindly provide a selfie with your face entirely shown in it and holding the clear handwritten note as requested so that we can proceed with account deletion\n\n\nWhat is it for.... The photo. What do you use it for.\nYou do need to tell me, in line with GDPR\n\n￼\n\nI am checking with my team if we can do it without the selfie, please wait for a moment\n\n\nYes, thank you.\n\nWe have successfully delete your account as requested.\n\n\nIt is done, completely deleted?\n\n￼\n\nYes sir\n\n\nGreat... I cannot believe what absolute crap you requested to get this done. \n\n\nBinance are getting a terrible reputation. Do revisit the requirement to a) hold data for 5 years and b) require photos.\n\n\nI'm sure you'll get lots of fake photos. Good bye.\n\n\nThank you for your time.\n\n￼\n\nThank you for your feedback. My pleasure to assist you and have a nice day!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hv630t8",
                            "author": "fattoesyndrome2",
                            "score": 1,
                            "created_utc": 1643741741.0,
                            "response": "Wow you got to delete your account without selfie? Dude that’s crazy",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hvd2rlb",
                                    "author": "substn5",
                                    "score": 1,
                                    "created_utc": 1643853778.0,
                                    "response": "I know hey what world are we living in?! Not like there’s any selfies on Facebook or anything 🤦‍♂️",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i4icpbj",
                                            "author": "highlimit1",
                                            "score": 1,
                                            "created_utc": 1649813846.0,
                                            "response": "but they still got Your number?",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "hvb8aq4",
                            "author": "Hefty-Ad-1656",
                            "score": 1,
                            "created_utc": 1643827935.0,
                            "response": "Thank You, I used this exact format and it worked but there was a lot of back and forth but in the end my account got deleted so I’m happy. thank you.\nTried To login later and it didn’t work so that’s good news it said something about wrong username and password",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hvd102x",
                                    "author": "substn5",
                                    "score": 1,
                                    "created_utc": 1643853042.0,
                                    "response": "Wow over 3 months later they’re still asking for selfies. Pervs. Lol.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hve09t8",
                                            "author": "Hefty-Ad-1656",
                                            "score": 1,
                                            "created_utc": 1643869987.0,
                                            "response": "Yeah they are, but ended up sending a pic with my face and ID in it cause I don’t stay in the UK or Europe",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i4txfd0",
                            "author": "Dreamxice",
                            "score": 1,
                            "created_utc": 1650030297.0,
                            "response": "How were you able to get your account without a selfie ? I haven’t done the KYC to begin with and they demand a selfie to delete my account. I don’t know with what they will compare the selfie to",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hm1fe6i",
                    "author": "uffno",
                    "score": 3,
                    "created_utc": 1637852042.0,
                    "response": "These damn centralized crypto-exchanges are even worse than online social services.\nAt least nowadays you can find the hidden links to delete the account on the online social services, but the centralized crypto-exchanges either have no option to delete the account, refuse to delete the account, ask to contact through e-mail or chat, request further private data such as selfies, invoices, etc., or only offer the account close or shut down instead of deleting it. And even after that, it is not clear to the exchange's customer how long and which data the exchange is storing.\n\nNever again centralized crypto-exchanges!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hm1i4na",
                            "author": "SDali27",
                            "score": 2,
                            "created_utc": 1637853368.0,
                            "response": "Word!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "htck73j",
                    "author": "Cheese_latte",
                    "score": 3,
                    "created_utc": 1642616412.0,
                    "response": "I deleted my account without any issues. Here are the exact steps:\n\n1. Navigate to page where the privacy agreement is\n2. You will now see a chat icon at the bottom/right corner\n3. Type in \"How to delete account\"\n4. You will see a suggestion or two that does not contain this option, press \"Unresolved\"\n5. A support guy will start a chat, \"Could you explain more details?\"\n6. Type in \"Hi, I would like to delete my account with all my sensitive information.\"\n7. A support will ask you why\n8. Type \"I will not use this exchange anymore\"\n9. A support will give you disabling options etc.\n10. Type in \"According to GDPR European law (\"Right to erasure ('right to be forgotten')\") you have to delete my data upon my wish. I am <Country> nationality therefor the GDPR applies to me\"\n11. Then acknowledge that you want to delete\n12. Provide selfie with a note\n13. Support will wait for you, will provide also a link if you cannot do it now\n14. Done!\n\nFunny thing is that everything went really smooth and the support guy was very polite. We wished a nice day to each other and I even received a smiling emoji. :D :D :D\n\nAll of your comments helped, thanks!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hupprfg",
                            "author": "Akheldama",
                            "score": 1,
                            "created_utc": 1643460558.0,
                            "response": "Holy shit you're a genius thank you so much after spending like 2 hours trying to get them to delete my Canadian account this instantly did it 🙌🏻",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hvccd3g",
                            "author": "W3bT4G",
                            "score": 1,
                            "created_utc": 1643842867.0,
                            "response": "Thanks,  this worked 4 me :)",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hx3064r",
                            "author": "schorse66",
                            "score": 1,
                            "created_utc": 1644957976.0,
                            "response": "It worked today for me…nice",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9sjmj9",
                            "author": "AttemptKitchen",
                            "score": 1,
                            "created_utc": 1653389664.0,
                            "response": "Apparently they ask now for your ID card too lol, they did it with me.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hasejwu",
                    "author": "binbirnar",
                    "score": 2,
                    "created_utc": 1630233420.0,
                    "response": "This is ridiculous... They must be out of their minds. This is simply illegal and against data privacy. I had been trying to delete my account and was only able to disable it. Then used the support chat, first they said it is not possible and then they said okay we delete but we need a selfie with a written paper. So they need more data to delete the existing data? Which cannot be trusted anyways if they really delete your data... I regret very much to register for this platform. Never ever again.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "h4uyce2",
                    "author": "DamianNLD",
                    "score": 2,
                    "created_utc": 1626044414.0,
                    "response": "Very strange!! You should have 100% control over your own account!! Very disturbing!!\n\nThx for the warning ⚠️",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "h9lwc95",
                    "author": "Impulsive_Buyer",
                    "score": 1,
                    "created_utc": 1629422688.0,
                    "response": "Hi guys",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "h9lwirb",
                    "author": "Impulsive_Buyer",
                    "score": 1,
                    "created_utc": 1629422774.0,
                    "response": "Wow so disappointed with Binance, they would not honor my request to delete my account without violating my personal privacy even farther but requesting a selfie of my face with a note.\n\nLike I want my personal info delete buy hey send me your face so we can ID you and keep it for facial recognition..Creepy as Fuck\n\nI said would you like my blood type, fingerprints, driver's license to delete my anonymous account that I have not verified. This is a privacy violation of the right to delete my personal info.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ha7nm6m",
                            "author": "Bob___Wood",
                            "score": 1,
                            "created_utc": 1629839964.0,
                            "response": "Has anyone got further with this, they have deleted my api keys because i have another account that's verified but they wont delete that account can only disable it",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ha9vxe3",
                    "author": "viper1512",
                    "score": 1,
                    "created_utc": 1629885749.0,
                    "response": "This makes me never want to return to Binance. They allow you to disable your account but not delete. Spent 30 mins on the live chat wasted talking to a brick wall. It's ridiculous that you can't delete your own account and Binance support are unable to support it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hi72bt5",
                    "author": "brokva_x",
                    "score": 1,
                    "created_utc": 1635300221.0,
                    "response": "Hi all.\n\nJust wanted to share my experience today with deleting the Binance account. I live in Australia.\n\nAfter constant back and forth \"We can't delete it\" I ended up using below from u/Daejz (THANK YOU)\n\n>\"I would like to exercise my right to have my personal data deleted in accordance with GDPR. Even if this is not possible \"without further ado\"... just deactivating the account is not an option for me, sorry.\"\n\nAs GDPR is EU only I was asked what is my nationality (I have dual citizenship country in Europe). After providing my nationality (was not asked to prove anything so I guess you can give it a go) I got hit with \"In that case send us a selfie etc.\" and my account was deleted 10min after.\n\nOverall a HORRIBLE experience.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hqladtw",
                            "author": "Ok_Wolverine_3566",
                            "score": 1,
                            "created_utc": 1640896126.0,
                            "response": "This worked for me, too. I added \"According to GDPR European law (Article 17 EU GDPR “Right to erasure ('right to be forgotten')) you have to delete my data upon my wish. I am German nationality therefor the GDPR applies to me.\" \n\n&#x200B;\n\nHad to send the selfie and then my account was deleted (hopefully)",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hrk6qud",
                            "author": "Phil18877",
                            "score": 1,
                            "created_utc": 1641511247.0,
                            "response": "Thanks for posting your case. Went through the same shit and referring to GDPR was like using a magic wand. Customer support was even nice after - making clear he was following scripts and his hands were tied. Shady experience though.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hlvjft5",
                    "author": "cabr_n84",
                    "score": 1,
                    "created_utc": 1637739246.0,
                    "response": "how do you access the support chat?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hmc5z75",
                    "author": "klauspet0r",
                    "score": 1,
                    "created_utc": 1638057997.0,
                    "response": "It worked. It was hard to convince them and they insisted that deletion is not possible but when I threatened them with a complain to the EU data protection supervision autority the escalated my request and i had to send them a video with stuff i had to say. You need just to insist and say that this is illegal if they are not deleting the account. Few minutes after i uploaded the video i just got diconnected from my account and i can't access it anymore.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hn8350l",
                    "author": "samassey7",
                    "score": 1,
                    "created_utc": 1638643281.0,
                    "response": "Well I don't know if this is going to work, but they have a form for the California Customer Privacy Act that you fill out for those of us in California.  I got an email that says they received my request and are reviewing it.  I got this several days ago and have heard nothing since.  My account is still not deleted.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hndhkpj",
                    "author": "User9a",
                    "score": 1,
                    "created_utc": 1638739080.0,
                    "response": "once asked about deletion their standard answer is:\n\n>I am so sorry to hear about that decision of yours. However I am afraid that currently we wont be able and do not have the ability to delete your account.avatarKindly note after account disabled: -You are unable to login, all trades and withdrawal will be suspended -All authorised devices will be deleted -You will be unable to begin reactivation process until at least for two hours have passedavatarHere’s the steps to disable your account; a> Disable account via App: 1. Open the Binance App and go to Account - Security - Manage Account - Disable Account. 2. Read the reminders carefully and tap Disable Account. b> Disable account via Website: 1. Log in to your account on Binance.com and go to Profile - Security. 2. Click Disable account. 3. Read the reminders carefully and click Disable this account.\n\n**remember:** remove all funds before engaging in a heated support discussion. i once did and suddenly my account (even api) locked up and they fenced my ip.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hpscs9y",
                    "author": "ZealousRabbit",
                    "score": 2,
                    "created_utc": 1640333400.0,
                    "response": "Adding to this, I just went trough the same ordeal.\n\nWanted to delete, apparently not possible anymore. Point 8.3 has been removed from their ToS. Mentioned the GDPR, mentioned the EU regulators, same procedure. \"Please send a note and a selfie of you holding the note\".\n\nI asked why, \"internal policy\". May I see this internal policy regarding my data? \"Nope, please contact [dpo@binance.com](mailto:dpo@binance.com)\". They refused to delete my personal data without me giving more personal data. I wonder, what if I sent a picture of somebody else holding a paper?How would the know?What's the purpose?\n\nReporting them now to the regulator in Germany, let's see how it goes.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hr3w515",
                            "author": "Serva_NUM",
                            "score": 1,
                            "created_utc": 1641236583.0,
                            "response": "Based on Binance privacy policy section 10 you have the right to request anything about your account, here is what exactly I found: In addition, subject to applicable law, you have the right to request   \naccess to, correct, and delete your personal data, and to ask for data   \nportability. You may also object to our processing of your personal data  \n or ask that we restrict the processing of your personal data in certain  \n instances. If you wish to do any of these things, please contact   \ndpo@binance.com.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hr3xmsj",
                                    "author": "ZealousRabbit",
                                    "score": 1,
                                    "created_utc": 1641237137.0,
                                    "response": "Thanks for the reply, already asked clarification to the address pointed out, still no reply (understandable considering the holidays)",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hr7qaex",
                                            "author": "Tall_Lifeguard5733",
                                            "score": 1,
                                            "created_utc": 1641305412.0,
                                            "response": "Finally deleted mine, took an hour to do so. All you have to do is insist and mention EU Article 17 and that you gonna complain to the EU data protection supervision authority, then they make an “exception”.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hrchjcw",
                                                    "author": "Serva_NUM",
                                                    "score": 1,
                                                    "created_utc": 1641386157.0,
                                                    "response": ">What is this EU Article ? is it on Binance privacy policies or somewhere else?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "hredeqf",
                                                            "author": "Tall_Lifeguard5733",
                                                            "score": 1,
                                                            "created_utc": 1641413706.0,
                                                            "response": "https://www.privacy-regulation.eu/en/article-17-right-to-erasure-'right-to-be-forgotten'-GDPR.htm",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i4ideco",
                                                    "author": "highlimit1",
                                                    "score": 1,
                                                    "created_utc": 1649814139.0,
                                                    "response": "but they want selfie and number?",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hqh03b4",
                    "author": "Dan4tw",
                    "score": 1,
                    "created_utc": 1640818704.0,
                    "response": "Went through the same shit, as$holes would not delete the account. What a terrible service",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "huvlopl",
                    "author": "ginko_bilobaba",
                    "score": 1,
                    "created_utc": 1643564658.0,
                    "response": "2022 update: Eu citizen here, they would not delete the account until you specify your right to be forgotten as per GDPR regulation. Also, they won't delete the account until you provide a selfie with you holding a piece of paper. quite bad experience, would not recommend.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hvg68ls",
                            "author": "skarrrrrrr",
                            "score": 1,
                            "created_utc": 1643911148.0,
                            "response": "you are not really free. They specify on their TOS that they will keep your data for 5 years anyways.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hvftpa4",
                    "author": "skarrrrrrr",
                    "score": 1,
                    "created_utc": 1643906638.0,
                    "response": "Binance has turned evil. Thanks to this thread I was able to delete my accounts, but I don't trust Binance anymore. It's a pity because I have been a customer almost since Binance launched but now they have gone to \"the other side\". Now Binance is starting to get registered locally in all countries and it's going to become an informer and data trafficker. Very sad, bye forever Binance !",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hwh0jl5",
                    "author": "jussi666",
                    "score": 1,
                    "created_utc": 1644559202.0,
                    "response": "I got my account removed today and didn't even have to mention GDPR. 5 minutes after submitting the selfie, I got \"login status expired\" and my account credentials work no longer. However how do I know if they really deleted anything...",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hxt5xgz",
                    "author": "MaxTucker1",
                    "score": 1,
                    "created_utc": 1645430851.0,
                    "response": "Just did it, they only asked for previously used device info screenshots, no selfie.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i342mcz",
                            "author": "ba__baracuss",
                            "score": 1,
                            "created_utc": 1648910670.0,
                            "response": "Similar here. Asked for selfie, I refused and asked for device info.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i4jbili",
                                    "author": "highlimit1",
                                    "score": 1,
                                    "created_utc": 1649833040.0,
                                    "response": "but with device info can they identify You like with id or phone?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hzxg483",
                    "author": "Wooden-Farm-6638",
                    "score": 1,
                    "created_utc": 1646796915.0,
                    "response": "I totally agree as I want to do the same. Have you found a way to do this since you uploaded this post?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8bqvo9",
                            "author": "Jadzia626",
                            "score": 1,
                            "created_utc": 1652367689.0,
                            "response": "It still works. At least when citing GDPR. I just did so.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i6jqkf2",
                    "author": "friendlyfireman25",
                    "score": 1,
                    "created_utc": 1651161693.0,
                    "response": "I got my account deleted. They refused to do it without the selfie, but confirmed, that the selfie would be deleted forever together with all the other data associated with the account once the verification is complete.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}