{
    "subreddit": "Binance",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uta0ep",
            "title": "Elon Musk Is GivingAway Crypto - BTC / ETH",
            "url": "https://elonsx2.com",
            "author": "aryamansingh",
            "created_utc": 1652985440.0,
            "score": 90,
            "num_comments": 11,
            "subreddit": "binance",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i98g737",
                    "author": "UndergroundGroover",
                    "score": 5,
                    "created_utc": 1652985570.0,
                    "response": "SCAM",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i98gmeo",
                    "author": "UndergroundGroover",
                    "score": 3,
                    "created_utc": 1652985744.0,
                    "response": "Binance - why do you allow blatant SCAMS on your reddit????",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i98hl0h",
                            "author": "ikkatop",
                            "score": 1,
                            "created_utc": 1652986135.0,
                            "response": "Report it and block the user",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i98hr2d",
                                    "author": "UndergroundGroover",
                                    "score": 1,
                                    "created_utc": 1652986203.0,
                                    "response": "Already have reported and i hope you and others do the same.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i98hzj6",
                    "author": "Zveno",
                    "score": -1,
                    "created_utc": 1652986297.0,
                    "response": "Elon musk is doing a crypto giveaway for btc&eth??? https://elonsx2.com",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i98jtei",
                            "author": "excel958",
                            "score": 1,
                            "created_utc": 1652987043.0,
                            "response": "Fuck off",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i98ju1v",
                    "author": "excel958",
                    "score": 1,
                    "created_utc": 1652987050.0,
                    "response": "Fuck off scammer",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i98k1n1",
                    "author": "thefindingfountai",
                    "score": 1,
                    "created_utc": 1652987137.0,
                    "response": "No he isn’t.  Go away and eat shit scammer",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i98ka9x",
                    "author": "MadManD3vi0us",
                    "score": 1,
                    "created_utc": 1652987234.0,
                    "response": "Fucking scammer!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i98kdc9",
                    "author": "wooktar",
                    "score": 1,
                    "created_utc": 1652987269.0,
                    "response": "Go to hell scammer",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ut9s4p",
            "title": "Binance in Talks for Regulatory Approval in Germany, CEO Says. What Possible Impact Does Binance Global expansion Have on the Crypto Ecosystem.",
            "url": "https://www.reddit.com/r/binance/comments/ut9s4p/binance_in_talks_for_regulatory_approval_in/",
            "author": "Livid_Toe_721",
            "created_utc": 1652984803.0,
            "score": 32,
            "num_comments": 27,
            "subreddit": "binance",
            "selftext": "Binance, a cryptocurrency exchange, is in talks with German regulators, according to founder and CEO Changpeng \"CZ\" Zhao.\nBinance is hiring compliance personnel for its German team in the hopes of obtaining a license, he  stated at the Finance Forward Conference in Hamburg  event on Wednesday.\nHe stated, \"Our staff is definitely talking with regulators here.\"\nBinance focused on obtaining licenses in the world's top marketplaces after obtaining authorisation to operate in Bahrain, Abu Dhabi, and Dubai.\nA license in Germany, the continent's largest economy, might pave the way for more regulatory acceptance elsewhere.\n\nBinance, the largest cryptocurrency platform, won a major victory in its development aspirations earlier this month, receiving approval from French financial regulators. The exchange was recognized as a Digital Asset Service Provider (DASP) in France by the AMF, the country's top regulator.\nIt was reported earlier this week that, the exchange is trying to beef up its legal and compliance team in case of any regulatory concerns. Binance US is looking to hire an employment counsel and a paralegal, while Binance Holdings Ltd. has 41 job openings in its legal division.\n\nIn think that the global expansion of the largest cryptocurrency exchange is  a welcome initiative. We all are witnessing how countries around the world have been considering how best to handle the growth of the digital currency system and how best to use it to leverage of the growing popularity and adoption of cryptocurrencies. We have witnessed an increase in adoption and popularity of cryptocurrencies and blockchain technology. \n\nIf we take a look at the rapidly developing blockchain ecosystem and at the Decentraland  an online world that allows users to create their own avatars and purchase plots of virtual land, Planet Maya which is powered by champions games is  a decentralized and collaborative online casino which allows developers to build Games around betting, Luckyblock which  is a digital asset project that decentralizies the lottery process via blockchain technology. Silks a blockchain-based metaverse that enables users to own, trade, and profit from thoroughbred racing horses. The blockchain technology seems on par to becoming an essential part of modern society just like the internet. \n\nBinance  expansion and regulatory approval by Germany would surely create a global atmosphere where in more government would be more open to adapting cryptocurrencies use and a more crypto friendly regulation system. \nYeah the crypto economy was designed to be decentralised but it is quite interesting for it to be mainstream it will be subject to regulations by centralized bodies. \n\n\nNews source:  https://www.coindesk.com/business/2022/05/18/binance-in-talks-for-regulatory-approval-in-germany-ceo-says/",
            "stickied": false,
            "comments": [
                {
                    "id": "i9b4nhx",
                    "author": "blutilein",
                    "score": 2,
                    "created_utc": 1653039938.0,
                    "response": "Germany has some strict rules and laws in it‘s financial sector.\nAn governable approval here would sign some more sceptical states that binance „plays by the rules“.\nIt surely could lead to more acceptance.\nBut I as a German user do not have any problems using binance.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9az3x4",
                    "author": "NorbeeNorbee",
                    "score": 1,
                    "created_utc": 1653035389.0,
                    "response": "Had no idea binance cant function in germany on a official matter yet",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ckm98",
                    "author": "Potential-alia-2022",
                    "score": 1,
                    "created_utc": 1653065015.0,
                    "response": "https://twitter.com/user/status/1524500107546222593",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}