{
    "subreddit": "Binance",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uj17bl",
            "title": "So, for the last few months, I and my team are working on algorithms and finally, we completed the testing face, Algorithms and Quant is Future.",
            "url": "https://i.redd.it/6xqljiuboox81.png",
            "author": "highonfunds",
            "created_utc": 1651767855.0,
            "score": 10,
            "num_comments": 10,
            "subreddit": "binance",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i7gb3nu",
                    "author": "bbaasbb",
                    "score": 3,
                    "created_utc": 1651773107.0,
                    "response": "So you now have a free money machine and can keep printing? You broke the system.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7h3zyw",
                    "author": "pokerbruhh",
                    "score": 3,
                    "created_utc": 1651784733.0,
                    "response": "I wanna know what happened to that PnL after today...",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "tvzxp7",
            "title": "Is Binance having liquidity issues?",
            "url": "https://www.reddit.com/r/binance/comments/tvzxp7/is_binance_having_liquidity_issues/",
            "author": "CryMeABurrito",
            "created_utc": 1649072509.0,
            "score": 3,
            "num_comments": 31,
            "subreddit": "binance",
            "selftext": "I just had several attempts to withdraw my tokens rejected by the system. Took them about 6 hours to reject each one so I was waiting for over 24 hours already after my final attempt to withdraw got rejected again (this was particularly painful to experience because I essentially got locked out of a very important opportunity for me, unable to buy during a specific period). I've been reading that this has been happening more frequently too. What exactly is up with this platform? Should I be worried that I won't be able to withdraw my tokens at all? Also, do you have suggestions for better exchanges where this doesn't occur as often as in Binance?\n\nEdit/Update: This was me trying to withdraw my Sol tokens. It turns out the network was congested. I decided not to wait for the congestion to lighten and to just convert them to USDT > Transfer to KuCoin > Buy Sol again to transfer to my Phantom wallet. ✨️ Thank you for all the comments! 🙌",
            "stickied": false,
            "comments": [
                {
                    "id": "i3cqa9l",
                    "author": "summonsterism",
                    "score": 4,
                    "created_utc": 1649080988.0,
                    "response": "what coin/token/project are you referring to pal?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i3eidzd",
                    "author": "Still_Lobster_8428",
                    "score": 3,
                    "created_utc": 1649105972.0,
                    "response": "Listing what tokens you tried to withdraw and what time stamps might help. \n\nThere can be a range of issues at play, not just Binance as the CEX platform.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uj3hfa",
            "title": "Binance receives regulatory approval in France, clearing the route for its expansion throughout Europe.",
            "url": "https://www.reddit.com/r/binance/comments/uj3hfa/binance_receives_regulatory_approval_in_france/",
            "author": "Elise47666",
            "created_utc": 1651774203.0,
            "score": 68,
            "num_comments": 13,
            "subreddit": "binance",
            "selftext": "Binance, the world's largest crypto exchange by volume and the trading place of a wide variety of cryptos and NFT utility coins like AXS, MANA and Quint, announced on Thursday that it has received regulatory authority to operate digital asset services in France, making it the first European country to do so.\n\nThe country's market and banking regulators gave the exchange the go-ahead, months after the exchange had encountered many regulatory hurdles on the continent. \n\nIn a statement, Binance founder and CEO Changpeng Zhao, widely known as CZ, said, \"Effective regulation is necessary for the mainstream acceptance of cryptocurrency.\" \n\nBinance must focus on \"anti-money laundering compliance,\" according to France's financial industry regulator, if it wants regulatory clearance to open a regional headquarters in Paris. In August, the UK issued a notice stating that the company lacked written permission to operate there. A similar warning was issued by Germany.\n\nBinance has been working hard to demonstrate to European regulators its commitment to practicing compliance and promoting the blockchain ecosystem in the region. Binance announced in November that it would invest 100 million euros to \"support the development of the French and European blockchain and cryptocurrency ecosystems\" as well as establish a research and development center in France. \n\nBinance, which was created in China, has mainly abandoned the country as a result of Beijing's broad crypto ban. Many Chinese-founded cryptocurrency companies have relocated their headquarters to Singapore, which is swiftly becoming a regional powerhouse for blockchain entrepreneurs. Binance is understood to be looking for a new home, having announced in December that it would withdraw its licensing application and cease operations in Singapore.",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uj1hyu",
            "title": "yep, the entire floor is a lava, thanks to FED?",
            "url": "https://i.redd.it/zojx7pt5rox81.png",
            "author": "chiqui_jo",
            "created_utc": 1651768851.0,
            "score": 25,
            "num_comments": 35,
            "subreddit": "binance",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i7h6lxg",
                    "author": "Particular_Aspect334",
                    "score": 9,
                    "created_utc": 1651785832.0,
                    "response": "at 70k people dream to see it back at 30k so they can buy. when it does go back to 30k everyone panics. you want it high or low, which is it? let's stick to buy high / sell low - much simpler",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7jn9rz",
                            "author": "Inayaarime",
                            "score": 4,
                            "created_utc": 1651839439.0,
                            "response": ">you want it high or low, which is it?\n\nyes",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7i913f",
                    "author": "Lobstershaft",
                    "score": 6,
                    "created_utc": 1651804169.0,
                    "response": "Down 0.01%!? Oh no, the horror!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7j60rs",
                            "author": "Oofster1",
                            "score": 3,
                            "created_utc": 1651826762.0,
                            "response": "If only the post was made now, then it would be a bit more true",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "uj3na4",
            "title": "Binance Secures Regulatory Approval in France. As Binance is on track to expand it's global operations how does this affect the Crypto ecosystem?",
            "url": "https://www.reddit.com/r/binance/comments/uj3na4/binance_secures_regulatory_approval_in_france_as/",
            "author": "Nathaly_fc",
            "created_utc": 1651774654.0,
            "score": 18,
            "num_comments": 12,
            "subreddit": "binance",
            "selftext": "According to a press release from France's capital market regulator, the AMF (Autorité des marchés financiers), cryptocurrency exchange Binance has received regulatory permission in France.\nBinance has been approved as a Digital Asset Service Provider (DASP) in France, which means it will be able to hold digital assets, enable their buy, sale, and exchange, and run a trading platform for them. According to a company blog post, this is Binance's first such license in Europe.\nAfter receiving preliminary authorisation to operate as a broker-dealer in virtual assets in Abu Dhabi last month, the business is expanding its global activities.\nDue to its decentralized nature, Binance has never had a single headquarters, which regulators dislike because it lacks accountability. Last year, a slew of regulatory agencies around the world issued warnings that Binance was not permitted to operate in their jurisdictions.\n\n\"We are grateful to the AMF and ACPR, who displayed a commitment to innovation that allowed Binance to navigate the full application process,\" Binance CEO Changpeng Zhao said in response to the recent news. Binance has always placed its users first, and as a reputable DASP registered in France, the crypto community can now have even more confidence in Binance France.\"\n\n\nIn my opinion Binance global expansion of operations is exciting news for the crypto community.  The platform has earlier in the year obtained licenses to operate in Bahrain, Abu Dhabi and Dubai. The Platform seeks to create a global market for itself. The platform's obtaining government certification to operate gives Binance accountability and without a doubt creates trust with the government, regulatory bodies and users.\n\nThis will no doubt help the whole Blockchain ecosystem has it grows and would no doubt aid the development of new innovative projects within the space such as  Silks a blockchain-based metaverse that enables users to own, trade, and profit from thoroughbred racing horses, Faith tribe which is a platform for creating trading, distribution, and monetization of designs of fashion, Luckyblock which  is a digital asset project that decentralizies the lottery process via blockchain technology.\n\nThe Blockchain and crypto ecosystem is rapidly growing has cryptocurrencies are being adopted by financial institutions and government bodies around the globe. Binance global expansion and it's securing regulatory agreement would without a doubt help solidify cryptocurrencies entrance into the  mainstream.",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uj7hd8",
            "title": "Currently, SHIB is trading at $0.0000227, down 2.62% on the day and 5.48% across the previous seven days, according to CoinMarketCap data.Meanwhile, the total market capitalization of the token at the time of publication stood at $12.3 billion, placing SHIB as the 15th-largest cryptocurrency.",
            "url": "https://i.redd.it/8pnqd6174qx81.png",
            "author": "Nasty_slutX",
            "created_utc": 1651785289.0,
            "score": 9,
            "num_comments": 16,
            "subreddit": "binance",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uj30mp",
            "title": "INDIANS CAN BENEFIT FROM BINANCE'S NEW CRYPTO EDUCATION MOVEMENT.",
            "url": "https://www.reddit.com/r/binance/comments/uj30mp/indians_can_benefit_from_binances_new_crypto/",
            "author": "peterhoegir",
            "created_utc": 1651772979.0,
            "score": 4,
            "num_comments": 9,
            "subreddit": "binance",
            "selftext": "Binance has announced many educational initiatives that will empower crypto investors in India. Binance said they have recognized the importance of educating crypto investors, and have made it their number one priority to drive awareness of crypto and Blockchain across India.\n\nBinance in a press statement said \"The growth witnessed by firms in India, and the strategic importance of the geography,  educating investors has been an area of concern for multiple stakeholders, including regulators and policymakers.\"\n\nThe industry is committed to building awareness around Blockchain technology and cryptocurrency, primarily among the student community. \nThe statement from Binance said the firm tends to build awareness around blockchain and cryptocurrency through three key educational initiatives, Binance aims to provide open access to Blockchain and crypto learnings.\n\nWe believe in financial freedom through crypto adoption, Binance said.\nLeon Foong, head of APAC at Binance said India is one of the countries with the largest populations in the world with a median age of 28, this represents a huge opportunity for us to play our role in educating their future innovators and builders of India, especially students, and equip them with relevant Blockchain and crypto knowledge to build a path towards financial freedom.\n\nAmidst  Binance announcing initiatives that will empower crypto investors in India.  The Bank of Uganda released a press report advising the public that they can't convert cryptocurrencies into mobile money. Such conversion cannot happen without the participation of the payment service providers.\n\nKawere warned that any entity involved in dealing with such cryptocurrencies will face severe consequences. This is to warn all licensed firms like Faith Tribe, and Meta Tokyo under the National Payment System Act, 2020 to avoid facilitating cryptocurrency transactions as the Bank of Uganda will not hesitate to invoke its power under Section 13(I) (b) and (f) of the NPS Act, 2020 for any license found to breach the above directives.",
            "stickied": false,
            "comments": [
                {
                    "id": "i7gdh6d",
                    "author": "ThisIsARepostBotBot",
                    "score": 3,
                    "created_utc": 1651774053.0,
                    "response": "OP (peterhoegir) appears to be a karma farming repost bot, please downvote and report.\n\nThese accounts obtain karma by reposting memes in sub such as funny, meme, programmerhumor, etc. They use this karma to spam subreddits as well as participate in [pump and dump](https://en.wikipedia.org/wiki/Pump_and_dump) and [rug pull schemes](https://en.wikipedia.org/wiki/Exit_scam).\n\n ^-- ^This ^is ^a ^experimental ^semiautomatic ^system, ^which ^in ^rare ^cases ^may ^be ^inaccurate.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uiyf40",
            "title": "New thing in binance",
            "url": "https://i.redd.it/0eoaorrd1ox81.jpg",
            "author": "PublicKindly3300",
            "created_utc": 1651760129.0,
            "score": 11,
            "num_comments": 11,
            "subreddit": "binance",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "ui9je2",
            "title": "again kyc when trade against eur ???",
            "url": "https://www.reddit.com/r/binance/comments/ui9je2/again_kyc_when_trade_against_eur/",
            "author": "b00nibert",
            "created_utc": 1651679085.0,
            "score": 3,
            "num_comments": 10,
            "subreddit": "binance",
            "selftext": "wtf? why again kyc????",
            "stickied": false,
            "comments": []
        }
    ]
}