{
    "subreddit": "Binance",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ut9fez",
            "title": "Should the BNB Chain be the destination port for Terra developers?",
            "url": "https://www.reddit.com/r/binance/comments/ut9fez/should_the_bnb_chain_be_the_destination_port_for/",
            "author": "Brockdky",
            "created_utc": 1652983824.0,
            "score": 29,
            "num_comments": 12,
            "subreddit": "binance",
            "selftext": "With Terra practically back to scratch and finding its way out of the recent turbulence it got into with the depegging of its UST stablecoin, developers on the terra blockchain would sooner or later have to migrate to more stable networks to continue building their projects.\n\nIn light of this onboarding opportunity, BNB chain has made a loud call to ‘’Terra Buidlers to come build on rock-solid foundations,’’ and it promises those who make the move by migrating to the BNB chain some truly amazing offers.\n\nSome of these promising offers include the support of an active BNB community and the backing of BInance itself… which is well known to be the largest cryptocurrency trading platform in the world. The BNB chain team has also promised to support Terra migrants and their projects by connecting them with major cryptocurrency companies such as coin market cap and trust wallet, and yes, there is also a $1 billion BNB chain investment fund available for them to scoop from.\n\nBut being fully aware that aside from the BNB chain, there are also several other layer-1 blockchain networks such as Polygon, Fantom, Zetrix and Vechain which individually have their strengths and unique benefits for developers and projects built on their network.\n\nWould you therefore advise terra developers to latch on this BNB chain offer without considering their possibilities with some of these other networks?",
            "stickied": false,
            "comments": [
                {
                    "id": "i99g0v3",
                    "author": "jekpopulous2",
                    "score": 2,
                    "created_utc": 1653002002.0,
                    "response": "They’re mostly gonna go to other chains that use CosmosSDK (Cosmos, Osmosis, EVMOS, Secret, etc…) because they’re already part of that ecosystem.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i98f0ke",
                    "author": "Blgxx",
                    "score": -1,
                    "created_utc": 1652985083.0,
                    "response": "Reef chain is your best bet.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9b5ls1",
                    "author": "Boomer-Awerness420",
                    "score": 1,
                    "created_utc": 1653040688.0,
                    "response": "I would advice the Terra devs the following: get another job preferably a new profession kek.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i99zuzg",
                    "author": "machotaraqc",
                    "score": -6,
                    "created_utc": 1653011922.0,
                    "response": "thank me later🙏❤️ https://www.youtube.com/watch?v=tDZtBzqow6Q",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ad3wi",
                            "author": "Buy_More_Bitcoin",
                            "score": 3,
                            "created_utc": 1653018853.0,
                            "response": "#psa: this YouTube 'snipe bot tutorial' is a scam to drain you wallet",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9a577z",
                    "author": "cleanshavencaveman",
                    "score": -3,
                    "created_utc": 1653014573.0,
                    "response": "Terra and Binance deserve each other.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}