{
    "subreddit": "Binance",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "us14fg",
            "title": "Wouldn’t You Instantly 2X With Luna Fork?",
            "url": "https://www.reddit.com/r/binance/comments/us14fg/wouldnt_you_instantly_2x_with_luna_fork/",
            "author": "Atsoc1993",
            "created_utc": 1652835780.0,
            "score": 1,
            "num_comments": 4,
            "subreddit": "binance",
            "selftext": "Hear me out, \n\nYou may have seen my “Calculate your Luna V2 after fork” conversion post. \n\nFirst of all I was wrong, 10,000,000 ($2,000 worth) Luna V1 would end up being 153.xx Luna V2.\n\n1 Luna V2 would need to be worth $10-$15 for you to stay even at $2,000 if they airdropped.\n\nBUT, assuming everyone doesn’t dump immediately, and they do bring it out at the equivalent investment price right off the bat. Wouldn’t you just instantly 2x your investment since they don’t take the what could now be “meme” Luna v1 version away from you? Unless they rug or pull the contract 100% to 0.00000 you still technically have 10,000,000 Luna V1 AND 153 Luna V2 each worth $2000 each? You could just dump it and put it right back into Luna V1 or Vice versa? Thoughts?\n\n\n*TLDR: If they airdropped the equivalent $ investment in Luna V2 to Luna V1 holders they don’t really have the power to clawback your Luna V1 in doing so. Wouldn’t you instantly 2x and have Luna V1 and Luna V2 at the same value (assuming they don’t pull the plug, start Luna V2 IPO at <$1 or somehow clawback which I don’t think is possible)*\n\nEdit: Well you can’t dump more than 10% instantly because of 2 Year lock but still",
            "stickied": false,
            "comments": [
                {
                    "id": "i90qh8l",
                    "author": "DizzyMammoth21",
                    "score": 3,
                    "created_utc": 1652836849.0,
                    "response": "I thought the fork went this way. \n\nAnyone whom purchased after snapshot will have LUNA Classic. \n\nAnyone who purchased before the snapshot would receive LUNA v2. \n\nSame for UST. \n\nWe will then be trading TWO seperate tickers just like Ethereum Classic and Ethereum. \n\n\nThis is how I take the fork idea.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i90qryr",
                            "author": "Atsoc1993",
                            "score": 1,
                            "created_utc": 1652836991.0,
                            "response": "The fork proposal by Do Kwon (very few if anyone from the community supports) states anyone who buys between May 5th(?) and May 27th gets 10% of 100,000,000 of the 1B Luna V2 tokens.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i90zy0z",
                    "author": "Still_Lobster_8428",
                    "score": 1,
                    "created_utc": 1652841331.0,
                    "response": ">Luna V2 each worth $2000 each?\n\nThey can't be serious..... $2,000 each BAHAHAHAHAHAHAHA\n\nThe wider market won't accept that valuation on release! There just won't be buyers at all for it and price will crash to where buy order demand starts coming in! \n\nFor something to have VALUE, buyers MUST meet sellers at a price they are BOTH willing to conduct a transaction at! This is basic market mechanics! \n\nFor a price to be set: \n\n- Sell orders MUST find a buy order\n\n- Buy orders MUST find a sell order\n\nThat works great in a highly liquid market, lots of buyers and lots of sellers are every price level. But in a crashing market.... Who the fuck is willing to take the risk to catch a falling knife! Very few people, so the buy side liquidity just disappears! Sellers are desperately trying to sell and are using \"at market\" sell orders, those at market sell orders are live until they find buy order liquidity at ANY price level that will fill.... But buyers are not willing to catch a falling knife. \n\nSellers end up stuck in a sell order que as everyone else is trying to sell at the same time, and buy order liquidity get hit, fills a few orders at the front of the que and just blasts through that price level looking for more buy side liquidity! \n\n(And people wonder where 80,000 BTC ($2.4B) disappeared to during this recent crash..... Using $2.4B buy orders to try fill $9B of sell orders.... Do the fuckin MATH! The buy orders were $6.6B to little to halt the stampede of sell orders!) \n\nIf anyone is even a little interested in understand how markets work, this link really is a 10min master-class in explaining exactly how market's function and price is found. Understanding this stuff can SAVE YOUR ASS! \n\n[https://youtu.be/mUvB89DMtww](https://youtu.be/mUvB89DMtww)\n\nThis applies to ALL CEX markets..... Buyers MUST meet sellers to conduct a trade! \n\nSo, back to $2,000 LUNA2 airdrop. \n\nHow many people do you think it takes to crash the price of LUNA2 once trading is avalible? If tgere are no buyers waiting in the market..... Just 1. 1 seller that sells 1 LUNA2 with a at market sell order will see that sell order at WHATEVER price a buyer has placed a \"Limit\" buy order. \n\nIf that 1st order is at $1..... Have a guess what price that LUNA2 will sell for.... $1. Can you now guess what price ALL LUNA2 are now priced at...... $1 each. \n\nWhat if that Limit buy order is even lower, $0.0000001. How much do you think that LUNA2 at market sell order is filling for? $0.0000001.... Can you now guess what price ALL LUNA2 are now priced at...... $0.0000001 each! \n\nFor a price to exist, buyers AND sellers must be willing to transact at that price. If you just say that something is \"worth\" $2,000 but there are no buyers willing to buy at that price..... The reality of it is, it's ONLY worth the price a buyer is willing to buy it from you for and if that is $0.0000001... Then that is its price.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i91jrp0",
                    "author": "packeteer",
                    "score": 1,
                    "created_utc": 1652853236.0,
                    "response": "a roll back would be better than this silly fork nonsense, or better yet rebuild Anchor / UST to be more resilient / realistic and just let time take care of the rest",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}