{
    "subreddit": "Binance",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "pv5ogk",
            "title": "Binance card details are nowhere to be found",
            "url": "https://www.reddit.com/r/binance/comments/pv5ogk/binance_card_details_are_nowhere_to_be_found/",
            "author": "pitacore",
            "created_utc": 1632572282.0,
            "score": 4,
            "num_comments": 6,
            "subreddit": "binance",
            "selftext": "I'm trying to use my virtual Binance card for the first time. Obviously, I need card details (card number, expiration date, CVV) for this. I have looked everywhere around the Binance website and I cant find the option to reveal the details.\n\nI have found a Binance FAQ which states that there is an option for this in \\[Wallet\\]->\\[Card\\] submenu, but this submenu does not exist (at least not for me). The nearest thing is \\[Wallet\\]->\\[Funding Wallet\\], through which I can access the Card page. However, the Card page doesn't show me my virtual card details, nor can I find any option to reveal them. Under \"Manage my card\" there are only \"View PIN\" and \"Freeze\", nothing about showing card details, which is strange.\n\nBefore you ask - yes, my card is activated, it says \"Active\" and there is a green dot in the top-right corner of the card image (with hidden details, of course).\n\nAnother point - my original card was Swipe, which was transferred under Binance some time ago by the admin team. Maybe they forgot to to enable something?",
            "stickied": false,
            "comments": [
                {
                    "id": "he7x9h6",
                    "author": "FrighteningOni",
                    "score": 1,
                    "created_utc": 1632576816.0,
                    "response": "(on the app) Go to wallets> in the top bar you have a few tabs> (you should be in the \"overview\" tab)scroll to the right and there should be a tab called \"card\", click on it> scroll all the way down and there should be a link \"go to card dashboard.\" Click that and you should be able to check your virtual card oit.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "he83e84",
                    "author": "EuW_MadWard",
                    "score": 1,
                    "created_utc": 1632579750.0,
                    "response": ">Before you ask - yes, my card is activated, it says \"Active\" and there is a green dot in the top-right corner of the card image (with hidden details, of course).\n\nThis means you already have a physical card, and no virtual card any more. All purchases (physical and online) have to be done using this physical card and the details engraved on it.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "he8iw6g",
                            "author": "pitacore",
                            "score": 1,
                            "created_utc": 1632586822.0,
                            "response": "You are correct, thank you. The physical card (Swipe) is indeed the card which is linked to my Binance account (so-called Funding Wallet). All necessary details are on the physical card, of course.\n\nWhat confused me is the fact that I received Swipe card some time ago, then some months later the Swipe card was officially terminated and I was asked to clear the balance on that card before some deadline. My impression was that the Swipe card is done, and that swipe users will be migrated to so-called Binance Visa card. I expected to receive a virtual Binance card first, and a new physical card later on. Obviously, this hasn't been well explained. Good thing I didn't throw away the Swipe card, thinking that it was useless.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "uw3teb",
            "title": "Connexus Network",
            "url": "https://www.reddit.com/r/binance/comments/uw3teb/connexus_network/",
            "author": "ArrivalWorried3806",
            "created_utc": 1653322362.0,
            "score": 10,
            "num_comments": 6,
            "subreddit": "binance",
            "selftext": "Connexus Network\n\nI want to tell you about a new technology project. This is not investment advice\n\nWeb - [connexus.network](https://connexus.network/)\n\nTelegram - [https://t.me/ConnexusNetwork](https://t.me/ConnexusNetwork)\n\nTwitter - [https://twitter.com/ConnexusNetwork](https://twitter.com/ConnexusNetwork)  \n\n\nhttps://www.altcoinstalks.com/index.php?topic=268101.0  \nhttps://bitcoingarden.org/forum/index.php?topic=117036.new#new \n\nPURPOSE\n\nConnexus is a community-driven development and analysis project designed for developers and produced as a solution to multiple network software problems. Using Connexus Network, developers can develop software and DApp projects using a single infrastructure for Ethereum, Binance Smart Chain, Solana and Avalanche networks.\n\nAt the same time, developers can redesign their Smart Contract production not for single networks, but as multi-chain with Connexus Network smart contracts.\n\nIn summary; Developers and project owners can create a DApp application that supports Ethereum, Binance Smart Chain, Solana, Avalanche blockchain networks for their multi-chain supported Tokens. In this way, the project token is made available for trading or staking not only on 1 network, but also on 4 networks.\n\nWORK\n\nConnexus Network is a multi-chain + DApp infrastructure software module for smart contracts. It has a structure that combines DApp systems created using Node.JS and React with Solidity and smart contracts.\n\nDevelopers don't need to create DApp connections for every blockchain network and mess with RPC systems. It is possible to build DApps for 4 blockchain networks on the market using Node.JS modules powered by Connexus Network.\n\nUTILITY\n\nDApp & Software Development\n\nBuild multi-chain DApp applications for your project. Address users of Ethereum, Binance Smart Chain, Avalanche, Solana networks, not users of a single network.\n\nHigh Speed Machining\n\nUse additional Connexus Network Libraries for slowdowns on Node.JS and React infrastructures used on standard DApp systems. Increase your DApp speed by up to 32.27% by standards.\n\nReliable Infrastructure\n\nReliability, the most important aspect of blockchain technology, also applies to the Connexus network. Every transaction made on the DApp is 100% securely encrypted.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9pwkgz",
                    "author": "MarkoDragich",
                    "score": 1,
                    "created_utc": 1653333993.0,
                    "response": "Seen this all over social media, fb and insta. It's a big event for crypto, sharing for others :) [https://em-x2.org](https://em-x2.org)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9pk8l8",
                    "author": "Inthewirelain",
                    "score": 0,
                    "created_utc": 1653328713.0,
                    "response": "And this spam has what to do w binance exactly....?\n\nEven if your project wasn't a scam, I'll never bother to look at it properly if you're going to do spam marketing. Makes you seem so desperate.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}