{
    "subreddit": "Binance",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ruyghf",
            "title": "What are the risks of Binance Earn?",
            "url": "https://www.reddit.com/r/binance/comments/ruyghf/what_are_the_risks_of_binance_earn/",
            "author": "saurgalen",
            "created_utc": 1641204789.0,
            "score": 28,
            "num_comments": 127,
            "subreddit": "binance",
            "selftext": "I'm still shocked that I'm earning 7.7% - 8.24% APY for free on ADA, yesterday I saw even short locking (10 days) for 35% which is insane.\n\nWhat are the risks that I'm getting myself into?",
            "stickied": false,
            "comments": [
                {
                    "id": "hr28ry0",
                    "author": "Alice_D_Wonderland",
                    "score": 34,
                    "created_utc": 1641209793.0,
                    "response": "When staking the value of the coin might drop... so you can’t sell them straight away and have to wait till staking period is over...\n\nYou can redeem early but this will cost you your intrest (the amount of intrest will be subtracted from the amount you’ve staked)\n\nSince you’re new to staking; APY % is on yearly base, so don’t expect to get 35% a day!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hr2wmy7",
                            "author": "dougermoon",
                            "score": 9,
                            "created_utc": 1641222975.0,
                            "response": "High risk rewards are in the DEFI to get more APY",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hr45o8x",
                            "author": "Stanley_Pointer",
                            "score": 4,
                            "created_utc": 1641240091.0,
                            "response": "I saw the same i staked my ada for 60 days and get 7% a year. \n\nBut now they are offering 30%+ per year for just 10 days lock up. \n\nFeels wrong asf I took more risk going 60 days hoping to ride out a winter. But I could have done way better now. \n\nIts just weird. \n\n\n\nI'll guess another risk to staking is if they hacked you are too.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hr4esj0",
                                    "author": "CharacterCoast1661",
                                    "score": 3,
                                    "created_utc": 1641243553.0,
                                    "response": "Also for the 10 days staking, the amount is very limited and quite small (usually under $100-$200) so they offer that as a marketing tool, people will have to either move ada to binance from other staking or buy ada from them (which also can mean they have too much ada on hand and want to create liquid) \nYes I almost certain binance is losing on 10 days period for 30%. But dont expect after 10 days u can get another 30%, at that time you’ll either have to stake w them for the long term (they’re making $ at 7%) or withdrawal to other staking platforms (and pay withdraw few which excess the 30% profit on 10 days) or again swap back to your prefer coin which is also fee.\nRegardless, sometimes binance has those deal to attract more liquidity or create fomo, and they take a loss on it, but you can only stake very small amount. So for me i always keep a small number on flexible saving (as for trade/swap/liquid etc) and if they have something like this for the coin that Im holding anyways, I’ll go for it and stake the max they offer for the account. Otherwise it is not worth it tbh, moving coin is more expensive.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "hr49ydi",
                                    "author": "Alice_D_Wonderland",
                                    "score": 2,
                                    "created_utc": 1641241710.0,
                                    "response": "60 days 7% for 1 coin = 0,01150 coins\n\n10 days 30% for 1 coin = 0,00821 coins\n\nSo 60 days is better...\n\nEdit; staked or not, when hacked they can get to it all (staked coins can be redeemed early)",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hr4uycj",
                                            "author": "Kyle262638",
                                            "score": 3,
                                            "created_utc": 1641249833.0,
                                            "response": "I would be staking in 10day increments until it's gone. Then switch to 60day",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hr4ymzf",
                                                    "author": "CryptoRoast_",
                                                    "score": 3,
                                                    "created_utc": 1641251312.0,
                                                    "response": "10 day option (and most of the best APYs on Earn) is almost always unavailable. So you'll be waiting 30 days before the 10 day option is available 😅",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "hr4zube",
                                                    "author": "Alice_D_Wonderland",
                                                    "score": 2,
                                                    "created_utc": 1641251803.0,
                                                    "response": "Touché... 0,00821*6= 0,04931 in 60 days\n\nBut like u/CryptoRoast_ said, high %APY is most of the time unavailable...",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "hr51r5i",
                                    "author": "shitcoining2themoon",
                                    "score": 1,
                                    "created_utc": 1641252578.0,
                                    "response": "You're what?\n\nHoping to ride out a winter?\n\nHave you been through a winter? It won't be 60 days..",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hr28rfb",
                    "author": "Groundbreaking_Cod94",
                    "score": 14,
                    "created_utc": 1641209784.0,
                    "response": "the main risk in binance itself, since you agreed to their term and conditions when you opened an account which states that they can ban and close your account at any time without a reason, 2nd risk is binance getting hacked, 3rd is your account getting hacked, a friend of mine got his account hacked and lost 70% of his coins, and then binance locked his account and pretty much stole the remaining 30% of his  coins since his account was too risky, he sent them many videos of ID proof but they ghosted him for almost 6 months now, i would never advise to keep all your coins in one exchange, you can stake your ADA with 0 risk from your cold hardware wallet by using yotoi, and getting the same APY with no risk, if you wanna keep using a centralized exchange i would advise to stake ADA at multiple exchanges, maybe coinsbase, gate io, kraken etc.. whatever allows ada staking.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hr3feez",
                            "author": "bittybrains",
                            "score": 7,
                            "created_utc": 1641230441.0,
                            "response": "> 2nd risk is binance getting hacked, 3rd is your account getting hacked, a friend of mine got his account hacked and lost 70% of his coins\n\nIf you max out your security settings and use whitelisted addresses, I struggle to see how a hacker can steal your coins without you at least being made aware 24 hours before they're able to make a withdrawal (assuming they somehow get that far), which should be more than enough time to change your passwords.\n\nI'm not saying it isn't wise to keep your money off exchanges for other reasons, but being hacked isn't my primary reason for doing so.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hr3ovuq",
                                    "author": "Doinjesuswalk",
                                    "score": 1,
                                    "created_utc": 1641233931.0,
                                    "response": "Why 24 hours before? Can you put a cool down on whitelisting addresses?\n\nIf so where do I find the setting?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hr3xghg",
                                            "author": "bittybrains",
                                            "score": 2,
                                            "created_utc": 1641237073.0,
                                            "response": "In your security settings, just enable the \"Withdrawal whitelist 24hr limit\" option.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "hr408ws",
                                    "author": "Groundbreaking_Cod94",
                                    "score": 1,
                                    "created_utc": 1641238083.0,
                                    "response": "my friend's computer was attacked by some virus that took control over his pc, his account was already logged in, but hacker couldn't withdraw since my friend had 2FA and sms and email required for that, so hacker was smart, he put his nft for sale on binance nft marketplace from his own account, and bought the nft from my friend's account, since buying an nft didn't require 2FA at the time, i have no idea if they fixed this issue now!",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hr44uc6",
                                            "author": "bittybrains",
                                            "score": 2,
                                            "created_utc": 1641239779.0,
                                            "response": "Well that's scary. I don't know whether 2FA is required for a purchase, but I was just able to set my NFT Purchase Limit to £100, though I'm not sure what good that would do if 2FA was already compromised, besides sending me an extra alert before a purchase is made.\n\nIt seems to me like these markets should be opt-in and require a similar time limit before purchasing is allowed, otherwise it does seem like another thing a hacker can potentially exploit.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "hr46ngr",
                                            "author": "Stanley_Pointer",
                                            "score": 1,
                                            "created_utc": 1641240459.0,
                                            "response": "Lol. Or he opened any desk after being told about an amazing new opportunity. Thats how most get hacked for sure. Mayb not any desk.\n\nThey just send the coins to the hacker lol most crazy story I heard was a teacher in England an full English  who is a school teacher. \n\nShe sent all of her bitcoin to hackers during the Elon scam £9.000 and she truly believed they will send her £18.000 back. \n\nUniversity doesn't mean nothing i have a street education and would never ever fall for that bs.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "hr4yrlg",
                                            "author": "CryptoRoast_",
                                            "score": 1,
                                            "created_utc": 1641251364.0,
                                            "response": "They fixed this ages ago.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "hr2xt8s",
                            "author": "Loupak_",
                            "score": 2,
                            "created_utc": 1641223479.0,
                            "response": "^(typo when you talked about Yoroi you spelt yotoi)",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hr463lb",
                            "author": "Stanley_Pointer",
                            "score": 1,
                            "created_utc": 1641240252.0,
                            "response": "Or just convert it to ALGO hold it anywhere and it stakes itself. Market cap 7 billion £. \n\nAda cap 33 billion £. \n\nAlgo £1.30 \nAda 99p \n\nStarting to seem like a no brained lol.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hr4g0y2",
                                    "author": "Separate_Safety_99",
                                    "score": 1,
                                    "created_utc": 1641244029.0,
                                    "response": "How? What? What is this logic?\n\nAda can be secured/staked through yoroi/daedalus wallet \n\nAlso you cant just compare 2 different projects on their market cap alone",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hr2w415",
                    "author": "nikkivizzz",
                    "score": 2,
                    "created_utc": 1641222741.0,
                    "response": "stable coins give around 6% on average and yea it's better and u have low or almost no risk\n\nother coins give a better rate but the value fluctuates which is risky in coin value as well as ur rate because you will be rewarded in the same staked coins.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hr479x5",
                            "author": "Stanley_Pointer",
                            "score": 2,
                            "created_utc": 1641240696.0,
                            "response": "Wouldn't it be better to use stable coins to provide liquidity to uniswap or other instead. Lending your stable coins out. \n\nYeild farming? I honestly have no idea about this stuff though I skip the videos talking this stuff cos I don't have 1000s of dollars to play with Nd seems pointless with 100s.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hr4agv9",
                                    "author": "nikkivizzz",
                                    "score": 1,
                                    "created_utc": 1641241903.0,
                                    "response": "I don't think you get a better reward if u stake both pairs as stable coins(I'm not sure about uni swap V3 as they use the ranges that act as derivatives, which still don't give jaw-dropping returns)\n\nbut again if u pool with a semi-stable coin u still bear the market risk of the other coin\n\nUniswap works on eth-chain which consumes heck a lot of gas fees so it's not recommended for low investors but u can try pancake(Bsc) or others.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hr2fguh",
                    "author": "Bodybuilder06",
                    "score": 4,
                    "created_utc": 1641214274.0,
                    "response": "Saw a lot of stakable coins which I staked ADA, AXS, DIA and SOL which are gonna earn me passive returns. \n\nI don't think there is any risk in staking so far you're not staking shitty coins.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hr2z3i7",
                            "author": "wattybanker",
                            "score": 3,
                            "created_utc": 1641224024.0,
                            "response": "There’s always risks. Crypto Markets are volatile keep this in mind whenever you invest your money.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hr47n8z",
                            "author": "Stanley_Pointer",
                            "score": -1,
                            "created_utc": 1641240838.0,
                            "response": "2p per day per coin? \n\nThats all I get from my little clip of Ada 113 of them I think. For 2p a day lol. \n\nHow much ada do I stake to earn £1 a day £365 a year still seems pointless though. £5 per day £1.800 a year now we talking thats just a random guess though. 365x5= idk.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hr2glpp",
                    "author": "Careful_Suggestion_",
                    "score": 1,
                    "created_utc": 1641214949.0,
                    "response": "The only risk is that the coin might very well fall in value while your money is locked in it. I tried the 10-day option with Solana yesterday to earn 32% APY. That's a mouthful.\n\nnUSDO on V3 OINDAO is another mouthful coin that I'm enjoying. I'm staking it to earn 77% APY.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hr58fuo",
                            "author": "LammiAlts",
                            "score": 1,
                            "created_utc": 1641255348.0,
                            "response": "As long as the coins offered are good there’s nothing to worry anoutu, i enjoy 35% sometimes on CTSI via binance earn, the only loss is if the value of tokens drop",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hr2xfty",
                    "author": "Loupak_",
                    "score": 1,
                    "created_utc": 1641223319.0,
                    "response": "You already got your \"risk\" answers. I'll just drop in and say it's healthier for the networks if your stake off exchanges, it also removes another risk: a binance hack. Staking on binance means you're staking with coins that don't really belong to you, as long as they stay on Binance it's more like a promise these coins are yours. Cardano is a nice projet and I encourage you to withdraw your ADA to a Yoroi wallet and stake from there. Or don't :) but now you know your options.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hr3qkrx",
                    "author": "alwxcanhk",
                    "score": 1,
                    "created_utc": 1641234540.0,
                    "response": "No risk. I’ve been using Binance Earn for a long time. The only thing is I buy & sell a lot so I use “Flexible Earn” which pays less but I can Redeem Instantly to sell. \n\nIf you are locking for a specific time and let’s say ADA hit $5 for a few minutes where u would wanna sell and buy again then u will loose the chance. \n\nAlso u can’t place a limit sell order.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hr431cj",
                    "author": "NODES2K",
                    "score": 1,
                    "created_utc": 1641239111.0,
                    "response": "What's the point of using binance to gain when you cannot withdrawal when needed.\n\nFuck binance",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hr49pbm",
                    "author": "SouthernShoulder7919",
                    "score": 1,
                    "created_utc": 1641241615.0,
                    "response": "I love binance earn, but i love even more the liquid swap !",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hr236iu",
                    "author": "Daveinbelfast",
                    "score": -30,
                    "created_utc": 1641205492.0,
                    "response": "In the case of unprotected sex there are several sexually transmitted infections you should be wary of.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hr2oncy",
                    "author": "TheBeave101",
                    "score": -5,
                    "created_utc": 1641219271.0,
                    "response": "(whispers) Bonk... #Shibonk #SHIBO",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}