{
    "subreddit": "Binance",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "qgx7q2",
            "title": "ORE Systems - Gaming/SDK Company - NFT Marketplace live - CoinmarketCap & CoinGecko listed - Certik Audit complete - Doxxed Experienced Team - Xbox, Unreal, Unity Partners - FegEx Listed - almost 10k Holders!! Next Billion Dollar Marketcap project on BSC.",
            "url": "https://www.reddit.com/r/binance/comments/qgx7q2/ore_systems_gamingsdk_company_nft_marketplace/",
            "author": "Reb_Eye_Stone",
            "created_utc": 1635342860.0,
            "score": 41,
            "num_comments": 8,
            "subreddit": "binance",
            "selftext": " **COINMARKETCAP & COINGECKO LISTED!**\n\n**Certik Audit Complete!**\n\n**Listed on FegEx!**\n\n**The Project**\n\nORE System has created the ORE Forge NFT Marketplace to provide Game Developers the ability to create their in-game NFT items and allow them to be transportable throughout a content producers games.\n\nIndividual gamers can also transport their own NFT throughout any compatible game in the ORE System.\n\nContent Creators will be using the SDK product to create games, NFTs and other content using the ORE Forge & Software Development Kit. The founders want to help indie content producers with access to the ability to produce games effectively and easily on the blockchain.\n\n**The Team**\n\nA group of professionals in the tech/software/gaming space have united to create the ORE System and the ORE Token is the fundamental currency that will be used within games created using the ORE Software\n\nDoxxed Team - they are giga friendly and approachable but super busy, so the community in telegram are super helpful and ready to assist with any questions. With almost 10k holders there is a really great vibe!\n\nIf you're from another country don't stress, we have a few international TG groups as well!\n\n**Partnerships**\n\nThe ORE System has partnered with Unity, Unreal, and Microsoft to provide support for The ORE SDK’s integration into the next generation of gaming. See website for more details.\n\nThe team have AAA FPS in development called osirisPROTOCOL - a proof of concept game being released soon on XBox Live. This game will carry the crypto wallet function IN GAME and serve as a proof of concept for the ORE Systems integration into video games\n\n**Links**\n\nBuy ORE on FegEx: [https://fegex.com/](https://fegex.com/)\n\nWebsite: [https://ore-system.com/](https://ore-system.com/)\n\nWhitepaper: [https://ore-system.com/wp-content/uploads/2021/09/ORE\\_System\\_White\\_Paper-v1.0.4.pdf](https://ore-system.com/wp-content/uploads/2021/09/ORE_System_White_Paper-v1.0.4.pdf)\n\nTelegram: TheORESystem\n\nTwitter: [https://twitter.com/ORESystemNFT](https://twitter.com/ORESystemNFT)\n\n**Contract: 0x8e2d8f40818fbaba663db6a24fb9b527fc7100be**",
            "stickied": false,
            "comments": [
                {
                    "id": "hi9ber2",
                    "author": "ninenulls",
                    "score": 1,
                    "created_utc": 1635348972.0,
                    "response": "great price right now, too. I hope this dip flips to a spike here soon",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hiaae37",
                    "author": "No-Investigator-6132",
                    "score": 1,
                    "created_utc": 1635362756.0,
                    "response": "Thank you for your Support!  $ORE, we are that which is FORGED! Valhalla! @ORESystemNFT #ORE #WarriOREs #ENJIN #GMR #FUTURE #GAMING #NFT #CRYPTO #ProjectF117 #OsirisProtocol\n\n#THE.SHIBA.INU.OF.GAMING",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hr8cejh",
                    "author": "BoxAlarmed7907",
                    "score": 1,
                    "created_utc": 1641314671.0,
                    "response": "How many ore system holders are there now?",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}