{
    "subreddit": "Binance",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uz3p1f",
            "title": "LUNA coins",
            "url": "https://www.reddit.com/r/binance/comments/uz3p1f/luna_coins/",
            "author": "eliemakhoul",
            "created_utc": 1653673650.0,
            "score": 6,
            "num_comments": 21,
            "subreddit": "binance",
            "selftext": "I have luna coins but have no price under them and can’t trade them in spot. Does anyone have an idea what’s going to happen to people that hold luna on binance?",
            "stickied": false,
            "comments": [
                {
                    "id": "ia7x5ve",
                    "author": "_BigBoss_1988",
                    "score": 3,
                    "created_utc": 1653673911.0,
                    "response": "https://www.binance.com/en/support/announcement/c52fa3c686be4b2b9d5df50de15847ec",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia7xkde",
                    "author": "TomasPolaco",
                    "score": 3,
                    "created_utc": 1653674085.0,
                    "response": "I have the same, it was notified, trading of Luna will resume on 30th of May changed into Luna Classic",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia9jpcw",
                    "author": "jun_039",
                    "score": 2,
                    "created_utc": 1653702052.0,
                    "response": "undergoing migration old luna to LUNC, terra classic. it will be again tradeable on may 30th or 31st",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia80xy4",
                    "author": "TheGood1swertaken",
                    "score": 2,
                    "created_utc": 1653675555.0,
                    "response": "Do we need to do anything?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia84lj3",
                    "author": "RemarkableBusiness57",
                    "score": 1,
                    "created_utc": 1653677148.0,
                    "response": "Same issue here I moved mine to Terra Station from crypto.com zero usd",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iacde4y",
                            "author": "dvodelenup",
                            "score": 1,
                            "created_utc": 1653764809.0,
                            "response": "I really wish that Terra will be revived so we can see the seamless transactions between these Dexes on the ecosystem. I keep wondering what will be the fate of the likes of Terra Station, TerraStar, and TFM Dex which was recently launched to bring seamless trade before the crash.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iabtp1z",
                    "author": "FunkyCheeze-514",
                    "score": 1,
                    "created_utc": 1653755430.0,
                    "response": "Does anyone know if my wrapped luna held on a DEX automatically swap to LUNC?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia8pcsf",
                    "author": "Beamer4202",
                    "score": 0,
                    "created_utc": 1653686614.0,
                    "response": "Yeah they’re worthless now 🤷‍♂️ I’ll take them if you don’t want",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iabeho5",
                    "author": "Erebus25",
                    "score": 0,
                    "created_utc": 1653748254.0,
                    "response": "Just crazy viral event going on right now, sharing with you guys. https://2x-em.org/",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uz3qal",
            "title": "Binance to Advise Kazakhstan on Crypto Regulations. What do you think of this move?",
            "url": "https://www.reddit.com/r/binance/comments/uz3qal/binance_to_advise_kazakhstan_on_crypto/",
            "author": "Beltondkj",
            "created_utc": 1653673747.0,
            "score": 27,
            "num_comments": 11,
            "subreddit": "binance",
            "selftext": "Binance, the world's largest cryptocurrency exchange by trading volume and the trading place of wide variety of cryptos including Solana, Concordium, Ethereum and so on, has signed an agreement with Kazakhstan's Ministry of Digital Development, Innovation, and Aerospace Industry. In the crypto space, the major crypto platform and the department will collaborate. \n\nThe memorandum was signed during Binance CEO Changpeng Zhao's visit to the Central Asian country, according to the crypto news outlet Forklog, which cited the company. Zhao met with top government officials in Kazakhstan, including the head of the digital development ministry, Bagdat Musin, and President Kassym-Jomart Tokayev. \n\nAccording to the report, Binance will advise the country on cryptocurrency regulation. The Ministry of Digital Transformation and the exchange will also look for a solution that will allow Kazakhstan's banking infrastructure to be integrated with the cryptocurrency market, the document details.\n\nFurthermore, Binance and the Ministry of Finance have agreed to collaborate in support of the Astana International Financial Centre (AIFC), the financial hub in Nur-Sultan, formerly Astana. The two parties have discussed the creation of a blockchain-focused venture fund and an academy \"to help local talent from the Astana Hub reach the global level,\" according to Musin. \n\nKazakhstan wishes for AIFC to serve as a hub for regulated cryptocurrency exchanges. As part of a pilot project, the country's National Association of Blockchain and Data Center Industry announced last summer that domestic commercial banks will be allowed to open accounts for crypto trading platforms registered at the hub. \n\nKazakhstan became a major mining hotspot after China cracked down on its crypto mining industry last spring, but the influx of miners has been blamed for a growing power deficit.\n\nTo address the issue, the government intends to implement differentiated tax rates based on the cost of consumed electrical energy. The necessary changes to the Tax Code were approved on first reading in the Mazhilis, the lower house of parliament, this week.",
            "stickied": false,
            "comments": [
                {
                    "id": "ia8luki",
                    "author": "Maelstrom116",
                    "score": 5,
                    "created_utc": 1653684950.0,
                    "response": "VERY NIIICE",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaay5hl",
                    "author": "useemrlymad",
                    "score": 1,
                    "created_utc": 1653738943.0,
                    "response": "binance on its way to be the next IWF",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iabefiv",
                    "author": "Erebus25",
                    "score": 1,
                    "created_utc": 1653748224.0,
                    "response": "Seen this on social just now, its going crazy viral, hope it helps you guys. https://2x-em.org/",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uz3rc7",
            "title": "Binance's Bahrain License Upgraded for More Crypto Services. How does Binance Regulatory Compliance With Countries Around the Globe Accelerate the Expansion of the Crypto Ecosystem?",
            "url": "https://www.reddit.com/r/binance/comments/uz3rc7/binances_bahrain_license_upgraded_for_more_crypto/",
            "author": "Bigcokki",
            "created_utc": 1653673825.0,
            "score": 38,
            "num_comments": 11,
            "subreddit": "binance",
            "selftext": "Binance, the world's largest cryptocurrency exchange, said that the Central Bank of Bahrain has granted its Bahrain business a Category 4 license, allowing it to provide a broader variety of services to Bahraini users.\nIn December, Binance Bahrain received a preliminary license, followed by a complete license in March.\nAccording to the company's website, the new ranking \"will enable Binance Bahrain to provide a full spectrum of crypto-asset exchange services.\"\nAccording to the exchange, it is the only crypto service provider in the country to receive a complete Category 4 license.\n\nRegulators in a number of nations, including the United Kingdom, Japan, and Israel, targeted the exchange last year. Since then, it has been bolstering its compliance team by recruiting from the ranks of former regulators.\nIt has also increased its presence in the Middle East. It was granted a restricted operating license in Dubai in March and temporary authorisation to operate as a broker dealer in Abu Dhabi, the UAE's capital, in April.\n\nIn my opinion Binance's increased regulatory compliance is great for the mainstream adoption of Cryptocurrencies and blockchain technology. \nA regulatory compliance that acknowledges operations of the biggest crypto exchange platform in the world will increase cryptocurrecy use in a country. Regulations creates trust with the crypto centric platforms and government institutions who in turn would facilitate cryptocurrency use, trust is also created between users and platforms as the regulations serve to protect rights of users. \nAlso regulations would grant investors both retail and institutional confidence to invest the crypto and blockchain ecosystem. \n\n\nThe blockchain ecosystem is  growing by facilitating the development of innovative projects that could reshape industries and even create new markets. \nThe innovation of the developing ecosystem is embodied by projects such as Silks a blockchain-based metaverse that enables users to own, trade, and profit from thoroughbred racing horses, Shiryo is a P2E Card trading game in the metaverse that allows users to hold their cards as NFTsbased on the Ethereum network, Sandbox is like the metaverse-equivalent of MineCraft in terms of its design and functionality. It like a real estate on the metaverse, Decentraland  an online world that allows users to create their own avatars and purchase plots of virtual land. I think that as blockchain technology becomes more mainstream.\n\nHowever while regulations are good for the increased adoption they might stifle innovation and technological development with stringent rules and act to centralize the crypto ecosystem.\nI think it is an irony that Bitcoin and it's alternatives which were designed to be decentralized protocols have to be subject to centralized authorities in order to thrive. \n\n\nNews Source: \nhttps://www.coindesk.com/business/2022/05/26/binances-bahrain-license-upgraded-for-more-crypto-services/",
            "stickied": false,
            "comments": []
        }
    ]
}