{
    "subreddit": "Binance",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ur19cf",
            "title": "EW Analysis Counting Bitcoin waves Leg Down Crash🚣‍♂️ 🌊",
            "url": "https://youtu.be/rcN9KOMf5vM",
            "author": "_BitBull_",
            "created_utc": 1652722114.0,
            "score": 1,
            "num_comments": 1,
            "subreddit": "binance",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "ur1gkr",
            "title": "Binance decided to remove my 'Verified' status manually",
            "url": "https://www.reddit.com/r/binance/comments/ur1gkr/binance_decided_to_remove_my_verified_status/",
            "author": "Cryptofu92",
            "created_utc": 1652722652.0,
            "score": 1,
            "num_comments": 15,
            "subreddit": "binance",
            "selftext": "So I wonder, do I have to fear talking to their support team because they can manually remove my Verified status??\n\nWhat happened is: I don't know in other places, but in Germany and I guess in Europe we had to re-verify the accounts since few weeks ago via either bank transaction or video call.\n\nI used my ID when I first registered on Binance 1 year ago without any issues, but now that ID is useless. Since I don't own a passport and my non-German ID isn't accepted on Binance, I thought \"hey let's do it via bank account\" since my bank is already linked over a year and I have done some transactions already.\n\nI did the bank transaction for verification (0,05 cent), I sent it successfully but on Binance it was stuck on the same page even though my transaction was successful (checked it on my bank, I did that process 3 times).\n\nThe support team told me they can manually removed my 'Verified' status and I can do the whole process again just in case their system is bugged with re-verification. So they removed my status completely and it was like a fresh account that I had to put all my information from beginning. And after that, they started telling me, the verification via bank isn't possible anymore on this account and my only option is via video call. But on video call they can only accept German IDs or passports.So yeah, now my account is stucked on this process and I can't do anything.\n\n&#x200B;\n\nIs there another exchanger I should consider moving to? All I need is for it to have a physical card I can use (like Binance does) so I can use my USDT. Also something with low fees would be nice since that was the main reason I picked Binance.",
            "stickied": false,
            "comments": []
        }
    ]
}