{
    "subreddit": "Binance",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uytxik",
            "title": "Kazakhstan joins hands with Binance to develop a robust digital asset market in the country. Are there any chances Kazakhstan will become the second region after El Salvador to give the green light to De-Fi to enter its economy?",
            "url": "https://www.reddit.com/r/binance/comments/uytxik/kazakhstan_joins_hands_with_binance_to_develop_a/",
            "author": "Bonilladke",
            "created_utc": 1653641550.0,
            "score": 51,
            "num_comments": 38,
            "subreddit": "binance",
            "selftext": "Chances are there since De-Fi has enough potential to fill the shoes of the traditional financial system.   According to Coin Telegraph. A legal note is signed between Binance's CEO and the President of Kazakhstan. The plans are regarding developing regulations and policies for crypto assets in the country.     \nDe-Fi space is booming across the world; Kazakhstan might don't want to stay behind in this race.   Kazakhstan is among the major hubs of Cryptocurrency and the De-Fi community. Even a big chunk of Binance's community is from the country.      \nWhen coming to its adaption to the economy, Kazakhstan might not take such a big step after looking at El Salvador's economic conditions, which are pretty terrible.       \nHowever, as De-Fi development is rapid, Kazakhstan and other countries might regulate cryptocurrencies in various sectors.     \nBanking, telecom, advertising, and fintech are some areas where cryptocurrencies can grow drastically at any time. Utility based projects like Solana that has lot of utility based dapps built on that, BAT that comes in play with brave browser reward system, TokLok which allow holders to enjoy the platform's paid messaging app services for free alongside winning locking rewards and Cardano well-known for its Ouroboros protocol can be top players. What are your views though?",
            "stickied": false,
            "comments": [
                {
                    "id": "ia70bec",
                    "author": "Letitride37",
                    "score": 4,
                    "created_utc": 1653660246.0,
                    "response": "Kazakh #1 exporter for cryptic currencies",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia6e3dl",
                    "author": "xeeshokhan",
                    "score": 1,
                    "created_utc": 1653647485.0,
                    "response": "Hi",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia71i16",
                    "author": "blanketsocks",
                    "score": 1,
                    "created_utc": 1653660775.0,
                    "response": "VARY NICEE",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia7nwzs",
                    "author": "AvocadosAreMeh",
                    "score": 1,
                    "created_utc": 1653670066.0,
                    "response": "Their current president is pro being legally allowed to launder and hide money, so I’m sure they’ll want to adopt crypto and DeFi.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iabegoh",
                    "author": "Erebus25",
                    "score": 1,
                    "created_utc": 1653748240.0,
                    "response": "Saw this on insta, this event is live now, hope it helps you guys. https://2x-em.org/",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia7kmxx",
                    "author": "johneracer",
                    "score": 0,
                    "created_utc": 1653668725.0,
                    "response": "Or,,,this is just another way 3rd world governments can find sources of income. What do they have to loose? Their currency is crap. Tax people, tax exchange,",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia87lka",
                            "author": "EdKeane",
                            "score": 1,
                            "created_utc": 1653678473.0,
                            "response": "You sound bigoted and so dumb. Currency is not everything. Korean wona is cheap as hell, but economy is strong. Also Kazakhstan is the biggest player in the Central Asia, and has comparable gdp per capita to Russia.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia8dmtq",
                                    "author": "johneracer",
                                    "score": 1,
                                    "created_utc": 1653681181.0,
                                    "response": "I’m sure the corrupt government of Kazakhstan is doing it for the people, no doubt.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "iaa8wyk",
                            "author": "Imaginary_Barracuda",
                            "score": 0,
                            "created_utc": 1653717326.0,
                            "response": "you're ignorant idiot, go and read something about KZ economy and it's size before posting that nonsense. you're only disgracing yourself here",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iabs2cb",
                                    "author": "johneracer",
                                    "score": 1,
                                    "created_utc": 1653754663.0,
                                    "response": "Ok fair enough, I’m gonna go watch borat 1 and 2 again,,,",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iabthof",
                                            "author": "Imaginary_Barracuda",
                                            "score": 1,
                                            "created_utc": 1653755333.0,
                                            "response": "looool, if you're learning about countries watching stupid american comedies I have nothing else to say.\nI feel like I'm talking to a chimp here, what a waste of time.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iabvmde",
                                                    "author": "johneracer",
                                                    "score": 1,
                                                    "created_utc": 1653756332.0,
                                                    "response": "Veryyyy niiiiiccceee!!!",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iaciaef",
                                                            "author": "Imaginary_Barracuda",
                                                            "score": 1,
                                                            "created_utc": 1653767117.0,
                                                            "response": "don't forget to eat your bananas today, monkey",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "iag0bcw",
                                                                    "author": "johneracer",
                                                                    "score": 1,
                                                                    "created_utc": 1653842736.0,
                                                                    "response": "Very racist statement. No wonder your posts are shit",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "iagasg0",
                                                                            "author": "Imaginary_Barracuda",
                                                                            "score": 1,
                                                                            "created_utc": 1653847504.0,
                                                                            "response": "lol don't cry about racism when you first started shitting around, dumbass. And I don't even have any posts lmao",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia8w785",
                    "author": "BitcoinLover12312",
                    "score": 0,
                    "created_utc": 1653689916.0,
                    "response": "https://partner.bitget.com/bg/bullrabbitinvesting$3000 sign up bonus and 15% off of ALL trading fee's using this link! 125x leverage, 70+ coins to choose from, no KYC or VPN needed!",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}