{
    "subreddit": "Binance",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ula0nv",
            "title": "CZ’s Humble Beginnings: From a $700K Loss to $60B in Net Worth",
            "url": "https://www.reddit.com/r/binance/comments/ula0nv/czs_humble_beginnings_from_a_700k_loss_to_60b_in/",
            "author": "Last-Ad1050",
            "created_utc": 1652040550.0,
            "score": 51,
            "num_comments": 41,
            "subreddit": "binance",
            "selftext": "Three days ago, Nas Daily – posted a video featuring Binance’s CEO Changpeng Zhao (CZ). The 5-minute video demonstrated a glimpse of CZ’s life, his journey with cryptocurrency, and the beginnings of Binance. CZ makes an actual appearance in the video as Nuseir interviews and talks on his story.\n\nThe clip highlights the gentle beginnings of CZ before being the wealthiest person in crypto. The video begins in 2013 with CZ losing $700,000 as BTC’s price crashed 70%. Undeterred, he established Binance aiming to become a top 10 exchange in three years — accomplishing it in only six months. This paved the way for him to become the wealthiest man in crypto.\n\nWhen asked about CZ’s net worth and how he felt about having so much money, the Binance CEO had the following to say: “I don’t think money is the most important factor. I don’t focus on that. I focus on building products that people will use — how to make that the most efficient, most impactful thing in the world.”\n\nIn a Twitter exchange under Nas Daily’s video, a viewer asked CZ if he ever sold when the market crashed by 70% in 2013. CZ responded with a simple “never sold”.\n\nIn recent news, it was revealed to the public that Binance committed to contributing $500 million to help fund Elon Musk’s takeover of Twitter. Binance is only one of 18 other companies that are funding the offer. The news has already seen a positive impact in projects like BakerySwap, Solis, gTrade etc in less than 2days.\n\nI hope to have a story close to CZ’s. Quite inspiring.",
            "stickied": false,
            "comments": [
                {
                    "id": "i7una80",
                    "author": "eunit250",
                    "score": 18,
                    "created_utc": 1652049041.0,
                    "response": "Hes the richest person in Canada by about 55 billion dollars.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7u4h52",
                    "author": "ThisIsARepostBotBot",
                    "score": 23,
                    "created_utc": 1652040698.0,
                    "response": "OP (Last-Ad1050) appears to be a karma farming repost bot, please downvote and report.\n\nThese accounts obtain karma by reposting memes in sub such as funny, meme, programmerhumor, etc. They use this karma to spam subreddits as well as participate in [pump and dump](https://en.wikipedia.org/wiki/Pump_and_dump) and [rug pull schemes](https://en.wikipedia.org/wiki/Exit_scam).\n\n ^-- ^This ^is ^a ^experimental ^semiautomatic ^system, ^which ^in ^rare ^cases ^may ^be ^inaccurate.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7uutnk",
                            "author": "mamabearx0x0",
                            "score": 10,
                            "created_utc": 1652052706.0,
                            "response": "Good bot!",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i7uvud1",
                            "author": "e_xTc",
                            "score": 7,
                            "created_utc": 1652053212.0,
                            "response": "Why can't a bot let another bot spam in peace. So much hate. I miss the days when bots lacked fre will 🤪",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7wbizo",
                    "author": "filthyburrows",
                    "score": 5,
                    "created_utc": 1652085381.0,
                    "response": "It's not humble beginnings. But Binance has made my life a lot smoother and more enjoyable. Huge shout to CZ. And thank you Binance for making crypto smoother, simpler and better for us.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7vj4in",
                    "author": "Holobolt",
                    "score": 13,
                    "created_utc": 1652064871.0,
                    "response": "Humble beginnings: sells his apartment worth 1 million USD",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7vxgeq",
                    "author": "NorbeeNorbee",
                    "score": 12,
                    "created_utc": 1652073671.0,
                    "response": "\"Money is not the important thing\"\n\n-Literally every single rich person in existence....",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7wj2zl",
                    "author": "RadicalRaid",
                    "score": 4,
                    "created_utc": 1652092134.0,
                    "response": "\"Humble\"",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7vbyk6",
                    "author": "Da0ptimist",
                    "score": 7,
                    "created_utc": 1652061242.0,
                    "response": "\"Humble\"\n\nYou don't lose $700k without having at least $700k to begin with.\n\nCZ is a known racist and snobby rich boy. Nothing inspiring about this fraudster.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7vsvv5",
                    "author": "korken12345",
                    "score": 3,
                    "created_utc": 1652070611.0,
                    "response": "A real scammer that guy",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ul7jkp",
            "title": "Binance Funds Elon Musk’s Twitter Takeover With “small” $500M Contribution",
            "url": "https://www.reddit.com/r/binance/comments/ul7jkp/binance_funds_elon_musks_twitter_takeover_with/",
            "author": "Cora_dn",
            "created_utc": 1652033427.0,
            "score": 33,
            "num_comments": 8,
            "subreddit": "binance",
            "selftext": "Elon Musk’s amended Schedule 13D to the Securities and Exchange Commission (SEC) revealed that Binance has committed to provide $500 million to Twitter. This confirms that Binance endorses Elon Musk’s takeover of Twitter. Binance is only one of the 18 equity investors funding Elon Musk’s $44 billion offer for Twitter.\n\nThe Twitter crypto community was ecstatic about the news with projects like Venus, Cake and Plastiks already looking positively affected by it. Prominent crypto accounts like Bitcoin Archive chimed in that it was only a “pocket change” for Binance. Meanwhile, the CEO of BlueOfficial called the contribution “Boss moves” as more of the community rejoiced. \n\nOut of the 18 equity investors, Binance had the fourth largest aggregate equity commitment – topped only by Dubai-based VyCapital ($700M), Sequoia Capital Fund ($800M), and Lawrence J. Ellison Revocable Trust ($1B), respectively. All of these commitments have provided an aggregate of approximately $7.139 billion.\n\nMusk requires an aggregate of $21 billion in financing commitments to fund the purchase.\n\nIn other news, Binance goes on with to be active in its business over the past two months. CZ tweeted a breakdown of Binance’s activities beginning from February 28, 2022, to May 4, 2022. The tweet includes Binance getting licenses from Bahrain and Dubai, registration from Sweden and France, and the Abu Dhabi in-principle approval.",
            "stickied": false,
            "comments": [
                {
                    "id": "i7u1io3",
                    "author": "RediLataj",
                    "score": 5,
                    "created_utc": 1652039385.0,
                    "response": "whats up with bots man. Make sure to report the account.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ueepyj",
            "title": "Binance partner with COTPS to give us good service We have changed lives through trading No risk only profits",
            "url": "https://i.redd.it/kcp615jgkew81.jpg",
            "author": "SoggyExchange5873",
            "created_utc": 1651209629.0,
            "score": 3,
            "num_comments": 9,
            "subreddit": "binance",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "ul1zfz",
            "title": "Shiba Inu The Most Held Token Amongst Top 100 Ethereum Whales",
            "url": "https://www.investing.com/news/cryptocurrency-news/shiba-inu-the-most-held-token-amongst-top-100-ethereum-whales-2819966",
            "author": "ActivePeak7",
            "created_utc": 1652017318.0,
            "score": 3,
            "num_comments": 3,
            "subreddit": "binance",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "ulpujt",
            "title": "My mood on Binance Today",
            "url": "https://i.redd.it/h1w2oyq8zfy81.jpg",
            "author": "rody143",
            "created_utc": 1652098447.0,
            "score": 132,
            "num_comments": 7,
            "subreddit": "binance",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "ulnnw0",
            "title": "CBDCs Are Now Being Considered By Every Country In The World?",
            "url": "https://news.coincu.com/87279-cbdcs-are-now-being-considered-every-country/",
            "author": "thuynguyen174",
            "created_utc": 1652090054.0,
            "score": 15,
            "num_comments": 7,
            "subreddit": "binance",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i7wlk9t",
                    "author": "Effin_Pikey",
                    "score": 4,
                    "created_utc": 1652094054.0,
                    "response": "Crypto started out of distrust to banks' monopoly, I highly doubt people will rally back to banks to buy their CBDCs.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ulpvnw",
            "title": "My Tommy looking for BTC bottom right now",
            "url": "https://i.redd.it/7bx0i8lkzfy81.jpg",
            "author": "rody143",
            "created_utc": 1652098537.0,
            "score": 6,
            "num_comments": 4,
            "subreddit": "binance",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uln78o",
            "title": "DAO DAO DAO 🙃😋🙃🙂😋🙂 What dao you want to know?",
            "url": "https://www.reddit.com/r/binance/comments/uln78o/dao_dao_dao_what_dao_you_want_to_know/",
            "author": "Leather_Care_997",
            "created_utc": 1652087946.0,
            "score": 3,
            "num_comments": 4,
            "subreddit": "binance",
            "selftext": "All Pros&Cons explained in this article. The website contains more information on DAOs if your interested in getting to know more about the industry :)\n\nhttps://olympusdaonow.com/red-flags-defi-dangers-daos-2022-explained-deepdao-crypto-project-comparison-site/",
            "stickied": false,
            "comments": []
        },
        {
            "id": "ulucbn",
            "title": "This is probably a dumb question but if vastly more people are buying, and the graph has looked like this for days, how is it possible that the value is dropping $500-1000 each day?",
            "url": "https://i.redd.it/858kr09j2hy81.jpg",
            "author": "squishfacedog",
            "created_utc": 1652111616.0,
            "score": 48,
            "num_comments": 45,
            "subreddit": "binance",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i7xo4yn",
                    "author": "kensei_ocelot",
                    "score": 38,
                    "created_utc": 1652112707.0,
                    "response": "that chart doesn't indicate how many orders are being bought or sold, it only tells you how many orders are on the books. Traders can still trade without putting their orders on the books, and traders can also put orders on the books without having to trade. Traders with large accounts will often use these tools to influence small traders towards a certain direction, usually a losing trade.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7xwprv",
                    "author": "KryptoSC",
                    "score": 15,
                    "created_utc": 1652116121.0,
                    "response": "The screenshot confirms that there is a lot of limit orders ready to support and buy Bitcoin in the 20k - 30k range. It's a whole different story if there's a backlog of market buy orders ready to execute on Bitcoin. I hope that clarifies the confusion.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7xlny3",
                    "author": "squishfacedog",
                    "score": 4,
                    "created_utc": 1652111717.0,
                    "response": "Sorry if this was the wrong place to post this. I'm trading bitcoin onky and am obviously quite new. from all of the videos I've watched and people I've gotten advice and tips from, it seemed that more buyers = driving the price up. I'm just wondering how it's possible for the value to keep going down so quickly when thousands of people are buying more of this currency than they ever have before.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7y8eka",
                            "author": "Simple_Resist4208",
                            "score": 6,
                            "created_utc": 1652120847.0,
                            "response": "It's rather like when people check eBay to see what the value is of Grandma's antique and they see a bunch of auctions with high \"Buy it Now\" prices and then think that's the value. But of course the true value is whatever someone is willing to actually pay for an item, not the ticket price someone wants to sell at.\n\nSo on those graphs you are seeing a bunch of Limit Orders where people are saying they'd like to buy at a much lower price. But that doesn't mean it will hit that price and their order will complete ... they might pull the order and set the price even lower, just on the off-chance they get lucky.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i7xodnf",
                            "author": "Cryptotracker1442",
                            "score": 17,
                            "created_utc": 1652112803.0,
                            "response": "It's pure market manipulation. Think about it this way. If Elon musk were to make a positive tweet about Bitcoin right now. The entire market would U-turn immediately. We'd see 100k Bitcoin in a week if that happened. This alone tells you that the entire markets performance is based on narrative. The narrative they're trying to push right now is interest hikes/inflation and the war with Russia. In reality this is all bullshit scapegoat propaganda to try to cover their market manipulation. The top whales aren't selling and you can look this up. So I have no idea why the average Joe would be selling.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7xqs0y",
                    "author": "Mangas1991",
                    "score": 4,
                    "created_utc": 1652113750.0,
                    "response": "the thing is not how many people are buying, but who is buying. Somebody who's holding millions can change the chart in a matter of seconds.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7xu6f6",
                    "author": "amelin_Emily",
                    "score": 6,
                    "created_utc": 1652115110.0,
                    "response": "All cryptocurrencies and the entire stock market are falling. It's starting to look like a recession.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7xp6f5",
                    "author": "TheGiftnTheCurse",
                    "score": 3,
                    "created_utc": 1652113120.0,
                    "response": "Because price discovery is no longer determined by Supply and Demand, obviously. Same as the stock market.\n\nAlso providing liquidity is a thing, some rule about every buyer must have a seller or some bs, so the MM will just internailze that order, instead of putting it on the free market. \n\nBut luckily web3 and DeFi will change that. NFTs will also change that, no more selling synthetics and no more internalization.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ult26y",
            "title": "Valkyrie's Bitcoin futures ETF is approved by the SEC",
            "url": "https://valkyriecryptofunds.com/ETF",
            "author": "bmowaq",
            "created_utc": 1652108110.0,
            "score": 33,
            "num_comments": 7,
            "subreddit": "binance",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "ul7yrh",
            "title": "Binance Faces Pain In Spain, Despite French Regulatory Victory",
            "url": "https://www.reddit.com/r/binance/comments/ul7yrh/binance_faces_pain_in_spain_despite_french/",
            "author": "peterhoegir",
            "created_utc": 1652034644.0,
            "score": 12,
            "num_comments": 8,
            "subreddit": "binance",
            "selftext": "Binance's expansion into Europe looks to have hit new roadblocks, with Spanish market officials renewing their pressure.  Binance is the largest cryptocurrency market in the world and the trading place of a lot of cryptos including NFT utility tokens like Decentraland, Quint, Sandbox and so on.\n\nAccording to local media reports, Binance has been requested by Spain's market regulator, the National Securities Market Commission (CNMV), to shut down its crypto derivatives service in the nation. \n\nDespite the fact that the world's largest crypto exchange recently received full regulatory permission in France, the action comes as a surprise. The exchange now plans to use France as a springboard for a continental conquest.\n\nHowever, this expansion coincides with the European Union's increasing regulatory scrutiny of cryptocurrency. The bloc just approved new legislation that effectively bans decentralized wallets and puts tight reporting requirements on all cryptocurrency transactions.\n\nThe CNMV has urged Binance to reduce its derivatives sales, according to Spanish news outlet La Informacion. While the move has no significant financial implications for the exchange, it demonstrates Spanish officials' reluctance to open their doors to the exchange. \n\nThe exchange appears to have removed all derivatives-related content from its Spanish website. However, it allows those with continuous contracts to keep their jobs. \n\nThe CNMV's antipathy to crypto derivatives stems from the huge possibility for investors to lose money in the market. In 2021, it expressed concern over this. \n\nBinance falls under a murky area of financial legislation in Spain. The exchange has yet to receive a formal virtual currency license from Spain's central bank, despite applying for one in early 2021.\n\nOther exchanges such as local Bit2Me have already secured regulatory approval. But this approval also means that exchanges will have to comply with strict reporting and anti-money laundering laws.\n\nAccording to reports, the crypto exchange mostly followed regulatory guidelines in order to gain license from the central bank. However, this strategy isn't unique to Spain. \n\nTo appease financial regulators, the exchange has often claimed its adherence to local regulations. It's also one of the first exchanges to abide by tough economic restrictions imposed on Russia as a result of its invasion of Ukraine. \n\nDespite this, Binance's regulatory journey has not always been easy. Due to increased scrutiny from the financial watchdog, the exchange had to shut down operations in Canada's most populated province.",
            "stickied": false,
            "comments": []
        },
        {
            "id": "ul8ts8",
            "title": "If you want to send a transaction, which one will you choose?",
            "url": "https://www.reddit.com/r/binance/comments/ul8ts8/if_you_want_to_send_a_transaction_which_one_will/",
            "author": "AdOld8536",
            "created_utc": 1652037078.0,
            "score": 3,
            "num_comments": 8,
            "subreddit": "binance",
            "selftext": " 🗳\n\n[View Poll](https://www.reddit.com/poll/ul8ts8)",
            "stickied": false,
            "comments": [
                {
                    "id": "i7voajj",
                    "author": "Top_Brilliant1739",
                    "score": 3,
                    "created_utc": 1652067786.0,
                    "response": "Stellar (XLM)",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}