{
    "subreddit": "Binance",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uyaoqv",
            "title": "Trade Scare",
            "url": "https://www.reddit.com/r/binance/comments/uyaoqv/trade_scare/",
            "author": "Conscious-Strike-290",
            "created_utc": 1653580323.0,
            "score": 1,
            "num_comments": 4,
            "subreddit": "binance",
            "selftext": "A consistent buyer/customer ordered 41k usdt from me using cash deposit as the payment method. While I was waiting for buyer to make the deposit, I accidentally released the asset to the buyer even if I hadn’t received the payment yet. I immediately tried to contact the buyer but the buyer already blocked me. We also had past transactions on a different messaging platform and I was also blocked there. I was really scared that I won’t be able to retrieve my money anymore. I reached out to Merlina and Binance customer service (Alice) and they were able to freeze the buyer’s account as soon as they confirmed I was telling the truth. Luckily, the buyer hadn’t withdrawn the asset out of binance yet and he ended up replying to be when he realized that his account was frozen. I was able to get him to complete the payment. I would really like to thank the Binance team for the fast response",
            "stickied": false,
            "comments": [
                {
                    "id": "ia32hya",
                    "author": "Delicious-Clue7997",
                    "score": 1,
                    "created_utc": 1653583570.0,
                    "response": "I knew Binance was the best out there. The 2nd is miles away !",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia4049t",
                    "author": "LAXZzz",
                    "score": 1,
                    "created_utc": 1653597300.0,
                    "response": "Welp good for you iguess but why couldn't he buy the usdt on his own and why would Binance just take your word for it and freeze the account of someone you send funds to on your own accord ?   \nThis stinks",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}