{
    "subreddit": "Binance",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uwyfv0",
            "title": "Binance is a joke !",
            "url": "https://www.reddit.com/r/binance/comments/uwyfv0/binance_is_a_joke/",
            "author": "Zakharoz",
            "created_utc": 1653419337.0,
            "score": 0,
            "num_comments": 11,
            "subreddit": "binance",
            "selftext": "Recently found out that binance will share and provide our data to third party entities such as governments without even letting the user know if the local regulators ask ! And They won’t give you any options to delete your data or your account so basically we don’t have the right to delete our account and data ! Your data basically stays with them forever even if you disable the account!! So my questions is does this mean a binance account that has no longer funds but has had a history of assets and transactions be taxed even years after when the regulators have got the data from binance !? Can they be sued for such thing!? \nBasically if you have opened an account with binance you’re at risk of being exposed and taxed at any time in the future as they keep our data ! Am I getting something wrong here !? I hope I am coz this is ridiculous!!",
            "stickied": false,
            "comments": [
                {
                    "id": "i9uea51",
                    "author": "Rockstonerable",
                    "score": 2,
                    "created_utc": 1653420540.0,
                    "response": "Binance is centralizes and regulated platform as same as your bank. That is normal. That is how binance is able to be live in so many countries. Without those regulations binance would be ilegal in many countries",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9usv5x",
                            "author": "Darth_Laidher",
                            "score": 1,
                            "created_utc": 1653426705.0,
                            "response": "This. But they aint regulated in how they behave with their customer bade.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9ugo0s",
                            "author": "Lucky_Letter_2730",
                            "score": 0,
                            "created_utc": 1653421545.0,
                            "response": "but binance should provide those reports after been asked from the authorities and not without asking !",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}