{
    "subreddit": "Binance",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ux1030",
            "title": "Binance CEO Shares His Thoughts On LUNA And UST Collapse: Is He Really Poor Again As He Claims?",
            "url": "https://www.reddit.com/r/binance/comments/ux1030/binance_ceo_shares_his_thoughts_on_luna_and_ust/",
            "author": "Bowserdku",
            "created_utc": 1653426157.0,
            "score": 1,
            "num_comments": 0,
            "subreddit": "binance",
            "selftext": "The CEO of Binance, Changpeng Zhao, recently expressed his thoughts on the LUNA and UST collapse. According to Zhao, the collapse of Terra’s native tokens could have been avoided if the Luna Foundation Guard (LFG) used its Bitcoin reserves earlier.  \n\nZhao stated that “the Terra team was slow in using their reserves to restore the peg during the crash that affected even the most promising metaverse tokens like Mana, Solis, Ape, Sand, etc. He continued by saying that the entire incident may have been avoided if they used their reserves when the de-peg was at 5%. After the value of the coins had already crashed by 99% (or $80 billion), they tried to use $3 billion to do the rescue. Of course, this didn’t work.”  \n\nAccording to Changpeng Zhao, things really started taking a turn for the worst when more LUNA was minted in a gamble to salvage the situation. Zhao pointed out that “printing money does not generate value; it just dilutes existing holders. Exponentially minting LUNA made the problem a lot worse.” \n\n The Terra crash led many to ponder whether there was something sinister occurring behind the closed doors of the network founders. Do Kwon, the CEO of Terraform Labs, could even be facing Ponzi fraud charges. \n\nThere are even claims that Terraform Labs was dissolved on April 30,  mere days before the Terra tokens collapsed. But then don't you hope it gets back because some of us still have our money lost there?",
            "stickied": false,
            "comments": []
        }
    ]
}