{
    "subreddit": "Binance",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ux83fr",
            "title": "Using zelle to buy usdt p2p?",
            "url": "https://www.reddit.com/r/binance/comments/ux83fr/using_zelle_to_buy_usdt_p2p/",
            "author": "Scholes_SC2",
            "created_utc": 1653448396.0,
            "score": 1,
            "num_comments": 0,
            "subreddit": "binance",
            "selftext": "I understand I could get scam and that there are no chargebacks but what I'm more worried about is that if a zelle account I sent money to gets banned/blacklisted that could affect my own account.\n\nHas this happened to any of you guys?",
            "stickied": false,
            "comments": []
        },
        {
            "id": "ux8738",
            "title": "How does Binance staking program benefit Binance?",
            "url": "https://www.reddit.com/r/binance/comments/ux8738/how_does_binance_staking_program_benefit_binance/",
            "author": "Massive_Machine577",
            "created_utc": 1653448752.0,
            "score": 6,
            "num_comments": 25,
            "subreddit": "binance",
            "selftext": "I wonder how Binance utilize the liquidity provided by staking.\n\n In the case of AXIE, the APR is 80% when Staking in Axie Infinity, but 120% when Staking in Binance.  \nHow does Binance utilize Staked Liquidity to provide a higher APR?",
            "stickied": false,
            "comments": [
                {
                    "id": "i9wd2rj",
                    "author": "BinanceCSHelp",
                    "score": 3,
                    "created_utc": 1653453750.0,
                    "response": "Dear user, we thank you for your support of Binance. You may think of staking as a less resource-intensive alternative to mining. It involves holding funds in a cryptocurrency wallet to support the security and operations of a blockchain network. Simply put, staking is the act of locking cryptocurrencies to receive rewards.\n\nThe APY is a projection based on the rewards we have historically received (“Staking Rewards Rate”) from the applicable asset protocol. This rate is set by the applicable blockchain protocol, and is neither controlled, influenced, nor determined by Binance Staking and will change (and thus, the APY will change dynamically). Each blockchain sets its underlying rewards rate depending on various factors. The APY may be adjusted to account for funds we hold back from staking as part of our liquidity reserve, if applicable. The 80% or 120% you see it an estimated APY, but may also be lower than that because the APY will be adjusted accordingly.\n\nIf you would like to learn more information about staking and Binance earn, kindly refer to the below link [https://academy.binance.com/en/articles/what-is-staking](https://academy.binance.com/en/articles/what-is-staking) \n\n[https://www.binance.com/en/support/faq/650826666c344c15a062932983a38c2e](https://www.binance.com/en/support/faq/650826666c344c15a062932983a38c2e)\n\nhttps://academy.binance.com/en/articles/your-guide-to-binance-earn\n\nPlease contact our live support via https://www.binance.com/en/chat if you have any questions  or inquiries, we are more than happy to assist you. Kind Regards.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9wfzc0",
                    "author": "vagelen",
                    "score": 2,
                    "created_utc": 1653455611.0,
                    "response": "i recently discovered that you can access farms of Binance through metamask without login in Binance or their DEX or Binance wallet or anything related to Binance. There must be an industry working behind the scenes.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9w9kbd",
                    "author": "BodomDeth",
                    "score": 1,
                    "created_utc": 1653451667.0,
                    "response": "Anything with APR higher than 5-6% should be looked at as ponzi scheme at best",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9wtutb",
                            "author": "final_lionel",
                            "score": 1,
                            "created_utc": 1653466484.0,
                            "response": "Polkadot has 12% 😱",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9xi2iy",
                            "author": "Economy_Ebb_4965",
                            "score": 1,
                            "created_utc": 1653483765.0,
                            "response": "Apr doesnt include inflation. Example:\n\nPolkadot gives around 12% apr but the inflation is 8%. So only a net of 4% apr.\n\nOr Cake gives up to 100%. Inflation is 30%.so nett 70%.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia5uxqq",
                                    "author": "tsurutatdk",
                                    "score": 1,
                                    "created_utc": 1653631147.0,
                                    "response": "I have my CAKE minted on Teneo Finance platform and i'm earning decent apys. I can hold the tenCAKE and also provide liquidity to get more rewards. Their auto-compounding is really smooth and i'm liking it!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "ia10e23",
                            "author": "tbilcoder",
                            "score": 1,
                            "created_utc": 1653539031.0,
                            "response": "The bank which I use offers accumulating deposit in local currency for 11%. Yeah, for USD they offer 1.5%, but anyway, you seems to be too pessimistic.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9wu88g",
                    "author": "ah__there_is_another",
                    "score": 1,
                    "created_utc": 1653466818.0,
                    "response": "It provides security and liquidity I believe",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia8vw6l",
                    "author": "BitcoinLover12312",
                    "score": 1,
                    "created_utc": 1653689768.0,
                    "response": "https://partner.bitget.com/bg/bullrabbitinvesting$3000 sign up bonus and 15% off of ALL trading fee's using this link! 125x leverage, 70+ coins to choose from, no KYC or VPN needed!",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}