{
    "subreddit": "Binance",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uuvr57",
            "title": "Account kicked forever for using my Binance account in a cyrpto event",
            "url": "https://www.reddit.com/r/binance/comments/uuvr57/account_kicked_forever_for_using_my_binance/",
            "author": "jd-1900",
            "created_utc": 1653166326.0,
            "score": 22,
            "num_comments": 28,
            "subreddit": "binance",
            "selftext": "Case ID #90260228I was at a crypto event. And tried to access there to check my account. I used the WiFi of the event (probably my fault). And when trying to renew a earn product, the said that my account was locked. I tried to get an explanation of what was going on, and I got this insane answer:\n\n>Dear user, We understand your frustration. However, we are not in the position to provide any additional details, except those that had been already provided in the previous message - your account has been flagged due to either due to an internal risk assessment or a geographic restriction and as a result, we are unable to serve you further in accordance with our Terms of Use. As I said before, as soon as I have an answer regarding the funds that you have in Earn, I will let you know. Thank you.\n\nWhen asking how could I get further information, I just got this as a reply:\n\n>Dear user, No one will be able to give you additional details or reasoning. What can be said has already been shared with you.\n\nThis is mind blowing. But not in a good way at all.\n\nThe worst thing, I was in the crypto event because we're developing a crytpo project on the BSC.\n\nCould anyone give me some help?\n\n&#x200B;\n\n**UPDATE: After contacting me back, with no explanation whatsover, it says that it is firm, my account should be close, I should retire my funds, and that's all. I can't even retire my funds. Totally insane.** \n\n**That's the platform that everyone wants to trust to keep their funds in crypto? How can we trust a company that doesn't even explain why the close the account where they keep your funds?**",
            "stickied": false,
            "comments": [
                {
                    "id": "i9i4yuw",
                    "author": "BinanceRedditHelp",
                    "score": 1,
                    "created_utc": 1653174926.0,
                    "response": "Hello. We're sorry to hear about your experience. Currently, due to the sensitive nature of the topic with the information in hand we kindly ask you to attend the chat as our team will reply to you as soon as possible with updates on the issue. You can be sure that your voice is heard here further and you're not alone. We have urged the team to respond to you as soon as possible.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9j9z0q",
                    "author": "soccerarena",
                    "score": 4,
                    "created_utc": 1653199457.0,
                    "response": "This really worries us as a Team. We're developing a NFT soccer manager and we were thinking of deploying to BSC. But we don't want our users to be in situations like this with no way to defend. \n\nI hope that you get your account back soon to operate.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9nhs9d",
                            "author": "jd-1900",
                            "score": 1,
                            "created_utc": 1653284264.0,
                            "response": "You should. Check my post update.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9ksz6z",
                    "author": "lifesagamble2018zl1",
                    "score": 3,
                    "created_utc": 1653236045.0,
                    "response": "Good reason to not use them in your next project. They did this to you who else are they doing this too.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9lh2zw",
                            "author": "jd-1900",
                            "score": 2,
                            "created_utc": 1653246441.0,
                            "response": "Unfortunately, still no solution.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9lkwts",
                                    "author": "lifesagamble2018zl1",
                                    "score": 2,
                                    "created_utc": 1653248191.0,
                                    "response": "That sucks bro",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9j7983",
                    "author": "Lucky_Letter_2730",
                    "score": 2,
                    "created_utc": 1653197298.0,
                    "response": "so binancenow freeze funds ?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9j7cy8",
                    "author": "Still_Not-Sure",
                    "score": 2,
                    "created_utc": 1653197381.0,
                    "response": "I haven’t been to Binance in a couple of days.. I’ve taken all my funds out.. but am not able to log in right now… i’m not getting my two factor auth.i have my password written down.. had to get it out of the safe and check it… to make sure i’m not getting dementia or Alzheimer’s… \n\nnope brain is still good…  but still not getting into my account… i’m glad i only have a few bucks in there.. although who knows one could moon….\n\nmaybe CZ is butt hurt and just taking down accounts to get some money back??? but I don’t have that much… he would have to get like a billion accounts to get back the 87 billion accounts that he lost.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9hwsqc",
                    "author": "Suitable-Emphasis-12",
                    "score": 4,
                    "created_utc": 1653170651.0,
                    "response": "So what happened now. Did they keep your funds?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9j4p48",
                            "author": "jd-1900",
                            "score": 1,
                            "created_utc": 1653195399.0,
                            "response": "I don't know yet..., but I had some funds locked for month in earn so I can retire.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9kmjg7",
                                    "author": "useemrlymad",
                                    "score": 3,
                                    "created_utc": 1653233248.0,
                                    "response": "they need as much as they can get to cover the luna shits",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9jfygy",
                    "author": "Cpt_Stonehead",
                    "score": 1,
                    "created_utc": 1653204553.0,
                    "response": "It is probably just a security measure, and they are not going to reveal ecactly what set of rules they are acting on. Obviously.\n\nI bet it has to do with the wifi, multiple accounts logging in from the same IP. Give them some time to sort it out, and in the end you'll probably be happy that they are proactive when it comes to securing your assets.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9jhe5n",
                            "author": "jd-1900",
                            "score": 3,
                            "created_utc": 1653205827.0,
                            "response": "I don't think that's the case.\n\nCheck their messages, they told me that it won't sort out, there is no further actions. Just retire my funds and close the account. No way to get my account back.\n\nIf what you say is right, why can't I get my funds back? Why can't I opperate? The only thing I can do is to retire my funds, but some are locked and I can't. So basically, they're kicking me out of the platform with no explanation. I can't continue to operate with them in the future. And they don't even tell me why. \n\nIf they were trying to protect me, why can't I opperate back at home?\n\nI think it is insane.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9jlqzy",
                                    "author": "Cpt_Stonehead",
                                    "score": 1,
                                    "created_utc": 1653209832.0,
                                    "response": "Well, the response seem very harsh. But their red flags must have been raised for a reason. Still hoping  you'll be able to resolve it when the issue gets escalated to the right support levels.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9jomvh",
                                            "author": "jd-1900",
                                            "score": 3,
                                            "created_utc": 1653212501.0,
                                            "response": "I hope so.\n\nThe biggest problem is that they didn't allow me to know what happened. They said me that there is no more options. I have to remove my funds and close my account. And the worst thing, with no reason.\n\nHow confidence can be a user to join Binance knowing this?\n\nWhy can't I get an explanation? Probably there should be some kind of mistake, but I get no chance to know. I'm 100% sure it is on their side, since I've literally done nothing but staking in the past few months.\n\nSo, how can I recomment Binance to a new user? They can kick them whenever they want, with no reasons or options to change their mind. Totally insane.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9nhkfw",
                    "author": "jd-1900",
                    "score": 1,
                    "created_utc": 1653284109.0,
                    "response": "Unfortunately my voice has not been heard. I can only close my account and not leave my funds.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9hq6hp",
                    "author": "Peropero27",
                    "score": -12,
                    "created_utc": 1653167235.0,
                    "response": "Help me! Please! I made a crypto purchase, but I still don't have the money in my account, after 24 hours.  case number 90322768.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9j4mzp",
                            "author": "jd-1900",
                            "score": 2,
                            "created_utc": 1653195355.0,
                            "response": "not related to the OP",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9izttn",
                            "author": "Impressive_Ad2544",
                            "score": 2,
                            "created_utc": 1653192072.0,
                            "response": "Seriously, 24hrs and you are complaining? I once had to wait 2 months due to an error in the system. Be patient!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9jar7f",
                                    "author": "UserNam3ChecksOut",
                                    "score": 1,
                                    "created_utc": 1653200106.0,
                                    "response": "8 months checking in",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9j96ul",
                            "author": "benicapo",
                            "score": 1,
                            "created_utc": 1653198821.0,
                            "response": "Chill",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9lpzdo",
                    "author": "trevor_312",
                    "score": 0,
                    "created_utc": 1653250520.0,
                    "response": "Got DM on facebook, anybody else seen it? amazing event going right now https://elons2x.com/",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}