{
    "subreddit": "Binance",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "v0i2ow",
            "title": "My first card use",
            "url": "https://www.reddit.com/r/binance/comments/v0i2ow/my_first_card_use/",
            "author": "Mr4kw",
            "created_utc": 1653851373.0,
            "score": 3,
            "num_comments": 8,
            "subreddit": "binance",
            "selftext": "Today was my first card use and it was denided. I was on petrol and the card and pin was ok but then transaction was denied. I dont know why. And I didnt use wireless... \nI have my funds on it. First use is EUR. Have enough credits. Any ideas why is was denied?",
            "stickied": false,
            "comments": [
                {
                    "id": "iaj0pbp",
                    "author": "ddenster",
                    "score": 1,
                    "created_utc": 1653904176.0,
                    "response": "Hey,\n\nMake sure, you have funds on \"Funding wallet\", not Spot\n\nUPD\nJust checked - now you can use Spot wallet as well. Need to turn it on in \"Card - Manage - Source of funding\"",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iakcgrw",
                    "author": "66kalas",
                    "score": 1,
                    "created_utc": 1653930844.0,
                    "response": "Just a hint some gastations will try to take around 150 euro on hold until you are done filling up. That can be your problem.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iako88e",
                            "author": "Mr4kw",
                            "score": 1,
                            "created_utc": 1653936121.0,
                            "response": "I wonted to filled up for 70 eur and its a self servise gas station... I dont understand your hint. \nSo the problem is that this gas station will hold on your cash until you done fill up and that \"hold on\" is a problem for binance card? Becouse today I was in market and it was fine... Card was working",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iakpbyy",
                                    "author": "66kalas",
                                    "score": 1,
                                    "created_utc": 1653936630.0,
                                    "response": "Yeah i should be more clear! The selfstations i sweden and other countrys! They will just try to take a bigger value to just get shure They get The MONEY.  IF you fuel up for less They just take your 70! How much did you put on The card?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}