{
    "subreddit": "Binance",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uzqi2i",
            "title": "This sub needs to learn some basic economics",
            "url": "https://www.reddit.com/r/binance/comments/uzqi2i/this_sub_needs_to_learn_some_basic_economics/",
            "author": "indonesian_activist",
            "created_utc": 1653754300.0,
            "score": 0,
            "num_comments": 8,
            "subreddit": "binance",
            "selftext": "Money or a country's currency, is just the abstraction of the total goods and services produced by that country. A central bank (the FED in the US) mandate is to match the money supply against the total economic output of a country. When you increase the money supply without a corresponding increase in economic output, it leads to inflation. Conversely, when you decrease the money supply without a decrease in economic output, it leads to deflation. Central banks tend to favor targeted inflation, meaning inflation below a certain rate instead of deflation as deflation will encourage hoarding money and discourage new investment in businesses which over the long term will reduce economic growth. \n\nAssume in this example, for simplicity sake, the US produces one thing and one thing only, IPhones. If that's the case, it means the total USD in circulation represents the amount of IPhones produced. If you were to institute a monetary policy that requires literally \"burning or destroying\" an IPhone to mint new USD, \n\nBesides sounding bat-shit crazy, this would increase the amount of USD in circulation while simultaneously inducing artificial scarcity by reducing the goods produced thus creating an imbalance between the money supply and the economic output. The above policy doesn't make sense and would NEVER work, ever. So please when you see another coin trying to do the same thing again, run away. \n\nOn the other hand, some newer coins or tokens are not meant to be used as currency per se but rather represent ownership in a project, similar to shares in a company. When a new crypto project launches its tokens which provides a share of the revenue and governing rights, it is a kin to a company doing an IPO. Yet, have you ever heard of a company doing an IPO with the requirement that if you buy the share you'll also need to lock it for X weeks or else get diluted by 50% ? I doubt anyone would buy a stock with those terms nevertheless it's exactly what crypto investors are doing when they \n\n***\"Stake token A for 100% APY\"*** \n\nIt's amazing what a difference in phrase can do for perception, isn't it? \n\nAfter reading the preceding two instances, you're now undoubtedly aware that the majority of cryptoeconomic models are either ponzinomics or an elaborate long con. So the question is how do you generate sustainable yield in crypto ? The answer of course is obvious, you need to tie it to a real world economic output. Looking around the internet we see that there's one primary driver of traffic growth today, and that of course is TikTok. And we also know that the metaverse despite the hype is total bullshit, why would anyone want to spend real money in a blocky 3D world with 90s graphics ? The multiverse however, based on the docuseries of Dr Stephen Strange, is an actual real thing. \n\nThat is why I've created a yield aggregator that combines those two factors above, [happyhippo.farm](https://happyhippo.farm). My yield optimizer generates yield for you not by using scammy ponzinomics but instead we use tiktok dancing girls in an elaborate ritual to appease the Chaos God Slaneesh. The ritual grants us Slaneesh favor that enables our anime hippo Avatar, Thamus to cross the multiverse and kill the other you in other multiverses. The law of the multiverse states when another you is killed their crypto wallet balance is automatically transferred to the surviving others. As there are an infinite number of multiverses this yield generating mechanism can continue indefinitely which is why are able to offer BTCB-BUSD LP vault at 12% APY until a ZK class reality ending scenario occurs.\n\nIn summary, using Tiktok and multiverses are the only real and sustainable way to earn yields in crypto. The sooner you realize this fact the less susceptible you become to crypto scams and the sooner you can begin your journey to financial independence.",
            "stickied": false,
            "comments": [
                {
                    "id": "iabxhdv",
                    "author": "useemrlymad",
                    "score": 3,
                    "created_utc": 1653757192.0,
                    "response": "*In summary, using Tiktok and multiverses are the only real and sustainable way to earn yields in crypto. The sooner you realize this fact the less susceptible you become to crypto scams and the sooner you can begin your journey to financial independence*\n\n&#x200B;\n\ni will never stop laughing about this.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}