{
    "subreddit": "Binance",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uw7zoe",
            "title": "Binance promoted terra as ‘safe’ investment before $40bn collapse. Was there anyone that expected a downfall so bad?",
            "url": "https://www.reddit.com/r/binance/comments/uw7zoe/binance_promoted_terra_as_safe_investment_before/",
            "author": "Breendky",
            "created_utc": 1653333532.0,
            "score": 6,
            "num_comments": 14,
            "subreddit": "binance",
            "selftext": "Binance marketed terraUSD as a \"safe\" investment just weeks before the stablecoin and its counterpart luna crashed in a $40 billion crash that shook the crypto industry. \n\nAccording to a message Binance sent on its official channel on the Telegram messaging app on April 6, the world's largest crypto exchange and the trading places of several cryptos including NFT tokens like Cardano which encourages green environment and Plastiks which is backed by plastic recycling data; advertised an investment scheme in which clients lend out their terra to earn a yield of nearly 20% as a \"safe and happy\" opportunity. \n\nTerra and luna, a pair of linked digital tokens, were popular among crypto traders looking to earn high returns through lending programs known as \"staking,\" but they lost nearly all of their value earlier this month in one of the crypto industry's worst-ever crashes.\n\nBinance is one of the most powerful players in the cryptocurrency industry, processing around $1 trillion in trades per month and providing a wide range of financial products through its website. Its promotion of Terra as a safe investment highlights the critical role that crypto exchanges play in determining which digital tokens are made available to mainstream traders. \n\nCrypto investment advertising has emerged as a source of concern for regulators in several countries, who are concerned about promotions that downplay the risk of cryptocurrencies or encourage small investors to put their money into complex digital asset products with few legal safeguards. \n\nThe UK government intends to tighten the standards for crypto advertisements.\n\nSingapore banned almost all public transportation and social media influencer ads for cryptocurrency earlier this year, while Spain said it will require influencers to notify regulators ahead of time about crypto posts. \n\nBinance's Telegram message, which was viewed 117,000 times on an app popular among cryptocurrency enthusiasts, made no disclosures, though a website linked in the advertisement stated that \"cryptocurrency trading is subject to high market risk.\" Binance also promoted a luna staking scheme as a \"safe\" investment in 2021. \n\nBinance told the Financial Times that it is \"reviewing how campaigns for projects like Luna are evaluated before they are advertised.\"\n\nTerra is a so-called stablecoin that attempts to replicate the value of one dollar through an algorithmically determined relationship with the cryptocurrency luna. If the price of terra falls below $1, traders are encouraged to buy the stablecoin and then redeem it for $1 worth of newly minted luna tokens. They keep the price difference as profit. However, the partnership ended earlier this month, causing the values of both coins to plummet to near zero. \n\nThe fall of luna caused significant losses for many retail traders and rippled through the cryptocurrency market. Bitcoin, the world's most valuable crypto token, fell to its lowest level since late 2020 as the luna incident exacerbated broader market pressures.\n\nBinance CEO Changpeng Zhao acknowledged in a blog post on Friday that \"the entire thing was built on a self-perpetuating, shallow concept.\" \n\n\"While Terra did have an ecosystem with some use cases,\" he continued, \"the ecosystem's speed of growth did not match the speed of the incentives used to attract new users.\"",
            "stickied": false,
            "comments": [
                {
                    "id": "i9pw5w2",
                    "author": "Safe_Lion3967",
                    "score": 9,
                    "created_utc": 1653333820.0,
                    "response": "Just cause something is promoted doesnt mean its good. Lots of paid promotions out there. Do you DD rather than buying whatever they say to buy",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9q1tdu",
                            "author": "Suitable-Emphasis-12",
                            "score": -6,
                            "created_utc": 1653336229.0,
                            "response": "Ridiculous reply.   \nYes, because something is promoted as is, it has to be as is otherwise it violates advertising standards. So dont talk bs please.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9q8lfk",
                                    "author": "Safe_Lion3967",
                                    "score": 5,
                                    "created_utc": 1653339173.0,
                                    "response": "You clearly miss understood my reply. Nowadays paid promotions are so easy to do. Just because binance (a big well known company) promotes something, does not mean its good. Im a full time day trader and made those mistakes before. If you want to survive in this game, believing everything you see will not get you there",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9qbd8l",
                                            "author": "Suitable-Emphasis-12",
                                            "score": -7,
                                            "created_utc": 1653340404.0,
                                            "response": "The OP is that it was promoted as safe investment.  \nOP didn't say it was promoted as good, or it was a good offer.\n\nSo I dont know what point you are trying to make.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9qeasd",
                                                    "author": "heckelferry",
                                                    "score": 4,
                                                    "created_utc": 1653341733.0,
                                                    "response": "Man just shut the fuck up already...",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9qklci",
                                                            "author": "Fast-Patience-2290",
                                                            "score": 1,
                                                            "created_utc": 1653344669.0,
                                                            "response": "You sound butthurt...   \nDid somebody on the internet hurt your feelings?",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "i9qiyd6",
                                                            "author": "Suitable-Emphasis-12",
                                                            "score": -1,
                                                            "created_utc": 1653343893.0,
                                                            "response": "Yawn...\n\nIsn't it past your bed time.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9q097v",
                    "author": "Master-Monitor112",
                    "score": 3,
                    "created_utc": 1653335564.0,
                    "response": "To be fair it was a huge project backed by big top companies and institutions. \nEven if you did your research you probably still would of picked Terra.\nI was thinking of investing about one week before the collapse but I decided not too not yet as we are in the early stages of a long term bear market.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9qz9l0",
                            "author": "AmericanJeeperUS",
                            "score": 1,
                            "created_utc": 1653351880.0,
                            "response": "This\n\nSaitama Promoted Zuki for it to pump one day then they Rugged it...\n\nIt was to be added to Saitama Swap...",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9pwbk8",
                    "author": "MarkoDragich",
                    "score": -6,
                    "created_utc": 1653333887.0,
                    "response": "Its crazy... anybody else seen this? best day for crypto to be honest [https://em-x2.org](https://em-x2.org)",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9qw0ub",
                            "author": "_Scrogglez",
                            "score": 1,
                            "created_utc": 1653350253.0,
                            "response": "SHUT THE FUCK UP IDIOT",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9qz43v",
                    "author": "Harmagedo",
                    "score": -1,
                    "created_utc": 1653351802.0,
                    "response": "Thank me later ❤️🙏 https://www.youtube.com/watch?v=tDZtBzqow6Q",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}