{
    "subreddit": "Binance",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "pusz7e",
            "title": "Binance verification code text",
            "url": "https://www.reddit.com/r/binance/comments/pusz7e/binance_verification_code_text/",
            "author": "michaeljones161",
            "created_utc": 1632518887.0,
            "score": 3,
            "num_comments": 7,
            "subreddit": "binance",
            "selftext": "Today I received a text which said:\n\n\\[Binance\\]Verification code - then a six digit number - Do not share this code with anyone\n\nI have never registered with Binance - I didn't even know what it is until I googled it today.\n\nIs someone using my details to set up a Binance account? If so. what do I do about it?\n\nHow do I contact Binance to let them know? I couldn't see any contact links on the Binance website.",
            "stickied": false,
            "comments": [
                {
                    "id": "he5zh9f",
                    "author": "KitchenItem",
                    "score": 2,
                    "created_utc": 1632533156.0,
                    "response": "if it was a first code you received they would need to input this on Binance to make your phone number active for this account so maybe someone just misspelled their phone number and you got sent a text, I wouldn't worry about it",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hec7itl",
                            "author": "michaeljones161",
                            "score": 1,
                            "created_utc": 1632659227.0,
                            "response": "Hi - thanks for your reply. I'm am somewhat reassured that my money is safe and I don't have a Binance account. I did have a few more texts about Amazon, Paypal and B&Q (?) at the same time, so someone is definitely using my details for something. I even got messages from Muslim Aid saying  had set up a direct debit of £900 a month - but I think that was spam because it wanted me to open a PDF file. I didn't, of course. I've changed passwords and login details on all relevant accounts, and my bank account, just in case. I've contacted B&Q and Muslim Aid but had no replies.  \nI chatted online at length to a reddit moderator here and asked to cancel any Binance account (if there was one). they said they sent me a verification code by email, but no email arrived and I had to go out, so I quit the conversation. I've not received any other suspicious texts/messages since so I think I'll leave it like that..  \nBut again, thanks for your reply.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hn42x1k",
                    "author": "AlwaysConfusedNoEnd",
                    "score": 1,
                    "created_utc": 1638564185.0,
                    "response": "what ended up happening with this? i just got the same exact thing twice, but i don't even have a binance account. i do hold crypto on other exchanges though.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7vkdhg",
                            "author": "TechnicalError94",
                            "score": 1,
                            "created_utc": 1652065547.0,
                            "response": "What ended up happening with yours? I just had this happen to me too.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7wd0x8",
                                    "author": "Themasochistecho",
                                    "score": 1,
                                    "created_utc": 1652086782.0,
                                    "response": "This just happened to me 2 hours ago",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i7yjlke",
                    "author": "be-rad23",
                    "score": 1,
                    "created_utc": 1652125411.0,
                    "response": "Got one last night. Any update",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i81u7op",
                    "author": "Roguegrolar",
                    "score": 1,
                    "created_utc": 1652190765.0,
                    "response": "Any update I've received 3 of the same texts the last 4 days.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}