{
    "subreddit": "Binance",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uq33p5",
            "title": "Crypto crash leaves Brussels split on response",
            "url": "https://www.politico.eu/article/crypto-currency-crash-eu-brussels-split-on-retort/",
            "author": "Any_Apartment_4914",
            "created_utc": 1652609855.0,
            "score": 3,
            "num_comments": 2,
            "subreddit": "binance",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uq3mu0",
            "title": "Binance CEO CZ applauds Axie Infinity’s team, AXS prepares for recovery. Do you think Axie Infinity is capable of embarking on a bull move anytime soon?",
            "url": "https://www.reddit.com/r/binance/comments/uq3mu0/binance_ceo_cz_applauds_axie_infinitys_team_axs/",
            "author": "Juliet_bv",
            "created_utc": 1652612178.0,
            "score": 23,
            "num_comments": 8,
            "subreddit": "binance",
            "selftext": "The CEO of the world's largest cryptocurrency exchange praised the Axie Infinity team for how they handled the blockchain attack. The Axie Infinity team delivers \"Origin\" for Android users, adding to the positive attitude.\n\nAccording to FX Street, https://www.fxstreet.com/cryptocurrencies/news/binance-ceo-cz-applauds-axie-infinitys-team-axs-prepares-for-recovery-202205141404?_gl=1*1lnefbh*_ga*YW1wLVBMNm1xOWxCT2dxVHFGaFJuNzdVTDlkS3V4bVVfNGpKMWVoSjJ3ajQ5U0tXUnJuRGFka1lUbTNvUjZDSmFWZWk. \n\nAxie Infinity was impacted by the latest market correction, as the gaming token lost 15% of its value overnight. While the cryptocurrency market capitalization has been reduced by billions of dollars, supporters hope gaming tokens such as Axie Infinity can make a comeback.\n\nBinance CEO Changpeng Zhao praised the Axie Infinity team for their work in addressing the Ronin bridge hack. Following recent occurrences such as UST's demise and LUNA's slide to zero, the crypto community has shifted its focus to gaming and metaverse tokens including Zetrix which powers a lot of project including NFT that are play to earn based, Solana which has a very large ecosystem and so on. \n\nThe CEO of the world's largest exchange indicated that the Terra team has not responded positively to the ongoing UST situation. In terms of action and responsiveness to a crisis, the team behind Axie Infinity differs from Terra. CZ believes Axie Infinity handled the problem well.\n\nAccording to analysts at @P2Edaily, the Axie Infinity price has remained stable against Bitcoin, despite the fact that the metaverse token has fallen against the USD.\n\nAnalysts such as @AltstreetBet anticipate the Axie Infinity price will decline and collapse to depths between $14 and $10, indicating a gloomy outlook.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8omiel",
                    "author": "TheFamousHesham",
                    "score": 3,
                    "created_utc": 1652613393.0,
                    "response": "I wonder if CZ thinks this because Binance Labs is a big investor in Axie Infinity",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8on8r5",
                    "author": "PsieSyrenki",
                    "score": 5,
                    "created_utc": 1652613945.0,
                    "response": "SLP is down 99% from the ATH. \n\nGame is dying, because there's no more hype to attract new players to fuel their ponzinomics.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uq2tiq",
            "title": "Where I can see this picture, about my trade results or open positions??",
            "url": "https://www.reddit.com/r/binance/comments/uq2tiq/where_i_can_see_this_picture_about_my_trade/",
            "author": "kekocomplex",
            "created_utc": 1652608664.0,
            "score": 6,
            "num_comments": 4,
            "subreddit": "binance",
            "selftext": "&#x200B;\n\nhttps://preview.redd.it/8oxobn8e4mz81.png?width=711&format=png&auto=webp&s=9f5b89d66f9f54cecda8300845bad4cc23dcd128",
            "stickied": false,
            "comments": []
        }
    ]
}