{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uulwtu",
            "title": "Wage slave by design (post deleted in r/antiwork)",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uulwtu/wage_slave_by_design_post_deleted_in_rantiwork/",
            "author": "voluntarygang",
            "created_utc": 1653135393.0,
            "score": 287,
            "num_comments": 185,
            "subreddit": "Bitcoin",
            "selftext": "This post was deemed off topic in r/antiwork so I'm posting it here for posterity.\n______\n\nWhen you look around you and you observe the way the world works today you get this feeling that something is wrong. You see rich people with more wealth that they could possibly enjoy in a single lifetime and then you see yourself, struggling and you can't understand why, why are you living month to month barely getting by. You talk to people like r/antiwork and you find out you are not alone so you lach onto one of the popular explanations for why this is. The rich man is bad! The government is bad! The capitalist system is bad! You are being exploited at your job! etc etc \n\nBut you never learned what really is the primary cause of your suffering. And it's this: https://youtu.be/sI1C9DyIi_8 \n\nYou don't understand the exponential function and just what 2% per year inflation target by your central bank really means for your money. \n\nYou don't understand that this POLICY, publicly stated by YOUR central bank, is the main reason why you can't get ahead. Because you don't think 2% per year is a big deal. You don't get how the exponential function works as it's very counter intuitive. You don't get that 2% per year means in just 35 years your money will be worth HALF of what it was on the day you earned it. And you don't understand that if they overshoot their target(again publicly stated as some sort of virtue called \"price stability\") and the inflation is really 7% this happens in just 10 years. 10 fucking years and your savings lose half of it's purchasing power!!\n\nTHIS is the cage you are in.\n\nIt's the monetary system of steady decrease of the value of money you earn. And guess what, the way this inflation is achieved helps out the richer getting even more rich.\n\nI guess what the purpose of my message to you is, understand the cage you are in. Because if you fail to do this, you will never get out. Learn about money and monetary systems, support people who speak out against the current global monetary enslavement scam, put your wealth into money and assets that can't be inflated(gold, bitcoin, land, commodities) and spread this knowledge.\n\nIt's not hopeless. In fact with the invention of the internet and Bitcoin it's as hopefull as it ever was as this is a really really old scheme(think Romans old) and we have tools to fight it for the first time in human history. But you have to learn what the real problem is, the exponential function is really counter intuitive and it's how they keep you blind to just how much pain their 2% per year cuases you.\n\nGood luck and peace out.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9g9j4m",
                    "author": "planet_hallows",
                    "score": 82,
                    "created_utc": 1653142333.0,
                    "response": "It's not just inflation, but bailouts that's the problem.\n\nImagine two men with the same investment strategy: keep 6 months living expenses in cash and the rest in stocks. The first man has a net worth of $100k and living expenses of $2.5k/month. This means he has 15% of his net worth in cash and 85% in stocks. The second man has a net worth of $1M and living expenses of $10k/month. This means he has 6% of his net worth in cash and 94% on stocks. If in a year interest was 1% on cash and the stock market went up by 5%, the first man is 4.4% richer, but the rich man is 4.76% richer. That may not sound like a lot, but he's richer in both absolute and % terms. Over time, the rich get richer.\n\nHigher interest rates diminish this effect both by making the cash earn more and diminishing stock returns, but that just slows things down.\n\nThe natural solution is market crashes, which periodically take from the rich who invested poorly, invested using leverage or otherwise took great advantage of the system. Without bailouts, the rich would have to keep more cash on hand for emergencies, and over time, only the cautious and careful investor who did the hard work of discovering businesses useful enough that market gyrations can't stop them would prosper. Those who can't do that could always save cash instead, not to get rich, but to support themselves during lean times and in retirement.\n\n\nLow interest rates/inflation make taking advantage of the system possible, and force the average man to invest in stocks to slow how quickly he gets poorer and make him accept bailouts that he doesn't realize benefit richer men much more than they benefit him. Bailouts serve to solidify ill-gotten gains and encourage imprudent risk taking that is counter-productive to real economic growth.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9hvbyg",
                            "author": "cookmanager",
                            "score": 10,
                            "created_utc": 1653169896.0,
                            "response": "Where does the bailout money come from?  1/3 taxes, 2/3 borrowing.  But funds from both taxes and borrowing comes from future collections, and bailouts pay out now.  Where does the government get the money now?  Printing from nothing, the definition of inflation.\n\nSo you see, the basis of bailouts starts from further debasement of money, resulting in inflation.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9gp6fd",
                            "author": "NearbyTurnover",
                            "score": 16,
                            "created_utc": 1653149594.0,
                            "response": "> It's not just inflation, but bailouts that's the problem.\n\nAnd the endless taxes to fund their idiotic and inefficient programs.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9i84ft",
                                    "author": "durgadas",
                                    "score": 4,
                                    "created_utc": 1653176632.0,
                                    "response": "The Military, you mean. $705 billion. Name a single other \"inefficient\" program that costs more.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9iuvsx",
                                            "author": "johnsmit1214",
                                            "score": 2,
                                            "created_utc": 1653189055.0,
                                            "response": "Would you be comfortable with China having a more powerful military than the U.S.?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9kph86",
                                                    "author": "knut11",
                                                    "score": 1,
                                                    "created_utc": 1653234535.0,
                                                    "response": "If the civilized world embrace Bitcoin.\nIt will also become very hard for tyrannical countries, to print endless fiat as well.\n\nBitcoin can end wars.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9ir67e",
                                            "author": "Melmokz",
                                            "score": -2,
                                            "created_utc": 1653187022.0,
                                            "response": "Education as a whole.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9isqec",
                                                    "author": "durgadas",
                                                    "score": 3,
                                                    "created_utc": 1653187876.0,
                                                    "response": "The USA budget for the Dept of Education is 1/10 that of the yearly military budget. States do their own.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9iymgx",
                                                            "author": "Melmokz",
                                                            "score": -2,
                                                            "created_utc": 1653191296.0,
                                                            "response": "\"As a whole\". Also i wasnt talking specifically about the US.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9jjb54",
                                                                    "author": "gigahydra",
                                                                    "score": 2,
                                                                    "created_utc": 1653207572.0,
                                                                    "response": "I'm willing to bet quite a hefty sum that if we were to add up the amount of money the world spends on education vs the amount of money the world spends on weapons and war, the latter would come out billions - maybe even trillions - higher.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9hrekd",
                            "author": "Mr_Figgins",
                            "score": 3,
                            "created_utc": 1653167861.0,
                            "response": "this be that shiz I come to this silly site for. thank you so much for this.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9hrz29",
                                    "author": "planet_hallows",
                                    "score": 5,
                                    "created_utc": 1653168154.0,
                                    "response": "I admit that it's silly shit I pulled out of my arse with no data to back it up. But that's no different than academic economists, most of whom just speculate based on wild assumptions for which they pretend to collect data even though there's clearly no way to get anything close to meaningful data on the things they would need to measure.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9hvki7",
                                            "author": "soks86",
                                            "score": 4,
                                            "created_utc": 1653170018.0,
                                            "response": "You chose conservative numbers and the idea lines up with what I believe most BTC holders have observed.\n\nThe truth is stranger of course, like the 2008 bailouts. They could have provided money for mortgages to extend bad loans while people and banks try to unwind. Instead they paid the banks so they could get off the hook, if they were on it, and let everyone else eat shit since the banks has no economically viable reason to lend money out even if they were given piles of it.\n\nIn case you were not aware of the message inside the BTC genesis block\n\nThe Times 03/Jan/2009 Chancellor on brink of second bailout for banks\n\n[https://en.bitcoin.it/wiki/Genesis\\_block](https://en.bitcoin.it/wiki/Genesis_block)\n\nYou came to the right place, no idea why r/antiwork wouldn't have liked your message, they must not be real.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9hzll5",
                                                    "author": "fellowpleb",
                                                    "score": 2,
                                                    "created_utc": 1653172100.0,
                                                    "response": "> You came to the right place, no idea why r/antiwork wouldn't have liked your message, they must not be real.\n\n\nBecause it's literally a communism sub now. Spend 5 minutes in any thread you'll see they're literally talking about overthrowing capitalism and starting a violent revolution. And communists think it's totally a-okay for the State to be in total control of the money supply. They aren't Bitcoiners *at all*.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9i5l2s",
                                                            "author": "huskerarob",
                                                            "score": 2,
                                                            "created_utc": 1653175252.0,
                                                            "response": "Then they would be forced to work.  Most of those kids don't know what communism is.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9ibueq",
                                                                    "author": "8yr0n",
                                                                    "score": 1,
                                                                    "created_utc": 1653178688.0,
                                                                    "response": "Communism is being upset at a small group of people being in control of most of your economy…so you give ONE person control of the military AND the economy…",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9jl1vw",
                                                                            "author": "rach2bach",
                                                                            "score": 1,
                                                                            "created_utc": 1653209172.0,
                                                                            "response": "I mean, that's what it devolves to, but by definition that's not what it actually is. Dictatorships=/=communism. Actual communism hasn't actually ever existed. All the states that day they were communist in the past were actually just totalitarianism. Karl Marx would be rolling at the idea of that crap.\n\nI say this thinking communism is stupid, hell I'm a technocrat that still has capitalistic ideals, but let's not conflate communism with dictatorships.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "i9ic7sq",
                                                                    "author": "AveaLove",
                                                                    "score": 0,
                                                                    "created_utc": 1653178886.0,
                                                                    "response": "Contrary to it's name, antiwork isn't about not working at all, it's kind of a misnomer, they are against working in bad environments for table scraps, they want fair pay and good working conditions, mostly. Some people want a revolution, most just want to not sell their life for nothing, ya know, super similar to here.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "i9ibxh9",
                                                            "author": "AveaLove",
                                                            "score": 1,
                                                            "created_utc": 1653178736.0,
                                                            "response": "Some people there are communist, most just want good working conditions with fair pay. Either way, both there and here are down with eating the rich.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9i6gu2",
                                            "author": "Mr_Figgins",
                                            "score": 1,
                                            "created_utc": 1653175727.0,
                                            "response": "I don't mind when numbers aren't accurate. It's the informative break down that I follow. I appreciated that.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9hw08f",
                            "author": "FlatDescription1155",
                            "score": 2,
                            "created_utc": 1653170243.0,
                            "response": "Wrong. Thats all just mumbo jumbo. They cant bail out anyone if they dont have unlimited amounts of money both the OP and you are missing the point. FIX THE MONEY FIX THE WORLD.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9hy0j0",
                                    "author": "planet_hallows",
                                    "score": 2,
                                    "created_utc": 1653171284.0,
                                    "response": ">FIX THE MONEY...\n\nYou're not wrong...\n\n>FIX THE WORLD.\n\n...but fixing the money would only fix some of our current problems, while introducing new ones.\n\nOr possibly old ones. Increasing the money supply in proportion to economic growth keeps prices stable, which lets people plan for the future efficiently. Neither gold nor BTC allow a central bank to do that. I realize that today's problem is that central banks print way more than is required by economic growth and the distribution plan involves huge benefits to the already wealthy, but it does make lending a reasonable thing to do, which does accelerate good ideas. The correlation between inflationary fiat, huge growth in tech and the average material wealth of almost everyone isn't a coincidence. Were BTC to become the new, single central reserve currency, we'd just go back to the tyranny of the saver rather than the tyranny of the risk-taker we have today.\n\nHow we strike the correct balance, I have no idea.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9iwhbv",
                                            "author": "Crawlero",
                                            "score": 1,
                                            "created_utc": 1653189977.0,
                                            "response": "Prices aren't supposed to be stable, they are supposed to convey information.  The cost of semiconductors go up, indicating money to be made in producing semiconductors, TSMC opens new semiconductor fabs.  We could make prices stable by introducing price controls, and we would just end up with incoherent shortages and surpluses.  Doing so through inflation implies certain sectors like housing seeing the brunt of inflation, this has turned houses from something average people can afford into an asset where the percentage of people who own multiple homes (investment properties) rises against those who own only one home.  Problems with inflation aside, I am unsure of what you mean by tyranny of the saver; under a bitcoin standard a Schwab will be forced to make investments that are profitable and grow the economic pie, rather than devising schemes to take a larger share of the stagnated pie we have today.  No one with that much wealth can manage it efficiently, it may take years or it may take centuries, but over time his share of the pie will shrink as he makes marginally negative investments overall.  The amount of wealth he has doesn't give him power under bitcoin, only his spending, and if he is blowing money on controlling people then his position will slide.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9iznnc",
                                                    "author": "planet_hallows",
                                                    "score": 1,
                                                    "created_utc": 1653191964.0,
                                                    "response": "I agree that prices aren't supposed to be stable and they do convey info if not manipulated, and that monetary policy can't keep the price of any individual thing stable without amplifying fluctuation in the price of other things.  But by \"price stability\", I suppose I mean \"the price of money\", by which I mean relative wealth. Under A better than present (though perhaps not ideal) monetary policy, maybe tomorrow you can buy more food but less energy, but overall your socioeconomic status goes neither up nor down simply by holding currency. This is desirable because you can then wait for the right opportunity to deploy capital rather than do so out of fear of losing purchasing power, but you don't get richer just by sitting on your piggy bank.\n\nBy tyranny of the saver, I mean exactly what all us HODLs are hoping for: Bitcoin goes way up and we get to retire early. We live a life of luxury just because we bought at the right time, not because we contributed to the common good.\n\nBut you have a good point. In the short run (which may be generations), we could live on our outsized share of wealth. But eventually it would dwindle and we would be forced to either work or invest it. We couldn't just live off the interest, because lending under a deflationary currency is madness. For the borrower, you would have to do better than average in a zero-sum game to pay back the loan. For the lender, why would you believe the borrow could pay you back, especially with bankruptcy laws that let him not do so. So there would be no opportunity for \"guaranteed\" income at any interest rate - you have to put your BTC at risk in exchange for equity.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9jy6xk",
                            "author": "ChrimsonChin988",
                            "score": 2,
                            "created_utc": 1653220413.0,
                            "response": "You're not even listing the major problem that constitutes the one you described:\n\nLeverage & borrowing.\n\nRich people have access to borrowing capital at very low cost. You mention a rich person has 94% of his wealth in stocks, but it could be 400% because he took out cheap loans with his net worth as collateral. This puts even more gasoline on the fire of inequality.\n\nFor the past decade, if you wanted to make a lot of money, you had to do 2 things:\n\n1. Borrow cheap capital\n2. Buy any asset you can find\n\nThis is why assets have gone up several 100% points (asset inflation).\n\nLike you mentioned, it's caused by low interest rates, but it's important to add that it's rich people who can exploit by borrowing billions at no cost, whereas poor people cannot use quantitative easing to their advantage except getting screwed by inflation.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9glf1l",
                            "author": "Digital_Wampum",
                            "score": 2,
                            "created_utc": 1653147872.0,
                            "response": "Brilliant",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9ga76v",
                    "author": "shreveportfixit",
                    "score": 53,
                    "created_utc": 1653142662.0,
                    "response": "I've tried talking to them about inflation.  Their only response is that minimum wage should rise with it.  They wanna put a bandaid on a gunshot wound without removing the bullet first. It is infuriating.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9gad58",
                            "author": "voluntarygang",
                            "score": 11,
                            "created_utc": 1653142740.0,
                            "response": "Yep.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9hkuu8",
                            "author": "333chordme",
                            "score": 2,
                            "created_utc": 1653164582.0,
                            "response": "Them?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9hpj7t",
                                    "author": "TheMeatery",
                                    "score": 9,
                                    "created_utc": 1653166912.0,
                                    "response": "r/antiwork",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9hz8ll",
                                            "author": "trufin2038",
                                            "score": 8,
                                            "created_utc": 1653171916.0,
                                            "response": "Youll never find a more wretched hive of the entitled and lazy",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9ivotb",
                                                    "author": "Just_Another_AI",
                                                    "score": 2,
                                                    "created_utc": 1653189519.0,
                                                    "response": "Yup. No interest in learning",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9hqiue",
                                    "author": "shreveportfixit",
                                    "score": 1,
                                    "created_utc": 1653167410.0,
                                    "response": "Slackers",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9gn7io",
                    "author": "EspHack",
                    "score": 14,
                    "created_utc": 1653148688.0,
                    "response": "inflation is a tech problem we solved in 2009, just like we solved timekeeping and space measurement before that\n\ntime, space and value measurement are similar in that those things work for us because we agree on what they are, otherwise chaos ensues\n\nimagine a dude could change the definition of \"meter\" whenever, now try building a house using it, thats the current economy, and you're forced to use it at gunpoint\n\npeople halfway there think its capitalism or greediness or whatever, capitalism is just the game we play to avoid killing each other over stuff, and money is the score on said game, inflation is like the game's difficulty setting, if it goes up forever it means eventually no legit players can keep up with it, only cantillionaires(cheaters) can keep playing, thats what you see nowadays\n\nkill the money printer, thats the only solution we have",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9gqw3k",
                            "author": "AndyZuggle",
                            "score": 10,
                            "created_utc": 1653150380.0,
                            "response": "> inflation is a tech problem we solved in 2009\n\nNo.  It is a social problem.  People are very willing to tolerate it and, in fact, have been led to believe that it is good.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9hax4u",
                                    "author": "EspHack",
                                    "score": 3,
                                    "created_utc": 1653159699.0,
                                    "response": "its social and cultural acceptance comes from the reality that we didn't have a way to prevent money printing and/or counterfeiting, for literally all of known history, at best we could keep it small enough to be livable, so its like suddenly pigs can fly and its understandable that most people wont even bother listening to such -up until recently- crazy ideas\n\nits normal that most would choose to rationalize and accept whatever hard circumstances we face, see the good in them; \"2% is good!\"",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9irv40",
                                            "author": "CryptoBehemoth",
                                            "score": 2,
                                            "created_utc": 1653187400.0,
                                            "response": "Evolution happens in gap-jumps and waterfalls. When a mutation appears in a gene pool that gives a very real and impactful advantage to the individuals benefitting from that mutation, it will tend to spread very rapidly throughout that gene pool. It's simple, really: since the individuals that have the mutation tend, on average, to fare better than those who don't, then those individuals will tend to proliferate more in the gene pool.\n\nThe thing is, mutations happen overnight. Some will argue it's a gradual process (say, birds with hollow bones vs birds with full bones; for a bird to evolve hollow bones (and keep them), they need to provide it a meaningful advantage over other alternatives. But for that, the bird first needs to be able to fly, or else hollow bones are useless. So it first needs to have wings, be below a certain weight for its size, etc.). But all these different mutations happen independently of each other. Sure, the second one (hollow bones) needs the first one (wings) to be stable before it can become useful, so it's less likely to appear. But just because mutation A exists, doesn't make mutation B more likely to happen. It just makes it more likely to stick IF it ever happens at all.\n\nI'm of the school of thought that social evolutions work in much the same way. There is an equilibrium which we all need to acknowledge in order to function adequately in society. But sometimes, an event will appear that drastically changes that equilibrium (COVID-19, for example, or the emergence of a new technology like Bitcoin). When that happens, the equilibrium gets displaced overnight (for those familiar with game theory, I'm talking about Nash equilibriums here). And when that happens, the only logical thing to do is to adapt to the new environment that creates. There is no going back, there is no avoiding those new circumstances. *The optimal way to play the game has changed, because the very rules of the game have changed.*\n\nI believe this is exactly what is happening with Bitcoin. The equilibrium was displaced in 2009, when Bitcoin first came online and was accepted by the cryptographic community. Since then, all we have been seeing is the market slowly adapting to this new reality. The rules of the global financial game have changed overnight, and everyone has been trying to find the new optimal playstyle since then. But naturally, some people don't see this change yet, since it is not that obvious yet. And naturally, others will reject it, whether out of a preference for the old system or out of fear of change. But still naturally, these people will get fazed out of the game very quickly once the new rules become so ubiquitous nobody has a choice but to follow them. So right now, it's a race for who can figure out these new rules fastest with the most precision. The ones that don't or refuse will get left behind through the brutal nature of evolution. The better adapted individuals will tend to prevail in the gene pool. Those with poorer adaptations will tend to fail to produce quality offspring (whether children or deliberate works) and disappear over time.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9j2kco",
                                                    "author": "Samson1978",
                                                    "score": 1,
                                                    "created_utc": 1653193910.0,
                                                    "response": "Interesting analogy",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9gkcat",
                    "author": "Digital_Wampum",
                    "score": 13,
                    "created_utc": 1653147377.0,
                    "response": "Quality post!\n\nIn my culture, we're taught to think and take consideration what we do today and that it resonates 7 generations into the future.\n\nThat relates to the video link in the post \"arithmetic, population and energy\" where at ~24 minutes the speaker uses bacteria growth in a jar.  It takes 7 iterations to go from 1 bacterium to filling the jar.\n\nUnderstanding exponential functions like that, and the king and the chessboard and providing a reward by doubling the grains on each square also reflect this.\n\nAs a youth with access to computers and supporting and repairing them on my own, I observed this doubling with ram... 2, 4, 8.... 4096, 8192.... Etc\n\nWhen people see a percentage on paper, say in financial information... People don't get the notion to extrapolate and properly calculate this provided information.  \n\nI was always told to \"show your work!\" In math class.  And now I see why.  Because if everyone walked into a bank with pen, paper and calculator and were knowledgeable with the mathematics presented in this video regarding exponential function it would wind up as exactly what henry ford said\n\n\"It is well enough that people of the nation do not understand our banking and monetary system, for if they did, I believe there would be a revolution before tomorrow morning.\"",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9gdphf",
                    "author": "JimBloc",
                    "score": 10,
                    "created_utc": 1653144315.0,
                    "response": "As they say in movies FUCK YOU MONEY(enough to tell people I'm not doing your shity job anymore) they don't want you to get that point. \nThe governments have been devaluing your money and loading you with debt for years. It's a way to control the masses.\nMargaret Thatcher is good example, she loaded the poor up with debt and mortgages so they couldn't go on strike any more, and it worked.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9h9u0e",
                            "author": "CommunicationAway341",
                            "score": 3,
                            "created_utc": 1653159168.0,
                            "response": "That’s not quite F u Money…\nIf you can pay any lawyer and rules stop applying to you, that’s F u Money.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9g2s8f",
                    "author": "Level_Willingness790",
                    "score": 7,
                    "created_utc": 1653138789.0,
                    "response": "Piece....out?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9g3eqy",
                            "author": "voluntarygang",
                            "score": 14,
                            "created_utc": 1653139144.0,
                            "response": "It was my sign off for r/antiwork. I'm in this Bitcoin space since 2011, ain't going anywhere, obv 🤣\n\nEDIT: it just hit me.. LOL I'm an idiot 🤣🤣 Ty, made the edit.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9gl3fg",
                                    "author": "IRL2DXB",
                                    "score": 2,
                                    "created_utc": 1653147723.0,
                                    "response": "Since 2011… jeez you must have made a mint!",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9glniq",
                                            "author": "voluntarygang",
                                            "score": 12,
                                            "created_utc": 1653147984.0,
                                            "response": "Was basically broke back then so didn't start with much. Doing alright now, if I keep my modest standard of living I can probably consider myself retired.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9hbcox",
                                                    "author": "Kinimodes",
                                                    "score": 3,
                                                    "created_utc": 1653159903.0,
                                                    "response": "Hell yeah, congrats! I'm happy for you. That's the goal!\n\nI was exposed to BTC when it was under a dollar. My best friend was mining it for fun... Stupid teenager brain thought since it's worth almost nothing, why bother. Hindsight fuuuuuuu. \n\nI had 10k after college in 2014 and asked r/investing for advice... I wish one person had mentioned BTC. I could have had anywhere from 1mill to 56mill if bought in 2013-2014 (assuming I didn't paper hand, which I probably would have tbh).",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9g1m6t",
                    "author": "freemarketcommie",
                    "score": 26,
                    "created_utc": 1653138125.0,
                    "response": "This is the one great strength of the Fiat system. Forcible participation. There’s gotta be a way to produce the same affect without all the coercion.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9hzefi",
                            "author": "trufin2038",
                            "score": 1,
                            "created_utc": 1653171998.0,
                            "response": "It's only a strength insofar as it let's you fund a military, and a lavish undeservimg upper class.\n\nIn a world where humans aren't constantly killing each other, it's all downsides.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9hk40f",
                    "author": "Satoshiman256",
                    "score": 4,
                    "created_utc": 1653164215.0,
                    "response": "Watch this, and get angry..\n\nhttps://www.netflix.com/gb/title/70139555?preventIntent=true",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9hre43",
                            "author": "dragracedave",
                            "score": 5,
                            "created_utc": 1653167854.0,
                            "response": "It's not available in the us lol. That says something...",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9hu4lv",
                                    "author": "Satoshiman256",
                                    "score": 2,
                                    "created_utc": 1653169273.0,
                                    "response": "Oh damn, haha. A lot of it is about the US banking system. It really pisses you off. If you ever have region issues with Netflix just use a VPN service like Nord VPN or to view via Europe.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9hqkgs",
                    "author": "luizhtx",
                    "score": 4,
                    "created_utc": 1653167432.0,
                    "response": "“Off topic” at r/antiwork means you didn’t say “capitalism = bad” or “rich = bad”",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9gj9e3",
                    "author": "VPNApe",
                    "score": 6,
                    "created_utc": 1653146874.0,
                    "response": "Inflation is usually around 5%, not the 2% figure that they want you to believe. That basically throws the entire American retirement system out the window for most of the population. Their value stocks/bonds don't even maintain purchasing power throughout retirement. \n\nThat said, everyone is a wage slave even without inflation. It's been like that since society was formed and Bitcoin won't change that.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9fykd2",
                    "author": "Lucky-Painting6553",
                    "score": 24,
                    "created_utc": 1653136299.0,
                    "response": "instead put in crypto and lose 50%",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9gax5f",
                            "author": "Riker-Was-Here",
                            "score": 27,
                            "created_utc": 1653142999.0,
                            "response": "your first mistake was investing in \"crypto\" instead of just BITCOIN.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9g6uad",
                            "author": "voluntarygang",
                            "score": 16,
                            "created_utc": 1653140983.0,
                            "response": "What are you talking about? I'm up 250000% 🤣",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9hefaq",
                                    "author": "MadManD3vi0us",
                                    "score": 1,
                                    "created_utc": 1653161406.0,
                                    "response": "If you take the entire history of Bitcoin's price, and you randomly threw a dart somewhere on the timeline as your entry point, you'd have a much much higher chance of being in the green than being in the red. About 80% chance of being even or in profit.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9hkawx",
                                            "author": "dfunkmedia",
                                            "score": 4,
                                            "created_utc": 1653164311.0,
                                            "response": "If you bought at any point prior to Jan 1, 2021 you are likely to stay in profit indefinitely.\n\nIf you bought at all-time high in Dec 2017 you are likely to stay in profit indefinitely.\n\nIf you bought prior to Jan 1, 2017 you are already up 2000% and will probably never go below that.\n\nIf you bought a $1,000 10 year US Savings Bond in May 2012 it's worth $885 today if you sell through Schwab (rates aren't likely to be much higher elsewhere)\n\nIf you bought $1,000 of BTC in May 2012 it's worth $5.7 million today and not likely to ever go back to where you bought it.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9hkh9k",
                                                    "author": "MadManD3vi0us",
                                                    "score": 2,
                                                    "created_utc": 1653164399.0,
                                                    "response": ">If you bought a $1,000 10 year US Savings Bond in May 2012 it's worth $885 today if you sell through Schwab (rates aren't likely to be much higher elsewhere)\n\nOuch...",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9g0q3g",
                            "author": "JaceTheWoodSculptor",
                            "score": 19,
                            "created_utc": 1653137610.0,
                            "response": "You don’t lose 50%, you lose 50% of its value when paired in your local currency, your haven’t lost a single satoshi. The problem is those local currencies. Don’t you see a problem with having private entities in control of printing said currencies ? Ain’t nothing federal about the federal reserve. \n\nOr maybe you like working your ass off only to see your purchasing power slowly melt away.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9g4ipx",
                                    "author": "polloponzi",
                                    "score": 7,
                                    "created_utc": 1653139754.0,
                                    "response": "Same with dollar, you don't lose any dollar because of inflation. 1 dollar = 1 dollar forever.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9g572g",
                                            "author": "JaceTheWoodSculptor",
                                            "score": 17,
                                            "created_utc": 1653140120.0,
                                            "response": "Yes but you cannot dilute the value of BTC by just printing more.\n\nYou may still have 1$ but everything now costs 2$…",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9g5oly",
                                                    "author": "polloponzi",
                                                    "score": -7,
                                                    "created_utc": 1653140377.0,
                                                    "response": "You can dilute the value of Bitcoin by selling it, just see how the market is.. Bitcoin lost 50% of the  value recently",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9gaxo9",
                                                            "author": "Ok_Aerie3546",
                                                            "score": 16,
                                                            "created_utc": 1653143006.0,
                                                            "response": "That not dilution.\n\nCentral bank printing is dilution, gold miners mining is dilution and bitcoin miners mining is dilution. Difference is in bitcoin the dilution is predictable. And keeps decreasing.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9ghd67",
                                                                    "author": "polloponzi",
                                                                    "score": -8,
                                                                    "created_utc": 1653145993.0,
                                                                    "response": "Is not dilution in technical terms, yet the end effect is the same: your wealth goes down.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9gighn",
                                                                            "author": "Ok_Aerie3546",
                                                                            "score": 6,
                                                                            "created_utc": 1653146496.0,
                                                                            "response": "People are ok with wealth going down. They are never ok with unexpected dilutions. Thats why people sell their stocks if the company announces an unexpected share offerring. But no extra people exit if just the stock price moves up or down.\n\nUnexpected stock offerring can even make long term investors leave, price fluctuations cant.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i9go1bx",
                                                                                    "author": "polloponzi",
                                                                                    "score": 0,
                                                                                    "created_utc": 1653149068.0,
                                                                                    "response": ">But no extra people exit if just the stock price moves up or down.\n\nlmao.. the only reason people buy stocks or crypto is to earn more dollars. If the stock goes down people will sell to avoid further losses.\n\nYou are missing that wealth is measured in dollars, not in the amount of stocks or crypto you own.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i9goiob",
                                                                                            "author": "Ok_Aerie3546",
                                                                                            "score": 4,
                                                                                            "created_utc": 1653149288.0,
                                                                                            "response": "People who own most of the assets (including stocks) in the world would disagree with you.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        },
                                                                                        {
                                                                                            "id": "i9hqa8y",
                                                                                            "author": "JaceTheWoodSculptor",
                                                                                            "score": 1,
                                                                                            "created_utc": 1653167288.0,
                                                                                            "response": "Buying assets is just a way to transfer purchasing power through time. The reason the value increases is due to many underlying reasons including inflation and the health and market share growth of a company in the case of stocks.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "i9g62q7",
                                                            "author": "JaceTheWoodSculptor",
                                                            "score": 5,
                                                            "created_utc": 1653140577.0,
                                                            "response": "You can dilute the value of any asset by selling it… I just think BTC is a better alternative to fiat currencies.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9gh9ad",
                                                                    "author": "polloponzi",
                                                                    "score": 1,
                                                                    "created_utc": 1653145943.0,
                                                                    "response": "I agree with that",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9ghzmf",
                            "author": "Bitcoin__Hodler",
                            "score": 2,
                            "created_utc": 1653146282.0,
                            "response": "or 99,9%.\n\nbetter stack sats!",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9fzd6s",
                            "author": "Apprehensive-Page-33",
                            "score": -4,
                            "created_utc": 1653136800.0,
                            "response": "Right? This propaganda piece is particularly poorly timed.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9g0u7w",
                                    "author": "grundatcom",
                                    "score": 8,
                                    "created_utc": 1653137678.0,
                                    "response": "Propaganda because of? Isn’t it true that your money is losing value due to inflation?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9g7znf",
                                            "author": "Apprehensive-Page-33",
                                            "score": -4,
                                            "created_utc": 1653141570.0,
                                            "response": "No doubt it is true that USD suffers from the effects of inflation. We are seeing that right now. I am talking about the reason why we suffer inflation and the solutions that regular folk can take. This is not the only place I disagree. It is the vehemence and arrogance with which you propose your solution that has me throw it away as propaganda. That you say this when most of us are in the red means that it is also ill timed. We have much bigger problems than inflation and crypto is as much a part of the bigger problem as it is a solution to anything related to inflation IMO. Inflation is just one symptom of the illness on the wider economic system IMO. Crypto won't save us from inflation or the wider structural problems facing our system.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9ga2dt",
                                                    "author": "voluntarygang",
                                                    "score": 4,
                                                    "created_utc": 1653142596.0,
                                                    "response": "You keep saying crypto but this is r/bitcoin and I suggested Bitcoin only. And Bitcoin with its excellent good money properties is precisely the solution to inflation. The rest of crpyto not ao much.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i9grkuz",
                                                    "author": "AndyZuggle",
                                                    "score": 3,
                                                    "created_utc": 1653150700.0,
                                                    "response": "Inflation is actually, really, really simple.  Printing more money *is* inflation.  Prices going up is a *result* of inflation, not inflation itself.\n\nEverything else that you have ever read about what inflation is and what causes it is just a lie to obfuscate the truth.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9g5z9l",
                                    "author": "Knerd5",
                                    "score": 4,
                                    "created_utc": 1653140529.0,
                                    "response": "It’s really not though. Taking the ATH point is glossing past the fact that’s not the average buy price of 99% of participants. Yes, many are underwater by 20-40%, but that’s what happens when you buy hype. Doesn’t matter what asset it is. Anyone who does any semblance of DD should have known the price does this. If you aren’t averaging down, you’ll never be *truly* successful in this space.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9g94ly",
                                            "author": "Apprehensive-Page-33",
                                            "score": -2,
                                            "created_utc": 1653142134.0,
                                            "response": "I'm good homie. Cost basis aside... I'm talking big picture. The larger economic system including inflation. Crypto is not going to save anyone or disrupt that. That's all I am saying here. I am a crypto investor myself so I do think that people are involved and will continue to be. As far as the price action no one knows shit about fuck if you ask me (self included).",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9g9wo6",
                                                    "author": "nameisjose",
                                                    "score": 4,
                                                    "created_utc": 1653142518.0,
                                                    "response": "Crypto won’t save us, but Bitcoin will. It’s Bitcoins economic principles that save us, 21 million, fixed supply schedule.  If all workers demanded to be paid in Bitcoin the world would be a different place.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9jnpfx",
                                                            "author": "agawacha",
                                                            "score": 1,
                                                            "created_utc": 1653211652.0,
                                                            "response": "No doubt about the fact that bye that face it is going to be different place.",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "i9gbqvs",
                                                            "author": "Apprehensive-Page-33",
                                                            "score": -5,
                                                            "created_utc": 1653143390.0,
                                                            "response": "I disagree. I use BTC and crypto interchangeable. It becomes a bit of a leap of faith to believe that something will happen when you have no proof. I am a skeptic and very disagreeable on purpose. To have a paradigm shift that changes an entrenched and corrupt system requires enormous time and effort (good timing and good fortune as well). Sorry if I'm all out of hopium. I think our system is irretrievably corrupt.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9jxjkd",
                                                                    "author": "fsiegmund",
                                                                    "score": 3,
                                                                    "created_utc": 1653219950.0,
                                                                    "response": "I am sorry about the forget everything is going to happen after that only.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                },
                                                                {
                                                                    "id": "i9gdj8l",
                                                                    "author": "voluntarygang",
                                                                    "score": 2,
                                                                    "created_utc": 1653144234.0,
                                                                    "response": "Boy, you should have been here to spread your lack of vision when the price was sub 1$ and hardly anyone knew let alone used Bitcoin 🤣",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                },
                                                                {
                                                                    "id": "i9ge0x9",
                                                                    "author": "nameisjose",
                                                                    "score": 2,
                                                                    "created_utc": 1653144462.0,
                                                                    "response": "I agree it will be a paradigm shift and it’s happening. Going from a handful of Bitcoiners to millions in a decade is proof. How do you stop an idea that seems to be catching on?",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9kuqi1",
                                                                            "author": "morange81",
                                                                            "score": 1,
                                                                            "created_utc": 1653236797.0,
                                                                            "response": "They can to try to catch on but it will not certainly happen as well.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "i9gg6ot",
                                                                    "author": "techma2019",
                                                                    "score": 3,
                                                                    "created_utc": 1653145453.0,
                                                                    "response": "You lost me when you conflated Bitcoin with crypto. There's Bitcoin and then there's ELONCUMROCKET. I am pretty sure you do not think both can save the world. I would hope you don't anyway. \n\nI fully agree on corruption. I also think more and more people are waking up. Much harder to keep people silent like in the old days. We have the Internet now and the era of accountability will be upon us shortly.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9gj3xz",
                                                                            "author": "Apprehensive-Page-33",
                                                                            "score": 1,
                                                                            "created_utc": 1653146804.0,
                                                                            "response": "That is a technicality, but ok you win? The fact is our corrupt overburdened debt system is likely to crash the global economy again regardless of crypto, bypto or BTC.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i9gni8z",
                                                                                    "author": "techma2019",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653148827.0,
                                                                                    "response": "That was going to happen with, or without crypto, bypto, BTC, or clowns.\n\nHaving an alternative, less corrupt (I'm a skeptic too after all!) system in place by the people (not the rulers) feels very timely. I am not saying Bitcoin will thrive if everything tanks, I am saying we need Bitcoin when the re-building will begin.",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i9gb7do",
                                                    "author": "Knerd5",
                                                    "score": 3,
                                                    "created_utc": 1653143133.0,
                                                    "response": "See, I disagree with you on the bigger picture. Bitcoin IS going to help, and does help, protect against inflation. At this point in its existence it only protects over longer timeframes (2-4 years) though. The reason being is OG holders have massive positions that need to be unwound, a decently high issuance rate (~2%) and access to high amounts of leverage (20x) all lead to high volatility. I have always believed that the 2028-2032 halvings are when we see price volatility significantly calm down. Large individual holders will have dispersed to larger groups of people, inflation will be well under 1% and exchanges will forced to bring leverage into a reasonable range (probably 3-7x). All these factors will lead to the swings calming TF down.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9jmiw1",
                                                            "author": "xbuiquangtuyen",
                                                            "score": 1,
                                                            "created_utc": 1653210540.0,
                                                            "response": "No doubt about the fact that nothing is going into our hands as well.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i9kllum",
                                                    "author": "greengrass_97",
                                                    "score": 1,
                                                    "created_utc": 1653232835.0,
                                                    "response": "Singh is going to maintain its own balance and we have to wait for it/.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9h9en0",
                    "author": "uszeraj",
                    "score": 6,
                    "created_utc": 1653158962.0,
                    "response": "I recommend listening to \"The Story of your Enslavement\" by Stefan Molyneux. Ignore whatever you or other people think about the guy and listen to this.\n\n[https://www.youtube.com/watch?v=FYgIBBDzZr4](https://www.youtube.com/watch?v=FYgIBBDzZr4)",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9hu0g2",
                            "author": "Wsemenske",
                            "score": 1,
                            "created_utc": 1653169214.0,
                            "response": "Who's Peter Molyneux?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9i180t",
                                    "author": "uszeraj",
                                    "score": 0,
                                    "created_utc": 1653172947.0,
                                    "response": "My bad. Stefan. Stefan Molyneux.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9gql4q",
                    "author": "turbosecchia",
                    "score": 2,
                    "created_utc": 1653150238.0,
                    "response": "This is why I keep telling other people that no, having bitcoin as an investment option while we earn and spend in fiat it’s not enough\n\nPs: the post was not off topic where you posted it, but they aren’t ready for it",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9h4a3h",
                    "author": "StaticXorcist",
                    "score": 2,
                    "created_utc": 1653156497.0,
                    "response": "Very well said. I only recently started learning these lessons and it wasn’t until I discovered Bitcoin in 2020 while the rest of the country was watching Tiger King",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9jyehl",
                            "author": "Dosdi222",
                            "score": 1,
                            "created_utc": 1653220562.0,
                            "response": "I'm trying to watch some of the movies as well can you please suggest me.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9heepj",
                    "author": "GodOfOdium",
                    "score": 2,
                    "created_utc": 1653161398.0,
                    "response": "So well put.... fucking awesome notes. Gold plate this post and hang it on your wall.only innocent people will not get this as they think all authority have their good at heart.... and are told and accept that 2% inflation is something good for you.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9k0vlb",
                            "author": "ktoooh",
                            "score": 1,
                            "created_utc": 1653222237.0,
                            "response": "I don't really see that inflation is the main problem here main problem is something different.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9hnqh0",
                    "author": "QuadraQ",
                    "score": 2,
                    "created_utc": 1653166024.0,
                    "response": "That video is incredible. But it’s really about things larger than fiat Vs bitcoin even though Bitcoin presents possible solutions and new challenges to the issues discussed.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9hvx1p",
                            "author": "BitcoinUser263895",
                            "score": 1,
                            "created_utc": 1653170197.0,
                            "response": "That video should be required viewing for all people in possession of a human brain.\n\nIt shows the flaws in our cognition which we are usually blind to.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9kr19g",
                                    "author": "auiquenty",
                                    "score": 1,
                                    "created_utc": 1653235205.0,
                                    "response": "Well you are right about the fact that a people is needed for that.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9hvuif",
                    "author": "BitcoinUser263895",
                    "score": 2,
                    "created_utc": 1653170161.0,
                    "response": "That Dr. Albert A. Bartlett presentation on exponent function is very, very good.\n\nIt's a MUST WATCH for everyone regardless of ideology.\n\nSimple arithmetic.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9k0k6b",
                            "author": "adroussel",
                            "score": 1,
                            "created_utc": 1653222035.0,
                            "response": "You are right about the fact that and this is the reason why I love this ideology.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9icxp8",
                    "author": "satoshisfeverdream",
                    "score": 2,
                    "created_utc": 1653179282.0,
                    "response": "You’re largely right but “it’s easier to fool people than convince them they’ve been fooled” - Michael Scott.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9k933t",
                            "author": "etfche",
                            "score": 2,
                            "created_utc": 1653226940.0,
                            "response": "They trying to do that but I am not sure if they will be able to succeed.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9jn061",
                    "author": "Koinzer",
                    "score": 2,
                    "created_utc": 1653210994.0,
                    "response": "Inflation, bailouts, taxes, fractional reserve, uncapped amount of money: those should be the main topics of research by anyone trying to understand how the system we are born in works.\n\nOnce you unerstand the problem the solution becomes self-apparent.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9h4nq9",
                    "author": "FUCKYOUINYOURFACE",
                    "score": 3,
                    "created_utc": 1653156679.0,
                    "response": "Remember that not all rich people are evil. Still, there is a good portion that is working to convince the poor and middle class to not only vote against our own interests but to also squabble amongst ourselves.\n\nTake commodities like oil and gas. They want you to think it’s a drilling and refining problem but global production is up 5m barrels over last year. We are also not running out of fuel so what gives? It’s financial speculators. 13x oil contracts are traded than there is physical oil to trade. Those trades are not by anyone who will refine the oil into gasoline and other products. So why are no politicians talking about it? Just let that sink in.\n\nWhile they’re getting richer, everyone else is getting poorer.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9hujol",
                            "author": "planet_hallows",
                            "score": 0,
                            "created_utc": 1653169491.0,
                            "response": ">Remember that not all rich people are evil.\n\nDepends on what you mean by \"evil\". I'd bet almost all rich people will seem very nice if you meet them in person. I doubt there's a way to make and/or keep money if you're not good at that.\n\nBut what about their actions? They accumulate property and power. They more they have, the more they want. Once you learn to live with a certain amount, having less causes fear, panic, anger and a sense of injustice against you. This isn't unique to the rich, it just seems silly when we see it in those better off than we are. But what about when those worse off accuse us of the same thing? What would someone in a third world country think of the lifestyle of a lower middle class American?\n\nIn the old westerns the bad guy wore black. In more nuanced films he's a silver-tongued liar. In real life we're blissfully unaware, willfully ignorant or too fearful of being without to care that our actions hurt others.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9jjpeq",
                                    "author": "FredFrield",
                                    "score": 1,
                                    "created_utc": 1653207930.0,
                                    "response": "No doubt about the fact that this is going to hurt a lot of people.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9ggcmz",
                    "author": "IndicaFruits",
                    "score": 2,
                    "created_utc": 1653145527.0,
                    "response": "our monetary policy is all about survival of the fittest. you can never rest in this environment, your wealth is always at risk, either through debasement or the blow-ups they eventually create.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9gknf1",
                    "author": "Zelgada",
                    "score": 3,
                    "created_utc": 1653147519.0,
                    "response": "I'm sincerely trying to give you constructive feedback here.\n\nYou're right about inflation, but you are too condescending and negative in your communication.  You are putting others' thoughts into your words (which is insulting at best).  If you want to better advocate against this problem, you should work on your communication.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9jo3jx",
                            "author": "luukdrent",
                            "score": 2,
                            "created_utc": 1653212020.0,
                            "response": "The communication is the main problem here to be honest if you ask me.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9gtjlc",
                            "author": "StrandedinaDesert",
                            "score": -2,
                            "created_utc": 1653151596.0,
                            "response": "Please Fuck off is that nice enough?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9h1l96",
                                    "author": "Zelgada",
                                    "score": 2,
                                    "created_utc": 1653155251.0,
                                    "response": "Lol.  who shit in your breakfast?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9k5q3p",
                                            "author": "norrismasters",
                                            "score": 2,
                                            "created_utc": 1653225150.0,
                                            "response": "I know right I was literally trying to understand what he is trying to say.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9kvj9t",
                                    "author": "lordhobbington",
                                    "score": 1,
                                    "created_utc": 1653237127.0,
                                    "response": "I can certainly think that this is enough for that they don't need anything more.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9gsiyl",
                    "author": "Ima_Wreckyou",
                    "score": 3,
                    "created_utc": 1653151131.0,
                    "response": "No shit they are not fond of something that requires prove of work",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9k8g7u",
                            "author": "sergeyasv777",
                            "score": 1,
                            "created_utc": 1653226611.0,
                            "response": "You are certainly write about it because it requires a lot of Magic lol.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9ie2wj",
                    "author": "arbalest_22",
                    "score": 1,
                    "created_utc": 1653179908.0,
                    "response": "I didn’t bother looking but r/antiwork sounds like a bunch of socialists/communists. Things like Bitcoin go against their programming.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ko3qp",
                            "author": "kasock",
                            "score": 0,
                            "created_utc": 1653233938.0,
                            "response": "Totally goes under the programming stop only but it will change a lot of stuff.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9geljn",
                    "author": "Benjamincito",
                    "score": 1,
                    "created_utc": 1653144722.0,
                    "response": "People dont want to listen to us when we say inflation is impacting their lived",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9kw72t",
                            "author": "ubermusaic",
                            "score": 1,
                            "created_utc": 1653237395.0,
                            "response": "I am so that it is going to impact on a very bad manner to be honest,.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9i6bll",
                    "author": "NotMiningBitcoin",
                    "score": 1,
                    "created_utc": 1653175648.0,
                    "response": "It was probably deemed off-topic because those anti-work dummies think crypto is a conservative thing instead of an anti-authoritarian thing.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9jiq29",
                            "author": "dandreano",
                            "score": 1,
                            "created_utc": 1653207037.0,
                            "response": "No doubt about the fact that Crypto is the most conservative thing about now.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9jj7i6",
                                    "author": "NotMiningBitcoin",
                                    "score": 1,
                                    "created_utc": 1653207483.0,
                                    "response": "I can see why kids who were 10 years old during Occupy Wall Street might think so.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9h2ri1",
                    "author": "HIMcDonagh",
                    "score": 1,
                    "created_utc": 1653155791.0,
                    "response": "I had the game figured correctly at 17 working for $3.10 an hour at a K-Mart. Right then, I decided to work for myself no matter what sacrifices it took. That $3.10 an hour taught me there’s a line between winners and losers in capitalism, and you don’t want to be caught on the wrong side of that line.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9jn80o",
                            "author": "wwww34324243",
                            "score": 3,
                            "created_utc": 1653211200.0,
                            "response": "The thin line is what everyone is lying on and it is the reason why everything is going to change.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9h5w7z",
                    "author": "ainklyspankly",
                    "score": 1,
                    "created_utc": 1653157267.0,
                    "response": "Why do you think we are banning contraceptives and abortions",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9hddz5",
                    "author": "Zealousideal_Lab537",
                    "score": 1,
                    "created_utc": 1653160893.0,
                    "response": "Oh so you are blaming other things but the rich?! \n\nHOW DARE YOU?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9hgjjp",
                    "author": "OrangeHODLr",
                    "score": 1,
                    "created_utc": 1653162447.0,
                    "response": "They seriously deleted it?  Man remind me to not go there.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9hzzso",
                            "author": "combocookie",
                            "score": 2,
                            "created_utc": 1653172308.0,
                            "response": "Dont go there",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9hh73u",
                    "author": "Wit_as_a_Riddle",
                    "score": 1,
                    "created_utc": 1653162767.0,
                    "response": "What will make people spend bitcoin when they can spend their inflationary fiat instead? To be clear I think bitcoin is amazing, but I want to hear what is the answer.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9hkowb",
                            "author": "voluntarygang",
                            "score": 2,
                            "created_utc": 1653164501.0,
                            "response": "Why would they need to spend it if they can spend shitty scammy fiat first. But if you meant after they run out of that then my answers are quite basic: hunger, cold, and other needs and wants.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9ku9fy",
                                    "author": "thfrey63",
                                    "score": 1,
                                    "created_utc": 1653236590.0,
                                    "response": "Basically right about the fact that they want everything to go on the dance floor.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9jyf63",
                            "author": "godersbtcyeah",
                            "score": 1,
                            "created_utc": 1653220576.0,
                            "response": "No this is not the real answer the real answer is that which is totally different from what we know.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9hnk32",
                    "author": "fellowpleb",
                    "score": 1,
                    "created_utc": 1653165936.0,
                    "response": "> so you lach onto one of the popular explanations for why this is. The rich man is bad! The government is bad! The capitalist system is bad! You are being exploited at your job! etc etc\n\n\nAh, this is why your post was removed. You went against their narrative. r/antiwork is a communist sub now similar to latestagecapitalism and worldnews, where you'll get shouted down and banned for having the gall to have an opinion .000001 nanometers to the Right as them. You offended a mod with your critical thinking skills. \n\n\n\nI'm surprised they didn't ban you outright, but if you tried posting it a second time they most certainly would have.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9kii2e",
                            "author": "JJFxy",
                            "score": 2,
                            "created_utc": 1653231441.0,
                            "response": "Particularly so about the fact that they have everything right now.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9j15gx",
                            "author": "time_dj",
                            "score": 1,
                            "created_utc": 1653192955.0,
                            "response": ">banned for having the gall to have an opinion .000001 nanometers to the Right as them\n\nlmao..",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9k5wop",
                                    "author": "shuramd",
                                    "score": 1,
                                    "created_utc": 1653225248.0,
                                    "response": "Will if you are going to do something like that then it is going to change everything.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9hwzv7",
                    "author": "aewhpdfym",
                    "score": 1,
                    "created_utc": 1653170752.0,
                    "response": "It's funny because you'll see a lot of inflation-related posts on the front page of reddit these days. People are starting to wake up to the fact that everything is getting expensive way too fast, but at the same time, they're celebrating how \" Bitcoin/crypto is crashing\" and how they knew it was a \"scam, ponzi, beanie babies, etc.\" all along when the answer to the inflation problem was in front of them all along. Oh well, at least we know that we're still in the early stages since the reddit hivemind hasn't caught on yet...",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9hz1f7",
                    "author": "greekswiss",
                    "score": 1,
                    "created_utc": 1653171814.0,
                    "response": "This was deemed off topic for antiwiork? Pull your fuckin heads out boys.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9k5gk0",
                            "author": "itrewsaqn",
                            "score": 1,
                            "created_utc": 1653225002.0,
                            "response": "It is very important to do that because it is a good problem.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9i69rk",
                    "author": "kitastrophae",
                    "score": 1,
                    "created_utc": 1653175622.0,
                    "response": "That’s good writing. \n\nCome…join us. \n\nr/wallstreetsilver",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9kisks",
                            "author": "MOVB5",
                            "score": 1,
                            "created_utc": 1653231569.0,
                            "response": "Write about it because I had seen a lot of stuff like that to be onest.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9jjkkc",
                    "author": "NotMiningBitcoin",
                    "score": 1,
                    "created_utc": 1653207807.0,
                    "response": "Antiwork contains the type of kids who unironically complain about \"the 1%\" without understanding the context around where that term came from, what the goals of Occupy Wall Street were, or how those goals overlap with the goals of crypto.\n\nThe establishment hijacked the Occupy movement with identity politics and the left completely took the bait and has been swimming around with the hook in its mouth ever since.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9k8un9",
                    "author": "xXShadowAssassin69Xx",
                    "score": 1,
                    "created_utc": 1653226823.0,
                    "response": "Otherwise great post….\n\nHowever gold also has a 2% inflation rate and other commodities inflation rates are even higher. And you get taxed to death with land, causing a similar loss in purchasing power albeit linear and not exponential. \n\nSo I really see bitcoin being the only solution to all these losses in purchasing power.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9gmojz",
                    "author": "Read-Moishe-Postone",
                    "score": -4,
                    "created_utc": 1653148451.0,
                    "response": "I can’t explain what’s in the mods’ heads at that sub. But as Marxist I can tell you that genuine Marxist theory knows all about “creeping inflation”. However, Marxist theory has better explanations for why creeping inflation is the target. It’s not just an arbitrary “policy” that the economy could function perfectly well, in fact better, without. It’s part and parcel of one unitary systematic whole: the capitalist economy-state. The explanations for why this is so, why creeping inflation is just one necessary part of a larger system that cannot function *at all* without all of its parts, is obviously beyond the scope of a Reddit thread, that’s why Marxists need to write massive tomes in order to explain how it all fits together.\n\nSuffice it to say the following. It is not *because* money (real money, not what you in your head decided is money) is what it is that we are unfree, that we live in an unfree society. It’s the other way around. The type of (very unfree) society we live is what makes money what it is, with all the insanities and perverse incentives that come with that.\n\nMarx wasn’t even the first to point this out. The Neapolitan economist, Galiani, made the same fundamental point in his treatise on money. It is the whole of society - not it’s laws and policies, but the fundamental nature of the social relations of power between its subjects - that determines the nature of money.\n\nThis is why you can’t change society by inventing a new kind of money and convincing people to use it. It takes a genuine social revolution to change society, and that social revolution must actually succeed in revolutionizing the relations of power that make up society - it can’t just put new people in charge, or replace old policies with new ones. It’s society that ultimately determines which policies “work” and which ones don’t - although no one can blame you for thinking it’s the other way around (that the policies and laws in place determine the nature of society). It’s society’s fundamental makeup of social relations that forces the “leaders” hands whether they like it or not - just as in days of old, the king *in theory* had complete arbitrary power to make any laws he desired, but in reality, his legitimacy and thus his power depended on choosing the right laws.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9jr0zl",
                            "author": "conordurkin",
                            "score": 1,
                            "created_utc": 1653214670.0,
                            "response": "There are going to best service things which are going to change everything,.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9gmpmh",
                    "author": "FeelTheFish",
                    "score": -1,
                    "created_utc": 1653148464.0,
                    "response": "It's not fiat, it's not the current system, it's greed as a constant human nature. Sadly, genetic self-preservation conflicts with the new paradigm of a global society.\n\nInheritance isn't fair either:\n\nImagine you are a baby, your rich parents put 100k in your account when you are born, you end your high school with retirement money. With no value produced.\n\n==\n\nThis takes everyone back to the big thought experiment of philosophy:\n\n\"If you had to create a new society right now, given the resources that we have as a whole planet, BUT in the process of creating, you will never know in which social class, which gender, race, whatever. How would this rules be?\" They would tend to communism for sure. (Not defending communism since I think it's utopian due to the greed constant)",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9gqotv",
                            "author": "swfsql",
                            "score": 1,
                            "created_utc": 1653150286.0,
                            "response": "I don't get why inheritance wouldn't be fair. Then donations aren't fair either, because inheritance is just a form of donation.\n\nAnd what if a person takes everything they have to the grave (instead of giving it to someone). Would this be better in your view? If it does, then I don't see the benefits of it. If it doesn't, then people also shouldn't be free to destroy what they own?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9guad8",
                                    "author": "FeelTheFish",
                                    "score": 2,
                                    "created_utc": 1653151938.0,
                                    "response": "It depends on what you consider fair. I won't give much inheritance to my kids due to my ideals. Inherit as much as you need to create value or don't.\n\nAlso I think a donation isn't something I would relate to inheritance, since donating is effectively resource allocation towards stuff that isn't as profitable as other things, like making luxury cars for ex.\n\nDepends on the quality of the donation\n\nTo the grave no, I would redistribute an excedent based on a certain threshold like 10m, so say you have 100, you give 90 to stuff like but not only: free housing (increases street safety and overall economy to have people not paying rent/mortgage)",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9jllsz",
                                            "author": "rtjhrtgbdfv",
                                            "score": 4,
                                            "created_utc": 1653209694.0,
                                            "response": "They are already taking a lot of stuff from past so it is not like they need more inheritance.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i9hargy",
                                            "author": "swfsql",
                                            "score": 1,
                                            "created_utc": 1653159624.0,
                                            "response": "I see.. For me personally, \"fair\" is whatever wasn't physically forced. So for me, whatever the person does with their money (consume all of it, burn it, donate it, etc) is fair as long as someone else doesn't take away from them against their will.\n\nBut I think we have different definitions for fairness because in your view, it's more related to a \"starting-point\" thing. If I had to guess, I think you relate fairness to a starting \"equity\" among people. My view is different, more like \"nobody really have any sort of rights to have a 'good' starting point whatsoever\", so I see inheritance exactly as a donation.\n\nBtw Bitcoin touches very deeply into this, since it can make a reality that people can effectively decide whether they wanna take their bits to the grave, or donate/\"let-be-inherited\" without intervention from outsiders. For me, I think this property align well with my values..",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9k0uwm",
                                                    "author": "koenbruin",
                                                    "score": 1,
                                                    "created_utc": 1653222223.0,
                                                    "response": "The reality is that inventions depends on the mindset as well so the mindset is right then the inventions are going to be right\n\nThis is the only reason why money is the main important position holder and we have to see that as well.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i9hmsd9",
                                                    "author": "FeelTheFish",
                                                    "score": 0,
                                                    "created_utc": 1653165551.0,
                                                    "response": "It's not particularly the \"starting-point\" thing, I have a more utopian view of the world. In a fair society, people would ask for what they deserve, no more, no less. I think this as many society sub-systems, in which, if everybody took this \"fair\" choice, everybody would be happier, due to the many changes to this small subsystems that conform a broader one.\n\nFairness and freedom will always conflict though, since fairness derives from conflicts of interest in the majority of the cases, if not all. So it's a hard theme to debate, because I also have that \"greed as constant\" thing, in which my individualism conflicts with that analysis. That's why I also like bitcoin.\n\nBut the reason I like bitcoin, is because this utopic vision of reality, is well.. utopic. I don't trust on how the state allocates resources, and I think we should re-define how resources should be allocated for the betterment of society.\n\nWealth inequality is needed too in our current economic system, at least untill we manage to automate all of humanities basic needs and be able to pay a universal basic income due to those automations. We are far from that, since the focus isn't there.\n\nI think everybody should have a better standing ground, and that individual actions can help the broader system.\n\n&#x200B;\n\nOne last thing, quoting:\n\n>\"nobody really have any sort of rights to have a 'good' starting point whatsoever\"\n\nI completely agree with this sentence, but that's what I mean by seeing donations differently. If resources were allocated correctly, instead of the lucky kid (he still should receive a sum), we could help with the broader system, eventually leading to more global happiness.\n\nBut yeah, fairness and freedom will always clash, and It's another balance to have in mind.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9kqxxi",
                                                            "author": "ZenithCoin",
                                                            "score": 1,
                                                            "created_utc": 1653235165.0,
                                                            "response": "Complete depend on the mindset and how they are going to change it because prospective depends on everything around you\n\nNeed to have a complete balance on the mind and the work you are doing actually it makes a complete difference.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9jotxy",
                                    "author": "adhgsw",
                                    "score": 2,
                                    "created_utc": 1653212678.0,
                                    "response": "Completely depend on how they are going to do it and how more they are going to do.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9hcmns",
                    "author": "SmoothGoing",
                    "score": -1,
                    "created_utc": 1653160526.0,
                    "response": "There is no cage except the one in your mind. If you don't want lower wage don't accept it. If you don't want wages at all start your own business. Many people are successful in the same environment of purchasing power of their dollars dwindling away at the same rate as everyone else's.\n\nYour crappy earning capacity is your own fault. Maybe your parents' fault too. It's not the rich people's fault. Observe and understand the world. Identify opportunities. And take appropriate action. Crying on Reddit isn't part of it. And forget wage slave notion forever. You don't know what slavery was and still is. Hint: it was an atrocity. Read a history book.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9kwmge",
                            "author": "evertonhs1",
                            "score": 1,
                            "created_utc": 1653237571.0,
                            "response": "I really wish if I could read some books on that can you please provide me link for name of the book so that I can get the reference\n\nThank you in advance but also tell me that what should I read and how long should I read as well.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9gj0l0",
                    "author": "FutureNotBleak",
                    "score": 0,
                    "created_utc": 1653146760.0,
                    "response": "We’re moving towards a zero inflation economy.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9jo31u",
                            "author": "mol2483",
                            "score": 2,
                            "created_utc": 1653212008.0,
                            "response": "This is not a popularity because market is increasing and price deficit is also increasing with that so it is not going to happen\n\nHow to completely understand icon with and you can tell that a bit of inflation is required for the economy to grow stronger.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9jot4u",
                                    "author": "FutureNotBleak",
                                    "score": 1,
                                    "created_utc": 1653212657.0,
                                    "response": "Bitcoin is zero inflation",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9h1zvb",
                    "author": "Litecoin-CEO",
                    "score": 0,
                    "created_utc": 1653155438.0,
                    "response": "The video you posted seems very anti-human to be honest. Even if the arithmetic is correct and it is considered a \"truth\", it still feels very anti-human. I wonder what happened to this guy in his life to have this mindset.\n\nAll this talk about having to reduce population is anxiety enducing. Even thinking about something like this seems really morally wrong. Whoever gets to decide does it in their self interest. \n\nThe part where he says: \"What part of our lives is better by increasing population?\"\n\nWell, what about all the luxuries we are enjoying today like clean water,  abundant food and services. The more people we have, the better everyones life is going to get since there are more of us solving problems.\n\nWe just need a non-pollution energy production. With abundant energy all other problems are taken care of.\n\nThere are some good points in this video, but overall I think content like this is harmful because it attracts more nihilism.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9hn9e7",
                            "author": "Qlide",
                            "score": 5,
                            "created_utc": 1653165785.0,
                            "response": "The video is anti- perpetual growth in any and all aspects. Nothing can grow forever, scarcity is a limiting factor for most all resources.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9j5z4p",
                                    "author": "Litecoin-CEO",
                                    "score": 2,
                                    "created_utc": 1653196328.0,
                                    "response": "Yes and that's fine, but that doesn't mean that people are the problem.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9j6ck1",
                                            "author": "Qlide",
                                            "score": 1,
                                            "created_utc": 1653196612.0,
                                            "response": "The problem lies in perpetual growth vs scarcity of resources. You cannot have an infinite amount of people on this planet.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9j7cmf",
                                                    "author": "Litecoin-CEO",
                                                    "score": 2,
                                                    "created_utc": 1653197375.0,
                                                    "response": "It's not an issue, we have 2.3 acres for every person on earth right now. Yes, for every person. If developing countries already have dwindling population it means that if you get everyone to a certain level of welfare, the population growth will slow and stabilize. I would even be more worried about population collapse.\n\nAlso we are making things more efficient every year and if the worry is that we will run out of \"resources\". We will find a way to get more of them from outer space or make technological advances to need less of resources.\n\nLife will find it's way and having this kind of anti-human mindset is not progressive at all.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9jf251",
                                                            "author": "Qlide",
                                                            "score": 1,
                                                            "created_utc": 1653203774.0,
                                                            "response": "I need you to know that I am agreeing with your point: people are not the problem. \n\nAn ever increasing \"population\" of ANYTHING, living organism or not, is not sustainable and the expectation of exponentially growth is just even more preposterous!\n\nWe have enough food produced right now to feed more than everyone on the planet. We have the space, even the buildings, to house everyone on the planet and provide then with shelter. We have enough water for everyone to drink clean water everyday. In some cases, we can't get it to people that need it. In other cases, we won't because it is not financially stable for consistent economic growth to occur.\n\nOur current system values money, capital, potential economic growth over the needs of human beings.\n\nCapitalism is the problem. Constantly demanding economic growth from companies as the measurement of success or value to the world is the problem.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9jh2zr",
                                            "author": "vpadwal",
                                            "score": 1,
                                            "created_utc": 1653205548.0,
                                            "response": "Will you can see a lot of major problems which are going to happen because of this same stuff only and this is why it needs to be changed\n\nThis is the only reason why people are trying their best to make the changes out of it so that they can go out.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9i9mp4",
                            "author": "Rambop22",
                            "score": 1,
                            "created_utc": 1653177471.0,
                            "response": "The population is growing, especially in the last 100 years..... and no it has not been a good thing for humans or this planet. Countries like Uganda, Nigeria, Burundi, and India have populations that are mostly 40 years old and under (mostly a young population). Developing countries are exploding in population, while industrialized nations have a dwindling population. People in dirt poor countries that have a hard time feeding themselves, yet having 6 or 7 kids is seen as a \"blessing\". We need population reduction... or at least reduction in places that have corrupt governments that care less if 20% of children under 5 die.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9kbw9x",
                                    "author": "btcpedram",
                                    "score": 1,
                                    "created_utc": 1653228349.0,
                                    "response": "You are right about the fact that most of the children die when they are born because they are not having good kind of hospital facilities\n\nAnd one of the major problem I can see right now is the education this is the main issue I can see.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9k1k3c",
                            "author": "lupeng1700",
                            "score": 1,
                            "created_utc": 1653222683.0,
                            "response": "Write about the fact that because population plays a major role in the inflation as well\n\nIt is very important for a population to do good things for the economy so that country can go at a good place.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}