{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uwci8h",
            "title": "Keeping Wallet Seed Phrase safe?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/uwci8h/keeping_wallet_seed_phrase_safe/",
            "author": "fckccpandXi",
            "created_utc": 1653345966.0,
            "score": 5,
            "num_comments": 37,
            "subreddit": "BitcoinBeginners",
            "selftext": "is it safe to keep my wallet seed phrase on a smart phone I no longer use and set on airplane mode?",
            "stickied": false,
            "comments": [
                {
                    "id": "i9qsnq4",
                    "author": "fakeplasticdaydream",
                    "score": 8,
                    "created_utc": 1653348584.0,
                    "response": "Not a good idea. 5 years from now what if the phone doesnt turn on. Also still vulnerable.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9quj41",
                            "author": "fckccpandXi",
                            "score": 1,
                            "created_utc": 1653349513.0,
                            "response": "good call didnt think of that",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9z1hur",
                            "author": "Remarkable_News2455",
                            "score": 1,
                            "created_utc": 1653506337.0,
                            "response": "It's hard to keep that long",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9qrqbf",
                    "author": "sciencetaco",
                    "score": 6,
                    "created_utc": 1653348127.0,
                    "response": "Use a piece of paper or stamp it into metal plates. Why store it electronically?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9qvai0",
                            "author": "fckccpandXi",
                            "score": 1,
                            "created_utc": 1653349887.0,
                            "response": "Im just thinking of other ways of storing it but yes I think the plate is a great idea",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9qvmfa",
                                    "author": "bitusher",
                                    "score": 3,
                                    "created_utc": 1653350054.0,
                                    "response": "https://jlopp.github.io/metal-bitcoin-storage-reviews/\n\nhttps://www.reddit.com/r/BitcoinBeginners/comments/unjuyp/metal_seed_storage/",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9qw0kw",
                                            "author": "fckccpandXi",
                                            "score": 2,
                                            "created_utc": 1653350249.0,
                                            "response": "wow thank you for this!",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9qqh04",
                    "author": "Harrison_w1fe",
                    "score": 2,
                    "created_utc": 1653347508.0,
                    "response": "No",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9s18x2",
                    "author": "igadjeed",
                    "score": 2,
                    "created_utc": 1653373443.0,
                    "response": "Phone storage is flash memory, not reliable",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9snyy0",
                    "author": "aq9600947",
                    "score": 2,
                    "created_utc": 1653392671.0,
                    "response": "I think this is not a good idea. I would do that if I wanted to lose access. LOL",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9qno1c",
                    "author": "bitusher",
                    "score": 1,
                    "created_utc": 1653346144.0,
                    "response": "No. Your backup seed words should never be stored digitally as a rule of thumb. What wallet as you using to create them ?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9qoac4",
                            "author": "fckccpandXi",
                            "score": 1,
                            "created_utc": 1653346444.0,
                            "response": "even if its not connextwd to the internet?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9qqdf7",
                                    "author": "bitusher",
                                    "score": 4,
                                    "created_utc": 1653347459.0,
                                    "response": "Correct. Never digitally because of malware and bitrot concerns. Is there a reason you want to store those 12-24 words digitally ? Someone in your home that you don't trust might find your backup?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9qudw4",
                                            "author": "fckccpandXi",
                                            "score": 1,
                                            "created_utc": 1653349440.0,
                                            "response": "prob not get hardware wallet anytime soon and writing it down on paper and hiding somewhere seems a little sketch... just thinking of different ways to hide",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9quley",
                                                    "author": "bitusher",
                                                    "score": 1,
                                                    "created_utc": 1653349544.0,
                                                    "response": "It would exist in your mobile wallet and on paper typically. This way if you lose your phone or it gets damaged you have a backup on paper. Having the private keys represented only in 1 place is not a \"backup\" as you only have one copy",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9qwzuu",
                                            "author": "cryptoripto123",
                                            "score": 1,
                                            "created_utc": 1653350728.0,
                                            "response": "Bitrot is a problem with anything digital. However, the solution to bitrot isn't to not store anything digitally. Important documents, photos, passwords, etc are all stored digitally. The solution is redundancy and backups on top of data integrity checking (any datacenter will have this).\n\nFor personal data, it is a risk, and that's why home NAS systems also have some sort of redundancy built in as well as data scrubbing in addition to advanced file systems with healing capabilities.\n\nBitrot isn't a myth, but it's also extremely low likelihood. If it's that big of a problem we'd never be using computers and phones to conduct business.\n\nYour odds of misplacing a physical backup are likely many orders of magnitude higher than data degradation. As with all digital copies, multiple copies are a must.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9qxop7",
                                                    "author": "bitusher",
                                                    "score": 1,
                                                    "created_utc": 1653351078.0,
                                                    "response": ">The solution to bitrot isn't to not store anything digitally. \n\nthe keys would be stored digitally in either the hardware wallet or mobile wallet for smaller amounts . The backup is the physical representation. \n\n> The solution is redundancy \n\nPart of the importance in backups is having the data stored in different media formats , thus the representation digitally in the HW wallet, and the paper backup\n\n    3: Create one primary backup and two copies of your data.\n\n    2: Save your backups to two different types of media.\n\n    1: Keep at least one backup file offsite.\n\n> but it's also extremely low likelihood.\n\ndataloss is very common in DVDRWs , usb flash memory , and hard drives \n\nUsing a RAID solutions mitigates some of these concerns but the data always needs to be represented differently regardless. The fact that you need to write down the passphrase regardless due to human memory being so fallible makes 100% digital representation somewhat pointless and introduces a new set of problems with malware and data integrity checks",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9yv4xz",
                                                            "author": "cryptoripto123",
                                                            "score": 1,
                                                            "created_utc": 1653503805.0,
                                                            "response": "> the keys would be stored digitally in either the hardware wallet or mobile wallet for smaller amounts . The backup is the physical representation. \n\nSure, but you bring up bitrot everytime anything digital gets brought up. Anything can happen. With quantum mechanics a bowling ball has a finite chance of passing through a bank vault if you try enough times. But that doesn't mean it's likely.\n\nAnd yes I agree with 3-2-1.\n\n>dataloss is very common in DVDRWs , usb flash memory , and hard drives \n\nData loss happens with those forms of media but again you haven't talked probability at all. If you're talking about crypto keys, 3-2-1 absolutely should apply. However for people who aren't that well versed in backups, at a minimum I think this is why cloud is actually more valuable. Physical backups require you to be there. If you're traveling, abroad, or your country is on fire (Ukraine), then accessing physical backups may not be feasible. Cloud backups are a real solution people should consider. The risk of a Google Drive file being corrupted is likely orders of magnitude lower than even if you had a personal 3-2-1 strategy. There's no way your personal backup strategy is going to be more resilient than that of a trillion dollar company.\n\nBottom line is risks are everywhere. My point is to evaluate risks holistically. I think too many people often highlight malware but completely ignore and don't accurately weigh the risks of physical backup loss. The vast majority of people aren't using stamped plates with 3 copies. Paper copies are far easier to lose and mess up with than a digital copy.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9qnaue",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653345967.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9qvpf0",
                    "author": "cryptoripto123",
                    "score": 1,
                    "created_utc": 1653350096.0,
                    "response": "I know many are against digital storage, but **if you must**, here are several options:\n\n* Encrypted file like a 7ZIP file with AES-256 encryption + strong passphrase\n\n* Password manager (reputable one) like Bitwarden, 1Password, LastPass, etc. You better lock down your account hard (2FA, strong master password, etc.)\n\n* Use the BIP39 passphrase and store it separately from your seed phrases. In the unlikely event one is compromised, you don't automatically lose all your funds.\n\nInteresting that on the /r/1Password sub, [most people seem comfortable enough to do it](https://www.reddit.com/r/1Password/comments/s786sz/anyone_storing_crypto_wallet_seed_phrases_in/).",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9qx6mw",
                    "author": "blaze1234",
                    "score": 1,
                    "created_utc": 1653350823.0,
                    "response": "Never digitise your Seed Recovery information, except to a hardware wallet or other dedicated airgapped device. Certainly never on anything capable of connecting to the internet.\n\nEtched onto steel plates, stored in multiple secure locations far from home, secure passphrase separately from 24-word mnemonic",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9r439c",
                    "author": "Ezzmon",
                    "score": 1,
                    "created_utc": 1653354216.0,
                    "response": "No.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9rad9l",
                    "author": "planet_hallows",
                    "score": 1,
                    "created_utc": 1653357239.0,
                    "response": "Burn a tails CD and boot a laptop into tails. Don't connect it to any network. Put your seed phrase into a few USB keys and a few 8cm CDs. Stash those in one more safety deposit boxes. To be really safe, gpg-encrypt the passphrase with different keys in each safety deposit box and store the private key for each of n the other safety deposit boxes. If you have 3 of them, you can set it up so that access to any two is required to recover the mnemonic but loss of any one doesn't make you lose it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9sblv8",
                    "author": "ouyangnna",
                    "score": 1,
                    "created_utc": 1653382704.0,
                    "response": "handwritten memorize",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9sf9gr",
                    "author": "MuchTemperature6776",
                    "score": 1,
                    "created_utc": 1653386079.0,
                    "response": "Never store it digitally unless it’s on a device that won’t have an internet connection directly and won’t be accessible by simply possessing it etc.\n\nI have two safes stored in two different locations that has everything I need to recover my things on encrypted usb sticks, as well physical copies of some things needed.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9st9pa",
                    "author": "pkol_mining",
                    "score": 1,
                    "created_utc": 1653395842.0,
                    "response": "Post it in chat and we will safeguard it for you 💪",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9sts4r",
                    "author": "Spideysam11065",
                    "score": 1,
                    "created_utc": 1653396126.0,
                    "response": "As long as the wallet is empty you can keep it anywhere",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9th2zp",
                    "author": "BlockchainBlockhead",
                    "score": 1,
                    "created_utc": 1653406800.0,
                    "response": "It's possible to turn on Bluetooth and WiFi with Airplane mode on. Don't do it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9u3f9u",
                    "author": "ApricotAcrobatic7761",
                    "score": 1,
                    "created_utc": 1653415970.0,
                    "response": "I use Guarda (non-custodial wallet, works with private keys and backup files, password protected). I've saved them on a piece of paper, probably will keep those in a plastic container or folder later on. Portfolio may be small but gotta keep it safe.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9wl2ql",
                    "author": "AskEmberAnything",
                    "score": 1,
                    "created_utc": 1653459181.0,
                    "response": "If you're storing a wallet seed phrase on a smartphone, you should be okay as long as proper precautions are taken. You may actually turn your phone into a keystone! Kindly see the [steps, things to keep in mind, and others' insights here](https://ember.help/questions/505#answer-844) as guide.\n\nNevertheless, always take caution that electronic devices are prone to failure and it's always best to have backup.\n\nFeel free to respond if you have any follow-up questions!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9qrkp7",
                    "author": "DinaVolokovaj0u",
                    "score": 0,
                    "created_utc": 1653348052.0,
                    "response": "I think it is safe, it's almost the same as a cold wallet if it is not connected to internet. Just make sure to completely reset your device and not connect it to any internet source from the beginning :)",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9quh9x",
                            "author": "fckccpandXi",
                            "score": 1,
                            "created_utc": 1653349488.0,
                            "response": "thats kinda what I thought as well but I will rethink",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}