{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uxnf90",
            "title": "Trying to exchange BTC into fiat please help!",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/uxnf90/trying_to_exchange_btc_into_fiat_please_help/",
            "author": "_-psyduck-_",
            "created_utc": 1653502367.0,
            "score": 7,
            "num_comments": 12,
            "subreddit": "BitcoinBeginners",
            "selftext": "Hey, I'm thinking of sending some of my BTC (worth around 70$) from my wallet to Binance to exchange into fiat or maybe some other coin. \n\nIn the wallet it shows the fees is $0.10 - $0.50 but I've read that there are also hidden fees that exist.\n\nCan someone please help me and tell if I have to pay any fees further on?",
            "stickied": false,
            "comments": [
                {
                    "id": "i9yupps",
                    "author": "ndgoLiberty",
                    "score": 2,
                    "created_utc": 1653503643.0,
                    "response": "Just use the minimum fee it’s like $0.10 Binance is gonna charge you whatever they want.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9yxzz1",
                            "author": "_-psyduck-_",
                            "score": 1,
                            "created_utc": 1653504933.0,
                            "response": "But I don't wanna end up putting my money into Binance and getting it stuck because the high exchange fees",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9z1jmr",
                    "author": "igadjeed",
                    "score": 2,
                    "created_utc": 1653506357.0,
                    "response": "Binance will charge 0.1% (about 7 cents) to trade your BTC to fiat, and fiat withdrawal should be free. Their fees are on their Web site",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9z319m",
                            "author": "_-psyduck-_",
                            "score": 1,
                            "created_utc": 1653506962.0,
                            "response": "Okay, what about exchanging it to a different coin? Do you have any idea how much it would cost?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9zhcn5",
                                    "author": "igadjeed",
                                    "score": 1,
                                    "created_utc": 1653512790.0,
                                    "response": "That would also cost 0.1% and then some unknown fee to withdraw the coin to your own wallet. Their fees are on their Web site",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9z9f3c",
                    "author": "marshyr3d1and",
                    "score": 2,
                    "created_utc": 1653509530.0,
                    "response": "Just take the various routes down the conversion/swapping paths and you will come to the final click when it tells you what fee would be charged, then you'll know without it costing you anything",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9zaphh",
                            "author": "_-psyduck-_",
                            "score": 1,
                            "created_utc": 1653510054.0,
                            "response": "I don't understand. What swapping paths are you talking about? Please elaborate I'm a beginner :(",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9zbvez",
                                    "author": "marshyr3d1and",
                                    "score": 1,
                                    "created_utc": 1653510522.0,
                                    "response": "Convert your btc to fiat using the binance bridge (see binance tutorial on their website) then cash out. Follow this all the way to the last screen and it will show you the fee that you'll be charged - you will then know the cost of doing it this way. You can do a similar thing with convert (from btc to some other coin). Just keep playing with various options and compare the fees that would be charged. I find this better than looking at fee listings coz there always seems to be some fee hidden when you get to the end",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9zgznk",
                                            "author": "_-psyduck-_",
                                            "score": 1,
                                            "created_utc": 1653512642.0,
                                            "response": "I can't risk the money though, I'm a broke teenager trying to invest in crypto, If I lose most on fees I'll be fucked. Thanks for your reply though.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9yrgtq",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653502369.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}