{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uthzey",
            "title": "Hardware Wallet",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uthzey/hardware_wallet/",
            "author": "Domingo_salut",
            "created_utc": 1653009331.0,
            "score": 2,
            "num_comments": 14,
            "subreddit": "Bitcoin",
            "selftext": "I started to buy Bictoin in November and I never left any on exchange. I am using Exodus for wallet but now my stack is big enough that I would feel safer with a hardware wallet. I also read that Exodus could freeze my coin or whatever if I did not kyc...   \nAnyway, I don't want anything fancy nor expensive, just basic and quality. Any suggestion?",
            "stickied": false,
            "comments": [
                {
                    "id": "i99yey3",
                    "author": "Ok_Aerie3546",
                    "score": 5,
                    "created_utc": 1653011216.0,
                    "response": "Ledger nano s. Exactly what you want, not fancy, just basic security.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9a1j12",
                            "author": "Domingo_salut",
                            "score": 1,
                            "created_utc": 1653012748.0,
                            "response": "Thanks, with which wallet? ( just btc)",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9a87hl",
                                    "author": "Ok_Aerie3546",
                                    "score": 1,
                                    "created_utc": 1653016123.0,
                                    "response": "I just use ledger live, it feels the easiest. They also have a mobile app that only lets you view and recieve bitcoin.\n\nLedger nano s is by far the easiest to set up and there isnt much to confuse the user.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9aw6wm",
                                            "author": "dlq84",
                                            "score": 2,
                                            "created_utc": 1653032752.0,
                                            "response": ">They also have a mobile app that only lets you view and recieve bitcoin.\n\nYou can use USB OTG-adapter with the Nano S (at least with Android). Or get Nano X with bluetooth.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i9be8nm",
                                            "author": "Massive_Norks",
                                            "score": 1,
                                            "created_utc": 1653046659.0,
                                            "response": "The only downside is that you have to move house and change your phone number after ordering.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i99z1kt",
                    "author": "ResolutionFirm9228",
                    "score": 5,
                    "created_utc": 1653011519.0,
                    "response": "Exodus could freeze my wallet - if you say this then you don’t understand how blockchain and private keys work and what a non custodial wallet is.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9bc7da",
                            "author": "MalvinaLiebig",
                            "score": 1,
                            "created_utc": 1653045459.0,
                            "response": "They use changelly for exchange api and changelly is a kyced exchange",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i99wyr6",
                    "author": "Amoci",
                    "score": 3,
                    "created_utc": 1653010515.0,
                    "response": "SeedSigner or ColdCard",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i99vf0o",
                    "author": "TooSweetForLife",
                    "score": 2,
                    "created_utc": 1653009767.0,
                    "response": "Ledger Nano S\n\nhttps://shop.ledger.com/products/ledger-nano-s\n\nIt's what you are looking for.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i99uni9",
                    "author": "IfUbildItHeWillCom",
                    "score": 1,
                    "created_utc": 1653009391.0,
                    "response": "Ledger",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i99x9wr",
                    "author": "life762",
                    "score": 1,
                    "created_utc": 1653010664.0,
                    "response": "No frills, popular, easy to use, inexpensive.. Get a Trezor Model 1.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ad5oy",
                    "author": "shwirv",
                    "score": 1,
                    "created_utc": 1653018882.0,
                    "response": "I use the original Trevor wallet and I can't complain. It works, and the feeling is afety it gives me is priceless.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uthxet",
            "title": "People who say you can't use BTC in real life are ignorant",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uthxet/people_who_say_you_cant_use_btc_in_real_life_are/",
            "author": "alclab",
            "created_utc": 1653009154.0,
            "score": 52,
            "num_comments": 56,
            "subreddit": "Bitcoin",
            "selftext": "So I'm fully invested in BTC and have believed for a while that it's main use is as a store of value specially against inflation. \n\nHowever I had a weird thing happen today as I couldn't buy from an online store (CBD) I've purchased before with my regular visa/Mastercard cards, yet saw the store accepted BTC.\n\nDecided to try it out and it worked no problem. It's amazing that with it's vast global network MC could not approve the payment (credit was more than fine) yet BTC network had absolutely no problem. \n\nI almost immediately bought some more tasty dips of BTC mind you, but it's quite a simple proof that it's not just a sore of value, or a hedge against inflation, or a way to transfer value internationally. It's good for all of that and more.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9aeor2",
                    "author": "Nada_Lives",
                    "score": 25,
                    "created_utc": 1653019798.0,
                    "response": "Satoshi gave us Bitcoin as honest, useful money. Some of us are starting to realize this",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9a1qke",
                    "author": "jeywgosjeb",
                    "score": 12,
                    "created_utc": 1653012852.0,
                    "response": "It’s whatever is convenient for an argument is what I’ve noticed. But no it’s not super applicable for spending at the moment, it won’t be until it’s price stabilizes more. \n\nBut soon my friend soon",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9bsfk9",
                            "author": "BlockChainR3volution",
                            "score": 1,
                            "created_utc": 1653053658.0,
                            "response": "No. It never will be. It will forever be a rarer and scarcer asset…. Please dont use ur bitcoin as “money”.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9as6yh",
                    "author": "infopocalypse",
                    "score": 12,
                    "created_utc": 1653029323.0,
                    "response": "The number of people who are sleeping on or purpose fully ignoring Lightning is staggering. I can't believe how many idiotic comments I've seen on BTC scaling/# of transactions that completely leave out LN. LN is a complete game changer it's own right. Just being able to build on lightning is huge. You can't build something on the visa/Mc network. You might be able to accept it but actually building on it is completely different.\nPeople don't get that triple layer accounting is the biggest accounting (the world runs on ledgers) innovation in thousands of years.\nPeople don't get that instant settlement is huge. When you swipe your card it can be a month before the vendor gets it's money normally. And has 2-3% of the sale taken out of it.  \nPeople don't understand how big cutting out all the middlemen and ignoring jurisdictional red tape is. Western Union has to get banking licensing/legal teams and so on for every last country it operates in. \nAnyone wondering about LN and btc as money should check out Jack Mallers at the BTC 2022 conference explaining how sending money and settlement traditionally works.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9bsm9w",
                            "author": "BlockChainR3volution",
                            "score": 1,
                            "created_utc": 1653053739.0,
                            "response": "No its not staggering. It is still a new. Very very form of currency and this is where people get rich…. Like the dotcom boom in the 90s.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9auuek",
                    "author": "Fizzifish",
                    "score": 2,
                    "created_utc": 1653031558.0,
                    "response": "Of course you can use BTC in real life. It’s an issue of how widely adopted it is.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9bc85q",
                            "author": "OffThread",
                            "score": 1,
                            "created_utc": 1653045472.0,
                            "response": "There are a plethora of third parties that will instantly convert bitcoin to debit cards and gift cards. Stores currently don't need to adopt bitcoin for users of bitcoin to spend bitcoin there by third-party.  I'd of course love to see them keep their coin, only time will tell.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9bdaxo",
                    "author": "arenosame",
                    "score": 2,
                    "created_utc": 1653046115.0,
                    "response": "Lets not forget how much effort and investment requires to be entrepeneur and how difficult is to get credit and finance for the businesses. BTC allows businesses to save up and refinance themselves too. Another use case scenario. Buckle up. We are at the beginning.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ar9x5",
                    "author": "infopocalypse",
                    "score": 6,
                    "created_utc": 1653028591.0,
                    "response": "There seems to be an uptick of anti bitcoiners commenting in this sub. I ve made pretty pedestrian comments about using btc as money that gets 10 down votes, 15 up votes. But it is still weird that 10 people in a btc forum would down vote just mentioning btc use cases. But it's reddit.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9aw2js",
                            "author": "5liveR",
                            "score": 2,
                            "created_utc": 1653032644.0,
                            "response": "maybe its bc reddit seems to have many leftists. Something similar happened to me before, where I pointed out a clear fact about free markets being more efficient than Govts. and got alot downvoted. Which lead me to think: that can only come from the left.\n\nThose people need more time to understand Bitcoin, you know, its so antithetical to their world view. They are not bad people, thats why we must be more pacient with them.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9awg56",
                                    "author": "Alesi42",
                                    "score": 4,
                                    "created_utc": 1653032978.0,
                                    "response": "Why should the left be against bitcoin, honest question.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9axsz4",
                                            "author": "5liveR",
                                            "score": 6,
                                            "created_utc": 1653034202.0,
                                            "response": "Exactly. They shouldn't. Bc if its all about fairness and equal oportunities there is not better way to achieve it than Bitcoin.\n\nI suppose the problem with a big part of the left is that they are obsessed with equality of outcome, instead of equality of oportunities. And to achieve this we have to create more regulations and give more power to the state. You can see the new wave of young lefties from university with all about \"quotas\" imposed on companies and other organizations to hire their staff based on what they look like (or what they identify as) and not for who they are or their skills. The climate hysteria belief also seems to have most success with the left, so \"bitcoin is using too much electricity\"\n\nI don't wanna get into the debate of right vs. left, both have their dis- & advantages. There has been times in the past where the left was the brighter option for humanity.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i9b7kkv",
                                            "author": "BTCMachineElf",
                                            "score": 3,
                                            "created_utc": 1653042290.0,
                                            "response": "As a leftist bitcoiner myself..\n\nThe leftists against bitcoin are sensitive to environmental FUD, and not motivated to research or consider both sides. When I tell them bitcoin is already working as a green power subsidy, they don't understand and don't care.\n\nThere is also a certain prejudice against bitcoin due to the libertarian support.\n\nIt is terribly disappointing that they are complacent about fiat money, despite caring so much about it's effect (low wages, inflation, poverty).",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9bmvy3",
                                                    "author": "52576078",
                                                    "score": 1,
                                                    "created_utc": 1653051132.0,
                                                    "response": "I find a lot of left wingers also have a psychological thing around money and making money, and consider it a dirty word.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9axlgu",
                                    "author": "MrSommerfeld",
                                    "score": 3,
                                    "created_utc": 1653034014.0,
                                    "response": "Maybe you get downvoted because you get political when btc is objectively an apolitical technology",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9br9uf",
                                            "author": "5liveR",
                                            "score": 1,
                                            "created_utc": 1653053147.0,
                                            "response": "yes, maybe. Wasn't my intention though, but sometimes its hard bcos when you wanna talk about economics you end up touching some **politics**. Its unavoidable. Bitcoin could be defined as the perfect expression of what money should be, but its also a clear expression of libertarian ideology and the Austrian School of Economics",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9br10u",
                            "author": "brawnkoh",
                            "score": 1,
                            "created_utc": 1653053038.0,
                            "response": "I'm not an anti-bitcoiner. I own bitcoin. But sometimes the logic of people here is like they're living in some sort of alternate reality. It's a weird culture.\n\nAlso, feel free to commence with the downvotes.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9a4213",
                    "author": "VPNApe",
                    "score": 3,
                    "created_utc": 1653014003.0,
                    "response": "I heavily invest in BTC and still say that it's mostly useless. \n\nI can't use it to buy ANYTHING in my town, or the next town, or the next. The websites that accept it are also pretty sketch. \n\nEven if stores did accept it, there's no way in hell I'm using Bitcoin over a rewards credit card. Bitcoin doesn't even meet 2% cash back let alone a $500 new card bonus for spending 3k. \n\nFor all intents and purposes it's USELESS to 99.99% of the developed world.\n\nThat being said I expect that all to change over the next decade as adoption picks up exponentially.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9a9nfd",
                            "author": "thefullmcnulty",
                            "score": 6,
                            "created_utc": 1653016909.0,
                            "response": "I’ve paid multiple people for services rendered with bitcoin this year. One requested it. The other accepted it after I floated the idea. \n\nI’ve also purchased a hardware wallet with bitcoin and a few shirts from Lightning.store with bitcoin via Lightning. \n\nI’ve also taken a usd loan using my bitcoin as collateral last year. Worked perfectly as collateral and the money was wired next day. \n\nBitcoin is useful.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9abbx6",
                            "author": "COgrown",
                            "score": 2,
                            "created_utc": 1653017833.0,
                            "response": "Gyft has been around more than a minute.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9a8k3j",
                            "author": "cutoffs89",
                            "score": 1,
                            "created_utc": 1653016312.0,
                            "response": "If businesses gave an instant 3% off for spending BTC over Debit/credit, then I'm sure we'd see massive adoption.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9b79lz",
                                    "author": "budjuice",
                                    "score": 1,
                                    "created_utc": 1653042047.0,
                                    "response": "I starting to see that a lot on websites that accept btc.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9aphm0",
                            "author": "caploves1019",
                            "score": 2,
                            "created_utc": 1653027199.0,
                            "response": "Bought my wife's legitimate full suite windows 10 with Bitcoin.\n\nPaid my tax guy in Bitcoin.\n\nPaid for a haircut in Bitcoin.\n\nAnd can purchase Amazon gift cards with Bitcoin pretty simply.\n\nYou're either a bcash shill or have done zero research on putting BTC to use as intended.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9bf9iw",
                                    "author": "VPNApe",
                                    "score": 3,
                                    "created_utc": 1653047233.0,
                                    "response": "Cool, you live in a place that accepts Bitcoin. \n\nI don't. Most people don't. \n\nI've never once in my life invested in bcash. Fuck off?",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9brkio",
                                    "author": "brawnkoh",
                                    "score": 1,
                                    "created_utc": 1653053279.0,
                                    "response": "Yeah, over how much time?\n\nI bought more than that yesterday with my credit card. LOL\n\nJust because IT CAN be used, does not mean it is wildly used or accepted. To pretend that it is, is laughable.\n\nYou can be pro BTC, and also not in denial.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9bcqzd",
                            "author": "OffThread",
                            "score": 1,
                            "created_utc": 1653045780.0,
                            "response": "[Have](https://www.egifter.com) [you](https://coingate.com/gift-cards) [ever](https://www.gyft.com/) [looked](https://www.coinbase.com)??",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9a89ve",
                            "author": "alclab",
                            "score": 0,
                            "created_utc": 1653016160.0,
                            "response": "I don't expect our to replace most payments as it will be so valuable most people won't want to part with it.  However I would never call it \"useless\". If you've ever had to transfer funds internationally, there's really no better way to do it than crypto. And it gets accepted much easier. \n\nWhen more when more establishments start getting in, it will be hard to ignore of prefer other methods",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9a8xuq",
                    "author": "ducasaurus",
                    "score": 1,
                    "created_utc": 1653016522.0,
                    "response": "I've taken the stance Satoshi took and don't even waste time nor effort trying to convince people anymore.  \n  \n[\"If you don't believe me or don't get it, I don't have time to try to convince you, sorry.\"](https://i.imgur.com/7ArEVMS.png)  \nSource: https://bitcointalk.org/index.php?topic=532.msg6306#msg6306",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9bkltw",
                            "author": "AussieCryptoCurrency",
                            "score": 1,
                            "created_utc": 1653050023.0,
                            "response": "That was about a very specific technical argument for Bitcoin. Read the quote.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9add53",
                    "author": "BitcoinUser263895",
                    "score": 1,
                    "created_utc": 1653019005.0,
                    "response": "Can we have a Michael Jackson AI read this?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9bidvx",
                            "author": "alclab",
                            "score": 1,
                            "created_utc": 1653048895.0,
                            "response": "???",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9ay1mh",
                    "author": "Eyonizback",
                    "score": 1,
                    "created_utc": 1653034424.0,
                    "response": "People keep saying it’s a store of value and hedge against inflation, but at an inflation rate highest in 40 years, it’s down. Why is that? I feel like it’s not working right",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9b48of",
                            "author": "Djuckypuddin",
                            "score": 3,
                            "created_utc": 1653039621.0,
                            "response": "If the dollar keeps going down in value in the long run but btc price goes up in the long run than its a better store of value and a hedge against inflation",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9bh600",
                            "author": "Downtown-Ad-4117",
                            "score": 2,
                            "created_utc": 1653048255.0,
                            "response": "You mean it's not a hedge against inflation to anyone, or just the people who bought north of here? Obviously it works over longer time periods.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9bmuyk",
                                    "author": "Eyonizback",
                                    "score": 1,
                                    "created_utc": 1653051118.0,
                                    "response": "I think I read 40% so nearly half are underwater now",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9bi43q",
                            "author": "alclab",
                            "score": 2,
                            "created_utc": 1653048754.0,
                            "response": "Because most of it was bought by institutions who merely saw it as a risky asset investment. With risk appetite going down and money flowing towards safe guaranteed central bank Treasury bonds, everything else got sold. It is now when WE have to get as much as we can at a discount",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9ar0ql",
                    "author": "mgd09292007",
                    "score": 1,
                    "created_utc": 1653028392.0,
                    "response": "I dont mind bitcoin being purely a store of value like a savings account that I can convert to whatever monetary system I would like, but it would be nice to have more direct integration with bitcoin.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9argyq",
                    "author": "BusinessBreakfast3",
                    "score": 1,
                    "created_utc": 1653028748.0,
                    "response": "Yes, they use living in something and using it as synonyms.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9b0ta9",
                    "author": "DeskBotMt",
                    "score": 1,
                    "created_utc": 1653036921.0,
                    "response": "You were pretty ignorant to use it with such a low evaluation tbh 🤣",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9bd3g5",
                    "author": "salmonbitch88",
                    "score": 1,
                    "created_utc": 1653045989.0,
                    "response": "that is not new xD",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9bjoph",
                    "author": "Just_looking981",
                    "score": 1,
                    "created_utc": 1653049559.0,
                    "response": "Gambling to pay for stuff is fun too",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9bppiq",
                    "author": "Ofiller",
                    "score": 1,
                    "created_utc": 1653052451.0,
                    "response": "WTF is this \"Real life\" people keep talking about. \n\nDo you guys have \\*other lives\\* than your \\*real lives\\* !?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9bpx9j",
                            "author": "alclab",
                            "score": 1,
                            "created_utc": 1653052549.0,
                            "response": "It's the way people who don't believe refer to the use of BTC outside \"the Internet\"",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9bslxx",
                                    "author": "Ofiller",
                                    "score": 1,
                                    "created_utc": 1653053734.0,
                                    "response": "It's so weird for me to hear such sentences. A fake watch exists in reality. It doesn't make it a \\*real copy\\*, it just makes it exist in reality.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9bqqv6",
                    "author": "Gone_gone_beyond",
                    "score": 1,
                    "created_utc": 1653052914.0,
                    "response": "My buddy’s daughter was having car issues yesterday, she needed a new battery which he was willing to buy for her but he was at work. He could have sent her money and paid a fee to get it to her instantly (Venmo) but that’s crazy. BTC would have solved that issue. Instant money in her pocket when she needed it… one day soon this will be the norm.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9bsadj",
                    "author": "BlockChainR3volution",
                    "score": 1,
                    "created_utc": 1653053596.0,
                    "response": "If u use ur bitcoin as “money” ur just as ignorant and blind as those ur criticizing 🙄🙄 also ud be giving ur bitcoin to big companies n whales 🙄🙄🙄 \nBut yeah. Go ahead",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9bsk75",
                    "author": "PhenacSpiral",
                    "score": 1,
                    "created_utc": 1653053713.0,
                    "response": "BTC could be the future of payments, we've already seen this happening in some countries and regions like Ukraine where someone was able to pay for a car using Bitcoin to escape the war. Fiat couldn't save him at that point. \nVia the CryptoXpress app, I'm able to make payments with travala, bitrefill and pay using BTC.\nThe future is almost here people",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uthtmh",
            "title": "Bitcoin Project Information",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uthtmh/bitcoin_project_information/",
            "author": "MythBatcher",
            "created_utc": 1653008794.0,
            "score": 3,
            "num_comments": 4,
            "subreddit": "Bitcoin",
            "selftext": "As one who isn't immersed in Bitcoin very deeply, is there any websites or repositories with ongoing projects or proposed upgrades, like Bip 119? What about material to learn more about bitcoin itself?\n\nThanks for all the info that might help others.",
            "stickied": false,
            "comments": [
                {
                    "id": "i99wcia",
                    "author": "Leading_Zeros",
                    "score": 7,
                    "created_utc": 1653010219.0,
                    "response": "[https://bitcoinops.org/en/newsletters/](https://bitcoinops.org/en/newsletters/)\n\n[https://www.lopp.net/bitcoin-information.html](https://www.lopp.net/bitcoin-information.html)\n\n[https://bitcoin-resources.com/](https://bitcoin-resources.com/)",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9a1l3e",
                            "author": "MythBatcher",
                            "score": 2,
                            "created_utc": 1653012777.0,
                            "response": "Thank you for the information, will definitely check out.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9bs5bi",
                    "author": "MythBatcher",
                    "score": 1,
                    "created_utc": 1653053534.0,
                    "response": "Would it be safe to say that checking out the github page is a must to keep up with proposed changes to bitcoin?",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}