{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uxme83",
            "title": "My crypto be like! 😂",
            "url": "https://i.redd.it/pvy9wwmipn191.gif",
            "author": "GaliboControl2310",
            "created_utc": 1653499532.0,
            "score": 26,
            "num_comments": 9,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9ykuqo",
                    "author": "Zestyclose-Ad9738",
                    "score": 1,
                    "created_utc": 1653499775.0,
                    "response": "Held the bag to the end though ✊🏻",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ylivo",
                            "author": "GaliboControl2310",
                            "score": 1,
                            "created_utc": 1653500041.0,
                            "response": "✌🏻",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9yo01g",
                            "author": "ContWord2346",
                            "score": 1,
                            "created_utc": 1653501006.0,
                            "response": "legendary HODLING.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9ym2mf",
                    "author": "ForrestJob",
                    "score": 1,
                    "created_utc": 1653500254.0,
                    "response": "crypto is the Vector Knives of currency",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ypye8",
                    "author": "sebo28091995",
                    "score": 1,
                    "created_utc": 1653501772.0,
                    "response": "hodl, and we will go places",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9yq0t3",
                    "author": "Hodl2",
                    "score": 1,
                    "created_utc": 1653501799.0,
                    "response": "That's because crypto is a scam, and that's why you should Bitcoin instead of crapto. That way you'll stay clear of Kwonzi-schemes and Raoulpulls",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9yqez0",
                    "author": "Geoknysis",
                    "score": 1,
                    "created_utc": 1653501953.0,
                    "response": "retards do crypto.\n\npros do bitcoin.\n\nOP be retarded?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9yqpd5",
                            "author": "GaliboControl2310",
                            "score": 1,
                            "created_utc": 1653502066.0,
                            "response": "😂",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9ysjet",
                    "author": "dddisabelonlyfans",
                    "score": 1,
                    "created_utc": 1653502794.0,
                    "response": "🤣🤣",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uxmp4i",
            "title": "how exaggerated !",
            "url": "https://i.redd.it/ovwobn14sn191.gif",
            "author": "GaliboControl2310",
            "created_utc": 1653500405.0,
            "score": 1,
            "num_comments": 5,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9yn50b",
                    "author": "deftdabler",
                    "score": 3,
                    "created_utc": 1653500670.0,
                    "response": "Totally, they spelt Fiat wrong",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9yrse1",
                    "author": "Ill-Sherbert1095",
                    "score": 1,
                    "created_utc": 1653502498.0,
                    "response": "😂",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9yxf8l",
                    "author": "Blades_61",
                    "score": 1,
                    "created_utc": 1653504704.0,
                    "response": "This is hilarious 😂. \n\nI hope its not true 😕",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9yxgh7",
                    "author": "nikosnelson",
                    "score": 1,
                    "created_utc": 1653504718.0,
                    "response": "They fell for a brokerscam",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9yy47v",
                    "author": "ryanryans425",
                    "score": 1,
                    "created_utc": 1653504979.0,
                    "response": "Exaggerated? This is exactly how the world views you fools and you will soon see by the end of the year",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uxmdyp",
            "title": "Buy high sell low :D",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uxmdyp/buy_high_sell_low_d/",
            "author": "SickBoyNoFuture",
            "created_utc": 1653499512.0,
            "score": 5,
            "num_comments": 4,
            "subreddit": "Bitcoin",
            "selftext": "&#x200B;\n\nhttps://preview.redd.it/vv9lc8mcpn191.png?width=1397&format=png&auto=webp&s=1cc1ecef62723c97d368bbc724fa3db032d946ba",
            "stickied": false,
            "comments": [
                {
                    "id": "i9yp2xa",
                    "author": "RealUrbanRebel",
                    "score": 3,
                    "created_utc": 1653501430.0,
                    "response": "This is the way",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ypiee",
                    "author": "potato_for_cooking",
                    "score": 2,
                    "created_utc": 1653501600.0,
                    "response": "The reddit way",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9z2dpm",
                    "author": "d3lta8",
                    "score": 1,
                    "created_utc": 1653506695.0,
                    "response": "Buy high sell higher",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uxmerp",
            "title": "H O D L ! !",
            "url": "https://i.redd.it/8bz9c9cnpn191.gif",
            "author": "GaliboControl2310",
            "created_utc": 1653499576.0,
            "score": 0,
            "num_comments": 3,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9z23d0",
                    "author": "Sleevelezz",
                    "score": 2,
                    "created_utc": 1653506577.0,
                    "response": "Wasn't it buy high, sell low? Rofl",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9yy227",
                    "author": "patoshinakamoto",
                    "score": 1,
                    "created_utc": 1653504955.0,
                    "response": "You spelled it wrong",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uxmexr",
            "title": "Neoliberalism strengthens economic power, so it constitutes the freedom of power and not the freedom of man.",
            "url": "https://www.filmsforaction.org/watch/laboratory-greece-2019/",
            "author": "globeworldmap",
            "created_utc": 1653499590.0,
            "score": 1,
            "num_comments": 2,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9yu3qb",
                    "author": "NiceDoctorBeam",
                    "score": 2,
                    "created_utc": 1653503403.0,
                    "response": "Nearly three hours long.  \n\nHere's an overview which might take less than 3 hours to read:  \nhttps://www.investopedia.com/terms/n/neoliberalism.asp  \n\nHere's a criticism:  \nhttps://www.theguardian.com/books/2016/apr/15/neoliberalism-ideology-problem-george-monbiot  \n\nMeanwhile, from a Wikipedia article:  \n\n> Many neoliberal thinkers advance the view that economic and political freedom are inextricably linked. Milton Friedman argued in his book Capitalism and Freedom that economic freedom, while itself an extremely important component of absolute freedom, is also a necessary condition for political freedom. He claimed that centralized control of economic activities is always accompanied by political repression. In his view, the voluntary character of all transactions in an unregulated market economy and the wide diversity of choices that it permits pose fundamental threats to repressive political leaders by greatly diminishing their power to coerce people economically. Through the elimination of centralized control of economic activities, economic power is separated from political power and each can serve as a counterbalance to the other. Friedman feels that competitive capitalism is especially important to minority groups since impersonal market forces protect people from discrimination in their economic activities for reasons unrelated to their productivity. In The Road to Serfdom, Friedrich Hayek offered a similar argument: \"Economic control is not merely control of a sector of human life which can be separated from the rest; it is the control of the means for all our ends\". Amplifying their arguments, it has often been pointed out that increasing economic freedoms tends to raise expectations on political freedoms, eventually leading to democracy.  \n\nI like parts of it, but I feel monopolies need to be prevented and/or broken up, for example.  \n\n*Fascinating stuff to ponder.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia00f5k",
                    "author": "Mallardshead",
                    "score": 1,
                    "created_utc": 1653521318.0,
                    "response": "Neoliberalism is absolute bullshit in an inflationary system where the fundamental base layer (fiat/debt) is dishonest. Too much of neoliberalism is based on the assumption that free markets are free to begin with. They're not. \n\nBitcoin fixes neoliberalism.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uxmmfw",
            "title": "Why are UTXO commitments not a thing?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uxmmfw/why_are_utxo_commitments_not_a_thing/",
            "author": "aemmeroli",
            "created_utc": 1653500185.0,
            "score": 8,
            "num_comments": 15,
            "subreddit": "Bitcoin",
            "selftext": "I read some articles that claim that UTXO commitments (adding the hash of the current state to every block) would remove the need to download the whole blockchain and a new node would be able to verify that a pruned state is correct based on the commitment.\n\nI don't understand how this works in detail but I wondered why this isn't discussed here more often or why this doesn't add anything to Bitcoin.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9yxmh1",
                    "author": "Acceptable-Analyst30",
                    "score": 5,
                    "created_utc": 1653504784.0,
                    "response": "Hi\n\nThis is an interesting idea and I’m using something similar internally to quickly deploy bitcoin nodes. I had a few bad experience with hardware failing like 5 times in a row forcing me to redownload re confirm everything from the beginning which is annoying.\n\nWhen connected for the first time a new node do two things: It first download the complete history of the blockchain and then confirms everything block by block ensuring all UTXO are valid. Even when running a pruned node this process will be done. Pruning will only reduce the size on the hard drive. This can take several days if the hardware is not powerful enough and will always grow over time.\n\nIn theory, to reduce the bandwidth usage we could simply download the last few GB of blocks and an up to date UTXO set. The problem now becomes, who will you trust with this UTXO set. What is the guarantee that nothing was tempered with? And the answer is nothing, of course I can put on Dropbox an updated UTXO set but you would have to trust me to not modify anything in it.\n\nThis is why everything is downloaded and validated in the first place, to make sure nothing was modified. Adding the current state of the UTXO set to every block would change the dynamic of mining and be a potentially intensive process, furthermore the internal state of mempool across all nodes are slightly different, some transactions are not yet relayed to all node, etc so it would be impractical.\n\nNow, let me introduce a hybrid approach. Through a Bitcoin softfork we could every 2 weeks when there is the difficulty adjustment introduce the hash of the UTXO set a few blocks before (eg: 50 blocks before) to avoid any uncertainty in case of history rewriting. This periodical commitment would introduce a reference that can be later used to speed up the initial sync. The way this would be done to be backward compatible is to have an OP RETURN transaction signed by address of the miner who mined the block with the hash of the UTXO set. We let this run for 6 months so it becomes ossified. Because it would only happens roughly every 2 weeks and for the UTXO set 50 blocks before it could be easily recomputed by miners and node without adding too much computing overhead.\n\nNow when you spin up a new node, you have a new option called Fast track UTXO commitment. A node with this enabled would download a few recent blocks, then figure out the current block height, then it would go around 6 months in the past and start downloading the UTXO set from 6 months ago + all the blocks until now.\n\nThe validation process would be the following: Check that the UTXO hash of the set correspond to the hash that was published 6 months ago and start validating everything from 6 months ago until now. This would reduce the amount of bandwidth and computing power to run your own node and could open the door to have nodes inside phones and very low power hardware in places where high bandwidth access is limited.\n\nThe 6 month ossification window ensure that the cost of attacking a node during this initial synchronization would be at least of 6 months of producing a fake chain. Depending on the threat model this could be extended however I think its acceptable. If during initial block download someone faces an adversary powerful enough to have the majority of nodes sending fake data, they could as well fake it from the beginning.\n\nWhat I do internally is something similar, I have a backup of the UTXO set of a few months ago and I use it to quickly restore nodes in case of failure.\n\nIMHO this could even be proposed as a Bip so we could discuss about the implication of periodical UTXO commitment.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9zp5bo",
                            "author": "igadjeed",
                            "score": 2,
                            "created_utc": 1653516149.0,
                            "response": "> have an OP RETURN transaction signed by address of the miner who mined the block with the hash of the UTXO set\n\nI'm not sure it needs it be signed. More accurately, the coinbase transaction has no signatures because every node expects to validate it against consensus rules. If your coinbase transaction pays 50 BTC in 2022, your block is invalid, not propagated  \n\nI'll be expecting to verify the checkpoint hash of the UTXO set if it's part of the coinbase transaction, so I don't need a miner to sign it, and I don't trust that it's correct just because the miner signed it  \n\nThis is where the idea breaks  \n\nMy node is not built to verify a hash of a database containing 50 million entries within the time it normally takes to validate and propagate a new block  \n\nI don't trust the miner's UTXO checkpoint hash. I don't want to slow down the Bitcoin node network by verifying the hash",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia0wjva",
                                    "author": "jtoomim",
                                    "score": 2,
                                    "created_utc": 1653536720.0,
                                    "response": "> My node is not built to verify a hash of a database containing 50 million entries within the time it normally takes to validate and propagate a new block\n\nLet's add some data to this. Here are results from my node:\n\n    ~$ time bitcoin-cli gettxoutsetinfo\n    {\n      \"height\": 737930,\n      \"bestblock\": \"00000000000000000002e6cae9fb55f131b619dd72ec5bc2242bd10b6c164be9\",\n      \"transactions\": 49497197,\n      \"txouts\": 82083387,\n      \"bogosize\": 6127690147,\n      \"hash_serialized_2\": \n    \"1f965ae02e0277c79a7fb64245eaac13cc090bc74b0a19cee895a7d82e4ca745\",\n      \"disk_size\": 5033459269,\n      \"total_amount\": 19049354.67914707\n    }\n    \n    real\t1m15.244s\n    user\t0m0.005s\n    sys\t0m0.000s\n\nSo it currently takes a little over 1.25 minutes (75 seconds) for my node to hash all UXTO set entries. The proposal that /u/Acceptable-Analyst30 put forth would give *50* average block intervals (30,000 seconds) for this to be computed -- e.g. the UTXO set from block 800,000 would only be committed in block 800,050. Since 75 seconds is a lot shorter than 30,000 seconds, my node is about 400 times faster than the minimum speed necessary to compute or verify a hash of the current UTXO set within the time it normally takes to validate and propagate that 50th block.\n\nMind you, this can also be improved. For reference, this is on a Core i7 4790k (released 8 years ago) with an old SATA SSD. The `gettxoutsetinfo` RPC call is single-threaded and not well optimized, as it's rarely used, so it should be taken as an upper bound for the amount of time it takes to compute a UTXO commitment. With some work, this could probably be dropped to 1/4 of the current time. For example, another way I can compute a hash of the UTXO set is to simply hash the entire database files using Blake2B:\n\n    ~$ time cat .bitcoin/chainstate/* | b2sum\n    4d9733f88e0a6c12f4922ee0e9a0bfc87bc3be1026aa7d92db3ae64e3310364638259ec0eb98f90a7d0d9c6cf7e9a6f7b59c558fa61aac17b1e9b43638363252  -\n        \n    real\t0m33.462s\n    user\t0m8.363s\n    sys\t0m3.855s\n\nThis is *still* single-threaded, and (at least on my machine) purely I/O bound (`cat`ing the data to `/dev/null` takes 32 seconds while reading at 142 MB/s), but it's already about 2x as fast.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9zk94w",
                    "author": "igadjeed",
                    "score": 3,
                    "created_utc": 1653514030.0,
                    "response": "Not implemented because it's centralized. There's no decentralized way to discover a consistent checkpoint at a specific block height  \n\nAlso, the main project to build checkpoints for the UTXO database seems to have been abandoned  \nhttps://dci.mit.edu/utreexo\n\n> why this doesn't add anything to Bitcoin\n\nIt does. It allows the chainstate to be shared instead of being built transaction by transaction, block by block from genesis. Currently, it's possible to copy a chainstate valid at a specific block height from another person's node (MyNode does this), with the big downside that you're trusting the other node operator, not verifying  \n\nIf there was a decentralized proof of validity of an externally acquired chainstate, node initialization would take a few hours (block download time) instead of 3-5 days  \n\nOr a few minutes, for a pruned node, instead of 3-5 days",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9z6fma",
                    "author": "Dormage",
                    "score": 2,
                    "created_utc": 1653508324.0,
                    "response": "This is fairly simple and a good idea. However, without the requirement or incentive to store the entire chain, you introduce the risk of loosing the history?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9zcg4s",
                            "author": "aemmeroli",
                            "score": 2,
                            "created_utc": 1653510757.0,
                            "response": "Exactly which opens the question if the history is even needed if the current state can be proofed with less data. Like I said I don't know how this works in detail.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9zn3l9",
                                    "author": "igadjeed",
                                    "score": 3,
                                    "created_utc": 1653515263.0,
                                    "response": "> if the history is even needed if the current state can be proofed with less data\n\nThis is a deep rabbithole. Superficially, the answer is that we don't need the transactions if there is sufficient transaction data in the UTXO set. Obviously, there is sufficient data, because pruned nodes don't need to keep the old blocks after downloading them and verifying them  \n\nThis might appear to be tangential, but it's fundamental ...  \n\nIn IT application systems design, there is a concept called \"system of record\". That is, if you have redundant copies of various data elements scattered through the system (eg fast lookup indexes), or totals and subtotals stored for the convenience of avoiding recalculation overhead, those things can be discarded and rebuilt/recalculated from the system of record  \n\nIn the 1960s the system of record in a major corporation was the paper files in the compactus filing system on the otherwise-unoccupied archive floor at HQ, possibly with microfiche backup  \n\nAs data capacity improved, the system of record became a collection of half-inch tapes, which were updated with transactions collected on punch cards, nightly or weekly - old tapes in, new tapes out  \n\nBy the 1980s the disk copy of the database was being updated in real time, not delayed to overnight, and the tapes become obsolete, except as nightly backups of the database on disk. The disk database is the system of record, not the backup tape  \n\nand so on. I'm not sure IT history is an exciting topic  \n\nIn Bitcoin, the system of record is the blockchain. The whole cumbersome method of laying down block after block in sequential files which are written but never updated (except for chaintip reorgs) is a near-perfect implementation of a non-database system of record  \n\nSo, what's the chainstate (UTXO set)? It's just a fast lookup index of a subset of the data in the blockchain, the most important data for proving the right to spend and preventing double spending  \n\nHow do we know it's accurate? We built it from the blockchain, transaction by transaction, block by block  \n\nIs it still accurate if we pass copies around the Internet and rely on checkpoint hashes? It might not be, if there's a bug in the checkpointing system  \n\nDoes that matter?  \n\nNo, because we can always fix it by rebuilding the UTXO set from the blockchain  \n\nOh, but we don't have any unpruned copies of the blockchain any more",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9zdntz",
                                    "author": "Dormage",
                                    "score": 1,
                                    "created_utc": 1653511254.0,
                                    "response": "If you came up with the idea you know much more then you give your self credit.\nI suppose there  is such a long time interval in which the past becomes irrelavant for the present, and a compressed archive can be stored and reconstructed if need.\n\nReasoning about the implications of that is beyond my cognitive capacity but on a technical level this can be done. \n\nThere were other attempts at finite chains in academia. I recently came across a paper that suggested a similar approach to have a finite chain. I may dig that up and edit the post if I find it.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9ysp0n",
                    "author": "sepharose",
                    "score": 1,
                    "created_utc": 1653502853.0,
                    "response": "It sounds like a great improvement proposal. Pruned nodes could download only the utxo set without first downloading the entire chain. I can't think of any downsides. Hopefully it gains traction.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9yzqze",
                            "author": "Acceptable-Analyst30",
                            "score": 1,
                            "created_utc": 1653505632.0,
                            "response": "The main downside would be increased mining complexity because you need to compute the hash of the current ever changing UTXO set to include it in the block. However an hybrid approach of a periodic commitment (every few days / few weeks) would be doable and would not increase by too much the complexity of the block validation process.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9ymsjc",
                    "author": "pink_raya",
                    "score": 1,
                    "created_utc": 1653500536.0,
                    "response": "isn't a UTXO set unique to each node? how would you verify it?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9yp4ay",
                            "author": "Narmotur",
                            "score": 2,
                            "created_utc": 1653501445.0,
                            "response": "The set of UTXOs should be the same on each node, I would think, since they are sourced from the blockchain. The mempool can differ between nodes, however.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9zoj5x",
                    "author": "McJvck",
                    "score": 0,
                    "created_utc": 1653515879.0,
                    "response": "Imagine you are synced. Now you go offline 2 months. Now you reconnect. What chain is the most difficult? The only way is to add up all difficulties from block 0. You cannot store this difficulty inside a committed hash (as this would require computing a single block with the sum of all difficulty since the beginning).\n\nThus, we cannot simply drop the history. If we would, we would require weak subjectivity like PoS.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia0y4df",
                            "author": "jtoomim",
                            "score": 2,
                            "created_utc": 1653537644.0,
                            "response": "It's computationally very easy to validate all block *headers*. Checking the work done only requires validating headers, not the blocks themselves. Using UTXO commitments, you can validate all headers since the genesis block, and only validate a semi-recent UTXO commitment plus the contents of the blocks since that commitment.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia1mmap",
                                    "author": "McJvck",
                                    "score": 1,
                                    "created_utc": 1653556749.0,
                                    "response": "On top of the most difficult chain, wouldn't you want to check that all TXs are legit? You may be shown a more difficult chain that contains a TXs that is not signed by the owner. You wouldn't be able to check that.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "id": "uxmlg0",
            "title": "The future!",
            "url": "https://i.redd.it/1ehsi748rn191.gif",
            "author": "GaliboControl2310",
            "created_utc": 1653500106.0,
            "score": 221,
            "num_comments": 11,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "ia0bagj",
                    "author": "PopLock-N-Hold-it",
                    "score": 4,
                    "created_utc": 1653526457.0,
                    "response": "Please Include planets in the list of consumables",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia04swt",
                    "author": "MartisTh3EviL",
                    "score": 2,
                    "created_utc": 1653523405.0,
                    "response": "Imagine how better the world will be then",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia0pr02",
                    "author": "Jeff5704",
                    "score": 2,
                    "created_utc": 1653533174.0,
                    "response": "Let’s hope so, today was my DCA day! Only $250 but every little bit counts.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia19lss",
                    "author": "SpencerLass",
                    "score": 2,
                    "created_utc": 1653545532.0,
                    "response": "I can’t get over the fact that the things aren’t being chomped if they don’t disappear after he closes his mouth on them.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia1jtim",
                    "author": "bobbyv137",
                    "score": 2,
                    "created_utc": 1653554221.0,
                    "response": "I'm watching the live Binance BTC trades right now.\n\nThere's multiple bids going through at around 1,300 BTC per bid. Someone is buying hundreds of millions of dollars of BTC literally right before my eyes.\n\nQuite the sight.\n\nEdit: this is compulsive viewing. Yes, I'm a nerd. Something is brewing. Something's about to give.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia1kkyx",
                    "author": "tipstony59",
                    "score": 2,
                    "created_utc": 1653554915.0,
                    "response": "Imagine the total transaction fees globally 🤣🤣🤣",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}