{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uuukpt",
            "title": "At this rate it seems like money is the answer.",
            "url": "https://i.redd.it/jvo55orhvv091.jpg",
            "author": "moneyware",
            "created_utc": 1653162614.0,
            "score": 0,
            "num_comments": 0,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uuurm4",
            "title": "Bond to Unbind - Bitcoin and El Salvador [full documentary]",
            "url": "https://www.youtube.com/watch?v=Jx-QWOHuug0&feature=share",
            "author": "Brief-Brain-7652",
            "created_utc": 1653163214.0,
            "score": 1,
            "num_comments": 0,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uuugcs",
            "title": "No, Bitcoin is not a good investment",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uuugcs/no_bitcoin_is_not_a_good_investment/",
            "author": "worsbao",
            "created_utc": 1653162228.0,
            "score": 0,
            "num_comments": 12,
            "subreddit": "Bitcoin",
            "selftext": "# My original post was archived one year ago. But now we know who was right :)\n\n&#x200B;\n\nIf we want to understand the future of Bitcoin, we should look at its history, its pioneers so you can make a clear decision.\n\nI first heard about Bitcoin in 2013 from douban.com. Douban is a website for books, movies and music reviews and you can also form different groups. There you can meet different kinds of interesting people. We had a group called Primordial Evil and one was called Giant Goose. His real name is Xinyu Jiang, and he has a more famous name in Bitcoin industry - FriedCat. This name is less known today, but he was the first one used Bitcoin as IPO method to attract investment to make Bitcoin mining ASIC/machines as early as in 2012 in bitcointalk. In July, 2012, he founded his own company Bitfountain in Shenzhen. One of the early investor was Jihan Wu, owner of Bitmain. FriedCat was the second designed and manufactured Bitcoin mining machines based on the ASICs made by his own company. And in early 2013, FriedCat mining machine first mined Bitcoin and his computation power alone consisted of 42% of all Bitcoin network.\n\nI didn't have many conversations in Douban with FriedCat back then. He has a Douban post which I had very deep impression. I think it was called something like Consensus between Libertarians and Conservatives. This is because FriedCat himself was a libertarian and he had some friends who agreed Conservativism in Primordial Evil. He entered one of the best engineering college in China - University of Science and Technology of China at the age of 15 in 2001. It was said that his college entrance scores was 11th among the millions of Chinese high school students. In 2011, FriedCat went to study in Yale for his computer science doctor degree. He didn't finish his study. Because he touched Bitcoin then and was fascinated by the Libertarian philosophy so he decided to quit from Yale and begin his business in Bitcoin.\n\nAs you may have the question, why you never heard of FriedCat in today's world when the Bitcoin price rising higher and higher. Well, that's because he suddenly disappeared at the end of 2014. There's no real reports, from internet articles, here's what could have happened: As the expansion of his mining business, FriedCat was trying to find the right places for mining. Then there was someone called Lin told FriedCat that he had the right place with cheap electricity. Then FriedCat put 6000 mining machines into this place and then Lin modified the account and hijacked all those resources and FriedCat tried to go to argue and might be kidnapped and forced to transfer 19000 bitcoins. That was how FriedCat disappeared from Bitcoin stage at least for now.\n\nAmong the Primordial Evil, the most successful one was Zhongjing (William) Liu. He was the greatest historian in our century. And we can see this from his own life experience. He used to be a medical examiner in public security department in Ürümqi, Xinjiang/East Turkistan. Then he realized the danger between Chinese and local Muslims so he left public security department and studied in Chengdu for history master degree, shortly after he left Ürümqi, there was massacres between Chinese and local Muslims. Then in 2012, he went to Wuhan, that's right, the city where the Virus came. And he got his history doctor degree and exiled to US in 2016. As you can see, if he had stayed in Ürümqi or Wuhan, what could happen. William Liu is now the President of Basuria exile government. He also translated and wrote many books including The History of England Hume and Macaulay versions. And his fans called his knowledge system Auntology.\n\nAs one of fans of William Liu, if we use the Auntology view, we can easily explain why FriedCat failed and why will the bitcoin fails. Yes, from logical perspective, Bitcoin is a great concept. However, in the real world, the most important thing is blood. If you have your life, then you will have plentiful chances to make money. However, if you die, you don't have any chances for neither money for other achievements. Intellectuals tends to exaggerate their importance, but in real history, intellectuals are nothing. This world is ruled by warriors. And yes, sometimes, warriors are also intellectuals such as George Washington. But without force, any perfect ideas are useless. Take FriedCat himself as an example, if in normal country where good people have force, he can either use public or private forces to help him get back those 6000 Bitcoin mining machines. However, in China where the violence was controlled by Communists and gangsters. FriedCat was fortunately enough keep his life. It is said that the last post FriedCat shared in Douban was America: Imagine the World Without Her. Trust me, this was from his own life experience.\n\nSo now let's look at the Bitcoin. It will fall. Because unlike US dollars, there's no force behind it to support this money. In free world, people who have gold usually also own weapons and ammos so they can prevent their gold from being taken. Besides, China has too many computation resources so they can commandeered all the bitcoin mining machines in China and forge the fake transactions so this money system won't be credible anymore.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9hh8ff",
                    "author": "No-Lemon-2287",
                    "score": 3,
                    "created_utc": 1653162785.0,
                    "response": "Good luck",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9hhary",
                    "author": "Sufficient_Tooth_949",
                    "score": 5,
                    "created_utc": 1653162818.0,
                    "response": "+15 social credit score has been added to your account",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9hi77u",
                    "author": "taspenwall",
                    "score": 2,
                    "created_utc": 1653163274.0,
                    "response": "What is this mumbo jumbo?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9hkr4n",
                    "author": "wkw3",
                    "score": 2,
                    "created_utc": 1653164531.0,
                    "response": "I must have missed the last where you were right and China created a bunch of invalid transactions with their hash power. Fortunately they banned it and the majority of the hash power is in the west.\n\nSorry your friend got robbed, but neither communists or gangsters have a strong grasp on property rights.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9hgss5",
                    "author": "sgtlark",
                    "score": 1,
                    "created_utc": 1653162574.0,
                    "response": "Soooo...amass gold?\n\nKiyosaki is this you?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9hhjd4",
                            "author": "automated123",
                            "score": 1,
                            "created_utc": 1653162940.0,
                            "response": "Why would anyone listen to Kiyosaki.  He talks of some common sense stuff about investing and looks for tragic or extreme cases to attract people to his \"teachings\".  I put him and Harry Dent Jr in the same basket.  Sorry maybe it's just me but I can't listen to them",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9htb3u",
                                    "author": "sgtlark",
                                    "score": 1,
                                    "created_utc": 1653168847.0,
                                    "response": "Apparently my joke flew over everyone's head. Kiyosaki is all pro gold as op seems to be as well",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9hh3hk",
                    "author": "bigglesmac",
                    "score": 1,
                    "created_utc": 1653162717.0,
                    "response": "Nah this ain’t it",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9hh9jd",
                    "author": "meatismoydelicious",
                    "score": 1,
                    "created_utc": 1653162801.0,
                    "response": "Fud.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9hifbu",
                    "author": "Deafboy_2v1",
                    "score": 1,
                    "created_utc": 1653163382.0,
                    "response": "It's always nice to stumble upon some OG names here.\n\nI can't agree with the conclusion though. There is a force supporting Bitcoin. Selfishness. The one force above all. As long as everyone can personally benefit from the existence of bitcoin network, they will support it.\n\n> they can commandeered all the bitcoin mining machines in China and forge the fake transactions\n\nFor someone who's been here for such a long time, you surely must know that miners can't just insert invalid transactions in the block.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9hjbqy",
                    "author": "myironcity",
                    "score": 1,
                    "created_utc": 1653163825.0,
                    "response": "You forgot one important aspect and that is the human spirit. When China tried to shutdown Bitcoin mining, it moved, then they tried to shut them down in Kazakhstan, they moved, and every time more and more single miners popped up. Some of us believe the more they push the more we dig in especially here in the US. It’s not us versus them anymore it’s just us. The torch will continue to be passed, each generation getting stronger, and Bitcoin will succeed.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9hsfzv",
                    "author": "Downtown-Ad-4117",
                    "score": 1,
                    "created_utc": 1653168396.0,
                    "response": "Bitcoin won't stop. It will happen slowly, but individuals will have more economic power.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uuueqv",
            "title": "A few questions to help with Ledger set up",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uuueqv/a_few_questions_to_help_with_ledger_set_up/",
            "author": "RhinoRacing",
            "created_utc": 1653162075.0,
            "score": 7,
            "num_comments": 20,
            "subreddit": "Bitcoin",
            "selftext": "Hoping someone here could help answer a few questions I have while setting up my new Ledger.\n\nWhen I say \"send BTC to the device\", yes I know the coins are on the blockchain and not in the physical device, what I mean is send to the wallet that is on the device.\n\nI got a Ledger Nano X the other day. I just finished setting it up recently. I installed the Bitcoin app and made an account. I then got an address for that account that I can send BTC to. I sent a small amount of sats to the device and everything went perfectly. I then reset the device to recover it from the seed phrase to make sure everything was working. The recovery went well and I can see the correct amount of funds in the ledger live app. \n\n&#x200B;\n\nI now want to send the rest of my sats to the device but when I went through the same process as the first time it gave me a different address to send the BTC to. Is this normal? I didn't think Ledger would create a new address for every transaction but is this what is happening? \n\n&#x200B;\n\nAlso, no matter where I navigate to I can not see the actual BTC balance I sent to the device on the device's screen. Is the only way to see the BTC balance by using the ledger live app? Is there anyway I can display the balance on the screen on the nano X? \n\n&#x200B;\n\nTLDR:  Is it possible to see BTC balance on the nano x device's screen?  Is it normal for ledger to generate a new address for every time I want to send BTC to the device?",
            "stickied": false,
            "comments": [
                {
                    "id": "i9hlbkq",
                    "author": "RhinoRacing",
                    "score": 7,
                    "created_utc": 1653164817.0,
                    "response": "Update (If anyone cares) All the coins are officially off the exchange. Thank you to those that helped.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9hgacu",
                    "author": "Knurlinger",
                    "score": 3,
                    "created_utc": 1653162317.0,
                    "response": "1. no\n2. you can reuse old addresse, but for better privacy, the address changes each time. No security issue, just privacy.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9hi9v1",
                    "author": "nicky_papagiorgio",
                    "score": 4,
                    "created_utc": 1653163308.0,
                    "response": "yea it’s normal for the address to change. no you don’t see the balance on the device itself — just in the app.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9hiecu",
                            "author": "RhinoRacing",
                            "score": 3,
                            "created_utc": 1653163368.0,
                            "response": "Thank you",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9hgbbk",
                    "author": "NeverTooLate68",
                    "score": 3,
                    "created_utc": 1653162330.0,
                    "response": "Ledger does create a new address for each import, but of course it still goes to your wallet. This threw me the first couple times too. I've only seen the balance on the app but have only used the Nano S so not sure about the X.  Good luck and enjoyment cold storage!!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9hhcbl",
                            "author": "RhinoRacing",
                            "score": 2,
                            "created_utc": 1653162841.0,
                            "response": "Thank you for your response. That eases my concerns very much to know that the new address for a new transaction thing is the standard process. I was just worried that the BTC wouldn't end up in the same place because it was a different address.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9hmcye",
                    "author": "AccessibleTech",
                    "score": 2,
                    "created_utc": 1653165340.0,
                    "response": "Your private key is on the hardware wallet. That doesn't change. Your public key is in the app, that can change with each transaction for safety.\n\nI have 3 different cold wallets, none of them show amounts on the screen.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9hug15",
                    "author": "sciencetaco",
                    "score": 2,
                    "created_utc": 1653169438.0,
                    "response": "It’s normal for bitcoin wallets to generate a new address when the previous one has received a transaction. Wallets can generate an unlimited number of addresses but the old address is still valid. All the addresses are mathematically derived from your 24 word recovery seed. \n\nThe device itself doesn’t know how many bitcoin are tied to it. It just holds the private keys and signs transactions.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9hy9fw",
                    "author": "ANordWithASword",
                    "score": 2,
                    "created_utc": 1653171414.0,
                    "response": "Can anyone tell me how to reset my device so that I can log back in with my recovery phrase to make sure everything is good? I’ve been adding to my wallet without doing this yet and it makes me kind of nervous. I downloaded the app that lets you check your recovery phrase. Is this good enough or do I need to reset my device to make sure it’s all good, in case I ever lose my device/ phone?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9i3kn3",
                            "author": "RhinoRacing",
                            "score": 1,
                            "created_utc": 1653174180.0,
                            "response": "I did this before really starting to move sats to it. If you hold both buttons it’ll bring you to the control center with a few options. If i remember it’s security settings and then there should be an option for reset device. That wiped mine as if it was brand new and then i re set it up with my phrase and it worked. Only thing i had to do was redownload the btc app onto the device and it was good to go.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9i5vvz",
                                    "author": "ANordWithASword",
                                    "score": 1,
                                    "created_utc": 1653175413.0,
                                    "response": "Thank you!",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9i5ww4",
                                            "author": "exclaim_bot",
                                            "score": 1,
                                            "created_utc": 1653175428.0,
                                            "response": ">Thank you!\n\nYou're welcome!",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9hyd6z",
                    "author": "zackattack784",
                    "score": 2,
                    "created_utc": 1653171469.0,
                    "response": "https://support.ledger.com/hc/en-us/articles/360034336713-Receiving-address-changed",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9hopz0",
                    "author": "RhinoRacing",
                    "score": 1,
                    "created_utc": 1653166507.0,
                    "response": "Update 2:  didn’t realize it was gonna cost 30-34,000 sats for each transaction. Seems kinda high. Is this because of the CEX the coins left? Or because of network congestion? Combo of both?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9hqyzx",
                            "author": "DatBuridansAss",
                            "score": 2,
                            "created_utc": 1653167639.0,
                            "response": "Network congestion, most likely. Which CEX are you using?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9hxi42",
                                    "author": "RhinoRacing",
                                    "score": 1,
                                    "created_utc": 1653171016.0,
                                    "response": "Coinbase",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9i27eq",
                                            "author": "nagato1125",
                                            "score": 2,
                                            "created_utc": 1653173461.0,
                                            "response": "if you are i the US. try Strike",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9i3bwb",
                                                    "author": "RhinoRacing",
                                                    "score": 1,
                                                    "created_utc": 1653174053.0,
                                                    "response": "Now that I’m out of CB I’m leaning towards strike",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9i9rbu",
                                                            "author": "nagato1125",
                                                            "score": 1,
                                                            "created_utc": 1653177543.0,
                                                            "response": "nice! also Strike covers miner fees. so no withdraw/transfer fees.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}