{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "urr46u",
            "title": "SLP379 Gigi – Dealing with Linguistic Attacks on Bitcoin",
            "url": "https://stephanlivera.com/episode/379/",
            "author": "stephanlivera",
            "created_utc": 1652807192.0,
            "score": 1,
            "num_comments": 1,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8yvmkf",
                    "author": "coinfeeds-bot",
                    "score": 1,
                    "created_utc": 1652807736.0,
                    "response": "tldr; Gigi joins me on the show to talk about the problems of imprecise language and wording in Bitcoin. Gigi talks about ‘Unhosted wallets’ terminology, ‘Bitcoin and warfare language’, Proof of Work and mining, and Bitcoin’s ‘Gravity’ and ‘21 Lessons’\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR.*",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "urr0qi",
            "title": "Road-Mapping the Transition from Fiat to Bitcoin for Payments",
            "url": "https://www.reddit.com/r/Bitcoin/comments/urr0qi/roadmapping_the_transition_from_fiat_to_bitcoin/",
            "author": "suneidos",
            "created_utc": 1652806930.0,
            "score": 0,
            "num_comments": 0,
            "subreddit": "Bitcoin",
            "selftext": " \n\nEagerly looking for feedback/correction on any blind spots I may have.\n\nI see Bitcoin as currently fulfilling the \"digital gold\" narrative better than the \"digital money\" narrative. That is not to say people do not use bitcoin as currency, but that it is not yet ideal for currency.\n\n* So long as people have Fiat to spend (because they are paid in Bitcoin), it is in their best interest to spend inflationary fiat and not spend deflationary Bitcoin.\n* Privacy is a concern with paying people in bitcoin.  \n\n   * There will be workplace strife if employees can determine the salaries of all employees, and by extension, what all their co-workers are spending their money on.\n   * International settlements could be more ideal for decentralized currency as a result of the dollar being weaponized by freezing central banks thus destroying trust in the dollar. However, nations would be even more concerned with publicizing their holdings, and who they are paying and how much vs. individuals.\n* So I don't see the US giving up on the Petro Dollar as reserve currency until it collapses, and I think the Petro Dollar is getting a gasp of breathing room now (See the DXY) because no other nations are able to deflate their currency right now, and the Euro will probably collapse and the dollar will eat a lot of it's share as reserve currency. Central banking combined with the military/industrial complex coercing/promoting their reserve currencies (Petro Dollar) has been one of the most powerful tools/weapons in world domination ever invented since the invention of capital markets (think Dutch and British East India Companies, and how today almost all our wealth through 401K's is held in custody by Blackrock, StateStreet, and Vangard who use the accumulated shareholder voting rights and wealth to control politics). I only see the US giving up the power of central banking when it is a lost cause and another currency starts becoming the reserve currency of the world.\n* I don't see the US giving up the ability to print money in a crisis, especially in the face of potential war where the most egregious money printing occurs. In fact, it could be considered a national security threat if a nation could not print money or confiscate money in the case of an invasion. I think that could make a nation relatively more prone to invasion.\n* BTC price is currently volatile. Money is a medium of exchange (BTC does this currently), a store of value (it does this if you are willing to hold for 3+ years currently), and a unit of account (almost no one does this. If a store tried to make price tags in satoshi's currently, it would have to reprint tags at least daily).  \n\n   * Theoretically once 401K's start investing in ETF's the volatility will decrease, but not your keys, not your crypto. Also, the platform could rehypothecate the BTC to a short seller who crashes the price or may fail to crash the price and thus be unable to repay, both scenarios are bad and would further threaten price stability.\n   * Part of the problem is that BTC liquidity is split thousands of ways. My understanding is that most stocks or indexes are only available on one, or perhaps a few exchanges, which makes it very difficult to crash the price through all the buy walls on an exchange. But crypto is split so many ways, that crashing the price on the largest exchange that everyone looks to for price would be relatively easy compared to crashing the price on a single exchange that holds all the liquidity. This contributes to the price being more volatile right now.\n   * If BTC is truly unmanaged/unregulated there would be nothing to stop irresponsible longs or destructive short squeezes.\n\nFor the above reasons, it seems to me that BTC mass-adoption as currency will take decades, and will be dependent on privacy features. And those privacy features may even make privacy by default coins better candidates.\n\nAgain, I look forward to being corrected and thank you.",
            "stickied": false,
            "comments": []
        },
        {
            "id": "urradb",
            "title": "Please Explain - Bitcoin mining drives miners to the place where energy is the cheapest",
            "url": "https://www.reddit.com/r/Bitcoin/comments/urradb/please_explain_bitcoin_mining_drives_miners_to/",
            "author": "Euso36",
            "created_utc": 1652807658.0,
            "score": 0,
            "num_comments": 8,
            "subreddit": "Bitcoin",
            "selftext": "I've listened to Saifedean Ammous now on two podcasts whose made this claim, similarly Michael Saylor has made this claim in other podcasts, however I'm still struggling to understand it and I haven't found much literature on the topic. \n\nSaifedean says bitcoin does not need to buy energy from places where there is high demand because it can buy it from anywhere. I understand that miners will set up shop where energy is low cost because it means they will increase their return on the bitcoins they've mined. \n\nYet the way Michael and Saifedean talk about it, it sounds like they are inferring you can have a bitcoin miner in the North Pole somehow hooked into an energy source in the Sahara through an internet connection.  But surely your mining rigs would have to be set up in the place your extracting the electricity from? \n\nThe fact that Bitcoin drives miners to places where energy is cheapest I believe is seriously undervalued because it could drive innovation in energy production in renewables at time when energy is costing us significantly more financially and environmentally than ever before.  \n\nI believe this should be one of the things Bitcoin is shouting about and a lot of people in the Finance industry have overlooked. \n\nAnyway, my interpretation could be way off so I wanted to come here to see if one of the pros could explain in detail what they mean please? \n\nAlso makes me wonder if Satoshi had considered this second order effect when designing bitcoin or if it was purely serendipitous",
            "stickied": false,
            "comments": [
                {
                    "id": "i8yxo4q",
                    "author": "WritingFun8769",
                    "score": 3,
                    "created_utc": 1652808547.0,
                    "response": "afaik, you have it mostly right. if renewables are the type of energy that’s cheapest, then miners will be more likely to use it. if energy is essentially being wasted—as with flare gas on oil fields—then miners will find a way to make use of it. yes, the miners physically need to move and connect to energy sources, so the idea of connecting someone in the north pole to the sahara’s energy wouldn’t work (though it surely has a wealth of solar that could somehow be harnessed and transported if that ended up being cheap and feasible).",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8yy5wd",
                    "author": "uncontrollableop",
                    "score": 2,
                    "created_utc": 1652808747.0,
                    "response": "i don't understand how this is difficult to understand. Mining requires energy, cheap energy means cheaper bitcoin.   But you have to be near the source. Electricity loses efficiency at an exponential rate as you leave the source. There is no technological or internet solution to this law of physics.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8z3ndu",
                    "author": "NiceDoctorBeam",
                    "score": 1,
                    "created_utc": 1652810952.0,
                    "response": "There is a lot of \"stranded energy,\" that is sources of energy that are too far from where people live who might make use of it.\n\nFor example, volcano-driven geothermal energy on a small island in the middle of the South Pacific.  Vast amounts of electrical power could be generated, but how would you get it off the island?  For example, there are places where dams could be built to produce large amounts of hydroelectric power.  Many of those places are too far from potential users of that power to be economical.  Take into account the cost of building and operating the dam, and the cost to build transmission lines.  Finally, account for the loss of power (waste) within the transmission.\n\nBitcoin miners can take their mining rigs to those places and use the electricity right there, on the spot, where it is produced.  (No, you can't use electricity from the Sahara at the North Pole.  You'd take the mining rigs to the Sahara.)  \n\nSimilar for methane flares (oil drilling), solar power, wind power...\n\nHere's another benefit: when the wind is howling, wind farms produce more power than the customers can use - it goes to waste.  Bitcoin miners could use that extra power, only when it's available, then turn off the rigs during calmer periods.  This helps people who want to build and operate clean energy production and helps us to leave things like coal-burning plants behind.\n\nBitcoin is good for the environment.  \nBitcoin is good.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8z7mul",
                            "author": "Euso36",
                            "score": 1,
                            "created_utc": 1652812577.0,
                            "response": "Thanks for the detail - but I disagree - bitcoin is great 😁",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8z9bk9",
                                    "author": "NiceDoctorBeam",
                                    "score": 1,
                                    "created_utc": 1652813265.0,
                                    "response": "Ha ha!  You got me, for about 1.8 seconds...  lol",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8z9933",
                    "author": "Sharing-my-bad-ideas",
                    "score": 1,
                    "created_utc": 1652813238.0,
                    "response": "I mine with renewables because it’s the right thing to do. It actually costs me a few cents per kWh but that is the cost to do business in a fashion that aligns with my ethics.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8yzp0u",
                    "author": "Halo22B",
                    "score": 2,
                    "created_utc": 1652809362.0,
                    "response": "Your initial take is correct where your getting confused is the portability of energy....of course your not using power from the Sahara to to directly power miners in the NP but.....you have miners on cheap power in the Sahara and that BTC you mine funds heating (a better use case ) of your house at the NP.\nIt's a more efficient method to transport energy derived from a low cost to high cost area.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8z3n2k",
                            "author": "Euso36",
                            "score": 1,
                            "created_utc": 1652810948.0,
                            "response": "Got it thanks! I find it hard sometimes to fully conceptualise an idea, when I only listen to it in a podcast and must have mis-interpreted it. He mentioned something about connecting to a sattelite to mine it which threw me off and I was like Wtf they're wirelessly transferring energy or something. \n\nAppreciate you explaining that cheers\n\nSo to sum - bitcoin drives miners to cheaper power sources - but they actually have to move there.  I",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "urr5dy",
            "title": "Bitcoin Miners In China Survive Ban, Sector Even Thrives",
            "url": "https://www.reddit.com/r/Bitcoin/comments/urr5dy/bitcoin_miners_in_china_survive_ban_sector_even/",
            "author": "MACKO-crypto",
            "created_utc": 1652807281.0,
            "score": 4,
            "num_comments": 2,
            "subreddit": "Bitcoin",
            "selftext": " **Bitcoin (BTC) mining is apparently making a strong comeback in China. That was reported by Cambridge Centre for Alternative Finance on May 17.**\n\n[https://cryptospection.com/bitcoin-miners-in-china-survive-ban-sector-even-thrives/](https://cryptospection.com/bitcoin-miners-in-china-survive-ban-sector-even-thrives/)",
            "stickied": false,
            "comments": [
                {
                    "id": "i8yyui8",
                    "author": "castorfromtheva",
                    "score": 2,
                    "created_utc": 1652809026.0,
                    "response": "Lol. What? Cool. Then another 'China bans bitcoin'-moment is to be expected, lol.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8zpk0d",
                            "author": "Calibre1972",
                            "score": 1,
                            "created_utc": 1652819961.0,
                            "response": "Exactly. Such a crap.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "urr7cb",
            "title": "find the list of bitcoin addresses created in 2012",
            "url": "https://www.reddit.com/r/Bitcoin/comments/urr7cb/find_the_list_of_bitcoin_addresses_created_in_2012/",
            "author": "Mis785936",
            "created_utc": 1652807429.0,
            "score": 0,
            "num_comments": 3,
            "subreddit": "Bitcoin",
            "selftext": "&#x200B;\n\nhello\n\nis it possible to find the list of bitcoin addresses created in 2012 with a positive balance",
            "stickied": false,
            "comments": [
                {
                    "id": "i8yvuzy",
                    "author": "AbeAlrighty",
                    "score": 7,
                    "created_utc": 1652807830.0,
                    "response": "Google “blockchain”. I hear it’s a some kind of ledger.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8zhk1l",
                    "author": "facepalm5000",
                    "score": 1,
                    "created_utc": 1652816636.0,
                    "response": "You'll need to write your own script to scan the blockchain data to filter for all transactions from 2012",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i91slyd",
                    "author": "SmoothGoing",
                    "score": 1,
                    "created_utc": 1652860669.0,
                    "response": "Try Blockchair.com filters. You can find transactions from that year.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}