{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ux3gxj",
            "title": "First time investing",
            "url": "https://www.reddit.com/r/Bitcoin/comments/ux3gxj/first_time_investing/",
            "author": "Complex_Ad998",
            "created_utc": 1653433237.0,
            "score": 1,
            "num_comments": 13,
            "subreddit": "Bitcoin",
            "selftext": "I bought 0.01 bitcoin amidst the market collapse and I was just now watching a financial analyst on NBC news who suggested the first time investors just back off the market because it’s mostly predicted to fall from here on out and so I was wondering if it’s smarter to just step off and watch the market for a while?",
            "stickied": false,
            "comments": [
                {
                    "id": "i9v7y0b",
                    "author": "Hamsox94",
                    "score": 1,
                    "created_utc": 1653433429.0,
                    "response": "That's the fun thing about being into stocks, crypto, etc.. nobody has a damn clue 😂",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9v81pc",
                            "author": "Complex_Ad998",
                            "score": 1,
                            "created_utc": 1653433476.0,
                            "response": "I find the uncertainty fun too but idk",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9v9ewk",
                                    "author": "Hamsox94",
                                    "score": 1,
                                    "created_utc": 1653434118.0,
                                    "response": "I was half joking, I've lost tens of thousands of usd in the past couple weeks but I'm still holding and will continue to do so. Who knows what the floor is anymore!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9v7xwz",
                    "author": "Bkokane",
                    "score": 1,
                    "created_utc": 1653433427.0,
                    "response": "Yeah those guys are totes trustworthy and definitely aren’t trying to keep investors away so they can scoop it up cheap",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9vax7u",
                    "author": "superboget",
                    "score": 1,
                    "created_utc": 1653434830.0,
                    "response": "If the news tell you not to buy Bitcoin, you know it's the best possible time to buy Bitcoin.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9v8n0n",
                    "author": "Biddycola",
                    "score": 1,
                    "created_utc": 1653433754.0,
                    "response": "Just inverse Jim Cramer. Thank me later",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9vbxc6",
                    "author": "fubarrrr",
                    "score": 1,
                    "created_utc": 1653435300.0,
                    "response": "Anyone who says they can see the future is lying. It's a gamble. Don't risk more than you are prepared to lose.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9vcmqb",
                    "author": "Lazy-Substance-5161",
                    "score": 1,
                    "created_utc": 1653435631.0,
                    "response": "Did you invest because you believe in it or because someone told you to do so? Don't be a fool and learn about it instead of listening to others",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9vcvjh",
                            "author": "Complex_Ad998",
                            "score": 1,
                            "created_utc": 1653435744.0,
                            "response": "I did cause o thought it was a better option than spending it things I won’t need and I plan to learn more after finals",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9vd9ny",
                                    "author": "Lazy-Substance-5161",
                                    "score": 1,
                                    "created_utc": 1653435931.0,
                                    "response": "This guy will soon be orange pilled i'm telling you. Just stay away from altcoins",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9vdwys",
                                            "author": "gmabber",
                                            "score": 1,
                                            "created_utc": 1653436238.0,
                                            "response": "Words of wisdom regarding alts!",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9vdvz9",
                    "author": "Keith_Kong",
                    "score": 1,
                    "created_utc": 1653436224.0,
                    "response": "When NBC news is shilling a behavior it's usually a great time to do the opposite. That said, I do believe the market is in a place where it's much more likely to go down further.\n\nWhat am I doing? (not financial advice)\n\n1. Holding Bitcoin.\n2. Very modest DCA twice a week.\n3. Limit orders to buy sizable chunks at 22.5k and 19.5k.\n4. Building cash waiting for a clear sign to start making larger bets.\n\nBut idk lol",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ve7uv",
                    "author": "Nappingspider",
                    "score": 1,
                    "created_utc": 1653436380.0,
                    "response": "People who DCA are just laughing through all this",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ux33kg",
            "title": "Is BTC Ever Going to Help Poor People",
            "url": "https://www.reddit.com/r/Bitcoin/comments/ux33kg/is_btc_ever_going_to_help_poor_people/",
            "author": "Hughski",
            "created_utc": 1653432106.0,
            "score": 0,
            "num_comments": 37,
            "subreddit": "Bitcoin",
            "selftext": "Hear me out because you aren’t gonna like what you hear.\n\nI don’t think BTC will ever really help poor people and definitely it’s not gonna go to the moon.\n\nAs soon as institutional investors entered the market they already ended that. \n\nMost BitCoin is in the hands of the few and not the many. \n\nNow, I’m not even criticising this as such. Personally I own 3 BTC but that’s just a small fraction of my overall holdings. \n\nIt’s what we call a hedge. If BTC moonshots I’ll be better off than you but if it doesn’t I’ll burn it like it’s nothing and still be better off than you.\n\nWealthy people are already hedging BTC - you will never be liberated here.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9v5uzb",
                    "author": "Black_Labs_Matter69",
                    "score": 6,
                    "created_utc": 1653432463.0,
                    "response": "Respectfully I disagree. I don’t really think it was designed to accomplish what you’re suggesting…”helping poor people”. It’s just another commodity/asset/investment. If bitcoin goes to shit I still have equity in my home, my cars are paid off, and a 401k. Im blue collar. Aircraft mechanic. Wife and I have a combined income of maybe 100k, but we’re smart with money and doing well. I buy small bits of bitcoin after my initial investment of 18k. Just going in to buy a couple coins and chill for a few years and see what happens. I think there’s a lot of small time bitcoiners who harbor the same philosophy",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9v7rez",
                            "author": "Hughski",
                            "score": 0,
                            "created_utc": 1653433344.0,
                            "response": "I didn’t tailor my post to people on you on purpose. You’re hedging and doing exactly what I’m doing really. Just wanted the reaction from the moonboys",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9v86fl",
                                    "author": "Black_Labs_Matter69",
                                    "score": 4,
                                    "created_utc": 1653433537.0,
                                    "response": "But I mean one could argue they’re hedging too just on a smaller scale…",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9v8ir7",
                                            "author": "Hughski",
                                            "score": 0,
                                            "created_utc": 1653433698.0,
                                            "response": "On the one hand you could say they are hedging but on the other, much more visceral hand, you could say they are hoping for x1000 returns and it’s not gonna happen. You seem sensible, should I tell them or you?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9v8uu0",
                                                    "author": "Black_Labs_Matter69",
                                                    "score": 2,
                                                    "created_utc": 1653433855.0,
                                                    "response": "I mean, I don’t think anyone with basic rational/critical thinking skills really believes they’re going to get 1,000% returns. Maybe the apes in the GME subreddit…but I’d like to believe bitcoin holders know a little more. But hey, you know what they say about assuming…",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9vb2il",
                    "author": "uncontrollableop",
                    "score": 6,
                    "created_utc": 1653434901.0,
                    "response": "bitcoin is open to everyone equally. no, bitcoin isn't going to print a bunch of money and give it to poor people. bitcoin isn't capable of even identifying who is poor or who is rich.  but bitcoin has already leveled the playing field with regard to access to the network, with regard to censorship,  and with regard to centralization and control.  \n  \n\nbitcoin also, as it gets widely adopted, removes the ability of central banks to manipulate the economy in favor of their rich friends, and print money out of thin air as a hidden tax and to devalue everyone's savings.  and do you know who is hurt most by money printing? poor people, that's who.  \n\nso i don't know why you think bitcoin doesn't help poor people. i think that's because you have distorted and inaccurate ideas about what helps poor people become less poor. it's not hand outs. that's for absolute sure.  because if you think ghettos help poor people, you need to face the hard truth.    \n\ni think it's the concept of incentivization which people who think like this are often missing. i mean if govt were to genetically, via some sci-fi technology, to create a kind slave race or a race of human-like pets to fight its wars, serve it food, dance and sing and fight and play for them, you know what i'm getting at....  if govt were to create this genetically, how much different would the world actually be from what it is now? because i don't think it would be any different. and in fact, i think it's basically what govt has been doing. but instead of genetic experimentation, it's incentive modification. and govts most powerful form of incentive modification is the central bank.  bitcoin fixes this.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9vwgs0",
                            "author": "Hughski",
                            "score": 1,
                            "created_utc": 1653445051.0,
                            "response": "I see what you’re saying but let’s say I’m holding 3 coins. The banks are holding thousands. It’s for the poor. Nah mate we are holding all the coins",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9v68a7",
                    "author": "R_Wallenberg",
                    "score": 3,
                    "created_utc": 1653432635.0,
                    "response": "Aside from being arrogant and obnoxious, why would you think BTC would \"help poor people\", what does that even mean?  Btc is harder, more secure, decentralized and much less corruptable money  but that doesn't imply ayone is entitled to it, already wealthy or not.  You will buy it at the price you deserve.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9v7dlm",
                    "author": "llewsor",
                    "score": 3,
                    "created_utc": 1653433169.0,
                    "response": "bitcoin is not “fair”. it is uncensorable, decentralized and immutable but it is not fair.\n\nwhat proof do you have that bitcoin is in the hands of the few and not the many? and moreover how do you propose to solve that? \n\nif satoshi gave everyone in the world an equal amount of sats, most people would have lost them or sold them early which still doesn’t solve helping the poor or concentration of sats. \n\nyou are confusing price volatility with control which in the short term, sure institutional investors can mess with but they can’t control the protocol. \n\nwhat do you suggest? hold gold? keep the same fiat system? \n\nthis defeatist mentality means you should sell your stack now because your gonna fold sooner or later.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9v9do9",
                    "author": "Dig_it_man",
                    "score": 3,
                    "created_utc": 1653434102.0,
                    "response": "\"I don’t think BTC will ever really help poor people\" \n\nI disagree.  Bitcoin has already helped poor people and continues to help poor people.  Please watch this short video.  Check Your Financial Privilege. \r  \n[https://youtu.be/FjvSqaGhKQI](https://youtu.be/FjvSqaGhKQI)",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9vas1b",
                            "author": "Hughski",
                            "score": -1,
                            "created_utc": 1653434761.0,
                            "response": "I actually did watch it and yes BitCoin helped a few people in very niche situations. You’re talking about situations where getting money to people is the same as paying for drugs or child porn.\n\nYes, nobody is gonna question transfer of funds but yes there’s a lot of problems that go along with this\n\nIn any event, I own more of BTC than you so my original points stands uneroded. I’ll do what the fuck I want with my BTC",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9vdl56",
                                    "author": "Dig_it_man",
                                    "score": 1,
                                    "created_utc": 1653436083.0,
                                    "response": "I never suggested you do anything with your tiny bitcoin stack, you can carve your seed words on a rai stone and shove them for all I care.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9v67r7",
                    "author": "overlycensored",
                    "score": 2,
                    "created_utc": 1653432628.0,
                    "response": "It already did you missed it",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9v6zra",
                    "author": "SmoothGoing",
                    "score": 2,
                    "created_utc": 1653432989.0,
                    "response": "Let's say bitcoin is money. Having another form of money available doesn't mean poor people somehow get more money. Everyone still has to earn their way in life.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9v81to",
                            "author": "Hughski",
                            "score": 1,
                            "created_utc": 1653433478.0,
                            "response": "So how does it help poor people when I own most/all of their money supply (including future supply). I’m saying why is BTC better cause that’s what I’m gonna own",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9vdojd",
                                    "author": "amretardmonke",
                                    "score": 1,
                                    "created_utc": 1653436128.0,
                                    "response": "Because a poor person can buy 0.001 BTC and keep it for a few years, and it will always be the same fraction of the overall pie. \n\nNothing you or any whale can do to take away their 1/21,000,000,000th of the bitcoin supply. Maybe they won't get richer, but they would prevent themselves from getting poorer.\n\n\nYou can't say the same thing with fiat currency.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9veo42",
                                    "author": "SmoothGoing",
                                    "score": 1,
                                    "created_utc": 1653436595.0,
                                    "response": "You don't need to get caught up in false narratives about what bitcoin is supposed to be or do. You can think for yourself.\n\nIf you have more money you help the poor by not being one of them.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9v7e5t",
                    "author": "civilian411",
                    "score": 2,
                    "created_utc": 1653433177.0,
                    "response": "This dude backhand flexing",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9vb8b0",
                    "author": "Creative-Molasses-60",
                    "score": 2,
                    "created_utc": 1653434977.0,
                    "response": "Lower income people are heavily impacted by inflation. \n\nDCAing in Bitcoin gives them the opportunity for their savings to grow, not be devalued by government printing. \n\nInflation benefits the upper class as their hard assets go up in value. Lower income individuals don’t have that luxury.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9vbo8h",
                    "author": "Keith_Kong",
                    "score": 2,
                    "created_utc": 1653435180.0,
                    "response": "If anyone says it will \"help poor people\" it's because a global reserve Bitcoin world would be one where inflation doesn't continually eat their wages away. It's about creating a world where wages don't need to \"keep up with inflation\".\n\nIn terms of returns, I think you're quite wrong while being right. Bitcoin isn't going to 1000X again but it's very realistic to imagine a 500k-1mil price range in the next 5-10 years. Depending on your investment now that could very well mean a home or retirement budget.\n\nI feel like you are equating Bitcoiners with the people over in r/CryptoCurrency. We aren't the same. We aren't the moonboys.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9vhm4m",
                    "author": "NiceDoctorBeam",
                    "score": 2,
                    "created_utc": 1653438021.0,
                    "response": "You have no credibility.  You opinions are not based upon understanding, knowledge, experience...",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9vlc4h",
                            "author": "Hughski",
                            "score": 1,
                            "created_utc": 1653439794.0,
                            "response": "Don’t wanna put a downer on you but all of our opinions are just our intelligence guided by our experience.\n\nLook forward to hearing about how BTC will help the poor when I already own more BTC than they will ever own in their emergency fund.\n\nDW, I already heard that 1BTC = 1BTC whichever tard came up with that lmfao",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9vvavg",
                                    "author": "NiceDoctorBeam",
                                    "score": 1,
                                    "created_utc": 1653444492.0,
                                    "response": "Sober up.  Maybe we can talk then.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9w3aku",
                                            "author": "Hughski",
                                            "score": 1,
                                            "created_utc": 1653448351.0,
                                            "response": "You’ve got a point because I’m wasted but I still don’t see how BTC can truly help poor people when I outstrip them in ownership 10 or even 100 or even 1000 or even 10,000 fold. When I sober up, please tell me how my owning 10,000x more of a magic bean helps a farmer with very little magic beans",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9vaqt4",
                    "author": "thebradybox",
                    "score": 1,
                    "created_utc": 1653434745.0,
                    "response": "Yah that's because your in crypto to get rich and not to remove the governments control of your money. We are not the same 😎",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9vb5zz",
                            "author": "Hughski",
                            "score": 1,
                            "created_utc": 1653434947.0,
                            "response": "Basically whether you win or lose, I win.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9vbh8q",
                                    "author": "thebradybox",
                                    "score": 2,
                                    "created_utc": 1653435090.0,
                                    "response": "You're missing completely what I'm saying. I'm saying it helps people out because no one on earth can tell me I can't transfer money to another person's wallet or another person transfer to my wallet. I literally said in my comment that its not about getting rich it's about other people not having control. I don't know what your saying 🤣 I'm glade your rich though bro good for you!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9vazs4",
                            "author": "Hughski",
                            "score": 0,
                            "created_utc": 1653434865.0,
                            "response": "Already rich and hedging my bets. Imagine I’m hedging with 1 btc and you’re playingwith 0.25btc … ok now you get it",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9vy2lh",
                                    "author": "AwaySupermarket3289",
                                    "score": 1,
                                    "created_utc": 1653445804.0,
                                    "response": "Why are you so arrogant? That sucks.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9w3yxh",
                                            "author": "Hughski",
                                            "score": 0,
                                            "created_utc": 1653448700.0,
                                            "response": "That’s reality",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9w4iub",
                                                    "author": "AwaySupermarket3289",
                                                    "score": 1,
                                                    "created_utc": 1653448973.0,
                                                    "response": "Hilarious and stupid",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9vhbmz",
                    "author": "SubstantialNinja",
                    "score": 1,
                    "created_utc": 1653437879.0,
                    "response": "It already has. -A formerly poor person",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9w24j2",
                    "author": "nullama",
                    "score": 1,
                    "created_utc": 1653447764.0,
                    "response": "> Personally I own 3 BTC\n\n[This random working class dude has more Bitcoin than you, wealthy person](https://er-bybitcoin.com):\n\n> Grinding the fiat job for another month in order to stack them sats again\n> \n> the stack that stands at ~4.06 today",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9w3tov",
                            "author": "Hughski",
                            "score": 1,
                            "created_utc": 1653448625.0,
                            "response": "Mind is a hedge though",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9w2mzr",
                    "author": "infopocalypse",
                    "score": 1,
                    "created_utc": 1653448019.0,
                    "response": "It is already helping poor people. BTC adoption is highest in the poorest countries for many reasons. It, allows remittances without losing 25-50% of the value sent. This is fucking life changing. If you hear places like Palestine talk about btc not only is there stupid fees, but in some instances gov lackeys require a wife, daughter,sister be slept with to allow money to come in to save a family from starvation. It also helps marginalized people and people living in dictatorships avoid having all their wealth outright just be stolen. It helps those in countries with failing currencies avoid losing everything by opting out of that currency. It banks those who have no way of being banked. I appreciate the conversation  OP but if that is your view you gotta keep on consuming knowlege on btc and you'll notice the difference.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9waod4",
                    "author": "wkw3",
                    "score": 1,
                    "created_utc": 1653452307.0,
                    "response": "What a sad person. I'm sorry you feel the need to point at your good fortune to try to feel some sort of superiority. You're obviously lacking something in your life if you're fishing for validation on Reddit.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9wiyiu",
                    "author": "talanhorne",
                    "score": 1,
                    "created_utc": 1653457627.0,
                    "response": "Problem is, all the poor people it *has* helped are no longer poor.\n\nHence the misunderstanding.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ux3h4c",
            "title": "Question",
            "url": "https://www.reddit.com/r/Bitcoin/comments/ux3h4c/question/",
            "author": "Thecryptoaspect",
            "created_utc": 1653433252.0,
            "score": 2,
            "num_comments": 11,
            "subreddit": "Bitcoin",
            "selftext": "Do you find talking about crypto to your friends and family more hassle than it’s worth?\n\nI feel i am wasting my breath… because it isn’t simplified and main stream.. I think you either get it or you don’t at the moment...I have spoken to various people about it and some people are all for it and it seems you if you aren’t invested in it, it’s a huge grey area of doubt and deception. The people who grate on me the most are the “ the pound/dollar has always been around it will never crash “ and they are so grounded and ignorant about it. \n\nDoes anyone else come across the close minded people or is it just my circle of friends?…",
            "stickied": false,
            "comments": [
                {
                    "id": "i9vttk3",
                    "author": "Nada_Lives",
                    "score": 3,
                    "created_utc": 1653443803.0,
                    "response": "Maybe if you talked about Bitcoin instead of just *crypto*...",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9vbwk6",
                    "author": "PraetorianHawke",
                    "score": 2,
                    "created_utc": 1653435290.0,
                    "response": "My dad thinks its neat doesnt understand any of it.  \"How can you make money from nothing, who determines what it's worth, what backs it.etc. etc.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9vc874",
                    "author": "JayAreH",
                    "score": 1,
                    "created_utc": 1653435438.0,
                    "response": "It’s like that with all new technologies and change in general I think. With Bitcoin it may just be even worse, being disruptive against the fundamental concept of money or value that people rely so heavily on",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9vdw96",
                    "author": "Nappingspider",
                    "score": 1,
                    "created_utc": 1653436228.0,
                    "response": "As with a lot of other contentious matters these days, if you were so open-minded yourself you would just let others believe in what they believe instead of trying to shove your own beliefs down their throats, then getting upset when they're not with you lol",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9vhyq9",
                    "author": "Ok_Aerie3546",
                    "score": 1,
                    "created_utc": 1653438187.0,
                    "response": "My brother actually likes banks😂😂😂",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9vqmzu",
                    "author": "konokonohamaru",
                    "score": 1,
                    "created_utc": 1653442313.0,
                    "response": "You have to explain it the right way. I've been able to convince many of my friends and family why they should own at least a little Bitcoin",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9vyxvv",
                    "author": "savinelli_smoker",
                    "score": 1,
                    "created_utc": 1653446214.0,
                    "response": "It’s so ingrained in peoples mind that our fiat is safe (even they know it’s dropping constantly in purchasing power), and anything else is risky (it’s not supported by gov, blah blah)\n\nHonestly the best trick I have (with limited success) is to ask the person to think about what makes gold valuable.\n\nGold has only limited use, certainly far less useful than iron or copper, why is it more valuable than copper? It’s not the utility, if not utility, then what? It’s not supported by gov, it’s not a legal tender anywhere anymore, but look at a 100 year chart compared to USD. Why did it behave the way it did?\n\nI found that this is the best shot I have to get them to think deeper about what money really is. But if they remain stubbornly unconvinced I’ll just leave them alone, if we’re right they will eventually come (later). They will just buy bitcoin at the price they deserve.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9w7ubr",
                            "author": "mrxsdcuqr7x284k6",
                            "score": 2,
                            "created_utc": 1653450707.0,
                            "response": "What you're describing is called the Socratic Method. It's very effective.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9wcgfd",
                                    "author": "savinelli_smoker",
                                    "score": 1,
                                    "created_utc": 1653453374.0,
                                    "response": "Haha I had no idea. Just looked up the term, thanks learn something everyday 🤜🏼🤛🏼",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9wai1w",
                    "author": "dadlif3",
                    "score": 1,
                    "created_utc": 1653452204.0,
                    "response": "I'll talk about bitcoin with people but whatever they choose to do or believe is out of my control. I won't lose sleep over it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ytnuo",
                    "author": "igadjeed",
                    "score": 1,
                    "created_utc": 1653503228.0,
                    "response": "> talking about crypto\n\nNo crypto here, only Bitcoin  \nHow many \"crypto\" subs did you post this trash into?",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}