{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "v1czgm",
            "title": "Wonder if some people were at Euphoria the past week",
            "url": "https://i.redd.it/zn1p8p619p291.jpg",
            "author": "polloponzi",
            "created_utc": 1653954073.0,
            "score": 65,
            "num_comments": 6,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "iam3n6k",
                    "author": "thefullmcnulty",
                    "score": 11,
                    "created_utc": 1653961559.0,
                    "response": "Brilliant.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iam6p1q",
                    "author": "dfunkmedia",
                    "score": 2,
                    "created_utc": 1653963134.0,
                    "response": "Gonna save this one and check in next year because there's no bull run coming with historic inflation, JPow saying wages need to go down, 1/3 of the world's wheat supply not even getting planted, consumer sentiments getting worse by the day, etc. We might have stopped the 5% daily slide but this ride is far from over with a global recession all but confirmed. Short interest on everything is insane right now, big money stocks like APPL and TSLA have slid 30%+ even with great quarterly revenue reports. Sorry but I lived through the Dot-Com and 2008 bursts and both of them started like this but the major effects weren't felt for 2 years. Just wait, we'll be back to the Cash 4 Gold places putting guys on the corner spinning signs again soon enough.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iam8i62",
                            "author": "No-Lemon-2287",
                            "score": 13,
                            "created_utc": 1653964073.0,
                            "response": "Your certainty is a bottom signal. You know that right?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iamqt7q",
                                    "author": "No_Yogurtcloset_2547",
                                    "score": -1,
                                    "created_utc": 1653975416.0,
                                    "response": "Your certainty of deriving a bottom signal from a random guy saying a random thing is stupidity. You know that right? lol",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iamusa7",
                    "author": "Peter4real",
                    "score": 1,
                    "created_utc": 1653978503.0,
                    "response": "Welp, I don’t really care. I however do believe I was a genius for buying stocks and BTC two weeks ago with the dip to 26-27k. Money well spent.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}