{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uq3uw5",
            "title": "How diverse should a diverse portfolio be?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uq3uw5/how_diverse_should_a_diverse_portfolio_be/",
            "author": "ididapootatoo",
            "created_utc": 1652613074.0,
            "score": 5,
            "num_comments": 24,
            "subreddit": "Bitcoin",
            "selftext": "I’ve been researching the benefits of having a diverse portfolio of assets. The trouble I have is the more I research into different coins and their use cases the more I want to invest.\n\nHowever I’m starting off small using the DCA (dollar cost average) strategy but the more assets I invest in ultimately reduced the amount I’m investing in each.\n\nI’m particularly having trouble deciding which unique block chain to invest in and which metaverse asset to invest in.\n\nI’m willing to hold the coin and wait for the future.\n\nIs it bad to have too many? Only inputting a small amount across lots of assets?",
            "stickied": false,
            "comments": [
                {
                    "id": "i8ombtb",
                    "author": "Knurlinger",
                    "score": 16,
                    "created_utc": 1652613250.0,
                    "response": "You’re in the Bitcoin sub. The only answer here is BTC.\n\nThe longer people invest, the more they invest in BTC in the end. So stick to BTC at least for the majority of your portfolio.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8ompsi",
                            "author": "ididapootatoo",
                            "score": 6,
                            "created_utc": 1652613551.0,
                            "response": "Ah I’ll post in the crypto, my bad",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8pdu7v",
                                    "author": "amretardmonke",
                                    "score": 5,
                                    "created_utc": 1652628282.0,
                                    "response": "Make sure you diversify outside of crypto aswell. Land, metals, stocks etc.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8ooasi",
                    "author": "Redhead_Empire",
                    "score": 10,
                    "created_utc": 1652614722.0,
                    "response": "Do not diversify in the crypto space. However in the grand investment schem you should be diversified into multiple asset classes",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8or6mf",
                            "author": "UranusisGolden",
                            "score": 6,
                            "created_utc": 1652616639.0,
                            "response": "This. \n\n\nStocks crypto real estate business those are examples of different asset classes. Trying to diversify by buying more crypto is a rookie mistake. BTC leads everything. In general it all goes with BTC.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "uq2fk7",
            "title": "What’s a good price to get into btc?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uq2fk7/whats_a_good_price_to_get_into_btc/",
            "author": "Vegetabba",
            "created_utc": 1652606853.0,
            "score": 3,
            "num_comments": 28,
            "subreddit": "Bitcoin",
            "selftext": "I already have some btc. My goal is buy as much while under 30k as possible. Should I be changing my outlook or is this a pretty decent strategy?",
            "stickied": false,
            "comments": [
                {
                    "id": "i8ogw09",
                    "author": "hiop1992",
                    "score": 16,
                    "created_utc": 1652608736.0,
                    "response": "The best time to plant a tree was 10 years ago.\nThe second best time to plant a tree is today.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8of8w8",
                    "author": "Wolfos9",
                    "score": 8,
                    "created_utc": 1652607302.0,
                    "response": "I was just as happy to buy at 60k as I was at 30k. I have full confidence in BTC and where it is going.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8oifjn",
                    "author": "igadjeed",
                    "score": 4,
                    "created_utc": 1652610059.0,
                    "response": "Buy at $0.80. Sell at $1.20",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uq891c",
            "title": "Remember to be careful in the crypto world and beware of scams. Here is the list of the most common scams and how to avoid them",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uq891c/remember_to_be_careful_in_the_crypto_world_and/",
            "author": "SimpleSwapExchange",
            "created_utc": 1652627923.0,
            "score": 8,
            "num_comments": 12,
            "subreddit": "Bitcoin",
            "selftext": "**Imposter scam**\n\nScammers pretend to be moderators, admins or developers, message you and ask for your private key. *Remember to never share your private key to anyone. Always check whether you’re talking to the real admin.*\n\n**Phishing & fake website**\n\nScammers create fake websites of exchange platforms or crypto wallets. *Always carefully check the URL, domain, quality of the website, design etc.*\n\n**Fake app**\n\nFake apps can be placed in Google Play and the App Store. *Always check the reviews and number of downloads, research the developer.*\n\n**Giveaway scam**\n\nScammers promise to multiply the cryptocurrency sent to them. *Never send money to an unknown person or project. Always research a project.*\n\n**Trader scam**\n\nScammers can tell you about their return and ask to follow their advice. *Do not believe in unrealistic guaranteed returns, always do your own research. Avoid poorly written, incomplete or non-existent whitepaper.*",
            "stickied": false,
            "comments": [
                {
                    "id": "i8pefet",
                    "author": "NiceDoctorBeam",
                    "score": 11,
                    "created_utc": 1652628552.0,
                    "response": "Also: Alt coins are scams.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8pjhzg",
                            "author": "llewsor",
                            "score": 10,
                            "created_utc": 1652630788.0,
                            "response": "“altcoins exist to steal your bitcoin” -max keiser",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "uq8e1r",
            "title": "Bitcoin in the Media",
            "url": "https://i.redd.it/t9mpeg60rnz81.jpg",
            "author": "Bitcoin__Hodler",
            "created_utc": 1652628340.0,
            "score": 946,
            "num_comments": 69,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8pp3dx",
                    "author": "ILikePracticalGifts",
                    "score": 52,
                    "created_utc": 1652633191.0,
                    "response": "🙋‍♂️ I was guilty of this in March 2020 when it bottomed out around $4k. That was before I started actually researching.\n\nNow I feel like a damn fool 😔",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8pydj8",
                            "author": "Possible-Ad-7058",
                            "score": 10,
                            "created_utc": 1652637212.0,
                            "response": "Guilty of what?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8q0rzl",
                                    "author": "deadontheinternet",
                                    "score": 16,
                                    "created_utc": 1652638258.0,
                                    "response": "Probably thinking of bitcoin as dead / “over” while knowing next to nothing about it",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8qb9ya",
                                            "author": "ianyboo",
                                            "score": 6,
                                            "created_utc": 1652642927.0,
                                            "response": "Such a strange feeling, I keep having these fleeting \"welp... This time it's different, maybe it ***is*** over now that I've joined the party...\" type thoughts even though I've done enough research to know that it isn't the case. Can't believe how much my mind rebels against an optimistic thought sometimes...",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8qecz6",
                                                    "author": "deadontheinternet",
                                                    "score": 2,
                                                    "created_utc": 1652644300.0,
                                                    "response": "I’ve had that same feeling multiple times from 2016-2019 and even had someone who did very will trading bitcoin in 2017 tell me it was *in fact* the end and not to bother. After hearing about it for years and years and still seeing it going strong I said fuck it and started researching. At some point you gotta look around and say we’re at the point where it doesn’t seem realistic that this will go away",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8qgwo6",
                                                            "author": "ianyboo",
                                                            "score": 1,
                                                            "created_utc": 1652645424.0,
                                                            "response": "If 5 years from now it's still 30k I'm going to feel like a total moron lol (30k is when I got in last summer when it was dipping down to 29k)",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8qr3xz",
                                                                    "author": "Dont_Say_No_to_Panda",
                                                                    "score": 1,
                                                                    "created_utc": 1652649870.0,
                                                                    "response": "And then it will 10x after you sell.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8q1hvd",
                            "author": "who-evun_karezz",
                            "score": 7,
                            "created_utc": 1652638575.0,
                            "response": "We all get bitcoin at the price we deserve my friend.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8q4l3s",
                                    "author": "bstardif",
                                    "score": 4,
                                    "created_utc": 1652639948.0,
                                    "response": "That saying has always bothered me a bit. Bitcoin started when I was still in middleschool and by the time I finished high-school and starting college I had student loans and my first laptop but by then mining was on specialized rigs. I think those that didn't have financial freedom or were the legal age to trade when bitcoin was lower priced and are only getting in this last year or so didn't \"deserve\" the higher prices, just didn't have a choice. And what about those that live in countries with poor internet access? Hardly can say they deserve to have missed out on scooping up cheap sats.\n\nNow those that have some money to invest and are semi financially literate, as well as old enough to have started when it was taking off but chose not too? They're getting the price they deserve.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8q5565",
                                            "author": "OtherDetective",
                                            "score": 3,
                                            "created_utc": 1652640193.0,
                                            "response": "Everyone deserves their karma.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8q66ec",
                                                    "author": "dont_you_love_me",
                                                    "score": 1,
                                                    "created_utc": 1652640648.0,
                                                    "response": "I’m a hard determinist. There is no karma, but whatever happens is unavoidable. It’s not really retribution or deserving anything. It is simply what must happen.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8q8bs6",
                                                            "author": "climb-high",
                                                            "score": 3,
                                                            "created_utc": 1652641605.0,
                                                            "response": "This is a universe of cause and effect. You reap the consequences of your actions in this life or others, and that’s “karma.” I respect your beliefs, of course.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8qhgdt",
                                                                    "author": "dont_you_love_me",
                                                                    "score": 1,
                                                                    "created_utc": 1652645667.0,
                                                                    "response": "“Consequences” are things that we as humans make up. The universe doesn’t care about anything we do. It is not a sentient agent. And it makes sense since there is a very disproportionate assignment of this karma that you are talking about. A lot of people do bad things and don’t experience personal consequences. Often times, it actually seems that they get rewarded for behaving in a way that would advantage themselves at the expense of others.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i8qjvmi",
                                                                            "author": "bstardif",
                                                                            "score": 1,
                                                                            "created_utc": 1652646735.0,
                                                                            "response": "On top of that karma is a specific word as part of multiple belief systems from india, karma builds up over your life and has more to do with your next life than your current luck.\n\nBut I also don't believe in it or luck or an afterlife and completely agree with you I'm just chiming in to the thread.\n\n Also have no idea why my comment on people in different situations who would have liked to adopt bitcoin early but couldn't due to age restrictions, tech restrictions or financial restrictions don't necessarily deserve the price they have to pay to begin stackin.\n\nWhich actually brings up an interesting thought (to me anyway). If bitcoin eventually were to become the standard and people became their own bank those in poor countries would still be poor because they got priced out before the tech in their country allowed adoption by the individual. So really this only would help those in the western world, so in the grand scheme it changes nothing, poor people are still screwed.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i8qklrt",
                                                                                    "author": "dont_you_love_me",
                                                                                    "score": 2,
                                                                                    "created_utc": 1652647050.0,
                                                                                    "response": "Correct. The solution is to end money and resource hoarding altogether. Supporting these alternate methods however will speed up the dismantling process since we can shift resources towards newer and better ideas instead of letting them sit on the established ways of doing things. If we can seek as close to perfect production with as close to zero cost as possible and then we should be able to distribute and elevate everyone up to top status. The current rulers are biased towards depravity. We just have to overwrite their biases.",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "i8qi4jq",
                                                            "author": "OtherDetective",
                                                            "score": 1,
                                                            "created_utc": 1652645967.0,
                                                            "response": "Karma is a force that started before life and after life. It’s not a function of the “now”",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8qj61x",
                                                                    "author": "dont_you_love_me",
                                                                    "score": 1,
                                                                    "created_utc": 1652646424.0,
                                                                    "response": "All of your memories are stored as data in your brain and you access it in the now to understand that you are a consistently existing entity. Your entire reality is essentially a guess, and your brain guesses that you are the person that you are. It also has an understanding of what “morals” are, but it isn’t a guarantee that your brain will produce a behavior that will be consistent with its understanding of what might be moral or just. How can you expect a brain that has a hard time of remembering where the keys are in the morning to be ethically and morally consistent? That is insane. Brains are generally stupid and any karmatic expectations are based on a misunderstanding of how the brain operates.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i8qua0j",
                                            "author": "ProfessionalPizza463",
                                            "score": 1,
                                            "created_utc": 1652651237.0,
                                            "response": "They're will always be another great investment in everyone's lifetime.  Money just changes hands.  You're older now and wiser.  Be ready my friend! It's all about opportunity and timing",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i8qbb0r",
                                    "author": "KeyWest-",
                                    "score": 1,
                                    "created_utc": 1652642941.0,
                                    "response": "We deserve your friend?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8qrvro",
                            "author": "nickname432",
                            "score": 1,
                            "created_utc": 1652650205.0,
                            "response": "Happened to me in 2013. Then bitcoin made my life hell for many years actually. I wanted it to fail. Then I went down the rabbit hole, corrected my mistake, invested and haven't looked back ever since",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8qsct8",
                            "author": "mrASSMAN",
                            "score": 1,
                            "created_utc": 1652650410.0,
                            "response": "Me too.. I was disparaging people on Reddit talking about investing in btc in 2019 when it was around $5k.. it did crash again lower and I thought I was right but then 2020 happened lol\n\nI was glad to have avoided it after the crash in ‘18 but ended up taking it more seriously in the latest wave",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8pu57w",
                    "author": "i_heart_dial-up",
                    "score": 18,
                    "created_utc": 1652635382.0,
                    "response": "yep, crypto dies every few months or so in the mainstream media. Not to mention the demonization of people that buy, sell and exchange crypto.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8qsmjm",
                            "author": "mrASSMAN",
                            "score": 1,
                            "created_utc": 1652650527.0,
                            "response": "People get annoyed hearing about it but then they don’t want to miss out on the next wave up which fuels it higher than before (FOMO)",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8pg3fb",
                    "author": "Fun_Square_8737",
                    "score": 41,
                    "created_utc": 1652629298.0,
                    "response": "Bunch of people who are jealous they didn’t buy Bitcoin in 2012 now they don’t want anyone to do well . Honestly sad to witness how envious people get . Literally praying on bitcoins downfall , what a bunch of losers",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8pzld0",
                            "author": "LiveNDiiirect",
                            "score": 9,
                            "created_utc": 1652637748.0,
                            "response": "I’m praying on bitcoins downfall… so I can buy more for cheap",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8pzq4m",
                                    "author": "recon89",
                                    "score": 1,
                                    "created_utc": 1652637805.0,
                                    "response": "Yep yep yep",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8q088m",
                            "author": "whitslack",
                            "score": 6,
                            "created_utc": 1652638022.0,
                            "response": "[Crab mentality](https://en.wikipedia.org/wiki/Crab_mentality)",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8qu0pq",
                            "author": "GET_OUT_OF_MY_HEAD",
                            "score": 1,
                            "created_utc": 1652651125.0,
                            "response": "Tell me about it. Have only been buying small amounts since 2018, but earned enough to buy a car with cash when the price hit $40k. I mentioned this in a tech subreddit; was downvoted to hell and the only response I got was \"please sir, can you hurry up with my order? I'm hungry\".\n\nFucking envious jackasses (okay I'll admit that it was a *little* funny, but that isn't the point). My only reply was \"oh the irony\".",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8qusb0",
                                    "author": "Fun_Square_8737",
                                    "score": 1,
                                    "created_utc": 1652651463.0,
                                    "response": "Sad people compensating",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8ppmfd",
                    "author": "babu_chapdi",
                    "score": 15,
                    "created_utc": 1652633421.0,
                    "response": "The whole economy is bubble. Everything rises and no one bats an eye, once Bitcoin rises it's a bubble.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8q1ic5",
                            "author": "Skouaire",
                            "score": 9,
                            "created_utc": 1652638581.0,
                            "response": "You don't really understand the concept of bubble, do you ?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8q1y4a",
                                    "author": "babu_chapdi",
                                    "score": 2,
                                    "created_utc": 1652638771.0,
                                    "response": "All I am trying to say is assets go up and no one cares. Its only when Bitcoin goes up people try to find bubbles in everything.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8q2tny",
                                            "author": "slant__i",
                                            "score": 2,
                                            "created_utc": 1652639154.0,
                                            "response": "r/REbubble",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8q8uqe",
                                                    "author": "climb-high",
                                                    "score": 1,
                                                    "created_utc": 1652641841.0,
                                                    "response": "That sub is insane and I think it’s mostly 18 year olds who have read a few Reddit posts.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8qawoh",
                                                            "author": "slant__i",
                                                            "score": 1,
                                                            "created_utc": 1652642761.0,
                                                            "response": "Yes it’s only 18yr old redditors who think there’s a real estate bubble because it’s an asset class that has soared in value compared to median income.\n\nDefinitely no one else talking about this…",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8qc5i4",
                                                                    "author": "climb-high",
                                                                    "score": 1,
                                                                    "created_utc": 1652643319.0,
                                                                    "response": "I like the posts by realtors and lenders there who point out the severity of the problem, but put it into context unlike all the posts about “hooms”",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i8qdbw8",
                                                                            "author": "slant__i",
                                                                            "score": 1,
                                                                            "created_utc": 1652643841.0,
                                                                            "response": "Hooms are like stonks, they only go up.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8pumeu",
                    "author": "Rtbrosk",
                    "score": 5,
                    "created_utc": 1652635586.0,
                    "response": "Anyone notice CNBC hates bitcoin but they can't stop talking about it......wonder who is paying them",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8qt0h9",
                            "author": "mrASSMAN",
                            "score": 1,
                            "created_utc": 1652650697.0,
                            "response": "I’ve noticed all mainstream finance outlets are taking crypto far more seriously than they used to, even though they generally still deride its existence",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8qtiab",
                                    "author": "Rtbrosk",
                                    "score": 1,
                                    "created_utc": 1652650906.0,
                                    "response": "If u need their opinion to confirm why u own bitcoin....maybe u need to educate yourself",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8qtkir",
                                            "author": "mrASSMAN",
                                            "score": 1,
                                            "created_utc": 1652650932.0,
                                            "response": "what",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8q7495",
                    "author": "Godspiral",
                    "score": 2,
                    "created_utc": 1652641067.0,
                    "response": "This is definitely the only 2 media narratives.  Very aggressive on the dead (short GBTC, there is no alternative)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8qhou7",
                    "author": "bobbyv137",
                    "score": 2,
                    "created_utc": 1652645771.0,
                    "response": "Confession: I used to think this way too. Why? Because I wasn’t ‘in the space’ nor had I taken actual meaningful time to research and learn about Bitcoin. \n\nSo it’d go something like this:\n\n1. Someone casually mentions Bitcoin. I think it sounds cool but don’t act on it\n\nConsiderable time passes \n\n2. I briefly see a new story about how the Bitcoin price is pumping. I think ‘Oh wow. Guess I missed the boat. Never mind’\n\nI go on with my life and don’t think about it, until…\n\n3. Bitcoin’s in the news again and it’s collapsed in price. ‘Haha! Knew it! Phew’, I think to myself \n\nI go on with my life and don’t think about it again, until….yes..you guessed it…the cycle repeats itself. \n\nThankfully I won’t be missing out next time.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8qtdc5",
                            "author": "mrASSMAN",
                            "score": 1,
                            "created_utc": 1652650848.0,
                            "response": "Yep exactly, I knew about Bitcoin in the very early days actually but never took it seriously and was glad to have avoided it after the crashes.. but now I’m much more involved in crypto than I had ever expected to be",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8q1ncc",
                    "author": "zSprawl",
                    "score": 1,
                    "created_utc": 1652638641.0,
                    "response": "The economy is this shape of up and down because of credit and speculation. With crypto, it’s uncharted and wild, so you get the ups and downs even more dramatically. It’s part of the fun!\n\n🤷‍♂️",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8q2d30",
                    "author": "ultimatemuffin",
                    "score": 1,
                    "created_utc": 1652638950.0,
                    "response": "This is literally a boom-bust cycle.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8qas9b",
                    "author": "RelativityCoffee",
                    "score": 1,
                    "created_utc": 1652642705.0,
                    "response": "Original source:\n\nhttps://twitter.com/craigwarmke/status/1349712696401387520",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8qhcj0",
                    "author": "Uberse",
                    "score": 1,
                    "created_utc": 1652645620.0,
                    "response": "You left off a \"Dead\" on the chart -- it's currently dead, for the moment.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8qlrw8",
                    "author": "StandbyBigWardog",
                    "score": 1,
                    "created_utc": 1652647554.0,
                    "response": "r/agedlikemilk",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8qmp9a",
                            "author": "guryfitze",
                            "score": 1,
                            "created_utc": 1652647943.0,
                            "response": "?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8qoc0w",
                    "author": "Tariiiixx",
                    "score": 1,
                    "created_utc": 1652648650.0,
                    "response": "Visit here[here](https://www.cryptologi.st/news) for the latest crypto news",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8qqc6y",
                    "author": "Moist-Gur2510",
                    "score": 1,
                    "created_utc": 1652649534.0,
                    "response": "And every single time the narrative is essentially the same ‘yeah but this time is different’ 😂🤯",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8qtyot",
                    "author": "ProfessionalPizza463",
                    "score": 1,
                    "created_utc": 1652651100.0,
                    "response": "It's humorous that they label it bubble and dead.  I always thought of it as Bull and Bear.  Lol",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8puuvw",
                    "author": "manofftherails",
                    "score": -1,
                    "created_utc": 1652635689.0,
                    "response": "cope",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8peu8w",
                    "author": "HlIlM",
                    "score": -19,
                    "created_utc": 1652628739.0,
                    "response": "If it comes back a few times it must be infallible.  A decentralized economy cannot be built on bitcoin, it is too inefficient and unstable by design. It's future value will only be nostalgic.\n\nNo current coin is the future, trade them all short term.  It is a long road to change the world.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8po6uo",
                            "author": "Nuclearstarfishicide",
                            "score": 16,
                            "created_utc": 1652632802.0,
                            "response": "No coin can replicate the start of Bitcoin.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8psg2e",
                            "author": "louisbrunet",
                            "score": 7,
                            "created_utc": 1652634646.0,
                            "response": "how much of a loser are you to spend time spreading fud on a thing you don’t own 3 month old redditor?",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8q1rk3",
                            "author": "zSprawl",
                            "score": 3,
                            "created_utc": 1652638693.0,
                            "response": "It may not become the world currency but it’s already used as one internationally. \n\n🤷‍♂️",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8q1rlz",
                            "author": "who-evun_karezz",
                            "score": 3,
                            "created_utc": 1652638693.0,
                            "response": "Shut up",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8q10rg",
                            "author": "deadontheinternet",
                            "score": 2,
                            "created_utc": 1652638365.0,
                            "response": "Why would it die for good ever lol? Any reason at all?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "uq8cpn",
            "title": "Texas Bitcoin Miners Turn Off to Conserve Power for the Grid",
            "url": "https://www.prnewswire.com/news-releases/texas-bitcoin-miners-turn-off-to-conserve-power-for-the-grid-301547420.html",
            "author": "Bitcoin__Hodler",
            "created_utc": 1652628226.0,
            "score": 72,
            "num_comments": 48,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8prw00",
                    "author": "arbalest_22",
                    "score": 32,
                    "created_utc": 1652634401.0,
                    "response": "The only reason I turned my rig off was because I can currently buy more with the money I’m spending on electricity then I’m actually mining. Once the price goes back up the rig is coming back on.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8q0toj",
                            "author": "DivineRusher",
                            "score": 3,
                            "created_utc": 1652638279.0,
                            "response": "Taxes are owed when it's mined, not when it's sold. Because you do not pay capital gain taxes on mined coins it's better to mine when prices are down.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8q4asd",
                                    "author": "arbalest_22",
                                    "score": 6,
                                    "created_utc": 1652639822.0,
                                    "response": "I don’t pay any taxes period when I buy it and there are most certainly taxes owed when you sell it. Not that I’m about to sell a single sat.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8qrhj0",
                                            "author": "More-Adventure2",
                                            "score": 1,
                                            "created_utc": 1652650033.0,
                                            "response": "That’s not true. If you mined $10. You can pay $2 of tax at the end of the year. Once that remaining $8 grows to $80 over several years. You pay zero tax when you sold it because you already paid tax up front on it",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8qt42t",
                                                    "author": "arbalest_22",
                                                    "score": 1,
                                                    "created_utc": 1652650741.0,
                                                    "response": "I’m not about to sell it. Also, I elected not to pay that in electricity. Do you even mine?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8qtb3n",
                                                            "author": "More-Adventure2",
                                                            "score": 1,
                                                            "created_utc": 1652650824.0,
                                                            "response": "Yes I do. Also it’s very dumb to base it on the price of bitcoin. Because coins you get today, are still the same coins you have when the price goes back up. Your logic is beyond stupid",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8qu57h",
                                                                    "author": "arbalest_22",
                                                                    "score": 1,
                                                                    "created_utc": 1652651179.0,
                                                                    "response": "When I take payments in BTC and I HODL BTC and don’t hold alts it’s pretty damn smart to base it off the price of BTC. The “price” of pretty much every alt is based on BTC. WTF are you even talking about?",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i8qu7re",
                                                                            "author": "More-Adventure2",
                                                                            "score": 1,
                                                                            "created_utc": 1652651210.0,
                                                                            "response": "You are too dumb to even talk to.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i8qucp5",
                                                                                    "author": "arbalest_22",
                                                                                    "score": 1,
                                                                                    "created_utc": 1652651270.0,
                                                                                    "response": "Have fun being poor.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i8quhuv",
                                                                                            "author": "More-Adventure2",
                                                                                            "score": 1,
                                                                                            "created_utc": 1652651333.0,
                                                                                            "response": "Lol coming from the guy who stops mining when the dollar price of bitcoin comes down hahahaha. Only if you sold bitcoin they say you mined it, would it even matter. The stupidity that you think todays price has anything to do with bitcoin you hodl is hilarious",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i8qtex2",
                                                    "author": "Brettanomyces78",
                                                    "score": 1,
                                                    "created_utc": 1652650866.0,
                                                    "response": "That's completely untrue.\n\nMined coins are taxed as income.  If you later sell those coins for more than the amount they were worth when you mined them, you have to additionally pay capital gains.  \n\nRead the IRS guidance before spreading misinformation.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8qtgn0",
                                                            "author": "More-Adventure2",
                                                            "score": 1,
                                                            "created_utc": 1652650886.0,
                                                            "response": "Wrong",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8quh8b",
                                                                    "author": "Brettanomyces78",
                                                                    "score": 1,
                                                                    "created_utc": 1652651326.0,
                                                                    "response": "What a wealth of evidence you've provided to support your nonstandard interpretation of the IRS guidance.\n\n/s\n\nBetter hope you don't mine, or never get audited.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i8quoxe",
                                                                            "author": "More-Adventure2",
                                                                            "score": 1,
                                                                            "created_utc": 1652651421.0,
                                                                            "response": "Mine all the time and sell my coins all the coin lol",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i8qus7q",
                                                                                    "author": "Brettanomyces78",
                                                                                    "score": 1,
                                                                                    "created_utc": 1652651462.0,
                                                                                    "response": "Actually, I hope you do get audited at some point.",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i8qoiee",
                                    "author": "smartfbrankings",
                                    "score": 1,
                                    "created_utc": 1652648727.0,
                                    "response": "You clearly are not a tax attorney.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8quoqh",
                                            "author": "Brettanomyces78",
                                            "score": 1,
                                            "created_utc": 1652651418.0,
                                            "response": "That person isn't polite, either.\n\nWrong and rude is a bad combination.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i8q5dwx",
                                    "author": "Keith_Kong",
                                    "score": 5,
                                    "created_utc": 1652640298.0,
                                    "response": "This isn’t true, you pay taxes when it’s mined (as if the cost basis was 0 but it’s not considered cap gains) and then you pay cap gains tax when it’s sold (with the cost basis being the price when you acquired).\n\nSo mined Bitcoin is basically always taxed with a cost basis of 0, though the majority is taxed as income rather than cap gains (much smaller percentage) if you sell with small gains from when mined.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8qckj2",
                                    "author": "glynn_frye",
                                    "score": 1,
                                    "created_utc": 1652643508.0,
                                    "response": "I think that prices are not going to go down as this is not a good choice to make.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8pyttu",
                            "author": "S9Togusa",
                            "score": -2,
                            "created_utc": 1652637413.0,
                            "response": "Wouldn't it still be OK to mine at a loss in order to keep stacking ?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8pzc1c",
                                    "author": "JSchuler99",
                                    "score": 28,
                                    "created_utc": 1652637636.0,
                                    "response": "Why would he do that when he can buy it for cheaper.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8q0dep",
                                    "author": "arbalest_22",
                                    "score": 13,
                                    "created_utc": 1652638084.0,
                                    "response": "Naw, I can buy it cheaper right now. Not only that, I’m prolonging the life of my GPUs by not running it when I don’t need to.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8q5nio",
                                            "author": "WeekendQuant",
                                            "score": 6,
                                            "created_utc": 1652640416.0,
                                            "response": "You're not running ASIC miners?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8qf9i3",
                                                    "author": "JohnnyPreston13",
                                                    "score": 1,
                                                    "created_utc": 1652644703.0,
                                                    "response": "Yeah it is more like every miner just want to do that as well.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i8qtg4g",
                                    "author": "theospatial",
                                    "score": 1,
                                    "created_utc": 1652650880.0,
                                    "response": "Your benefit here is that you are mining bitcoin without a transaction history. Depending on your privacy setup, this could help in obscuring your UTXOs from entities like chainalysis, in addition to the service you are providing the network. If you're looking to simply stack, buying will net you more sats per dollar expended.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8qe03l",
                                    "author": "Vigilias",
                                    "score": 1,
                                    "created_utc": 1652644143.0,
                                    "response": "Um.. what? No, that's the opposite of stacking. Unless you want to buy my bitcoin at twice the market value and call it \"stacking\"?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8qlatd",
                            "author": "ShittingOutPosts",
                            "score": 0,
                            "created_utc": 1652647353.0,
                            "response": "If you expect the price to go up, why would you ever turn your rig off?  Are you paid in different amounts of sats depending on the difficulty?  Serious questions.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8qm5dh",
                                    "author": "arbalest_22",
                                    "score": 1,
                                    "created_utc": 1652647714.0,
                                    "response": "Did you not read my post? Like I already stated, I can buy more based on the cost of electricity vs running my rig. Not running my rig right now prolongs the life of my GPUs.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8ptn15",
                    "author": "baconcheeseburgarian",
                    "score": 19,
                    "created_utc": 1652635167.0,
                    "response": "It's only May and the Texas grid is tapping out.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8piuxb",
                    "author": "coinfeeds-bot",
                    "score": 5,
                    "created_utc": 1652630515.0,
                    "response": "tldr; The Texas Blockchain Council, a trade association representing the bitcoin mining industry in Texas, announced today that the bitcoin miners responded to the conservation notice that was issued by ERCOT yesterday. Some facilities shut down while many will ramp down in the afternoons this weekend when power is in high demand but then turn back on overnight when demand subsides.\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8q8dep",
                    "author": "acegarrettjuan",
                    "score": 2,
                    "created_utc": 1652641625.0,
                    "response": "IT’S WORKING",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8pig9b",
                    "author": "caploves1019",
                    "score": 3,
                    "created_utc": 1652630339.0,
                    "response": "2 days ago the hashrate was at 226 EH/s\n\nToday, the hashrate is at 233 EH/s\n\nFoundry Digital (USA) is showing an increase of hash power in the last 24 hours, not a decrease...",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8ppbno",
                            "author": "whitslack",
                            "score": 13,
                            "created_utc": 1652633291.0,
                            "response": "The network hashrate is *all* miners, not just those in Texas.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8pzy3t",
                                    "author": "Toasty_MutantMedia",
                                    "score": -1,
                                    "created_utc": 1652637899.0,
                                    "response": "I mean… how’d it go **up** if a large chuck of miners have gone off??? \n\nWhat, miners everywhere else decided to ramp up?? \n\nLol. The delusion.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8q0h0c",
                                            "author": "BeastMiners",
                                            "score": 7,
                                            "created_utc": 1652638127.0,
                                            "response": "Hash rate is calculated on the speed of blocks being mined. Sometimes 10+ blocks are mined per hour sometimes 2 are mined. It might have just been a fast day. 24 hours can't give an accurate picture of the hash rate.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i8qdldp",
                                            "author": "GhostOfSkeletor",
                                            "score": 6,
                                            "created_utc": 1652643960.0,
                                            "response": "my favorite part of modern life is that people like yourself are out here misunderstanding very basic things and you’re so smug about it",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i8qak8n",
                                            "author": "whitslack",
                                            "score": 5,
                                            "created_utc": 1652642604.0,
                                            "response": ">What, miners everywhere else decided to ramp up?? \n\nYes.\n\nThe offlining of some Texas miners was not enough to turn the overall hashrate trend negative.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i8q30q4",
                                    "author": "caploves1019",
                                    "score": 1,
                                    "created_utc": 1652639244.0,
                                    "response": "Right which is why I specifically added foundry USA is up, not down. And this article doesn't point to any specifics other than a group or coalition saying they'll turn down the speeds a bit.\n\nIn general hashrate is up, USA hashrate is up, and difficulty is up. So I'm not sure what the point of this post is. Is it to brag that us as miners can fluctuate our operations per current power requirements? That's mentioned in the post, sure.\n\nOr is it to fud folks into assuming a tiny reduction in hashrate in one location on the planet could reduce overall security for everyone else? Since that clickbaity headline kinda feels like that's the point.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8qb98z",
                                            "author": "whitslack",
                                            "score": 2,
                                            "created_utc": 1652642919.0,
                                            "response": ">I'm not sure what the point of this post is. Is it to brag that us as miners can fluctuate our operations per current power requirements?\n\nThat would be my guess. There's been a lot of FUD about how bitcoin mining is bad for the planet. It's nice to see the point made that bitcoin mining can economically incent the development of more base-load electricity generation capacity and simultaneously reduce the demand for generation by high-pollution peaker plants by being so flexible in its demand.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8q2plp",
                    "author": "ElectronicAmoeba5682",
                    "score": 0,
                    "created_utc": 1652639104.0,
                    "response": "It's a good idea to let the public be aware of how much energy crypto consumes. This is at a time when curbing energy consumption is the goal globally.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8qo6l1",
                            "author": "TwoSoonOrNah",
                            "score": 1,
                            "created_utc": 1652648585.0,
                            "response": "Once we finish with crypto we'll then move on to traditional banking and their energy usage. From there we'll move on to wall street firms and their usage and continue in each market.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8qof81",
                            "author": "smartfbrankings",
                            "score": 1,
                            "created_utc": 1652648689.0,
                            "response": "Growing energy production should be the goal.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8qfffu",
                    "author": "walloon5",
                    "score": 1,
                    "created_utc": 1652644775.0,
                    "response": "This is why we need way way way more generation capacity",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8qr1nf",
                    "author": "Lch207560",
                    "score": 1,
                    "created_utc": 1652649842.0,
                    "response": "Texas Bitcoin Miners _Say They Are Going_ To Turn Off to Conserve Power for the Grid.\n\nThere, fixed it for you.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uq6yer",
            "title": "If Wolf of Wall Street were about crypto",
            "url": "https://youtu.be/KHEZCXfyxjU",
            "author": "ninemoonblues",
            "created_utc": 1652623898.0,
            "score": 10,
            "num_comments": 2,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uq8gb9",
            "title": "“ When there is nothing to do, do nothing” - Warren Buffet",
            "url": "https://v.redd.it/ae0itcykrnz81",
            "author": "NeedleworkerNo2874",
            "created_utc": 1652628532.0,
            "score": 317,
            "num_comments": 20,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8pw4jc",
                    "author": "abhilodha",
                    "score": 11,
                    "created_utc": 1652636233.0,
                    "response": "Lol quality post",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8qhzo0",
                            "author": "johndoethrowaway16",
                            "score": 8,
                            "created_utc": 1652645906.0,
                            "response": "This right here is why I'm part of this community. Otherwise, I would still be hoarding bitcoin by myself with no one to share funny sh*t with.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8qkppo",
                                    "author": "Think_Operation310",
                                    "score": 2,
                                    "created_utc": 1652647098.0,
                                    "response": "It's Bitcoin.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8pwzqk",
                    "author": "MaximusDP",
                    "score": 9,
                    "created_utc": 1652636604.0,
                    "response": "Very entertaining!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8pj9jt",
                    "author": "Bedroom-Eastern",
                    "score": 6,
                    "created_utc": 1652630687.0,
                    "response": " i deduce: Nowadays everything is translated to/from something else without any coherency at all.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8pq80x",
                    "author": "randsack",
                    "score": 6,
                    "created_utc": 1652633685.0,
                    "response": "Nice work... I like how you spelled boyfrens",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8qajfa",
                    "author": "obichadjabroni",
                    "score": 6,
                    "created_utc": 1652642594.0,
                    "response": "Love the Peter schiff reference 🤣",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8q1x3x",
                    "author": "AdventurousPraline57",
                    "score": 5,
                    "created_utc": 1652638759.0,
                    "response": "This is literally how it’s gonna play out in the next couple years😁 can’t wait till then",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8qhkmz",
                    "author": "cryptofanboy1018",
                    "score": 3,
                    "created_utc": 1652645720.0,
                    "response": "I been buying up GBTC in my IRA. Almost to one full coin in my IRA and it’s at a 30% discount. Only ~22k/BTC. I know I know, not your keys, not your coin, but I’ll take the nice tax free gains instead.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8qcy18",
                    "author": "shardikprime",
                    "score": 3,
                    "created_utc": 1652643672.0,
                    "response": "Needs buttcoiners",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8q3sie",
                    "author": "LayPessimist",
                    "score": 2,
                    "created_utc": 1652639594.0,
                    "response": "My motto at work",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8qhvyc",
                            "author": "Bedroom-Eastern",
                            "score": 1,
                            "created_utc": 1652645860.0,
                            "response": "Try, sleep, wake up when it it's running?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8q79my",
                    "author": "uclatommy",
                    "score": 2,
                    "created_utc": 1652641134.0,
                    "response": "We like Janet Yellen now? What's the latest news?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8qcsly",
                    "author": "kkrekken",
                    "score": 2,
                    "created_utc": 1652643608.0,
                    "response": "To all the naysayers right now bitcoin is affordable. Don’t wait. Sooner or later everyone will want it no one will be able to afford it and if you try to look for it you won’t be able to find it because nobody’s gonna sell it because it’s generational wealth. \n“ No more government controlled money forever including CBDC!” CBDC’s just scare the hell out of me Just more government control is literally how the one percent got to where it’s at While as 99% struggle to get by and just keeps getting worse. This video represents everything I Believe will happen in the next five years",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8r3v08",
                    "author": "Zealousideal_Leg_630",
                    "score": 1,
                    "created_utc": 1652655660.0,
                    "response": "Wow...I wish I could go buys some butcoin right now but I'm only 12 and haven't enough in my allowance. Maybe next month...lol.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8qv5qo",
                    "author": "BitcoinUser263895",
                    "score": 1,
                    "created_utc": 1652651632.0,
                    "response": "What else has Warren Buffet's publicist has told you about his survivorship?\n\nLet me guess, be brave when others are afraid?\n\nHe's obviously a genius!!! ;)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8r13zu",
                    "author": "Flurbar",
                    "score": 1,
                    "created_utc": 1652654333.0,
                    "response": "Finally, the good memes are coming back to this sub, this must be a sign",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}