{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "utj8a6",
            "title": "Want to invest but need advice",
            "url": "https://www.reddit.com/r/Bitcoin/comments/utj8a6/want_to_invest_but_need_advice/",
            "author": "MayorCrypto",
            "created_utc": 1653013524.0,
            "score": 2,
            "num_comments": 15,
            "subreddit": "Bitcoin",
            "selftext": "As someone who has wanted to invest for over five years, I am looking for advice.  My income has never been the best so I always feel like I don’t have enough to get started in bitcoin.  I am always jealous of the people I see putting in thousands, when I can only do a couple hundred if not less.  Any advice?",
            "stickied": false,
            "comments": [
                {
                    "id": "i9acs21",
                    "author": "shwirv",
                    "score": 4,
                    "created_utc": 1653018658.0,
                    "response": "Just buy in a little at a time don't compare yourself to others. There will always be some one who has more money to invest than you have. Little steps add up to a journey over time. Have fun!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9adcbk",
                    "author": "alxjnssn",
                    "score": 3,
                    "created_utc": 1653018992.0,
                    "response": "even those who are doing thousands wish they could do more. just dive in m8, you’ll enjoy stacking sats.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ahmw5",
                    "author": "cryptodaddy69420",
                    "score": 3,
                    "created_utc": 1653021639.0,
                    "response": "I dca'd 25-75 USD a week earning around 9-10k a year, for a long time because that's what I could afford. \n\nDon't worry about the amounts. Invest what you can afford to lose, but be consistent. \n\nTime in the market beats timing the market \n\nStart yesterday.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9a3xxb",
                    "author": "stoic_goat_",
                    "score": 5,
                    "created_utc": 1653013947.0,
                    "response": "Stop wishing to do it and just do it",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9a46f2",
                    "author": "GroovyFat",
                    "score": 4,
                    "created_utc": 1653014064.0,
                    "response": "Don’t be jealous of others. Just do your best, with what you have.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9a4kmg",
                            "author": "MayorCrypto",
                            "score": 1,
                            "created_utc": 1653014258.0,
                            "response": "Right on!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9ai3m2",
                    "author": "savinelli_smoker",
                    "score": 2,
                    "created_utc": 1653021936.0,
                    "response": "Well you mentioned you’ve wanted to invest for over five years… let’s see… had you bought some back in 2017… even at the very peak (unlikely giving it was a very brief peak, you average price is likely much lower), you’re still comfortably ahead in the green. Stop wishing and hoping and wanting. If you have the conviction like we all do here, then Do It. Start small and be consistent. But if you’re still unsure and feeling iffy then don’t, coz you’ll only sell at the worst moment. Buy hold and forget about it and don’t get freaked out. Good luck",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9a3gnq",
                    "author": "ducasaurus",
                    "score": 2,
                    "created_utc": 1653013703.0,
                    "response": "https://old.reddit.com/r/Bitcoin/comments/7gi55s/dont_invest_recklessly/",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ag6n9",
                    "author": "16vJamie",
                    "score": 1,
                    "created_utc": 1653020716.0,
                    "response": "Just invest a little at a time, and beware that when you have a limited income it’s easier to end up selling low as the money means a lot more, try to avoid that. Buy low sell high, don’t panic sell",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9al14j",
                    "author": "nullama",
                    "score": 1,
                    "created_utc": 1653023936.0,
                    "response": "It doesn't matter how much, start learning about Bitcoin, how to create wallets, how to secure them, make transfers, keep your seed phrase secure, etc.\n\nThe actual amount of Bitcoin you have will increase over time, but it's crucial to know how to use Bitcoin, and to keep your Bitcoin in your own wallet, the one that you have the private key for, not on exchanges",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9aog82",
                    "author": "Intelligent-Dingo-46",
                    "score": 1,
                    "created_utc": 1653026423.0,
                    "response": "you never gonna sucesw if u are jealous the others maybe worked hard you never know",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9b8cj1",
                    "author": "InfiniteCarrot2674",
                    "score": 1,
                    "created_utc": 1653042895.0,
                    "response": "Just sign up on an exchange and put in $50 a month.  Don't worry about it for 20 years.\n\nKraken, Coinbase, Robinhood, whatever.  It's just $50.\n\nUse your time to improve your financial and life situation.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9bjzjm",
                    "author": "never-give-up-every1",
                    "score": 1,
                    "created_utc": 1653049710.0,
                    "response": "Never give up bro, investing is really like that you have to find your way that works for you not comapre yourself to others.  In my days or years of started Investing i always never gain any profit like for real I always loss my Money. then i do some experiment on something that fits for me, I also made trading journal to monitor if somehow I made mistake I will never do that again. Now i am a Profitable trader at **BINGX**, **Netcoins**, and **Coinbase**. never Give up bro! you can do it!!",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}