{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "urunzi",
            "title": "Just got scammed",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/urunzi/just_got_scammed/",
            "author": "craigthacher",
            "created_utc": 1652816908.0,
            "score": 0,
            "num_comments": 11,
            "subreddit": "BitcoinBeginners",
            "selftext": "Total noob here Is there any way to get back BTC that I sent from coinbase to what I thought was a dark web market? \nI thought I was finding my wallet and it never showed up. \nAny help would be greatly appreciated. It’s only $409 but it was all I had.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8zknjo",
                    "author": "bitusher",
                    "score": 11,
                    "created_utc": 1652817916.0,
                    "response": "Once a bitcoin transaction is confirmed you cannot get it back unless the receiver decides to send it back to you \n\n>what I thought was a dark web market\n\nI assume it wasn't one of these:\n\nhttps://dnstats.net/best-darknet-markets-2022/\n\n>that I sent from coinbase\n\nYikes , that is crazy . Never send Bitcoin directly from a regulated exchange to a DNM. The absolute minimum you need to do is create a single hop and withdraw the full amount to a private wallet , and than send the full amount to the DNM. For illegal drugs you should coinjoin or use a feature like ricochet as a much better option \n\nhttps://samouraiwallet.com/ is easy way to do this for small amounts \n\nOr use joinmarket or wasabi",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8zkflt",
                    "author": "Rey_Mezcalero",
                    "score": 2,
                    "created_utc": 1652817824.0,
                    "response": "You sent BTC from your CB account to a dark web site?\n\nDon’t know if they still doing but early crypto days with exchanges they would see where you sent it and if it was questionable they would send a message about it!\n\nAs the other poster said, once a confirmation was received that is it...can’t turn it back",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8zjbn6",
                    "author": "kuzkokronk",
                    "score": 1,
                    "created_utc": 1652817365.0,
                    "response": "If the transaction has been confirmed on the blockchain then sadly there's nothing you can do to get it back. In any case, I would contact Coinbase support to see if they could help.\n\nSorry you got scammed.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8zl52m",
                            "author": "bitusher",
                            "score": 2,
                            "created_utc": 1652818118.0,
                            "response": "> In any case, I would contact Coinbase support to see if they could help.\n\nThis would be the last thing they should do as they should not have send BTC directly from coinbase to a DNM in the first place . Since they did not send the transaction in the first place they have no control of the tx so whether or not the tx is confirmed or not is moot and coinbase will not try and doublespend any of their 0confs regardless.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i90973l",
                    "author": "cl4yf4c3",
                    "score": 1,
                    "created_utc": 1652828613.0,
                    "response": "Just call your bank and have them refund the fraudulent purchase.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i90w28g",
                            "author": "hallgod33",
                            "score": 1,
                            "created_utc": 1652839473.0,
                            "response": "What a fookn lege, m8",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8zi7j6",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1652816908.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8zlfh5",
                    "author": "BitcoinWell",
                    "score": 1,
                    "created_utc": 1652818239.0,
                    "response": "If you send bitcoin to a wallet that isn't yours and you don't have the private key/seedphrase for, those coins can't be returned unfortunately.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i904r78",
                    "author": "lunertendie",
                    "score": 0,
                    "created_utc": 1652826548.0,
                    "response": "Unfortunately that's someone else's btc now. I would HIGHLY recommend making a new wallet and moving your funds out of the current compromised one",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}