{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uyt33y",
            "title": "Is there a way to monetize photography through bitcoin?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/uyt33y/is_there_a_way_to_monetize_photography_through/",
            "author": "crazyfuck113",
            "created_utc": 1653637817.0,
            "score": 0,
            "num_comments": 20,
            "subreddit": "BitcoinBeginners",
            "selftext": "I like photography, and I like bitcoin. I was looking for ways to become the two so I can eat.\n\nAll jokes about me being dirt poor aside, are there any stock photography sites that pay you out in BTC? Or anything like that?",
            "stickied": false,
            "comments": [
                {
                    "id": "ia63nch",
                    "author": "bitusher",
                    "score": 1,
                    "created_utc": 1653638261.0,
                    "response": "Being able to sell your photos alone will be very difficult - https://www.shopify.com/blog/how-to-sell-photos-online\n\nSo I just take the fiat and buy bitcoin with it if you are lucky enough to find a buyer",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia635nl",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653637818.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia7zvk2",
                    "author": "igadjeed",
                    "score": 1,
                    "created_utc": 1653675085.0,
                    "response": "Set up a Web shop. Sell the photos. Use a watching-only wallet to display a different receiving address to customers for each sale. Record the address with the sale record / invoice  \n\nMonitor your wallet. When a payment arrives, the receiving address on the payment transaction will tell you which order the payment is for  \n\nFor the shop, spend a few hours using Alamy and the other stock shops to work out how they display images and sell them - watermarks, thumbnails, etc  \n\nOn the Bitcoin side, have a look at bitrequest and tuxpay. When you get to more than 20 sales per day, consider btcpay server",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iac291s",
                    "author": "cookmanager",
                    "score": 1,
                    "created_utc": 1653759433.0,
                    "response": "If I remember correctly there is a website to list your photos for sale for bitcoin…looking….",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iac2xj9",
                            "author": "cookmanager",
                            "score": 1,
                            "created_utc": 1653759758.0,
                            "response": "Seems like more websites have done the same thing now:\n\nhttps://www.producthunt.com/posts/bitcoin4photos\n\n(https://www.reddit.com/r/Bitcoin/comments/39sum1/betaphotobtc_earn_bitcoins_selling_your_photos/) <===gone\n\n….a few others, but here is a way that you could do yourself without using a big service like Shopify or other middlemen:  Agora (https://github.com/agora-org/agora)",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}