{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ustyos",
            "title": "Bitcoin’s supply is limited, but can’t this be a bad thing…?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/ustyos/bitcoins_supply_is_limited_but_cant_this_be_a_bad/",
            "author": "throwaway3638363",
            "created_utc": 1652929939.0,
            "score": 27,
            "num_comments": 51,
            "subreddit": "BitcoinBeginners",
            "selftext": "Thinking of huge companies such as apple, Microsoft, google, facebook, etc I imagine they make up such a huge portion of the economy in comparison to the average joes. \n\nIf only 21 million bitcoin exist, what would happen in a future where these big conglomerates sell their products / services in bitcoin and slowly begin to dominate more and more of the bitcoin supply? When more and more fiat money is printed, yes it may cause inflation and reduce the purchasing power of the dollar but doesn’t it also help people take out loans and stay afloat?\n\nAdditionally, global bitcoin adoption would cause banks’ business models to change - would bitcoin loans function the same way fiat does?\n\nI’m no economist whatsoever and i welcome any insight but to me it seems that in a world of bitcoin, big businesses will eventually dominate its supply, and people may find it difficult to take out loans",
            "stickied": false,
            "comments": [
                {
                    "id": "i961s6s",
                    "author": "bitusher",
                    "score": 17,
                    "created_utc": 1652936645.0,
                    "response": ">big businesses will eventually dominate its supply, and people may find it difficult to take out loans\n\nThere will always be income inequality and differences in socioeconomic levels. Bitcoin cannot fix all societal problems but It can make it a bit more fair for the average person by :\n\n1) Reduces the negative cantillon effect of fiat by removing some of the control over currency from a small group of people that is in part due to fiat being inflationary\nhttps://fee.org/articles/the-cantillon-effect-because-of-inflation-we-re-financing-the-financiers/\n\n2) keeps fiat currency in check where too much inflation will cause more capital flight to Bitcoin and prevents corrupt governments from abusing the backdoor tax of inflation\n\n3)  encourages more savings instead of debt slavery which removes choice, confidence and power away from individuals",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i978ojv",
                    "author": "yasire",
                    "score": 6,
                    "created_utc": 1652967598.0,
                    "response": "Gold also has a finite supply.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i97lsgt",
                            "author": "Astropin",
                            "score": 4,
                            "created_utc": 1652973271.0,
                            "response": "You're sort of both right. It has a finite supply...but, we have no idea what that supply is. Bitcoin has a fixed known limit.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i982pro",
                            "author": "TendieTrades",
                            "score": 3,
                            "created_utc": 1652980100.0,
                            "response": "Yes…but there is always new discovery of gold which will increase supply…",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i97d622",
                            "author": "SpitfireJB",
                            "score": -6,
                            "created_utc": 1652969613.0,
                            "response": "No, it doesn’t",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i97lke0",
                                    "author": "Needls87",
                                    "score": 3,
                                    "created_utc": 1652973176.0,
                                    "response": "On Earth it does.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i95t8va",
                    "author": "sos755",
                    "score": 29,
                    "created_utc": 1652931431.0,
                    "response": "> If only 21 million bitcoin exist, ...\n\n21 million bitcoins is 2,100,000,000,000,000 satoshis, and on the Lightning network that is further subdivided into 2,100,000,000,000,000,000 millisatoshis.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i96s89i",
                            "author": "EverythingIsFake1",
                            "score": 3,
                            "created_utc": 1652958382.0,
                            "response": "1 satoshi is any digit on a bitcoin price right? Like say 0.00000001 is 1 satoshi?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i96u5wn",
                                    "author": "Trayf",
                                    "score": 4,
                                    "created_utc": 1652959695.0,
                                    "response": "Yes, it’s the smallest divisible unit of a bitcoin. 0.00000006 btc = 6 satoshis.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i96u8a1",
                                            "author": "EverythingIsFake1",
                                            "score": 4,
                                            "created_utc": 1652959739.0,
                                            "response": "Got it, thanks.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i96v8xl",
                    "author": "Zonnins",
                    "score": 3,
                    "created_utc": 1652960390.0,
                    "response": "It would be a paradigm shift as people would have to get used to deflation. The price of things would have to get cheaper. Even your pay would have to go down in Bitcoin terms. It would be challenging to stomach for many but they’d have to understand as things are made more efficiently, their price should drop more in Bitcoin terms. \n\nYou can’t have fractional reserve banking with bitcoin so you’d have 100% reserve banking. You’d pay to deposit you bitcoin for safekeeping. You’d only get interest if you agreed to a certain lock up period in which case the institution could lend out your bitcoin for that time period. It seems foreign to us now but we contemplated going to a 100% reserve system many times in the past. It would remove the whole boom and bust business cycle that the Fed creates and that we are going through right now.\n\nThe stable supply of bitcoin would also prevent people from being robbed by inflation. Wars and excessive government spending would have to be paid for with taxes. It would create a much more fair world. Income inequality should also be reduced.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9658u2",
                    "author": "Squishyblobfish",
                    "score": 9,
                    "created_utc": 1652939061.0,
                    "response": "I'm trying to imagine why big businesses would hoard bitcoin. Surely they'd eventually buy something else or sell the bitcoin? \n\nIn theory it would circulate just like currency does now. Some people hold onto it (savings) and others have enough that they spend it.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i99adw6",
                            "author": "VeryChillBro",
                            "score": 2,
                            "created_utc": 1652999235.0,
                            "response": "Right, but people who hold bitcoin would be hesitant to spend it because its value will continue to rise. Unlike fiat, which loses value over time. Because of this, we're incentivized to spend money, hopefully on things that make us more money.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i96eea0",
                    "author": "MrQ01",
                    "score": 3,
                    "created_utc": 1652946505.0,
                    "response": "Bitcoin is intended to be decentralised, which it is. Loans are not really Bitcoin's problem but if they want to partake in fractional reserving, so be it.\n\nThe fact is these big companies wanted to scoop everything up, they could have done so years ago. Most of Bitcoin is already in custody now, and so scooping up a huge portion would just add upwards price pressure due to the huge demand from these companies.\n\nNow if they are fine to afford those huge prices then so be it.... it's a free market. But until then, average joes still have a chance to get in and DCA themselves a good enough portion to help themselves individually - and lessen the available portion for these bigger players.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i95zw8w",
                    "author": "BTCMachineElf",
                    "score": 5,
                    "created_utc": 1652935387.0,
                    "response": "Bitcoin is basically unlimitedly divisible. It does companies no good if they can't use it to pay people or buy things. Honestly I'm not sure what you think the problem is.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9606gp",
                            "author": "throwaway3638363",
                            "score": 7,
                            "created_utc": 1652935574.0,
                            "response": "honestly, me neither lol, just trying to picture how viable bitcoin would be in the long term",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i96mv8h",
                                    "author": "BTCMachineElf",
                                    "score": 8,
                                    "created_utc": 1652954186.0,
                                    "response": "Thought exercises are good. I used to contemplate bitcoin all the time, and I found that pretty much all my questions had solid answers. The more I wondered and researched, the more confident I grew. \n\nBitcoin doesn't really need to be the money we use everyday. It'd be nice, I hope it does. But what's important is we have a fair scarce money backing the economy at large. This should lead to economic stability and hopefully better prosperity for the common person, as that's the opposite of what inflationary currencies do.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i976fjl",
                            "author": "Inthewirelain",
                            "score": 1,
                            "created_utc": 1652966527.0,
                            "response": "On chain it's divisible to 8 decimal places. That is plenty for a long time but idk about infinite.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i977n0f",
                                    "author": "BTCMachineElf",
                                    "score": 3,
                                    "created_utc": 1652967102.0,
                                    "response": "Yes. I mean via layer 2 solutions. Lightning goes to 11. \n\nIts infeasible for the world to transact directly on layer 1 anyways.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i977s43",
                                            "author": "Inthewirelain",
                                            "score": 1,
                                            "created_utc": 1652967169.0,
                                            "response": "On BTC it is, yes.\n\nNo point taking this specific discussion further lol.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i97ho7i",
                                                    "author": "BTCMachineElf",
                                                    "score": 1,
                                                    "created_utc": 1652971553.0,
                                                    "response": "Infeasible to do in any truely decentralized manner.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i95rqgb",
                    "author": "masacmar",
                    "score": -9,
                    "created_utc": 1652930626.0,
                    "response": "Bitcoin is deflationnary. There's theorically 21 millions but in reality it's much less. A lot were lost.\n\nYou can divide a bitcoin 9 times which gives you a bit of space but it's ridiculously few in comparison with the monetary mass.\n\nBecause of that it would never be a currency.\n\n2 options then : its value will inflate and you can use it as gold, as a value reserve (that's currently its state)\n\nOr it will become useless and will disappear.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i961ipr",
                            "author": "bitusher",
                            "score": 9,
                            "created_utc": 1652936468.0,
                            "response": "Bitcoin is superior to fiat in 6 of 8 ways today and might become better in the last 2 with more time \n\nLets discuss some of the properties of what makes a good currency and where Bitcoin fits now \n\n\n**1) Durability** = Gold is best here due to its history and physical nature. Bitcoin and fiat  being digital in nature means we must compare the  durability of the institution/network that issues and secures them. I would suggest that Bitcoin will slightly excel responsible nation states here and does far better than  unreliable forms of fiat when looking at the history of fiat compared the the history and properties of Bitcoin(2017 gave a lot of credibility to Bitcoin in it thwarting a powerful attack and nation states have repeatedly attacked Bitcoin to one degree or another)\n\n**2) Portability** = Gold is horrible in this category being physical, heavy and unable to be sent digitally(custodians don't count as you lose most the benefits of gold and it switched categories from a bearer asset to registered value). Bitcoin beats fiat here too as its peer to peer , global and lacks regulatory friction. \n\n**3) Fungibility** Gold and Bitcoin tie here. When comparing fiat to Bitcoin it is more complicated but Bitcoin beats fiat here overall and is significantly getting better each year (see link above) . Physical fiat has some advantages over Bitcoin in the sense that its easier to have strong privacy locally as long as the whole \"anonymity set\" (group of users) avoid depositing the fiat in ATMs and banks(physical cash has serial numbers that are tracked with OCR + bill readers everywhere). Bitcoin can be very private if you use the right wallet and you take precautions but if you make a mistake you can also have problems. Digital fiat isn't very fungible or private at all. Gold isn't as fungible as many people suggest either due to different grading, certifying prices, forms which all fetch different prices.\n\n**4) Scarcity** -- Bitcoin wins this hands down with a fixed and limited supply. ~2-4 million BTc have been permanently lost/destroyed and many people also a long term investors leading to more scarcity. Gold is a distant 2nd with concerns in asteroid mining - (Psyche 16 as an example) and not knowing if any other large deposit can be found but far superior to fiat. \n\n**5) Divisibility** Bitcoin is already divisible by 8 decimal places onchain and 1/1000 of a satoshi on other layers like lightning. Thus micro txs are possible with bitcoin and too impractical with gold and not as easily done with fiat due to regulatory friction  and costs. The idea is that machines and software can tip other software, machines, and services by the minute or second to allow for more granularity and thus more efficiency with lower prices.\n\n**6) Acceptability** - Fiat wins this category for the time being due to its acceptance worldwide , especially US dollars. Bitcoin being a global currency without regulatory friction can one day overtake even the most accepted fiat however. Almost no one accepts gold for payment so its last and this is unlikely to change. \n\n**7) Verifiability** - Bitcoin wins here slightly over gold and fiat. Gold can be verified but takes more effort and there are concerns with tungsten filled bars and fake gold. Bitcoin being swept from a private key(coin or paper) or accepting an open dime is better than fiat physical cash, and digital fiat has very large concerns and delays in verification (chargebacks, fraud, etc...)\n\n**8) stability as a unit of account** - While Bitcoin is better than certain forms of fiat in this category, most are more stable than bitcoin and so Bitcoin remains 3rd compared to fiat and gold. We hope that Bitcoin in time will become less volatile with a much larger market cap . This trend is already occurring ,and much economic theory supports this happening but its still an experiment as to how long it will take and what size market cap / liquidity is needed\n\nSo you can see bitcoin is already better than fiat in 6 of the 8 categories above and the 2 remaining categories just take time.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i95t9ns",
                            "author": "7yce",
                            "score": 5,
                            "created_utc": 1652931443.0,
                            "response": "They can implement a soft fork (software update) so it can be divide infinitely when needed. I don’t have a source but I’m sure someone can pull one up. I’ve heard it in a few reliable podcasts and videos.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i95zlbl",
                                    "author": "masacmar",
                                    "score": 0,
                                    "created_utc": 1652935194.0,
                                    "response": "Maybe but as a currency it's not super practical.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i96g45e",
                                            "author": "MuchTemperature6776",
                                            "score": 1,
                                            "created_utc": 1652948066.0,
                                            "response": "How is it less practical than anything else? You can even get debit cards today that allows Bitcoin spending.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i95qezw",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1652929940.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i96ku9u",
                    "author": "iamjide91",
                    "score": 1,
                    "created_utc": 1652952397.0,
                    "response": "From everything I've learnt, it's not a bad thing at all.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i96od52",
                    "author": "Hot-Dealer-2184",
                    "score": 1,
                    "created_utc": 1652955462.0,
                    "response": "It is a huge amount actualy",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i976y9s",
                    "author": "aq9600947",
                    "score": 1,
                    "created_utc": 1652966775.0,
                    "response": "I do not know if it is worth worrying about now? I think Bitcoin will reach a stronger level of development by this point. It won't matter anymore.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9aoobi",
                            "author": "Mocserismi",
                            "score": 1,
                            "created_utc": 1653026588.0,
                            "response": "I completely agree with you. I think Bitcoin is too solid a project to be worried about except the whole crypto will have to crumble and that is almost impossible, in my opinion",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i97f908",
                    "author": "OleksiyG35",
                    "score": 1,
                    "created_utc": 1652970515.0,
                    "response": "That’s exactly what you want , you want all the big companies to buy all of them",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i97iz6p",
                    "author": "cl4yf4c3",
                    "score": 1,
                    "created_utc": 1652972094.0,
                    "response": "We left the gold standard to solve inflation challenges on the demand side for the reasons you talk about. BTC being limited does not solve inflation.\n\nAlso, printing money doesn't directly cause inflation either. Relative supply and demand of the fiat does though. We printed a bunch of money recently but the dollar is still very strong and has actually outperformed BTC over the last year. Even though the supply has increased, demand for the fiat increased more.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i97pd4x",
                    "author": "MOTANYA_BRAVO",
                    "score": 1,
                    "created_utc": 1652974742.0,
                    "response": "Bitcoin solves inflation issues which affect the whole world at large... today I read a tweet that the US government printed 8 billion US dollars...there is no control of how money is being printed and all....with inflation sorted the the world will be a better place.. better living conditions and everything nice..",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i97q5d9",
                    "author": "Jout92",
                    "score": 1,
                    "created_utc": 1652975057.0,
                    "response": "You could ask this question the otherway round and ask if the Dollar is superior because people can take out loans and pay them back cheaper because it will lose value, what's preventing companies from abusing that and just taking out more loans than they could ever repay but banking on the fact that it'll lose money eventually. Cause that's what the companies are doing right now. \n\nBitcoin isn't going to solve the discrepancy of rich and poor. Rich will still be rich and poor will still be poor, but what Bitcoin offers is a fair system where everyone is equal without people who are close to the money printer source being advantaged",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i99tmcm",
                    "author": "Loose-Recover-9142",
                    "score": 1,
                    "created_utc": 1653008882.0,
                    "response": "It would be deflationary just like it was on the gold standard",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i96on2m",
                    "author": "igadjeed",
                    "score": -3,
                    "created_utc": 1652955683.0,
                    "response": "> global bitcoin adoption\n\nNot possible. The limited supply is inconsequential because it is so huge. But the transaction rate is limited by the parameters which support decentralization: 1 million vbytes per block, 144 blocks per day  \n\nBitcoin will never replace fiat currency",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i96zx8h",
                            "author": "iceman0855",
                            "score": 1,
                            "created_utc": 1652963159.0,
                            "response": "Then what will?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i973d0q",
                                    "author": "Bl4ckSc4re",
                                    "score": -1,
                                    "created_utc": 1652965014.0,
                                    "response": "Vbucks probably",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}