{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "v0ag2q",
            "title": "Cashing in an old wallet?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/v0ag2q/cashing_in_an_old_wallet/",
            "author": "PM_ME_YOUR_WIRING",
            "created_utc": 1653828339.0,
            "score": 7,
            "num_comments": 53,
            "subreddit": "Bitcoin",
            "selftext": "A friend found an old wallet recently from early 2012 while he was packing up to move. The wallet is worth a considerable amount of money and he's wondering the best way he can \"cash it in\"?",
            "stickied": false,
            "comments": [
                {
                    "id": "iafa90x",
                    "author": "mickeys_stepdad",
                    "score": 14,
                    "created_utc": 1653830576.0,
                    "response": "Do not cash it all at once because bitcoin is worth a low amount today. I recently went through this. Buddy and I found a wallet with 250 coins on it and he gave me 69. \n\nTransfer it to cold storage, and, cash out what you need at exchanges. Yes i said plural. Exchanges only let you take out $500,000 per month. You need to do all of the KYC on these things. It is worth using multiple exchanges so you have freedom and flexibility. \n\nI would recommend keeping all of the coins on cold storage and moving coins that you *need* to cash out to exchanges. I recommend Coinbase Pro and Kraken because they allow you to easily make limit orders. I always keep 2 coins on each exchange ready to sell at way higher than what is currently trading, so that they automatically sell at that price.\n\nCongratulations.\n\nEDIT: Also HIRE A FINANCIAL ADVISOR!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iafmxze",
                            "author": "spoonfednonsense",
                            "score": 5,
                            "created_utc": 1653836768.0,
                            "response": "Become your own financial advisor",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iagktwu",
                            "author": "BrownSugar_Ad",
                            "score": 2,
                            "created_utc": 1653852193.0,
                            "response": "Congrats on the find let’s hope sone day a friend pops up with missing wallet one day hopefully..",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iaivgz1",
                            "author": "MrQ01",
                            "score": 2,
                            "created_utc": 1653899398.0,
                            "response": "I think if it's from 2012 then it's okay for the friend to cash out some of it.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iafatzy",
                    "author": "SubstantialNinja",
                    "score": 11,
                    "created_utc": 1653830879.0,
                    "response": "Don't do anything until you learn how change addresses work. You might have the keys to all of it now but if you move a little and rest goes to a change address and you lose the key to that address you'll be sorry.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iajlqgq",
                            "author": "MountainousFog",
                            "score": 1,
                            "created_utc": 1653918580.0,
                            "response": "Has this ever happened to someone before?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iajqz7r",
                                    "author": "SubstantialNinja",
                                    "score": 1,
                                    "created_utc": 1653921175.0,
                                    "response": "https://bitcointalk.org/index.php?topic=782.0",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iaksi0n",
                                            "author": "MountainousFog",
                                            "score": 1,
                                            "created_utc": 1653938112.0,
                                            "response": "Thank you for finding this!!\n\n1 further question -- don't \"HD wallets\" prevent this form happening since each subsequent address is deterministically generated?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iakvw1l",
                                                    "author": "SubstantialNinja",
                                                    "score": 1,
                                                    "created_utc": 1653939705.0,
                                                    "response": "Yeah, not an issue with wallets these days.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iaf6udd",
                    "author": "ETAVEGAMING",
                    "score": 12,
                    "created_utc": 1653828703.0,
                    "response": "Sign up to a reputable exchange and send a little at a time to the exchange to cash out. There is a chance an exchange will lock up funds. There is also a chance your withdrawal to a bank with be denied. \n\nHe should test out the path to cashing out and do it in increments. Also, I personally wouldn’t “cash out” all of it.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaf6zvc",
                            "author": "PM_ME_YOUR_WIRING",
                            "score": 1,
                            "created_utc": 1653828796.0,
                            "response": "That's what he's worried about due what it's valued at. What would you consider a little?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iaf7rqi",
                                    "author": "ETAVEGAMING",
                                    "score": 7,
                                    "created_utc": 1653829254.0,
                                    "response": "If you’re from USA, I would just go with coinbase since it’s a US company. Also, have him call his bank and ask how they treat crypto related deposits. \n\nCash out and withdraw $500 a day and see what happens. Chances are nothing will happen, but better safe than sorry.\n\nAlso, if he is trying to cash out NOW NOW because he thinks its going lower for a long time, he could just sell it all on coinbase, risk lock up and go through the hoops to get it out with a lawyer if he has to. This avoids losing to the market.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iaf819l",
                                            "author": "PM_ME_YOUR_WIRING",
                                            "score": 3,
                                            "created_utc": 1653829402.0,
                                            "response": "Is there a faster way than slow withdrawals that may take him 27 years? He said he originally invested about $1000.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iafadqm",
                                                    "author": "gdries",
                                                    "score": 7,
                                                    "created_utc": 1653830642.0,
                                                    "response": "Ask your bank. Selling hundreds of thousands of $ on Coinbase is no problem. Withdrawing to your bank might be. When I cashed out six figures back when I got out of HODLing I opened a new account at a small, local to me credit union, told them what I was going to do and then did it. Everything went fine. \n\nNew account at a new bank is the key. If anything goes wrong and your funds end up frozen until you can document where you got them from, you’ll still be able to pay for groceries and rent. \n \nDo be aware of taxes. This isn’t going unnoticed by the IRS or other relevant authority in your country. Calculate your taxes and pay them. Yes, it will be a lot of money, it’s still better than going to jail for tax evasion.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "iaf8y5c",
                                                    "author": "ETAVEGAMING",
                                                    "score": 2,
                                                    "created_utc": 1653829876.0,
                                                    "response": "I would keep 25% of my bitcoin on that wallet. Send the other 75% to coinbase through 10-20 total transactions. Quadruple check the keys when sending. Sell the 75% and get ready to hire a lawyer. \n\nCongrats to your friend!",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iaf92p9",
                                                            "author": "PM_ME_YOUR_WIRING",
                                                            "score": 2,
                                                            "created_utc": 1653829945.0,
                                                            "response": "Thanks for the advice!",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "iaf96e9",
                                                                    "author": "ETAVEGAMING",
                                                                    "score": 2,
                                                                    "created_utc": 1653830002.0,
                                                                    "response": "You’re very welcome. Best of luck.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "iaf9ine",
                                                            "author": "MikeMiller8888",
                                                            "score": 2,
                                                            "created_utc": 1653830188.0,
                                                            "response": "Why do you recommend 10-20 transactions?  Wouldn’t the same purpose be served (with lower fees and time spent) with a super small transaction to start, and then just sending over the entire balance?  Serious question not trolling.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "iafcllh",
                                                                    "author": "ETAVEGAMING",
                                                                    "score": 2,
                                                                    "created_utc": 1653831802.0,
                                                                    "response": "To prevent human error from destroying the whole bag lol. This is just how I would do it. Especially considering the amount of money this guy is suggesting his friend has is $700k. \n\nThe fees are worth the safety net to me.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "iaf7ful",
                                    "author": "ollieeeeeeeeeeeeeeee",
                                    "score": 1,
                                    "created_utc": 1653829062.0,
                                    "response": "FR? $1000 might be a lot to someone and someone else might wipe their ass with that amount. This must be a troll post",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iaf7ogf",
                                            "author": "PM_ME_YOUR_WIRING",
                                            "score": 2,
                                            "created_utc": 1653829202.0,
                                            "response": "It's not. Look at how old my account is and my fake internet points. He's legit worried about moving too much at one time. He said he invested like $1000.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iaf8njt",
                                                    "author": "ollieeeeeeeeeeeeeeee",
                                                    "score": 2,
                                                    "created_utc": 1653829719.0,
                                                    "response": "That means he has between 1 and 90 BTC depending when in 2013 he got them.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iaf8qhf",
                                                            "author": "PM_ME_YOUR_WIRING",
                                                            "score": 3,
                                                            "created_utc": 1653829762.0,
                                                            "response": "The value is in 7 figures. He invested in early 2012.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "iaf8uz2",
                                                                    "author": "ollieeeeeeeeeeeeeeee",
                                                                    "score": -3,
                                                                    "created_utc": 1653829829.0,
                                                                    "response": "No, it’s 6 figures and if you aren’t trolling I really feel sorry for you.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "iaf9162",
                                                                            "author": "PM_ME_YOUR_WIRING",
                                                                            "score": 1,
                                                                            "created_utc": 1653829921.0,
                                                                            "response": "What was the price per Bitcoin in early 2012?",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "iaf9bqt",
                                                                                    "author": "MikeMiller8888",
                                                                                    "score": 3,
                                                                                    "created_utc": 1653830083.0,
                                                                                    "response": "Have his transfer a SMALL amount of BTC to a reputable exchange wallet. Probably Coinbase Pro if you’re talking six and seven figures.  \n\nA small amount is something that can be lost.  Like .0001 BTC; just enough to see that a transfer shows up in the Coinbase wallet.\n\nThen send the rest of the BTC over once the first trans is done.  Good luck and congrats to your friend",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                },
                                                                                {
                                                                                    "id": "iaf95kc",
                                                                                    "author": "ollieeeeeeeeeeeeeeee",
                                                                                    "score": -4,
                                                                                    "created_utc": 1653829989.0,
                                                                                    "response": "Swear it read 2013, maybe you’ve edited it idk",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "iaf997w",
                                                                                            "author": "PM_ME_YOUR_WIRING",
                                                                                            "score": 1,
                                                                                            "created_utc": 1653830045.0,
                                                                                            "response": "I didn't.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iafdtyo",
                    "author": "0delta",
                    "score": 3,
                    "created_utc": 1653832422.0,
                    "response": "Make him watch Ozark to get an idea about money laundering",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iafedom",
                            "author": "PM_ME_YOUR_WIRING",
                            "score": 1,
                            "created_utc": 1653832697.0,
                            "response": "One of his favorite shows but I don't think he'll be able to >!befriend an FBI agent!< 😕",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iafmhn0",
                    "author": "tony2o6",
                    "score": 3,
                    "created_utc": 1653836567.0,
                    "response": "Which part of the USA? I can purchase in cash if you’re around New York, Oregon, or Washington state",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaf90s1",
                    "author": "xxllllxx",
                    "score": 2,
                    "created_utc": 1653829915.0,
                    "response": "Go talk to your local banking institutions. You should be able to get the info you need.\nYou can also look at crypto exchanges like Coinbase who have their own sponsored credit cards if you are looking at making large purchases with an establishment who takes crypto.\nAnother option is to find a local general account that specializes in crypto.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaf94a1",
                            "author": "PM_ME_YOUR_WIRING",
                            "score": 1,
                            "created_utc": 1653829969.0,
                            "response": "Thanks!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iag5v4k",
                    "author": "cookmanager",
                    "score": 2,
                    "created_utc": 1653845243.0,
                    "response": "Ask you friend why he wants to change to an inflationary currency",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iagaa7p",
                    "author": "Narmotur",
                    "score": 2,
                    "created_utc": 1653847273.0,
                    "response": "Your best bet for quickly cashing out is probably looking for exchanges that offer an OTC service, like here on Kraken for example (not an endorsement): https://www.kraken.com/en-gb/features/otc-exchange",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iagxvmz",
                    "author": "n8dahwgg",
                    "score": 2,
                    "created_utc": 1653858447.0,
                    "response": "If its significant enough consider moving to puerto rico. The capital gains tax is huge and could maybe afford him a nice place down here. 3 yr minimum commitment but for me it was the most productive thing I could have done",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iahagog",
                    "author": "redpola",
                    "score": 2,
                    "created_utc": 1653864771.0,
                    "response": "Do not respond to PMs.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaf6m1y",
                    "author": "ipetgoat1984",
                    "score": 3,
                    "created_utc": 1653828566.0,
                    "response": "Transfer crypto to an exchange, sell it",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iag8yqy",
                    "author": "cpt_charisma",
                    "score": 2,
                    "created_utc": 1653846665.0,
                    "response": "You could just keep it in BTC and sell or spend what you need to.  There are services to pay bills and buy giftcards.  Many things can be bought directly with Bitcoin if you do a little research.  This should be more tax-efficient, and will save a significant amount on fees.  Probably worth talking to a professional tax accountant.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iahb1eh",
                            "author": "BitcoinUser263895",
                            "score": 2,
                            "created_utc": 1653865073.0,
                            "response": ">  There are services to pay bills and buy giftcards.  ... This should be more tax-efficient,\n\nThose too are taxable events. Unless you only buy giftcards and operate like a criminal syndicate purchasing good with them to sell on at a loss for clean cash.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iaf9f4l",
                    "author": "susanking1956",
                    "score": 0,
                    "created_utc": 1653830134.0,
                    "response": "He could have 100 coins. Why cash it all out? Move it to DeFi. Borrow what he needs. Keep LTV under 30%. No monthly loan payments. Monthly loan interest offset by savings account (collateral) interest. I use  coinbase wallet. Send loan proceeds to coinbase.com then to my bank. I tell bank that money is from loan proceeds. So no tax event. This saves on capital gains tax. He waited 10 years. Wait until another 10 yrs.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iahbavv",
                            "author": "BitcoinUser263895",
                            "score": 1,
                            "created_utc": 1653865211.0,
                            "response": "> Move it to DeFi.\n\nGive it all to Do Kwon!! ;D",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iafdien",
                    "author": "dan_geles",
                    "score": 1,
                    "created_utc": 1653832263.0,
                    "response": "I’ll bet it was a leather wallet wasn’t it?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iagl9a9",
                    "author": "BrownSugar_Ad",
                    "score": 1,
                    "created_utc": 1653852394.0,
                    "response": "There’s a guy saying back in 2010-2012 they only kept bitcoins in a laptop and no wallet is that truth? Or bitcoin dies have private key and seed phrase for each wallet since the genesis block?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iah3aj7",
                            "author": "xmlify",
                            "score": 2,
                            "created_utc": 1653861122.0,
                            "response": "This.\n\nSeriously, OP,  can you tell us what the wallet is made of?  paper or leather or what?\n\nOP, this all sounds rather suspicious...",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iaglmea",
                    "author": "BrownSugar_Ad",
                    "score": 1,
                    "created_utc": 1653852565.0,
                    "response": "Congrats on the find! Take it easy and slowly and don’t tell a lot of people(say it to him) try cash out slowly slowly 500 or 1000 dollar a day that’s it! till you verify and then look at all exchanges my best advice is KuCoin P2P same as Binance also be careful and  read documentation! I will also be happy to make him get ready of some satoshis! I will provide my wallet address if anyone likes to donate",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iahaumw",
                    "author": "BitcoinUser263895",
                    "score": 1,
                    "created_utc": 1653864975.0,
                    "response": "Why would you want to pay cap gains tax?\n\nTake out an over-collateralised loan against it if doing anything.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iahhv5b",
                    "author": "RottenBlueCheese",
                    "score": 1,
                    "created_utc": 1653868667.0,
                    "response": "Keep the bitcoin, use it as collateral to take out 500k loans and live life without paying taxes on the bitcoin. Be smart people",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iahm0jf",
                    "author": "Twoubleff",
                    "score": 1,
                    "created_utc": 1653870875.0,
                    "response": "ping the support of swan.com/private they'll give you a call and help you out.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaizl3b",
                    "author": "frunf1",
                    "score": 1,
                    "created_utc": 1653903151.0,
                    "response": "The best way is not to cash in. Why he wants worthless inflationary money?",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}