{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uz55va",
            "title": "Must be a simulation",
            "url": "https://i.redd.it/eg9ut51sf2291.jpg",
            "author": "Zealousideal_Pie8120",
            "created_utc": 1653677860.0,
            "score": 4,
            "num_comments": 0,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uz4z3h",
            "title": "Virtual economies could help with Bitcoin adoption",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uz4z3h/virtual_economies_could_help_with_bitcoin_adoption/",
            "author": "0x1a3c3e7",
            "created_utc": 1653677307.0,
            "score": 3,
            "num_comments": 2,
            "subreddit": "Bitcoin",
            "selftext": "We're all waiting for Bitcoin to become more widely adopted, but what can we do to help?  There is a sort-of catch 22 in that adoption depends on price stability, while price stability depends on adoption.\n\nOne area of commerce where adoption should see the least resistance are virtual economies.  Especially MMOs that have sophisticated virtual markets.  By using Bitcoin in virtual economies, it could stabilize the price in the real economy, thereby fostering further adoption.  Bitcoin should be the default currency of every game that supports trades.",
            "stickied": false,
            "comments": [
                {
                    "id": "ia863ma",
                    "author": "Mallardshead",
                    "score": 1,
                    "created_utc": 1653677807.0,
                    "response": "Bitcoin won't be stable for a bit. It's far too early in its monetization phase. Bitcoin doesn't target a stable price. It targets a variable price. It can control its ledger and issuance with the one-directional entropy of energy, and the free market sets the price. When it's absorbed enough trust (value) its confidence curve (volatility) will flatten. This is incredibly powerful, and will make it man's final money. The process from now until then is long, hard, and organic.\n\nThere are already many countries where bitcoin is less volatile than their fiat. I would assume top fiat pairs will go hyper in the next 24 months, and BTC will become less volatile than those. From there a credit market will rapidly develop around it. The circular economy which you're talking about is slowly emerging as well. But yeah, we'll need liquidity in the $10T range before volatility flattens even one order of magnitude. 🤷‍♂️",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia8ftz9",
                    "author": "Nada_Lives",
                    "score": 1,
                    "created_utc": 1653682175.0,
                    "response": "A good percentage of the people here have no idea what a Massively Multiplayer Online is. BUT yes, it is another part of the economy that Bitcoin can make more convenient.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}