{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "utoyxh",
            "title": "Bitcoin price raise prediction",
            "url": "https://www.reddit.com/r/Bitcoin/comments/utoyxh/bitcoin_price_raise_prediction/",
            "author": "Hemray",
            "created_utc": 1653036951.0,
            "score": 1,
            "num_comments": 1,
            "subreddit": "Bitcoin",
            "selftext": "**Bitcoin price predictions abound as traders focus on the next BTC halving cycle**\n\nTraders still anticipate BTC prices above $100,000, but a closer look at the BTC halving cycle chart suggests that a sharper downside move will occur first.\n\n&#x200B;\n\n[Price chart. Source- Cointelegraph](https://preview.redd.it/4rnwi4luhl091.png?width=651&format=png&auto=webp&s=7d985a08ded1f743e099dba69608626fd43d95b2)",
            "stickied": false,
            "comments": [
                {
                    "id": "i9b1cad",
                    "author": "essessential",
                    "score": 1,
                    "created_utc": 1653037373.0,
                    "response": "I'd agree, but it could go either way or stay flat for a while. NFA.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "utozoa",
            "title": "Age of Scarcity Begins With $1.6 Trillion Hit to World Economy",
            "url": "https://www.bloomberg.com/news/articles/2022-05-19/global-economy-loses-1-6-trillion-as-world-struggles-to-avoid-a-new-cold-war",
            "author": "simplelifestyle",
            "created_utc": 1653037052.0,
            "score": 5,
            "num_comments": 4,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9b54v3",
                    "author": "Downtown-Ad-4117",
                    "score": 1,
                    "created_utc": 1653040297.0,
                    "response": "Nobody has a crystal ball.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9b6lbd",
                    "author": "solomonsatoshi",
                    "score": 1,
                    "created_utc": 1653041504.0,
                    "response": "USD vs DCEP vs BTC",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9b3l9m",
                    "author": "mnijs",
                    "score": 1,
                    "created_utc": 1653039119.0,
                    "response": "Scarcity? Print moar.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9b5tfn",
                    "author": "Consequenceplz",
                    "score": 1,
                    "created_utc": 1653040865.0,
                    "response": "All we had to do was not wear masks. Not even like half of us. Maybe 10% and the herd's fucking lizard brain would've been switched off",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "utoseg",
            "title": "kucoin scam or legit?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/utoseg/kucoin_scam_or_legit/",
            "author": "CrypticHyperbole",
            "created_utc": 1653036054.0,
            "score": 3,
            "num_comments": 6,
            "subreddit": "Bitcoin",
            "selftext": "I was reading last night about somebody who said to get your money out of kucoin immediately because they stole thousands of dollars from them and supposedly they're going to release evidence to prove it soon. Then a couple other people were commenting about how kucoin has these in-house traders working against public traders but with all the back-end data to give them an advantage. Supposedly they're able to manipulate the buying patterns on their exchange in a way that makes it appear as legitimate losses.\n\nOn another site most of the people said there were no problems other than a couple people said they were suspicious but didn't make any specific accusations.\n\nHas anybody here had problems with them?\n\n*Additional*\nI'm already assuming most people probably didn't notice any significant issues because otherwise they wouldn't still be in business. I'm curious about the ones who had bad experiences to find out how bad they were and what it was that happened.\n\nI'm probably showing my age a bit here but it's like how most people who owned a Samsung Galaxy S7 didn't notice any problems with their phones but some people's phones randomly spontaneously combusted. If it has a chance of spontaneously combusting that's the important part to me. I hope that makes sense.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9b0k2d",
                    "author": "Charming_Sheepherder",
                    "score": 5,
                    "created_utc": 1653036696.0,
                    "response": "No, just their withdrawal fees suck like binance",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9b0q15",
                    "author": "StackerNoob",
                    "score": 2,
                    "created_utc": 1653036842.0,
                    "response": "Been with kucoin since the beginning pretty much. Had almost no issues whatsoever, other than the odd missed KCS holding reward.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9b12z8",
                    "author": "Naive-Student8830",
                    "score": 2,
                    "created_utc": 1653037165.0,
                    "response": "No, atleast not for me. Just like it is said the fees sucks but nothing else.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9b9bmc",
                            "author": "CrypticHyperbole",
                            "score": 1,
                            "created_utc": 1653043634.0,
                            "response": "Thank you for letting me know. With the fees I've heard that each exchange is kind of different and so some of them they're just a flat fee but then other ones you'll have certain ones that are really expensive 2 send or receive and then other ones that are really cheap to send and receive so it would be nice if anybody knows a website or something that has all of that information up to date",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9b790e",
                    "author": "johnathondeaux",
                    "score": 1,
                    "created_utc": 1653042033.0,
                    "response": "Like with anything a small group have a bad experience and a small group have an exceptional experience, these two groups are then the loudest.\n\nThe majority of people have a moderate experience and are often almost silent.\n\nKucoin is not a scam and those claims about them are atleast unlikely to be true. Anecdotally some people may of lost money with kucoin or lost access to an account but that will happen with any exchange.\n\nMy personal experience with them is using a non kyc account to trade, it took like 16 hours to be credited to my account which was absurd considering they were supposed to credit my account after a certain amount of network confirmations or something (like 10/15 minutes max) but the trade went through straight away once my account was credited and the withdrawal was processed in a very amicable timeframe.\n\nOverall I'd give them like a 6/7 out of 10 based on my own experience.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9bbad0",
                            "author": "Naive-Student8830",
                            "score": 1,
                            "created_utc": 1653044888.0,
                            "response": "6/7 out of 10 is acurate, I agree.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "utou00",
            "title": "Another good one from the spiritual leader",
            "url": "https://twitter.com/jack/status/1526159772277514241?s=20&t=hf8T6FRh5BHV1_7UcsHDcA",
            "author": "Mallardshead",
            "created_utc": 1653036281.0,
            "score": 3,
            "num_comments": 3,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9b10mj",
                    "author": "Mallardshead",
                    "score": 2,
                    "created_utc": 1653037106.0,
                    "response": "An FYI: Block is the most important centralized ally in the bitcoin space that we have. Full stop. I believe they already possess the absolute best do-it-all financial app in the world (CashApp) by a mile, which has all the licenses, a massive network effect, is bitcoin only in the crypto space, integrated the LN before anyone, have stocks and partial stocks you can buy/send, include a bank account, have Cashtags, tax software. Rumor is they'll integrate with Square by levering BTCPayserver, LNURL, hard wallet support, third party NFC debit cards (like Bolt Card), along with an \\[optional\\] mining pool for their open-source ASIC, will design their own app for nodes, and have a secret project that TBD is working on. This is a company I want to own shares in, trust, and I believe deserves the full backing of the bitcoin community, from maxi to pleb. CashApp + Hard wallets or NFC LN cards=**ENDGAME.** Everyone has to follow, from Apple Pay to Chase, or get run over.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9bbyf5",
                            "author": "Zealot_of_Law",
                            "score": 1,
                            "created_utc": 1653045309.0,
                            "response": "They also are working on a multisig wallet, as well as a decentralized bitcoin exchange.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9bdoxb",
                                    "author": "Mallardshead",
                                    "score": 1,
                                    "created_utc": 1653046347.0,
                                    "response": "💥",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "id": "utowyh",
            "title": "Madeira Clears up Confusion Surrounding Bitcoin Adoption",
            "url": "https://www.btctimes.com/news/madeira-clears-up-confusion-surrounding-bitcoin-adoption",
            "author": "CoinCorner_Sam",
            "created_utc": 1653036689.0,
            "score": 10,
            "num_comments": 4,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9b1f5i",
                    "author": "Downtown-Ad-4117",
                    "score": 1,
                    "created_utc": 1653037434.0,
                    "response": "Can anyone verify that Madeira does not tax Bitcoin? Portugal just said they will.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9b59h3",
                            "author": "88eth",
                            "score": 5,
                            "created_utc": 1653040396.0,
                            "response": "Madeira belongs to Portugal. And as of now Portugal is not taxing bitcoin. Also they have very interesting tax models for foreigners anyways (like you can bring as much money into Portugal as you like untaxed). It might change in the future but fact as of now is you dont pay taxes on your Crypto gains.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9bs9vw",
                                    "author": "AlexDRibeiro",
                                    "score": 1,
                                    "created_utc": 1653053590.0,
                                    "response": "I confirm this",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9bsiqw",
                    "author": "DayJob93",
                    "score": 1,
                    "created_utc": 1653053696.0,
                    "response": "Visiting this beautiful island in a few weeks. Maybe I should make plans to stay?",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}