{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uzzp0u",
            "title": "Just mined my first 300,0000 SATS.",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uzzp0u/just_mined_my_first_3000000_sats/",
            "author": "Leader92",
            "created_utc": 1653783537.0,
            "score": 63,
            "num_comments": 38,
            "subreddit": "Bitcoin",
            "selftext": "It definitely feels great to receive your pure first-hand Bitcoin. I enjoyed mining so much that I have invested into an immersion cooling setup and will continue to gradually build a room filled with immersed S19s. \n\nNo noise, a single fan with hot air blown to the outside. Immersion cooling is definitely worth the time, effort, and money. It made relatively large-scale home mining feasible.",
            "stickied": false,
            "comments": [
                {
                    "id": "iadg9fv",
                    "author": "ForbiddenFruit91",
                    "score": 7,
                    "created_utc": 1653783888.0,
                    "response": "Have you found it profitable with for example cost per kWh being 10 cents? I've been looking into it a lot but ppl seem to be talking me out of it. I would be looking into the s19 95th or better. Maybe a s19j pro 100th...i could only afford 1 to start with, but is that profitable? Not looking to get rich immediately, but from my research, i found to be able to profit $4 to $7 AFTER power costs per day. Which isnt bad to me. And that's at todays market prices! Any input?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iadh4jb",
                            "author": "bryguy4436",
                            "score": 14,
                            "created_utc": 1653784363.0,
                            "response": "The reason people are probably talking you out of it is that miner prices are still high for current profits.  You would probably never get a return on investment vs just buying Bitcoin.  The key is, if you really want to do it, then don't let people talk you out of it.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iadjwgp",
                                    "author": "Leader92",
                                    "score": 6,
                                    "created_utc": 1653785907.0,
                                    "response": "I seem to find ROIs for Bitcoin rugs to be around 1-1.6 years. A single S19 now costs around $6,000. Running it non-stop for a year will yield 0.156 after electricity costs (\\~0.05$).\n\nMining purely for fiat profits is not a good reason to get in. I'd only encourage mining if one won't liquidate the minted bitcoin and believes bitcoin will keep rising in price. That 0.156 is probably going to be worth triple the purchase price of an S19 after the halving (assuming we break into six figures).",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iadkbkv",
                                            "author": "bryguy4436",
                                            "score": 6,
                                            "created_utc": 1653786135.0,
                                            "response": "With those numbers it doesn't look like you are factoring in any difficulty increases. Difficulty is what screws you and takes the ROI out much farther than 2 years right now",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iadmmn1",
                                                    "author": "ForbiddenFruit91",
                                                    "score": 2,
                                                    "created_utc": 1653787410.0,
                                                    "response": "Won't there be a certain profitability balance so to speak if the price of btc increases over time even if the difficulty increases, or even given the halvenings?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iados3v",
                                                            "author": "bryguy4436",
                                                            "score": 2,
                                                            "created_utc": 1653788613.0,
                                                            "response": "I personally like to just look at BTC mined.  Not the price of BTC for the most part.  Does buying a miner and mining net me more Bitcoin than buying the equivalent amount of Bitcoin now and then dca each month.  I would currently say no but I still like mining.  I'm just waiting for lower miner prices... Hopefully",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "iadp4uv",
                                                                    "author": "ForbiddenFruit91",
                                                                    "score": 1,
                                                                    "created_utc": 1653788812.0,
                                                                    "response": "Ok gotcha. As far as miner prices, if there would be a drop dont you think it would happen in the next couple month or so if the price continues to bottom on btc? But that's if...",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "iadr4jg",
                                                                            "author": "bryguy4436",
                                                                            "score": 3,
                                                                            "created_utc": 1653789941.0,
                                                                            "response": "Even if we stay the same prices should continue to go down unless people are still buying.  Demand ultimately sets the price.\n\nMy recommendations for anyone new.  \n\n1- make 100% sure you know your power rate.   Some residential rates bump up with usage and I know lots of people who lost money mining and ended up selling their units at a loss due to them not knowing their rate at higher usage.\n\n2- buy a cheap miner like an S9.  Make sure you can deal with the noise and heat before upgrading.  You will lose money at your power rate but better than spending a ton more on an S19 and then finding out the noise is too much.\n\n3.  Run calculations with different assumptions.  Make sure you will be profitable at $20000 per coin in case we go that direction.  Run an assumption of 5-6% per month difficulty increase as your BTC mined will be going down.  Just the publicly traded companies announced purchases will take us to over 320 eh I believe.  Who knows how fast they can deploy though. https://insights.braiins.com/en/profitability-calculator/ After your have run some different scenarios, calculate how much Bitcoin you could buy for the cost of a miner and other expenses, add in a dca each month for what you would be spending on electric.  \n\nUltimately just do lots of research before jumping in.  Too many people end up not doing enough and then losing money.  \n\nGood luck!",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "iadrfks",
                                                                                    "author": "ForbiddenFruit91",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653790119.0,
                                                                                    "response": "Awesome. Appreciate the feedback!",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "iadm6zb",
                                                    "author": "Leader92",
                                                    "score": 2,
                                                    "created_utc": 1653787173.0,
                                                    "response": "I can't factor in the unanticipated. The China ban was a great period for miners but nobody saw it coming that sudden. The mining game is unpredictable.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iadn7qy",
                                                            "author": "bryguy4436",
                                                            "score": 3,
                                                            "created_utc": 1653787737.0,
                                                            "response": "So you don't run any calculations with different assumptions?  Seems like you are flying completely blind.\n\nFor example, since August I've seen more than a 50% drop and BTC mined per day.  I also have more hashpower as well.   \n\nI believe the historical increase is 5-6% per month so run with those numbers and factor in halving and you have more BTC just buying spot and then buying monthly the equivalent of your power cost to run a miner.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "iado7mf",
                                                                    "author": "Leader92",
                                                                    "score": 3,
                                                                    "created_utc": 1653788292.0,
                                                                    "response": "Not blind, but your numbers can't be taken seriously simply because nobody can anticipate how many miners join on monthly basis. I don't care much about difficulty increase because eventually, you'll need to periodically add in more ASICs to keep up with whatever happens every 2016 blocks.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "iadmt6g",
                                            "author": "ForbiddenFruit91",
                                            "score": 1,
                                            "created_utc": 1653787510.0,
                                            "response": "I agree. I would be mining and holding for the long term.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "iaekomq",
                                            "author": "varikonniemi",
                                            "score": 1,
                                            "created_utc": 1653810671.0,
                                            "response": "i'd only encourage mining if you have use for the heat, or you are using otherwise wasted dirt cheap electricity, but this would mean the rig is next to a power source.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iaevrn5",
                                                    "author": "Leader92",
                                                    "score": 1,
                                                    "created_utc": 1653820664.0,
                                                    "response": "It's great to get paid for heating a swimming pool or a house, but that's just a bonus. If you mine and only look in Bitcoin terms, I think it'll turn out to be a great investment.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iaex8yp",
                                                            "author": "varikonniemi",
                                                            "score": 1,
                                                            "created_utc": 1653821935.0,
                                                            "response": "with household electricity prices and wasting the heat, you are essentially investing in Bitcoin expecting the value to go up to make a good profit. Better to just buy Bitcoin in that case. Unless you do it  for other reasons, like decentralizing the hash rate and just wanting to support the network that way.\n\nThe absolutely best way to mine residentially is to heat the house using the waste heat, and produce the electricity yourself using solar and wind power. This is what i do.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "iaeyfu7",
                                                                    "author": "Leader92",
                                                                    "score": 1,
                                                                    "created_utc": 1653822911.0,
                                                                    "response": "That's too advanced for me. I'd love to reach that point oneday. What are your electricity costs with wind and solar?",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "iaeysdy",
                                                                            "author": "varikonniemi",
                                                                            "score": 1,
                                                                            "created_utc": 1653823191.0,
                                                                            "response": "I don't know how to calculate that. But i calculated it to take 4 years to make back the investment by offsetting house's power usage. But after ukraine situation started the electricity price has spiked, so it shortens it from that. After ROI, it is just free electricity for as long as the  equipment lasts (the solar panels should last 20 years at least).",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "iaf5vgg",
                                                                                    "author": "Leader92",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653828119.0,
                                                                                    "response": "Sounds nice. But how much kw does your solar produce?",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "iaf791x",
                                                                                            "author": "varikonniemi",
                                                                                            "score": 1,
                                                                                            "created_utc": 1653828949.0,
                                                                                            "response": "6 ATM, will be added to 9 soon or next summer.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "iadi747",
                                    "author": "ForbiddenFruit91",
                                    "score": 1,
                                    "created_utc": 1653784958.0,
                                    "response": "I want to do it and i find it very interesting, have been in crypto for years, but also don't want to burn money. Kind of at a cross roads, cause as much as i might find it interesting, i want to make money. I will be looking into it more.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "iadifhq",
                                    "author": "ForbiddenFruit91",
                                    "score": 1,
                                    "created_utc": 1653785086.0,
                                    "response": "Also, wouldn't a long term holder have more benefits to mining? I wouldn't be looking to sell my coin as i mine unless needed of course. But again, coin go up i make more long term? I think i could make money doing it.....idk",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "iadinla",
                            "author": "Leader92",
                            "score": 2,
                            "created_utc": 1653785212.0,
                            "response": "My kWh is $0.048. I'd make around $8 per day with a 100T S19. The S19 line will be profitable for at least 5 years ahead.\n\nWith immersion, you could overclock your S19 to 130th/s drawing roughly 5kW. That's 30% overclocking but 15% profitability.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iadjjbo",
                                    "author": "ForbiddenFruit91",
                                    "score": 1,
                                    "created_utc": 1653785698.0,
                                    "response": "Ok so my estimation is close based off my kWh rate. Closer to my lower side estimate but still, that was with said unit or similar anyway. I have also looked into the immersion cooling as well. I don't understand why some ppl are so negative towards mining potential? Seem ignorant or stupid? Or maybe I am idfk....",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "iaf65l6",
                            "author": "roitakesforever",
                            "score": 1,
                            "created_utc": 1653828292.0,
                            "response": "buying bitcoin in a bear market always better than mining, buy in next crash when bitcoin is around 20k sell next bull market which is probably at 2025 when 1 coin is 150k+ minimum",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iadg3mf",
                    "author": "thickskull521",
                    "score": 1,
                    "created_utc": 1653783800.0,
                    "response": "I’ve been wanting to build an immersion S9 setup. Mostly for fun, not to be profitable… Immersion is better for keeping dust out too. \n\nWhat fluid did you end up doing?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iadhtrt",
                            "author": "Leader92",
                            "score": 5,
                            "created_utc": 1653784753.0,
                            "response": "Dialectric fluid was a barrier for me and it was what kept me from getting in. A 40L Bitcool bucket or another ASIC-based fluid would cost me $3,000 plus shipping, not to mention that liquid imports are not allowed where I'm from.\n\nI ended up using a premium transformer oil called Shell Diala. 209L drum for $500. Some miners claim to have used it for 2 years without issues, while others who claim to be experts in the transformer industry say such fluid will eventually have a compatibility issue with the rubbers holding the capacitors in hashboards. \n\nEither way, I'm eventually going to use Bitcool when I'm %110 sure that my system is leakproof. \n\nIf you're doing it for fun, just go with basic food-based mineral oil, with a fish tank, water fountain pump, and a couple of  400mm PC radiators. If you're not into DIY, order an all-in ready-to-use FogHash [C1 immersion setup.](https://www.foghashing.io/c1) It can handle a single S19 and it's cheap ($1,500)",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iael2gq",
                                    "author": "varikonniemi",
                                    "score": 0,
                                    "created_utc": 1653811017.0,
                                    "response": "What is the benefit of a fucking 3 grand per 40 liter fluid compared to food oil that is 10 times cheaper?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iaevhjx",
                                            "author": "Leader92",
                                            "score": 0,
                                            "created_utc": 1653820416.0,
                                            "response": "It's definitely different in terms of compatibility and viscosity. Even if you have poor flow distribution, Bitcool is so good that it will carry all heat out. Mineral oil on the other hand is not designed for such application and won't do as good, not to mention that it has been reported to eat rubbers that hold PCB capacitors.\n\nI'd use it for experimental purposes only with an ASIC that is cheap and unprofitable.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iaexkcs",
                                                    "author": "varikonniemi",
                                                    "score": 1,
                                                    "created_utc": 1653822197.0,
                                                    "response": "mineral oil is not food grade oil. Food grade oil is very neutral on rubber.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iaexr7q",
                                                            "author": "Leader92",
                                                            "score": 1,
                                                            "created_utc": 1653822351.0,
                                                            "response": "What food-grade oil are you referring to? Sunflow oil?",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "iaexutk",
                                                                    "author": "varikonniemi",
                                                                    "score": 1,
                                                                    "created_utc": 1653822435.0,
                                                                    "response": "Certainly not, that is PUFA so it oxidizes quickly and goes rancid.\n\nMCT is what i had in mind, 100% saturated, distilled pure fat that is very fluid as  it has short chain length.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "iaeyb5c",
                                                                            "author": "Leader92",
                                                                            "score": 1,
                                                                            "created_utc": 1653822807.0,
                                                                            "response": "I don't know what that is but the sole purpose to even consider anything other than engineered ASIC fluids is the price. 20L of this MCT goes for something like +200$.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "iaeyh9l",
                                                                                    "author": "varikonniemi",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653822943.0,
                                                                                    "response": "indeed, and bitcool at 1500$ for same amount",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iae9reo",
                    "author": "ImpressiveAd1276",
                    "score": 1,
                    "created_utc": 1653801696.0,
                    "response": "Where do you buy your miner from? I’m in Australia and keen to try it out.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaevwzr",
                            "author": "Leader92",
                            "score": 1,
                            "created_utc": 1653820798.0,
                            "response": "Go with an S9 first to try things out first, imo. [Here](https://www.reddit.com/r/BitcoinMining/comments/uilzww/comment/i7dea2o/?utm_source=share&utm_medium=web2x&context=3)",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iaewilw",
                    "author": "savinelli_smoker",
                    "score": 1,
                    "created_utc": 1653821317.0,
                    "response": "Hmmm is that 300k or 3m…",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}