{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uwaj3v",
            "title": "domain for sale",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uwaj3v/domain_for_sale/",
            "author": "adampsyreal",
            "created_utc": 1653340344.0,
            "score": 1,
            "num_comments": 0,
            "subreddit": "Bitcoin",
            "selftext": "NXBT.com is for sale at Sedo.com in a Sedo Auction.",
            "stickied": false,
            "comments": []
        },
        {
            "id": "ui1mol",
            "title": "AUXU Global auxuglobal.com is a big scam. even if you see ppl saying they withdraw is just because they recommended others to \"invest\". so they are part if scam as well (indirect). and i have tonns of proofs.",
            "url": "https://i.redd.it/dfpr0lds2fx81.jpg",
            "author": "AnonymousHolySaint",
            "created_utc": 1651651640.0,
            "score": 2,
            "num_comments": 21,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i7ixwmd",
                    "author": "rolloverme",
                    "score": 1,
                    "created_utc": 1651819726.0,
                    "response": "All my transactions are applied and successfully withdrawn, use ERC-20 Chain, its safer but takes a bit more time. The customer support also recommend to do the transaction in erc-20. Pls stop spreading false informations.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7j6a0u",
                            "author": "AnonymousHolySaint",
                            "score": 1,
                            "created_utc": 1651826987.0,
                            "response": "Thats BS. You probably took out few pennies. Or you recommended others , and they are paying for your withdrawal. I have too many proofs, and i cant post all screen shot and info here... i tried on all networks. They say 1st tries, i traded ecot, qnd thats under investigation by sec till 29th april. (Big BS, they aren't  even registred as a company, anywhere, qnd they have a shit gmail and a wtp contact) than on 29th they said i need to deposit 1600 usdt in taxes because thats wht IRS say lmfao.... so cut the crap. Auxu global is a freakin' big SCAM",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7m9zw8",
                                    "author": "rolloverme",
                                    "score": 1,
                                    "created_utc": 1651881815.0,
                                    "response": "Okay, I have already withdrawn 20k USDT and have like 2 people shown and invited to this app. One person invested around 3k USDT the other one 500. My transactions were applied all confirmed to crypto.com between 10 minutes - 23 hours. Never had a case with s IRS. So you tried ERC-20 Network?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i7nqma0",
                                            "author": "Independent-City-474",
                                            "score": 1,
                                            "created_utc": 1651915499.0,
                                            "response": "That‘s also my experience. ERC20 works fine and me and my team have withdrawn way more than we have ever invested. I can also prove this with tons of screenshots. Again, stop bullshitting and making new threads with the same topic after being corrected.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i7ns6l9",
                                    "author": "rolloverme",
                                    "score": 1,
                                    "created_utc": 1651916933.0,
                                    "response": "If you have your so called \" tons of proof\" why dont you upload your \"proof\" on imgur.co m and post it as a comment?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i7nvr5p",
                    "author": "AnonymousHolySaint",
                    "score": 1,
                    "created_utc": 1651920020.0,
                    "response": "Soooo. I see you guys are now on reddit as well. When will i see you in FB? You are not there(as far as i know)\nIf there is anyone wanting to believe these scammers, consider this:\n1. Official contact is a shit gmail addres.\n2. They dont have an addres, contact phone or whatever \n3  they claim tgey are usa based, but in app time is si gapore, well i called SEC in usa, and they never heard of them, and said they received multiple enquiries for AUXU,. And i contacted the same authority in singapore. They never heard of them either\n4. They websites, the auxu websitw, ecot  nnpc, ndkc, tont, etc, their \"exclusive coins\" they are all registered in the same day , by the same person (who is protected by godaddy premium), registered in  china, through same hosting. The fotos of the \"team\" from voe coins. You can find them on google on a clothing store lol.\n5. That Charlotte sent a fake passport as \"proof that she is legit\"\n6. They claim to deposit money as in \"taxes  because thats what the IRS says\" so you can withdraw money, and im not talking abou few dollars  im talking thousands.\n7. Their fake coins have a pattern 90% of the time, 2 green, one red, 3 green, than, the other way around. If you look at graphic  the 5 mins one, the amount traded every 5 minutes is the same (around 75k) that is literally impossible for a coin to be traded always same amount every 5 minutes frame \n8. Their wallet is like 150k dollars. What platform has only 150k main wallet? Lmao. They claim they have 45k users? BS. Track their wallet and you will see what gets in and out and where. \n\nSo you commenting here, claiming auxu is legit. Go sing at another table. We are many on fb that ha e been scammed by them.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7povrb",
                            "author": "rolloverme",
                            "score": 1,
                            "created_utc": 1651952684.0,
                            "response": "Thank you for the detailed comment. Its just strange that my friend who invested 500 USDT and never has invited anyone else and withdraw with YOIF 4.500 transaction sucessfully. He also had panic about the scam thing and withdrawed instantly. I said to him its his choice. So he stopped with AUXU. Do you have a possible explanation for this? There is a case wherre someone claimed he is from AUXU I think that that kind of person \"charlotte\" I personally never heard of her and didnt got invited by her. There is a case that someone is disguising as fake AUXU Global and maybe thats her.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7ptc01",
                                    "author": "AnonymousHolySaint",
                                    "score": 1,
                                    "created_utc": 1651954721.0,
                                    "response": "Lol. Thats how she claims her name is. Even in the email from auxu from auxu ngfk @ gmail, they answered to keep in contact with charlotte. I just lookes at their wallet now  there is no 4500 amount out of their wallet in the past month... so..... you know that all these infos about wallets and transactions, hash, contracts etc, are public? \nBtw. There is no reciord anywhere that ecot, tont, nnpc, yoif, etc exist. These \"tokens/coins\" are not on any blockchain. Nothing even on google except auxu \"press realese\" and the direct websites of the coins... whom btw they are all the same, literally...",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i7q3gb7",
                                            "author": "rolloverme",
                                            "score": 1,
                                            "created_utc": 1651959295.0,
                                            "response": "As far as my knownledge goes, its a private blockchain so it makes sense that its not public listed. All I can say is that the withdraw works for me pretty well and the other 2 friends. Do you have screenshots of your ERC-20 transactions?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i7rc4wx",
                                                    "author": "AnonymousHolySaint",
                                                    "score": 1,
                                                    "created_utc": 1651982367.0,
                                                    "response": "Of course i do lol. I screenshot everything.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i7w5j5x",
                                                            "author": "xBlackDogYT",
                                                            "score": 1,
                                                            "created_utc": 1652079973.0,
                                                            "response": "Bro like please share the SS, coz I think I got a hit of this application, 2 weeks back an unknown no contacted me calling me someone else, and I told it's a wrong number, later I started to chat from my end and today she recommended me to invest in ICO on AUXU Global.\n\nAnyhow I am in market for like 2 years and have been victim of few scams as well, so I am not going to invest in any ICO without a research.\n\nBut together (if it's a scam) we can beware other's to not get trapped.\nSo I don't have any legit proof to show, can you share the SS and there main wallet address, I can do some research from my end as well.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i7w67zf",
                                                                    "author": "AnonymousHolySaint",
                                                                    "score": 1,
                                                                    "created_utc": 1652080558.0,
                                                                    "response": "TV9kPxaQTXLfHLqaQDdsWNsN4HecdsT6Vf\n\nLqst time i checked was 200k dollars worth. Now 280k... ppl qre keep being scammed....\nHave you ever seen a trading platform having \"THAT\" much money in it? Lol. And the new ICO voe, the \"team\" on their website is google downloaded fotos, the other ico all have same whitepaper like, qll websited built on same way, same date. No info qbout them qnywhere except at quxu.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i7wbbwk",
                                                                            "author": "appletwo2099",
                                                                            "score": 1,
                                                                            "created_utc": 1652085200.0,
                                                                            "response": "100% SCAM.\n\nThey fish people via Whatsapp and use the same scheme: a nice fake picture of a young woman, saynt she was introduced on a very exclusive platform from her uncle.\n\nChecking her facebook profile it shows fake pictures of her supposely daily life with only fake friends on her profile.\n\n[https://www.facebook.com/profile.php?id=100076323094564](https://www.facebook.com/profile.php?id=100076323094564)\n\nEvery time it's a different fake profile. \n\nBS and definitely 100% scam.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i7wbnfi",
                                                                                    "author": "AnonymousHolySaint",
                                                                                    "score": 1,
                                                                                    "created_utc": 1652085497.0,
                                                                                    "response": "Thats what im trying through my post. To warn ppl. But sadly i see their wallet is growing....",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "i7wb521",
                                                                    "author": "appletwo2099",
                                                                    "score": 1,
                                                                    "created_utc": 1652085025.0,
                                                                    "response": "That's exactly the same way they tried to approach me.\n\nTexted, wrong number, staretd a conversation thwn asked me to invest.\n\nInvited me onthe platform etc etc etc.\n\nBig scam\n\nDO NOT TRUST comments that are recommending this app. Most likely the scam team have noticed we are exposing them and they are posting positive comment to make inexpert traders think that platform is legit.\n\nThat's a scam 100%",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9np5bb",
                    "author": "RecordingAccurate883",
                    "score": 1,
                    "created_utc": 1653290111.0,
                    "response": "Hello everyone! I have the same problem, i was approached by Amber with her uncle and the same shit! First i was invested 300$ and i make 600$ after i withdraw successfully in my wallet from crypto.com! Then I put money back in Auxu! I invest in ICO and i made until now arround 230.000$! Linda, my advice customer from Whatsapp tell me if I can withdraw that money i need to deposit 1% from total assets! Thats meens I have to deposit 2300$! Now I figured it is a scam because they can stop the fees from my earned money in the Auxu! Why I need to deposit other amount of money? 🤣🤣🤣 Anyway, it seems i lose 900$ but it will be mind learning do not trust in Amber and other sexy girls 😂",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9on1uo",
                            "author": "quebhsenuf",
                            "score": 1,
                            "created_utc": 1653314481.0,
                            "response": ">o deposit 2300$!\n\nI'm in the same situation. It is a scam for sure. I'm going to report all to my friend in the IT Police. They will be all in jail in a few days.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9op76m",
                                    "author": "Sorry-Ad-7021",
                                    "score": 1,
                                    "created_utc": 1653315482.0,
                                    "response": "Yes exactly same shit here\n\n\nDear users, all new ICO coins issued by the AUXU Global platform will be released on June 9, 2022 (East 8th district time) and officially flow to mainstream trading markets such as Binance, OKEX, coinbase, etc., and hold NDKC on the AUXU Global platform , ECOT, TONT, YOIF, VOE, NNPC, RNG and other currency users, in order to ensure that all tokens can be withdrawn to the mainstream market for circulation and exchanged for fiat currency, please deposit the total assets in your AUXU Global wallet before listing. 1% of USDT is used as a miner's fee to ensure that all token assets you hold can be withdrawn and circulated normally. From May 23rd, AUXU Global will open all token withdrawal channels, and stop depositing miner fees by June 13th. Overdue users will be deemed to have given up all tokens automatically. On June 19, Binance, OKEX, Coinbase and other exchanges will open the reception channel for all AUXU Global tokens, which means free exchange and circulation.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9qbnt3",
                                            "author": "Reasonable_Repeat_53",
                                            "score": 1,
                                            "created_utc": 1653340540.0,
                                            "response": "So our money will go",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9px2qy",
                                    "author": "RecordingAccurate883",
                                    "score": 1,
                                    "created_utc": 1653334210.0,
                                    "response": "Anyway... We lost our money",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "id": "uwak9x",
            "title": "Scientists have demonstrated a new cooling method that sucks heat out of electronics so efficiently that it allows designers to run 7.4 times more power through a given volume than conventional heat sinks.",
            "url": "https://www.reddit.com/r/science/comments/uvwkob/scientists_have_demonstrated_a_new_cooling_method/",
            "author": "simplelifestyle",
            "created_utc": 1653340437.0,
            "score": 61,
            "num_comments": 15,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9s141t",
                    "author": "rak404theman",
                    "score": 4,
                    "created_utc": 1653373334.0,
                    "response": "Since we talk more about energy conservation about crypto mining, i wonder how much face data centre use electricity per day 🤔",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9qbnaf",
                    "author": "manwhole",
                    "score": -2,
                    "created_utc": 1653340533.0,
                    "response": "Seems thirsty.... what does it have to do with crypto aside from the possibility cryoto might pollute less with future tech.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9qekc0",
                            "author": "WritingFun8769",
                            "score": 15,
                            "created_utc": 1653341855.0,
                            "response": "bitcoin mining produces a huge amount of heat, and that heat has to be removed continually so the mining rigs can continue working. the cooler they remain, the better they function. this article directly applies to bitcoin in that way.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9r387a",
                                    "author": "artificialfire",
                                    "score": 2,
                                    "created_utc": 1653353810.0,
                                    "response": "For almost 50 years the Brits have been using a simple device to divert heat to an external heat sink or a steel water pipe with cold water flowing through it. It is called a zener diode and they cost about $25.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9rxjm0",
                                            "author": "rocketeer8015",
                                            "score": 2,
                                            "created_utc": 1653370564.0,
                                            "response": "https://en.m.wikipedia.org/wiki/Zener_diode\n\nHmmm…",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9rxku0",
                                                    "author": "WikiMobileLinkBot",
                                                    "score": 0,
                                                    "created_utc": 1653370588.0,
                                                    "response": "Desktop version of /u/rocketeer8015's link: <https://en.wikipedia.org/wiki/Zener_diode>\n\n --- \n\n ^([)[^(opt out)](https://reddit.com/message/compose?to=WikiMobileLinkBot&message=OptOut&subject=OptOut)^(]) ^(Beep Boop.  Downvote to delete)",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9qfdx5",
                                    "author": "manwhole",
                                    "score": -5,
                                    "created_utc": 1653342229.0,
                                    "response": "So with new tech to use energy more efficient, we end up using more energy to make more virtual currency with its main attribute being its limited supply. So on a meta level, there are questions.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9qheha",
                                            "author": "WritingFun8769",
                                            "score": 3,
                                            "created_utc": 1653343166.0,
                                            "response": "no. the cost of running a rig decreases and the ability of a rig to process information becomes faster. that has no effect on bitcoin supply or protocol.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9qjw05",
                                                    "author": "manwhole",
                                                    "score": 1,
                                                    "created_utc": 1653344339.0,
                                                    "response": "So what would one do with the savings? Reinvest in rigs? And these savings will encourage others to participate. Therefore, the energy savings will be negated by the increase in mining. Hence, no energy saving.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9qut7g",
                                                            "author": "WritingFun8769",
                                                            "score": 2,
                                                            "created_utc": 1653349653.0,
                                                            "response": "all things balance out in some way. it’s still not a bad thing",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "i9qsasl",
                                                            "author": "bert_and_earnie",
                                                            "score": 3,
                                                            "created_utc": 1653348404.0,
                                                            "response": "There is no energy savings. It just disipates the heat better",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9rovl8",
                                    "author": "bitsteiner",
                                    "score": 0,
                                    "created_utc": 1653364804.0,
                                    "response": "You can't crank the mining rigs up only by extracting more heat. There are other physical constraints.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9rfxne",
                            "author": "arbalest_22",
                            "score": 2,
                            "created_utc": 1653359932.0,
                            "response": "Do you even mine, bro?? Lmfao",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9rc5cr",
                    "author": "ride_the_LN",
                    "score": -1,
                    "created_utc": 1653358082.0,
                    "response": "Pretty weak as a computing story let alone a bitcoin one",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9s9sbg",
                            "author": "52134682",
                            "score": 1,
                            "created_utc": 1653380969.0,
                            "response": "It's not directly related to Bitcoin. But indirectly related to it. Its a fine post for the subreddit.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}