{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uy6mld",
            "title": "Michael Saylor: \"We could create $100T of value in the real world simply by building applications on top of Bitcoin as a foundation. Continually trying to reinvent the wheel and create competitive things is a massive waste of time, and it's a diversion of human creativity.\"",
            "url": "https://podclips.com/c/vKeiWB?ss=r&ss2=bitcoin&d=2022-05-26",
            "author": "PodClips",
            "created_utc": 1653568504.0,
            "score": 43,
            "num_comments": 12,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "ia2ctgd",
                    "author": "stryker7314",
                    "score": 1,
                    "created_utc": 1653573127.0,
                    "response": "Bitcoin prints 100T? The feds \"hold my beer\"",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia26s6f",
                    "author": "frequent_heron_2102",
                    "score": 0,
                    "created_utc": 1653570328.0,
                    "response": "I'm going to disagree here. Bitcoin isn't the optimal platform for every possible application. Building on top of it isn't the best way to implement certain things and that's why there are alternatives.\n\nBitcoin was intended to be electronic, peer-to-peer cash. Trying to shoe-horn other ideas into it dilutes the actual value it has.\n\nKeep bitcoin bitcoin. Focus on its core use case.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia2fg7g",
                            "author": "cosmicnag",
                            "score": 1,
                            "created_utc": 1653574265.0,
                            "response": "Hes talking about building 'on top of' Bitcoin , not changing Bitcoin itself. This is what makes shitcoins irrelevant. Only the base layer needs to be a blockchain, overlay protocols can simply use it as a fiduciary layer. Lightning is the most prominent example at present (which bounced all scaling shitcoins). Soon, all smart contract shitcoins will also be irrelevant when protocols such as TARO,RGB, Fabric, etc are ready for mainnet.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "ia29pnx",
                            "author": "demo_matthews",
                            "score": 0,
                            "created_utc": 1653571729.0,
                            "response": "I don’t claim deep Bitcoin knowledge, but any digital token can be used as a basis for trust to have things built on top of them. That doesn’t have to change what the underlying thing is, it just changes the applied use of the thing. A (probably bad) analogy I think of for what is being said is that a satoshi could be like a shipping container. Shipping containers are commodity, generally plentiful, well trusted and understood for their purpose. You can put anything in them - xboxes, crates of avocados, trash, gold bars. Their features are obviously physical - a certain volume, maximum loaded weight etc. If you look at a shipping container from the outside you have no idea what it is worth in total because you don’t know what is inside but the vessel has a well understood value. Sats could be used in the same way. They could be used to pair with digital payloads whose value would be far higher than the sat. The sat is the shipping container - well understood, reasonable cost for the value it provides. Building other block chains that are specifically for certain things is like saying “these shipping containers are only for bananas, these are only for dirt bikes”. There can be value in that if the container is purpose built (like a refrigerated shipping container) but with digital assets, it’s easier to add features to Bitcoin through the normal rfc and merge request process than standing up a competing coin (which will always be compared to btc). That’s where the wasted creativity comes into play. As crazy as it sounds, trying to make new coins is less potentially lucrative than making new technologies enabled by btc. People who get this will probably be the ones to say “making a billion dollars is cool, but you know what’s cooler? Making a trillion dollars”. Thank you for coming to my Ted talk",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "ia2bayj",
                            "author": "harmlessdissent",
                            "score": 1,
                            "created_utc": 1653572458.0,
                            "response": "Peer to peer transactions were dumped by Satoshi himself very early on. Its frankly ridiculous.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia2i4zy",
                                    "author": "Jetjones",
                                    "score": 1,
                                    "created_utc": 1653575396.0,
                                    "response": "Source? Would love to read what he had to say about this.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia2iec8",
                                            "author": "lib3rty47",
                                            "score": 1,
                                            "created_utc": 1653575506.0,
                                            "response": "Trust me bro",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia24xg6",
                    "author": "DreadPirateNot",
                    "score": 1,
                    "created_utc": 1653569389.0,
                    "response": "That’s the essence of capitalism.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia2c1tw",
                    "author": "neckos",
                    "score": 1,
                    "created_utc": 1653572793.0,
                    "response": "$100T? What a wild claim. This dude is getting crazy.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia2g8vt",
                    "author": "makito_burgerito",
                    "score": 1,
                    "created_utc": 1653574605.0,
                    "response": "Liquidation price is near, shill level 100",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}