{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uzrmvm",
            "title": "Creating a new wallet & restoring",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/uzrmvm/creating_a_new_wallet_restoring/",
            "author": "Pots454",
            "created_utc": 1653757711.0,
            "score": 3,
            "num_comments": 14,
            "subreddit": "BitcoinBeginners",
            "selftext": "I know this may be stupid and a bad idea (it’s for educational purposes) I would like to create a new wallet using my own word list and also verify I can access my existing accounts if something happens like say I lose my hardware wallet. I have a ledger and I am aware I can restore it through them. \n\nThe whole point is I want to know I can go somewhere else, like an online wallet, with the same word list and have access to accounts if I needed to.\n\nI have tried 7 or 8 different wallets (all online wallets) and all of them generate a new list for a new wallet. None had an option to enter your own list. (Unless its a wallet you had with them and you want to restore it).\n\nIn fact even having a legitimate existing key doesn’t help because no option to use it.\n\nI know they are out there. Figured it’s quicker to ask than keep downloading wallets.\n\nCan anyone suggest any that would allow this?",
            "stickied": false,
            "comments": [
                {
                    "id": "iad280c",
                    "author": "igadjeed",
                    "score": 2,
                    "created_utc": 1653776594.0,
                    "response": "> my own word list\n\nThat is probably insecure\n\n> The whole point is I want to know I can go somewhere else, like an online wallet, with the same word list and have access to accounts if I needed to\n\nThe recovery mnemonic system was not designed for a recovery mnemonic to be portable between different wallet apps or devices. Much of the time, it will work. Sometimes it will not work\n\n> None had an option to enter your own list. (Unless its a wallet you had with them and you want to restore it)\n\nThe restore function is the way to enter your own word list",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iabylqn",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653757711.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iacav5h",
                    "author": "So-Cal-Mountain-Man",
                    "score": 1,
                    "created_utc": 1653763593.0,
                    "response": "RemindMe! 1 days",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iacks0q",
                    "author": "Narmotur",
                    "score": 1,
                    "created_utc": 1653768346.0,
                    "response": "Any wallet that supports BIP 39 should allow you to import a mnemonic. There's a list of different wallets on this webpage: https://coinguides.org/bip39-wallets/",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}