{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "utk8au",
            "title": "Mining on a laptop: worth the risk?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/utk8au/mining_on_a_laptop_worth_the_risk/",
            "author": "sarah_the_intern",
            "created_utc": 1653016954.0,
            "score": 0,
            "num_comments": 10,
            "subreddit": "BitcoinBeginners",
            "selftext": "I own partial bitcoin and want to try mining it. However, I only have a laptop computer. I read that this can be a problem as the fans are quite small and mining puts off a lot of heat. \n\nIs it worth the risk? Does anyone here mine from a laptop?",
            "stickied": false,
            "comments": [
                {
                    "id": "i9ac643",
                    "author": "Sebbysludge",
                    "score": 4,
                    "created_utc": 1653018309.0,
                    "response": "So if you plan on needing to use this laptop for 3-5 years probably not worth the risk. What GPU is in it? And you know what wattage version of that GPU it is? This can effect performance vastly. \n\nAlso just for your own education you won’t be mining btc you could possibly mine other coins and get paid in btc or get paid in another coin and then convert to btc!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9a9qef",
                    "author": "AutoModerator",
                    "score": 2,
                    "created_utc": 1653016954.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ajfta",
                    "author": "petewguy",
                    "score": 2,
                    "created_utc": 1653022832.0,
                    "response": "You won’t be able to mine any Bitcoin with a laptop",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9b2opj",
                    "author": "FieserKiller",
                    "score": 1,
                    "created_utc": 1653038415.0,
                    "response": "mining bitcoin on a laptop was a thing till 2013 or so, not today.\n\nYou can mine shitcoins on your laptop if it is a gaming device with a great graphics card and trade them for bitcoin but the laptop will be hot, loud and you'll probably spend more on electricity then the laptop is able to mine anyway",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9b5egc",
                    "author": "88joeboi",
                    "score": 1,
                    "created_utc": 1653040514.0,
                    "response": "I wana use it for better purposes. It will be destroyed sooner",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}