{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "gz3buk",
            "title": "Should I split up my coins into MULTIPLE addresses or put them all into ONE address generated by Trezor?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/gz3buk/should_i_split_up_my_coins_into_multiple/",
            "author": "climateimpact827",
            "created_utc": 1591636134.0,
            "score": 48,
            "num_comments": 13,
            "subreddit": "BitcoinBeginners",
            "selftext": "Hey all.\n\nLets say that I have exactly 1 BTC total and I want to transfer all of this into a secure form of cold storage. For this purpose, I have bought a TREZOR, created a wallet, and backed up the mnemonic phrase on a piece of metal. The seed is secure. Right now the coins are split up into multiple wallets of multiple types (mobile wallet, paper wallet, exchange wallet).\n\nSince the TREZOR can generate a (near) infinite amount of addresses, I'm wondering what makes more sense:\n\n* **Option #1**: Create one Bech32 address and send ALL funds there in multiple transactions and combine it all into a big wallet (1.0 BTC in 1 address)\n\n* **Option #2**: Create multiple Bech32 addresses for each (Mycelium/paper/exchange) wallet and have the coins split up (0.1 BTC in first address, 0.4 BTC in second address, 0.2 BTC in third address, 0.3 BTC in fourth address)\n\nIf I understand it correctly, each transaction is created by combining multiple unspent outputs until you have reached the desired amount. The rest will be sent to a change address.\n\nNow, which of my ideas makes more sense from ...\n\n* **Question #1**: a monetary point of view, in terms of fees (as cheap as possible). If I have multiple smaller wallets it should be more expensive to construct a transaction, right?\n\n* **Question #2**: a legal point of view - what if I ever have to let the government check my funds or prove my ownership for some reason? Should they see ALL coins or just a single address?\n\n* **Question #3**: a technical point of view - is there any chance splitting up the balances might make me lose them somehow?\n\n\n\nI'm open to all kinds of advice and appreciate your help. Thank you for reading!",
            "stickied": false,
            "comments": [
                {
                    "id": "fte2pw1",
                    "author": "MostBoringStan",
                    "score": 19,
                    "created_utc": 1591638768.0,
                    "response": "If you ever plan on spending some of your coins, you should definitely split it up from a privacy standpoint.\n\nLet's say you want to buy something for 0.01 BTC. When you send your BTC the seller will be able to look at the transaction and easily see you have 1 BTC. If you split it up into addresses containing around 0.1 BTC, they will only know you have that much. They might be able to do chain analytics to guess how much you own, but that is all they will know for sure.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "fte6vtr",
                    "author": "Crypto-Guide",
                    "score": 15,
                    "created_utc": 1591640824.0,
                    "response": "The other alternative is to split them up in to multiple accounts on the Trezor. Each account behaves like an independent wallet. \n\nI talk about this in more detail in the first few minutes if this video https://youtu.be/X3_t6wO2f5M",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ftebomh",
                    "author": "GoesTooFast",
                    "score": 4,
                    "created_utc": 1591643192.0,
                    "response": "I split mine up into .2 chunks.  I decided that I didn't want any whole bitcoins in any wallet.  Just in case it ever does moon... I didn't want people seeing anything greater than .2 (just like Stan said)\n\nEdit: Answer #3:  If you ever lose your private keys your coins are gone.  Splitting them up into multiple wallets has no effect on any chance of losing your funds (unless of course you are targeted and maybe don't follow best practices while transfering coins).",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ftdxde5",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1591636135.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They mostly operate via private messages. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ftehls7",
                    "author": "brianddk",
                    "score": -1,
                    "created_utc": 1591646101.0,
                    "response": "Each TXN needs to send to a fresh address.  It's for privacy but also for security.  If fund the same address twice, you may spend from the same address twice.  Spending twice from the same address exposes your public keys which has been used before ([see android bug](https://bitcoin.org/en/alert/2013-08-11-android)) the steal funds.  Now there is no way Electrum has the android bug, but it does expose the fact there reused addresses are less secure than one-use addresses.\n\n^(Edit: Added android bug link)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ftfqjfx",
                    "author": "Awenceslao",
                    "score": -1,
                    "created_utc": 1591670251.0,
                    "response": "Newbie here, what is the recommended plaform for crypto trading? anyone pleaseeeew",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ftgkrob",
                            "author": "drrgrr123",
                            "score": 3,
                            "created_utc": 1591694665.0,
                            "response": "https://testnet.bitmex.com",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ftfcs5i",
                    "author": "call_me_at_1800",
                    "score": 0,
                    "created_utc": 1591662308.0,
                    "response": "I was in the same situation a week ago but I ended buying a ELLIPAL wallet and just transferred my btcs in there . Safe & secure",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}