{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uzrn5u",
            "title": "84% Of Americans Do Not Believe That Bitcoin Investments Are Harmful To The Environment",
            "url": "https://bobosandwojaks.com/84-of-americans-do-not-believe-that-bitcoin-investments-are-harmful-to-the-environment/",
            "author": "Tejas_LiMan",
            "created_utc": 1653757733.0,
            "score": 33,
            "num_comments": 12,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "iac3b2i",
                    "author": "diamened",
                    "score": 1,
                    "created_utc": 1653759937.0,
                    "response": "You see how this title is worded in a way that's manipulative? Let's fix it:\n\n\"84% Of Americans Believe That Bitcoin Investments Are Not Harmful to The Environment\"\n\nSee the difference?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iac5xk8",
                            "author": "Acceptable-Risks",
                            "score": 1,
                            "created_utc": 1653761194.0,
                            "response": "Right. As if the article is assuming bitcoin is bad for the environment and it's wrong to think it's not.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iabzkv5",
                    "author": "SevenOrSoda",
                    "score": 6,
                    "created_utc": 1653758168.0,
                    "response": "I never took the survey",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iac05o7",
                    "author": "Nada_Lives",
                    "score": 4,
                    "created_utc": 1653758438.0,
                    "response": "How many can define \"Bitcoin Investment\"?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iac9qjf",
                            "author": "ikkatop",
                            "score": 1,
                            "created_utc": 1653763045.0,
                            "response": "How many can even spell it?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iac90q2",
                    "author": "BeefFeast",
                    "score": 1,
                    "created_utc": 1653762696.0,
                    "response": "84% of Americans are dumb as shit, me included",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iac0dgi",
                    "author": "useemrlymad",
                    "score": 7,
                    "created_utc": 1653758538.0,
                    "response": "but a survey for americans only, leaves out all the educated people around the world.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iac13c9",
                            "author": "Tejas_LiMan",
                            "score": 2,
                            "created_utc": 1653758881.0,
                            "response": "LoL",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iac74n4",
                            "author": "QuikFalcon",
                            "score": 1,
                            "created_utc": 1653761778.0,
                            "response": "Nice.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iac3a0m",
                    "author": "coinfeeds-bot",
                    "score": 1,
                    "created_utc": 1653759924.0,
                    "response": "tldr; According to a survey by Cornerstone Wealth, 84% of Americans do not believe Bitcoin investments are harmful to the environment. One-third of Americans are unaware of the substantial environmental impact of Bitcoin mining. More than a quarter of people believe Bitcoin is good for the environment, according to Forbes Advisory.\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iac9sgs",
                    "author": "TopTierTuna",
                    "score": 1,
                    "created_utc": 1653763071.0,
                    "response": "More astroturfing of this subreddit.  Is this financed by central banking?  Who the fuck posts shit like this on the bitcoin subreddit?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iac9slk",
                    "author": "ScamJustice",
                    "score": 1,
                    "created_utc": 1653763073.0,
                    "response": "Bitcoin is international. Theres 7 billion other people on the planet",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uzrkb8",
            "title": "How to not trust and verify certain things when I'm dumb?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uzrkb8/how_to_not_trust_and_verify_certain_things_when/",
            "author": "Big_Papa_Bear_",
            "created_utc": 1653757508.0,
            "score": 15,
            "num_comments": 17,
            "subreddit": "Bitcoin",
            "selftext": "Hello,\n\n&#x200B;\n\nBeen in the BTC space since 2019 and have fallen down the rabbit hole and been doing a bunch of research. I know the basics but am definitely not an expert. Two things that are bugging me that I am not sure how to verify are:\n\n&#x200B;\n\n1. I'm running my own Umbrel Node. How do I actually know that this thing is part of the grand decentralized bitcoin network, and not just a slick GUI ontop of a wallet? How do I know that I am participating in the network and helping to decentralize it? I can look in the SSD and look at the files that its downloaded, but how do I VERIFY that this thing is actually validating blocks proposed from the miners? \n2. I use a trezor wallet to store my btc. I know that it is open source and everything, but I'm too dumb to figure out how to access that and read it, and even if I could, I'm not a programmer, so idk what it would actually be saying. But how do I verify that, for example, when I connect my wallet and either a) install new firmware or b) download the latest version of the trezor suite, how do I know someone somewhere, or the trezor team themselves arent going to just hack my wallet and take everything? I can trust when people say \"that can't happen\" but how do I fricking VERIFY this? \n\n&#x200B;\n\nPlease help a dumb bitcoin enthusiast out. \n\n&#x200B;\n\nTY",
            "stickied": false,
            "comments": [
                {
                    "id": "iabzrmr",
                    "author": "Nada_Lives",
                    "score": 4,
                    "created_utc": 1653758257.0,
                    "response": "[https://github.com/getumbrel](https://github.com/getumbrel)\n\nDig in!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ial3e86",
                            "author": "Big_Papa_Bear_",
                            "score": 1,
                            "created_utc": 1653943263.0,
                            "response": "Github is a little over my head. I am not sure what I am digging into exactly.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iac1sqc",
                    "author": "BTCMachineElf",
                    "score": 3,
                    "created_utc": 1653759217.0,
                    "response": "Umbrel isn't entirely open source, but you can ssh in and look at the commands running, including lnd and bitcoind, and can issue any user command to lnd. You can look at the log files to see the blocks being verified. \n\nTrezor absolutely could push an update that steals your coins. But all their software is open source, and they would be caught quickly. So maybe wait a week or two before updating if you're concerned.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ial3k3g",
                            "author": "Big_Papa_Bear_",
                            "score": 1,
                            "created_utc": 1653943342.0,
                            "response": ">ssh in and look at the commands running, including lnd and bitcoind, and can issue any user command to lnd. You can look at the log files\n\nNot sure I understand. Like I said; am dumb.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ial4tw6",
                                    "author": "BTCMachineElf",
                                    "score": 1,
                                    "created_utc": 1653943942.0,
                                    "response": "SSH is a linux command to tunnel into another computer in a terminal.\n\nHow could you expect to verify anything, really, without technical knowledge? Reviewing code would do no good.\n\nReally, like anyone, we need to trust the community as a whole, and the diverse base of programmers who do review the code.\n\nOne neat thing about bitcoin is it does align our motives. Any bitcoin holder is betting on bitcoin to work, and for bitcoin to work, it needs to be trustable by the end user. To that end, there must be a base of open, trustable software. If there is a bad actor creating software, only the bad actor gains from their actions. Everyone else is motivated to shut them down, and thus open-source software is key. If tools don't exist, someone will create them and someone else will verify that they're legit, because both parties are financially motivated to build an honest bitcoin ecosystem.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iadlw8u",
                    "author": "Brainsick001",
                    "score": 4,
                    "created_utc": 1653787011.0,
                    "response": "You’re not dumb. You just haven’t spend the time learning certain stuff. Don’t be so harsh on yourself.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ial3w87",
                            "author": "Big_Papa_Bear_",
                            "score": 1,
                            "created_utc": 1653943502.0,
                            "response": "I'm saying it a bit tongue in cheek, really. I know that I am not dumb and just haven't spent a lot of time learning it. I have spent a lot of time learning about bitcoin in general, just not these aspects. Related tangent but, it seems if we want wide spread adoption for bitcoin, the \"don't trust, verify\" mantra will not be tenable.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iacvc3u",
                    "author": "Downtown-Ad-4117",
                    "score": 3,
                    "created_utc": 1653773397.0,
                    "response": "Btw, I hope you are aware your wallet doesn't store Bitcoins. It's a signing device to save you some tedious, error-prone work.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ial47uq",
                            "author": "Big_Papa_Bear_",
                            "score": 1,
                            "created_utc": 1653943654.0,
                            "response": "Yep, I am aware of this. I feel when most people say \"store their bitcoin in a wallet\" its used in this sort of colloquial sense. I understand that bitcoin does not actually exist, but to the extent that it does, it exists on the distributed ledger of the blockchain. My wallet holds the passwords to say that I have access to the bitcoin from a certain transaction on the ledger.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iac3665",
                    "author": "Amoci",
                    "score": 2,
                    "created_utc": 1653759873.0,
                    "response": "You either have to learn to read the code to verify or look to the community to provide you with recommendations. You will have to trust the community is not lying to you.\n\n[https://raspibolt.org/](https://raspibolt.org/) is a nice guide if you want to learn some of the verification process. It's not too technical, and we're here if you have questions or run into any issues.\n\nI will say Umbrel is the best running software I've tried for running a node as far as uptime and stability.\n\nI hear Trezor is alright but I've never tried one.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaclxb1",
                    "author": "Narmotur",
                    "score": 2,
                    "created_utc": 1653768920.0,
                    "response": "You can't really. Even if you compile the code yourself, you need to verify it. Even if you verify the code, you can't trust it. Even if you write all the code yourself, you can't trust the tools that compile it, or the operating system it runs on.\n\nEven if you create your own programming language on your own OS, you can't trust the hardware that it runs on.\n\nSee **Reflections on Trusting Trust**: https://www.cs.cmu.edu/~rdriley/487/papers/Thompson_1984_ReflectionsonTrustingTrust.pdf\n\nThe best you can do is try to understand how things work, and do your utmost to stave off any potential holes. A single layer is not enough, you need to follow the swiss cheese model: https://en.wikipedia.org/wiki/Swiss_cheese_model\n\nGood luck!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iadiop8",
                    "author": "igadjeed",
                    "score": 2,
                    "created_utc": 1653785230.0,
                    "response": "> how do I VERIFY that this thing is actually validating blocks proposed from the miners?\n\nOpen a terminal. Type this command\n\n    tail -f ~/.bitcoin/debug.log",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaegx9m",
                    "author": "Jacobgraham1738",
                    "score": 2,
                    "created_utc": 1653807396.0,
                    "response": "The reality is you may not ever be able to verify. But the idea is there are more people out there that can verify if something is open source. There are technical people looking for issues, in fact, anyone technical enough can chime in. This is much better than a closed source system where you simply trust those who know what is in the system and no outside parties can verify their work. \n\nMaybe instead of verify don't trust. Find someone trustable who can verify, because in an open source system there are many more people who will verify/audit a system.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iac0fy4",
                    "author": "uncontrollableop",
                    "score": 3,
                    "created_utc": 1653758571.0,
                    "response": "how do you know our answers will be correct unless you learn by yourself how to verify these things?  there is no shortcut.  it's not that hard. start digging.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iacnkx2",
                    "author": "Downtown-Ad-4117",
                    "score": 1,
                    "created_utc": 1653769700.0,
                    "response": "Maybe look at coldcard? Uses air gapped technology whereas the trezor doesn't. You can download and compile the code yourself.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iagj9jp",
                    "author": "cpt_charisma",
                    "score": 1,
                    "created_utc": 1653851465.0,
                    "response": "1.  Check addresses and transaction information posed publicly with what is in your node.  You will need a 'block explorer' type tool for your node.  If you can verify that your node knows about public addresses and transactions, there's a high probability that you are part of the real network.\n\n2.  If you have a hardware wallet that never connects to your computer or the Internet, you can know that your keys are safe.  I don't know enough about Trezor to know if it meets these requirements.  It's always possible for firmware to give you pre-determined or easy to hack keys.  To prevent this, you can generate your own seed phrase by rolling dice.\n\nYou don't have to be a genius to figure this stuff out.  Just spend some time thinking about it from a thief's point of view.  What would it take to steal someone's bitcoin?  What could you do to counter it?  Are there simple tests to verify that things work the way you think they work?",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}