{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uy7482",
            "title": "When we buy a currency example EURUSD…we are sending our usd to europe…what happen when we buy bitcoin, where does our usd go?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/uy7482/when_we_buy_a_currency_example_eurusdwe_are/",
            "author": "No_Cartographer_3529",
            "created_utc": 1653570092.0,
            "score": 9,
            "num_comments": 15,
            "subreddit": "BitcoinBeginners",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "ia38ege",
                    "author": "igadjeed",
                    "score": 9,
                    "created_utc": 1653585891.0,
                    "response": "> we are sending our usd to europe\n\nYou're not. You're sending USD to the USD buyer and receiving EUR. The buyer can be anywhere",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia2714p",
                    "author": "bitusher",
                    "score": 6,
                    "created_utc": 1653570448.0,
                    "response": "Exchanges facilitate trades between buyers and sellers just like forex markets exchanging dollars for euros. \n\nIf you buy bitcoin , you buy those bitcoin from someone selling bitcoin and they get your dollars and the exchange takes their cut",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia26ay9",
                    "author": "AutoModerator",
                    "score": 2,
                    "created_utc": 1653570092.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia2jq7f",
                    "author": "MrQ01",
                    "score": 2,
                    "created_utc": 1653576059.0,
                    "response": "Speaking in generics, its a trade - you are not necessarily sending USD to Europe, but just trading your USD with someone in exchange for their Euros. The same principle happens for a Bitcoin trade.\n\nIn actuality, when you choose to buy BTC in exchange for your USD, this triggers a buy order which the exchange looks to match with a sell order i.e. someone wanting to buy USD in exchange for their BTC.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia4fv7t",
                    "author": "w_ayne_",
                    "score": 2,
                    "created_utc": 1653604219.0,
                    "response": "If I buy a drink from you, the same thing happens with all transactions. I get the drink, you get the dollars.\n\nReplace the drink with btc, story the same.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia4hxpm",
                    "author": "Brettanomyces78",
                    "score": 1,
                    "created_utc": 1653605181.0,
                    "response": "You're not sending your USD to Europe, you're exchanging it with someone else on the platform who wants USD and has EUR, unless the platform in question is a brokerage.  Then you're just one step removed from that process.\n\nSame thing happens with Bitcoin.  You're exchanging with another user on that same platform.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}