{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uw7z3v",
            "title": "Start earning crypto from your phone now!! So cool. I’ll even give you a $5 start up and show you proof of my two cash outs already in two days!! Use my affiliate code https://r.honeygain.me/CODYE49723",
            "url": "https://i.redd.it/1tcgohfsz9191.jpg",
            "author": "Maleficent-Ad9975",
            "created_utc": 1653333488.0,
            "score": 1,
            "num_comments": 0,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uw7ln9",
            "title": "Just joined the Quarter Club! <0.25 BTC> ;)",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uw7ln9/just_joined_the_quarter_club_025_btc/",
            "author": "randomuser19982833",
            "created_utc": 1653332492.0,
            "score": 5,
            "num_comments": 6,
            "subreddit": "Bitcoin",
            "selftext": "Also, since this is my first Reddit post ever, I had a question about my current Bitcoin purchasing setup.\n\nCurrently I have the majority of my savings in BTC on Cash App (so that I can later transfer it to a cold wallet) and the rest as an amount I will never touch (10-15+ years) on Venmo. So my question is two-fold:\n\n1. Would you recommend I just move all my BTC purchasing power to Cash App for later transfer to a cold wallet?\n\n2. Which wallet do you recommend Ledger or Trezor?\n\nThanks in advance!",
            "stickied": false,
            "comments": [
                {
                    "id": "i9pterf",
                    "author": "Inevitable_River_509",
                    "score": 3,
                    "created_utc": 1653332644.0,
                    "response": "Get a ledger ASAP and move your coins out of Cash App.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9pv5pp",
                            "author": "randomuser19982833",
                            "score": 3,
                            "created_utc": 1653333398.0,
                            "response": "Thanks! From my research I’ve seen that Ledger has a slight advantage over Trezor and that I shouldn’t have anything on Venmo since it’s more of a “betting on Bitcoin” rather than owning the Bitcoin itself. Next I gotta learn about the whole cold wallet transfer process.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9pwghv",
                                    "author": "WritingFun8769",
                                    "score": 1,
                                    "created_utc": 1653333946.0,
                                    "response": "important clarification: a cold wallet is a hardware wallet, but not all hardware wallets are cold wallets; a cold wallet is a hardware wallet doesn’t come in contact with an internet connection, which is called air-gapping. it’s an extra layer of security. i personally don’t have an air-gapped wallet, but it’s still secure enough for me.\n\nregardless, absolutely take custody of your keys asap. get all that coin into your own wallet",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9pvkhw",
                    "author": "tradingnomads",
                    "score": 1,
                    "created_utc": 1653333571.0,
                    "response": "Put it on a Ledger!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9q2hfn",
                    "author": "SpiritmongerScaph",
                    "score": 1,
                    "created_utc": 1653336516.0,
                    "response": "Hardware wallet!\n\nLearn how it all works before sending any significant amount. Test with small sums, erase wallet to test if you wrote your seed phrase correctly, etc.\n\n(Oh and grats!)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9q4vqx",
                    "author": "Reasonable_Ad_5047",
                    "score": 1,
                    "created_utc": 1653337555.0,
                    "response": "Hey Mate,\nFirst of all congrats, that's a big achievement!\nI just bought a ledger nano s plus so their middle Product and I'm super happy with it, easy and fast setup, very clear instructions and love the ledger live app for transactions etc. So I would recommend you buying a ledger over a trezor but I'm speaking as a new ledger fan👍🙂\n\nHave a great day and keep stacking 😉👍",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uw7lvx",
            "title": "So my grandfather is Bitcoin rich and he doesn't know it.",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uw7lvx/so_my_grandfather_is_bitcoin_rich_and_he_doesnt/",
            "author": "The_OG_Jesus_",
            "created_utc": 1653332508.0,
            "score": 0,
            "num_comments": 76,
            "subreddit": "Bitcoin",
            "selftext": "In 2011, my grandfather bought 300 Bitcoin. I don't know how he heard about it but he thought it was a neat idea.\n\nAnd then he forgot about it until yesterday.\n\nHe's living on Social Security income in a tiny apartment, and here he has $9 million worth of Bitcoin.\n\nHow do I tell him, and how do I keep him from getting scammed out of his money if he decides to sell it?",
            "stickied": false,
            "comments": [
                {
                    "id": "i9puc0l",
                    "author": "Cryptocaller",
                    "score": 75,
                    "created_utc": 1653333043.0,
                    "response": "This just sounds so incredibly fake",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9pw5kb",
                            "author": "technotrader",
                            "score": 8,
                            "created_utc": 1653333816.0,
                            "response": "Really, how can you be so bleeding edge in 2011, and then completely not remember Bitcoin as they talk about it on TV, there are ads and articles in newspapers, Bitcoin ATMs exist, etc?\n\nBut, /u/The_OG_Jesus_  , if this story is real, your grandpa is in trouble, like [Lottery winner trouble](https://www.reddit.com/r/AskReddit/comments/24vo34/whats_the_happiest_5word_sentence_you_could_hear/chb38xf/).",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9pxj8q",
                                    "author": "JSammut29",
                                    "score": 3,
                                    "created_utc": 1653334407.0,
                                    "response": ">Really, how can you be so bleeding edge in 2011, and then completely not remember Bitcoin as they talk about it on TV, ther\n\nhe's old, let him blow it",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9qdrm6",
                            "author": "L_Tryptophan",
                            "score": 2,
                            "created_utc": 1653341488.0,
                            "response": "sadly, it probably is. \n\nIts a part of psychological FUD. Retail is less likely to buy it when they know some people got it for almost nothing just 10 years ago. OP has a massive short on btc.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9qvqyr",
                                    "author": "Cryptocaller",
                                    "score": 1,
                                    "created_utc": 1653350117.0,
                                    "response": "Yeah all of OP’s responses are weird and don’t really fit the narrative. Some people just like to make up stories on the internet to get their jollies. If they were telling the truth than they would have never posted this because it’s seriously poor OPsec.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9pvn68",
                            "author": "The_OG_Jesus_",
                            "score": 4,
                            "created_utc": 1653333604.0,
                            "response": "Life is stranger than fiction.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9q4ck7",
                                    "author": "111ascendedmaster",
                                    "score": 3,
                                    "created_utc": 1653337323.0,
                                    "response": "Tbh I think your grandpa was screwing with you when he said he bought 300 btc",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9q4i05",
                                            "author": "The_OG_Jesus_",
                                            "score": 0,
                                            "created_utc": 1653337390.0,
                                            "response": "No. My grandfather is not a prankster.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9q3o3s",
                                    "author": "111ascendedmaster",
                                    "score": 1,
                                    "created_utc": 1653337033.0,
                                    "response": "In 2011 the only way to buy bitcoin was a sketchy wire transfer from a CVS.  He would then have had to instantly move it off exchanges to keep it safe.  Any body’s grandpa smart enough to do that would not have forgotten about his bitcoin.\n\nUnless he bought it from a friend or something weird.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9q5eze",
                            "author": "The_OG_Jesus_",
                            "score": -1,
                            "created_utc": 1653337789.0,
                            "response": "Hey.\n\nDon't be jellies.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9pvrbm",
                    "author": "Silverjakk",
                    "score": 20,
                    "created_utc": 1653333650.0,
                    "response": "You left out the part where you say you’re 4 years old.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9pwz0e",
                    "author": "Possum577",
                    "score": 8,
                    "created_utc": 1653334166.0,
                    "response": "You don’t know how to talk to your grandfather about his good fortune and guide him?!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9pw9gy",
                    "author": "You_Keep_The_Money",
                    "score": 7,
                    "created_utc": 1653333863.0,
                    "response": "My dad works at Nintendo and had nearly the same thing happen",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9q32mj",
                            "author": "vitalyevodin",
                            "score": 1,
                            "created_utc": 1653336772.0,
                            "response": "what exactly ?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9pwr86",
                    "author": "Tvmouth",
                    "score": 6,
                    "created_utc": 1653334072.0,
                    "response": "*Uhg... these answers.* Here's a path worth knowing about: Use a self custody app to move a small amount into a new address, use a local BTC ATM to get a few hundred bucks at a time when needed, and never from your bulk/reserve. ATMs are expensive, but perform a very useful service, so pay the fees (do math, before and after) and support the economy that supports the unbanked. Use the local currency of choice to hire professionals to help move larger quantities (get banked), and if using an exchange, use personal banking with your FIAT to KYC into the exchange before you start loading the account with your BTC. Use fiat to test all the inputs and outputs before you even acknowledge owning that much to any institution.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ptvnl",
                    "author": "WritingFun8769",
                    "score": 6,
                    "created_utc": 1653332845.0,
                    "response": "i mean, just tell him, and help him with things",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9pujpr",
                    "author": "FunSalt",
                    "score": 3,
                    "created_utc": 1653333136.0,
                    "response": "You need to involve REAL professionals at this point.  Find a good CPA and come up with a strategy.   You cannot be too careful here, assume everyone trying to help you just wants to steal your bitcoin.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9pw1y9",
                    "author": "alwaysonmy",
                    "score": 5,
                    "created_utc": 1653333774.0,
                    "response": "Have you actually verified he has 300 bitcoins and it’s not just a fantasy?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9q2s3w",
                    "author": "genuin3",
                    "score": 4,
                    "created_utc": 1653336646.0,
                    "response": ">And then he forgot about it until yesterday.\n\nCmon, for real? Was he in a coma? Around all ATHs (2013 & 2017 and especially 2021)  and generally in the bull runs that previously occurred - Bitcoin was heavily represented in the global news. Being confronted with this news never jogged your Grandpa's memory having 300 BTC? Owning such an amount literally meant (at ATH) having over 300K USD in BTC in 2013, 6 million USD in BTC in 2017 and nearly 20 million USD in BTC in 2021!........ On top, you are saying he owned such wealth - while living on social security in a tiny apartment and only remember all of this yesterday?? If this is not the epitome of a tall tale, I don't know what is.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9q587w",
                            "author": "The_OG_Jesus_",
                            "score": 0,
                            "created_utc": 1653337707.0,
                            "response": "He bought the Bitcoin on a lark and he doesn't follow financial news. He only mentioned it recently after it came up in conversation and he's unaware of what it's worth today.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9qaq2m",
                                    "author": "ts_wrathchild",
                                    "score": 3,
                                    "created_utc": 1653340113.0,
                                    "response": "My guess is he bought something he was *told* was Bitcoin, and was essentially scammed.\n\nBuying *real* BTC in 2011 was not an easy task. I remember doing it many times before bonefied exchanges came about and will never forget the hoops I had to jump through to get my hands on it. When I finally had custody of the first coin I bought, my first thought was \"this is shit, why would anyone go through this\"...\n\nClearly I didn't have vision back then, but my point is that you couldn't just buy it on a whim as you suggest he did. And if he did, he wouldn't forget the process.\n\nI would LOVE to be wrong here and give your grandpa props though.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9qb14u",
                                    "author": "solomonsatoshi",
                                    "score": 2,
                                    "created_utc": 1653340252.0,
                                    "response": "Bullcrap",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9pw8p8",
                    "author": "Ferdo306",
                    "score": 8,
                    "created_utc": 1653333854.0,
                    "response": "Just make something up like you did with this post",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9q5gk2",
                            "author": "Byyzmo",
                            "score": 3,
                            "created_utc": 1653337809.0,
                            "response": "Dude. It’s the first someone made me chuckle in Reddit. \n\nTake my free thing. You deserved it",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9pwe9w",
                    "author": "Huckabuoy",
                    "score": 2,
                    "created_utc": 1653333919.0,
                    "response": "If he was that intellectually curious it’s I find it very doubtful he would need an explanation from you.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9pwnii",
                    "author": "Ok_Pie_6660",
                    "score": 2,
                    "created_utc": 1653334028.0,
                    "response": "Folk off",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9q6ozl",
                    "author": "Waste-Direction1727",
                    "score": 2,
                    "created_utc": 1653338348.0,
                    "response": "😐😑",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9qft9f",
                    "author": "llewsor",
                    "score": 2,
                    "created_utc": 1653342427.0,
                    "response": "r/thathappened",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9qm12g",
                    "author": "BlueBirdDolphin",
                    "score": 2,
                    "created_utc": 1653345357.0,
                    "response": "What kind of grand father do you have ? Bought in 2011 ? So it's a big computer nerd and he dosent know what is Bitcoin ? Com'n",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9pu3n1",
                    "author": "ItsPushOver",
                    "score": 1,
                    "created_utc": 1653332944.0,
                    "response": "Give him a check and show him a decade long rise in value, if he really forgot and didn't go into the space then he probably is not a high risk candidate to do something dumb.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9pupdq",
                    "author": "GinchAnon",
                    "score": 1,
                    "created_utc": 1653333202.0,
                    "response": "if I was in that situation, I'd first, make sure he actually has it, like that its real and he still has access to it.  in case you haven't already.\n\nbut then, I'd see about finding an Accountant/Financial advisor at least minimally familiar with Crypto.  (\"Fiduciary Duty\" is a very important phrase) and then hook him up with them.   \n\nthat sort of money for someone not used to it, almost certainly merits professional assistance at least to get started , IMO.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9put41",
                    "author": "HlIlM",
                    "score": 1,
                    "created_utc": 1653333248.0,
                    "response": "Honestly man if he is retired.  Long-term investment-grade bonds are at the lowest level we have seen in a while.  VCLT would pay him 5% a year.\n\nWith the way the market is now, he has the opportunity to lock in a good interest rate for a decade, live the retired dream.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9pve5n",
                            "author": "The_OG_Jesus_",
                            "score": 0,
                            "created_utc": 1653333498.0,
                            "response": "Lol. He's 71. I'm pretty sure $9 million in cash is plenty without having to invest it. He's got, at most, two decades left, and his cost of living is currently $16,000/yr. There's no way he'll spend all of $9 million.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9py2qe",
                                    "author": "Correct-Log5525",
                                    "score": 2,
                                    "created_utc": 1653334635.0,
                                    "response": "Yeah but if he buys an asset with a 5% return then he will make $450k per year and he won't have to spend the principal..  the money needs to be put into something that will allow a return.  \n\nIf it were me I would keep half in Bitcoin, and put the other half into something that returns an active yield",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9q4q81",
                                            "author": "The_OG_Jesus_",
                                            "score": 1,
                                            "created_utc": 1653337489.0,
                                            "response": "I understand how investing works. But a 71-yr-old man with $9 million doesn't need to worry about investing.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9q5xhw",
                                                    "author": "Correct-Log5525",
                                                    "score": 2,
                                                    "created_utc": 1653338016.0,
                                                    "response": "Right but wouldn't he want to leave the maximum amount possible for his family after he is gone?  Maybe not I guess",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i9qeudt",
                                                    "author": "Puzzleheaded-Run-243",
                                                    "score": 1,
                                                    "created_utc": 1653341983.0,
                                                    "response": "This guy's an idiot.  Somebody has to explain to u benefit of investing for the possibilities to leave his grandson and great grandson better off and like your greedy mind hasn't thought that. The people with so much time to waste and nothing to offer society but a full of shit reddit post",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9q3msv",
                                    "author": "ikkatop",
                                    "score": 2,
                                    "created_utc": 1653337017.0,
                                    "response": "Booze, a nice boat and some company.  Let him live out his days enjoying the finer things.  He's old school,  he'll know what to do.  Try to avoid these \"financial advisors\" or anyone who will be charging a commission for their \"help\" or advice.\nThey just want to get rich off the back of this. \nDon't reply to DM's,  and check out where in the world has the lowest taxation ( or no taxation for this )",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9q0fsj",
                                    "author": "HlIlM",
                                    "score": 1,
                                    "created_utc": 1653335641.0,
                                    "response": "Giving up 20 years of 5% interest means leaving $9million on the table, without compounding or accounting for taxes.  At least buy 10 yr treasuries and take 2.9%.  If you don't, the bank will happily use your money to invest in more speculative things.\n\nAlso if you sell the bitcoin, look into income tax averaging.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9qbhia",
                                            "author": "solomonsatoshi",
                                            "score": 1,
                                            "created_utc": 1653340460.0,
                                            "response": "Bad advice ignoring the fact the OP is talking fantasy.\n\nTreasuries returning 2.9% with inflation at 7% is compound losses destroying most of the value of the 300 BTC.\n\nThe only respectable plan would be to sell small amounts to spend and hodl the rest.\n\nAvoid investment advisors as nearly all of them are fiat debt slavery cucks.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9qgr6y",
                                                    "author": "HlIlM",
                                                    "score": 0,
                                                    "created_utc": 1653342860.0,
                                                    "response": "I feel sorry for your grandparents.  You're the type that would sell their home.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9qhwo4",
                                                            "author": "solomonsatoshi",
                                                            "score": 1,
                                                            "created_utc": 1653343401.0,
                                                            "response": "Lol I am a grandparent you drongo.\n\nNothing in my comment suggests I would do any such such a thing (even if my grandparents were still alive which they are not) - you are instead a blatant gaslighter troll fabricating alternative realities because you cannot refute the actual facts and issues I have raised above.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9qjz4z",
                                                                    "author": "HlIlM",
                                                                    "score": 1,
                                                                    "created_utc": 1653344379.0,
                                                                    "response": "And you're on reddit talking about hodling bitcoin to avoid fiat debt slavery.  You're taking advice from teenagers.\n\nDon't sell your house, go 50/50 VCLT and VNQI",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9qmaxv",
                                                                            "author": "solomonsatoshi",
                                                                            "score": 1,
                                                                            "created_utc": 1653345488.0,
                                                                            "response": "Again you gaslight nonsense and avoid the facts and issues raised.\n\nYou must be a tout for the fiat debt slavery cartels financial advisors.\n\nOr simply a troll.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i9qp25g",
                                                                                    "author": "HlIlM",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653346820.0,
                                                                                    "response": "What facts?  The 10 yr yield?  The CPI numbers?\n\nThe assumption BTC will outperform fixed income over a 20 year retirement is not a fact.  For someone like the ( fictional ) OP, making that assumption would be a foolish mishandling of risk.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i9qt3hi",
                                                                                            "author": "solomonsatoshi",
                                                                                            "score": 1,
                                                                                            "created_utc": 1653348801.0,
                                                                                            "response": "Past performance while not a guarantee is a guide to future probabilities.\n\nBitcoin has been by far the best performing asset in the last decade since its inception while fiat debt slavery cartel based interest bearing instruments have failed to deliver a return above the rate of debasement for many many decades.\n\nWith the emergence of the Chinese led challenge to USD fiat debt slavery cartel hegemony (reverse engineering the monetary banking systemn via Hong Kong and DCEP) only a fucking idiot (eg- registered financial advisor) would put any trust or hope in medium-long term USD denominated 'investments'. That is this grandpas opinion anyway, and is backed by fundamentals, history and current events observable by anyone with their eyes open.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9pw3h7",
                    "author": "WizardMiner",
                    "score": 1,
                    "created_utc": 1653333791.0,
                    "response": "Great grats! That is so sweet!!! Welcome to the moon 🌙",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9pxop1",
                    "author": "Nervous_Appearance14",
                    "score": 1,
                    "created_utc": 1653334471.0,
                    "response": "I would tell him before you do anything tbh",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9pzfiv",
                    "author": "ariN_CS",
                    "score": 1,
                    "created_utc": 1653335213.0,
                    "response": "Tell your dad to send me his bitcoins, I’ll double it for him. (No scam 100%, Financial Advice, FREE Download, No Virus)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9q1dnu",
                    "author": "GaRGa77",
                    "score": 1,
                    "created_utc": 1653336044.0,
                    "response": "Bitch please…",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9q2109",
                    "author": "SkipAndGo",
                    "score": 1,
                    "created_utc": 1653336318.0,
                    "response": "Might want to move them to a safe location just in case he forgets his seeds",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9q6vg7",
                    "author": "johndoeisback",
                    "score": 1,
                    "created_utc": 1653338426.0,
                    "response": "First of all, are you sure he still has access to those bitcoins? If he hasn't paid attention for 11 years then they might well be lost.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9qi533",
                    "author": "Follie87",
                    "score": 1,
                    "created_utc": 1653343509.0,
                    "response": "He bought them from an African prince",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9qlzba",
                    "author": "Busy-Succotash9701",
                    "score": 1,
                    "created_utc": 1653345334.0,
                    "response": "My grandfather bought 400 Bitcoin in the year 2010, but last week he lost them all in a boating accident",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9qsewm",
                    "author": "po00on",
                    "score": 1,
                    "created_utc": 1653348462.0,
                    "response": "plot twist... he blew most of it on silk road... that's why he has no recollection",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9qsiak",
                    "author": "Broad_Bench_3658",
                    "score": 1,
                    "created_utc": 1653348509.0,
                    "response": "A grandson willing to give away 9mill to a grandfather who’s almost dead? Sounds fake",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9qv7ea",
                    "author": "nullama",
                    "score": 1,
                    "created_utc": 1653349847.0,
                    "response": "> How do I tell him\n\nLooks like your grandfather is doing fine, hodling for more than a decade. He of course knows enough about Bitcoin in order to buy, and tell you about it.\n\n> ..., and how do I keep him from getting scammed out of his money if he decides to sell it?\n\nYou found out yesterday and you're thinking of selling his Bitcoin, I hope he keeps his Bitcoin safe.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9pvnuw",
                    "author": "Buggy3D",
                    "score": -2,
                    "created_utc": 1653333612.0,
                    "response": "In 2011, buying and owning Bitcoin was a lot harder. There weren’t many exchanges offering them back then. It was still a very niche thing reserved mostly for tech geeks.\n\nFurthermore, wallets at the time had to be connected and downloaded with all the historical blockchain, which wasn’t that big at the time. \n\nHot wallets that use 3rd party nodes were not really a thing back then. \n\nOn top of that, they were still using the old address format, which is no longer supported by many wallets and exchanges today.\n\nSo even if what you say is true, you would would need to sync the wallet he had, find an exchange that accepts legacy addresses, and then find a way to sell them off gradually without crashing the market (good luck with that given our economic environment)",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9px8kq",
                            "author": "RedditTooAddictive",
                            "score": 3,
                            "created_utc": 1653334281.0,
                            "response": "You can dump 300 BTC in a flash the market won't move at all.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9qalzg",
                                    "author": "satsophone",
                                    "score": 1,
                                    "created_utc": 1653340061.0,
                                    "response": "Y’all arguing about whether 300 moves the market and nobody pulling him up on the suggesting that he sell for dirty fiat. Sell what you need when you need it.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9pxvay",
                                    "author": "Buggy3D",
                                    "score": -4,
                                    "created_utc": 1653334547.0,
                                    "response": "That’s absolutely false. \n\nLook up any exchange’s order book.\nA 300 sudden buy/sell order would trigger a bunch of Stop losses, which would in turn snowball 10-20x that size.\n\nYou could see BTC drop 10-15% in a matter of minutes.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9pzdt5",
                                            "author": "FieserKiller",
                                            "score": 3,
                                            "created_utc": 1653335192.0,
                                            "response": "lol no, selling 300 BTC for USD n Kaken would move btc price by <$175",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i9q0e0f",
                                            "author": "No_Yogurtcloset_2547",
                                            "score": 3,
                                            "created_utc": 1653335620.0,
                                            "response": "Brother you from yesteryear? 300 btc aka $9m give or take wont move the market even 1%.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i9q18zd",
                                            "author": "RedditTooAddictive",
                                            "score": 1,
                                            "created_utc": 1653335990.0,
                                            "response": "Hahahahah",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i9qcsuo",
                                            "author": "MaxSan",
                                            "score": 1,
                                            "created_utc": 1653341050.0,
                                            "response": "No, 300BTC wouldn't even move the needle.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9pwmqn",
                            "author": "The_OG_Jesus_",
                            "score": 1,
                            "created_utc": 1653334020.0,
                            "response": "He wasn't a tech geek but he was a math instructor, so it's not like computers are beyond him. Don't you think you're a bit ageist to assume that a 60-yr-old in 2011 is technologically illiterate?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9pwwld",
                                    "author": "Buggy3D",
                                    "score": 1,
                                    "created_utc": 1653334137.0,
                                    "response": "Let’s start with this… where did he buy them?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9pxhdi",
                                            "author": "The_OG_Jesus_",
                                            "score": 0,
                                            "created_utc": 1653334385.0,
                                            "response": "How should I know?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9pyc2o",
                                                    "author": "Buggy3D",
                                                    "score": 3,
                                                    "created_utc": 1653334745.0,
                                                    "response": "Because at the time (2011), the main exchange used by everyone became Mt. Gox, which abruptly ceased operations and literally disappeared overnight in 2014 after hundreds of bitcoins were stolen off of it. \n\nIf your grandpa didn’t withdraw from the exchange, then these BTCs are probably lost.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9q0inn",
                                                            "author": "No_Yogurtcloset_2547",
                                                            "score": 2,
                                                            "created_utc": 1653335674.0,
                                                            "response": "He probably mined it, like 95% of people back at the time.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9q1xgw",
                                    "author": "wkw3",
                                    "score": 1,
                                    "created_utc": 1653336276.0,
                                    "response": "If he forgot that the Bitcoin even existed, do you think he remembers his password?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9q51g1",
                                            "author": "The_OG_Jesus_",
                                            "score": 0,
                                            "created_utc": 1653337625.0,
                                            "response": "I don't know. He writes down all his passwords for everything and keeps them in a folder in his filing cabinet.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9qbz0q",
                                                    "author": "solomonsatoshi",
                                                    "score": 1,
                                                    "created_utc": 1653340682.0,
                                                    "response": "Nice story but sounds like bullcrap.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "id": "uw7zss",
            "title": "Full Bitcoin Maxi now",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uw7zss/full_bitcoin_maxi_now/",
            "author": "TheRealSlimyrock",
            "created_utc": 1653333540.0,
            "score": 206,
            "num_comments": 66,
            "subreddit": "Bitcoin",
            "selftext": "When I first started in this space, like most I dabbled in the altcoins, very soon I realized that Bitcoin was the only way forward. I unstaked my shitcoin, and this morning it finally let me withdraw my coins. \n\nSold at a 2/3rds loss, and not looking back! This bear market won't be nice to the shitcoins.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9qp3a8",
                    "author": "FinalArt53",
                    "score": 39,
                    "created_utc": 1653346835.0,
                    "response": "Welcome to the next round of massive losses in the crpyto bear market.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9s1rxx",
                            "author": "foamingmouth6",
                            "score": 3,
                            "created_utc": 1653373877.0,
                            "response": "Yes, absolutely.\n\nThe turmoil of a couple of weeks ago was just Round 1 of the big shakeout. Before the end of the year Round 2 will make Round 1 look like a tea party. Thousands of rubbish coins will be wiped out, second-tier altcoins, such as the one we don't mention in this sub, will take big hits, but those hits will be just the start of their long, slow, inexorable decline into oblivion.\n\nThe OP is ahead of the trend: people will increasingly realise that in the crypto space bitcoin is the place to be.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9pw051",
                    "author": "WritingFun8769",
                    "score": 45,
                    "created_utc": 1653333751.0,
                    "response": "good for you for not giving into the sunk cost fallacy; just because you sold “at a loss” doesn’t mean much of anything if you’re putting that money into an investment that you cherish and value.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9qqj6l",
                            "author": "lakimens",
                            "score": 5,
                            "created_utc": 1653347538.0,
                            "response": "\"that you cherish and value\", not one that's gonna bring you more profits?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9qufzw",
                                    "author": "WritingFun8769",
                                    "score": 0,
                                    "created_utc": 1653349471.0,
                                    "response": "a profit has value, but a value isn’t necessarily profit.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9qurcz",
                                            "author": "lakimens",
                                            "score": 2,
                                            "created_utc": 1653349628.0,
                                            "response": "That's exactly what I was referring to as well. A financial investment is meant to be profitable.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9qvji3",
                                                    "author": "WritingFun8769",
                                                    "score": 4,
                                                    "created_utc": 1653350013.0,
                                                    "response": "good values bring about good consequences, but not all of them have money to be made. participating in bitcoin—whether i made millions or lost it all—still has many benefits to me that aren’t primarily financial, or even benefits to others that aren’t a benefit to me at all but i still find worthwhile. it’s a fascinating, singular invention and ongoing experiment; other people have been able to profit from it and use those funds to uplift themselves along with their communities; it creates an economy and exchange that works better, etc. none of those would be a profit to me, but are still benefits. to me, bitcoin is sacred.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9q2wnj",
                    "author": "turick",
                    "score": 4,
                    "created_utc": 1653336702.0,
                    "response": "Welcome to the club! Glad you made the journey!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9qmhwu",
                    "author": "sQtWLgK",
                    "score": 4,
                    "created_utc": 1653345582.0,
                    "response": "Well done! Shitcoins are a waste of time. \n\nWhen somebody (who doesn't care about the ideology or the technology, only the profits) asks me about \"diversifying\" or \"indexing\" I show them reality checks like this one:\nhttps://toptencryptoindexfund.com/tracking-2018-top-10-cryptocurrencies-month-49/\n\nOnly Etherium fared slightly better than Bitcoin, but notice that it did so at twice the monthly volatility, so it had a much worse risk-adjusted return. The other 8 coins are disasters: Cardano had some timid growth in fiat, but not in sats. All the others are lower now than 49 months ago, even though they were top10 coins at that time, and even though they pumped massively last year, bcash, nem, and dash are still -90% down now. 6 are no longer top10, in fact, not even top20.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9qfd0a",
                    "author": "Adamn27",
                    "score": 13,
                    "created_utc": 1653342218.0,
                    "response": "Same here 1 month ago. Bitcoin is THE cryptocurrency.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9s24qj",
                            "author": "xToniGrssx",
                            "score": 2,
                            "created_utc": 1653374174.0,
                            "response": "Jó döntés :) wagmi",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9qtnxl",
                    "author": "j--khan",
                    "score": 3,
                    "created_utc": 1653349082.0,
                    "response": "Same thing for me. Bitcoin has the best chance of surviving. The alt coin scene depends on it too.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9r5srn",
                    "author": "gingernsnxps",
                    "score": 3,
                    "created_utc": 1653355044.0,
                    "response": "Same. Got rugged today. Now I’m bitcoin maxi",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9s5p0w",
                    "author": "BTCMachineElf",
                    "score": 3,
                    "created_utc": 1653377208.0,
                    "response": "Not only is bitcoin the most solid cryptocurrency, it is the only one where it's users are in it for bitcoin gains, not fiat gains. Any time you sell it, you are giving up a valuable asset, not dumping on the greater fool. There is integrity in that.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9q0tkm",
                    "author": "laziruss",
                    "score": 6,
                    "created_utc": 1653335804.0,
                    "response": "I’m on the fence, I’m 99% bitcoin and just thinking of getting out of my one other coin, not necessarily to put into BTC but pay off some debt. Down about 60% on it.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9q1tsx",
                            "author": "bitusher",
                            "score": 10,
                            "created_utc": 1653336234.0,
                            "response": "Personally , I'd rather just focus on Bitcoin but remember that historically in bear markets most altcoins lose 80-99% in value with many never recovering and this bear market will likely continue for 1.5-2 more years thus regardless of whether you want to focus your efforts on Bitcoin alone it makes logical sense to avoid altcoins for at least 1-1.5 years from strategic perspective alone.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9r11re",
                            "author": "bigbrownbanjo",
                            "score": 1,
                            "created_utc": 1653352759.0,
                            "response": "Yeah I’m trying to really do my research and hedge on a couple of other ponies just in case",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9q2vvx",
                    "author": "ndgoLiberty",
                    "score": 8,
                    "created_utc": 1653336692.0,
                    "response": "Congrats. May they all go to zero now that you are free from them.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9qvhl3",
                    "author": "DrewBrew95",
                    "score": 4,
                    "created_utc": 1653349985.0,
                    "response": "Same. The second i learned that 95% of alts do not make it I started transitioning.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9rd7a6",
                    "author": "Vaginosis-Psychosis",
                    "score": 2,
                    "created_utc": 1653358584.0,
                    "response": "Welcome to the club. \n\nI bought Bitcoin and crypto for the first time on June 3rd, 2021. I focused mostly on alt-coins in the first 3-4 months. The more I learned about Bitcoin, the more disillusioned I became with alts. \n\nBy January 2022 I was a full Bitcoin Maxi and haven’t looked back. I also sleep so much better these days.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ry0bi",
                    "author": "Asum_chum",
                    "score": 2,
                    "created_utc": 1653370910.0,
                    "response": "Did you manage to sell them all? I had one ICO that never even launched and and one top ten coin from 2017 that claimed all unmoved coins back and put them into a centralised pot.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9s102m",
                    "author": "nagato1125",
                    "score": 2,
                    "created_utc": 1653373248.0,
                    "response": "all chains lead to bitcoin 🔥",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9s7qun",
                    "author": "ThotDoge69",
                    "score": 2,
                    "created_utc": 1653379075.0,
                    "response": "Bear markets makes Bitcoiners.\n\nBear markets has never been good to alts. \n\nThis is what we understand over the years.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ssdcj",
                    "author": "TheFutureofMoney",
                    "score": 2,
                    "created_utc": 1653395328.0,
                    "response": "This makes you smarter than 99% of sh!tcoiners\n\nWelcome to the right side of history",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9q7enq",
                    "author": "Simple_Yam",
                    "score": 9,
                    "created_utc": 1653338657.0,
                    "response": "You literally bought at the top and sold at the bottom. Well done!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9q923t",
                            "author": "TheRealSlimyrock",
                            "score": 6,
                            "created_utc": 1653339377.0,
                            "response": "I technically bought in the middle, and sold low, but it's not the bottom. It's going to go lower throughout this bear market, like all the alts will.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9qcybj",
                                    "author": "VVaId0",
                                    "score": 14,
                                    "created_utc": 1653341120.0,
                                    "response": "This guy who sold lower than he bought is giving predictions.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9qhhoy",
                                            "author": "TheRealSlimyrock",
                                            "score": 8,
                                            "created_utc": 1653343208.0,
                                            "response": "Let it be said that no one ever wasted my time twice. Like Saifedean says, just call them a fucking moron, and move on w/ life.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i9qr3kw",
                                            "author": "Scarf_Darmanitan",
                                            "score": 2,
                                            "created_utc": 1653347822.0,
                                            "response": "LMAO",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i9sa6gq",
                                            "author": "ApplicationAny1434",
                                            "score": 1,
                                            "created_utc": 1653381345.0,
                                            "response": "Yea look it going down. Sell now buy lower. Trust me that cant be the bottom else I will be looking like an idiot.\n\nSo many selling at a loss, we must be near the bottom.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9q7p57",
                            "author": "OrangeHODLr",
                            "score": -1,
                            "created_utc": 1653338785.0,
                            "response": "One of us?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9qo0ky",
                    "author": "alxjnssn",
                    "score": 3,
                    "created_utc": 1653346312.0,
                    "response": "what took you so long",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9r5seh",
                            "author": "TheRealSlimyrock",
                            "score": 2,
                            "created_utc": 1653355039.0,
                            "response": "Staking was unlocking. Had to wait 94 long days.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9rft2r",
                                    "author": "alxjnssn",
                                    "score": 5,
                                    "created_utc": 1653359867.0,
                                    "response": "i was just kidding around m8; welcome to the club",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9pzdhx",
                    "author": "Inevitable_River_509",
                    "score": 3,
                    "created_utc": 1653335189.0,
                    "response": "Congrats I did the same thing. I came to realize that Shitcoins are called like that for a reason and converted everything to bitcoin. I can assure you will not regret it.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9qq5nb",
                            "author": "feyyd",
                            "score": 3,
                            "created_utc": 1653347352.0,
                            "response": "I feel like if you are selling off everything expecting the bear, cash might have been better.  However, if you have no exposure to BTC, I suppose I could see trading now, nobody knows WHEN we'll go back towards ATH",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9qc9sl",
                    "author": "Longjumping-Basket62",
                    "score": 2,
                    "created_utc": 1653340815.0,
                    "response": "So not for conviction, but because being a BTC maxi is your only option now. Not a bad move though.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9r1d2f",
                    "author": "SphereSnakes",
                    "score": 3,
                    "created_utc": 1653352907.0,
                    "response": "🚬 you’ll be back",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9qfce2",
                    "author": "Jetjones",
                    "score": 1,
                    "created_utc": 1653342210.0,
                    "response": "Meh. I’d rather keep my alts and see where it goes than to sell. But for sure, I’m only buying bitcoin in the future.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9s87ni",
                            "author": "Hughski",
                            "score": 1,
                            "created_utc": 1653379495.0,
                            "response": "U know they’re going to the moon!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9s97ux",
                    "author": "Lucycv",
                    "score": 0,
                    "created_utc": 1653380433.0,
                    "response": " I think it is just a mentality for old investors, perhaps to direct the adoption to bitcoin , but I do not see a good impression in the system of the blockchain  Other currencies also have strong and good solutions for the system as well.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9scvyu",
                    "author": "Etovia",
                    "score": 0,
                    "created_utc": 1653383903.0,
                    "response": "All ALTs are scams, because entire concept of building money on trust instead of PoW is a scam.\n\nOnly Bitcoin really does PoW with own dedicated hardware (if you omit the < 1% forkcoins, which are completely broken due to being a minority in same PoW function)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9qwko7",
                    "author": "big_fetus_",
                    "score": -1,
                    "created_utc": 1653350522.0,
                    "response": "i mean, bitcoin is #1 for a reason. ethereum is shit, but other smart contract protocols do have a place, not going to reccomend any because we dont know which except eth has no scalability and moving to POS is quite risky for an ecosystem that large, but for rn, btc is all.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9qx0ze",
                            "author": "big_fetus_",
                            "score": 2,
                            "created_utc": 1653350744.0,
                            "response": "I could have phrased this better, lol, hope it makes sense.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9qn362",
                    "author": "gingeropolous",
                    "score": 1,
                    "created_utc": 1653345864.0,
                    "response": "You're on your journey",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9r161p",
                    "author": "Scrapin-Nee",
                    "score": 1,
                    "created_utc": 1653352816.0,
                    "response": "Congrats welcome to the crew. According to the latest Bitcoin Audible you are very intelligent and don’t trust the government.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9r2gdn",
                    "author": "OrangeCoinOnly",
                    "score": 1,
                    "created_utc": 1653353432.0,
                    "response": "Welcome :)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9rxuzk",
                    "author": "kaicoder",
                    "score": 1,
                    "created_utc": 1653370803.0,
                    "response": "Eventually we all head to bitcoin.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9s0hv6",
                    "author": "rocketeer8015",
                    "score": 1,
                    "created_utc": 1653372844.0,
                    "response": "You might have sold a shitcoin at a loss, but you also bought bitcoin at a discount. So nothing really lost. Or well, not much.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9t08p9",
                    "author": "BlueBirdDolphin",
                    "score": 1,
                    "created_utc": 1653399432.0,
                    "response": "It's time for a good cleaning. A Bitcoin at 20-24k can be a good thing for the market",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9tedib",
                    "author": "EmilyLovs",
                    "score": 1,
                    "created_utc": 1653405667.0,
                    "response": "Care to do a meta-analysis on first moves in any disruptive tech mate? \n\nHistory is dead against you maxi.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9req3m",
                    "author": "ProphetOfDoom337",
                    "score": -3,
                    "created_utc": 1653359327.0,
                    "response": "This fucking sub, man.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9rkt4r",
                    "author": "Ernest-Everhard42",
                    "score": -1,
                    "created_utc": 1653362454.0,
                    "response": "Same post everyday on this sub. Com on’ guys.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}