{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uvtn4z",
            "title": "El Salvado",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uvtn4z/el_salvado/",
            "author": "Serism_",
            "created_utc": 1653286015.0,
            "score": 2,
            "num_comments": 0,
            "subreddit": "Bitcoin",
            "selftext": "El Salvador is Bitcoin country\n\n&#x200B;\n\nhttps://preview.redd.it/d69p6b6m26191.jpg?width=1200&format=pjpg&auto=webp&s=158d4035171c45ccec37ccea536deef4b1c7abbe",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uvtpy6",
            "title": "Mentor Monday, May 23, 2022: Ask all your bitcoin questions!",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uvtpy6/mentor_monday_may_23_2022_ask_all_your_bitcoin/",
            "author": "rBitcoinMod",
            "created_utc": 1653286352.0,
            "score": 18,
            "num_comments": 64,
            "subreddit": "Bitcoin",
            "selftext": "Ask (and answer!) away! Here are the general rules:\r\n\r\n* If you'd like to learn something, ask.\r\n* If you'd like to share knowledge, answer.\r\n* Any question about Bitcoin is fair game.\r\n\r\nAnd don't forget to check out /r/BitcoinBeginners\r\n\r\nYou can sort by new to see the latest questions that may not be answered yet.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9rdxb4",
                    "author": "Blastosist",
                    "score": 2,
                    "created_utc": 1653358932.0,
                    "response": "Why hasn’t Bitcoin been a hedge against inflation?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9rgng2",
                            "author": "Any_Satisfaction1077",
                            "score": 3,
                            "created_utc": 1653360293.0,
                            "response": "The current inflation is caused by the lack in supply and labor, bitcoin doesn’t really help this and is not as favorable as other investments like commodities during this time. This is apposed to inflation being driven by devaluation of the dollar where others would chose Btc if the $ were to collapse.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9rpalq",
                                    "author": "No_Presentation7587",
                                    "score": 0,
                                    "created_utc": 1653365044.0,
                                    "response": "So you don’t think the fact they they keep printing more and more has anything to do with it?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9ue9sp",
                                            "author": "Any_Satisfaction1077",
                                            "score": 1,
                                            "created_utc": 1653420536.0,
                                            "response": "If the inflation was due only to a huge supply increase in dollars and nothing else than the dxy wouldn’t be at a 20 year high and would not have rallied 15% in a year.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9vnaod",
                            "author": "bitcoin_barry",
                            "score": 1,
                            "created_utc": 1653440718.0,
                            "response": "It will be. Prices of things go up during inflationary times, they never go back down.\n\nIn terms of Bitcoin, prices went up too... but they will come back down.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9rsov5",
                            "author": "jessie268",
                            "score": 0,
                            "created_utc": 1653367160.0,
                            "response": "too single",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9rutc9",
                            "author": "TheSqueakSquad",
                            "score": 0,
                            "created_utc": 1653368594.0,
                            "response": "The easy money environment created by central banks feeds into the bitcoin price too. When money is too cheap people seek riskier and riskier investments to beat the baseline rate of inflation, and for many people bitcoin is just another crazy risky investment. So the price gets bid up. These buyers wash away as soon as central banks tighten policy or if the general economy turns for the worse. Both of these are happening right now, so bitcoin sells off.\n\nThis is your stacking opportunity.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9nlidj",
                    "author": "JBV3737",
                    "score": 1,
                    "created_utc": 1653287110.0,
                    "response": "How low does the price of btc in usd have to be before miners stop mining and btc no longer can function as a currency?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9nr2qk",
                            "author": "TheGreatMuffin",
                            "score": 4,
                            "created_utc": 1653291824.0,
                            "response": "If miners drop out, the difficulty of mining algorithmically lowers as well, making it easier to mine bitcoin, which in turn attracts more miners. Price is indeed a variable here (because most miners are mining for profit, meaning they want to sell bitcoin for a higher price than their production costs are), but not the only one.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9ns1kx",
                            "author": "SomeBrokeChump",
                            "score": 2,
                            "created_utc": 1653292732.0,
                            "response": "The bitcoin mining difficulty automatically adjusts every 2016 blocks which is approximately every two weeks. The mining difficulty automatically increases or decreases after 2016 blocks depending on the time between the previous 2016 blocks. If the time between those blocks averages out to less than ten minutes, then the mining difficulty will increase and miners will become less profitable. If the time between those blocks averages out to more than ten minutes, then the mining difficulty will decrease and miners will become more profitable.\n\nSo if some bitcoin miners stop mining bitcoin because it's unprofitable for them, the difficulty decreases and it becomes more profitable to mine bitcoin.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9od811",
                            "author": "igadjeed",
                            "score": 1,
                            "created_utc": 1653309442.0,
                            "response": "This question is asked frequently. It relies on a false assumption - that all miners quit when profitability falls. In practice, some miners quit, and then the rewards are distributed among fewer miners, which boosts the profits for the remaining miners. The appears to have begun. The next mining difficulty adjustment is negative, an indicator that some miners have recently quit",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9qz99w",
                            "author": "Crawlero",
                            "score": 1,
                            "created_utc": 1653351876.0,
                            "response": "Good comments so far on this one, additionally for any given mining operation they are using multiple generations of miners, newer hardware is more efficient so it stays online deeper into prices dropping or electricity cost going up.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9o67i6",
                    "author": "MaikisamStartlol",
                    "score": 1,
                    "created_utc": 1653305008.0,
                    "response": "What's about the centralisation of mining pools? Isn't that at least a theoretical threat to the Bitcoin Network? Are decentralised mining pools like Braidpool a thing?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9o6sep",
                            "author": "TheGreatMuffin",
                            "score": 3,
                            "created_utc": 1653305415.0,
                            "response": "> Isn't that at least a theoretical threat to the Bitcoin Network?  \n\nOf course! In practice, it probably has somewhat a low probability of happening (because it's not *that* easy to pull off and the incentives are not aligned), read more here: https://blog.lopp.net/are-chinese-miners-threat-bitcoin/ - it speaks about mining centralization in China (which is not a thing anymore), but there are some points being made about 51% attacks in general.  \n\n> Are decentralised mining pools like Braidpool a thing?  \n\nUnfortunately, it doesn't seem to be utilized on a larger scale. i assume it's because there are trade offs with a decentralized pool, but I am not sure which.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9o8mvn",
                                    "author": "MaikisamStartlol",
                                    "score": 1,
                                    "created_utc": 1653306635.0,
                                    "response": "So there isn't a real solution for this threat yet?\nAs far as I know, Braidpool seems to be quite new. Maybe this might be a game changer in the future",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9o967g",
                                            "author": "TheGreatMuffin",
                                            "score": 2,
                                            "created_utc": 1653306987.0,
                                            "response": "> So there isn't a real solution for this threat yet?\n\nSolutions for what specifically? 51% attack scenarios in general won't ever be ruled out in theory, you cannot really solve that, it's inherent in how bitcoin works. Mining pool operators misbehaving is kinda disincentivized by economical realities and \"solved\" on a social layer: miners simply will leave the pool if the operator misbehaves.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i9r2k9m",
                                            "author": "Crawlero",
                                            "score": 1,
                                            "created_utc": 1653353483.0,
                                            "response": "CTV, if implemented, allegedly brings support for decentralized mining pools",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9rwyko",
                                                    "author": "MaikisamStartlol",
                                                    "score": 1,
                                                    "created_utc": 1653370132.0,
                                                    "response": "What's CTV?😅",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9ocr4w",
                            "author": "igadjeed",
                            "score": 2,
                            "created_utc": 1653309173.0,
                            "response": "Most pools are likely to implement Stratum V2, a miner-to-pool communications specification which improves on its predecessor  \n\nOne of the improvements is the option for the miner to choose his own transactions when building a block. Removing transaction selection from the pool's role prevents centralization. The pool's role reverts to the original intention - fair distribution of rewards  \n\nThat's the good news  \n\nThe bad news is that it's optional, and that most miners rely on pools supplying all the transactions for a candidate block because the pool has a node and the miner does not have a node  \n\nAlso, since 2016, the pools (all but one) have developed a technique for building the transaction set for the next two blocks in advance. This enables miners to work on full blocks with every hash. The pool which isn't participating in this technique is known to mine empty blocks  \n\nIf miners are selecting their own transactions, will they be able to use this \"current, plus 2\" technique to have their blocks ready without delay?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9rt4ak",
                                    "author": "jessie268",
                                    "score": 0,
                                    "created_utc": 1653367440.0,
                                    "response": "With the development of the times, the market is rising, and it is impossible to retreat.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9pcbs4",
                    "author": "thats_just_right",
                    "score": 1,
                    "created_utc": 1653325383.0,
                    "response": "I watched a video by YouTuber Rhett (Level up your brain) who showed how to automate purchases on Gemini using AWS. But it requires putting your private key into the code. Do true bitcoin believers do that? It seems risky, but maybe I'm missing something. I keep a cold storage wallet that never connects my keys to the internet.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9pfrez",
                            "author": "senfmeister",
                            "score": 1,
                            "created_utc": 1653326828.0,
                            "response": "Are you sure it was the private key, and not the xpub? I don't know why you would need to put your private key into something that just buys bitcoin. \n\nAlso, DCA automation in Strike is awesome.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9pg97i",
                                    "author": "thats_just_right",
                                    "score": 1,
                                    "created_utc": 1653327034.0,
                                    "response": "Not sure. I'll look into it closer, but he said \"~~public~~ key.\" (edit: I meant \"private\")\n\nAnd I started using Strike last week. I like it but the fee (aka spread) is a bit higher than Gemini, from what I've heard.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9ph6p9",
                                            "author": "senfmeister",
                                            "score": 1,
                                            "created_utc": 1653327430.0,
                                            "response": "Public key is fine, you can't have someone steal your coins if the get that, just steal your privacy and see that all of your addresses/UTXOs are owned by you.\n\nI've never seen a noticeable difference between Strike and Gemini Active Trader personally. Strike wants to make money as a payment processing provider for merchants and sell bitcoin as close to free as possible for users.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9pxo9x",
                                                    "author": "thats_just_right",
                                                    "score": 1,
                                                    "created_utc": 1653334466.0,
                                                    "response": "Sorry. I meant \"private\"",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9pxulp",
                                                            "author": "senfmeister",
                                                            "score": 1,
                                                            "created_utc": 1653334539.0,
                                                            "response": "He's doing something dumb and unnecessary then if he's only buying.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9qhu7j",
                            "author": "sciencetaco",
                            "score": 1,
                            "created_utc": 1653343368.0,
                            "response": "There is no need for any bitcoin private keys. \n\nYou would need two keys:\n\n1) Your bitcoin wallet’s *extended public key* or an individual address. To automate withdrawals to your wallet. \n\n2) Your personal Gemini API key, so you can interact with Gemini to automate actions such as trading and withdrawals.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9rt36z",
                                    "author": "jessie268",
                                    "score": 1,
                                    "created_utc": 1653367420.0,
                                    "response": "With the development of the times, the market is rising, and it is impossible to retreat.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9pyxiu",
                    "author": "vunzi",
                    "score": 1,
                    "created_utc": 1653335000.0,
                    "response": "A common (?) advice is to just accumulate Bitcoin (known as \"stack sats\"). \n\nWhat purpose does a currency serve if it is not used?\n\nIs this \"strategy\" ultimately leading to Bitcoin being perceived only as a store of value but not as a medium for exchange of goods / services / etc.?\n\nHow long is the accumulation supposed to last? If the target is \"0% supply\" - this event will happen in about 118 years and there is a very high chance that no currently living human being is going to enjoy this moment.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9q47lg",
                            "author": "SleepCom",
                            "score": 3,
                            "created_utc": 1653337264.0,
                            "response": "People have been arguing *what* bitcoin is ever since it was invented. Store of value? Asset? Security? Commodity? Currency? The problem is, nothing like bitcoin has EVER been invented before. There is no definition for what bitcoin is right now. Governments all see it differently (and tax it however they think it fits). It's like when bittorrent was invented... no one was really quite sure how to explain it (or how to sue the people pirating with it).\n\nMichael Saylor believes bitcoin is best designed and used as an asset class. He sees it as a store of value (simply storing value until it is necessary later). In many ways, he compares this to storing energy.\n\nSome people think it's a currency. Roger Ver, Craig Wright, etc. were all pushing for this idea when they shilled during the block size wars. \n\nCurrently in the US it is being treated as a commodity, and taxed as capital gains. In other countries it is treated as a currency. If you ask someone like Andreas Antonopoulos and the like, you'll see that bitcoin is evolving into a currency. If you follow the ancient history of money, you can see how money begins first as a collectible (sea shells) then turns into a store of value, then eventually ends up as a currency. Each stage of the evolution of money has certain requirements that must be met. Fungibility, durability, ease of transport, etc. So far, bitcoin has not only passed all these tests, but has excelled at them.\n\nThe question really is, how are YOU going to use bitcoin? Never in the history of this planet have we had the ability to take our energy, and use it to vote in a voluntary system, on a global scale, completely decentralized. Every day people are using bitcoin to establish a new value scale that EVERYTHING else in the world will be eventually valued in. Whether you want to call that a currency, or an asset, or \"virtual real estate\", doesn't matter because the value is what is being measured and compared. Bitcoin is the ruler that all other global hatch marks will have to find their place on.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9r5dks",
                                    "author": "Crawlero",
                                    "score": 2,
                                    "created_utc": 1653354838.0,
                                    "response": "I wish saylor would elaborate on what he means by energy.  To the best of my knowledge he means an economic energy, as in the ability to do work, allocating money to a project is akin to exerting a force.  Having more money means you can perform more work etc.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9rk2q2",
                                            "author": "SleepCom",
                                            "score": 1,
                                            "created_utc": 1653362057.0,
                                            "response": "Exactly. Storing the output (profits) of economic energy (work). \n\nThe history of money folks have a much better explanation and I think it might be where Saylor got the idea from.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9rt2q6",
                                                    "author": "jessie268",
                                                    "score": 1,
                                                    "created_utc": 1653367411.0,
                                                    "response": "With the development of the times, the market is rising, and it is impossible to retreat.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9rt269",
                                    "author": "jessie268",
                                    "score": 1,
                                    "created_utc": 1653367401.0,
                                    "response": "With the development of the times, the market is rising, and it is impossible to retreat.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9qbu50",
                            "author": "Zidanakamoto",
                            "score": 1,
                            "created_utc": 1653340621.0,
                            "response": "Before anything can be a currency it has to have a high adoption rate. You cant use something as a currency until you are confident the places you shop will accept your currency. BTC will only be used as currency if it is widespread enough that everyone accepts it, so an intermediate step between no one using and everyone using is required. This is where we are now. The intermediate step is BTC as a new asset class and store of value/flight to safety.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9qhg8k",
                            "author": "sciencetaco",
                            "score": 1,
                            "created_utc": 1653343189.0,
                            "response": "The best thing you can do is spend it where available. And then replace what you spent with more. \n\nPeople are stacking as an investment. They believe the price will continue to rise long term as adoption increases.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9s0byd",
                            "author": "igadjeed",
                            "score": 1,
                            "created_utc": 1653372708.0,
                            "response": "> What purpose does a currency serve if it is not used?\n\nIrrational price speculation",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9qekg6",
                    "author": "TristinMaysisHot",
                    "score": 1,
                    "created_utc": 1653341857.0,
                    "response": "is buying bitcoins still a huge pain in the ass? Paying for things with Paypal these days is a huge pain in the ass. Since they blocked the ability to send money to people via a visa gift card.\n\nDo you still have to pay huge mark ups for bitcoins with out providing your ID?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9qsbxm",
                            "author": "OffThread",
                            "score": 1,
                            "created_utc": 1653348419.0,
                            "response": "Not really too hard, but you may need to buy another coin and then trade to bitcoin to go without IDs. \n\nTake a look into [Decentralized Exchanges](https://coinmarketcap.com/rankings/exchanges/dex/), these type are more attune to your views. \n\nFees are a thing still, usually below 1% now a days though.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9rpiho",
                            "author": "No_Presentation7587",
                            "score": 1,
                            "created_utc": 1653365173.0,
                            "response": "Strike app it’s probably the best way to buy it. You pay pennies in fees. The downside is the very low amount they let you buy per week.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9qqq4s",
                    "author": "Round-Able",
                    "score": 1,
                    "created_utc": 1653347636.0,
                    "response": "On bitcoin wallets after being verified can I send my Bitcoin right away without waiting on a hold or anything ?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9qrb8i",
                            "author": "TheGreatMuffin",
                            "score": 2,
                            "created_utc": 1653347927.0,
                            "response": "Bitcoin wallets don't have \"verification\", do you maybe mean an account on an exchange, or some other platform? If so, you have to ask them. If you mean something else, you should clarify what you are referring to.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9qrnze",
                                    "author": "Round-Able",
                                    "score": 1,
                                    "created_utc": 1653348095.0,
                                    "response": "I want to make sure once I load the money (being a new account user) it will let me send it to someone right away.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9qsf87",
                                            "author": "OffThread",
                                            "score": 1,
                                            "created_utc": 1653348466.0,
                                            "response": "Once you have bitcoin in your wallet you can send them from your wallet.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i9r4i23",
                                            "author": "sciencetaco",
                                            "score": 1,
                                            "created_utc": 1653354412.0,
                                            "response": "It depends where you are buying the bitcoin. Some exchanges place hold on withdrawls for anti-fraud reasons. You'd have to check with the specific exchange you use to see what their policy is. This has nothing to do with the bitcoin network, but due to the way banks handle transfer and deposits.\n\nIt's important to understand that a wallet and exchange are not the same thing. Bitcoin wallets are just apps that handle bitcoin transactions and they place no restrictions on anything. Until you've withdrawn to your own wallet, you dont have control over the bitcoin....it's just an IOU in a company's database.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9rt6eo",
                                                    "author": "jessie268",
                                                    "score": 0,
                                                    "created_utc": 1653367479.0,
                                                    "response": "With the development of the times, the market is rising, and it is impossible to retreat.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9rpqi2",
                    "author": "No_Presentation7587",
                    "score": 1,
                    "created_utc": 1653365308.0,
                    "response": "Why do people complain about bitcoin transaction speed being slow. Can’t people just convert the amount they plan on using into something like a stable coin?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9rpumu",
                            "author": "HurricaneHarvey7",
                            "score": 1,
                            "created_utc": 1653365378.0,
                            "response": "Bitcoin actually settles faster than the legacy system. Takes days for baking systems to settle",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9rq9xg",
                                    "author": "No_Presentation7587",
                                    "score": 1,
                                    "created_utc": 1653365642.0,
                                    "response": "That’s true, when I deposit usd and convert it to BTC on Coinbase it takes 4-7 days before I can withdraw.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9rsmbf",
                                            "author": "jessie268",
                                            "score": 1,
                                            "created_utc": 1653367113.0,
                                            "response": "it's too slow",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9vn09j",
                            "author": "bitcoin_barry",
                            "score": 1,
                            "created_utc": 1653440583.0,
                            "response": "They are spoiled by Visa and Mastercard, and don't realise that they are not getting \"settlement\" in realtime.\n\nThey are mostly unaffected by this fact, and feel like when they make a payment, it happened immediately.\n\nBitcoiners don't settle until a transaction is CONFIRMED, which can take 10 minutes, or a whole hour, or a week, depending on factors.\n\nA user could just not give a shit like they do with Visa and Mastercard, but we have our standards, and they don't want to have lower than our publicly stated standards, so instead they compare SETTLEMENT, to NOT-SETTLEMENT and think: oh, Bitcoin is slower.\n\nIt turns out, we created Lightning which is as fast as Visa, but still SETTLES!. So it infinitely better than Visa.\n\nGo figure.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9p8cr8",
                    "author": "anon20192019",
                    "score": 0,
                    "created_utc": 1653323732.0,
                    "response": "Serious: do you believe Bitcoin will go further down in the next 6 month? If yes, why? If no, why Not? Thank you!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9plx8f",
                            "author": "Slaaavo",
                            "score": 1,
                            "created_utc": 1653329429.0,
                            "response": "It might. I think it will go below 25k €. Various analytical charts show this to be a reasonable possibility.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9pwpn7",
                            "author": "WikiRando",
                            "score": 1,
                            "created_utc": 1653334053.0,
                            "response": "It's definitely possible but I don't think so. It could drop 80% from the all time high to around 14k and I still wouldn't bat an eyelid at all. However it's correlated to the stock market and signs are pointing to a stock market recovery",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9qxr7k",
                                    "author": "Crawlero",
                                    "score": 1,
                                    "created_utc": 1653351113.0,
                                    "response": "I'd swear we are headed into a recession but that's my bias, what indicators are you looking at?",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9rt4wb",
                                    "author": "jessie268",
                                    "score": 1,
                                    "created_utc": 1653367452.0,
                                    "response": "With the development of the times, the market is rising, and it is impossible to retreat.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9rt6zg",
                    "author": "jessie268",
                    "score": 0,
                    "created_utc": 1653367490.0,
                    "response": "With the development of the times, the market is rising, and it is impossible to retreat.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}