{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uyojo9",
            "title": "Bitcoin in El Salvador - Part 2 with Nayib Bukele — What Bitcoin Did",
            "url": "https://overcast.fm/+LCsERdcWM",
            "author": "ESG_girl",
            "created_utc": 1653620576.0,
            "score": 10,
            "num_comments": 7,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "ia5djvo",
                    "author": "ESG_girl",
                    "score": 6,
                    "created_utc": 1653620603.0,
                    "response": "“I don’t think it’s going to work, I’m sure it’s going to work. Because the fundamentals are there. We can have some bumps in the road like everything… but, the fundamentals are the same. And it’s going to work because the philosophy of it is right. Just give it time. It’s going to work for El Salvador, it’s going to work for Bitcoin, it’s going to work for the world.”\n— Nayib Bukele",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia5ebyx",
                    "author": "ESG_girl",
                    "score": 7,
                    "created_utc": 1653621011.0,
                    "response": "Reassuring to hear Bukele speak so confidently and calmly about the project and timeline of the roll-out within the country. He sounds very logical and thoughtful. Peter asked hard questions, but let him off easy by not asking any questions about the bitcoin bond.\n\nHope some of you listen to the pod. I find Bukele and El Salvador very brave and deserving of our support as they stand up to the incumbent world powers.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaaz4vo",
                            "author": "Gaditonecy",
                            "score": 1,
                            "created_utc": 1653739596.0,
                            "response": "The bond wasn't really an idea during the filming of the interview.\n\nI agree, on subsequent interviews, it should be a topic.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia8qx9w",
                    "author": "ComeOnThunder",
                    "score": 1,
                    "created_utc": 1653687367.0,
                    "response": "When was it  recorded though? It seemed to be 3 months on, which would put it around December?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia9i8dq",
                            "author": "ESG_girl",
                            "score": 1,
                            "created_utc": 1653701286.0,
                            "response": "It was recorded May 25th 2022. I think some confusion comes from the fact that Chivo wallet was rolled out to the public last fall, but businesses are just now being “required” to accept Bitcoin in the coming weeks. \n\nBukele said that they had to write the law that way to get the big corporations like McDonald’s and Walmart to go comply and accept Bitcoin. Also interesting to hear that there are 70 Walmarts in El Salvador.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iaaz24a",
                                    "author": "Gaditonecy",
                                    "score": 1,
                                    "created_utc": 1653739545.0,
                                    "response": "I think it was recorded around September 2021.\n\nIn the interview the President says he's been President for 2 years and 3 months.  He assumed the presidency in June 2019, placing the interview sometime around September 2021.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "iaaz5kp",
                            "author": "Gaditonecy",
                            "score": 1,
                            "created_utc": 1653739609.0,
                            "response": "I think it was recorded around September 2021.\n\nIn the interview the President says he's been President for 2 years and 3 months.  He assumed the presidency in June 2019, placing the interview sometime around September 2021.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}