{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "t5gs2h",
            "title": "If Reddit existed in 1995 the modern day r/buttcoin sub would be comparable to a sub called r/internot, a place for people who hate the internet and are certain it's a scam and will disappear eventually.",
            "url": "https://www.reddit.com/r/Bitcoin/comments/t5gs2h/if_reddit_existed_in_1995_the_modern_day/",
            "author": "Acceptable-Risks",
            "created_utc": 1646274276.0,
            "score": 257,
            "num_comments": 82,
            "subreddit": "Bitcoin",
            "selftext": "Every life changing innovation in history has had a group of ignorant people who adamantly hate it, and ironic become dependent on it later.",
            "stickied": false,
            "comments": [
                {
                    "id": "hz4red3",
                    "author": "UranusisGolden",
                    "score": 33,
                    "created_utc": 1646274545.0,
                    "response": "Buttcoin is only fun once so you can go. Read alternate reality crap and wonder how people can live under a rock. You will find that your brain loses iq points the more you try to make sense out of their silly arguments and you try to run away but by then they have banned you anyway lmao.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hz4sjra",
                            "author": "Acceptable-Risks",
                            "score": 17,
                            "created_utc": 1646275095.0,
                            "response": "I feel like it's probably full of people who bought high and sold low and played casino to a losing end.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hz6ccfj",
                                    "author": "lupeng1700",
                                    "score": 10,
                                    "created_utc": 1646311264.0,
                                    "response": "It's definitely the people who knew bitcoin early on but missed on the opportunity.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "hz4ssa7",
                                    "author": "UranusisGolden",
                                    "score": 7,
                                    "created_utc": 1646275209.0,
                                    "response": "It s worse. I asked them what they invest in. They say you should invest in index funds gold and a lot of crappy investment advice. My opinion is they are simply grumpy boomers upset that their portfolios will never grow like crypto.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hz5lcav",
                                            "author": "insomniaccapricorn",
                                            "score": 20,
                                            "created_utc": 1646291205.0,
                                            "response": "What's wrong with Index Funds? Don't get me wrong, I love Bitcoin. But not everyone is accustomed with the volatility of Bitcoin. Index funds are an easy way for a know nothing newbie to start investing.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "hz5ynxj",
                                            "author": "Bitcoin__Hodler",
                                            "score": 9,
                                            "created_utc": 1646301438.0,
                                            "response": "> They say you should invest in index funds & gold\n\nThat is actually a good advice.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "hz4z60a",
                                    "author": "christofascistslayer",
                                    "score": 3,
                                    "created_utc": 1646278305.0,
                                    "response": "It's filled with your typical know-it-all hipster who vaguely remembers hearing about Warren Buffet and conservative boglehead investment strategies.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hz5lxg1",
                                            "author": "TroutFishingInCanada",
                                            "score": 9,
                                            "created_utc": 1646291615.0,
                                            "response": "Buddy, typical know-it-all hipsters love cryptocurrency.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "hz5k42d",
                            "author": "NoJster",
                            "score": 4,
                            "created_utc": 1646290350.0,
                            "response": "It is Mark Twain who said: “Don’t argue with stupid people. They will drag you down to their level and then beat you with experience”, so better not trying in the first place (:",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hz4tfod",
                    "author": "tinyLEDs",
                    "score": 18,
                    "created_utc": 1646275520.0,
                    "response": "Oh, let them have their fun.  Do you NEED everyone to agree with you?  Is that compulsory?\n\nMore btc for us.\n\nLet it go, or it will drag you.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hz5ckzg",
                    "author": "bobbyv137",
                    "score": 8,
                    "created_utc": 1646285557.0,
                    "response": "We live in a world where people genuinely believe the earth is flat, and evolution isn’t real. \n\nLet them be. Some people are just too far gone.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hz4tu6n",
                    "author": "djcrow511",
                    "score": 12,
                    "created_utc": 1646275718.0,
                    "response": "I got banned for life for trying to speak reason on that sub. I haven’t experienced hate like that since grade school.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hz4u09f",
                            "author": "Acceptable-Risks",
                            "score": 4,
                            "created_utc": 1646275797.0,
                            "response": "The stupid hate truth with a vengeance. They've been knkwn to kill people many times throughout history for attempting to enlighten and help them.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hz5e47i",
                    "author": "FrankitoPapito",
                    "score": 3,
                    "created_utc": 1646286479.0,
                    "response": "I agree, but they represent what you’ll hear on the majority of trad-fi subs, even in other languages. \n\nI can’t tell you how many times I stumbled upon people like that on those subs, always tried to listen to what they had to say but Jesus Christ, it’s always the same surface level nonsense that only goes to show how uneducated and non-capable of critical thinking they are. Impossible to take them seriously. \n\nIt’s like having someone desperately arguing that ‘2+2=5’, you could try and explain them the basis of math in a long wall of text, but it’s clear you’re talking to someone who’s never done basics maths in his fucking life and yet wants to argue about it. Why waste time. Simply suggest enrolling in primary school.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hz51vsd",
                    "author": "Days_of_Static",
                    "score": 6,
                    "created_utc": 1646279665.0,
                    "response": "My profit margin doesn’t care that a bunch of crabby haters made a sub to hate on cryptocurrency, so I don’t care either.\n\nI don’t know how anyone that follows bitcoin news right now can deny the use case, though.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hz52rka",
                            "author": "Acceptable-Risks",
                            "score": 5,
                            "created_utc": 1646280118.0,
                            "response": "Of course right now they're running with the \"bad guys use it to escape sanctions- russia\" FUD.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hz55zzl",
                                    "author": "Days_of_Static",
                                    "score": 4,
                                    "created_utc": 1646281835.0,
                                    "response": "As if the fiat US dollar isn’t stained by 1000x more blood?\n\nThe store of value proposition is solid for BTC. I’m not surprised that criminals and drug dealers have used it,  but that doesn’t keep it from being an intelligent way to cut out middlemen money handlers and allow me to transfer value to any wallet holder on earth at my discretion.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "hz5aoqx",
                            "author": "noipv4",
                            "score": 4,
                            "created_utc": 1646284443.0,
                            "response": "truly haters: https://old.reddit.com/r/Buttcoin/comments/t5fxyl/report_btcrub_traders_who_are_violating_sanctions/",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hz5da6w",
                                    "author": "FrankitoPapito",
                                    "score": 6,
                                    "created_utc": 1646285974.0,
                                    "response": "Imagine being angry that people (normal people, living like you me and those guys) are trying to find ways to preserve what little they have and maybe run from a dictatorship that’s going down fast. \nImagine being such a piece of shit, pro institutions and against the people to the very bone. \n\nTruly the cancer of modern society.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hz57cz6",
                    "author": "JustAlexJames03",
                    "score": 5,
                    "created_utc": 1646282571.0,
                    "response": "They banned me when I laughed at them.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hz61acc",
                    "author": "smearballs",
                    "score": 4,
                    "created_utc": 1646303559.0,
                    "response": "There was lots of absurdity in the dot com bubble which ended badly, and there is lots of absurdity now in crypto. I'm a fan of crypto and I'm in it for the long haul but there's too much of this weird tribalism. You can be engaged in crypto, defi, nfts etc. and be critical of their many shortcomings. I get info and entertainment out of contrary subs as well as the blindingly pro subs. I wish people had a more reasonable outlook. I like that we have winter in Canada but it's also cold and it can suck come March. If you are wayyy too in to winter and tweet about how awesome winter is 34 times a day and unfollow anyone who doesn't love winter, I'd say you are a bit fucked. If you hate winter so much that you make weekly anti winter YouTube videos and a subreddit called fuck winter where you mod the shit out of pro winter posts, you are also fucked. In both cases, your friends would likely step in and say what's up with the winter shit dude, are you ok? There's a reasonable spectrum to display your feelings about winter. There is an unreasonable spectrum to display your feelings about Bitcoin which most people live on the outer edges of.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hz7ygwf",
                            "author": "MrRGnome",
                            "score": 3,
                            "created_utc": 1646335406.0,
                            "response": ">crypto, defi, nfts etc. and be critical of their many shortcomings.\n\nThe unwelcome reality is if you are engaging in those things you don't understand their shortcomings - or you wouldn't be engaging with them. That's where the \"tribalism\" begins. Between those who understand the value proposition of Bitcoin and what makes it unique and those that think blockchains or calling something \"crypto\" gives it value.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hz566cs",
                    "author": "FastFwdFrank",
                    "score": 4,
                    "created_utc": 1646281931.0,
                    "response": "Luddites, the bunch of them.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hz5covu",
                    "author": "stillcantfathom",
                    "score": 4,
                    "created_utc": 1646285623.0,
                    "response": "So you're saying that people who hated the internet in 1995.... would have gotten on the internet ... to complain about the internet.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hz5iw52",
                    "author": "diamondgrin",
                    "score": 3,
                    "created_utc": 1646289527.0,
                    "response": "I often post in r/buttcoin.  Also comment in, r/DeFi, r/CC, r/BTC with sometimes popular and sometimes controversial opinions.  \n\nA couple of points I guess I'd preface with:\n\nI've got a background in finance and economics and have worked in financial markets and banking.  I'm pretty well read on crypto, but outside of a few very niche use cases, I don't think it's anywhere nearly close to providing the same level of utility as fiat and traditional finance.  I think its very nature of decentralisation is the same reason it can't replace a functioning banking system (no centralised risk taker to undertake maturity transformation).  I also think a huge reason for the growth trajectory over the last couple of years is a function of excess liquidity in financial markets combined with irrational exuberance and FOMO.  \n\nThere's a lot of people out there that are far smarter and better informed than I am that think crypto is the future.  There's also a whole bunch of people smarter and better educated than me that think it's a house of cards built on FOMO without a great deal of underlying utility. \n\nI think the strongest arguments in favour of crypto relate to the politics and philosophy of it - that the government should not control the money supply and institutions aren't to be trusted.  These are fair arguments, I just fundamentally disagree with them.  \n\n\nAs far as r buttcoin itself, I've never seen anyone banned for debating in good faith, so instead of posting support group threads like this in your echo chamber and looking for a pat on the back, come over and have a discussion some time.  Calling people stupid or ignorant like you are, without really providing any reasons, probably suggestions you're somewhere in the Dunning-Kruger zone...",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hz5mzg6",
                            "author": "Coco_Ardo",
                            "score": 5,
                            "created_utc": 1646292360.0,
                            "response": ">I've never seen anyone banned for debating in good faith, \n\nwell I did\n\nand a lot of hate",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "uq91g1",
            "title": "Is Bitcoin Deflationary?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uq91g1/is_bitcoin_deflationary/",
            "author": "Kart06ka",
            "created_utc": 1652630240.0,
            "score": 3,
            "num_comments": 14,
            "subreddit": "Bitcoin",
            "selftext": "Now, here me out. I know there is a set # of bitcoins, and that it's not technically deflationary. But my thinking is that because of the nature of bitcoin, there always bound to be permanent losses from people loosing their seed phrases and wallet access or just dying with their bitcoins.\n\nBut then I thought, what about mining? that adds bitcoin to circulation. Even though the total bitcoin is fixed, the circulating amount keeps increasing due to mining.\n\nThe number of BTC mined in the last 24 hrs is 762.04 (taken from bitinfocharts). This means that as long as BTC permanently lost per day is above that number, the amount of BTC available goes down and it becomes deflationary.\n\nHonestly though, its hard to believe that the permanent losses per day exceed 762 BTC, and I'm now leaning towards a daily NET increase in available BTC for the foreseeable future. \n\nAm I thinking straight, or am I out of whack?",
            "stickied": false,
            "comments": [
                {
                    "id": "i8pm2lf",
                    "author": "PurpGanja",
                    "score": 5,
                    "created_utc": 1652631894.0,
                    "response": "I would say that technically BTC is disinflationary not deflationary. BTC has a halving for mining rewards, this means that the supply of new BTC is halved every cycle. That’s why we are seeing the price increase in % terms decrease every cycle too. I would not know how lost BTC would affect this logic, but I couldn’t imagine having such an effect as to make BTC deflationary outright.\n\nBTW a good currency should be inflationary, it only matters HOW much is the inflation. So if BTC has a decreasing inflation (disinflation, not deflation) then that’s a good thing.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "t7nj2c",
            "title": "WATCH - UFC Fighter Bryce Mitchell calls out the Federal Reserve. “These people control our dollar, brother. And, we didn’t vote for them. Think about it. You got 13 board members voting on the value of the dollar. Did we vote for that? No, it’s corrupted.”",
            "url": "https://v.redd.it/edtjsz12ynl81",
            "author": "BashCo",
            "created_utc": 1646528882.0,
            "score": 3239,
            "num_comments": 427,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "hzj7ayo",
                    "author": "kwaker88",
                    "score": 184,
                    "created_utc": 1646537079.0,
                    "response": "\\*nods in agreement\\* \n\n\"... I don't get paid in gold.\"\n\nAlmost there.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hzjpvqg",
                            "author": "Future-PeterSchiff",
                            "score": 40,
                            "created_utc": 1646547557.0,
                            "response": "I wanna be paid in digital-gold\n\ndigital-gold=₿itcoin \n\nThey can physically confiscate my 2% a year inflating via Mining physical gold. Rather be paid in unconfíscatable digital-gold(₿).",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hzkd55j",
                                    "author": "teniceguy",
                                    "score": 8,
                                    "created_utc": 1646565803.0,
                                    "response": "Bitcoin has 1.75% inflation right now.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hzlt8ch",
                                            "author": "Future-PeterSchiff",
                                            "score": 5,
                                            "created_utc": 1646591901.0,
                                            "response": "With that inflation rate getting halved every 4 years and an actual finite supply of 21 million coins that will ever exist",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hzj6l2w",
                    "author": "ozzy_viking",
                    "score": 127,
                    "created_utc": 1646536711.0,
                    "response": "Unrelated, but this guy looks like the love child of Frodo and Merry.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hzkhvrv",
                            "author": "Asum_chum",
                            "score": 28,
                            "created_utc": 1646569469.0,
                            "response": "He eats the FED for second breakfast",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hzkjfm5",
                            "author": "EL1CASH",
                            "score": 3,
                            "created_utc": 1646570579.0,
                            "response": "😆",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hzix83h",
                    "author": "ndgoLiberty",
                    "score": 352,
                    "created_utc": 1646531977.0,
                    "response": "This dude gets punched in the head for a living and still he’s smarter than 7/8ths of the US government.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hzjpd75",
                            "author": "BeansBakerNumber5",
                            "score": 50,
                            "created_utc": 1646547235.0,
                            "response": "The normies are waking up, shits getting real.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hzk3und",
                                    "author": "ndgoLiberty",
                                    "score": 25,
                                    "created_utc": 1646558063.0,
                                    "response": "This guy appears to have been woke since at least 2020 probably his whole life. The normies are finally experiencing people like him.\n\nMany will write him off but that’s a problem with their education not his.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hzkhzwz",
                                            "author": "Asum_chum",
                                            "score": 10,
                                            "created_utc": 1646569555.0,
                                            "response": "I feel the same way about Russell Brand. So many people write him off for the way he was 20 years ago but I think he’s one of the most eloquent and on point commentators of our time.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "hzl0riz",
                                    "author": "Swayz",
                                    "score": 8,
                                    "created_utc": 1646580119.0,
                                    "response": "Just want to say the expression “normie” is fucking dumb as fuck. Carry on",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "hzkq770",
                                    "author": "soup2nuts",
                                    "score": 4,
                                    "created_utc": 1646574796.0,
                                    "response": "Why is it that I come to a crypto sub and all I see are the same canned phrases at a QAnon Telegram chat group?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hzl5zil",
                                            "author": "BashCo",
                                            "score": 8,
                                            "created_utc": 1646582426.0,
                                            "response": "Why are you spending any time at all in QAnon Telegram chat groups.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "hzkyc19",
                            "author": "StormCrow1986",
                            "score": 3,
                            "created_utc": 1646578984.0,
                            "response": "He gets paid to punch other people in the head. If he gets punched in the head he’s bad at his job.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hzj6na8",
                            "author": "Fuse_Holder",
                            "score": 20,
                            "created_utc": 1646536743.0,
                            "response": "What the government is doing is intentional though and they think they are smart. They are establishing precedent to control everyone's money by seizing power by going after the big bad Russians, most of which don't have anything to do with it. If Russia is a dictatorship then the people are living in fear and they are being further punished because they live in a certain geographic location of the world regardless of their political views.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hzm27f1",
                                    "author": "nyvdmy",
                                    "score": 7,
                                    "created_utc": 1646595612.0,
                                    "response": "That's the US propoganda they're spreading. They want to remove any possible competition from their way .",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "hzjdsai",
                                    "author": "ndgoLiberty",
                                    "score": 5,
                                    "created_utc": 1646540453.0,
                                    "response": "Smart and stealing from the young to pay the old. Yeah that’s gonna work out great give all the wealth to the people who are about to die at the cost of every single person.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hzn47v2",
                                            "author": "mesebucool",
                                            "score": 3,
                                            "created_utc": 1646612220.0,
                                            "response": "That's how the system of credit works, you basically are taking a loan from the future generation and hoping that they will work more hard and will be able to pay it much faster.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "hzizunj",
                            "author": "s0rtsbycontrversial",
                            "score": 11,
                            "created_utc": 1646533293.0,
                            "response": "This is a poignant statement. Well done.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hzkcufo",
                                    "author": "12coinfx13sigAB",
                                    "score": 6,
                                    "created_utc": 1646565561.0,
                                    "response": "But only one of them can't help much, common people need to rise against this inequality.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hzjd78l",
                    "author": "decosse",
                    "score": 87,
                    "created_utc": 1646540138.0,
                    "response": "It’s because we live in a democratic republic, we vote for people who then appoint others. Vote out the appointers. We didn’t vote for the Supreme Court either. Or most federal judges.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hzk8xtj",
                            "author": "OldCrow62",
                            "score": 32,
                            "created_utc": 1646562295.0,
                            "response": "And we don't get to vote for 12 of the 13 Fed Governors in any way only the Chainman is apporoved my the government. The Federal reserve is a private banking cartel.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hzks76e",
                            "author": "Heph333",
                            "score": 4,
                            "created_utc": 1646575889.0,
                            "response": "The problem is that the power of the regulatory agencies has obscenely outgrown their constitutional limits. The 10th Amendment is pretty clear & succinct, yet they use a vague interpretation of the general welfare clause to have unlimited authority. (unpopukar opinion warning)... Either the Constitution has authorized this abomination or it was powerless to prevent it. Either way, it is a failure at this point.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hzkr3zd",
                            "author": "senju_bandit",
                            "score": 3,
                            "created_utc": 1646575309.0,
                            "response": "This is how it works . We choose people who appoint these board members .",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hziwm8o",
                    "author": "ShittingOutPosts",
                    "score": 55,
                    "created_utc": 1646531674.0,
                    "response": "The more people who speak up, the better. Well said.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hznpto1",
                    "author": "jinjin299",
                    "score": 4,
                    "created_utc": 1646622537.0,
                    "response": "Damn he is a smart one out there, I thought all the ufc fighters are jerks.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hzj95jx",
                    "author": "zionzion34",
                    "score": 17,
                    "created_utc": 1646538034.0,
                    "response": "Most people don’t understand macroeconomic, letting everybody to decide what the value of USD should be and how the economic should go is not realistic isn’t it?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hzjbmxx",
                            "author": "zackmatic",
                            "score": 3,
                            "created_utc": 1646539311.0,
                            "response": "youre right, the federal reserve understands economics way better than most people.  thats why the dollar has lost 95% of its value since the federal reserve act of 1913, and the worst after nixon took the dollar off the gold standard.   so the people have had their currency and economic future destroyed by parasites who can type anything into their bank account, crash the economy, buy everything up cheap, over and over until were all serfs again.  because of our economic ignorance we are slaves",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hzks7js",
                    "author": "elyotel",
                    "score": 17,
                    "created_utc": 1646575895.0,
                    "response": "Well he is not saying anything wrong, in fact he is saying things in a pretty good way.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hzis1cs",
                    "author": "allovernow11",
                    "score": 43,
                    "created_utc": 1646529448.0,
                    "response": "He is not wrong",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hzl3zgz",
                    "author": "kolodapavlo",
                    "score": 8,
                    "created_utc": 1646581563.0,
                    "response": "Are they allowed to talk about these things in UFC? Damn that's nice.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hzl8nzg",
                            "author": "arcanebrain",
                            "score": 5,
                            "created_utc": 1646583559.0,
                            "response": "Dana White is a lot of things, but he isn't a bitch, and I appreciate that he allows free expression (well, it seems that way anyhow) and doesn't cave to a lot of the standard bullcrap that others in his position would",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hzjypng",
                    "author": "FunboyFrags",
                    "score": 15,
                    "created_utc": 1646553975.0,
                    "response": "Regular people who have no knowledge of monetary policy should not get to vote on monetary policy. I’m not saying that the Fed is doing a good job but this idea that voting makes everything better is ridiculous.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hzl2wex",
                            "author": "VisionGuard",
                            "score": 4,
                            "created_utc": 1646581088.0,
                            "response": "I think his argument is more that the system we have is flawed, and one of the striking ways is that a small cabal of people makes monetary policy decisions for the world.\n\nThat's....actually a *very* good argument.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hziteca",
                    "author": "Psycholo_Egg766",
                    "score": 50,
                    "created_utc": 1646530100.0,
                    "response": "When I talk like this I get called a conspiracy theorist by my peers. But they can never tell me why.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hzj57ls",
                            "author": "undadatunda",
                            "score": 25,
                            "created_utc": 1646536002.0,
                            "response": "conspiracy theorist:\n\nthe term used to discredit someone who speaks about things you cant bear to look at\n\nbecause if it were true it would reveal a darkness in the world that your simply not ready to accept",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hzk30sk",
                                    "author": "AceTheNutHead",
                                    "score": 14,
                                    "created_utc": 1646557397.0,
                                    "response": "Except when its something dumb like moon landing or flat earth.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "hzl42nb",
                                    "author": "TRexRoboParty",
                                    "score": 6,
                                    "created_utc": 1646581601.0,
                                    "response": "**conspiracies** are real things that eventually become news.\nPlenty of horrific things eventually become news and accepted.\n\n\n**conspiracy theories** are modern day mythology for people who don't understand the world. They shouldn't be accepted. Bill Gates causing covid for 5G mind control vaccines is not any more worthy of acceptance than gods causing storms for punishment.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hzjkrye",
                    "author": "Clovermunch",
                    "score": 21,
                    "created_utc": 1646544410.0,
                    "response": "I get his point but the usa is a republic at the federal level. The people we vote to power are the ones deciding these things. The people we voted for in the early 1900s are the ones that passed legislation creating the federal reserve. The people running the federal reserve now are chosen by our presidents and confirmed by the senate.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hzju8xk",
                            "author": "MacdaddyP794",
                            "score": 14,
                            "created_utc": 1646550594.0,
                            "response": "It’s actually an institution of private banks and bankers so yeah it’s pretty corrupt",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hzjuek3",
                            "author": "Valvoss1",
                            "score": 6,
                            "created_utc": 1646550708.0,
                            "response": "Indeed they are and politicians never accepts large sums of money to advance policies. \n\nBut 1 critical detail about how a Fed official is chosen may shed light on what he said. It’s true the President is given a choice but he can only pick from who the Fed puts forth. In essence, if I owned the Fed, I could give the Pres a choice of 5 of my friends and no one else. Sure the Pres picked someone but I made sure he could only choose one of my friends.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hzlckq4",
                    "author": "tsrdd",
                    "score": 7,
                    "created_utc": 1646585170.0,
                    "response": "It's so nice to see these guys are spitting so much facts/",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hzmihbm",
                    "author": "BtcMirco3",
                    "score": 6,
                    "created_utc": 1646602541.0,
                    "response": "We need more people like him in the environment, I like him.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hzkerws",
                    "author": "Subject_One6000",
                    "score": 3,
                    "created_utc": 1646567109.0,
                    "response": "Need more people like this guy.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hzkqlue",
                    "author": "SeanP086",
                    "score": 3,
                    "created_utc": 1646575028.0,
                    "response": "I have Bitcoin and I believe in blockchain! We just have to HODL. BUT…. \n\nWhether we like it or not as of now Bitcoin is tied to fiat. Yes  Bitcoin = Bitcoin, but until we can actually purchase big things like a house for example. Without converting it back to a fiat  form first. It’s still tied to fiat whether we like it or not. We all look at the price of Bitcoin ( as of todays it’s 39K) and in our heads we see the price of the dollar it’s worth. We still have to pay capital gain tax if we sell. No matter what the govt is always going to take a piece of your pie. That the society we live in. \n\nYes we call it digital gold Bc we all know at the end of the day actually GOLD is true money!!! That’s why it’s been around for thousands of years. Any adult on this planet can look at a piece of gold and know instantly what it is and that it has value. Its Gods money as some people say. \n\nNow we all hope with the advancement of technology and the internet blockchain will take off.  Fiat always fails no matter what bc it get corrupted. We can only hope our gamble of BITCOIN with payoff in the end. It’s an investment and investments are always speculative.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hzlb1vo",
                    "author": "redabnivek",
                    "score": 3,
                    "created_utc": 1646584547.0,
                    "response": "We can only hope more people start to wake up.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hzn62xb",
                    "author": "fcthen",
                    "score": 3,
                    "created_utc": 1646613096.0,
                    "response": "He is a good guy for me, I gotta support him for that lol.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hznmaao",
                    "author": "LelikGut",
                    "score": 3,
                    "created_utc": 1646620816.0,
                    "response": "Nice man, I never thought these UFC fighters can talk something like that.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hzix9rz",
                    "author": "diamondgrin",
                    "score": 32,
                    "created_utc": 1646532001.0,
                    "response": "I too like to get my views in monetary economics reinforced from a bloke who gets repeatedly bashed in the head for a living",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hzistvp",
                    "author": "SRM-87",
                    "score": 56,
                    "created_utc": 1646529825.0,
                    "response": "Lots of people say professional fighters are dumb due to the nature of their work.... This guy literally disproves that in one interview... Mad respect to him",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hzj1dxk",
                            "author": "A_Vizzle",
                            "score": 43,
                            "created_utc": 1646534067.0,
                            "response": "Watch some more interviews of his and you’ll see why people say professional fighters are fucking idiots.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hzjl1b0",
                                    "author": "5yr_club_member",
                                    "score": 3,
                                    "created_utc": 1646544561.0,
                                    "response": "[His story about rear-naked-choking a dear to death is pretty crazy!](https://www.youtube.com/watch?v=1-x51mV2j7M)",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hzizsv0",
                    "author": "timetopractice",
                    "score": 26,
                    "created_utc": 1646533267.0,
                    "response": "That's not how it works.  Extremely oversimplified to the point of just not being accurate at all",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hzl16d2",
                            "author": "-TYRS-",
                            "score": 4,
                            "created_utc": 1646580309.0,
                            "response": "Shhhh it goes against the narrative of this thread.\n\nMitchell is a good up and coming fighter. He's dumb as fuck though. Listen to any of his post-fight interviews or press conferences.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hzjezy9",
                    "author": "emtbro",
                    "score": 5,
                    "created_utc": 1646541116.0,
                    "response": "Just donated half his purse $45k t",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hzizray",
                    "author": "Particular-Edge-7666",
                    "score": 6,
                    "created_utc": 1646533246.0,
                    "response": "Better yet you have a choice. Choose the Bitcoin standard and never look back it's a good start..",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hziyv5u",
                    "author": "SuperShadyMonKey",
                    "score": 4,
                    "created_utc": 1646532793.0,
                    "response": "He should ask papa Dana to pay you him in Bitcoin.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hzk36er",
                    "author": "martintierney101",
                    "score": 3,
                    "created_utc": 1646557517.0,
                    "response": "Ma man",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hzk46of",
                    "author": "Armenelos12",
                    "score": 4,
                    "created_utc": 1646558333.0,
                    "response": "“ The seven members of the Board of Governors of the Federal Reserve System are nominated by the President and confirmed by the Senate. ”\nYes there are additional members too, five of which vote at a time.\n\nHowever, to say we have no voice as voters over the Fed is an oversimplification  to drive a certain anti-fed agenda.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hzjhw64",
                    "author": "Short-Shopping3197",
                    "score": 7,
                    "created_utc": 1646542750.0,
                    "response": "It’s actually really important that the Federal Reserve isn’t voted in and maintains separation from the Executive Branch. For example see the palaver of the Trump presidency where he tried to undermine their decisions in order to maintain GDP growth despite the longer term damage to the economy this would have caused.  Managing the economy requires longer term planning, more stability and the ability to make unpopular short term decisions for longer term benefit than party politics and a four year voting cycle can provide. This chap should stick to punching people in the head, he’s not as clever as he seems to think he is.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hzk527u",
                    "author": "i_just_mike_b_crazy",
                    "score": 3,
                    "created_utc": 1646559041.0,
                    "response": "Based.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hzj5nnf",
                    "author": "BitcoinFan7",
                    "score": 3,
                    "created_utc": 1646536231.0,
                    "response": "Based",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hzj60b8",
                    "author": "Responsible-Water-63",
                    "score": 3,
                    "created_utc": 1646536414.0,
                    "response": "This guy is awesome. Like his style 😎",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hzitgbd",
                    "author": "Dramatic_Grape2635",
                    "score": 7,
                    "created_utc": 1646530126.0,
                    "response": "But ... they do pick them...\n\nThe president is the one that nominates them and then they are confirmed by the senate, both of which are picked by the people. Even though I believe the FED is corrupt, his point is still untrue.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}