{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uwlnjf",
            "title": "I am fed up with the no-name self made stock wizards",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uwlnjf/i_am_fed_up_with_the_noname_self_made_stock/",
            "author": "misrori",
            "created_utc": 1653379177.0,
            "score": 0,
            "num_comments": 2,
            "subreddit": "Bitcoin",
            "selftext": "We need a place where you can browse actual tip of validated users! I am so happy that I found Bull Ranks, I found quality tips and I can see the history trades of that user!   \nIt is awesome!   \n[https://bullranks.com/](https://bullranks.com/)",
            "stickied": false,
            "comments": [
                {
                    "id": "i9s8ypf",
                    "author": "PermissionPale3773",
                    "score": 1,
                    "created_utc": 1653380202.0,
                    "response": "Jack D Schwager - Get all his books.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9s95br",
                    "author": "elaboratejuncture27",
                    "score": 1,
                    "created_utc": 1653380371.0,
                    "response": "Lol",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uwljho",
            "title": "Are you fine with the fact that society will not advantage if bitcoin is the currency?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uwljho/are_you_fine_with_the_fact_that_society_will_not/",
            "author": "rartedw",
            "created_utc": 1653378666.0,
            "score": 0,
            "num_comments": 22,
            "subreddit": "Bitcoin",
            "selftext": "If the world currency is bitcoin, there is less credit, which means less investors and worse economy. This basically means there's no future and society will always stay the same.\n\nAre you ok with this?",
            "stickied": false,
            "comments": [
                {
                    "id": "i9s84nz",
                    "author": "mrmiya",
                    "score": 7,
                    "created_utc": 1653379420.0,
                    "response": "Less credit would make people more innovative and productive, then the only reason to earn more or be productive is to come up with new products that someone pays more for. The economy is worse off when we start printing. Just look back in history, when currencies had the goldstandard the countries were booming, once they started printing they all went to shit and big down the line and big world powers fell because of this.\n\nKeynesian economics is baaaaad\n\nThe printing of money will be the reason the US will fall, like many countries before it, just watch and see. Printing money is a terrible thing that always leads to disaster.\n\nIn society were bitcoin is the currency, there is a fixed value. People can’t produce more of it. The only way to get more Bitcoin is to go out and work for it. No one is going to artificially inflate the economy by pumping more money into it. People will become less lazy and will start to work harder and be more innovative, unemployment rate will also go down most likely towards 0%",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9s8l96",
                            "author": "rartedw",
                            "score": 1,
                            "created_utc": 1653379846.0,
                            "response": "what is credit like during the gold standard?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9s90m7",
                                    "author": "mrmiya",
                                    "score": 1,
                                    "created_utc": 1653380250.0,
                                    "response": "Banks can’t just give out big loans with money they don’t have. So if they want to loan you money they need to have gold in the bank for it because they can’t go out and print new bills that are not pegged to gold. Now banks can just type some extra zeros in their computer basically and you get money and they just made some extra bills.\n\nBut we can’t just go randomly to a economy based on gold or Bitcoin. First the US will die and after that there will be a gold or maybe a Bitcoin standard. If you go to it without the death of the US economy it would crash the economy we know I think because everything we see now is artificially inflated and kept alive",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9s9648",
                                    "author": "Wreck556",
                                    "score": 1,
                                    "created_utc": 1653380391.0,
                                    "response": "Depends on the lender and if the people of the country have created and enforced usury laws.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9sfpkr",
                    "author": "Leading_Zeros",
                    "score": 2,
                    "created_utc": 1653386480.0,
                    "response": "There will always be credit avalible at the market set price of interest for profitable endeavours. Cheap credit only enables massive levels of mal-investment leading to ever incresingly destructive boom-bust cycles. Sustainable growth can only occur on a sound money standard.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9s8upl",
                    "author": "Wreck556",
                    "score": 1,
                    "created_utc": 1653380096.0,
                    "response": "Any economy built on credit is always doomed to failure. The Austrian school + backed currencies + true free market principals have advanced humanity far more than Keynesians have. Credit is debt, debt is the currency of slaves.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9s9qz7",
                    "author": "vitalyevodin",
                    "score": 1,
                    "created_utc": 1653380932.0,
                    "response": "Arabian countries doesn’t have credits\nbanks work as investors, they religion forbids a lot of such credit and debt behavior",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9sfs40",
                    "author": "thapussypatrol",
                    "score": 1,
                    "created_utc": 1653386542.0,
                    "response": "Yes.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9sgoj0",
                    "author": "SkipAndGo",
                    "score": 1,
                    "created_utc": 1653387309.0,
                    "response": "You can have and get credit off of bitcoin as collateral, only difference is that someone cannot print trillions of more bitcoin causing it to collapse in value over time.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9sidam",
                    "author": "Mallardshead",
                    "score": 1,
                    "created_utc": 1653388684.0,
                    "response": "Clueless. Trying to model an inflationary system into a deflationary network. What happened when we shoehorned libraries, studios, universities, and the whole of known human history into hard drives and servers the size of shoeboxes? We went to an overabundance of information, connected the world, and we're still only 30 years into it. What do you imagine bitcoin will do? Create an over abundance OUTSIDE the money.\n\n*Are you ok with this?*\n\nAs a money supply relentlessly expands, so must institutions and banks to corral it all. This requires more laws and enforcement bodies. This means more powerful politicians. This all means more powerful governments.\n\n*Clearly you're ok with this.*\n\nWhen a government can't print money, they cannot finance wars. This means military industrial complexes crack leaking all their time, money, and energy back to society in a wealth distribution at odds with robbing Jeff Bezos to give his money to people that will give it right back to him. It demonetizes the political class in a way that eliminates symbolic legislation and force ideas of value.\n\n*Are you ok with this?*\n\nNo more high-rises overlooking Central Park with 100% ownership and 5% occupation. No more finding fewer products to stuff more and more money into. Your non-sensical and dishonest base layer of fiat and debt will die this decade. Nothing built over a dishonest base layer can ever be honest. It's time to unleash the collective world's IQ.\n\n*Are you ok with this?*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9sj2ne",
                    "author": "Mektzer",
                    "score": 1,
                    "created_utc": 1653389239.0,
                    "response": "Credit is killing our societies. The younger generations are falling into a spiral loop of debt, they can't afford a house even with interest rates at zero because the amount of credit they already took in the past is nonsensical. They can't live independently, free, without debts, and plan for the future and have a family, which is what would acctually advance our society.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9sjm1c",
                    "author": "feyyd",
                    "score": 1,
                    "created_utc": 1653389654.0,
                    "response": "The \"less credit\" part is a feature not a bug.  Too much credit is basically the cause of a lot of the issues.  If BTC is reserve, and fiat overextends, the fiat will suffer, not the world reserve.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9slokw",
                    "author": "PerformanceVarious45",
                    "score": 1,
                    "created_utc": 1653391148.0,
                    "response": "Yes I'm ready for the world to make smart and well thought out rational decisions.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9snvai",
                    "author": "cryptolulz",
                    "score": 1,
                    "created_utc": 1653392605.0,
                    "response": "What the fuck are you going on about? That's the stupidest shit I ever read lol, does OP got a brain disease that needs addressing?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9sowt4",
                    "author": "Kingofplenty",
                    "score": 1,
                    "created_utc": 1653393263.0,
                    "response": "If you havent already read it, I would recommend The Bitcoin Standard by Saifedean Ammous. It goes though the history of money and explains why hard money like gold and Bitcoin make for a better economy and society.  \n\n&#x200B;\n\nThere are audio book versions on YouTube 8-11 hours depending on the version.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9sp3ip",
                            "author": "rartedw",
                            "score": 1,
                            "created_utc": 1653393379.0,
                            "response": "ive heard its bias towards bitcoin",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9seq30",
                    "author": "igadjeed",
                    "score": 0,
                    "created_utc": 1653385586.0,
                    "response": "> If the world currency is bitcoin\n\nThat can never happen",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9slju7",
                            "author": "magneticman245",
                            "score": 1,
                            "created_utc": 1653391059.0,
                            "response": "Why?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9snu5q",
                                    "author": "igadjeed",
                                    "score": 1,
                                    "created_utc": 1653392585.0,
                                    "response": "https://np.reddit.com/r/Bitcoin/comments/ix46wm/why_does_bitcoin_allow_only_4_transactions_per/g64q1ph/",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9sorxn",
                                            "author": "cryptolulz",
                                            "score": 1,
                                            "created_utc": 1653393178.0,
                                            "response": "Still wrong lol",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i9snzmb",
                                            "author": "magneticman245",
                                            "score": 1,
                                            "created_utc": 1653392683.0,
                                            "response": "Seems like a long winded way to say \"I haven't heard of the lightning network\"",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9soqxv",
                            "author": "cryptolulz",
                            "score": 1,
                            "created_utc": 1653393160.0,
                            "response": "Wrong. Nonsense.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "uwlksm",
            "title": "My experience talking with people about bitcoin (I live in Brazil)",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uwlksm/my_experience_talking_with_people_about_bitcoin_i/",
            "author": "DanielCM1989",
            "created_utc": 1653378832.0,
            "score": 30,
            "num_comments": 20,
            "subreddit": "Bitcoin",
            "selftext": "Sometimes I've been talking with people about bitcoin. Some people seemed to like it. I was able to help some people to set up wallets and buy a little bitcoin.\n\n&#x200B;\n\nBut at least in my experience, it seemed like most people had negative opinions about bitcoin. If they don't want bitcoin, that's ok too.\n\n&#x200B;\n\nAs part of my bitcoin learning experience over the years, it occurred to me that it would probably be good to see the negative criticism about it, so I can be sure if bitcoin really works or if maybe people found any real problems with it. But at this point, I basically see people just guessing what must be wrong with bitcoin, or repeating some FUD talking points without real basis.\n\n&#x200B;\n\nHere are a few things that people told me about bitcoin. Maybe it's just me, but sometimes I find those statements interesting / amusing. They were all said by Brazilian people unless noted otherwise. I've heard most of them in Brazilian Portuguese (which is the main language here in Brazil) so I'm translating them to English now.\n\n&#x200B;\n\nMost asked question by far:\n\n\"Once you buy bitcoin, how do you withdraw the money later?\" (I usually talk about bitcoin ATMs, and also suggest waiting months / years before withdrawing. I also suggest spending fiat money before spending any bitcoin.)\n\n&#x200B;\n\nNegative reactions said by other people:\n\n\"It has gained much value over the years, so it must be a pyramid scheme.\"\n\n\"It has lost value or it has gained value too slowly (depending on time frame), so it must be a waste of time / or it must be the wrong cryptocurrency.\"\n\n\"The owner / inventor of bitcoin was arrested.\" (referring to a guy here in Brazil who was basically accused of losing people's money with bitcoin, he's nicknamed \"Pharaoh of Bitcoins\" around here)\n\n\"People lose money with bitcoin all the time.\" (To be fair, I suppose some people lose money with bitcoin sometimes, like when they buy high and sell low. Or in that \"Pharaoh of Bitcoins\" case)\n\n\"Bitcoin is not real money because you can't hold it in your hand. Cash and credit cards count as real money, because you can hold them.\"\n\n\"You must be rich to have bitcoin.\" / \"It's too expensive, other cryptocurrencies are better because they are cheaper.\"\n\n\"Bitcoin is going to end, China is banning it.\"\n\n\"You should act more responsibly with your money instead of buying bitcoin. You don't know if this is going to work out.\"\n\n\"Bitcoin is probably for criminals because it's sketchy to have a currency without government oversight.\" (I've heard this in English, not from Brazil)\n\n\"Something only has value because people believe it has value. Maybe eventually people will believe that bitcoin is worth $0, then it really will be worth $0.\" (I've heard this in English, not from Brazil)\n\n&#x200B;\n\nSometimes people did not seem to believe me about some bitcoin claims:\n\n\"If someone loses their password, there's no way the money just stands there in their account with no way to retrieve it. That can't be right.\"\n\n\"It does not make sense that you hold onto bitcoin and it becomes more valuable over time. Who is giving you that additional money? Money does not grow on trees.\"\n\n\"I don't see how bitcoin could still have value if it gets banned in a number of countries / governments.\"\n\n&#x200B;\n\nOther misconceptions / questions said by other people:\n\n\"The price is rising or is declining, so that's the price that the bitcoin management wants.\"\n\n\"Do the bitcoin send you a debit/credit card?\"\n\n\"You can deposit / withdraw whenever you want? Don't they make you wait for some time before withdrawing it?\"\n\n&#x200B;\n\nPeople finding out about alt coins:\n\n\"If China bans bitcoin and creates their own cryptocurrency, China's cryptocurrency will probably be worth more than bitcoin.\"\n\n\"After you told me about bitcoin, I did my own research and would like to buy these cryptocurrencies: (says a list).\"\n\n\"Since bitcoin is backed by nothing and got very valuable over the years, I want to make my own coin so it will also get very valuable.\"",
            "stickied": false,
            "comments": [
                {
                    "id": "i9sbl69",
                    "author": "G1lius",
                    "score": 10,
                    "created_utc": 1653382686.0,
                    "response": "Very standard reactions. Which is good, people should be careful, not just throw money at whatever someone says is a good idea. The \"if they don't want bitcoin, that's ok\" is very important.  \nNot everyone is into taking investment risks. Bitcoin is still very volatile and indeed, if everyone thinks it's worth nothing, it actually is worth nothing, just like any other currency.\n\nPlanting seeds is good enough. You can't convince someone in one go who has no knowledge. Tell them why their concern isn't valid, and why you think bitcoin is a good idea. Not as an investment, but the technology, the impact on the world, the exit from the current monetary system. They should do their own research to find out if your claims are correct.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9sll0o",
                    "author": "Wise-Application-144",
                    "score": 8,
                    "created_utc": 1653391082.0,
                    "response": "You can refute almost every objection to bitcoin by comparing it to existing assets. All those problems also exist with shares, bonds, gold or property.\n\nThere are three valid objections to investing in bitcoin:\n\n1. I don’t understand it\n\n2. It doesn’t fit with my risk appetite\n\n3. I believe it’s more likely to go down than up.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9t9340",
                            "author": "No_Release6675",
                            "score": 1,
                            "created_utc": 1653403430.0,
                            "response": "You forgot one: \" i prefer shitcoins\"",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9tdro2",
                                    "author": "Jaseur",
                                    "score": 2,
                                    "created_utc": 1653405415.0,
                                    "response": "That's kind of under risk appetite.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9sv3pp",
                    "author": "bigdaddyjeff69",
                    "score": 4,
                    "created_utc": 1653396845.0,
                    "response": "All these people who know nothing giving opinions. I’ve done 1000 + hours research, I feel even dumber than I did before I started.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9s9vhe",
                    "author": "thaigerking",
                    "score": 11,
                    "created_utc": 1653381054.0,
                    "response": "as Satoshi once put\n\n“If you don't believe me or don't get it, I don't have time to try to convince you, sorry\"\n\nIf given up trying to convince people, they will work it out eventually. You buy Bitcoin at the price you deserve.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9s8cgb",
                    "author": "solomonsatoshi",
                    "score": 6,
                    "created_utc": 1653379617.0,
                    "response": "Most people are afraid to be free.\n\nMost people still remain slaves to the fiat debt slavery cartel.\n\nBut with Bitcoin you do have the choice, for now at least . . . to be free and have full custody of your savings in a free and open global protocol that treats each and every citizens of the world equally and without fear or favour.\n\nUp to you if you want to be part of it or not- it is not imposed upon anyone via state mandate monopoly and force.\n\nUntil they ban it.\n\nOnly be part of the Bitcoin revolution if you want to be and recognise the risks and benefits.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9t4tbu",
                    "author": "epicjeff",
                    "score": 2,
                    "created_utc": 1653401571.0,
                    "response": "For ones that say you can't hold it in your hand, you can tell them they can hold it in their hand on their phone.  You can use a digital wallet (like Apple Wallet) to store cards and use them to buy things instead of using the physical cards (at least a places that have the machine type that can accept cards that way).  Some exchanges issue digital cards where you can potentially use BTC as the currency (like Uphold).\n\nEven if you don't want to use an exchange, or a card at all, the main point is that you can still hold it in your hand on your phone and send it from BTC wallet to BTC wallet without a card.  It's not all that much different in principal from sending money directly to someone via Apple Pay or Paypal or something like that.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9te0jc",
                    "author": "Bitcoin__Hodler",
                    "score": 2,
                    "created_utc": 1653405519.0,
                    "response": ">But at least in my experience, it seemed like most people had negative opinions about bitcoin.\n\nThat is what you get when MSM airs 10 years negative/false informations about something.\n\nMaybe not only about Bitcoin some people might think...",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9tei3d",
                    "author": "DrizzyDoe",
                    "score": 2,
                    "created_utc": 1653405719.0,
                    "response": "Biggest issue I've run into is, while it's ok to be skeptical and even dismissive, a lack of humility and open-mindedness enabling people to rework their world view. It takes a lot to say, \"my view on what is true and real may be wrong, let's see if this new evidence can give me a better idea.\"\n\nIt's much easier to throw up a metaphorical wall and chalk bitcoiners up as the crazy ones.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9tx4th",
                    "author": "cringeboytv",
                    "score": 2,
                    "created_utc": 1653413367.0,
                    "response": "You are well done for helping people and sharing your knowledge.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9tyyt5",
                            "author": "DanielCM1989",
                            "score": 1,
                            "created_utc": 1653414123.0,
                            "response": "Thanks. :)",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9u4j5m",
                    "author": "hentaikid",
                    "score": 2,
                    "created_utc": 1653416436.0,
                    "response": ">\"Since bitcoin is backed by nothing and got very valuable over the years, I want to make my own coin so it will also get very valuable.\"\n\nWorked for Vitalik!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9s7zhm",
                    "author": "solomonsatoshi",
                    "score": 3,
                    "created_utc": 1653379291.0,
                    "response": "Bitcoin is freedom of choice, speech and liberty.\n\nAre they going to ban it?\n\nMaybe.\n\nIf your government bans Bitcoin you should be worried about that and a lot more besides.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9suf6i",
                            "author": "TheChoosey1",
                            "score": 1,
                            "created_utc": 1653396480.0,
                            "response": "Don't worry. A certain Canadaian Texas senator has been successfully orange pilled. \n\nYou know how we still use oil and don't have any rights even though we really want them? It's that guy's fault. You think he'll let anything happen to Bitcoin?\n\nWe just need to make sure we teach people about why Bitcoin is better than every other cryptocurrency. It's the supply cap and consistent monetary policy combined with the highest hashing power.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9smkvv",
                    "author": "Troy_Ounces",
                    "score": 1,
                    "created_utc": 1653391753.0,
                    "response": "Come to brazil",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ucdle",
                    "author": "superdityferdbruck",
                    "score": 1,
                    "created_utc": 1653419745.0,
                    "response": "PLEASE COME TO BRAZIL",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9sdc89",
                    "author": "alien3d",
                    "score": -2,
                    "created_utc": 1653384313.0,
                    "response": "i still cannot cover cost network fee + credit card fee(newbies) trial which sum 8% and quite hugh. We try local authorized only 9 myr extra even 50 myr free . How actually want to promote unless you got 25 myr each referal ? really odd sometimes all the refferal and exchange . Confuse  😞",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}