{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uqwoab",
            "title": "President Nayib Bukele Announces 44 Countries To Meet In El Salvador To Discuss Bitcoin",
            "url": "https://markethive.com/rico40/blog/presidentnayibbukeleannounces44countriestomeetinelsalvadortodiscussbitcoin",
            "author": "RonTate",
            "created_utc": 1652709695.0,
            "score": 9,
            "num_comments": 1,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8tkx4w",
                    "author": "Impalmator",
                    "score": 1,
                    "created_utc": 1652710255.0,
                    "response": "Misread it as Nayib Bukkake.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uqwzlh",
            "title": "EW Analysis Counting Bitcoin waves Leg Down Crash🚣‍♂️ 🌊",
            "url": "https://youtu.be/rcN9KOMf5vM",
            "author": "_BitBull_",
            "created_utc": 1652710569.0,
            "score": 2,
            "num_comments": 0,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uqx1ok",
            "title": "How to calculate Risk associated with bitcoin?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uqx1ok/how_to_calculate_risk_associated_with_bitcoin/",
            "author": "crasshumor",
            "created_utc": 1652710737.0,
            "score": 1,
            "num_comments": 34,
            "subreddit": "Bitcoin",
            "selftext": "Using excel, apart from Standard Deviation of Price/Returns, how else can I calculate risk associated with Bitcoin?\n\nWhat would be the most appropriate benchmark to compare the results of a bitcoin?",
            "stickied": false,
            "comments": [
                {
                    "id": "i8tm856",
                    "author": "sheldonth",
                    "score": 5,
                    "created_utc": 1652710836.0,
                    "response": "You’ve gotta risk it all to have it all.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8tz1b1",
                    "author": "_main_chain_",
                    "score": 1,
                    "created_utc": 1652716211.0,
                    "response": "Literally nobody has that answer. Please find it for us.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8u0biy",
                    "author": "No_Insurance6064",
                    "score": 1,
                    "created_utc": 1652716731.0,
                    "response": "I figured out that it is bigger risk to not own any BTC/sat amount",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8uahi1",
                    "author": "Ok_Aerie3546",
                    "score": 1,
                    "created_utc": 1652720783.0,
                    "response": "You compare alpha, beta, std dev, sharpe ratio and r2 with other asset classes. Thats the best you can do honestly.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ui0kl",
                    "author": "Keith_Kong",
                    "score": 1,
                    "created_utc": 1652723769.0,
                    "response": "Trends are your only measurement for statistical risk on Bitcoin, here are my favorites:\n\n**Log regression curves:**  \n[https://www.lookintobitcoin.com/charts/bitcoin-logarithmic-growth-curve/](https://www.lookintobitcoin.com/charts/bitcoin-logarithmic-growth-curve/)  \n\\^  Represents the trade range convergence over time\n\n**Realized Price Versus Spot Price:**  \n[https://www.lookintobitcoin.com/charts/realized-price/](https://www.lookintobitcoin.com/charts/realized-price/)  \n\\^  Represents whether holders are turning stubborn, meaning most are in a loss but are still holding\n\n**HODL > 1 year:**  \n[https://www.lookintobitcoin.com/charts/1-year-hodl-wave/](https://www.lookintobitcoin.com/charts/1-year-hodl-wave/)  \n\\^ Shows direct increases and decreases in long term holders.\n\nThere are other charts measuring more obscure technicals but for me these represent the psychology behind Bitcoin holders. If the **price range is on the low side, holders are in a loss, and you've seen an increase in long term holders starting to plateau on a high point**, then you can have a high degree of confidence in Bitcoins medium term price action.\n\nThe only other factors to consider are political in nature.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8um92r",
                            "author": "crasshumor",
                            "score": 1,
                            "created_utc": 1652725445.0,
                            "response": "That was really helpful, thank you!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8twto0",
                    "author": "extrastone",
                    "score": -1,
                    "created_utc": 1652715307.0,
                    "response": "Let's think about a few milestones.  To me a real bitcoin milestone is: \"we only accept bitcoin here.\"\n\nDrug dealer says: \"we only accept bitcoin.\"  Done that.\n\nSmall business says: \"we only accept bitcoin.\"  Not yet.\n\nLandlord says: \"I only accept bitcoin.\"  Not yet.\n\nLarge business says: \"we only accept bitcoin.\"  Not yet.\n\nNow let's think about how much bitcoin would be needed to service each one of these businesses.\n\nAt the same time we need to think about how pathetic local currencies would have to become for people to start refusing to accept them.\n\nThen we have to realize that by this time bitcoin will not have a real value in local currency but will probably have a value in barrels of oil because local currency will be so terrible that it won't even be worth relating to.\n\nSo at some point a non-negligible number of the world's businesses will only accept bitcoin and thus their customers will try to work for employers that pay in bitcoin.  At that point bitcoin will be easily valued at several hundred thousand dollars.  That will be more than a tripling.  Given the amount of risk involved in bitcoin it's still a buy.\n\nSend me a DM.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8u12pa",
                            "author": "mcintoshshowoff",
                            "score": 2,
                            "created_utc": 1652717035.0,
                            "response": ">So at some point a non-negligible number of the world's businesses will only accept bitcoin and thus their customers will try to work for employers that pay in bitcoin. At that point bitcoin will be easily valued at several hundred thousand dollars. That will be more than a tripling. Given the amount of risk involved in bitcoin it's still a buy.\n\nyeah, right.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8tsz0s",
                    "author": "NiceDoctorBeam",
                    "score": 0,
                    "created_utc": 1652713704.0,
                    "response": "When your private keys are properly secured, nobody can confiscate your Bitcoin.\n\nNobody can merely \"print\" tens of trillions of Bitcoin from thin air, backed by nothing.  Thus, no dickhead politician nor criminal central banker can devalue Bitcoin.  Bitcoin's supply is capped.  No more than 21 million will ever be created.  There's a 100% certainty that the USD will continue to be devalued.\n\nLet's look at Bitcoin's long term average ROI.\n\nFive years ago, the price was $2018.  Today it's about $30,000.  That works out to about 72% per year, compounded for five years.\n\nTen years ago, the price was about $6.  That works out to 134% per year, compounded for ten years in a row.  Yes, one Bitcoin sells for five thousand TIMES what it sold for just ten years ago.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8tt8ox",
                            "author": "crasshumor",
                            "score": 2,
                            "created_utc": 1652713817.0,
                            "response": "That's all good but my question was more of a statistical question. How do I quantify the risk in bitcoin investment. Normal shares have Beta, SD, Sharpe and Info Ratio etc. So what can I use to quantify risk in Btc",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8tu78z",
                                    "author": "NiceDoctorBeam",
                                    "score": 1,
                                    "created_utc": 1652714221.0,
                                    "response": "Guess and check.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8txb7l",
                                            "author": "extrastone",
                                            "score": 1,
                                            "created_utc": 1652715508.0,
                                            "response": "The check part sounds like a lot of fun!",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8u55t8",
                                                    "author": "NiceDoctorBeam",
                                                    "score": 1,
                                                    "created_utc": 1652718686.0,
                                                    "response": "Always wear seat belts.  \n\nWhen riding a bike, always wear a helmet (gloves are a pretty good idea, too).\n\nLook both ways before crossing - even on one-way streets.\n\nRemain seated until the ride has come to a complete stop.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8tyyp0",
                    "author": "mcintoshshowoff",
                    "score": 0,
                    "created_utc": 1652716180.0,
                    "response": "There is no way to accurately capture the risk of bitcoin because there's no way to value bitcoin. It doesn't return capital, it doesn't pay a dividend, and there's the left-tail risk of the west banning it, but you can't really quantify that. You're going to get a bunch of ridiculous answers here because no one here understands what risk management is or they wouldn't have their money tied up in bitcoin or waste their time here.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8tz4q4",
                            "author": "crasshumor",
                            "score": 1,
                            "created_utc": 1652716250.0,
                            "response": "What's a left tail risk?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8tzi58",
                                    "author": "mcintoshshowoff",
                                    "score": 1,
                                    "created_utc": 1652716402.0,
                                    "response": "extreme downside risk. a crypto ban would effectively take the price to zero relative to the current price.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8yew94",
                                            "author": "BTCMachineElf",
                                            "score": 1,
                                            "created_utc": 1652800907.0,
                                            "response": "Too many regulations have been passed to ban it now. That is some old school fud. And the fact that you call it 'crypto' shows you don't understand bitcoin. Bitcoin is in its own asset class.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8yg2bo",
                                                    "author": "mcintoshshowoff",
                                                    "score": 1,
                                                    "created_utc": 1652801394.0,
                                                    "response": "All cryptocurrencies would be banned, not just Bitcoin, hence a “crypto” ban. Won’t happen at these levels, but if there’s a real capitulation and the media picks up on how many people lost their entire savings due to these speculative “assets”, you can bet your ass the politicians will “protect the consumer” along with the “financial system” and move to ban crypto.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8ygxkw",
                                                            "author": "BTCMachineElf",
                                                            "score": 1,
                                                            "created_utc": 1652801755.0,
                                                            "response": "Governments know bitcoin is special. Crypto can be labeled as a security, and thus be liable to the SEC, but bitcoin is classified as an asset. \n\nPeople will continue to lose their life savings with crypto. But the technological innovation that bitcoin provides to society has an incredible real value that its investors are keenly aware of.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8ycxut",
                            "author": "BTCMachineElf",
                            "score": 1,
                            "created_utc": 1652800082.0,
                            "response": ">no one here understands what risk management is or they wouldn't have their money tied up in bitcoin or waste their time here.\n\nYeah that sure was stupid of me to put my life savings in at $5k and sit on it for 4 years. Woah boy i sure dont understand anything or I never woulda done that. I sure am dumb! What a waste of time here. When youre right, youre right!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8yf4vm",
                                    "author": "mcintoshshowoff",
                                    "score": 1,
                                    "created_utc": 1652801007.0,
                                    "response": "From $60k to $30k in 6 months. How did you hedge your risk?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8yfw6y",
                                            "author": "BTCMachineElf",
                                            "score": 1,
                                            "created_utc": 1652801323.0,
                                            "response": "Risk? Bitcoin isn't going anywhere. Trading is folly. Simply accumulating bitcoin is the best move.\n\nMissing the peak doesn't hurt so much when you're still up 800%.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8yghpr",
                                                    "author": "mcintoshshowoff",
                                                    "score": 1,
                                                    "created_utc": 1652801574.0,
                                                    "response": "Let’s see: I put 3% down on my house, I’ve paid about $20k on my mortgage in the last two years yet I have about $150k in equity. What’s my cash on cash return? Leverage is truly magical and not limited to bitcoin.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8yheb8",
                                                            "author": "BTCMachineElf",
                                                            "score": 1,
                                                            "created_utc": 1652801946.0,
                                                            "response": "No idea. I own nothing but bitcoin. No 9 to 5. No mortgage. No debt. No taxes. I am free.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8yi1hh",
                                                                    "author": "mcintoshshowoff",
                                                                    "score": 1,
                                                                    "created_utc": 1652802211.0,
                                                                    "response": "Free? Your entire worth is tied to something people can’t even agree is an “asset”. For you to not educate yourself on at least what cash-on-cash returns are is completely stupid.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i8yiuro",
                                                                            "author": "BTCMachineElf",
                                                                            "score": 1,
                                                                            "created_utc": 1652802547.0,
                                                                            "response": "Uh, people agree it's an asset. Cash on cash returns\n. OK let's see\n\n>In investing, the cash-on-cash return is the ratio of annual before-tax cash flow to the total amount of cash invested, expressed as a percentage.\n\n>It is often used to evaluate the cash flow from income-producing assets\n\nOK, I don't have income producing assets. So how does that help me? Bitcoin doesn't produce income because bitcoin is simply money. But it continues to be one of the best preforming assets over the long run. What am I missing here?",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i8yjryd",
                                                                                    "author": "mcintoshshowoff",
                                                                                    "score": 1,
                                                                                    "created_utc": 1652802921.0,
                                                                                    "response": "Let’s see: an education, risk management, and diversification for starters. You just admitted you’re ignorant, so why are you arguing with me about risk management when you clearly have no idea what I’m talking about?",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i8yka7h",
                                                                                            "author": "BTCMachineElf",
                                                                                            "score": 1,
                                                                                            "created_utc": 1652803135.0,
                                                                                            "response": "Because you clearly don't know shit about bitcoin which is kicking the ass of your legacy financial bullshit. \n\nYour expertise doesn't mean shit when I can outperform it by understanding technology better than you.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}