{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uqmidw",
            "title": "Lets hear from the Loan Sharks",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/uqmidw/lets_hear_from_the_loan_sharks/",
            "author": "CrypoFiend",
            "created_utc": 1652671296.0,
            "score": 1,
            "num_comments": 3,
            "subreddit": "BitcoinBeginners",
            "selftext": "I kept hearing people tell others o DCA AND loan your Bitcoin out for yield. Many times people were warned to keep your BTC in cold wallets. If you are loaning out your BTC and have it locked in a 30 day to 6 month contract, how are you feeling now?\n\nPlease just hodl on cold wallets moving forwards.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8s068y",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1652671297.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uqmjq1",
            "title": "Tunisia, China and crypto",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/uqmjq1/tunisia_china_and_crypto/",
            "author": "foximus89",
            "created_utc": 1652671438.0,
            "score": 1,
            "num_comments": 30,
            "subreddit": "BitcoinBeginners",
            "selftext": "Hi all. A good friend of mine is Tunisian. We have met in Beijing China, where we both have gathered some years of savings. I have been moving my money out of China to my personal bank account in the EU via crypto, and told him this was a decent way to avoid all the obstacles of the Chinese banking system (which makes it very hard for foreigners to move their money out of China). He told me Tunisia does not allow any crypto trading, therefore he would be unable to withdraw funds to his bank account. Does anyone here know a workaround for this specific context, in which my friend does not have to hand over custody of his money? (Travelling with cash is not allowed, as it is about 2-3 year salaries)",
            "stickied": false,
            "comments": [
                {
                    "id": "i8s0f73",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1652671438.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8w6hda",
                    "author": "ApricotAcrobatic7761",
                    "score": 0,
                    "created_utc": 1652750405.0,
                    "response": "He could use Guarda wallet to store his crypto, and for purchasing, too. Bitcoin and other popular assets are available for buying with credit card or SEPA transfer. He can travel with his crypto wallet installed on his phone or use web version. Plus, Guarda is a non-custodial wallet. He can save his private keys (either print them or the method he prefers) which contain his wallet info on the blockchain and saving these only he owns his funds and no third party/custodian servive can control or ban his assets. He could use Guardarian (Guarda wallet's partner) if he needs to withdraw crypto to his bank.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}