{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ut8y8f",
            "title": "I have just bought my first 10 Dollars in Bitcoin. Was it a good time or should I have waited?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/ut8y8f/i_have_just_bought_my_first_10_dollars_in_bitcoin/",
            "author": "ErrorCode404__NoUser",
            "created_utc": 1652982498.0,
            "score": 20,
            "num_comments": 71,
            "subreddit": "Bitcoin",
            "selftext": "I am 13 years old and am looking to make money for college funds and my future career. I don't have any money in the bank I could spend on bitcoin, but I remembered I had around 20 Dollars in an old Skrill account of mine, which is now 10 Dollars because of fine's for inactivity. I have seen Bitcoin at a stable level after its massive drop so I though now would be the time to buy with knowledge from trading virtual money on the stock exchange. Was it a good idea in thought it is my first ever Bitcoin purchase or should I have waited?",
            "stickied": false,
            "comments": [
                {
                    "id": "i98rhl8",
                    "author": "Mallardshead",
                    "score": 87,
                    "created_utc": 1652990181.0,
                    "response": "* 13-year-olds don't have useable bank accounts in the US\n* Skrill is a US-based remittance platform that uses KYC and the age limit is 18-years-old\n* Skrill inactivity charge doesn't start until 13 months, so you were 11-years-old when you signed up?\n* The Skrill inactivity fee couldn't have brought your account to $10 from $20 because the fee is $3 a month, meaning it would've been $11\n* Your language (parlance) doesn't match a 13-year-old's\n\nConclusion:\n\nI'm uncertain what you're trying to do here or what type of syndrome this is classified under, but you're not 13-years-old. If you were, I would've asked for your BTC address and helped you top up which I like to do for newbs and people who live in places where BTC has tremendous value versus their fiat. Bitcoin Catfish.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i98rsu2",
                            "author": "SouthTippBass",
                            "score": 31,
                            "created_utc": 1652990310.0,
                            "response": "Fucking cracked it. Case closed.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i99y7cx",
                                    "author": "harvester88",
                                    "score": 1,
                                    "created_utc": 1653011113.0,
                                    "response": "Yeah he investigated this matter in depth and we all saw this results it's good to see that people are aware of the things happening around them, I am going to investigate in deep that which exchange have allowed to trade under 18",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i995bdf",
                            "author": "JeremyLinForever",
                            "score": 14,
                            "created_utc": 1652996885.0,
                            "response": "The dead giveaway was “I have seen Bitcoin at a stable level after it’s massive drop…”\n\nThis 13 year old kid knows how to do technical analysis? LOL",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9b0d0h",
                                    "author": "doger2005",
                                    "score": 4,
                                    "created_utc": 1653036532.0,
                                    "response": "Even at the age of 20, I am struggling with technical analysis and this kid is touching new heights at such a young age, hopefully he is not lying because having a good TA knowledge at this age is just insane and crazy, I am going to learn more from here",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i997hvu",
                                    "author": "Mallardshead",
                                    "score": 3,
                                    "created_utc": 1652997879.0,
                                    "response": "💯",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i99dxlc",
                            "author": "LordPrettyMax",
                            "score": 8,
                            "created_utc": 1653000953.0,
                            "response": "I’m a 13 year old kid that needs my wallet topped up tyvm",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i98u1tn",
                            "author": "bandoonparade",
                            "score": 3,
                            "created_utc": 1652991236.0,
                            "response": "I'll admit I'm also suspicious. His post history is also non-existent so it's impossible to check that. But also, 13 year olds shouldn't be investing without their parents so there's that.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9b0jt2",
                                    "author": "lachiegordon",
                                    "score": 3,
                                    "created_utc": 1653036690.0,
                                    "response": "Yeah everyone needs advise at this age and parents are first point of contact here, we have to ask them about futuristic technology like Block chain and crypto which is going to revolutionize our whole financial system",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i998bu5",
                            "author": "Ken-The-Gent",
                            "score": 2,
                            "created_utc": 1652998262.0,
                            "response": "You're probably talking to a bot",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i99rg50",
                                    "author": "Mallardshead",
                                    "score": 2,
                                    "created_utc": 1653007806.0,
                                    "response": "💯 Beep bop you guessed right! 🎉 As the first to have guessed this you win 10,000 Satoshis! Please leave a BTC address below!\n\n*I am a bot and this action was performed automatically. Please contact the moderators of this subreddit if you have questions.*",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i99wxzt",
                                            "author": "energetic-dad",
                                            "score": 2,
                                            "created_utc": 1653010505.0,
                                            "response": "Haha, you really think it's a bot? I believe it\n\nAlso,\n\n36EDj8YRJr6UVjWcmb3yuwGe3bbn5TWtA3",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i99zo2x",
                                                    "author": "Mallardshead",
                                                    "score": 1,
                                                    "created_utc": 1653011826.0,
                                                    "response": "Beep bop! 🎉 Tx ID:\n\n>d85a44c7b3544bd15501454d0443e068eaac34e33282a12cd5f0c29e9bcabf58\n\n*I am a bot and this action was performed automatically. Please contact the moderators of this subreddit if you have questions.*",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i99d164",
                            "author": "onedayatatime26",
                            "score": 2,
                            "created_utc": 1653000512.0,
                            "response": "Good catch",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i99tsx6",
                            "author": "FLYSPYS",
                            "score": 2,
                            "created_utc": 1653008974.0,
                            "response": "Yep. Original poster is full of shit",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i992q67",
                            "author": "Alea_Iacta_Est21",
                            "score": 1,
                            "created_utc": 1652995702.0,
                            "response": "This!",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i996zvp",
                            "author": "CryptoBehemoth",
                            "score": 1,
                            "created_utc": 1652997648.0,
                            "response": "Im also v noob",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9a074o",
                            "author": "rambo_alex",
                            "score": 1,
                            "created_utc": 1653012088.0,
                            "response": "Damn, you did everything I wanted to say, it was in my mind that how a 13 year old can invest in Bitcoin, because most of the exchange don't allow trading for the person under 18, even nin-KYC exchange are tough to find nowadays, hopefully he is telling lie or else we are late",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i98bnar",
                    "author": "HlIlM",
                    "score": 53,
                    "created_utc": 1652983698.0,
                    "response": "At 13, buy some fuel, gas up your lawnmower and hit the neighborhood",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i99c9fa",
                            "author": "Em4rtz",
                            "score": 2,
                            "created_utc": 1653000137.0,
                            "response": "At these gas prices he’ll get to hit like half of one yard lol",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i99gtpc",
                            "author": "llgiant",
                            "score": 1,
                            "created_utc": 1653002409.0,
                            "response": "Yeah that's what we all did at such a young age and this is the time to enjoy the life, investing is ok but you should not ruin your teenage here, we have still a long way to go in future, hopefully we will make it till the end and we all be having huge gains",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i992nta",
                    "author": "Alea_Iacta_Est21",
                    "score": 8,
                    "created_utc": 1652995672.0,
                    "response": "A 13 y/o didn’t write this. Period.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i989o0k",
                    "author": "WritingFun8769",
                    "score": 15,
                    "created_utc": 1652982888.0,
                    "response": "yes, you bought at a lower starting point than many people, including me. if you really want your investment to make a big difference in your future, you’ll need to invest far more. if your parents support you financially and are supportive of you buying bitcoin, try to shovel as much cash into it as you can while you’re young. maybe you’ll spend your teen years working and saving, but your 20’s will be that much better because of it. this is just my perspective, so do your own research and figure out a path forward that makes sense to you",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9b1lba",
                            "author": "jansenyong",
                            "score": 1,
                            "created_utc": 1653037560.0,
                            "response": "Yes, I agree if he starts investing at this age then his 20s would be so easy and he will be having enough money to do some higher degree courses, because education is very important in today's world so we can't ignore that part and trading will also run parallel to education",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i989wxs",
                            "author": "ErrorCode404__NoUser",
                            "score": 2,
                            "created_utc": 1652982990.0,
                            "response": "Alright thanks so much for the advice man.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i98kiqu",
                                    "author": "Worried-Taro2437",
                                    "score": 3,
                                    "created_utc": 1652987330.0,
                                    "response": "Well done. Keep it up and buy more. Also, as someone said, use the lawnmower to get more btc. And keep a low profile, and don't share your passion. You will get a lot of shit",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9b4swy",
                                            "author": "mrcraftert",
                                            "score": 1,
                                            "created_utc": 1653040053.0,
                                            "response": "Yeah and never share about investment as well because too many scammers are waiting here to get your money avoid them by huge margin or else you will also get doubts and uncertainty in future, so keep low and don't share your plans here",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i98ez6m",
                    "author": "bandoonparade",
                    "score": 9,
                    "created_utc": 1652985068.0,
                    "response": "Try in school. It's more important than you think.\n\nAlso, don't listen to advice from people on Reddit.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i99kc9n",
                            "author": "kate8106",
                            "score": 1,
                            "created_utc": 1653004188.0,
                            "response": "Yeah people on reddit will give rubbish advice like don't go to school, because there is not practical knowledge, but in reality having a degree in modern world is most important thing\n\nEven if you make losses in crypto you are still having a degrees for securing a job",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i98b8lt",
                    "author": "Vocem_Interiorem",
                    "score": 3,
                    "created_utc": 1652983530.0,
                    "response": "Do not spend money you can't miss.\nFor the rest of it, look at the value in a few years to see if it was worth it.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i98ttny",
                            "author": "lordsamadhi",
                            "score": 2,
                            "created_utc": 1652991142.0,
                            "response": "But what if Bitcoin IS your money?  Why would anyone invest in USD with their money when we know it's being debased at an extreme rate by our central banks?  No thanks, not spending my money on US dollars.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i989xl0",
                    "author": "Mister_VWP",
                    "score": 5,
                    "created_utc": 1652982997.0,
                    "response": "Yes well done.\nJust dont ivest what you cant afford to lose",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9akf6z",
                            "author": "ianfranklin",
                            "score": 3,
                            "created_utc": 1653023510.0,
                            "response": "That's the first advice we all give to the newbie who start investing in Bitcoin early and it's absolutely true, and second thing is don't tell your friends about the investment because it would not be a good scene in future",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i98su7q",
                    "author": "vmalarcon",
                    "score": 2,
                    "created_utc": 1652990734.0,
                    "response": "The best time was 10 years ago. The second best time is today.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i998vzn",
                    "author": "UncagedAngel19",
                    "score": 2,
                    "created_utc": 1652998526.0,
                    "response": "Somethings a little suspicious",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i98b19c",
                    "author": "Flashy-Currency173",
                    "score": 1,
                    "created_utc": 1652983446.0,
                    "response": "Maybe at the end of next year, you may have approximately $15… and please learn to DCA for Christ’s sake",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9a01dk",
                            "author": "thfrey63",
                            "score": 1,
                            "created_utc": 1653012010.0,
                            "response": "Yeah and 10$ is not a small amount for 13 year old kid he can make much more from here all he need is proper guidance and skills that he should learn from different people, his experience will matter most when he starts getting higher education",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i98r76f",
                    "author": "Lazy-Substance-5161",
                    "score": 1,
                    "created_utc": 1652990063.0,
                    "response": "This kid is way ahead of his age",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9aycaf",
                            "author": "dguhl",
                            "score": 1,
                            "created_utc": 1653034697.0,
                            "response": "Yeah and that's where it is raising doubt because buying a Bitcoin through an exchange is big thing and not everyone can do it, but if he is really thirteen and want to make profits then it should be appreciated more",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i989nzw",
                    "author": "mannymoes2k",
                    "score": 1,
                    "created_utc": 1652982887.0,
                    "response": "Great time. Keep buying when you can.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i98ar68",
                    "author": "SkipAndGo",
                    "score": 1,
                    "created_utc": 1652983330.0,
                    "response": "10 dollars in bitcoin 12 years ago would have you about half a billion dollars these days. You will not get that same returns these days but it will go up and if you keep layering in money, someday you will be better off.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9azazj",
                            "author": "woaidc",
                            "score": 5,
                            "created_utc": 1653035566.0,
                            "response": "Yeah steady pace is always better than one week pump and I am hundred percent sure that he will get better return in crypto as compared to stock market, we should see the volatility in market as well and risk factor as well",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i98xloy",
                    "author": "Romsel87",
                    "score": 1,
                    "created_utc": 1652993376.0,
                    "response": "A great time. Waiting is wasting your time. Accumulate dat coin.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i99c6uq",
                    "author": "GreenStretch",
                    "score": 1,
                    "created_utc": 1653000102.0,
                    "response": "Yes, it's a good time, cheaper than it has been for most of this cycle.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i99d4ny",
                    "author": "onedayatatime26",
                    "score": 1,
                    "created_utc": 1653000558.0,
                    "response": "Karma farmer!!!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i99daza",
                    "author": "Ernest-Everhard42",
                    "score": 1,
                    "created_utc": 1653000643.0,
                    "response": "I’m 13 too!! 13 beers down!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i99dcww",
                    "author": "chente08",
                    "score": 1,
                    "created_utc": 1653000669.0,
                    "response": "troll",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i99dr02",
                    "author": "XXsforEyes",
                    "score": 1,
                    "created_utc": 1653000862.0,
                    "response": "name checks out",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i99e509",
                    "author": "Glitchykins8",
                    "score": 1,
                    "created_utc": 1653001057.0,
                    "response": "Pretty sus you are 13. How many people have given you free coin cuz they think you are an adorable kid getting an early leg up in life?\n\nNow on the off chance you are a smol babe, (I got stock from my grandmother when I was 8 and it made me curious so I actually got into it and was learning and my middle school a few years later actually made my class for 2 months on and off do some stock learning and had us keep track of specific stocks)\n\nThen yeah, this is an alright time to get some (however you managed to do that)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i99fwq2",
                    "author": "MattLDempsey",
                    "score": 1,
                    "created_utc": 1653001945.0,
                    "response": "Good sake, next time buy it yesterday",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i99i4yb",
                    "author": "Primary-Ad-9842",
                    "score": 1,
                    "created_utc": 1653003074.0,
                    "response": "This isn't a real person the same post is popping up different places with a different age. One said a 4 year old lol",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i99jc6w",
                    "author": "CutFabulous1178",
                    "score": 1,
                    "created_utc": 1653003681.0,
                    "response": "The right question would be, What was BTC price 3-4 years ago?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i99jwhl",
                    "author": "green9206",
                    "score": 1,
                    "created_utc": 1653003965.0,
                    "response": "Huge mistake. You could have ordered a large pizza instead.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i99oa79",
                    "author": "ColdFusion3456",
                    "score": 1,
                    "created_utc": 1653006207.0,
                    "response": "How much you pay in fees like 10 more dollars?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i99ow44",
                    "author": "Awtz09",
                    "score": 1,
                    "created_utc": 1653006518.0,
                    "response": "Sound sus!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i99qwsv",
                    "author": "horsecyack",
                    "score": 1,
                    "created_utc": 1653007539.0,
                    "response": "Cut grass for coin",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i99vls9",
                    "author": "coreysmiles",
                    "score": 1,
                    "created_utc": 1653009858.0,
                    "response": "The fuck else you gonna do with $10 dollars?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9af5m0",
                    "author": "RandomTask100",
                    "score": 1,
                    "created_utc": 1653020086.0,
                    "response": "I was just thinking the same thing!!! I'm 4 years old and I just bought MY first bitcoin. I had $1 in my debit card so I set up an exchange account and bought some sats. Did I do bad?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ah447",
                    "author": "deadweight999",
                    "score": 1,
                    "created_utc": 1653021305.0,
                    "response": "I keep seeing these and the age changes each time. Clearly a multidimensional event has occurred. There is no other explanation.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i98l27j",
                    "author": "daBiggaFigga",
                    "score": -1,
                    "created_utc": 1652987550.0,
                    "response": "Welcome. Congrats!!!!!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i98otg4",
                    "author": "Master-of-the-rolls",
                    "score": -1,
                    "created_utc": 1652989082.0,
                    "response": "Very good job at your age, kid. Bitcoin is a great opportunity for you to build your wealth, and I think you’ll be pleasantly surprised in two years and some change from now if you start stacking sats now.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9am9z9",
                            "author": "etfche",
                            "score": 1,
                            "created_utc": 1653024820.0,
                            "response": "Yeah and in upcoming years we will see the rise of Bitcoin as well that will be the time when people will get rich and most of us would have attained financial freedom for long term",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i98hqhi",
                    "author": "Ok_Aerie3546",
                    "score": 0,
                    "created_utc": 1652986196.0,
                    "response": "You are 13 and on the right path. What I would suggest is:\n\n- Dont think of Bitcoin as a way of making money. Think of it as Saving money.\n- Whenever you get some money from your parents as a gift, or you get an amazon gift card from relatives, or birthday money. Try to trade those with your parents for money in your bank account and then buy bitcoin with it.\n- Know that, everytime you decide to not spend the money and instead buy bitcoin, you are gifting much more money to your future self.\n- Even if the price goes up and down, dont look at it. In the future when you need money for college or need to help your loved ones with something important, thats when you can access this bitcoin as per needed.\n- its not about making money, its about having financial security in the future.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ahrb4",
                            "author": "norrismasters",
                            "score": 1,
                            "created_utc": 1653021715.0,
                            "response": "That's a better advise and I would also say that don't keep Bitcoin only in \"investment class\", because there are many other ways to use Bitcoin, even for transaction at some places we should use Bitcoin it can also increase the adoption of Bitcoin in whole world",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9ai5yw",
                                    "author": "Ok_Aerie3546",
                                    "score": 1,
                                    "created_utc": 1653021979.0,
                                    "response": "Seriously not needed. Just budget properly, spend dollars and buy bitcoin with the rest.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9951zl",
                    "author": "26oclock",
                    "score": 0,
                    "created_utc": 1652996764.0,
                    "response": "Do not waste time looking at the chart or screen to monitor your investment. Go work on your career instead and look at the people around and take care of them. Come back if you have twice as much as your previous investment and put that in again. Repeat.\n\nThen you have done everything right.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9acngv",
                            "author": "sja1211",
                            "score": 1,
                            "created_utc": 1653018585.0,
                            "response": "Yeah at this age investment should be there but it should not be priority you should complete your full education first, then we can look into depth at this age we should focus on our skills and trading skills can also be gained at this age, we have enough time to get financial freedom",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i996o56",
                    "author": "mike4score",
                    "score": 0,
                    "created_utc": 1652997502.0,
                    "response": "Dude… Investing is not a good way to get income, it’s a way to keep money after you already have it.  You need to focus on getting grades which lead to a good job which lead to good income, only then should you think about investing",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i99rrdh",
                            "author": "Wilhonator",
                            "score": 2,
                            "created_utc": 1653007962.0,
                            "response": "Yeah first he should focus on getting and having some skills trading skill will come with time and experience but getting basic education should be too priority, and we should focus on personal skills which a person can gain from investing in different things",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}