{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uqb2s2",
            "title": "Did Satoshi mine all of his coins? If so, does this mean bitcoin had no 'premine'?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/uqb2s2/did_satoshi_mine_all_of_his_coins_if_so_does_this/",
            "author": "PeleMaradona",
            "created_utc": 1652636058.0,
            "score": 5,
            "num_comments": 6,
            "subreddit": "BitcoinBeginners",
            "selftext": "Two part question. I guess part of is trying to get at what the meaning of 'premine' really is.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8q7die",
                    "author": "bitusher",
                    "score": 15,
                    "created_utc": 1652641182.0,
                    "response": "Any one suggested that Satoshi Premined anything is being extremely dishonest because :\n\n1) We only know of 2 blocks satoshi mined , genesis and block 9 \n\n2) There were multiple early miners that started mining from the beginning like \n\nhttps://stephanlivera.com/episode/314/\n\nhttps://twitter.com/halfin/status/1110302988\n\n3) Satoshi encoded in the genesis block a title from the front page of the newspaper to prove it was created that day - \"The Times 03/Jan/2009 Chancellor on brink of second bailout for banks\"\n\n4) Satoshi announced Bitcoin and released the code before creating the genesis block\n\n5) Satoshi waited 5 days after the genesis block was created for other miners to start mining \n\n6) The 50 BTC in the genesis block is unspendable the way bitcoin is designed \n\n7) If we are to trust the pataoshi pattern the slope of the pattern only matches with 11 other blocks with block 9 that satoshi mined",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8pycf1",
                    "author": "igadjeed",
                    "score": 9,
                    "created_utc": 1652637199.0,
                    "response": "What does \"all his coins\" mean? As far as we know Satoshi mined one block (block #9) and mined the genesis block (the reward is unspendable)  \n\nA premine occurs when mining and the network are active before the general public is able to connect to the network. The coin is announced after many blocks have already been mined by the founder and other insiders",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8r8q39",
                            "author": "greenappletree",
                            "score": 1,
                            "created_utc": 1652658048.0,
                            "response": "That is super interesting- can u elaborate on block 9? How are people certain it was him? I also read somewhere that they were trying to match the hashing rate to the first genesis block and found a few hundred - is that also BS?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8ral7o",
                                    "author": "nullama",
                                    "score": 1,
                                    "created_utc": 1652658974.0,
                                    "response": "Because we know Satoshi sent 10BTC to Hal Finney for testing purposes (it was the first transaction)",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8pxmhd",
                    "author": "CoinCorner_Sam",
                    "score": 10,
                    "created_utc": 1652636883.0,
                    "response": "Satoshi's coins is just another myth. People are just guessing what coins he mined and what coins were mined by many others.\n\nYes, Bitcoin had no premine. Even if Satoshi mined, he mined alongside other people who joined the network. Some people like Hal Finney, disconnected later because the fan got too noisy. But again, everyone was free to join and leave.\n\nPremine means unfair - the creator gives chance to nobody and creates the coins without paying for the energy like the rest of the miners. Similar what (for example) Vitalik did when he created 72 million coins for free and let the miners to work on the other 40 million over the years.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8pvpy4",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1652636059.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}