{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uzwrcx",
            "title": "starting",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uzwrcx/starting/",
            "author": "duropastiersky",
            "created_utc": 1653773953.0,
            "score": 2,
            "num_comments": 0,
            "subreddit": "Bitcoin",
            "selftext": "Is this the best time to buy?",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uzwfyy",
            "title": "Too many individuals, hedge funds, politicans and investors still conflate bitcoin with an investment.",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uzwfyy/too_many_individuals_hedge_funds_politicans_and/",
            "author": "slvbtc",
            "created_utc": 1653772913.0,
            "score": 96,
            "num_comments": 60,
            "subreddit": "Bitcoin",
            "selftext": "Every talking head complains bitcoin doesnt produce an income or provide a yield. Warren Buffet even saying its worthless because it cant mail him a check. But these same people turn around and say cash is king and you should always have cash in emergencies.\n\nThey think bitcoin is trying to be some kind new asset or investment. Its not, its replacing cash. In fact cash is trash, bitcoin is the superior form of cash free from inflation.\n\nThey cant get past this paradigm because bitcoin is volatile against fiat. They dont understand how fragile our current monetary system is therefore cannot ever see a day bitcoin becomes the denominator. But one day soon as inflation gets out of control, fiat becomes unstable and supermarkets everywhere accept lightning invoices things will start naturally being priced in sats out of convenience.\n\nBitcoin isnt an investment it is money, it is what you hold when you dont want to be invested in the markets, it is what you hold in emergencies, it is what you save for your future.\n\nCash is not king, Bitcoin is king.",
            "stickied": false,
            "comments": [
                {
                    "id": "iaczum2",
                    "author": "BitcoinUser263895",
                    "score": 30,
                    "created_utc": 1653775448.0,
                    "response": "> Its not, its replacing cash.\n\nHalvening was designed to utilise human greed to drive Bitcoin adoption.\n\nYou don't replace cash without greed.\n\nIt's all by Satoshi's design. Deal with it.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iad5zp2",
                            "author": "TheChoosey1",
                            "score": 9,
                            "created_utc": 1653778462.0,
                            "response": "Fine. I'm just go ahead and get rich then if that's what I have to do.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iadexqn",
                                    "author": "ghostofpablo",
                                    "score": 3,
                                    "created_utc": 1653783176.0,
                                    "response": "Fine!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "iads7v3",
                            "author": "Days_of_Static",
                            "score": 2,
                            "created_utc": 1653790569.0,
                            "response": "Exactly. There would be no BTC adoption if it didn’t trend higher in fiat valuation over time.\n\nThe libertarian Bitcoin maximalist sermon is great and all, but I’m just as interested in leaving my current day job in the next few years as I am in replacing fiat currencies globally.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iae2ljw",
                                    "author": "Keith_Kong",
                                    "score": 2,
                                    "created_utc": 1653796816.0,
                                    "response": "That greed is the mechanism by which adoption is incentivized. It doesn’t negate the Austrian Economic perspective. Most would frame it as “an investment in Bitcoin becoming money in the future.”\n\nAll you non-believers get pulled into their movement by the profit motive generated from adoption. It’s brilliant 😂",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iad548t",
                    "author": "squareOfTwo",
                    "score": 21,
                    "created_utc": 1653778022.0,
                    "response": "Do you really think that the dinosaur called Warren Buffet doesn't know what money is?\n\nHe is to close to the USD money printer, that's all. [https://www.youtube.com/watch?v=VTuRT\\_mR0KU](https://www.youtube.com/watch?v=VTuRT_mR0KU)\n\nJust don't listen to dinosaurs, they won't tell you that an asteroid is comming wiping them out.\n\nIt's all just manipulation just like what the people of the FED, IWF, etc. are doing. They are fucking evil and the problem.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaefyoe",
                            "author": "Jacobgraham1738",
                            "score": 1,
                            "created_utc": 1653806587.0,
                            "response": "Trader university has some great btc info would recommend checking out his videos",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iaeqqon",
                            "author": "abbman2121",
                            "score": 1,
                            "created_utc": 1653816128.0,
                            "response": "i used to think that but i don't anymore, and my reasoning is this, warren buffet knows our financial ecosystem is fragile, he knows how to evaluate monetary systems, he understands conceptually what money is, im of the viewpoint he has to play devils advocate, a blind man could see money has more latency then bitcoin, but the issue is 2/5 people above the age of 60 don't have the internet, bitcoin isn't in their lexicon let alone their frame of reference, while buffet may not understand bitcoins inner machinations or have fully understood the white paper etc., nor has he grown up in a digital society, he's not stupid enough to think our generation hasn't grown up in a digital society, he's watched it happen, so again a lot of wisdom comes from buffet about the meaning of life, but generationally speaking a lot is lost in translation because we don't tend to imagine the life he has lived or in consequence, watching the various technological advancements take place, i mean the dude was in his early mid thirties before the arpanet, let alone the internet",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iadkato",
                    "author": "50EMA",
                    "score": 5,
                    "created_utc": 1653786123.0,
                    "response": "It IS an investment when you buy Bitcoin to make money. That’s what most people buy it for. Few people buy it because it’s better than cash because it’s simply far less practical than cash in every way (currently, maybe not in the future; don’t downvote me) except when you are trying to transact illegally or avoid chargeback fraud—which I think are two of the most common reasons Bitcoin is used for transactions.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iad714u",
                    "author": "learner77",
                    "score": 5,
                    "created_utc": 1653778982.0,
                    "response": "The value of bitcoin fluctuates WAY too much (at least for now) to be useful as a replacement for cash.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iadjbtn",
                            "author": "necroscope0",
                            "score": 1,
                            "created_utc": 1653785584.0,
                            "response": "Value of Bitcoin was set at its creation.  Price is just the process for the world to discover that value.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iadipbr",
                            "author": "JeremyLinForever",
                            "score": -1,
                            "created_utc": 1653785239.0,
                            "response": "False. The value of Bitcoin is exactly what the value of the amount purchased is. The price of cash used to purchase it fluctuates I. Purchasing power to buy it constantly.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iae2rej",
                                    "author": "perfect5-7-with-rice",
                                    "score": 2,
                                    "created_utc": 1653796922.0,
                                    "response": "If you think bitcoin's less volatile than cash, you're delusional",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iae3hu5",
                                            "author": "JeremyLinForever",
                                            "score": 1,
                                            "created_utc": 1653797407.0,
                                            "response": "Please read the other post I made.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iae7gmj",
                                                    "author": "perfect5-7-with-rice",
                                                    "score": 3,
                                                    "created_utc": 1653800057.0,
                                                    "response": "I did. Cash to gold is less volatile than Bitcoin to gold. You can find the same with every other asset for any time period in the past 5 years.\n\nIf your argument is \"in the long run...\" I agree with you but that's not what volatility means",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "iadjins",
                                    "author": "learner77",
                                    "score": 2,
                                    "created_utc": 1653785688.0,
                                    "response": "Ok, say you are hiring a new employee today. What is his/her yearly  salary in bitcoin? say bitcoin/dollar exchange rate doubles next month - you just screwed yourself, since 99.9% of products and services trade in dollars (assuming we’re talking about the US)",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iae3g2x",
                                            "author": "JeremyLinForever",
                                            "score": 0,
                                            "created_utc": 1653797375.0,
                                            "response": "You know what the absolute saddest thing is? This can be said exactly the same, except replace it with USD compared to other country currencies. I don’t think you realize the US has been screwing other countries since they become a world reserve currency. That’s why Bitcoin needs to be a decentralized global reserve CURRENCY. Will it be the one people use to hire a new employee? No. (They will be using their own country’s currency) However, central banks and all collective countries will use Bitcoin to keep reserves and peg their currency to it.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iaeth7x",
                                                    "author": "Academic_Forever_587",
                                                    "score": 1,
                                                    "created_utc": 1653818623.0,
                                                    "response": "Serious question for the sake of getting a pov about it, why would other countries peg their currency value to BTC? As far as I understand right now the value of currencies is peg to the confidence, the production power of a country and the assets it has, based in this you are saying people should replace all this for just confidence in bitcoin?",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "iaddfvj",
                            "author": "0x1a3c3e7",
                            "score": 0,
                            "created_utc": 1653782366.0,
                            "response": "Merchants can avoid volatility by using payment processors to instantly exchange bitcoins for fiat at the spot price.\n\nVolatility exists because nothing is priced in Bitcoin.  As soon as any basic necessity or commodity is priced in bitcoin, especially oil, the price will stabilize.\n\nOnce bitcoin becomes ubiquitous, merchants won't need payment processors to mediate the exchange for fiat, because they won't need fiat.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iadga8k",
                                    "author": "learner77",
                                    "score": 5,
                                    "created_utc": 1653783900.0,
                                    "response": "Sure, they CAN but then Why not just accept credit cards?\n\nalso seems like a bit of a chicken and egg problem: volatilty because nothing priced in bitcoin, can’t price things in bitcoin because it’s too volatile.\n\nI just don’t see that Bitcoin is that much better than what we have now, for everyday transactions. I mean the metric system is WAY better than the imperial system, but the US refuses to switch (even after the government mandating that all school kids learn it in the late 70’s.).",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iadoz8h",
                                            "author": "nn_marbas",
                                            "score": 1,
                                            "created_utc": 1653788722.0,
                                            "response": "The early bitcoiners, aka us, need to bootstrap the process with conviction and idealism.  Once critical mass is achieved the new money standard becomes self sustaining.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "iadhk5e",
                                            "author": "0x1a3c3e7",
                                            "score": -1,
                                            "created_utc": 1653784602.0,
                                            "response": ">Sure, they CAN but then Why not just accept credit cards?\n\nBitcoin is cheaper than credit cards.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iadir1i",
                                                    "author": "learner77",
                                                    "score": 3,
                                                    "created_utc": 1653785266.0,
                                                    "response": "Sure, but is the difference great enough that it’s “worth it” for merchants to do both?And what’s the advantage for consumers? I mean the gas station down the street charges less for cash purchases than credit, and I still use credit. And most merchants don’t even give a lower price for cash… so it’s not like it would be cheaper for me to pay in bitcoin (plus, I don’t have to pay my credit card bill for 30 days, whereas bitcoin transactions come out of my account/wallet immediately, and now I have the extra steps of converting to/from bitcoin)",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iadkji4",
                                                            "author": "0x1a3c3e7",
                                                            "score": 1,
                                                            "created_utc": 1653786257.0,
                                                            "response": "Right now, it's at least worth it as a marketing gimmick.  Bitcoin is very popular, so accepting Bitcoin will draw in consumers who are impressed by it. There is also no risk of chargebacks.\n\nThe advantage for consumers is that Bitcoin doesn't need a bank to be secure.  You can carry your virtual coins in a hard wallet like cash.  But, unlike cash, losing or damaging your wallet doesn't mean losing your bitcoins, as long as you keep a backup.  That means no account fees, no overdraw fees, no frozen accounts, and no confiscations by government agencies violating your right to due process based on nothing but flimsy hunches, political agendas, or social credit.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "iadlizg",
                                                                    "author": "learner77",
                                                                    "score": 3,
                                                                    "created_utc": 1653786804.0,
                                                                    "response": "I dunno, I think I get a lot of security features from my bank and credit cards.\n\nhaving to make backups seems like a major PITA. Most people don’t even back up their computers.\n\nplus, with bitcoin my purchasing power goes up and down (sometimes quite a bit) day to day or even hour to hour. Like merchants, do I need to constantly convert from fiat to bitcoin and back to have relatively stable purchasing power (Talking days/weeks)?\n\n&#x200B;\n\ndon’t get me wrong, I see that bitcoin has some advantages, but it also has a lot of disadvantage. I really just don’t see converting to bitcoin to be that compelling, for consumers OR merchants.\n\n&#x200B;\n\nalso seems most people (at least on this subreddit) are just hodling with dreams of accumulating wealth, and have zero intention of using bitcoin for everyday transactions.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "iae6gka",
                                                                            "author": "0x1a3c3e7",
                                                                            "score": 0,
                                                                            "created_utc": 1653799374.0,
                                                                            "response": "Your credit cards are what cause inflation, but if that doesn't bother you, keep right on using them and just ignore what everyone else is doing with Bitcoin.  No big deal.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iaczb30",
                    "author": "deepoak40965",
                    "score": 6,
                    "created_utc": 1653775188.0,
                    "response": "Purchasing BTC is an investment, it’s just a non-traditional investment in a groundbreaking software technology network that also produces a hard asset (the coin itself).  I feel like many people become wholly focused on the coin itself and overlook the value of the revolutionary accounting system (network) that it belongs to and operates on. \n\nIt doesn’t make sense to people who can only see the traditional investment and legacy asset channels.  In the same vein that it always takes the masses time to recognize, appreciate and accept any new and disruptive technology that offsets legacy mediums.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iad56vy",
                    "author": "Spl00ky",
                    "score": 5,
                    "created_utc": 1653778059.0,
                    "response": "If you buy bitcoin with fiat money and expect the price of it to go, then it is an investment. It's not replacing cash any time soon given that you still have to spend fiat to buy bitcoin. No one would spend their bitcoin if they bought it with fiat money and then saw it drop in value right after.\n\nIf you think it is money, let's see your bitcoin spending habits. Otherwise, you just say this to get other people to spend theirs while you HODL. Moreover, spending bitcoin is a taxable event.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iadzfej",
                    "author": "Random_Ad",
                    "score": 2,
                    "created_utc": 1653794795.0,
                    "response": "If you’re saving it for the future then it is in a way an investment. Furthermore why are people buying Bitcoin? To make money in the hope the value of its against fiat increase which in turn basically makes it an investment. Also if the USD crashes you have bigger problem than fiat, that’s essentially destroys the government which makes even btc useless. Why would btc have any value when society has ended?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iacvx0w",
                    "author": "Psylux707",
                    "score": 5,
                    "created_utc": 1653773663.0,
                    "response": "Munger believes the USD will fail in the next 100 years.  Since they understand how frail our current monetary system is, it's madness they can't see the value/utility of Bitcoin",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iadwnms",
                            "author": "Socialists-Suck",
                            "score": 3,
                            "created_utc": 1653793133.0,
                            "response": "The lifespan of the longest fiat currency since 1450 was Spain (1530-1640) at 110 years.  If the US reserve note lasts for two more years it will be the oldest (1913-2024) at 111.  The odds of   Munger being right is fairly certain.   The total number of world reserve currencies since 1450 is 6.  The life range is 80-110 years.  Based on this there is a lot less than 100 years left.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iad51hd",
                            "author": "ICUpikachu",
                            "score": -1,
                            "created_utc": 1653777982.0,
                            "response": "If USD fails in 100 years then thats kind of pointless to own bitcoin now huh?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iad68ct",
                                    "author": "TheChoosey1",
                                    "score": 6,
                                    "created_utc": 1653778585.0,
                                    "response": "Do they pay you to be this stupid?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iad7182",
                                            "author": "ICUpikachu",
                                            "score": 12,
                                            "created_utc": 1653778983.0,
                                            "response": "Unfortunately no",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "iadb70l",
                                    "author": "JustSomeDudeStanding",
                                    "score": 2,
                                    "created_utc": 1653781165.0,
                                    "response": "You’re missing /s",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "iadxejd",
                                    "author": "Socialists-Suck",
                                    "score": 2,
                                    "created_utc": 1653793568.0,
                                    "response": "Depends on what the purchasing power of the USD is versus Bitcoin.  At 20% increased inflation every year the purchasing power of the USD is reduced 50% every 3.5 years.  The inflation rate of Bitcoin is reduced 50% every 4 years.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iaddbsd",
                    "author": "Mediocre_Piccolo8542",
                    "score": 2,
                    "created_utc": 1653782305.0,
                    "response": "Historically, they are right and you wrong. BTC was so far a great investment, as a cash it didn’t work so well - high fees and slow, ln has downsides. People in Venezuela etc tried to use BTC as cash before most kids with laser eyes profiles opened their first wallet, but stopped once fees exploded. Besides, nobody will use “cash” which is overall increasing in value to buy anything, inflating fiat is the preferred way",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaepgg4",
                            "author": "wattzson",
                            "score": 1,
                            "created_utc": 1653814975.0,
                            "response": "\"Historically\" \n\nBitcoin is less than 20 years old, do you honestly think a new form of global currency can prove itself so quickly?  What a joke.  It's far to soon for that.  How irresponsible would it be for governments or other important parties to begin using a new digital currency that has only been around 13 years?  That's absurd, immature thinking.\n\nHistory doesn't even fucking apply to bitcoin yet.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iad05pn",
                    "author": "GranPino",
                    "score": -4,
                    "created_utc": 1653775594.0,
                    "response": "Bitcoin is cash???? That’s what the original paper says. But nobody uses it like cash because it’s impossible. It doesn’t have the transactions available. And LN has its issues including lack of adoption. And it still requires transactions in the blockchain to move funds so it’s also limited to be used as global cash. \n\nBitcoin is an investment. Cash??? I can’t believe it someone is upvoted saying this.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iacuxt3",
                    "author": "Mister_VWP",
                    "score": 1,
                    "created_utc": 1653773206.0,
                    "response": "Daddy bitcoin is indeed the King",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iacw7ke",
                    "author": "Ima_Wreckyou",
                    "score": 1,
                    "created_utc": 1653773785.0,
                    "response": "Exactamundo",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaczf2y",
                    "author": "AdministrativeJob232",
                    "score": 1,
                    "created_utc": 1653775241.0,
                    "response": "This is the way",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iae5jjh",
                    "author": "BigRyanG",
                    "score": 1,
                    "created_utc": 1653798757.0,
                    "response": "Bitcoin will not replace cash anytime soon and this is coming from a bitcoiner.  No way it replaces the US dollar anytime soon if ever",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iadim7z",
                    "author": "d-redze",
                    "score": 1,
                    "created_utc": 1653785191.0,
                    "response": "Calming people like buffet don’t understand the monetary system is not the stance id take. Infact I think they understand it very well and know how they can benefit from it. They don’t understand how to benefit from fair money so of course they are against changing the system that enriched them at the cost of others.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iadjhpd",
                    "author": "esotericunicornz",
                    "score": 1,
                    "created_utc": 1653785673.0,
                    "response": "All people who haven’t done the work to understand the paradigm shift we are watching unfold before us.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iadkfe2",
                    "author": "putyograsseson",
                    "score": 1,
                    "created_utc": 1653786194.0,
                    "response": "https://www.epsilontheory.com/in-praise-of-bitcoin/",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iadohvn",
                    "author": "Dullfig",
                    "score": 1,
                    "created_utc": 1653788453.0,
                    "response": "Because they want to regulate it as an investment.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iadrz1b",
                    "author": "itesasecret",
                    "score": 1,
                    "created_utc": 1653790429.0,
                    "response": "It's a guess and an investment buddy- but I'm glad you found something you can buy that makes you feel special along with all the other special people in this sub lol",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iadxd9d",
                    "author": "FutureNotBleak",
                    "score": 1,
                    "created_utc": 1653793547.0,
                    "response": "Bitcoin is savings, true savings. \n\nBitcoin is also the only true pricing mechanism humanity has ever invented.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iadzo96",
                    "author": "Linkaiser",
                    "score": 1,
                    "created_utc": 1653794949.0,
                    "response": "*\\*They dont understand how fragile our current monetary system is therefore cannot ever see a day bitcoin becomes the denominator.\\**\n\nThey understand it far better than you, me, or the vast majority of the world. They just don't share our view, that is a very different thing. Anyone who legit thinks they are smarter than the big players is in for a rude awakening.\n\nThat being said, Bitcoin cannot replace cash unless it has some other value tied to it. Things just need a comparable value, even if you want to trade chickens you need a comparative value to what is worth a chicken. \n\nI honestly doubt that Bitcoin will ever reach the point of mass adoption and money replacement. I believe, however, that it will have mass adoption and you'll be able to buy your groceries with it, or pay for your hotel stay in Argentina with it, or pay for your dinner in Tokyo with it, or pay for your train ticket in Europe with it -- without having to worry about what currency is used wherever you are making the purchase. But... Replace cash or the current financial system? That's not happening.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iae2jyv",
                    "author": "perfect5-7-with-rice",
                    "score": 1,
                    "created_utc": 1653796789.0,
                    "response": "Most \"investments\" are really inflation hedges with some risk for fun",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaeav7e",
                    "author": "Responsible_Falcon_7",
                    "score": 1,
                    "created_utc": 1653802531.0,
                    "response": "Hedgies are fuk",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaed5f7",
                    "author": "vinniethecrook",
                    "score": 1,
                    "created_utc": 1653804280.0,
                    "response": "In the end, it’s gonna have to be inflationary to encourage spending. You can’t encourage spending if people treat the asset as an investment. So until people think it will grow in value, it won’t be cash. (I’m talking about anything more than forex volatility).",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaeph89",
                    "author": "wattzson",
                    "score": 1,
                    "created_utc": 1653814995.0,
                    "response": "One of the smartest posts I've seen in awhile",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaeryp4",
                    "author": "jensmeinsohn",
                    "score": 1,
                    "created_utc": 1653817251.0,
                    "response": "Everyday the same speech…",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaeue1p",
                    "author": "Quantris",
                    "score": 1,
                    "created_utc": 1653819427.0,
                    "response": "In general you shouldn't assume talking heads say things because they believe them. They say them because they want others to believe them (well actually usually because whoever pays them wants that).",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iadci6t",
                    "author": "L0ckeandDemosthenes",
                    "score": 0,
                    "created_utc": 1653781857.0,
                    "response": "Why does everything have to make you money, sometimes in this qorld and economy it's nice being able to trust that ot won't lose you money. And if there is mass adoption then this will be the case and the security the world deserves out of a currency. It will level the playing field across the world... countries are welcome to still devalue their own monetary paper just leave the citizens out of your scam.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uzwqan",
            "title": "Brandon Quittem: Bitcoin and The Rythms of History (greatest piece to date)",
            "url": "https://open.spotify.com/episode/6E6fOILs3xdjmPpOr0Nvlk?si=tSA2jM1iQpadwgduWxc-wA&utm_source=copy-link",
            "author": "5liveR",
            "created_utc": 1653773862.0,
            "score": 15,
            "num_comments": 2,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "iacwlrs",
                    "author": "5liveR",
                    "score": 3,
                    "created_utc": 1653773959.0,
                    "response": "Brandon Quittem: Btc and the Rythms of History \n\nthe greatest piece I've listened to date, and I've been years obsessed with this whole mess going on. In case you haven't, I'd recommend anyone listen/read to understand what is happening and what this means for us bitcoiners.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}