{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "v1nv3i",
            "title": "how wallets find my addresses?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/v1nv3i/how_wallets_find_my_addresses/",
            "author": "vitalyevodin",
            "created_utc": 1653995677.0,
            "score": 2,
            "num_comments": 8,
            "subreddit": "BitcoinBeginners",
            "selftext": "One private key can have infinitive amount of public address.\nlet say I have 100000 addresses with 0.01-0.001 BTC on it\n\nI have my seed then how after I imported my private key to let’s say to Ledger wallet how does it find my all addresses and total balance ? \n\nas I can guess it just looks all bitcoin wallets and check it over my private key ?",
            "stickied": false,
            "comments": [
                {
                    "id": "ianfiol",
                    "author": "bitusher",
                    "score": 3,
                    "created_utc": 1653996241.0,
                    "response": ">One private key can have infinitive amount of public address.\n\nOne private key per one public key per one address \n\nI think you are referring to the Master extended private key and master extended public key that can create many private and bublic keys \n\nMost wallets use hierarchical deterministic (HD) key derivation after bip32.\n\nThis means you have \n\n**Backup Seed words (BIP 39 or other)** consisting of 12-24 words that can than recover \n\n**Master extended private key (xpriv,ypriv,zpriv)** Which can generate many private keys \n\n**Master extended public key(xpub,ypub,zpub)** Which can generate many public keys \n\nAs of which from the public keys many Bitcoin addresses can be derived from. \n\n-------------------\n\n>let say I have 100000 addresses with 0.01-0.001 BTC on it\n\nThis is an unusual amount of UTXOs but ok ...\n\n>I imported my private key to let’s say to Ledger wallet \n\nAre you importing your bip39 backup seed words or an obsolete paper wallet with a single private key? If its the seed words than you can read the explanation above and than the wallet will use the public keys to lookup all addresses on the public blockchain to check for all balances",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iang4et",
                            "author": "vitalyevodin",
                            "score": 2,
                            "created_utc": 1653996654.0,
                            "response": "maybe I messed up with terminology \n\nso in example I have a Ledger wallet and it generates new address each time I receive BTC (I can use the same address but let’s say I use different address each time I receive anything)\n\nIt means that I will have such amount addresses equal amount of time I received BTC\n\nthen I decided to restore my seed on another wallet and import my seed and it shows by actual balance after syncing",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iangm8e",
                                    "author": "bitusher",
                                    "score": 2,
                                    "created_utc": 1653996987.0,
                                    "response": "the seed recreates your Master extended private key and Master extended public key which than can recreate all your public keys and addresses for your wallet to look up your balances on the public blockchain",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iangzpj",
                                            "author": "vitalyevodin",
                                            "score": 2,
                                            "created_utc": 1653997236.0,
                                            "response": "how wallet knows that I had in example exact 268 public keys generated by this master public key with address and balances on it",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ianigmb",
                                                    "author": "Shield4SI",
                                                    "score": 1,
                                                    "created_utc": 1653998186.0,
                                                    "response": "A new wallets that has your seed phrase will scan the blockchain to find any unspent UTXOs associated with your address.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "ianiu5u",
                                                    "author": "Rannasha",
                                                    "score": 1,
                                                    "created_utc": 1653998423.0,
                                                    "response": "The addresses are always generated in the same order. So the wallet software just starts by generating the first one, then queries the blockchain for its balance, and then moves to the next. It repeats this until it finds a number of consecutive addresses that have no transaction history (in most software the default is 20, but can be configured). At that point it assumes that it has reached the end and stops.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ianepon",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653995677.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}