{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uwjjw4",
            "title": "Is the fed on to something?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uwjjw4/is_the_fed_on_to_something/",
            "author": "planet_hallows",
            "created_utc": 1653370131.0,
            "score": 5,
            "num_comments": 6,
            "subreddit": "Bitcoin",
            "selftext": "\nThe Fed's balance sheet is almost $9T, which we all complain about here in r/Bitcoin.\n\nWe probably all also know that China is a major holder of US debt and could dump $1T on the market to wreak havock in the US. What if QE is a strategy to do that more gradually than China would and to own assets the Fed could sell to soak up those extra dollars were China to dump US currency.\n\nI hate to defend the Fed, and this is just my own reverse/\"good\" conspiracy theory, but does it have any merit? If so, what would the Fed's ability to hold the Dollar stable mean for our beloved BTC?",
            "stickied": false,
            "comments": [
                {
                    "id": "i9ry62f",
                    "author": "MCHappster1",
                    "score": 6,
                    "created_utc": 1653371030.0,
                    "response": "All we know for sure is that bitcoin is a scarcity. There’s way too much debt in the global economy. If default rates rise we could see things cascade out of control again. All this printed money that never had value attached to it will vanish and the value of Bitcoin theoretically would go down against the dollar since the demand for dollars would rise. This is of course until the demand for bitcoin outpaces the demand for USD (or the supply of USD outpaces the supply of BTC).",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9rzet7",
                    "author": "ndgoLiberty",
                    "score": 4,
                    "created_utc": 1653371990.0,
                    "response": "Fed are pumping the dollar/giving themselves room to work if shit hits the fan.\n\nShit hasn’t hit the fan. They’ll keep pumping the brakes on the economy.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ry3t5",
                    "author": "kwaker88",
                    "score": 2,
                    "created_utc": 1653370983.0,
                    "response": "Wut?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9s2vkq",
                    "author": "igadjeed",
                    "score": 0,
                    "created_utc": 1653374784.0,
                    "response": "Not relevant to Bitcoin",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9td1mt",
                    "author": "mrxsdcuqr7x284k6",
                    "score": 1,
                    "created_utc": 1653405109.0,
                    "response": "Why would China want to wreak havoc on a country that owes them a trillion dollars?\n\nIf you had a buddy that owed you $50k would you try to get him fired? Of course not.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}