{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uwc9g5",
            "title": "Buying small amounts of bitcoin for cheap?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/uwc9g5/buying_small_amounts_of_bitcoin_for_cheap/",
            "author": "TristinMaysisHot",
            "created_utc": 1653345238.0,
            "score": 1,
            "num_comments": 36,
            "subreddit": "BitcoinBeginners",
            "selftext": "I'm trying to learn how to buy small amounts of bitcoins (under $20 at a time) for as cheap as possible, while giving as little of my personal information as possible. I want to pay using a Vanilla Visa Gift Card. What would be the best option to go about doing this? I would just use Paypal, but they or Visa seem to have blocked the ability to send money to people on Paypal. So looking for something to replace paypal.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9qly87",
                    "author": "leotaylortyler",
                    "score": 2,
                    "created_utc": 1653345320.0,
                    "response": "Use cashapp",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9qmgj9",
                            "author": "TristinMaysisHot",
                            "score": 1,
                            "created_utc": 1653345564.0,
                            "response": "How much information would they need for me to buy off there?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9qncn6",
                                    "author": "bitusher",
                                    "score": 1,
                                    "created_utc": 1653345991.0,
                                    "response": "email, phone number , drivers license\n\nAnother good option is strike.me",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9qnyls",
                                            "author": "TristinMaysisHot",
                                            "score": 1,
                                            "created_utc": 1653346285.0,
                                            "response": "There anyway to do it with out a drivers license? Also is strike cheaper than cashapp in fees? \n\nI haven' t really used bitcoins in a really long time. The last time i bought them was off of localbitcoins at a huge mark up, due to paying with Paypal. That was years ago though.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9qqk1o",
                                                    "author": "bitusher",
                                                    "score": 1,
                                                    "created_utc": 1653347550.0,
                                                    "response": "Its easy to regain your privacy after the fact even if you buy with ID , but in my other response I gave you both options. Expect to pay a 6-20% premium if you buy without ID",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9qwnb3",
                    "author": "tdempsey33",
                    "score": 2,
                    "created_utc": 1653350558.0,
                    "response": "Did googling “how to launder money” not work out so you came here?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9qx95p",
                            "author": "TristinMaysisHot",
                            "score": 4,
                            "created_utc": 1653350858.0,
                            "response": "No. Google pointed me here when googling that.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9qlrxr",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653345238.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9qnkgs",
                    "author": "bitusher",
                    "score": 1,
                    "created_utc": 1653346097.0,
                    "response": ">I want to pay using a Vanilla Visa Gift Card.\n\nDo not use these to buy bitcoin , very few people except this and you will overpay to buy \n\nYou seem to be indirectly asking about buying bitcoin without ID ? \n\nAre you concerned with immediate privacy to immediately spend the bitcoin with a special merchant or long term privacy ?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9qoz7o",
                            "author": "TristinMaysisHot",
                            "score": 1,
                            "created_utc": 1653346782.0,
                            "response": ">Do not use these to buy bitcoin , very few people except this and you will overpay to buy \n\nI don't really have any other option. I don't wanna use my bank to add funds and don't have a CC. \n\n>You seem to be indirectly asking about buying bitcoin without ID ? \n\nI would prefer to not have to use my ID, but if that is the cheapest method to buy bitcoin using my Visa GC. I guess that will due. \n\n>Are you concerned with immediate privacy to immediately spend the bitcoin with a special merchant or long term privacy ?\n\nBoth.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9qpuie",
                                    "author": "bitusher",
                                    "score": 1,
                                    "created_utc": 1653347199.0,
                                    "response": "> and don't have a CC. \n\nmost exchanges don't accept credit cards . They either accept wire transfers, sepa txs, debit cards , or ach bank transfers. \n\nIf you lack a **debit** card you can use an exchange like coinbase.com to link your bank to transfer money directly \n\n>I would prefer to not have to use my ID, but if that is the cheapest method\n\nbuying with ID is indeed the cheapest method\n\n>using my Visa GC.\n\nI just finished saying this was one of the more expensive ways to buy bitcoin\n\n>Both.\n\nIf you are merely concerned about longterm privacy than you are likely overthinking things and the solution is rather simple.\n\n1)\tWithdraw your btc from exchange to wallet A(mobile wallet) , than send to wallet  wallet B(example - HW wallet) within a few hours and never in reverse you create more plausible deniability which is good for privacy and tax reasons. Make sure you send the entire amount each time as well. \n\n2)\tWhen you are ready to spend your bitcoin in your hardware wallet there are many ways to sell or spend the bitcoin very privately like loading the bitcoin up in a lightning wallet where chain analysis cannot track those UTXOs offchain. \n\nWith Chainanalytics exchanges and regulators are using probabilistic guess work in tracking transactions onchain. They merely assume your withdraw address likely belongs to you. By sending the bitcoin from wallet A to wallet B within a few hours you are creating plausible deniability and adding in significant doubt those UTXOs(bitcoin) belong to you and doing so in such a small window that the price change is moot to avoid creating a taxable event. At any time in the future you can privately spend the bitcoin or sell it for fiat in a private manner. \n\nIf you want immediate privacy than you can \n\nmany ATMs don't require ID and just sms verification - coinatmradar.com\nOther options are any way that doesn't require verification like this list -\n\nhttps://github.com/cointastical/P2P-Trading-Exchanges\n\nor you can buy bitcoin with ID and than coinjoin it \n\nOr you can buy bitcoin with ID than use a feature like https://samouraiwallet.com/ricochet\n\nOr you can buy with ID than send the btc between 2 lightning wallets \n\nAnd many more ways",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9qusgu",
                                            "author": "TristinMaysisHot",
                                            "score": 1,
                                            "created_utc": 1653349643.0,
                                            "response": "So Cashapp/Strike wouldn't work with the Vanilla Visa card even if i provided my ID anyway? So i would have to buy from more expensive places.\n\nI can use my bank, but just prefer not using it online. I don't really like using giving my ID/Bank online. Since like every day a new website is hacked and their entire database is leaked online. I don't my ID etc floating around online. So only rarely use it.\n\nI guess using my bank and buying off coinbase is the best option, if Strike doesn't take the Visa Gift cards. Thanks for all the information.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9qv7h6",
                                                    "author": "bitusher",
                                                    "score": 1,
                                                    "created_utc": 1653349848.0,
                                                    "response": ">So Cashapp/Strike wouldn't work with the Vanilla Visa card even if i provided my ID anyway? \n\nno\n\n>So i would have to buy from more expensive places.\n\nyou don't have to buy from more expensive places , you can choose to overpay if you want to \n\n> I don't my ID etc floating around online. \n\nregulated exchanges are just banks , gemini and coinbase are FDIC insured just like a bank. Since you already have a bank account your ID is already being stored by banks  (it isn't floating around online as you suggest) so I don't see what the issue is",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9qx1tq",
                                                            "author": "TristinMaysisHot",
                                                            "score": 1,
                                                            "created_utc": 1653350755.0,
                                                            "response": ">Since you already have a bank account your ID is already being stored by banks (it isn't floating around online as you suggest) so I don't see what the issue is\n\nI feel like banks most likely have much better security than these start ups like Strike/Cashapp. That was my main point as to why i don't like giving my ID to a bunch of different places. The more places that have a scan of it, the higher risk of one of them being hacked and their database getting leaked online. I feel like that risk is a lot lower with just my bank itself having it.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9qy3ey",
                                                                    "author": "bitusher",
                                                                    "score": 1,
                                                                    "created_utc": 1653351288.0,
                                                                    "response": ">  better security than these start ups like Strike/Cashapp. \n\nThis is incorrect. These are banks and these companies are more security focused than traditional banks\n\nIf you want to spend more for this concern you can spend a 6-20 % premium",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i9qvb2v",
                                                    "author": "bitusher",
                                                    "score": 1,
                                                    "created_utc": 1653349895.0,
                                                    "response": ">Thanks for all the information.\n\nno problem , please read the pinned FAQ too \n\nhttps://www.reddit.com/r/BitcoinBeginners/comments/g42ijd/faq_for_beginners/",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i9qz17s",
                                                    "author": "SlowCombination9173",
                                                    "score": 1,
                                                    "created_utc": 1653351760.0,
                                                    "response": "Then setup a dummy bank account just for online purchases",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9s16q7",
                                    "author": "igadjeed",
                                    "score": 1,
                                    "created_utc": 1653373394.0,
                                    "response": "> don't wanna use my bank to add funds and don't have a CC\n\nUse cash, in person",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9qx55x",
                    "author": "Wilynesslessness",
                    "score": 1,
                    "created_utc": 1653350803.0,
                    "response": "Strike",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9qybsj",
                    "author": "SlowCombination9173",
                    "score": 1,
                    "created_utc": 1653351407.0,
                    "response": "Cash app",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9qzb8a",
                    "author": "SlowCombination9173",
                    "score": 1,
                    "created_utc": 1653351904.0,
                    "response": "It really sounds like what you’re trying to do is launder money. Coming online for that isn’t the smartest thing in the world",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9rkyvz",
                    "author": "RosariusAU",
                    "score": 1,
                    "created_utc": 1653362537.0,
                    "response": "Find a person and trade peer to peer. Don't expect a good deal though",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9th3bf",
                    "author": "never-give-up-every1",
                    "score": 1,
                    "created_utc": 1653406804.0,
                    "response": "If you're in Canada you can try buying BTC in Netcoins, Shakepay, and Coinbase.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia5k47t",
                    "author": "bdjilka",
                    "score": 1,
                    "created_utc": 1653624105.0,
                    "response": "I invest $50-100 in cryptocurrency every week through my credit card using simpleswap exchange. There is a convenient integration of all payment services, and your cryptocurrency is stored with you, and not on the exchange wallet like the usual centralized exchanges.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}