{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "rqg0fh",
            "title": "Forgive me",
            "url": "https://v.redd.it/iol42u5dda881",
            "author": "Clip_It_",
            "created_utc": 1640698468.0,
            "score": 18802,
            "num_comments": 539,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "hq9xs96",
                    "author": "Swoopscooter",
                    "score": 414,
                    "created_utc": 1640698820.0,
                    "response": "Brilliant i love it",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hqb1xnz",
                            "author": "ThatsARepost24",
                            "score": 48,
                            "created_utc": 1640716011.0,
                            "response": "₿rilliant",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hqbpcnq",
                                    "author": "Between_three_and20",
                                    "score": -2,
                                    "created_utc": 1640725394.0,
                                    "response": "Brillanté",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hqaehse",
                    "author": "9k3d",
                    "score": 1383,
                    "created_utc": 1640706635.0,
                    "response": "I'm going to take a moment to talk about NFTs since I see people in here talking and arguing about them. NFTs have some actual use cases, but what people are currently doing with them on altcoin platforms is not one of them.\n\nBelow I will explain how the NFTs on altcoin platforms work on a technical level and I will explain why they probably wont even exist in 10 years. I will also explain why some of these NFTs are selling for such high prices.\n\nMany of those NFTs that were sold for crazy high prices were not actually sold to other people. The person who bought those expensive NFTs is often the same person who minted the NFT in the first place. I will explain how whales can easily own very expensive rare NFTs for very little cost. They can just mint an NFT and sell it to them self for $500,000 worth of etһ. They will only lose the small percentage that the NFT marketplace takes and now they own a super rare NFT worth $500k and they will still have most of their etһ because they sold the NFT to them self. And there is a small chance that they might be able to to sell that worthless NFT to some fool who believes that it is actually valuable. Doing this also entices more newbies to mint NFTs in the hopes of getting rich.\n\nSome people are now using flash loans to borrow large amounts of etһ so that they can purchase their own NFTs for extremely high prices and then they pay back the flash loan all in the same block. https://www.theblockcrypto.com/post/122516/how-a-cunning-trick-made-it-look-like-a-cryptopunk-sold-for-532-million\n\nHere is another example that can be done. You can mint an NFT and sell it to yourself for $1000, then put it up for sale and buy it from yourself again for $1500, and sell it to yourself another time for $2200. Now you can put this appreciating NFT up for sale and try to sell it to some fool who sees it keeps getting sold for more and thinks that it must be valuable.\n\nHave you seen celebrities buying NFTs like jpegs of bored apes for hundreds of thousands of dollars? Platforms like MoonPay are paying those celebrities to claim that they bought those NFTs. Those celebrities didn't really pay anything for those NFTs. Those celebrities actually got paid for receiving those NFTs. You can often look at the blockchain and see that the etһ that was used to buy the NFT came directly from a platform like MoonPay, as is the case with the bored ape NFTs that Post Malone recently \"bought for $700k+\"\n\nThe current NFTs are useful for something. These NFTs are a useful tool for laundering illegally acquired cryptocurrency. Criminals can shift around their ill gotten crypto between different tokens, mint an NFT, and purchase their own NFT with their dirty crypto. Now they've cleaned their dirty crypto and they also own a rare NFT that's supposedly worth a lot of money. I mean just look at how much it sold for!\n\nIt costs anywhere from $100-$600+ to mint an NFT on etһereum depending on the current gas fees and where you mint it. So they're [hyping shitcoiners/artists/anyone up and luring them into minting crap in the hopes of getting rich](https://fstoppers.com/opinion/nfts-are-pyramid-scheme-and-people-are-already-losing-money-554869) and NFTs are doing a great job of that at the moment. People are spending millions of dollars worth of etһereum minting NFTs hoping to hit the NFT lottery and get rich.\n\n**All these NFT tokens being sold on etһereum right now either point to a URL on the internet, or an IPFS hash. In most circumstances they reference an IPFS gateway on the internet run by the same startup that sold the NFT. That URL also isn't the media. That URL is a JSON metadata file.** The owners of the servers have no obligation to continue storing the media. Now let's take a look at a couple of real NFTs and see how they work on a technical level.\n\nhttps://niftygateway.com/itemdetail/primary/0x12f28e2106ce8fd8464885b80ea865e98b465149/1\n\nThis NFT token is for this JSON file hosted directly on Nifty's servers as shown below: https://api.niftygateway.com/beeple/100010001/\n\nThat file refers to the actual media that was \"bought.\" Which in this case is hosted by Cloudinary CDN, which is served by Nifty's servers again. So if Nifty goes bust, this token is now worthless. It refers to nothing and this can't be changed. \n\nNow we'll take a look at the $69,346,250 Beeple, sold by Christies. It's so expensive. Surely it isn't centralized, right? Wrong, it's pointless: https://onlineonly.christies.com/s/beeple-first-5000-days/beeple-b-1981-1/112924\n\nThat NFT token refers directly to an IPFS hash. We can take that IPFS hash and fetch the JSON metadata using a public gateway: https://ipfs.io/ipfs/QmPAg1mjxcEQPPtqsLoEcauVedaeMH81WXDPvPx3VC5zUz\n\nSo well done for referring to IPFS, it references the specific file rather than a URL that might break! **But** the metadata links to: https://ipfsgateway.makersplace.com/ipfs/QmXkxpwAHCtDXbbZHUwqtFucG1RMS6T87vi1CdvadfL7qA\n\nThis is an IPFS gateway run by http://makersplace.com, the same NFT minting startup which will go bust one day.\n\nYou might say \"*just refer to the IPFS hash in both places!*\" But IPFS only serves files as long as a node in the IPFS network **intentionally** keeps hosting it. Which means when the startup who sold you the NFT goes bust, the files will probably vanish from IPFS too. [This is already happening.](https://twitter.com/CheckMyNFT/status/1371960028765245440) There are already [NFTs with IPFS resources that are no longer hosted anywhere.](https://twitter.com/scanlime/status/1371509988179464196)\n\nAnd just pinning the file on your own IPFS node also wont work because the metadata file generally points to a specific HTTP IPFS gateway URL and not the IPFS hash. This means that when the gateway operator goes bust, I can buy the domain and start serving dick pics lol\n\nRight now NFT's are built on an absolute house of cards constructed by the people selling them, and it is likely that every NFT sold on etһereum so far will be broken within a decade. This creates a pretty solid exit plan for makersplace if they run into financial problems. The people who own the these useless NFTs \"worth\" millions of dollars are going to be pretty motivated to buy the site or fund it. Or someone can buy the bankrupt startup domains and start charging NFT owners to serve their files.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hqakpr9",
                            "author": "TheWazooPig",
                            "score": 642,
                            "created_utc": 1640709193.0,
                            "response": "Someone should mint your comment as an NFT",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hqaot9u",
                                    "author": "StonkersonTheSwift",
                                    "score": 163,
                                    "created_utc": 1640710820.0,
                                    "response": "I just bought it off LeBarn Jahames for $10,000 and he bought it for $5,000 so I’ll let you have it for $50,000. \n\nMultiplier rule.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hqbmv25",
                                            "author": "ZombieRapperTheEpic",
                                            "score": 32,
                                            "created_utc": 1640724374.0,
                                            "response": "I'll take it for $15,000 under condition someone offers to buy it from me for $20,000",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hqbxuxo",
                                                    "author": "LostAndLikingIt",
                                                    "score": 15,
                                                    "created_utc": 1640728889.0,
                                                    "response": "Sold if you throw in a bridge to sweeten the deal.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "hqbxx6k",
                                                            "author": "ZombieRapperTheEpic",
                                                            "score": 6,
                                                            "created_utc": 1640728915.0,
                                                            "response": "I got a little one from a toy train set? Will that work for you?",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "hqby5l5",
                                                                    "author": "LostAndLikingIt",
                                                                    "score": 9,
                                                                    "created_utc": 1640729010.0,
                                                                    "response": "I feel like this is a wise investment, sounds good.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "hqby8s1",
                                                                            "author": "ZombieRapperTheEpic",
                                                                            "score": 5,
                                                                            "created_utc": 1640729046.0,
                                                                            "response": "Wow, we are both so wise!",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "hqcr6nm",
                                                                                    "author": "blacksideblue",
                                                                                    "score": 2,
                                                                                    "created_utc": 1640741617.0,
                                                                                    "response": "[I am Metatron](https://youtu.be/_yy4qamWAmk?t=53)",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "hqan9w5",
                                    "author": "Roqot",
                                    "score": 37,
                                    "created_utc": 1640710213.0,
                                    "response": "And what if multiple mint the same content? NFTs will not last",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hqatlrn",
                                            "author": "TheWazooPig",
                                            "score": 48,
                                            "created_utc": 1640712713.0,
                                            "response": "The NFTs that just call some JPEG won't last, but there are some use cases that might take off. Before minting pictures of monkeys wearing different hats became the NFT fad, NFTs were talked about as being rare/limited items in video games. For example, some RPG with random drops might have some special sword that only has 10 copies possible. Someone who finds that sword could sell it or even rent it to other players. This type of monetization has potential because there's already a huge market for paying people to level up characters or grind for rare items.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hqaxppa",
                                                    "author": "alfuh",
                                                    "score": 42,
                                                    "created_utc": 1640714337.0,
                                                    "response": "People bring this use case up quite a lot, but hasn't this existed for a long time already? I'm not big into CS for over a decade, but I know you can get skins that are very rare,  cannot be duplicated, and they sell for a lot of $$. How would NFTs be functionally different in that example from whatever technology is already being used to do that?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "hqbavcb",
                                                            "author": "notthetallestbranch",
                                                            "score": 4,
                                                            "created_utc": 1640719541.0,
                                                            "response": "Csgo has a lot of duped items out there (valve refunding skins that were scammed)",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "hqb3vrk",
                                                            "author": "Johnyahn2",
                                                            "score": 25,
                                                            "created_utc": 1640716777.0,
                                                            "response": "It’s not they’re just trying to justify a pointless technology.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "hqb9ipm",
                                                                    "author": "STEFOOO",
                                                                    "score": 11,
                                                                    "created_utc": 1640719004.0,
                                                                    "response": "The day NFTs will become a real usecase will be the day Pokemon implements it across all its games and capturing that Pikachu in Pokemon GO will actually give you ownership of a Pokemon.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "hqbbek1",
                                                                            "author": "Johnyahn2",
                                                                            "score": 14,
                                                                            "created_utc": 1640719755.0,
                                                                            "response": "Why is NFT needed for this lol.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "hqcmhyd",
                                                                                    "author": "redpandarox",
                                                                                    "score": 3,
                                                                                    "created_utc": 1640739507.0,
                                                                                    "response": "Basically a “decentralized” Pokemon bank.\n\nAnd that’s the real appeal of NFTs to the crypto community. But like all crypto products the value is pumped up by whales and clueless idiots splurging their money to chase the latest hype.",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                },
                                                                                {
                                                                                    "id": "hqbc36k",
                                                                                    "author": "STEFOOO",
                                                                                    "score": -1,
                                                                                    "created_utc": 1640720026.0,
                                                                                    "response": "Cause it allows you to be cross-platform and cross-games.\n\nCould be used for other derivated products also",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "hqbfcu3",
                                                                                            "author": "Hyperion4",
                                                                                            "score": 6,
                                                                                            "created_utc": 1640721338.0,
                                                                                            "response": "Cross platform already exists and cross game also exists where it makes sense. Game design isn't some static thing, cross game requires a bunch of dev work that NFTs do nothing to eliminate",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        },
                                                                                        {
                                                                                            "id": "hqbeqbo",
                                                                                            "author": "Brady_boy_26",
                                                                                            "score": 7,
                                                                                            "created_utc": 1640721082.0,
                                                                                            "response": "but they have already allowed for cross platform cross game pokemon sharing for years adding NFTs to that changes absolutely nothing lol",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        },
                                                                                        {
                                                                                            "id": "hqbdkma",
                                                                                            "author": "Johnyahn2",
                                                                                            "score": 5,
                                                                                            "created_utc": 1640720618.0,
                                                                                            "response": "I'm still not understanding how this is something NFTs enable that can't already be done using existing technology that doesn't involve the blockchain.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        },
                                                                                        {
                                                                                            "id": "hqbio6p",
                                                                                            "author": "BGYeti",
                                                                                            "score": 2,
                                                                                            "created_utc": 1640722667.0,
                                                                                            "response": "So Pokemon Bank which literally already exists... I can already take my existing pokemon from any game that has Pokemon Bank compatibility and transfer them between games even platforms like Pokemon Go",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        },
                                                                                        {
                                                                                            "id": "hqbkjw3",
                                                                                            "author": "Spitinthacoola",
                                                                                            "score": 1,
                                                                                            "created_utc": 1640723421.0,
                                                                                            "response": "Blockchain doesn't do this. It might allow Nintendo to skirt some regulations around in-game currency in some countries but this seems unlikely. A private database does this better in every other way.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        },
                                                                                        {
                                                                                            "id": "hqc61od",
                                                                                            "author": "bleeeeghh",
                                                                                            "score": 1,
                                                                                            "created_utc": 1640732307.0,
                                                                                            "response": "Nintendo can achieve the same thing with a server/database. And if it's pokemon, then Nintendo is the only one who can use them so there's no legal way it can be decentralized.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "hqb3b35",
                                                            "author": "ChromeGhost",
                                                            "score": 6,
                                                            "created_utc": 1640716553.0,
                                                            "response": "Yeah but that system is closed ,  abs you can’t transport those skins to halo or Battlefield for example",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "hqb4wab",
                                                                    "author": "kawi-bawi-bo",
                                                                    "score": 26,
                                                                    "created_utc": 1640717180.0,
                                                                    "response": "But isn't each game its own closed eco-system? I don't think you can freely transfer game assets between games",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "hqb6p2t",
                                                                            "author": "Tianoccio",
                                                                            "score": 16,
                                                                            "created_utc": 1640717889.0,
                                                                            "response": "Depends, really, but the long answer is going to be: ‘so many people would have to be involved that it would be impossible to track how the money should be split’.\n\nAlso, video game skins like CSGO are essentially just a visual replacer for a weapon that exists in game, taking that skin and importing it to halo does nothing. A CSGO M4A1 is not the same 3D blueprint model as a CoD M4A1 and neither is anywhere close to a halo assault rifle. It simply wouldn’t work to begin with, it would cost money to make it work (time is money) and certain developers like CoD would lose money by not being able to sell you that same skin next year in their new game.\n\nThe concept that NFTs could make items in video games matter is a backtracked idea, there have been individual drops and ‘only 1 of these swords per server’ in WoW since at least the first expansion, I’ve never played that game itself but friends of mine literally described how their guild was trying to get this sword from a raid that only one person in the server could have.\n\nVideo games solved this problem years ago, and NFTs won’t do anything that they didn’t already have a better solution for then.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "hqbm714",
                                                                                    "author": "eqleriq",
                                                                                    "score": -4,
                                                                                    "created_utc": 1640724099.0,
                                                                                    "response": "It's just decentralized. You're claiming that CSGO and COD aren't compatible... but in the future maybe everything will be compatible.\n\nYour entire argument is equivalent of saying \"steam solved digital ownership years ago so what's the point of having a decentralized ownership token.\"\n\n>I've never played that game itself but friends of mine literally described how their guild was trying to get this sword from a raid that only one person in the server could have.\n\nwell either you or your friend is misunderstanding, because that's not a thing and never was. So your entire argument of \"it already being solved\" is based on something that doesn't exist. Cool.\n\nI don't understand what's so difficult about grasping that it is decentralized proof of ownership. Why children keep bringing up \"video games\" as some sort of use case is already annoying, but it's very obvious to see how that might work in the future.\n\nIs it really that hard to imagine the use of decentralized digital proof of ownership where an asset can be applied to many games?\n\nYou're fixating on \"a virtual item\" but what about something as simple as a membership?",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "hqc247v",
                                                                                            "author": "Snuffy1717",
                                                                                            "score": 9,
                                                                                            "created_utc": 1640730654.0,
                                                                                            "response": "> but in the future maybe everything will be compatible.\n\nYeah, and until that starts to happen (it won't), NFTs are useless in this case scenario.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        },
                                                                                        {
                                                                                            "id": "hqciwfi",
                                                                                            "author": "pre_nerf_infestor",
                                                                                            "score": 8,
                                                                                            "created_utc": 1640737905.0,
                                                                                            "response": "ok so if I'm Activision, what's my motivation in making a gun from Halo work in CoD? Why would I want some dickhead who paid 343 $5 for his assault rifle to be able to come over to use it in my game, when he should be paying me $5 to buy an assault rifle in CoD?\n\nIf I keep it within my own ecosystem of games, same question. Why would I want somebody to be able to bring over his skins and guns when planned obsolescence via annual updates already makes all the money I can squeeze out of him? Why have a blockchain?\n\nWhy make something decentralized when, as a corporation who controls the game, it is in my interest to keep things as *centralized* as possible? \n\nUnless the future is one in which every person in the world only hangs out in one place owned by one corporation (aka the OASIS from ready player one or the Metaverse from snow crash or Roblox) I don't see NFTs having a future in gaming.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        },
                                                                                        {
                                                                                            "id": "hqc7md9",
                                                                                            "author": "pappabrun",
                                                                                            "score": 3,
                                                                                            "created_utc": 1640732978.0,
                                                                                            "response": "A genuine question: What incentive do publishers have to make skins/etc transferable between games? i personally can't see any, but i am also not very smart.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        },
                                                                                        {
                                                                                            "id": "hqchw2n",
                                                                                            "author": "reverie42",
                                                                                            "score": 2,
                                                                                            "created_utc": 1640737460.0,
                                                                                            "response": "> well either you or your friend is misunderstanding, because that's not a thing and never was. So your entire argument of \"it already being solved\" is based on something that doesn't exist. Cool.\n\nIt hasn't been true for any items I'm aware of, but the Scarab God title and associated bug mount were definitely server-exclusive to the first person to ring the bell.\n\nThey are however, non-transferable. It would not be hard for a developer to make a transferable, unique item if they wanted to. NFTs are not required for that in any way.\n\n> Is it really that hard to imagine the use of decentralized digital proof of ownership where an asset can be applied to many games?\n\nIt's a pretty hard technical problem. The systems have to be built to recognize the token. The developer is probably going to want a cut, and at the point that they've solved those problems, there's really no reason doe a dev not to use an in-house solution.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        },
                                                                                        {
                                                                                            "id": "hqckr0b",
                                                                                            "author": "chief167",
                                                                                            "score": 2,
                                                                                            "created_utc": 1640738724.0,
                                                                                            "response": ">You're claiming that CSGO and COD aren't compatible... but in the future maybe everything will be compatible.\n\nOk you win this thread, that's the dumbest comment I have read so far to explain the usefulness of NFTs. \n\nEven if they allow assets to somehow find their way from one server to another, you won't make that happen with NFT, some file transfer or settings file will actually have to move between the games. And then why wouldn't those game companies take care of the transaction instead of an NFT? \n\nIt makes no sense at all",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "id": "hqb6bsh",
                                                                            "author": "Mahorium",
                                                                            "score": 5,
                                                                            "created_utc": 1640717742.0,
                                                                            "response": "That's where the metaverse idea comes into play. The idea is that in the metaverse all of this content would be interchangeable between games. NFTs could be used as the technological underpinning for this tech.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "hqbcifc",
                                                                                    "author": "stemfish",
                                                                                    "score": 12,
                                                                                    "created_utc": 1640720192.0,
                                                                                    "response": "That's not how games work. Unless you make the game with the same engine using the same rendering systems and have the same character model designs you can't simply drop in a cosmetic from one game to another. Unless you have a system like Roblox where all the games use the same avatar it doesn't work. \n\nNFTs have nothing to do with that. All and NFT does is say that 'Person A owns the digital rights to this linked data'. The data can be a license for the software, a picture of cats, or literally anything else. But simply owning the rights to a hat in a game doesn't mean that you can magically move it into another game or system. \n\nAgain, it works if your entire game system is exactly Roblox. But nothing else.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "hqce6z9",
                                                                                            "author": "Skyy-High",
                                                                                            "score": 8,
                                                                                            "created_utc": 1640735829.0,
                                                                                            "response": "The people spouting this stuff read Ready Player One and thought that we could (and should) build the Oasis today.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        },
                                                                                        {
                                                                                            "id": "hqbmkqs",
                                                                                            "author": "eqleriq",
                                                                                            "score": 1,
                                                                                            "created_utc": 1640724256.0,
                                                                                            "response": "It works just fine if the NFT is a license to an item that has different properties across the multiple platforms.\n\nMy NFT can be \"MCDONALDS YUM YUM TOY\" and 250 different games or software platforms such as websites or apps can see that and flag \"yep, they own mcdonalds yum yum toy so give them X.\"\n\nCurrently this requires you \"linking accounts\" like amazon prime to whatever game via API. \n\nThat's where the \"decentralized\" part comes into play. It doesn't rely on an oracle to authenticate, just an issuer.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "id": "hqb7m3j",
                                                                                    "author": "sofa_king_we_todded",
                                                                                    "score": 3,
                                                                                    "created_utc": 1640718250.0,
                                                                                    "response": "Is this really the underlying idea for metaverse? I’ve not heard of this before, but then I haven’t really been that well read on it",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "hqbcp2t",
                                                                                            "author": "stemfish",
                                                                                            "score": 7,
                                                                                            "created_utc": 1640720264.0,
                                                                                            "response": "Nope. They're talking smoke. NFTs simply allow everyone to know who owns the digital rights to something. That doesn't translate to games or systems magically accepting that because buzzword.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "hqbfdxa",
                                                                    "author": "joyofsteak",
                                                                    "score": 6,
                                                                    "created_utc": 1640721350.0,
                                                                    "response": "Do you know how video games or programming work at all? You’d have to get every developer to agree on a single engine and coding language, and if you think that’s gonna happen then obviously you have no clue why various languages and game engines are used for different projects in the first place.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "hqcboug",
                                                                            "author": "generalthunder",
                                                                            "score": 5,
                                                                            "created_utc": 1640734744.0,
                                                                            "response": "You don't even need NFT to create a system that works like that. If the devs wanted to  they could just make an agreement and share the cosmetics between  games in some crossover event. You just need to check the ownership of the item on the players account",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        },
                                                                        {
                                                                            "id": "hqbo02v",
                                                                            "author": "eqleriq",
                                                                            "score": -4,
                                                                            "created_utc": 1640724838.0,
                                                                            "response": "Do you know how NFTs work at all? You could use them for authenticating ownership in a decentralized manner, which allows every developer to code whatever-the-fuck they want and allow any user access based on their NFT status. \n\nWeird! It's almost like the people who developed these platforms know the possibilities and the people who are spectators commenting from the cheap seats have no clue",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "hqbyvtj",
                                                                                    "author": "ImNoRatAndYouKnowIt",
                                                                                    "score": -2,
                                                                                    "created_utc": 1640729305.0,
                                                                                    "response": "It’s unbelievable how many people have an opinion on this without understanding the NFT isn’t the item itself.",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "hqb5suu",
                                                                    "author": "DJ_Micoh",
                                                                    "score": 11,
                                                                    "created_utc": 1640717535.0,
                                                                    "response": "Yeah but those skins are designed for character models in CS and would look janky mapped onto characters from different games.\n\nThe problem would be even worse with non-cosmetic items. \n\nSay you have a rare gun in one game that does 100 damage. If you move it into a game where characters have 10 HP, it will be stupidly overpowered, and if you move it into a game where they have 10,000 HP it will be like a peashooter.\n\nSome of the stats associated with the weapon might not be implemented in some games, or might refer to totally different parameters.\n\nWhat would happen if you took a weapon with a Mana stat into COD? Maybe you take a 0 Mana sword into a game where that number is read as weapon condition so the new game assumes your weapon is broken.\n\nBasically these items only make sense in the context of the games that they were designed for and, unless a herculean effort was made to standardize game engines, switching them between games seems pretty unlikely.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "hqbbhev",
                                                                            "author": "TheWazooPig",
                                                                            "score": -1,
                                                                            "created_utc": 1640719787.0,
                                                                            "response": "Developers could do some clever programming and collaboration to make sure the NFT was compatible between games. Ubisoft just announced they'll be using Tezos as their NFT platform. They could develop some NFTs that work in both Assassin's Creed and Far Cry for example. They wouldn't even need to collaborate with another company.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "hqbeg3b",
                                                                                    "author": "DJ_Micoh",
                                                                                    "score": 5,
                                                                                    "created_utc": 1640720968.0,
                                                                                    "response": "Yeah but that would still be in a closed ecosystem, just a slightly larger one, so u/alfuh's point still stands.",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                },
                                                                                {
                                                                                    "id": "hqbcgfd",
                                                                                    "author": "cspan_hooray",
                                                                                    "score": 2,
                                                                                    "created_utc": 1640720170.0,
                                                                                    "response": "Wouldn’t Ubisoft be incentivized to sell you the same skin in three places instead?",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "hqbe7nh",
                                                                                            "author": "DJ_Micoh",
                                                                                            "score": 1,
                                                                                            "created_utc": 1640720875.0,
                                                                                            "response": "Not if they can charge you six times as much.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "id": "hqblys7",
                                                                                    "author": "salmonmoose",
                                                                                    "score": 2,
                                                                                    "created_utc": 1640724004.0,
                                                                                    "response": "But they have a system for this already, their launcher means everyone has an account and they could store this on a centralised database.\n\nPerhaps working with other companies could extend this use case, but even then most of those are on large platforms which can also share data (you'd offload to steam/xbl/PSN).\n\nMaybe, just maybe if you wanted to share items across publishers and platforms this may be worth while? But is the extra development load for being able to use crap in other games worth it? At one end you have mismatched cosmetics at another end you have to implement whole behaviour sets.",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                },
                                                                                {
                                                                                    "id": "hqbnc9q",
                                                                                    "author": "eqleriq",
                                                                                    "score": 1,
                                                                                    "created_utc": 1640724569.0,
                                                                                    "response": "They wouldn't even have to do that.\n\nThe NFT could just be a license that is universal, and each platform could serve unique content based on that check.\n\nWhy are people so fixated on an NFT as \"the thing\" and not \"a mechanism that allows access.\" It's fucking stupid.\n\nDo you also think a mortgage is the actual house, or a car title is the car itself?",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "hqc25oy",
                                                                                            "author": "cyphr02",
                                                                                            "score": 2,
                                                                                            "created_utc": 1640730672.0,
                                                                                            "response": "Mortgage is a type of loan that serves as your contract to receive the deed at completion of payments.  Car title is proof of ownership.  These have nothing to do with computer programming or game design.  At the very least, you will never see content cross game engines.  UBI, EA, and Epic all use different engines, and have no financial incentive to adapt their engine to support content they are not compensated for.  On top of that, it opens them up to litigation if any NFT content utilizes a trademark product that the original developer has an agreement with.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "hqb6vs3",
                                                                    "author": "semtex87",
                                                                    "score": 9,
                                                                    "created_utc": 1640717963.0,
                                                                    "response": "That has nothing to do with NFTs, each of these games are designed by a different gaming studio, and controlled by a different publisher, that is what makes that system \"closed\". NFTs don't solve or fix that in any conceivable way, shape, or form.\n\nIf Microsoft, EA, and Valve wanted to have universal skins that could be used across any of their games, they would need to form a partnership to do that and they'd create their own system to ensure copyright/trademark protection, DRM, as well as monetization and they would have no need for NFTs to do it.\n\nAgain, NFTs are a shitty stupid solution in search of a non-existent problem.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "hqbeg48",
                                                                            "author": "Alexander_Curly",
                                                                            "score": 0,
                                                                            "created_utc": 1640720968.0,
                                                                            "response": "Although each collection will likely be compatible only with a specific game, series, developer/studio or engine , NFT technology will enable owners of in game content to trade those items outside of the game and on open marketplaces specifically designed for trading NFTs.\n\nBuyers will benefit by having their purchases administered by the marketplace provider, similar to an escrow service, rather than entering a transaction based solely on trust and risk losing their funds.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "hqbh8c3",
                                                                                    "author": "sadacal",
                                                                                    "score": 2,
                                                                                    "created_utc": 1640722092.0,
                                                                                    "response": "So game devs should integrate NFTs into their games so players can trade items on third party websites? Why? Why not just implement a real money marketplace in the game like Diablo III?",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                },
                                                                                {
                                                                                    "id": "hqbhjaf",
                                                                                    "author": "semtex87",
                                                                                    "score": 2,
                                                                                    "created_utc": 1640722215.0,
                                                                                    "response": "Do-tell, how would this supposed \"open marketplace\" have access to a closed source, proprietary, copyright protected system?\n\nIf I buy a skin in Fortnite, how can I magically pull it out of my account, attach it to an NFT and trade it with another player on this \"open marketplace\"?\n\nThat is where all of your ideas keep falling flat on their faces. This utopia of digital asset trading requires the owner of said system (the game studios) to allow this to happen by building mechanics in the game to facilitate it, and they have no financial incentive to do so.",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "id": "hqbnnml",
                                                                            "author": "eqleriq",
                                                                            "score": 1,
                                                                            "created_utc": 1640724697.0,
                                                                            "response": "Except you don't seem to understand the basics at play here.\n\nAll an NFT needs to be is allow access. MS, EA and Valve could all individually hook into an NFT to prove a user has access to something, like \"MCDONALDS HAPPY MEAL PROMO WINTER 2021\" and make their own fucking content for it.\n\nAgain, you have incomplete information yet you're confident that isn't why you don't see the utility.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "hqbo918",
                                                                                    "author": "semtex87",
                                                                                    "score": 1,
                                                                                    "created_utc": 1640724939.0,
                                                                                    "response": "And you don't seem to understand economics.\n\nWhy would they do that? What's the upside? How does it benefit their shareholders?\n\nAdditionally, why wouldn't they do that with their own closed ecosystem marketplace? Valve already has one that allows trading, why would they increase the complexity of an already existing system by trying to retrofit stupid ass NFTs that don't make anything better?\n\nAgain, solution in search of a problem.",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "id": "hqbbnra",
                                                                            "author": "TheWazooPig",
                                                                            "score": -1,
                                                                            "created_utc": 1640719856.0,
                                                                            "response": "Now that Microsoft owns Bethesda, imagine some armor or weapons that could be used in both Elder Scrolls and Fallout",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "hqbcgg5",
                                                                                    "author": "semtex87",
                                                                                    "score": 2,
                                                                                    "created_utc": 1640720170.0,
                                                                                    "response": "That would be cool, and Microsoft could/would do so without any need for an NFT.\n\nIt's the same argument as GameStop and the used game marketplace. All the new consoles moving forward into the future are going to stop using physical media and switch to 100% digital downloads through digital marketplaces so that the Publishers have 100% control over distribution and eliminate second hand sales of games forcing everyone to pay the Publisher first hand for a copy of a game.",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "hqbxpqa",
                                                                    "author": "Ok-Entertainment7185",
                                                                    "score": 2,
                                                                    "created_utc": 1640728829.0,
                                                                    "response": "There was nothing that stopped that from happening without NFTs but no one does that because it's a dumb idea.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                },
                                                                {
                                                                    "id": "hqccsec",
                                                                    "author": "anaximander19",
                                                                    "score": 1,
                                                                    "created_utc": 1640735221.0,
                                                                    "response": "For that to work, the developers of each game would have to explicitly build it in, which they don't currently, and if they did, they'd likely just build in a way for their servers to talk to each other to confirm ownership. The only reason you'd need something on the scale and mechanism of NFTs is if this practice became very widespread and assets routinely outlived the games or systems they originally came from. That's the basic concept behind the metaverse (or at least part of it) but at this point it's entirely theoretical; pretty much nobody has actually built anything like that yet.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "hqbwtlz",
                                                            "author": "Oriumpor",
                                                            "score": 1,
                                                            "created_utc": 1640728469.0,
                                                            "response": "As the backend for a cross platform IP sharing system... Yes it is interesting.  The agents using it wouldn't want to cooperate per SE, but a set of artists would benefit from marketing and selling cross IP art this way.\n\nIt's not the tech itself that's ever interesting it's always the killer app.\n\nIn this case an amazing system would be a group of game artists getting together and using a system like this to license their work in a limited way *to studios.*\n\n\nIt's not as sexy as selling tokens to users who have no use case... Cause your growth is limited by content creation.",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "hqc1yqd",
                                                            "author": "Snuffy1717",
                                                            "score": 1,
                                                            "created_utc": 1640730590.0,
                                                            "response": "Exactly. Every NFT use-case I've ever seen already exists with technology in place that is better than what the NFT could provide.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "hqawu5x",
                                                    "author": "Redebo",
                                                    "score": 14,
                                                    "created_utc": 1640713991.0,
                                                    "response": "> For example, some RPG with random drops might have some special sword that only has 10 copies possible. \n\nI understand why this would work 'conceptually' but all video games are closed-ecosystems.  I can't bring a sword from Diablo over into WOW as an example.  The companies that own these ecosystems have 100% control over every item in their game.  They don't need NFT's to already say, \"there's only 10 copies of this sword in the game, that's why they're $5,000 each\".  How would you see NFT's enabling what they can already do without the extra cost/hassle of the minting process?\n\nEdit:  I thought of one:  VG Publishers would love to make games 'pay to win' where you can buy a higher powered whatever for real dollars, but the gaming community slaughters companies when they try to do this.  So, the publisher could mint NFT items with higher power, and limit their drop rate in the game to a scarce number.  Then they wouldd enable in-game trading and if based on the NFT, the publisher could get royalties every time that item changes hands.  When the gaming community screams \"pay to win!\" the publisher can say, \"hey, it's not us charging money, it's your fellow players!  You had the same chance at getting that drop as the guy who got it!\"",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "hqb1lq0",
                                                            "author": "Slapshot382",
                                                            "score": 2,
                                                            "created_utc": 1640715878.0,
                                                            "response": "This is good thinking.",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "hqb773d",
                                                            "author": "Tianoccio",
                                                            "score": 3,
                                                            "created_utc": 1640718088.0,
                                                            "response": "CSGO already has that without NFTs.\n\nSeriously you open an item, sell it on the steam market place, they get a percentage of the sale, none of the money leaves their storefront unless it’s used to buy something like keys that are traded externally.\n\nBut for real, you’re trying to sell video game producers on a technology they already have that will cause them to lose money.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "hqbjqj5",
                                                                    "author": "eqleriq",
                                                                    "score": 1,
                                                                    "created_utc": 1640723087.0,
                                                                    "response": "Yes, and it's centralized to steam. What part about decentralized proof of ownership are you unclear about?\n\nTo expand it past what a 12 year old thinks NFTs are, imagine that every game you own on steam as an NFT and you can access it or prove ownership on any platform without requiring a centralized platform to \"allow access\" via an API.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "hqbyeia",
                                                                            "author": "YellowFeverbrah",
                                                                            "score": 4,
                                                                            "created_utc": 1640729109.0,
                                                                            "response": "It’s gonna going to happen. Game companies don’t give a fuck about nfts outside of exploiting the hype. It makes zero sense to reinvent the wheel. Nfts are a solution in search of a problem.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        },
                                                                        {
                                                                            "id": "hqcmyrs",
                                                                            "author": "sarhoshamiral",
                                                                            "score": 2,
                                                                            "created_utc": 1640739719.0,
                                                                            "response": "But that item has no value outside of CSGO and steam so a decentralized system is pointless because the only place that item has value is centralized.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "hqbmegv",
                                                                    "author": "Redebo",
                                                                    "score": 1,
                                                                    "created_utc": 1640724184.0,
                                                                    "response": "I pointed this exact thing out in the first paragraph of my post.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "hqb52fl",
                                                            "author": "prosysus",
                                                            "score": 1,
                                                            "created_utc": 1640717248.0,
                                                            "response": "Pretty sure it's better for players to run marketplaces on external blockchain, hyperinflation is a real thing in most MMOs:D And if that's blockchain is owned by game dev, you pretty sure can do some interesting things with it. And with a lower chance of duping, exploits, and such. Not rly game-changing tho.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "hqavnfa",
                                                    "author": "demontreal",
                                                    "score": 9,
                                                    "created_utc": 1640713522.0,
                                                    "response": "Why would you need to do this in a decentralized manner?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "hqb5cxh",
                                                            "author": "novacham",
                                                            "score": 8,
                                                            "created_utc": 1640717362.0,
                                                            "response": "You wouldn't. The RPG sword in this case has a unique ID within the game world that the player can trade to other players in the game.\n\nMaking it an NFT just adds a layer of complexity that doesn't actually add any value.\n\nA really good example of how this economy works already is EverQuest. Especially on TLP's where hundreds of tokens (Krono) are traded every day that represent a month of game time, but are used as a currency to buy rare items or services in the game.\n\nThe only thing I could think of that making the virtual item in this case an NFT is if you wanted to be able to transfer it between games / systems. But I can't see that happening because of how game design works.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "hqbangr",
                                                    "author": "SirFloIII",
                                                    "score": 3,
                                                    "created_utc": 1640719454.0,
                                                    "response": " But why bother with crypto here? In a game the servers are already centralized and the source of truth.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "hqbckbf",
                                                            "author": "TheWazooPig",
                                                            "score": 0,
                                                            "created_utc": 1640720212.0,
                                                            "response": "The person who finds the loot would literally own it if it was associated with a public/private key pair",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "hqcf4xp",
                                                    "author": "thatdan23",
                                                    "score": 2,
                                                    "created_utc": 1640736243.0,
                                                    "response": "This is silly, there's no benefit to nfts where a regular centralized leger works just fine.  The game itself is already centralized anyway.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "hqca5to",
                                                    "author": "crewchiefguy",
                                                    "score": 1,
                                                    "created_utc": 1640734081.0,
                                                    "response": "It’s not much different than people selling rare items on video games right now.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "hqccbkm",
                                                    "author": "anaximander19",
                                                    "score": 1,
                                                    "created_utc": 1640735018.0,
                                                    "response": "Except that game servers are a closed ecosystem owned by the game's developer, so they can already do this without NFT, using the same mechanism they use to prove that you own a copy of the game itself. There's no use for a distributed, decentralised way to prove ownership of an asset that exists in a centralised, proprietary system.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "hqcoq3n",
                                                    "author": "1nternaut",
                                                    "score": 1,
                                                    "created_utc": 1640740511.0,
                                                    "response": "This exact thing was removed from Diablo 3 after it launched.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "hqawnph",
                                    "author": "Impressive_Oaktree",
                                    "score": 4,
                                    "created_utc": 1640713921.0,
                                    "response": "Already made a screenshot",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "hqcd67d",
                                    "author": "LiamYanon",
                                    "score": 1,
                                    "created_utc": 1640735385.0,
                                    "response": "I don't like mint",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "hqcjw6b",
                                    "author": "DomTrapGFurryLolicon",
                                    "score": 1,
                                    "created_utc": 1640738340.0,
                                    "response": "Lmaooo",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "hqao5it",
                            "author": "sheetchanger",
                            "score": 74,
                            "created_utc": 1640710559.0,
                            "response": "Thank you. This is the best description of NFTs I have ever seen. I learned a lot by reading. Thank you again for taking the time to type that up.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hqazqqn",
                            "author": "Cab000se",
                            "score": 8,
                            "created_utc": 1640715138.0,
                            "response": "Great writeup for those who don't do their own research,  well done and thank you!!",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hqb36tz",
                            "author": "winnebagomafia",
                            "score": 20,
                            "created_utc": 1640716507.0,
                            "response": "This is the dot com bubble all over again lmao",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hqchnw1",
                                    "author": "whistlerite",
                                    "score": 2,
                                    "created_utc": 1640737358.0,
                                    "response": "Yes. This may very well lead to the next dotcom bubble, the same signs are there.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "hqan0sq",
                            "author": "Roqot",
                            "score": 40,
                            "created_utc": 1640710114.0,
                            "response": "All I got from that is NFTs are made up and not worth a shred of what they claim to be worth. So, exactly how I thought of them before, rich person fraud like with art.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hqbl0pc",
                                    "author": "eqleriq",
                                    "score": 15,
                                    "created_utc": 1640723612.0,
                                    "response": "Then you're misunderstanding.\n\nAll an NFT boils down to is a token on a decentralized blockchain that proves ownership.\n\nTo say it's \"like art\" means you've taken the silly popular kernel of non-truth and applied to the entire concept. It's like a \"certificate of ownership\" for art, not the art itself.\n\nIf the entire world agreed that some contract was to be honored via a blockchain system + NFT, it would be far more efficient to check ownership than the current bureaucracy.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hqcrs99",
                                            "author": "AnalThermometer",
                                            "score": 8,
                                            "created_utc": 1640741888.0,
                                            "response": ">It's like a \"certificate of ownership\" for art, not the art itself.\n\nThat's the mindfuck, it isn't even a certificate of ownership for the art. That exists and is called copyright. An NFT is just a string and some optional metadata which may include a URI and is akin to owning a written description of an artwork but not the artwork itself.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "hqckbsy",
                                            "author": "Auctoritate",
                                            "score": 5,
                                            "created_utc": 1640738535.0,
                                            "response": ">All an NFT boils down to is a token on a decentralized blockchain that proves ownership.\n\nIt doesn't even necessarily prove ownership- someone could mint an NFT that points towards a URL hosting content that they don't own, like with all of the stolen artwork you often see with NFTs. That's one of the big reasons why the current use case isn't a good use of the NFT concept.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "hqcjvtf",
                                            "author": "x4nTu5",
                                            "score": 3,
                                            "created_utc": 1640738336.0,
                                            "response": "But if the \"certificate of ownership\" costs \"$100-600\" and whatever ungodly amounts of electricity just to mint, what's the real world incentive to switch to it over existing proofs of ownership methods?",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "hqaurv8",
                                    "author": "opposite_locksmith",
                                    "score": -1,
                                    "created_utc": 1640713175.0,
                                    "response": "Except there is only one original Van Gogh Starry Night and if you wanted to forge a perfect copy there are probably only a handful of people in the world capable of doing a passable job…",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hqbn64r",
                                            "author": "DoctorWaluigiTime",
                                            "score": 5,
                                            "created_utc": 1640724499.0,
                                            "response": "It's called the physical copy.\n\nTaking something that is inherently infinite (digital copies) and pretending there's One True Original Copy is backwards and just rife for exploitation and theft (both of which we've been seeing).",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hqcgpri",
                                                    "author": "whistlerite",
                                                    "score": 2,
                                                    "created_utc": 1640736939.0,
                                                    "response": "No, it’s more complex. Take for example a really popular song, let’s say a song by Drake. If that song plays on the radio in every country in the world every day, how many copies are there? Who owns the rights?",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "hqc46zj",
                                            "author": "hollyberryness",
                                            "score": 2,
                                            "created_utc": 1640731526.0,
                                            "response": "Anyone with a forged copy is the proud owner of a scam, lol. They might get bragging rights to a select crowd but there's no honor and no true ownership of the original that was touched and molded by the creator.  I can own a print of Starry Night without trying to pass it off as original, and I'll get just as much intrinsic value from it - but I'm not an art collector, so I don't care, I just think its pretty.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hqcgtpv",
                                                    "author": "whistlerite",
                                                    "score": 3,
                                                    "created_utc": 1640736986.0,
                                                    "response": "Exactly. You can record a song off the radio and tell people it’s your song, but does that mean you own it and have the rights to it?",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "hqb6hdz",
                                            "author": "PA2SK",
                                            "score": 2,
                                            "created_utc": 1640717805.0,
                                            "response": "There's no such thing as a \"perfect copy\".  You might be able to create a passable copy, but you're never going to create one that would be indistinguishable from the original.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "hqat8gt",
                            "author": "evilcheesypoof",
                            "score": 16,
                            "created_utc": 1640712568.0,
                            "response": "I kind of hate how NFTs and crypto have become synonymous with the general public, and they’ve just never been the same level of value to me.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hqb2b8g",
                                    "author": "Anna198655fg",
                                    "score": 0,
                                    "created_utc": 1640716160.0,
                                    "response": "What do you think it takes to get to the same level?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hqb4wpg",
                                            "author": "evilcheesypoof",
                                            "score": 2,
                                            "created_utc": 1640717185.0,
                                            "response": "Widespread practical use cases and proven store of value in theory and practice, which Bitcoin has proven IMO.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hqblarl",
                                                    "author": "eqleriq",
                                                    "score": 2,
                                                    "created_utc": 1640723727.0,
                                                    "response": "But you can easily do an NFT on the bitcoin blockchain, so.... not seeing the point? \n\nYou're lamenting how it is synonymous when it is just the public's viewpoint of one small aspect. Not any different than considering this subreddit to be synonymous with what those interested in bitcoin care about.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "hqchaj5",
                                                            "author": "whistlerite",
                                                            "score": 1,
                                                            "created_utc": 1640737194.0,
                                                            "response": "Yes. The real value is blockchain tech, which both are built on.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "hqakp1k",
                            "author": "TnekKralc",
                            "score": 20,
                            "created_utc": 1640709185.0,
                            "response": "Problem is that nfts are so broad of a term that is not very useable. Comparing a jpeg photo, a smart contract liquidity position and a playable card in a game and saying they are all the same doesn't make any sense",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hqare5z",
                                    "author": "Ceshomru",
                                    "score": 3,
                                    "created_utc": 1640711841.0,
                                    "response": "Definitely, with time the quality use cases will bear out. But I am not so sure the “art focused” NFT scene will die out as fast as people are saying. It will evolve and hopefully the other more affordable marketplaces rise up and level out the average price models. Its crazy to think that .08 eth is a “cheap” price to mint an NFT to most of the community.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "hqch0ev",
                                    "author": "whistlerite",
                                    "score": 4,
                                    "created_utc": 1640737070.0,
                                    "response": "No it does make sense because it’s just a technology, that’s the point. You could literally same all those EXACT same things about the internet so does that mean the internet is not usable?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "hqbytev",
                            "author": "Suppafly",
                            "score": 3,
                            "created_utc": 1640729278.0,
                            "response": "> It costs anywhere from $100-$600+ to mint an NFT on etһereum depending on the current gas fees and where you mint it. \n\nWhy?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hqc9avb",
                                    "author": "JSchuler99",
                                    "score": 4,
                                    "created_utc": 1640733706.0,
                                    "response": "Gas fees to the ethereum network.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "hqaou0r",
                            "author": "cipherblade_official",
                            "score": 11,
                            "created_utc": 1640710828.0,
                            "response": "Man this post was written so well, if I didn't know any better, I would have thought I wrote it myself.\n\nSome more information that debunks a lot of myths and misconceptions about NFTs and just how useful or useless they can be can be found in a recent post we wrote here -- https://cipherblade.com/blog/are-non-fungible-tokens-nfts-used-for-money-laundering/",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hqayec8",
                            "author": "TracerouteIsntProof",
                            "score": 9,
                            "created_utc": 1640714608.0,
                            "response": "> NFTs have some actual use cases, but what people are currently doing with them on altcoin platforms is not one of them.\n\nCould one of those \"actual use cases\" be something like a deed to a house or a stock certificate?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hqbax77",
                                    "author": "semtex87",
                                    "score": 12,
                                    "created_utc": 1640719562.0,
                                    "response": "The problem with using NFTs as proof of ownership for anything, is enforcement. Ownership is a human construct that only exists so long as you have the power, violent or otherwise, to enforce your claim.\n\nThe entire concept of NFTs being decentralized guts its utility before it even gets off the ground. For me to enforce a property ownership deed, I need an enforcement authority to recognize my claim and allow me to enforce it, like a judicial court system. Court systems already have established processes to do that, so NFTs are not solving anything that hasn't already been solved in that regard.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hqcky9h",
                                            "author": "whistlerite",
                                            "score": 8,
                                            "created_utc": 1640738815.0,
                                            "response": "We already have enforcement in place, it’s the law and the police. The technology behind ownership doesn’t have much effect on the enforcement. NFTs could potentially be implemented by governments in the back-end and you wouldn’t even know it.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hqcoqhd",
                                                    "author": "semtex87",
                                                    "score": 2,
                                                    "created_utc": 1640740516.0,
                                                    "response": "But why? What improvement would there be over the current system which for all intents and purposes works exactly as designed?\n\nOnce again, NFTs are a solution in search of a problem.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "hqc2rjy",
                                            "author": "TracerouteIsntProof",
                                            "score": 5,
                                            "created_utc": 1640730928.0,
                                            "response": "I recall quite a scandal with BofA ten years ago trying to foreclose homes that they could not reproduce the deeds for. Paper is unnecessary, NFTs solve the need to have a physical medium to show proof of ownership.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hqch4i2",
                                                    "author": "semtex87",
                                                    "score": 3,
                                                    "created_utc": 1640737120.0,
                                                    "response": "How would NFT's solve that? The same thing could occur, BofA does not possess the NFT deed and tries to foreclose on the house lol.\n\nLiterally nothing about that situation changes with an NFT.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "hqchpsb",
                                                            "author": "TracerouteIsntProof",
                                                            "score": 2,
                                                            "created_utc": 1640737382.0,
                                                            "response": "You can't foreclose if you can't produce the deed. That's what made 2010 so interesting - people got wise and started demanding BofA show proof. They couldn't, so the foreclosure couldn't go through.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "hqcokdb",
                                                                    "author": "semtex87",
                                                                    "score": 8,
                                                                    "created_utc": 1640740438.0,
                                                                    "response": "So the system...without NFTs....worked exactly as designed. So again, where would NFTs have changed that situation or made any improvement at all? Nowhere.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "hqc9zzf",
                                    "author": "JSchuler99",
                                    "score": 10,
                                    "created_utc": 1640734011.0,
                                    "response": "I also like the concept of anti counterfeiting. A digital certificate of authenticity. Paper certificate of authenticity are often easier to fake than the product they're authenticating. NFTs could be used here.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "hqcki95",
                                    "author": "whistlerite",
                                    "score": 1,
                                    "created_utc": 1640738615.0,
                                    "response": "Yes",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "hqaq5jo",
                            "author": "Ima_Wreckyou",
                            "score": 4,
                            "created_utc": 1640711353.0,
                            "response": "I'm not exactly sure how the tax law works in the US. But if they sell it to themselves for 100k and then some \"lucky crypto investors\" buys it from them at an incredible 90% discount for just 10k, doesn't that mean they have a 90k loss on the books they can use to compensate gains on other trades.\n\nI'm not asking because I want to use this as I live in a country that has no capital gains tax anyway. Just curious if there is something to my suspicion.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hqaumb4",
                                    "author": "silent_cat",
                                    "score": 5,
                                    "created_utc": 1640713112.0,
                                    "response": "> I'm not exactly sure how the tax law works in the US. But if they sell it to themselves for 100k and then some \"lucky crypto investors\" buys it from them at an incredible 90% discount for just 10k, doesn't that mean they have a 90k loss on the books they can use to compensate gains on other trades.\n\nAt a guess they can only deduct it if they also had to declare the 100k gain from the first sale.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hqb6qbt",
                                            "author": "Ima_Wreckyou",
                                            "score": 2,
                                            "created_utc": 1640717903.0,
                                            "response": "I mean they can mint the NFT on an account that isn't linked to them in any way",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "hqbtzp3",
                                    "author": "tri_wine",
                                    "score": 6,
                                    "created_utc": 1640727299.0,
                                    "response": "There is a whole huge set of tax rules called the \"related party\" rules that specifically handle self-dealing and family-dealing. You're not the first person to think of this.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hqcf3es",
                                            "author": "Ima_Wreckyou",
                                            "score": 1,
                                            "created_utc": 1640736224.0,
                                            "response": "Yeah but pseudonymous nature of crypto makes it extremely easy to hide the fact that it was yourself",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hqcfq9m",
                                                    "author": "tri_wine",
                                                    "score": 1,
                                                    "created_utc": 1640736502.0,
                                                    "response": "Oh I'm not arguing that. Just saying the rules are in place. If people break those rules, that's a different matter.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "hqaqqsi",
                            "author": "Ceshomru",
                            "score": 5,
                            "created_utc": 1640711584.0,
                            "response": "Not in disagreement for any of your point, but just wanted to state that Moonpay is an onramp for buying NFTs with a credit or debit card on opensea. So a purchase will appear to originate from Moonpay wallets even if the buyer used their own money via a debit card. Not saying Celebs aren’t lying but they could be using their own money through moonpay. Especially if they aren’t crypto literate.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hqavofx",
                                    "author": "9k3d",
                                    "score": 12,
                                    "created_utc": 1640713533.0,
                                    "response": "MoonPay paid Post Malone, Lil Baby, Future, other celebrities and and professional athletes and gave them bored ape NFTs. It's advertising and hyping people up making them think these NFTs are really valuable. MoonPay even paid for a 7 second clip of Post Malone pretending to purchase a bored ape to be included in his recent music video. Here is that music video: https://www.youtube.com/watch?v=Tc0tLGWIqxA&t=12s",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hqbkok3",
                                            "author": "rlly_new",
                                            "score": 10,
                                            "created_utc": 1640723473.0,
                                            "response": "Wow, that's amazing. Do people genuinely believe he'd give out advertisement like that for free?",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "hqbhjbm",
                            "author": "reddit4485",
                            "score": 5,
                            "created_utc": 1640722216.0,
                            "response": "https://digg.com/video/the-guy-who-stole-all-the-nfts-and-put-them-up-for-free-explains-why-the-whole-scene-is-a-scam\n\nThis guy made a Pirate Bay for NFTs and talks a lot about how ridiculous they are.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hqcjlje",
                                    "author": "whistlerite",
                                    "score": 3,
                                    "created_utc": 1640738209.0,
                                    "response": "Just because you can steal things doesn’t mean you have the rights to it. People can illegally download movies so does that mean the movie industry is doomed now?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "hqbdgb6",
                            "author": "jerseynate",
                            "score": 4,
                            "created_utc": 1640720569.0,
                            "response": "Amazing and insightful comment. Well done",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hqbsv7d",
                            "author": "No_Win_6729",
                            "score": 4,
                            "created_utc": 1640726837.0,
                            "response": "Good read, thanks",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hqcc2jn",
                            "author": "uyu_uyu",
                            "score": 3,
                            "created_utc": 1640734910.0,
                            "response": "Holy shit, this makes a lot of sence and answers many of my questions! Anyway, my friend is an artist and I find NFTs a very good thing for monetising your talent",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hqax7be",
                            "author": "Jerry13888",
                            "score": 2,
                            "created_utc": 1640714136.0,
                            "response": "I thought the point of NFTs was that they were hosted on ethereum itself and permanently on the blockchain but obviously not. I know storage on eth is super expensive so I guess that's why?\n\nBut isn't it stored on eth forever if you do it that way? Or you still have to pay per mb for storage or something?I guess I don't understand how eth stores thugs other than transactions so if someone could explain that, that would probably help!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hqb4tr8",
                                    "author": "BashCo",
                                    "score": 7,
                                    "created_utc": 1640717152.0,
                                    "response": "The vast majority of stuff happening on Ethereum is a marketing gimmick intended to prey on people who don't know any better. They rely entirely on tricking people who aren't able to verify their claims.\n\nIt says a lot about Ethereum that bored ape JPGs are the closest thing they have been able to get to an actual use case, even though it's originally Bitcoin technology which they have repurposed in ways that don't function as they claim.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "hqalwqd",
                            "author": "odraencoded",
                            "score": 4,
                            "created_utc": 1640709671.0,
                            "response": "> The current NFTs are useful for something\n\nSomething what?\n\nI honestly don't see how NFTs are better than just having one server holding all that data.\n\nAre you going to make DNS decentralized next?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hqam3c1",
                                    "author": "9k3d",
                                    "score": 13,
                                    "created_utc": 1640709745.0,
                                    "response": "The current NFTs are useful for laundering illegally acquired cryptocurrency as I explained above.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hqb04it",
                                            "author": "ebaley",
                                            "score": 9,
                                            "created_utc": 1640715293.0,
                                            "response": "And for ripping off suckers.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "hqardzc",
                                            "author": "odraencoded",
                                            "score": 2,
                                            "created_utc": 1640711839.0,
                                            "response": "I see. I thought you meant the technology was useful for something besides that, something that wasn't illegal.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hqcjs4b",
                                                    "author": "whistlerite",
                                                    "score": 1,
                                                    "created_utc": 1640738291.0,
                                                    "response": "It is.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "hqan925",
                                    "author": "Chazmer87",
                                    "score": 0,
                                    "created_utc": 1640710205.0,
                                    "response": ">I honestly don't see how NFTs are better than just having one server holding all that data.\n\nFind a game or service you used 20 years ago.  Are the servers still running?\n\nAnything on chain (which not all nft's are tbf) will still be there in 20 years.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hqb0qc7",
                                            "author": "ebaley",
                                            "score": 3,
                                            "created_utc": 1640715534.0,
                                            "response": "Don't most NFTs depend on URLs to jpegs etc?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hqb3tml",
                                                    "author": "Chazmer87",
                                                    "score": 1,
                                                    "created_utc": 1640716754.0,
                                                    "response": "A good nft will be on ipfs.  That's why I added the parenthesis.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "hqb6avv",
                                                            "author": "ebaley",
                                                            "score": 1,
                                                            "created_utc": 1640717733.0,
                                                            "response": "How can we be sure that's here to stay?",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "hqcd374",
                                                                    "author": "JSchuler99",
                                                                    "score": 2,
                                                                    "created_utc": 1640735349.0,
                                                                    "response": "While I think all existing NFTs are a scam. In theory, if the NFT was set up correctly (I have never seen one that is) anybody could run an IPFS node and host the content of their own NFT in a way that's still verifiable.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                },
                                                                {
                                                                    "id": "hqb87x7",
                                                                    "author": "Chazmer87",
                                                                    "score": 1,
                                                                    "created_utc": 1640718489.0,
                                                                    "response": "I'm repeating myself but nothing is guaranteed.\n\nBut a chain which generates money will last longer than a server which costs money.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "hqar8tb",
                                            "author": "odraencoded",
                                            "score": 1,
                                            "created_utc": 1640711780.0,
                                            "response": "> will still be there in 20 years\n\nWill it, tho?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hqas8kq",
                                                    "author": "Chazmer87",
                                                    "score": 0,
                                                    "created_utc": 1640712176.0,
                                                    "response": "Yeah, that's the whole point of a blockchain, it's economically viable to keep it running.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "hqaucjz",
                                                            "author": "jannuhat",
                                                            "score": 2,
                                                            "created_utc": 1640713005.0,
                                                            "response": "How is it economically viable to keep hosting an NFT that no one will ever buy?",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "hqawvog",
                                                                    "author": "Chazmer87",
                                                                    "score": 1,
                                                                    "created_utc": 1640714009.0,
                                                                    "response": "It's hosted on chain, the entire chain is economical, not the individual nft.\n\nThat's why miners get paid in the native token of the relevant chain.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "hqb1m1j",
                                                                            "author": "jannuhat",
                                                                            "score": 1,
                                                                            "created_utc": 1640715882.0,
                                                                            "response": "NFTs are not hosted on the chain",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "hqb304y",
                                                                                    "author": "Chazmer87",
                                                                                    "score": 1,
                                                                                    "created_utc": 1640716435.0,
                                                                                    "response": "A good nft will be hosted on ipfs. Which is a chain.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "hqb57vt",
                                                                                            "author": "jannuhat",
                                                                                            "score": 2,
                                                                                            "created_utc": 1640717308.0,
                                                                                            "response": "Hosted by whom? IPFS cleans files that aren't explicitly hosted by someone. If no one gives a shit about your NFT, that someone has to be you, or your NFT is gone.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        },
                                                                                        {
                                                                                            "id": "hqcdvuo",
                                                                                            "author": "JSchuler99",
                                                                                            "score": 2,
                                                                                            "created_utc": 1640735693.0,
                                                                                            "response": "Lol IPFS is certainly not a chain. Please educate yourself.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "id": "hqcecvu",
                                                                            "author": "JSchuler99",
                                                                            "score": 1,
                                                                            "created_utc": 1640735901.0,
                                                                            "response": "Miners are not paid to store the blockchain. Miners are paid to put work into the blockchain. In the case of ETH, the Ethereum foundation pays to host the chain and public nodes at an economic loss.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "hqcdqk8",
                                                                    "author": "JSchuler99",
                                                                    "score": 1,
                                                                    "created_utc": 1640735629.0,
                                                                    "response": "You've pinpointed the reason the entire etherum chain is not economical. Just because one user paid to add their own file one time does not give an economic incentive for all network users to store that file forever. This is why Bitcoin only allows asset settlement data to be stored on the chain (this is the only thing a blockchain is required for) NFTs can still be minted on BTC but only the proof of ownership is stored there, the rest of the data is the responsibility of interested parties to store.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "hqat2u8",
                                                            "author": "odraencoded",
                                                            "score": -1,
                                                            "created_utc": 1640712508.0,
                                                            "response": ">it's economically viable to keep it running\n\nHow does that make sense considering the ridiculous amount of electricity it consumes at its current scale?\n\nidk you, but I feel like it's more likely that, in 20 years time, legislation will kill the manifestation of crypto that promises today permanent NFT.\n\n20 years is a lot of time, and nothing can last forever. The pyramids aren't the same as the day they were built, and even marble statues haven't survived unscathed.\n\nI'm very skeptical of the idea that crypto will find its usefulness before it's rendered irrelevant.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "hqb0wnq",
                                                                    "author": "ebaley",
                                                                    "score": 1,
                                                                    "created_utc": 1640715604.0,
                                                                    "response": "> ridiculous amount of electricity\n\nCompared to what?",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "hqb7mjv",
                                            "author": "BashCo",
                                            "score": 1,
                                            "created_utc": 1640718256.0,
                                            "response": "A.) The vast majority of NFTs are not hosted on any blockchain. Typically they merely contain a URL to somebody's rented VPS that will expire in a couple years.\n\nB.) Most of the block chains right now will likely be inaccessible in 20 years. Even if we assume that people will actually care enough about them to maintain appropriate archives, the data they contain will be worthless and probably unreadable.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "hqcct31",
                                    "author": "JSchuler99",
                                    "score": 1,
                                    "created_utc": 1640735229.0,
                                    "response": "I also like the concept of anti counterfeiting. A digital certificate of authenticity. Paper certificate of authenticity are often easier to fake than the product they're authenticating. NFTs could be used here.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "hqck7zg",
                                    "author": "whistlerite",
                                    "score": 1,
                                    "created_utc": 1640738488.0,
                                    "response": "DNS? Are you referring to the Domain Name System which is literally as decentralized as it gets?!?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "hqcf7kb",
                            "author": "the_innerneh",
                            "score": 4,
                            "created_utc": 1640736275.0,
                            "response": "What's annoying is that most people learning about nft's only consider your examples, which is only the tip of the iceberg. Nft's are here to stay, but not the way you describe",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hqcpdc3",
                            "author": "loseineverything",
                            "score": 2,
                            "created_utc": 1640740798.0,
                            "response": "You aren’t completely wrong but you also aren’t close to right. If pumping a pfp project in price was easy, all of them would be successful. Yet 95+%fail. NFT collectibles will continue to grow and be the way new brands are launched.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hqaqvrn",
                            "author": "kerdoos",
                            "score": 3,
                            "created_utc": 1640711639.0,
                            "response": "This description even if true in some ways is very limited and very negative. You only show one side of the coin. The one you don't like bro.\n\nThere are a lot of uses for NFTs. Don't look at an NFT as if it was a picture, nobody cares about the picture. See it as it was a key because that is the way it has to be seen.\n\nNFTs are keys that open doors, either access to a DAO, either access some services, you can stake them to access rewards or private sales for some other content. There is a truck load of things yet to discover. \n\nAlso, NFTs are a new way for companies to start businesses owning their own liquidity and having each NFT holder as a shareholder in that company.\n\nSo obviously some clever people are using NFTs to do some arbitrage and crazy stuff to evade taxes or to lure some dudes but it is absolutely not the core of what an NFT is used for. It is not deviant at all, people that use it badly are the deviant ones. \n\nThis technology is here to stay weather you want it or not. Face it bro",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hqbqmex",
                                    "author": "pfohl",
                                    "score": 13,
                                    "created_utc": 1640725920.0,
                                    "response": "nothing you've said can't be done with traditional cryptographic methods and databases. NFTs just do it inefficiently via a blockchain.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hqcnu6j",
                                            "author": "heschtegh",
                                            "score": 3,
                                            "created_utc": 1640740109.0,
                                            "response": "Funny enough that was the argument against Bitcoin in the early days.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "hqaxq50",
                                    "author": "champak256",
                                    "score": 12,
                                    "created_utc": 1640714342.0,
                                    "response": "Reread his first paragraph.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "hqbbx80",
                                    "author": "Johnyahn2",
                                    "score": 7,
                                    "created_utc": 1640719962.0,
                                    "response": "NFTs don't add any functionality that doesn't already exist. It's completely pointless. Every \"use case\" for NFTs people bring up can already be done without NFTs.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "hqc6orf",
                            "author": "Emotional_Squash9071",
                            "score": 2,
                            "created_utc": 1640732581.0,
                            "response": "NFTs are just the extension of thought that Bitcoins artificial scarcity giving it value, taken to the logical extreme.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hqafaas",
                            "author": "dulb",
                            "score": 0,
                            "created_utc": 1640706967.0,
                            "response": "Check stacks nft its anchored on bitcoin",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hqak0ro",
                                    "author": "Kangaroo_Low",
                                    "score": 16,
                                    "created_utc": 1640708911.0,
                                    "response": "I don't think it matters which \"coin\" it uses, even on bitcoin, the issue here is that the utility right now is extremely limited.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "hqb01jx",
                                    "author": "ebaley",
                                    "score": 6,
                                    "created_utc": 1640715259.0,
                                    "response": "Uses a token. Liquid would be better.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "hqb82h9",
                                    "author": "BashCo",
                                    "score": 5,
                                    "created_utc": 1640718430.0,
                                    "response": "\"Stacks\" used to be called Blockstack, and before that it was called Onename. It seems like whenever they fail to gain traction, they just rebrand. Now they've even launched a shitcoin token, and I don't see why that would gain traction either.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "hqarxiz",
                                    "author": "vakeraj",
                                    "score": 2,
                                    "created_utc": 1640712053.0,
                                    "response": "Counterparty is far better than Stacks.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "hqauuef",
                            "author": "intergalactic-senses",
                            "score": -1,
                            "created_utc": 1640713203.0,
                            "response": "Also want to add a huge usecase you didn't mention. NFT's are actually awesome for the gaming industry. For example fortnite skins, those can be NFT's so people actually own their skins and can sell them to other people. Theres already an emergence of crypto gaming with NFT's but in its current state it needs some AAA companies to give the industry a boost as the games are pretty lack luster in terms of graphics and game play",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hqb9xhf",
                                    "author": "semtex87",
                                    "score": 11,
                                    "created_utc": 1640719170.0,
                                    "response": "Why would EpicGames allow re-selling of skins when they can just make people buy more skins from them? It makes no sense...",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hqbh2s8",
                                            "author": "Rich--D",
                                            "score": 3,
                                            "created_utc": 1640722029.0,
                                            "response": "Because by doing so they would add value to their game for the players, attracting more people to it and generating more profit.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hqbhuq5",
                                                    "author": "semtex87",
                                                    "score": 3,
                                                    "created_utc": 1640722342.0,
                                                    "response": "So why wouldn't they do this without an NFT and by using their already existing Epic Store?\n\nIf they wanted to do it, they could easily, with their already existing store and already existing technology. NFTs don't add any more functionality than what already exists.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "hqbyign",
                                                            "author": "Rich--D",
                                                            "score": 1,
                                                            "created_utc": 1640729154.0,
                                                            "response": "Because it wouldn't have 'NFT' in the name and therefore they wouldn't be boarding the NFT hype train. I read a few days ago that the search term 'NFT' recently surpassed 'crypto' for the first time.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "hqbzqao",
                                                                    "author": "semtex87",
                                                                    "score": 3,
                                                                    "created_utc": 1640729661.0,
                                                                    "response": "So then why even bother? The whole point of an NFT is that it's a publicly available ledger.\n\nWhy would a private game studio give a shit about making \"ownership\" of a digital asset like a skin or loot publicly available on a public ledger?\n\nThey wouldn't, therefore they wouldn't even bother using NFT tech without NFT hype because this is an easily solvable problem with a SQL database table.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "hqbg0yv",
                                            "author": "petburiraja",
                                            "score": 1,
                                            "created_utc": 1640721610.0,
                                            "response": "That would be a Chewbacca defense",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hqbgxsq",
                                                    "author": "semtex87",
                                                    "score": 4,
                                                    "created_utc": 1640721973.0,
                                                    "response": "Lol I mean yes, but seriously, Epic has zero obligation to allow skin re-selling or trading. They have a financial incentive to not allow it.\n\nThe biggest issue with this entire NFT conversation is that people only look at one side of the equation and completely leave out the perspective of these private companies. Sure, skin trading would be super cool, but if there's more money to be made, and more shareholder value to be created by not allowing skin trading, then that's exactly what will happen.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "hqbu1sg",
                                                            "author": "-Nelson-Muntz-",
                                                            "score": 1,
                                                            "created_utc": 1640727322.0,
                                                            "response": "The financial incentive is that another company will do it first and users will migrate to that company because they like the idea of buying/selling/trading skins.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "hqbuvyr",
                                                                    "author": "semtex87",
                                                                    "score": 3,
                                                                    "created_utc": 1640727665.0,
                                                                    "response": "Team Fortress 2 had that back in 2009 with hats and skins. Players would acquire RNG dropped rare loot and could trade it with other players. Shit the hat market still exists today with some super rare hats being valued at a few hundred dollars. TF2 still exists today and is nowhere near as popular as Fortnite is right now.\n\nPeople don't migrate to a company because they like the idea of buying/selling/trading skins, they play a game because they like the game.\n\nYour comment sounds awfully libertarian and this fake idea that humans will naturally reward companies that do good things, and punish those that don't. Except that's not how reality works, unfortunately, if it did EA wouldn't exist anymore.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "hqbve2w",
                                                                            "author": "-Nelson-Muntz-",
                                                                            "score": 1,
                                                                            "created_utc": 1640727874.0,
                                                                            "response": "I'm not trying to say that will be the only factor, of course they have to like the game too. I'm saying it will be one factor.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "hqbwy0t",
                                                                                    "author": "semtex87",
                                                                                    "score": 2,
                                                                                    "created_utc": 1640728518.0,
                                                                                    "response": "I don't disagree with you there, but it won't be NFTs that change that. Like I said, Valve already has a player loot trading system and has had one since early 2000s without ever needing NFTs to do it.\n\nFuture games won't rely on NFTs either for trading.",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "hqco6ak",
                                                                    "author": "chief167",
                                                                    "score": 2,
                                                                    "created_utc": 1640740263.0,
                                                                    "response": "no thats a stupid idea, because that company still cannot control what you do in video games.\n\nIF I create a company tomorrow with an NFT based marketplace to sell skins for Fortnite, I have absolutely no way to actually reflect those things in the game. There is no possibility for other companies to step in. Except create a whole different video game. Which is besides the point here.\n\nAnd if they would want skins marketplace in their new game, they can build a ..... MARKETPLACE.... and not use NFTs at all. Why bother when they can use a database?",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "hqcqcj8",
                                                                            "author": "-Nelson-Muntz-",
                                                                            "score": 1,
                                                                            "created_utc": 1640741236.0,
                                                                            "response": "The game companies themselves will create the NFTs. The advantage is that users can trade/sell the skins on their own without even needing to be logged into the game. What if you bought a rare skin and you wanted to sell it to someone? Can you do that now? You can... For credits....on their system/website. With NFTs you can sell them for $ out the trunk of your car.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "hqcn5m1",
                                            "author": "Scavenger53",
                                            "score": 1,
                                            "created_utc": 1640739805.0,
                                            "response": "Artificial scarcity can drive prices higher and they can take a % fee on EVERY trade between people, not just the initial sale",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hqcovgd",
                                                    "author": "semtex87",
                                                    "score": 2,
                                                    "created_utc": 1640740578.0,
                                                    "response": "Which they can already do with the Epic store if they wanted to. They already have a database which keeps track of which skins are in each account, NFTs don't add any additional functionality that doesn't already exist.\n\nSolution in search of a problem.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "hqbgkha",
                                            "author": "TORFdot0",
                                            "score": -1,
                                            "created_utc": 1640721826.0,
                                            "response": "Why would idiot gamers buy something as useless as a skin in the first place?",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "hqb75u4",
                                    "author": "NargacugaRider",
                                    "score": 5,
                                    "created_utc": 1640718074.0,
                                    "response": "You can do that without NFTs though? Look at TF2 and CSGO. \n\nSeems insanely unnecessary.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "hqcbait",
                                    "author": "MountainTurkey",
                                    "score": 2,
                                    "created_utc": 1640734571.0,
                                    "response": "People already buy and sell things in auction houses in games without the need for NFTs. Also steam marketplace does the same without a block chain as far as I know.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "hqce53b",
                                    "author": "_Pohaku_",
                                    "score": 2,
                                    "created_utc": 1640735805.0,
                                    "response": "How does the use of blockchain-based NFTs differ from a player being the owner of a limited edition skin in Fortnite, that is linked to their player profile in Epic’s database?",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "hqcnpe6",
                                    "author": "chief167",
                                    "score": 2,
                                    "created_utc": 1640740050.0,
                                    "response": ">For example fortnite skins, those can be NFT's so people actually own their skins and can sell them to other people.\n\nIf Epic wanted to allow people to sell their skins amongst each other, they can easily do that without NFTs. And if Epic doesn't want to do that, transferring an NFT will have absolutely no impact on the Epic servers and no skin transfer will happen.\n\nAnd setting up your own marketplace outside of the Epic control is just not gonna happen because you cannot update the video game code.\n\nI swear, all the idiots pushing these game asset ideas have no clue how computers work",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "hqbjxto",
                                    "author": "GoingToSimbabwe",
                                    "score": 3,
                                    "created_utc": 1640723169.0,
                                    "response": "What’s the advantage over simple server sided solutions here? Cs:go skins can be sold just fine without NFTs involved.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hqcogz1",
                                            "author": "chief167",
                                            "score": 1,
                                            "created_utc": 1640740396.0,
                                            "response": "and is a lot faster. You want it? You pay, you get it. With NFTs it can take a while before they are confirmed. That would be horrible user experience. But nobody in this thread seems to think more than 3 seconds.\n\nI hope NFTs die because djeezes",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "hqc8cbs",
                                    "author": "laiod",
                                    "score": 2,
                                    "created_utc": 1640733292.0,
                                    "response": "Gaming is already monetized enough. This just makes it more of a nightmare.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "hqb75th",
                            "author": "sofa_king_we_todded",
                            "score": 1,
                            "created_utc": 1640718073.0,
                            "response": "This is spot on. Thanks for the write up. Only nfts that are decentralized should be worth anything",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hqb383b",
                            "author": "tbenge05",
                            "score": 0,
                            "created_utc": 1640716521.0,
                            "response": "Love it. What are your thoughts on the inclusion in video games? Seeing so much hate around Ubisoft for the currently unreleased and still in Beta Quartz platform. I feel like it's so misplaced - currently when buying in game cosmetics, those items disappear once a new iterations of the game occur, NFT sounds/seems like a way to externalize these purchases so they can be carried over to new iterations. Considering games are usually developed on a similar engine with publishers it would be easy for them to make this happen as the data could easy be interpreted between generations. As for the NFT being trustworthy, having a long standing institution/company such as Ubisoft backing it feels better than an alt-coin which only appeared a year or two ago.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hqbtdwz",
                                    "author": "lordlurid",
                                    "score": 5,
                                    "created_utc": 1640727050.0,
                                    "response": ">currently when buying in game cosmetics, those items disappear once a new iterations of the game occur, NFT sounds/seems like a way to externalize these purchases so they can be carried over to new iterations. \n\nThis can be done just as easily without the need for NFTs. Game developers do not have an incentive to do this because they want users to buy new items every time they make a new game. They have zero financial incentive to do this, and NFTs wouldn't be the way even if they did.\n\n>Considering games are usually developed on a similar engine with publishers it would be easy for them to make this happen as the data could easy be interpreted between generations.\n\nNo, it wouldn't. The only way to make this work is to not only develop all the games in the same engine, but also standardize all animations / models / cosmetics / items across the entire ecosystem. It also means whatever design decisions are made when this is implemented are permanent; changing them will break your in game item. So now whatever developer decides to do this is stuck with that system, forever. Major changes and innovation are now more difficult. \n\n> As for the NFT being trustworthy, having a long standing institution/company such as Ubisoft backing it feels better than an alt-coin which only appeared a year or two ago.\n\nHaving your purchase backed by a central authority defeats the entire purpose of purchasing anything backed by a blockchain. Either it's an NFT, or it's backed by Ubisoft, doing both makes zero sense.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "hqc48ih",
                            "author": "Elymanic",
                            "score": 0,
                            "created_utc": 1640731544.0,
                            "response": "I didn't read it, but here's a award",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hqbkmxb",
                            "author": "seizethatcheese",
                            "score": -1,
                            "created_utc": 1640723455.0,
                            "response": "Would a reputable NFT marketplace solve the problem of server owners discontinuing the storage of nfts",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hqba4k2",
                            "author": "brandononandon",
                            "score": 1,
                            "created_utc": 1640719248.0,
                            "response": "What happens if no one buys the minted NFT? Is it just stored value at that point?",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hqbdsy8",
                            "author": "greeneggsnhammy",
                            "score": 1,
                            "created_utc": 1640720712.0,
                            "response": "Tl;dr.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hqbqwk9",
                            "author": "exab",
                            "score": 1,
                            "created_utc": 1640726034.0,
                            "response": "What are some legit use cases of NFTs?",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hqbyfnq",
                            "author": "Cakeo",
                            "score": 1,
                            "created_utc": 1640729122.0,
                            "response": "Tldr",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hqc9bof",
                                    "author": "JSchuler99",
                                    "score": 1,
                                    "created_utc": 1640733715.0,
                                    "response": "NFTs are a scam",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "hqccwig",
                            "author": "ThrowingChicken",
                            "score": 1,
                            "created_utc": 1640735270.0,
                            "response": "Since you brought up Beeple, what happens to his newfound fortune when this shit crashes?  If he’s wise can he check out unscathed or is it all tied to this rickety system?",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hqcfeo8",
                            "author": "GoAheadMakeMySplay",
                            "score": 1,
                            "created_utc": 1640736362.0,
                            "response": "I find it amusing that until NFTs became \"a thing\" if you talked about the \"nifty archive\" on the internet, you were referring to a library of highly questionable pornographic text content",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hqclj8m",
                            "author": "Googooboyy",
                            "score": 1,
                            "created_utc": 1640739074.0,
                            "response": "Sure, the image itself may be gone one day, but the ‘ownership’ hasn’t. \n\nThat ‘It may be a dick pic in a decade’ is a risk that 99.99% of buyers are happily ignorant of.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hqcp93h",
                            "author": "addictedtoPCs",
                            "score": 1,
                            "created_utc": 1640740747.0,
                            "response": "Ok, but like why are all NFTs monkeys?",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hqbbsiw",
                            "author": "churm94",
                            "score": -6,
                            "created_utc": 1640719908.0,
                            "response": "Imagine wasting precious moments of your life that you will never get back explaining frucking NFTs on reddit lmao\n\n\nJesus Christ",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hqazp5b",
                            "author": "ebaley",
                            "score": -2,
                            "created_utc": 1640715121.0,
                            "response": "No mention of Liquid as an alternative?",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hqbyxqu",
                            "author": "familygamereview",
                            "score": -1,
                            "created_utc": 1640729328.0,
                            "response": "If this is true. Jack dorsey should be sued for being one of the first to push this scam.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hqae6h0",
                    "author": "darkmage1001",
                    "score": 50,
                    "created_utc": 1640706504.0,
                    "response": "I cant wait till these nfts go to 0 as real use case nfts start being made and used.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hqbhzoc",
                            "author": "icepickjones",
                            "score": 19,
                            "created_utc": 1640722397.0,
                            "response": "Right? Why are the dumbest people gloming on to this shit? \n\nNFTs as beanie babies is not the fucking future. This technology can do so much more and it's like someone early on said \"hey a token proof of ownership could be like tied to a collectible or something maybe\" and everyone just stopped there. \n\nSomeone else come up with a better idea, we don't have to go with the first thing you guys.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hqcn9kg",
                                    "author": "redpandarox",
                                    "score": 2,
                                    "created_utc": 1640739854.0,
                                    "response": "There’s no better idea than minting a JPEG and selling it for millions of dollars, unfortunately.\n\nEven if other applications for NFTs are invented, if it’s not as profitable as monkey JPEGs then the monkey JPEGs fad will last.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "hqbgpn8",
                            "author": "Varrus15",
                            "score": 4,
                            "created_utc": 1640721883.0,
                            "response": "I already have Nfts on defi sites that give bonuses to certain pools or increase earnings in game fi, etc",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hqankw2",
                            "author": "rKcEIIbS1",
                            "score": -1,
                            "created_utc": 1640710335.0,
                            "response": "Its also sad that time passes by so quick. When are you going to fund your own immortality lab? Need more investment in that topic asap.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hqahuf8",
                    "author": "capnwinky",
                    "score": 15,
                    "created_utc": 1640708025.0,
                    "response": "Don’t you mean a Doom WAD",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hqajdce",
                            "author": "brainleak",
                            "score": 12,
                            "created_utc": 1640708649.0,
                            "response": "It's a term lost over the years, sadly",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hqbhk08",
                            "author": "PmulsAllOver",
                            "score": 8,
                            "created_utc": 1640722223.0,
                            "response": "OK Doomer",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hqalujp",
                    "author": "Xenepa",
                    "score": 34,
                    "created_utc": 1640709647.0,
                    "response": "I've been \"in\" bitcoin for years, I understand it, I like it. \n\nBut NFTs? Those I don't understand",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hqamm5z",
                            "author": "NDC03",
                            "score": 11,
                            "created_utc": 1640709953.0,
                            "response": "Unenforceable ownership dees.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hqb5422",
                            "author": "fakehalo",
                            "score": 3,
                            "created_utc": 1640717266.0,
                            "response": "Like with any new tech it gets overblown into exuberance and nonsense, I suspect NFTs will not fair well long term... at least as they stand currently without anything truly backing the ownership rights.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hqchyxc",
                            "author": "cyclicamp",
                            "score": 3,
                            "created_utc": 1640737495.0,
                            "response": "Don’t remember colored coins? Same thing",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hqb1wh9",
                            "author": "Michael__X",
                            "score": 13,
                            "created_utc": 1640715999.0,
                            "response": "I'm gonna screenshot your BTC balance and save it to my phone.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hqbj3mz",
                                    "author": "putyograsseson",
                                    "score": 3,
                                    "created_utc": 1640722836.0,
                                    "response": "bully",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "hqb13ue",
                            "author": "ebaley",
                            "score": 1,
                            "created_utc": 1640715683.0,
                            "response": "Me too. The only truly scarce digital asset is Bitcoin.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hqbll5g",
                                    "author": "AmazingSuperPupils",
                                    "score": 4,
                                    "created_utc": 1640723846.0,
                                    "response": "its tokenizing digital assets, its not trying to be bitcoin",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hqbmth6",
                                            "author": "ebaley",
                                            "score": 2,
                                            "created_utc": 1640724356.0,
                                            "response": "Not truly scarce though.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "hqbom0p",
                            "author": "yazyoga",
                            "score": 1,
                            "created_utc": 1640725089.0,
                            "response": "Nothing really to understand. Digital files on some alt coin ledger that anyone technically savvy can copy.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hqak448",
                    "author": "Virtual-Zucchini9692",
                    "score": 5,
                    "created_utc": 1640708948.0,
                    "response": "It's missing the part where I mint my own NFT with the screenshot of the NFT. What a joke!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hqas6aa",
                    "author": "YISTECH",
                    "score": 16,
                    "created_utc": 1640712150.0,
                    "response": "this is just peak comedy",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hqakw68",
                    "author": "jojosjots",
                    "score": 4,
                    "created_utc": 1640709264.0,
                    "response": "Where can you play this?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hq9y4up",
                    "author": "oydero",
                    "score": 22,
                    "created_utc": 1640699009.0,
                    "response": "you've made my day",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hqaafrj",
                    "author": "ItsThatDeutschBag",
                    "score": 9,
                    "created_utc": 1640704918.0,
                    "response": "The real meta thing to do would be to mint a playthrough as an NFT!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hqced52",
                    "author": "UrsoKronsage",
                    "score": 3,
                    "created_utc": 1640735905.0,
                    "response": "Take NFTs, print them on cardboard coins, bring back pogs",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hqa3n7n",
                    "author": "punto-",
                    "score": 19,
                    "created_utc": 1640701804.0,
                    "response": "Why not just use the NFT directly ? The data is available, that's a feature, NFT is not a copy protection scheme",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hqa4idm",
                            "author": "TheLastLivingBuffalo",
                            "score": 61,
                            "created_utc": 1640702210.0,
                            "response": "It’s a joke. People who don’t know a lot about NFTs and purchased them for their twitter profile pictures were getting mad that people were “stealing” them by right click saving them.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hqbz1l9",
                                    "author": "Adequatequine84",
                                    "score": -1,
                                    "created_utc": 1640729372.0,
                                    "response": "Yes, that 35-72.8% tax on cars is something people are loving to pay.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "hqa4mke",
                            "author": "No-Sheepherder3272",
                            "score": 20,
                            "created_utc": 1640702264.0,
                            "response": "I think the point is that NFTs are actually not unique and there is nothing stopping anyone from copy-pasting them. Whatever it is that you are owning for money, for free you can use the screenshot key and get the same thing.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hqb174u",
                                    "author": "unknownemoji",
                                    "score": 10,
                                    "created_utc": 1640715718.0,
                                    "response": "NFTs don't grant you ownership of anything except the token itself.\n\nIt's just a string of bits. It may refer to a location on a chain somewhere, that then refers to a file somewhere, but it's still just a token.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "hqa51jb",
                                    "author": "Yung_WhiteSauce",
                                    "score": 2,
                                    "created_utc": 1640702460.0,
                                    "response": "I can take as many pictures of the Mona Lisa as I want, that doesn’t mean I own it.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hqbfpry",
                                            "author": "joyofsteak",
                                            "score": 5,
                                            "created_utc": 1640721485.0,
                                            "response": "Taking a picture of the mona lisa doesn’t create a 1:1 perfect copy of it, while saving an NFT does.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "hqal44h",
                                            "author": "Virtual-Zucchini9692",
                                            "score": 5,
                                            "created_utc": 1640709351.0,
                                            "response": "NFT doesn't prove ownership. It just proves you have a hash. And anyone with a screenshot can simply make another hash.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "hqa5l9u",
                                            "author": "LukinLedbetter",
                                            "score": 44,
                                            "created_utc": 1640702721.0,
                                            "response": "Imagine, comparing the centuries-old Mona Lisa from a world-renowned artist and scientist to a bouncy bunny gif from spacehammer69.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hqa5smy",
                                                    "author": "Yung_WhiteSauce",
                                                    "score": -14,
                                                    "created_utc": 1640702817.0,
                                                    "response": "Imagine not understanding the concept of a copy not being the minted original",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "hqa5zzx",
                                                            "author": "LukinLedbetter",
                                                            "score": 49,
                                                            "created_utc": 1640702913.0,
                                                            "response": "My point is, people have to give a shit about the original.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "hqaxn5j",
                                                                    "author": "Equal_Palpitation_26",
                                                                    "score": 2,
                                                                    "created_utc": 1640714309.0,
                                                                    "response": "Christie's and Sotheby's clearly doesn't give a shit about NFT originals",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                },
                                                                {
                                                                    "id": "hqbd3zg",
                                                                    "author": "0Bento",
                                                                    "score": 2,
                                                                    "created_utc": 1640720431.0,
                                                                    "response": "To be fair I enjoyed it when those guys burned the Banksy and then sold \"it\" as an NFT.  That was peak 2021 and actually an interesting artistic concept.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                },
                                                                {
                                                                    "id": "hqa6txt",
                                                                    "author": "Yung_WhiteSauce",
                                                                    "score": -28,
                                                                    "created_utc": 1640703301.0,
                                                                    "response": "And in the meta verse, and on the blockchain where it is minted and verified, they do.\n\nYou can save it in your phone pictures as much as you want. If you don’t have the actual image minted in your wallet, it’s not the actual image, just a copy. The value is determined in the market place, not in the photos folder on your phone.\n\nI get the joke, but it’s basic FUD trying to steer people away from crypto obviously led by boomer institutions terrified of change. Like the “expert analysts” that said the Internet was just a fad and would be over soon. How does a website have meaning? It’s nothing tangible, yet domains have immense value.\n\nNFTs are at the point right now where the internet was in 1996. Visionaries saw it’s potential to be great, and others got left in the dust.\n\nThat’s my point.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "hqa8ztp",
                                                                            "author": "ImanShumpertplus",
                                                                            "score": 24,
                                                                            "created_utc": 1640704290.0,
                                                                            "response": "dude NFT’s have uses, but it’s not art\n\nNFT’s should be used instead of digital tickets that give a kickback to the performer if they’re resold (fuck stubhub). have you heard of GET protocol?\n\nthe way you are trying to use NFT’s is the same way the dutch used tulips and america used CDOs and credit default swaps. it’s a great asset, until it isn’t",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "hqat7vq",
                                                                                    "author": "wagnerseth",
                                                                                    "score": 4,
                                                                                    "created_utc": 1640712562.0,
                                                                                    "response": "Why would you want to make/maintain a permanent Blockchain entry for a concert ticket that will only be useful at one moment in time? It seems super wasteful to continue to store/manage/maintain and bring forward every concert ticket to every event ever that has already occured in the past.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "hqau0tf",
                                                                                            "author": "ImanShumpertplus",
                                                                                            "score": 0,
                                                                                            "created_utc": 1640712876.0,
                                                                                            "response": "you realize cryptocurrency at their full deployment would log every single transaction made on planet earth?\n\ni bet there’s less ticket sales in a year than transactions made on exchanges\n\nplus a smart contract gives the money to the venue and the performer, getting rid of the 20-40% ticketmaster and stubhub charges, dropping prices for everyone",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "id": "hqb1q00",
                                                                                    "author": "Michael__X",
                                                                                    "score": 1,
                                                                                    "created_utc": 1640715927.0,
                                                                                    "response": "You can do that on AWS. \n\nAlso you can sell the wallet with the tickets and not pay the artists. From a quick look at get protocol looks like the tickets are qr codes, shit you can sell those too. The kickback thing is the biggest crypto meme",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "id": "hqa8o9k",
                                                                            "author": "0Bento",
                                                                            "score": 28,
                                                                            "created_utc": 1640704146.0,
                                                                            "response": "I accept that NFTs may have future utility, but at the minute it's entirely a speculative bubble built on hype with a little bit of scamming and money laundering on the side.\n\nA copy of the Mona Lisa is a copy.  A copy of NFT art is **exactly the same data.**  Identical.  So it's not exactly a perfect analogy.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "hqacicb",
                                                                                    "author": "HODL_monk",
                                                                                    "score": 10,
                                                                                    "created_utc": 1640705800.0,
                                                                                    "response": "I don't even accept that NFT's will even have future utility (!!) The best case is that NFT's become a digital baseball card that costs $50 in gas to trade... A copy of NFT art is in fact actual viewable art, but an NFT is just a blockchain link to a website, so the copy is actually demonstrably BETTER than the original NFT, because if the NFT promoter goes out of business, the copy still shows the art, but the original is now a link to a 404 file not found (!!)",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "hqaf8pq",
                                                                                            "author": "Melodic_Ad_8747",
                                                                                            "score": 1,
                                                                                            "created_utc": 1640706948.0,
                                                                                            "response": "Concert tickets, at posted above. A unique item that could be sold to someone else but not duplicated.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "id": "hqadu3n",
                                                                            "author": "HODL_monk",
                                                                            "score": 6,
                                                                            "created_utc": 1640706358.0,
                                                                            "response": "NFT's usually do not contain the image they purport to 'own' , just a web link to the promoter's website, so even the NFT's owner might want to make a copy of the image, in case the promoter goes full Music Man on them. NFT's also do not grant legal ownership of the underlying artwork, unless they contain some special legal contract, which almost none of them do. You just cannot compare the internet to an NFT, the internet is useful to everyone in the world, an NFT, even if fully successful, will only be a digital baseball card. And since there are already millions of NFT's, with tens of thousands more minted daily, it seems highly unlikely these things will even be worth the gas to mint them in the long term, unless there is something exceptional about them, and 99.9 % of them are just crude JPG art. I would say a single issue NFT of a popular meme's artwork may hold value, but 1 of 10,000 jpg rocks, this is some tulip bulb stuff here.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        },
                                                                        {
                                                                            "id": "hqael0n",
                                                                            "author": "Stormegeddon101",
                                                                            "score": 5,
                                                                            "created_utc": 1640706672.0,
                                                                            "response": "You’re coping",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        },
                                                                        {
                                                                            "id": "hqb59jj",
                                                                            "author": "nyaaaa",
                                                                            "score": 3,
                                                                            "created_utc": 1640717325.0,
                                                                            "response": "> NFTs are at the point right now where the internet was in 1996.\n\nNFTs are at the point right now where ICOs were in 2017",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        },
                                                                        {
                                                                            "id": "hqa8s5t",
                                                                            "author": "froggyg1993",
                                                                            "score": 10,
                                                                            "created_utc": 1640704195.0,
                                                                            "response": "but with an NFT you don't own the picture either\n\n&#x200B;\n\nNFTs are more akin to treasure maps then actual pictures, all they do in the majority of cases is point to the URL where the actual picture is stored. And there is no legal precedent for the owner of an NFT to actually own the picture. What's to stop someone creating the NFT you own 10 or 100 times or even across various blockchain?\n\n&#x200B;\n\nthe whole NFT thing is just a great fool at this point.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "hqacrd8",
                                                                                    "author": "xrv01",
                                                                                    "score": 3,
                                                                                    "created_utc": 1640705908.0,
                                                                                    "response": "treasure maps and serial numbers",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                },
                                                                                {
                                                                                    "id": "hqab5ft",
                                                                                    "author": "11yearoldsxqck",
                                                                                    "score": 3,
                                                                                    "created_utc": 1640705224.0,
                                                                                    "response": "\"Fool\" is not understanding that you can virtually and mentally own anything that you want to own, it's just some people place value in proof of that ownership. Thinking that this is not something that even ordinary people do every day is just ignorant as shit.\n\nSome people don't care how many copies something has or how many people have interacted with them or consider it their own, as long as you have a proof of ownership to it then there's nothing else left to care about. \n\nWhether people require some made up lines of code or some shit or their own conviction is subjective, but the whole idea is not any more dumber than 99% of things people do in their lives.",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "id": "hqa8h73",
                                                                            "author": "AgileGlove",
                                                                            "score": 7,
                                                                            "created_utc": 1640704058.0,
                                                                            "response": "I'm not really taking any sides but I just wanted to ask whether it's fair to compare NFTs (art) to the mona lisa (art) and then NFTs (art) to the internet (utility).\n\nPeople didn't believe in the internet as a tool, and these \"expert analysts\" were short visioned and not creative enough to imagine that one day it wouldn't be 1mb/hour but 5gb/second.\n\nBut art is to be seen and admired, the mona lisa is famous for its history as well as its technique. On this sense, all NFTs have a similar structure and though the blockchain is to be admired too, the visual part is available for everyone to download and conserve in our wallets. \n\nRight? I'm still new to all this too",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "hqcct5f",
                                                                                    "author": "MrFrisB",
                                                                                    "score": 2,
                                                                                    "created_utc": 1640735230.0,
                                                                                    "response": "I think the problem in this comparison is that the NFT is not art. An NFT is like a deed but there’s no real authority of who can create the deed to what, and although it can be traded and ownership of the NFT can be validated, a digital copy of the original digital asset is fully lossless, so it is manufactured scarcity of something that previously wasnt.",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "id": "hqaf0ed",
                                                                            "author": "Melodic_Ad_8747",
                                                                            "score": 3,
                                                                            "created_utc": 1640706851.0,
                                                                            "response": "tHe MetAvErsE peoPle CaRE",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        },
                                                                        {
                                                                            "id": "hqbirxf",
                                                                            "author": "icepickjones",
                                                                            "score": 2,
                                                                            "created_utc": 1640722708.0,
                                                                            "response": ">NFTs are at the point right now where the internet was in 1996. Visionaries saw it’s potential to be great, and others got left in the dust.\n\nExactly. This is just like the late 90's. And just think about all the fucking stupid shit that happened on the internet that died in those early test phase days. \n\nCollectables are not the end use case for NFTs, they are literally the stupidest base line nonsense first idea. When this dumb bubble bursts we will get to see the REAL applications of the tech. \n\nAnd guess what? It's not going to be fun speculative bullshit, it's going to be boring ass stuff like insurance processing and contract documentation. Digital notary and shit like that. That's where these tokens will be used - to amplify the pipeline and optimize logistics, not to collect tulips to trade between idiots.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        },
                                                                        {
                                                                            "id": "hqa86ql",
                                                                            "author": "Wellhellob",
                                                                            "score": 2,
                                                                            "created_utc": 1640703926.0,
                                                                            "response": "i don't get this tech. any source for eli5 ?",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "hqb5qh9",
                                                            "author": "nyaaaa",
                                                            "score": 2,
                                                            "created_utc": 1640717509.0,
                                                            "response": "Anyone can pay pointless overpriced eth fees to mint the same thing with the same link changing one of the other inputs, having an NFT of the same thing.",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "hqafgfi",
                                                            "author": "No-Sheepherder3272",
                                                            "score": 1,
                                                            "created_utc": 1640707039.0,
                                                            "response": "It is impossible to copy the brushstrokes of Leonardo da Vinci and his choice of pigmentation precisely in a replica. Convincing enough people believe in something will not make it true. It is the downside of being a digital creator of anything. Bitcoin is the only thing that breaks that boundary and that is why it is unique and valuable.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "hqavtm0",
                                                                    "author": "davepsilon",
                                                                    "score": 2,
                                                                    "created_utc": 1640713590.0,
                                                                    "response": "Digital you can own the rights to it.  You can't stop people from copying it.  Bit if you own it you could legally stop someone from using it.  Of they are a small fish that's going to be expensive relative to the payoff, but sometimes you catch a big fish",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "hqb627h",
                                                                            "author": "nyaaaa",
                                                                            "score": 2,
                                                                            "created_utc": 1640717638.0,
                                                                            "response": "Show me the law that gives you any rights for owning a \"NFT\" over any associated digital asset.\n\nIf you get any rights, they are all transferred seperate from the NFT.\n\nThe NFT adds no value over a contract on a piece of paper.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "hqb9bal",
                                                                                    "author": "davepsilon",
                                                                                    "score": 1,
                                                                                    "created_utc": 1640718924.0,
                                                                                    "response": "That's thinking about the current state and likely would remain true between the creator and first owner.  NFT offers an advantage if you imagine a robust resale market.  In that the current NFT owner can 'prove' they have a marketable title to the digital rights.   Sometimes it's not just what is possible in the abstract, but also how easy and costly or cheap it is.  NFTs *are* useful when you want to have transferable, digital ownership.  Just that sort of thing isn't a broadly needed thing.",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "hqapnsg",
                                                            "author": "FiTZnMiCK",
                                                            "score": 1,
                                                            "created_utc": 1640711155.0,
                                                            "response": "Except, if it’s simply a jpeg stored somewhere, a copy is in all practical sense the original.\n\nNFTs confer ownership of the original, but unlike ownership of a physical good NFTs in and of themselves do not prevent others from possessing or enjoying the thing that is owned.\n\nYou can go down the path of enforcing a copyright, but good fucking luck with that, Barbra Streisand.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "hqbn8a2",
                                            "author": "knoldpold1",
                                            "score": 2,
                                            "created_utc": 1640724524.0,
                                            "response": "True, but you can't go up to the Mona Lisa painting and walk away with a 100% perfect exact replica to hang up in your living room.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "hqbf24w",
                                            "author": "etheran123",
                                            "score": 1,
                                            "created_utc": 1640721216.0,
                                            "response": "You also don't own what the NFT is depicting.  You own rhe receipts.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "hqagkmy",
                                    "author": "vancity-",
                                    "score": 3,
                                    "created_utc": 1640707504.0,
                                    "response": "A big thing a _lot_ of people miss is that the smart contract that owns the NFT is capable of more than just pointer to jpeg.\n\nProgrammable attributes are a pretty big deal here because it means you can have complex data attached to an asset. That's important for complex digital assets.\n\nThat means you can define HP, DPS, weapon type for those stupid apes in OPs GIF. Then bored apes can be added to any game that would want them.\n\nAnd if instead of a jpeg ape, it was a fully rigged and animated game model, well then you have something quite interesting.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "hqaf6i9",
                                    "author": "KusanagiZerg",
                                    "score": 1,
                                    "created_utc": 1640706922.0,
                                    "response": "> Whatever it is that you are owning for money, for free you can use the screenshot key and get the same thing.\n\nAnd nobody disputes that nor are NFT's created to prevent that. Anyone is free to copy and paste the images themselves. At least understand the thing you are arguing against otherwise you are just like the people who bash Bitcoin for invalid reasons.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "hqa62zl",
                            "author": "lihaarp",
                            "score": 5,
                            "created_utc": 1640702951.0,
                            "response": "As in, grabbing a bunch of random NFT from the net on each level load? I like this idea. Adds a whole new level of meta.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hqa8ifp",
                    "author": "Kingshitshow",
                    "score": 5,
                    "created_utc": 1640704074.0,
                    "response": "Hahaha, beautiful.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hqaqu1t",
                    "author": "jettcyt",
                    "score": 13,
                    "created_utc": 1640711621.0,
                    "response": "NFTs are a scam and you can’t change my mind",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hqcdl2g",
                            "author": "bitbot9000",
                            "score": 10,
                            "created_utc": 1640735563.0,
                            "response": "The concept and tech seems legit. The way it’s being used right now is 100% a scam.\n\nIt becomes legit only when:\n\nA) international law recognizes the ownership established by an NFT. Until then you are just play pretending you own something that you don’t.\n\nB) The data (and not a link to it) is stored in the blockchain.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hqbf5bf",
                            "author": "Kojinto",
                            "score": -6,
                            "created_utc": 1640721253.0,
                            "response": "Ok Boomer",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hqclu4k",
                            "author": "BankerWhoLeavesAt420",
                            "score": -2,
                            "created_utc": 1640739210.0,
                            "response": "Never heard of a scam that gives you money lol, sign me up!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hqaa5r6",
                    "author": "11yearoldsxqck",
                    "score": 6,
                    "created_utc": 1640704799.0,
                    "response": "As if anyone  would want a fucking monkey or pixel trash",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hqbxrbt",
                    "author": "milthaar2",
                    "score": 2,
                    "created_utc": 1640728847.0,
                    "response": "So i have a question.\n\nSo when i buy an nft of an artwork or the first YouTube video. Al thats happening is that my name gets put on a list that should prove ownership.\n\nBuy heres the thing: why should anyone recognize the nft when it comes to ownership? In the real world. The government enforces contracts. Thats what makes them legit. Who enforces nft's? \n\nIf i buy a house and upload a copy online somewhere. Lets say someone makes an nft of the contract. Would the house then be his or hers? Would  the contract not be mine anymore? And again who would enforce the legitimacy of an nft? And why should anyone care what some online proof of ownership says?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hqcln72",
                    "author": "Rollinrollin1000",
                    "score": 2,
                    "created_utc": 1640739123.0,
                    "response": "Yeah but the final boss is a level based on the louvre and the Mona Lisa doesn't die no matter how many times you take a pic.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hqa74an",
                    "author": "Starkgaryen69",
                    "score": 6,
                    "created_utc": 1640703435.0,
                    "response": "Lmaoo, Im fucking dying",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hqbhjza",
                    "author": "TheMessenger18",
                    "score": 3,
                    "created_utc": 1640722223.0,
                    "response": "This is one of the funniest things I've seen in 2021.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hqazv98",
                    "author": "DeimosProject",
                    "score": 2,
                    "created_utc": 1640715190.0,
                    "response": "… this is definitely what Zuckerburg envisioned in that diatribe a month or two ago.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hqa1drv",
                    "author": "ilritorno",
                    "score": 0,
                    "created_utc": 1640700696.0,
                    "response": "Every time this is played a neuron dies.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hqaoxw2",
                    "author": "GreenskinGiga",
                    "score": 1,
                    "created_utc": 1640710870.0,
                    "response": "😂😂😂 I love it",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hqbft8a",
                    "author": "Anything0_",
                    "score": 1,
                    "created_utc": 1640721523.0,
                    "response": "Lmaoo",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hqbhagy",
                    "author": "ctrlZpivotal",
                    "score": 1,
                    "created_utc": 1640722115.0,
                    "response": "Iddqd!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hqcjs5z",
                    "author": "DomTrapGFurryLolicon",
                    "score": 1,
                    "created_utc": 1640738291.0,
                    "response": "Literally mass theft /s",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hqclvcv",
                    "author": "The_Blue_Adept",
                    "score": 1,
                    "created_utc": 1640739225.0,
                    "response": "This is the way.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hqar9bd",
                    "author": "xupitertolv",
                    "score": 0,
                    "created_utc": 1640711786.0,
                    "response": "NFT printer go brrrr",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hqb2ccv",
                    "author": "Layers3d",
                    "score": 0,
                    "created_utc": 1640716173.0,
                    "response": "NFT are not the pixel. NFT are the link to the pixel. You do not own the artwork.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hqbf1wq",
                            "author": "Kojinto",
                            "score": 1,
                            "created_utc": 1640721213.0,
                            "response": "You do still own the art on the blockchain in a way that matters tho.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hqcipp0",
                                    "author": "Layers3d",
                                    "score": 1,
                                    "created_utc": 1640737823.0,
                                    "response": "No, You own the link to the art on the blockchain.  Now some do give you the copyright to the art but most do not.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hqcjyxa",
                                            "author": "Kojinto",
                                            "score": 1,
                                            "created_utc": 1640738375.0,
                                            "response": "Thats fine. It doesn't matter to those who are investing for less than 1 year. Esp so for those who flip NFTs in months or even weeks for profit. Newer blockchains are also devising ways to give more ownership to owners using newer protocols.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hqb1bqa",
                    "author": "Slapshot382",
                    "score": -5,
                    "created_utc": 1640715769.0,
                    "response": "Why is this on the Bitcoin subreddit. Fucking stupid ass NFT’s coming into our sub now.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hqasatj",
                    "author": "walloon5",
                    "score": 1,
                    "created_utc": 1640712201.0,
                    "response": "Hilarious, good stuff",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hqb1d94",
                    "author": "xXcampbellXx",
                    "score": 1,
                    "created_utc": 1640715786.0,
                    "response": "Why is it always a monkey picture?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hqc1vdb",
                            "author": "OzVapeMaster",
                            "score": 1,
                            "created_utc": 1640730552.0,
                            "response": " the whole concept of monkey nfts is ridiculous lol nfts on its own as a technology i get but for these stupid monkey collectible pictures it just seems pointless",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hqbdhqj",
                    "author": "MadMax052",
                    "score": 1,
                    "created_utc": 1640720585.0,
                    "response": "Belly Laugh",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hqbgmrr",
                    "author": "eqleriq",
                    "score": 1,
                    "created_utc": 1640721851.0,
                    "response": "Isn't this inaccurate because each NFT would have to be unique? Thus it's propagating the idea that \"these are dumb because they're not even unique.\" They are dumb, but that's not why. And also the concept of an NFT is silly because it requires an oracle to determine the truth of ownership so proves the idea that ownership is still determined by a judge.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hqbn9kj",
                            "author": "Timzor",
                            "score": 5,
                            "created_utc": 1640724539.0,
                            "response": "I think its just a joke bro",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hqbj1d0",
                    "author": "BryTheSpaceWZRD",
                    "score": 1,
                    "created_utc": 1640722811.0,
                    "response": "Bro Victor Chaos told me these are the future.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hqblpdl",
                    "author": "AmazingSuperPupils",
                    "score": 1,
                    "created_utc": 1640723895.0,
                    "response": "you know they like it when you do that?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hqbp9cp",
                    "author": "nosebleed_tv",
                    "score": 1,
                    "created_utc": 1640725356.0,
                    "response": "Someone should make the game an NFT. NFT inception.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hqbpsrm",
                    "author": "Mordkillius",
                    "score": 1,
                    "created_utc": 1640725578.0,
                    "response": "A poor idiot i know who lives with his mom just sold some \"rare\" one for 50k. He is freaking out and reinvesting it all",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hqbqqhn",
                    "author": "Omega_Cutie",
                    "score": 1,
                    "created_utc": 1640725966.0,
                    "response": "NFTs spotted...Doom music intensifies",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hqbrxf1",
                    "author": "dada_art",
                    "score": 1,
                    "created_utc": 1640726451.0,
                    "response": "\"three dots...drop down...SAVE\"",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hqbus8c",
                    "author": "crypto_sebas",
                    "score": 1,
                    "created_utc": 1640727622.0,
                    "response": "awesome idea !! love it !!!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hqc1kp9",
                    "author": "Abject_Philosophy518",
                    "score": 1,
                    "created_utc": 1640730429.0,
                    "response": "But how can you sell those screenshots to someone thinking they are NFT's",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hqc4ctf",
                    "author": "Elymanic",
                    "score": 1,
                    "created_utc": 1640731595.0,
                    "response": "What's stopping me from using the same pictures as another nft to make the same nft?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hqc7ngk",
                    "author": "One-Egg-7790",
                    "score": 1,
                    "created_utc": 1640732991.0,
                    "response": "Love it!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hqc83qx",
                    "author": "diorchrissss",
                    "score": 1,
                    "created_utc": 1640733188.0,
                    "response": "This is incredible I love it 😍",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hqc903w",
                    "author": "44gallonsoflube",
                    "score": 1,
                    "created_utc": 1640733577.0,
                    "response": "This is incredible",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hqca3ky",
                    "author": "HappyPlant1111",
                    "score": 1,
                    "created_utc": 1640734054.0,
                    "response": "Omg is this amazing",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hqci5wb",
                    "author": "CaptainKopeikin",
                    "score": 1,
                    "created_utc": 1640737582.0,
                    "response": "Reddit hates NFTs more than anything on earth and I am 100% here for it. \n\nHow much free money did you losers get on Christmas Eve via $SOS?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hqcj8am",
                    "author": "Ok_Teacher_6834",
                    "score": 1,
                    "created_utc": 1640738048.0,
                    "response": "Lmao I’m into crypto and love the crossover. Ps nfts as they are are fucking stupid",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hqcjl0k",
                    "author": "ELUMAGNOTTI",
                    "score": 1,
                    "created_utc": 1640738203.0,
                    "response": "beautiful",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hqcsbvf",
                    "author": "thunderchicken_",
                    "score": 1,
                    "created_utc": 1640742138.0,
                    "response": "This is almost the most beautiful thing in the world.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hqb0dfl",
                    "author": "tek_fox212800",
                    "score": -3,
                    "created_utc": 1640715393.0,
                    "response": "One day, all your government docs will be NFTs",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hqb6aqe",
                    "author": "DogeTheCount",
                    "score": -3,
                    "created_utc": 1640717731.0,
                    "response": "Love it, NFT’s are going to be massive 🤩",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hqapkur",
                    "author": "maverick_gyatso",
                    "score": -2,
                    "created_utc": 1640711122.0,
                    "response": "If someone able to compromise the blockchain, does that mean  crypto is dead..?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hqbcio1",
                    "author": "CreepyButtPirate",
                    "score": -2,
                    "created_utc": 1640720194.0,
                    "response": "Disney making their own NFTs is enough for me to see/know this won't go away soon",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hqcf9kg",
                    "author": "jam-hay",
                    "score": -2,
                    "created_utc": 1640736300.0,
                    "response": "This should be flagged as off topic.. how are NFT posts allowed on r/bitcoin?",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}