{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ut4wu2",
            "title": "What's happening with the case of Ruja Ignatova?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/ut4wu2/whats_happening_with_the_case_of_ruja_ignatova/",
            "author": "Finley_dz",
            "created_utc": 1652971225.0,
            "score": 1,
            "num_comments": 0,
            "subreddit": "Bitcoin",
            "selftext": "Hey guys, what's happening with the case of Ruja Ignatova? Do you remember her as the founder of OneCoin cryptocurrency and probably like one of the most wanted criminals?   \n\n\nI heard that back in 2019 as I recall her brother was arrested, but how is it possible that she couldn't be found like anywhere? Did anyone follow that case? What's your opinion?   \n\n\nI recently watched on Netflix documentary - Trust No One: The Hunt for the Crypto King and it quite reminded me of this case with crypto queen Ruja. Did anyone watch that as well?   \n\n\nDo these solutions we have now thanks to blockchain for data and privacy protection may prevent these types of frauds?   \nI read a lot about it and I don't have any experience with it but soon I will start using one for sure. I was interested in Modex but then I realized that usually, large companies are using it, it's just me, not the company lol.   \n\n\nIt's so sad that many people lost a huge amount of money cause of this fraud, they even said that they are the Bitcoin killer and many people believed them, so sad...",
            "stickied": false,
            "comments": []
        },
        {
            "id": "ut4s2d",
            "title": "Mining power, texas ercot primary frequency response, an idea",
            "url": "https://www.reddit.com/r/Bitcoin/comments/ut4s2d/mining_power_texas_ercot_primary_frequency/",
            "author": "ittybittycitykitty",
            "created_utc": 1652970844.0,
            "score": 3,
            "num_comments": 3,
            "subreddit": "Bitcoin",
            "selftext": "I was looking at ercot under-frequency event, which led me to an article about solar near 500MW being able to provide primary frequency response, which led me to find an estimate of bitcoin mining power in texas: 6GW!\n\nOk, so if every mining rig in Texas installs a frequency control throttle, they could be a player in the frequency response market.\n\nOf course, malware could get in to such a scheme, and be able to modulate power consumption on the ERCOT grid to devastating effect, so maybe not a good idea.",
            "stickied": false,
            "comments": [
                {
                    "id": "i97px83",
                    "author": "Nada_Lives",
                    "score": 1,
                    "created_utc": 1652974965.0,
                    "response": "To participate in the grid, you must sync to the frequency. What's your idea?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9823z9",
                            "author": "ittybittycitykitty",
                            "score": 1,
                            "created_utc": 1652979858.0,
                            "response": "Two parts to this.\n\n1.) Set up your mining rig to have a simple way to adjust how much power it takes. Maybe reduce hashrate, maybe asic clock, something. \n\n2.a) Install a simple high accuracy grid frequency monitor. You need to be able to see the difference between 60.01 and 60.015. \n\nor 2.b) create a network of everyone else able to modulate their power, that broadcasts a power up or power down signal.\n\nConnect 2 to 1.\n\nWith 2b, you then sell your ability to make quick power adjustments on an almost GW level to ERCOT.\n\nWith 2a, you sell your service to some small power producer like a wind farm.\n\nThis is not an energy storage thing, it is a rapid response thing, on the order of 10 seconds or so.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9a1blg",
                    "author": "Mr_Pocket_",
                    "score": 1,
                    "created_utc": 1653012646.0,
                    "response": "Frequency response isn’t monetized. It’s the byproduct of our generation stack. The inertia of the grid comes mostly from large spinning mass (turbines able to ramp up or down to maintain 60 hertz)",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}