{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "v1lhpk",
            "title": "What's the hashrate of the Death Star?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/v1lhpk/whats_the_hashrate_of_the_death_star/",
            "author": "gaiusiuliuskaesar",
            "created_utc": 1653985520.0,
            "score": 3,
            "num_comments": 7,
            "subreddit": "Bitcoin",
            "selftext": "Now, I learned supercomputers aren't as powerful as ASICS but come on the death star is huge it must do something at least",
            "stickied": false,
            "comments": [
                {
                    "id": "ian30iq",
                    "author": "dlq84",
                    "score": 1,
                    "created_utc": 1653985724.0,
                    "response": "About tree fiddy",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ian4ft0",
                    "author": "Loafmanuk",
                    "score": 1,
                    "created_utc": 1653987020.0,
                    "response": "\"THE\" Death Star? This implies there is only 1!\n\nHow very disappointing..",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ian50f2",
                            "author": "gaiusiuliuskaesar",
                            "score": 1,
                            "created_utc": 1653987554.0,
                            "response": "the second and third ones weren't finished",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ian9mpw",
                                    "author": "Asum_chum",
                                    "score": 1,
                                    "created_utc": 1653991697.0,
                                    "response": "No but the station was fully operational.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ianaavk",
                                            "author": "gaiusiuliuskaesar",
                                            "score": 1,
                                            "created_utc": 1653992280.0,
                                            "response": "But would we get the same hashrate?",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ian5y94",
                    "author": "Crawlero",
                    "score": 1,
                    "created_utc": 1653988418.0,
                    "response": "According to wookiepedia, the death star had a power output of 2.4x10^32 watts.  I'd bet its not a reactor they get in the habit of shutting down regularly, it probably takes days to start back up.  When the laser isn't in operation, that reactor must be kept under load somehow, so I'd reason they could plausibly launch a 51% attack on bitcoin.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ian85w2",
                    "author": "Amoci",
                    "score": 1,
                    "created_utc": 1653990427.0,
                    "response": "That was a long, long time ago… I’m going to say 4.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "v1ll6e",
            "title": "Selling crypto to family members",
            "url": "https://www.reddit.com/r/Bitcoin/comments/v1ll6e/selling_crypto_to_family_members/",
            "author": "WayTo1ETH",
            "created_utc": 1653985981.0,
            "score": 0,
            "num_comments": 5,
            "subreddit": "Bitcoin",
            "selftext": "Can I sell my BTC for fiat at market prices to friends (with split finances) or family members (shared finances)? \n\nAsking from a tax standpoint (living in Australia, but interested in any infos independent of country that could help me find more infos). \n\nAs an example let’s say I bought 1 BTC for 10k AUD couple of years ago and sell it to my wife (shared bank account). Am I allowed to do this. Obviously I would pay CGT tax on it. Now let’s say I sell it to a friend (not shared finances). Am I allowed to do that?\nLastly, the critical scenario. Let’s say bought 1 BTC at the ATH at 80k AUD and sell it to my wife now for 45k AUD. Can I claim a tax loss?\nThanks for any infos on why this is not a thing are welcomed. I assume there is some law prohibiting this.",
            "stickied": false,
            "comments": [
                {
                    "id": "ian6doc",
                    "author": "GroovyFat",
                    "score": 1,
                    "created_utc": 1653988816.0,
                    "response": "How are you going to sell it to her?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ian6k3y",
                            "author": "WayTo1ETH",
                            "score": 1,
                            "created_utc": 1653988977.0,
                            "response": "Face to face, I transfer BTC to her wallet, she transfers AUD into my bank account  \n\n\nEdit: At market prices, similar to major exchanges",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ian8hyh",
                                    "author": "GroovyFat",
                                    "score": 1,
                                    "created_utc": 1653990723.0,
                                    "response": "Yeah, my point is, if you want to claim a tax loss you’d need a record that you’ve made a loss right? That’s why it goes through an exchange.  i think if this is a way to claim tax loss, everyone would be doing it. There’s no proof that your wife’s wallet isn’t yours or if you guys are not sharing multiple wallets.\n\nedit: I’ve never used it, but might be worth checking out bisq, although I doubt you’ll sell directly to your wife or friend there.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ian9ejh",
                    "author": "Festortheinvestor",
                    "score": 1,
                    "created_utc": 1653991499.0,
                    "response": "I have given btc to my friends, I don’t sell it to them. I mine bitcoin, have been for a while, my thought process here is I’m only furthering my investment by distributing to family and friends. Selling it is an option, gifts are tax free under 10k though as far as I know",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ianae8o",
                    "author": "MrQ01",
                    "score": 1,
                    "created_utc": 1653992359.0,
                    "response": "You might be better getting direct advice from a tax professional for a question like this.\n\nAlso sounds like you're referring to Australian tax, and you're very likely to only get an American perspective on here. There may also be a difference between selling to your spouse versus other family members.\n\nI think from a UK and US standpoint, taxes for Bitcoin are treated as per any standard capital tax - and so you may not need to look specifically for Bitcoin in order to get your answer.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}