{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uudnqz",
            "title": "how exactly is Bitcoin saving us from fiat?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uudnqz/how_exactly_is_bitcoin_saving_us_from_fiat/",
            "author": "MarekTaman",
            "created_utc": 1653100075.0,
            "score": 0,
            "num_comments": 73,
            "subreddit": "Bitcoin",
            "selftext": "So I d like to know how Bitcoin supposedly saves us from all the ills of the current monetary system.\n\n  \nThere are a fixed supply of 21 million bitcoins and just a few million left. \n\nSo we got \\~19 million bitcoins already assigned to someone, let's say in the future through hyper-inflation, fiat is worth 0 and a bitcoin is holding massive purchasing power. That means that the current small percentage of bitcoin holders won the lottery and become the new 1% for doing what exactly, for being early? \n\nHow do you become the 1% today? By providing value to society, which rewards you with IOUs in the form of fiat. You think society (=government) will accept a situation where the 1% is a bunch of bitcoin holders having enormous wealth for no other reason than having bought in at the right time? There will be such a large part of society losing everything that they will elect a government that will outright redistribute or replace bitcoin. At the end, fiat money has credibility because society beliefs in all of its implications. The rich got rich because they create value and the middle class gets its fair share. \n\nIn what universe would society accept a wealth redistribution that radical as implied by this sub? I don't see it happen but honestly I am not trolling, If I m missing the bigger picture, please elaborate.\n\nBitcoin will be tolerated as long as it does not shift significantly wealth distribution.\n\nThe only places where bitcoin has replaced government fiat (officially or unofficially) is in countries with little to no democracy and quality of life. If bitcoin thrives, it means we have lost all confidence in our government (= in ourselves as a society) and we are well on the way to societal collapse.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9env5v",
                    "author": "gdmfsobtc",
                    "score": 6,
                    "created_utc": 1653100866.0,
                    "response": "When you put all your moneys into bitcoin (leaving enough for Ribeye Flavor ramen during the bull runs, cause you are not some uncouth savage, but a man of means and culture) you no longer have to worry about fiat. Salvation!\n\nEdit : in Bitcoin, the opportunity to build generational wealth from almost nothing as an individual - possible a decade ago, less so 5 years ago - is now arguably gone. Unless you are providing some sort of service or commercialisable innovation. There will be no major wealth redistribution, as institutionals and extremely high net worth individuals are already deeply vested. Critical mass has been reached, and uptake will continue. Bitcoin is decentralized and extremely government and regulation resistant.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9eoyra",
                            "author": "MurderGooseOnDatPack",
                            "score": 3,
                            "created_utc": 1653101463.0,
                            "response": "\"A man of means and culture\" has me wheezing*",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9eobfu",
                            "author": "SmoothGoing",
                            "score": 2,
                            "created_utc": 1653101114.0,
                            "response": "Money never goes \"in\" bitcoin. It goes to the seller.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9eqrnw",
                            "author": "MarekTaman",
                            "score": -2,
                            "created_utc": 1653102437.0,
                            "response": "Exactly, bitcoin is amplifying inequality and wealth concentration at the expense of the masses. Which will lead to war or rebellion and ultimately a government that will do away with bitcoin. I am not saying this will happen next year or even next decade but it is the trajectory we are on",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9er644",
                                    "author": "gdmfsobtc",
                                    "score": 7,
                                    "created_utc": 1653102652.0,
                                    "response": "Not at all. It is not a zero sum game, that's myopic. Again, many governments have tried to outlaw bitcoin, and failed. The masses are in no way disadvantaged by availability of an alternative to centralised banking and traditional inflation non-resistant assets. Bitcoin is freedom.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9ers73",
                                            "author": "MarekTaman",
                                            "score": -2,
                                            "created_utc": 1653102998.0,
                                            "response": "How is it not a zero-sum game if bitcoins endgame is going to replace fiat?   \nHow does bitcoin combat wealth inequality? How much bitcoin is held by the bottom 50% of the world?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9etz16",
                                                    "author": "Into_The_Wilderness1",
                                                    "score": 13,
                                                    "created_utc": 1653104224.0,
                                                    "response": "You have to remember there will always be the wealthy and the less wealthy. In a Bitcoin Standard, you are incentivised to spend your Bitcoin only on things that truly provide value....which not only redistributes BTC to others who provide value, it also incentivises us to have a lower time preference and seek to do things that provide value.\n\nThe system itself is decentralised. In the current system those who are closer to the money printer benefit, whilst those who dont have assets/can't buy assets are screwed. If I am in a 3rd world country, and hold Bitcoin that is proportionate to the wealth of the nation, I know my spending power cannot be destroyed by Governments.....I don't need to be the wealthiest. That starting point (your comment above) assumes the same goals in the current system are true for a Bitcoin Standard. It also assumes that everyone's goal is to become mega wealthy....some just want enough to live, and therefore if there are 1% of the world who hold a large portion of BTC...it doesn't take away from the benefits I receive from the system.\n\nYes some will have more, some will have less, but the key point is, all you need to do is keep saving BTC and your purchasing power doesn't get destroyed. It's not about having the world with each person holding the same amount, it's about having each person having the opportunity to not get poor slowly like in the current system.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9f2nls",
                                                            "author": "IFThenElse42",
                                                            "score": 3,
                                                            "created_utc": 1653109830.0,
                                                            "response": "This should be enough to blow away the fucktards at /r/buttcoin",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9f3gmd",
                                                                    "author": "Into_The_Wilderness1",
                                                                    "score": 1,
                                                                    "created_utc": 1653110392.0,
                                                                    "response": "Let's not get too divisive, we all have our opinions and mine is only one of many :) Happy to be shown where I'm wrong.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "i9fu12j",
                                                            "author": "kitemourt94",
                                                            "score": 1,
                                                            "created_utc": 1653133230.0,
                                                            "response": "Bravo sir",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i9f9lgw",
                                                    "author": "Remarkable-Cat1337",
                                                    "score": 3,
                                                    "created_utc": 1653115218.0,
                                                    "response": "oh didn't take you for a socialist lol \n\n\"how does bitcoin combat wealth inequality\"\n\nit doesn't? how does fiat combat wealth inequality? it doesn't",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i9es3cp",
                                                    "author": "gdmfsobtc",
                                                    "score": 2,
                                                    "created_utc": 1653103177.0,
                                                    "response": "It is a financial instrument, an anti-inflationary asset and a decentralized currency. Which will likely become the global reserve currency. It does not have to replace local versions of fiat. Why should it combat wealth inequality? Who died and made bitcoin into communism?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9esmol",
                                                            "author": "MarekTaman",
                                                            "score": 0,
                                                            "created_utc": 1653103469.0,
                                                            "response": "Ofc it shouldnt be but if it overtakes fiat, which seems the central thesis here, it will lead to extreme wealth inequality which will lead to zero aceptance from society",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9g2kjf",
                                                                    "author": "MiguelLancaster",
                                                                    "score": 1,
                                                                    "created_utc": 1653138668.0,
                                                                    "response": "> Ofc it shouldnt be but if it overtakes fiat, which seems the central thesis here, it will lead to extreme wealth inequality which will lead to zero aceptance from society\n\nyou're saying that acceptance from society will lead to zero acceptance from society",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                },
                                                                {
                                                                    "id": "i9et1km",
                                                                    "author": "gdmfsobtc",
                                                                    "score": 3,
                                                                    "created_utc": 1653103700.0,
                                                                    "response": "I fail to see the logical progression from replacing fiat to driving wealth inequality and social unrest.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9fffbq",
                                    "author": "ma0za",
                                    "score": 1,
                                    "created_utc": 1653120330.0,
                                    "response": "Fiat is doing that, not bitcoin. Due to the cantillon Effect freshly inflated fiat supply is going to the entities closest to the Source while the perple furthest away, the ones that are so Poor they cant even Profit from cheap Credit as Credit represents fresh fiat, have their wages and savings devalued with no upside at all.\n\nBitcoin is slightly Deflationary. As the supply of Assets and consumer goods grow, they get cheaper. It doesnt incourage reckless spendig and comsumerism and devalues other assets without fixed supply like Housing oder time making it Mode affordable for the Poor and eating away at Asset wealth of the rich.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9ephne",
                    "author": "Fickle_Mix_3847",
                    "score": 5,
                    "created_utc": 1653101752.0,
                    "response": "Now if you wrote this maybe ten years ago I’m all  ears. That was my line of thinking as well back then. Adoption is past the point of no return. It’s been taxed and used in many forms because of its incredible properties and many use cases.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9eqcqx",
                            "author": "MarekTaman",
                            "score": 1,
                            "created_utc": 1653102211.0,
                            "response": "It has been doing great because it is currently still not a noteworthy competitor of fiat money. But the day it truly becomes one and people lose trust in fiat and go all-in on bitcoin it can only lead to even more extreme levels of inequality and wealth concentration which will ultimately lead to collapse, war or rebellion. Or how do you see the future playing out? In my opinion, bitcoin is a sign of the times due to rising inequality. Governments are printing money to stave off the inevitable collapse of society. Interesting read: [https://www.economist.com/open-future/2018/09/10/can-inequality-only-be-fixed-by-war-revolution-or-plague](https://www.economist.com/open-future/2018/09/10/can-inequality-only-be-fixed-by-war-revolution-or-plague)",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9evmzy",
                                    "author": "Fickle_Mix_3847",
                                    "score": 1,
                                    "created_utc": 1653105196.0,
                                    "response": "It is not bitcoins fault that the fiat system was destined for failure. There have been many moneys and over time they have all failed and been replaced. I see bitcoin more along the lines of a standardization of value among the world while soaking up a large portion of the worlds economies. Some countries would use it as a currency but many an asset and for international dealings. It doesn’t stop inequality but I can see it lessening the chances of war as it is a decentralized common ground for value in the world.   I don’t see the explosion of fiat but it’s certainly an unknown how it will play out.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9f4zyx",
                                            "author": "Spl00ky",
                                            "score": 1,
                                            "created_utc": 1653111503.0,
                                            "response": "Bitcoin provides 0 flexibility in the even of non-finance related black swan events. For example, if an asteroid hit a major city in the USA, some flexibility in government spending would be needed to get the country up and running again.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9eq6ff",
                    "author": "Ok_Aerie3546",
                    "score": 7,
                    "created_utc": 1653102116.0,
                    "response": "Wealth concentration isnt the problem, inflation is and the rich benefitting more from inflation than the poor is the problem.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9f6uo1",
                            "author": "GipsyRonin",
                            "score": 3,
                            "created_utc": 1653112939.0,
                            "response": "Wealth concentration is ALSO a problem, it’s one of many facets. And inflation makes the divide greater. Why total wealth caps are needed. Total as in all combined assets and currency cannot be valued OVER say 500,000,000 for a random example. Just saw a house that was basically a hotel for $264,000,000 for sale. Yes, there’s mad wealth concentration and can be distributed more and allow them to still be insanely wealthy but allow the rest to live a quality life just not a super lavish one. Which many do not want anyway.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9f7lz2",
                                    "author": "Ok_Aerie3546",
                                    "score": 1,
                                    "created_utc": 1653113559.0,
                                    "response": "That just sounds unfair. If I dont like the law for myself, I dont want it for others either.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9f56jo",
                            "author": "Dis_Bear",
                            "score": 2,
                            "created_utc": 1653111635.0,
                            "response": "Does deflation not benefit the rich more?  \n\nIf your money is becoming more valuable, then it benefits those with more money.  \n\nIf your money is becoming less valuable then it hurts those with more money.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9f6ql4",
                                    "author": "Ok_Aerie3546",
                                    "score": 5,
                                    "created_utc": 1653112851.0,
                                    "response": "None of the rich people have money in their bank account. They are rich because they own assets. And assets keep appreciating with inflation.\n\nUltra rich people have like 0.01 - 0.1 percent of their net worth as cash in a bank.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9f7w8a",
                                    "author": "Glugstar",
                                    "score": 1,
                                    "created_utc": 1653113798.0,
                                    "response": "So, the rich get richer? People with money will always find ways to benefit themselves more than poor people. This is not a solvable problem by any currency alone. It already happens within the current system and Bitcoin will not make this problem worse.\n\n>If your money is becoming less valuable then it hurts those with more money.\n\nCurrently, those with more money don't keep their wealth in currency form, but rather investments, so your entire point is mute because it doesn't hurt them at all. It's *only* poor people that get affected by it.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9fo2ek",
                                    "author": "calculateHash",
                                    "score": 1,
                                    "created_utc": 1653128361.0,
                                    "response": "No, the rich use inflation for their benefit. They know as a almost certainty that the dollar or their local currency is going down constantly so they just borrow and borrow over and over again making inflation even worse every time while using those borrowed dollars to invest in assets essentially shorting the fiat currency and fucking everyone else in the process. They are incentivized to do this, this is how messed up the current system is.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9er7ae",
                            "author": "MarekTaman",
                            "score": 1,
                            "created_utc": 1653102671.0,
                            "response": "Depends what causes inflation and what it is used for. Inflation is good for debtors, bad for creditors. Your mortgage and the governments debt just got lighter. If the main cause is printed money and that printed money sticks at the hand of the rich, sure is bad for the poor. If the printed money is used for redistribution to the poor, it might work out.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9errrh",
                                    "author": "Ok_Aerie3546",
                                    "score": 1,
                                    "created_utc": 1653102992.0,
                                    "response": "What might work better is not causing inflation and people not taking on too much debt. \n\nEntrepreneurs would still make businesses. But everyone in the world benefits from the progress of society in the exact same world",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9eskap",
                                    "author": "Squezeplay",
                                    "score": 1,
                                    "created_utc": 1653103434.0,
                                    "response": "Inflation is not good for debtors. Rising wages or income is. Inflation on its own is bad for debtors as it raises the cost of living, lowers profits, so makes it harder to pay debt. But more debt means more money or credit in circulation, which means higher prices. A good example is real estate, where the existence of mortgages doesn't necessarily make houses easier to buy as they probably drive up prices by many multiples.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9etqft",
                                            "author": "MarekTaman",
                                            "score": -1,
                                            "created_utc": 1653104091.0,
                                            "response": "High inflation leads to higher dollar-denominated wages due to society pressure. Look at the minimum wage during the high inflation decade of the 70s. Dollar minimum wage doubled from 1.60 to 3.35 in just 7 years of high inflation. On the other hand, low inflation since the 80s has caused that it took 27 years before the min wage doubled afain. In real terms, the value of min wage during the seventies stayed more or less stable while it has lost value ever since.  \n\n\nWhen inflation is low but steady, the poor lose out. When it is high, society notices and makes adjustments.  \n\n\nhttps://edition.cnn.com/interactive/2019/business/us-minimum-wage-by-year/index.html",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9f7f78",
                                                    "author": "Glugstar",
                                                    "score": 2,
                                                    "created_utc": 1653113402.0,
                                                    "response": ">High inflation leads to higher dollar-denominated wages due to society pressure.\n\nThe data is most conclusive: wages HAVE NOT kept up with inflation, long term. Cherry picking data from literally half a century ago is not in any way supportive of your argument. Your entire premise is built on incorrect information.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9f7wxq",
                                                            "author": "MarekTaman",
                                                            "score": 1,
                                                            "created_utc": 1653113814.0,
                                                            "response": "Wages have not kept up during low inflation due to the inability of people to notice slow inflation. High inflation correlates with more political support for wage increases which benefit the poor as they are being offset for loss in wages while creditors lose out. Mind you I m making the distinction here between low and high inflation, not inflation and deflation",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i9felxn",
                                                    "author": "Raphae1",
                                                    "score": 1,
                                                    "created_utc": 1653119599.0,
                                                    "response": "Raising wages will increase the demand for products, which will increase prices even more. It‘s called the price/wage spiral and leads to hyperinflation.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9ertmd",
                    "author": "Squezeplay",
                    "score": 2,
                    "created_utc": 1653103021.0,
                    "response": "You're right in the short term it may be a problem. But when it becomes the world reserve currency, it's growth will obviously plateau. The current debt based, inflationary system works to concentrate wealth, while the idea is that a hard currency in a stable state would be neutral. Over time the rich would have to diversify into other investments due to bitcoin's appreciation stabilizing. Eventually after a few generations wealth would be more distributed that it is now. There may also be social pressures for them to divest or event nationalize some of it, if one entity gathered a huge amount, especially if there is a rough transition from the current monetary system.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9f0q9s",
                    "author": "warriorbg1",
                    "score": 2,
                    "created_utc": 1653108471.0,
                    "response": "Same thing happened for early stock market and real estate investors. Now some of us are presented with the same opportunity if we’re patient enough.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9f1klc",
                    "author": "tokyo_aces",
                    "score": 2,
                    "created_utc": 1653109068.0,
                    "response": "A couple things.\n\n1. You will be initially more wealthy because you got in early, but a fool and his money are soon parted, so if you aren't good at investment or management it will go to those more deserving\n2. I thought all the billionaire entrepreneurs told us they would be billionaire entrepreneurs anyway, through hard work?  So they'll get the money back by taking loans to start their companies and making products, same as today.  No?  Surely you aren't telling me that many of them got extremely **lucky**?  Can't have it both ways.  Either you believe the bootstrap stories and therefore others having most of the cash temporarily isn't an issue, or you don't, so why are you afraid to have a similar gamble with those others?  If it's luck and not bootstrapping, this new crop of Bitcoin rich are equally likely to have inventors in their midst.\n3. Getting money from being early is quite literally what angel investing is.   You have a huge risk of the project going to 0 and losing everything (Bitcoin was and is not a guarantee).  No reason to complain about it.\n4. At this point if you get into Bitcoin, you're not \"early\" like a 2010-er, but you have 12 years of history to guide you.  If you don't get in, that's your fault.  If you get in now, you aren't late, you just aren't early.\n5. In your future, jobs pay in BTC.  So people who work, and provide a value to society, get BTC.  No one is locked out.\n\nThis sounds an awful lot like sour grapes thinking mixed with an unhealthy dose of class warfare.  The bottom line is most people think \"You have millions in USD?  Wow you must be a successful businessman\" yet \"You have thousands of BTC?  Nerd\".  Stop thinking that.  It's not correct for the USD case nor the BTC case and it leads to dumb thinking like \"The USD guy deserves his wealth, but the BTC guy got lucky\".\n\nNews flash - nobody did shit without getting lucky, and survivorship bias means you just don't hear about the millions of guys who lost their shirt starting a business, investing in a company or a crypto, etc.\n\nIf someone has a lot of wealth in any currency, who the fuck cares so long as they don't wield undue influence in government.  And if they do, **tackle that problem**.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9f9f8z",
                    "author": "Remarkable-Cat1337",
                    "score": 2,
                    "created_utc": 1653115071.0,
                    "response": "dude in a scenario of fiat going to 0, EVERYTHING goes to infinity, so so what if bitcoin goes to a 2million? who cares, houses will be going to 10 million... food to 10k\\~ so why u get butt hurt about this fact? even magic and pokemon cards will beat fiat... will the government take down pokemon cards from you? \n\nyes if you live a 1st world country, wanting bitcoin is like being a toxic mofo making it harder for who needs it to have it, obviously if you live in a 1st world country you won't see ANY value at all for bitcoin... unless you are liberatarian i guess",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9fhgcf",
                    "author": "Charming-Meringue-68",
                    "score": 2,
                    "created_utc": 1653122192.0,
                    "response": "Every year inflation makes the rich richer and the poor poorer. Now compound this for 50+ years, and you have today. Bitcoin is fair and absolurely fixes this.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9eqv6c",
                    "author": "ESG_girl",
                    "score": 4,
                    "created_utc": 1653102491.0,
                    "response": "Bitcoin’s monetary policy is written in code for all to see 100+ years into the future compared to the fiat system that is up and down with each fed meeting. It’s hard to plan for an uncertain future. Bitcoin’s transparency and the stability of the governance allows for lower time preference thinking.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ep4aq",
                    "author": "babblenaut",
                    "score": 2,
                    "created_utc": 1653101545.0,
                    "response": "You don't see it happening? My brother in christ, it has been happening for the past decade, and is still happening at this very moment. Buckle up.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9eyztw",
                    "author": "tldrpg",
                    "score": 2,
                    "created_utc": 1653107309.0,
                    "response": "Bitcoin was designed simply to be a better monetary system than fiat, which it is. Whether or not it replaces fiat is anyone's guess, but bitcoin really doesn't have an agenda. It's a utility that can benefit those who wish to be in control of their wealth without the oversight or intervention of the guv'ment. \n\nObviously this will rub folks of the old system the wrong way, since it \"implies\" criminal/illicit behavior. I say stop living in fear and letting the media spin this crazy narrative. Push back. Bitcoin is not perfect, but it is the best we can do to take back some power without a direct fight.\n\nI can't really elaborate on how Bitcoin gets its value better than others on this sub, but I do know it's mined with tons of energy. Ppl go out of their way to acquire the land, hardware, and electricity to compete for its block reward just like any land grab that brought today's civilization upon us. It's mathematically scarce, secure, immutable, etc. The list just goes on...\n\nWith Bitcoin I came for the wealth, but I stayed for rebellion. It's opened my eyes to so many facets of world history, computer science, economics, cryptography, and politics. If you think bitcoiners would easily give up their right to use it, you're dead wrong.\n\nSo yeah, bitcoin probably won't replace fiat, even tho it probably *should*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9en849",
                    "author": "Energy_Radiant",
                    "score": 1,
                    "created_utc": 1653100525.0,
                    "response": "https://youtu.be/nOh-7SzI6gM",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9et3ln",
                    "author": "ABBDRUMS",
                    "score": 1,
                    "created_utc": 1653103733.0,
                    "response": "It’s really not much different from stocks. There are lots of people who have become ultra wealthy just for buying certain stocks early without really creating anything valuable for society, like Warren Buffett. If Bitcoin keeps rising, the early investors will become ultra wealthy too. There is really no way to prevent that when you have a brand new asset that is being rapidly monetized by the planet in an open, free market. The only way the distribution would be more “fair” is if some central authority limited how much any individual could obtain, and that just sounds like some dystopian bullshit to me so I dunno. It is what it is so like Satoshi said, probably a good idea to grab some just in case it catches on!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9eu40j",
                            "author": "MarekTaman",
                            "score": 1,
                            "created_utc": 1653104301.0,
                            "response": "ok, under the thesis that it is similar to stock and just another asset, that works out. But then the thesis of bitcoin will go to a million dollar and replace bitcoin (1btc = 1btc) falls apart",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9ew2oo",
                                    "author": "ABBDRUMS",
                                    "score": 1,
                                    "created_utc": 1653105461.0,
                                    "response": "I think by the time Bitcoin hits a million, we won’t even really care because that means inflation and money printing has spiraled so far out of control that pricing things in dollars doesn’t mean anything anymore. Everything will just be priced in sats by that time and dollars will be irrelevant. 1 btc = 1 btc and that’s the only unit of account that will matter.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9f011s",
                                            "author": "MarekTaman",
                                            "score": 0,
                                            "created_utc": 1653107993.0,
                                            "response": "If 1 btc = 1 btc then you will enter a deflationary economy which isnt great either",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9f7g3y",
                                                    "author": "dat9553",
                                                    "score": 2,
                                                    "created_utc": 1653113424.0,
                                                    "response": "Deflationary economy is not bad. It will make people as independent as possible, consume as little as possible, and have long term thinking. Saving will be rewarded as it should, unlike unflationary economy eating away people's savings",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9f9zra",
                                    "author": "Remarkable-Cat1337",
                                    "score": 1,
                                    "created_utc": 1653115556.0,
                                    "response": "fiat is designed to have inflation, so eventually it will reach a million dollars, 10 years? 20? your guess",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9ev80w",
                    "author": "shwirv",
                    "score": 1,
                    "created_utc": 1653104946.0,
                    "response": "Bitcoin isn't centralized. It's supply can't be manipulated. I think you are correct. Butcoin dominance won't end inequality. It never intended to  end economic inequality. It will end reckless fiscal policy by Central banks though.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ewcad",
                            "author": "MarekTaman",
                            "score": 1,
                            "created_utc": 1653105618.0,
                            "response": "While I agree it's reckless the alternative was worse. Should the central bank have let the banking system implode and tank the economy? Probably the answer is yes but that would have cause real suffering. The central bank does QE to buffer out downturns in the short term. In the end it will come crashing down but in my opinion bitcoin is part of the problem, not the solution.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9fa89s",
                                    "author": "Remarkable-Cat1337",
                                    "score": 2,
                                    "created_utc": 1653115758.0,
                                    "response": "so you belive that letting the top decides when the bust happens is good? that is so fucking retarded it disgusts me, NO MANIPULATION AT ALL? and then you talk about wealth inequality, LOL for you is okay some guy at the top deciding that stocks should go up or down and don't see any problem at all",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9f59s9",
                                    "author": "shwirv",
                                    "score": 1,
                                    "created_utc": 1653111701.0,
                                    "response": "Yes, I think the central bank should have key the economy implode and made it clear that actions have consequences.  Kicking the can down the road doesn't fix anything.  I know this sounds harsh, but we need to face the truth.  Our current economy is a shame and had been propped up by smoke and mirrors.  We will pay one way or another.  They're us no escaping the reality of economics.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9fjzf9",
                                            "author": "Prototope",
                                            "score": 1,
                                            "created_utc": 1653124566.0,
                                            "response": "I have access to all the food I want. And that is for most us Westerners. That's, historically, a sign of a very good economy.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9f3gdy",
                    "author": "G30M4NC3R",
                    "score": 1,
                    "created_utc": 1653110388.0,
                    "response": "The beautiful thing is Bitcoin works whether it’s tolerated or not",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9fclc5",
                    "author": "MrQ01",
                    "score": 1,
                    "created_utc": 1653117785.0,
                    "response": "How do you become the 1% in a global adoption scenario? By owning 0.28 BTC (assuming the population stays above 7.5bn).\n\nConsidering how BTC is NOT meant to be a wealth equaliser this was probably, and likely still is,the lowest barrier to entry to being in the top 1% of a unique decentralised strongest currency.\n\nAnd there is barely anything today that's different from when BTC was around $100 a coin, except that it's less risky now than it was back then. Most of us for $30 could have secured our seat in the top 1%.\n\nIn what world would this be accepted? One where wealth distribution is primarily determined by factors hundreds of years ago, including spoils of war, luck, elitism and gatekeeper tactics... instead of a decade old technology where all you need is an internet connection for both acquiring BTC AND providing transparency for learning about BTC.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ffp4p",
                    "author": "ma0za",
                    "score": 1,
                    "created_utc": 1653120577.0,
                    "response": "If anything bitcoin is redistributing from the rich to the average Person as their elastic supply assets that were fed on Inflation for decades due to the cantillon Effect now Start losging value compared to a fixed supply currency.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9fiy3f",
                    "author": "mredda",
                    "score": 1,
                    "created_utc": 1653123597.0,
                    "response": "The merit of the first investors is to support this new technology, they deserve the reward because otherwise bitcoin would not have been adopted (and it is good for humanity that bitcoin has been created and that it is being adopted)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9fk575",
                    "author": "savinelli_smoker",
                    "score": 1,
                    "created_utc": 1653124720.0,
                    "response": "You assume it’s gonna be a flick of a switch and all fiat will die tomorrow and bitcoin is hyperadopted. But in reality this is going to be a long process and the coins get dispersed gradually to the no-coiners. The 1% will take profit by selling, will spend the coin to buy a house, a lambo… people who are not the 1% (but now see bitcoin as the future) will work for bitcoin and buy and accumulate. I know I’m not selling but plenty of people are for whatever reason. My point is it won’t happen overnight and those who started early will do well but they will eventually have to spend. After all it’s money what good does it do if you take it to the grave?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9fmz01",
                    "author": "Nadya_EasyBit",
                    "score": 1,
                    "created_utc": 1653127371.0,
                    "response": "Bitcoin offers a monetary solution eliminating the need of banks, discarding the money transfer fees and the necessity of centralised governance!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9g4aw6",
                    "author": "po00on",
                    "score": 1,
                    "created_utc": 1653139636.0,
                    "response": ">How do you become the 1% today?\n\nby owning a money printer or sucking up to those who do. or using accumulated wealth, power and influence to manipulate people, markets, nation states etc.\n\nProviding goods and services in exchange for payment is the proper moral, capitalist approach. Many wealthy people are well off, financially, because they take this approach. Many of the 1%, however, do not take this path. They take one of corruption, by way of what I describe above.  \nBitcoin, as hard, sound money, removes the capability for any man to artifically inflate the supply of money.   \nIt is a poison dart aimed at corruption.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9euesr",
                    "author": "Rambalamda",
                    "score": -3,
                    "created_utc": 1653104468.0,
                    "response": "Your stupid argument will be what all the people have to say in the future because \"it's unfair\" others paid attention and got in early.\n\nBTC is all over the place. If you're not stacking sats that's your problem. You get BTC at the price you deserve.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9f5275",
                            "author": "Spl00ky",
                            "score": 5,
                            "created_utc": 1653111548.0,
                            "response": "Given your logic, you're destined to be poor simply because you did not exist when bitcoin was \"cheap\"",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9g325i",
                                    "author": "MiguelLancaster",
                                    "score": 1,
                                    "created_utc": 1653138946.0,
                                    "response": "bitcoin is currently cheap\n\nby design, it should always be cheaper when looking backwards",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9eo8yo",
                    "author": "X-Files22",
                    "score": 0,
                    "created_utc": 1653101077.0,
                    "response": "It is a hedge against inflation",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ew57r",
                    "author": "Potatotornado20",
                    "score": 0,
                    "created_utc": 1653105504.0,
                    "response": "Don’t be discouraged that you weren’t lucky enough to get in early. I have a feeling bitcoin will drop to $3000 again when the everything bubble finally pops. Almost everyone will be shaken out, even the whales who see their bitcoin net worth plummet to basically nothing. Lots of retails investors will step in then, especially millennials who aren’t used to investing in boomer assets like bonds or gold. Bitcoin gets redistributed among those who believe in it the most. Probably everyone in this sub becomes a whole coiner :)",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ewtoh",
                            "author": "MarekTaman",
                            "score": 1,
                            "created_utc": 1653105913.0,
                            "response": "I don't invest in crypto, I prefer holding real assets. My bet is on agricultural land and real estate in climate change positive zones.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9fm47e",
                                    "author": "Downtown-Ad-4117",
                                    "score": 1,
                                    "created_utc": 1653126578.0,
                                    "response": "George W. Bush?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9f4hac",
                    "author": "Creative-Molasses-60",
                    "score": 0,
                    "created_utc": 1653111125.0,
                    "response": "God, this is a dense take. \n\nInequality will always exist and early investors will always have first-mover advantages. \n\nWe will continue to have decreasing trust in government and purchasing power since no political actors care about the average citizen. They will do whatever is needed to appease the masses and prolong their career. They don’t give a shit about making a better world or improving peoples lives.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uudugv",
            "title": "The bodega across the street from my place closed down a few months ago. The owner was an idiot. It recently reopened under new management. I like the new management.",
            "url": "https://i.redd.it/1p2clsysrq091.jpg",
            "author": "ACTORvsREALTOR",
            "created_utc": 1653100774.0,
            "score": 144,
            "num_comments": 15,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9eu8ye",
                    "author": "n351320447",
                    "score": 8,
                    "created_utc": 1653104378.0,
                    "response": "You mean corner store",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9f7rgt",
                            "author": "Plaxtico_",
                            "score": 10,
                            "created_utc": 1653113687.0,
                            "response": "I think its just a gas station. Bosegas/Corner stores dont have pumps.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9h5hgo",
                                    "author": "Future_PeterSchiff",
                                    "score": 1,
                                    "created_utc": 1653157075.0,
                                    "response": "I love how people forget, or are ignorant to the fact that internet stock savvy investors absorbed so much money through the internet stock boom that they bought everyone out of their business and made them internet friendly. \n\nToday, it’s us Bitcoiners earning more money than anyone in the long term charts. We have already been buying everyone out of their business, and will continue to do so until like the internet stock rich did before us, buy out every business and make them Bitcoin lightning network friendly",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9g14by",
                            "author": "ACTORvsREALTOR",
                            "score": 2,
                            "created_utc": 1653137843.0,
                            "response": "Bodega is Spanish for Warehouse so the term is used lightly.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9eo1kq",
                    "author": "Effin_Kris",
                    "score": 8,
                    "created_utc": 1653100962.0,
                    "response": "I wanted one of these but I was looking at $16k before the plot it was going to sit at. With this dip, I might look into it again.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9fy7sj",
                    "author": "Prestigious_Ship6853",
                    "score": 3,
                    "created_utc": 1653136073.0,
                    "response": "Where does it dispense the coins?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9g2y3p",
                    "author": "MonkeyManWhee",
                    "score": 3,
                    "created_utc": 1653138883.0,
                    "response": "Show the fees.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9epdrb",
                    "author": "DatBuridansAss",
                    "score": 6,
                    "created_utc": 1653101693.0,
                    "response": "7% fee is rough, especially if it's still KYC.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9esgmg",
                            "author": "Extremely-Bad-Idea",
                            "score": 2,
                            "created_utc": 1653103379.0,
                            "response": "The ones with high fees typically did not have KYC in the past, but that is probably changing.  As recently as a year ago there were ATMs near me that appeared to allow customers to feed in cash and transfer BTC to any wallet address.  I never used them as I felt they looked shady and obviously cost too much in transaction fees.   No proof of identity seemed to be required.  I assume the Feds are cracking down on that stuff now though.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9es06t",
                    "author": "Extremely-Bad-Idea",
                    "score": 1,
                    "created_utc": 1653103127.0,
                    "response": "16 gallons of gas + 2 hot dogs + 1 large Coke = ?? Bitcoin ??",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9et41u",
                            "author": "restore_democracy",
                            "score": 6,
                            "created_utc": 1653103740.0,
                            "response": "= 1 bitcoin, these days",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9gbjmz",
                    "author": "BonesGR",
                    "score": 1,
                    "created_utc": 1653143294.0,
                    "response": "That’s awesome. I wonder if anyone can put these in like regular atms.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9hraqz",
                    "author": "flamestamed",
                    "score": 1,
                    "created_utc": 1653167805.0,
                    "response": "I saw one in walgreens",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9hsfdw",
                    "author": "friedocra",
                    "score": 1,
                    "created_utc": 1653168387.0,
                    "response": "Help me out here....why would I use this thing ?",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}