{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "v1hx7w",
            "title": "Are we early, or do people just not care to learn.",
            "url": "https://www.reddit.com/r/Bitcoin/comments/v1hx7w/are_we_early_or_do_people_just_not_care_to_learn/",
            "author": "Sundance37",
            "created_utc": 1653970672.0,
            "score": 138,
            "num_comments": 76,
            "subreddit": "Bitcoin",
            "selftext": "I work in finance, and can tell you, it is incredibly frustrating going to /r/personalfinance and giving advice to people that just want to sit around smelling their own farts. That is a place where people are supposed to know what they are talking about, and practically everyone there thinks that finance, means budgeting. \n\nFinancing has been around for thousands of years, and yet people have very little basic knowledge about even the concept of money, let alone the cost of it. \n\nIt gets so bad that I can't help but to sit there and say that it feels like I'm \"early\" to the concept of interest rates. When in reality, the stupidity of the people are what the central planners are counting on. They aren't hiding their theft from regular people, they are just operating out of another dimension.\n\nI wonder if Bitcoin will suffer eternally due to the people that it benefits, having no real interest in learning why or how, and the people that do understand it, all have much more to gain from gaming the system.\n\nRant over. This will likely be seen by 4 people, but I needed to get it off my chest.",
            "stickied": false,
            "comments": [
                {
                    "id": "iamkohd",
                    "author": "j_greca",
                    "score": 48,
                    "created_utc": 1653971172.0,
                    "response": "If for one second you think anything has the power to remove stupid people... you will always be disappointed. Stupidity is eternal.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iamkri5",
                            "author": "Sundance37",
                            "score": 10,
                            "created_utc": 1653971228.0,
                            "response": "Yes, but far more prevalent than I thought as well.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iampewz",
                                    "author": "Even-Home-9126",
                                    "score": 5,
                                    "created_utc": 1653974405.0,
                                    "response": "Do you think it's getting worse? Or are you just getting smarter?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iamuacn",
                                            "author": "Puzzled_Raccoon8169",
                                            "score": 7,
                                            "created_utc": 1653978095.0,
                                            "response": "I think it’s getting worse. It became a fun game to start a conversation with co-workers about any particular current event and make 2-3 statements and then just watch the convo devolve and stop circling them back or contributing any logic or reason. Half of the nonsense is people talking out of their ass who know it and the other half is people who don’t know backing up the shit talkers because they think they probably DO know and don’t wanna sound stupid which reinforces the first set and they start believing they really know and speak nonsense with even more authority and it just becomes a feedback loop of nonsense.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ianawjw",
                                                    "author": "calculateHash",
                                                    "score": 2,
                                                    "created_utc": 1653992781.0,
                                                    "response": "If you think logically you will see that explaining things to people that are saying nonsense is indeed a waste of time very often and even when it looks like it isn't you will later realize it was.\n\nI had many such occasions and with each one of them I get closer to just not wanting to say anything. Either because of the fact that if you have a dumb opinion already formulated in your head that thing is like calcified, so there's a resistance and if someone tries to break your bubble you try to reject it harshly since that person is breaking your whole reality in a sense, since all your life decisions and things you think you know were acquired using the same logic so then it might mean you are deceived in most things you think you know and that's hard to swallow for many.\n\nOr even sometimes you will explain why what they are saying is nonsense and usually when it's in a group that people look up to you as a cultured person they will actually seem to listen and you think you educated them. Only to realize in another occasion that they are saying the same thing they were as if you explained nothing...\n\nSo in the end most conversations are left to fools amongst themselves and they just walk in circles because there's in fact, probably nothing anyone can do. You either truly break away from all the dumbness and start to learn by yourself or no matter what anyone says to you you will still be dumb because you will not listen because you don't even know how to listen.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iancmi0",
                                                            "author": "Oarlikwosten",
                                                            "score": 1,
                                                            "created_utc": 1653994137.0,
                                                            "response": "Never argue with idiots, people might not know the difference",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "iangbau",
                                                            "author": "idontspellcheckb46am",
                                                            "score": 1,
                                                            "created_utc": 1653996783.0,
                                                            "response": "Wait, you are saying you have a hard time explaining how to use factoring to brute for RSA encryption?  Yea, that stuff makes peoples faces melt.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "iang1fs",
                                                    "author": "idontspellcheckb46am",
                                                    "score": 1,
                                                    "created_utc": 1653996599.0,
                                                    "response": "just curious, are you in the tech sector? I think a lot like this and am often 2nd guessed while correct and find the gap of knowledge between me an my non tech peers is pretty wide.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "iamu5iu",
                                    "author": "BitcoinUser263895",
                                    "score": 2,
                                    "created_utc": 1653977992.0,
                                    "response": "That's one of *The Basic Laws of Human Stupidity*.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "iamyojs",
                                    "author": "Liquids0ul",
                                    "score": 2,
                                    "created_utc": 1653981797.0,
                                    "response": "Don’t forget all the propaganda on the media, this is slowing the adoption for sure, and people will fomo on the next mooning again, psychology playing a good role also but ya stupidity will always impress you",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "iamqm8r",
                            "author": "zeycus",
                            "score": 8,
                            "created_utc": 1653975275.0,
                            "response": "Einstein said: \"*Two things are infinite: the universe and human stupidity; and I'm not sure about the universe*\".",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "ian5u01",
                            "author": "Blueberry_Dependent",
                            "score": 5,
                            "created_utc": 1653988306.0,
                            "response": "Stupidity is driving society. Ignorance too. Nobody bothers to think about the future and they want everything NOW.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iang3ve",
                            "author": "UrNs0",
                            "score": 1,
                            "created_utc": 1653996644.0,
                            "response": "A wise man once said \"It's hard to make something foolproof when the fools already got a headstart.\"",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iaml2cp",
                    "author": "dadlif3",
                    "score": 66,
                    "created_utc": 1653971430.0,
                    "response": "Bitcoin is a revolutionary concept that challenges the ideas our society and monetary system are built upon. New ideas are scary for the simple minded, the average person prefers comforting lies to the hard truth. The current system is a comforting lie, the hard truth is the system is not sustainable.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ian5wby",
                            "author": "UnusualPass",
                            "score": 5,
                            "created_utc": 1653988367.0,
                            "response": "The flip side is, of course... That maybe we are the simple minded for believing this to be the new world money... We are heavily in the minority its worth remembering...",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ianf9kv",
                                    "author": "wollier12",
                                    "score": 1,
                                    "created_utc": 1653996067.0,
                                    "response": "It’s fascinating you got downvoted for stating an extremely simple fact…..The problem with r/Bitcoin is as you can imagine it’s full of fanboys. So you get a bunch of people who act smarter than they are pretending they’re the only ones who’ve got it all figured out.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "iandqwq",
                            "author": "diddiekiddler",
                            "score": 1,
                            "created_utc": 1653994974.0,
                            "response": "Everyone is stupid except you. Must feel good.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iamkq6p",
                    "author": "Ok_Aerie3546",
                    "score": 14,
                    "created_utc": 1653971204.0,
                    "response": "Im just always surprised as to how many people cant budget. How is it difficult? You know your income, add up all your expenses, from whats left invest a little, save a little, and repeat!\n\nIf you are spending more than what you are earning, the problem is right in front of you.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iamkw6f",
                            "author": "Sundance37",
                            "score": 13,
                            "created_utc": 1653971315.0,
                            "response": "I think people value their leisure more than their employers value their labor.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iamoo9y",
                                    "author": "johnstedt",
                                    "score": 2,
                                    "created_utc": 1653973879.0,
                                    "response": "The way you phrased that reminded me of the ‘Disutility of Labor’.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "iaml4io",
                                    "author": "Ok_Aerie3546",
                                    "score": 1,
                                    "created_utc": 1653971471.0,
                                    "response": "Of course. Why would it be the other way round?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "iamy73n",
                            "author": "clusterlove",
                            "score": 3,
                            "created_utc": 1653981376.0,
                            "response": "Depends how much your earn I guess, rent, food, bills, that random shit you have to pay that's not planned then a drink in the weekend, that can be your wages pretty much done. Rinse repeat.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iamveo6",
                    "author": "Puzzled_Raccoon8169",
                    "score": 13,
                    "created_utc": 1653979014.0,
                    "response": "Don’t try explaining to average people that it’s not mathematically possible for everyone in the world to be debt free because of fractional reserve banking. The money printed by the FED is but a trickle compared to what’s pumped out through debt creation.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iancze4",
                            "author": "JollySno",
                            "score": 1,
                            "created_utc": 1653994408.0,
                            "response": "Money is debt…",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ianglem",
                                    "author": "Anatomy_of_the_State",
                                    "score": 1,
                                    "created_utc": 1653996972.0,
                                    "response": "Is bitcoin debt?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iamm4uv",
                    "author": "MrFatwa",
                    "score": 8,
                    "created_utc": 1653972143.0,
                    "response": "I think most need meaningful pain in order to adopt change and educate themselves further.\n\nCountries suffering from really high inflation, government mistrust etc. Are much quicker to understand the value and need for harder money.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iamyx0l",
                    "author": "MichaelAischmann",
                    "score": 6,
                    "created_utc": 1653982010.0,
                    "response": "I would like to comment on the title of your post.\n\nPeople don't care to teach finance. Despite money and finance being part of everyone's life until they die, there is not a single education system in the world that makes financial literacy a regular subject like math, PE or history.\n\nThis is a political failure.\n\nFinancial literacy should be taught to every child from the moment they know basic arithmetic until the last day of school. They will need it everyday that follows. They will most likely not need the start and end dates of this war or that reign in history (and if they do, google knows).\n\nLet's make #teachfinanceinschool a thing!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ian51wa",
                            "author": "rhelwig7",
                            "score": 6,
                            "created_utc": 1653987593.0,
                            "response": ">This is a political failure.\n\nOn the contrary, this is a political success. Politicians intentionally created an educational system that dumbs down the populace and allows their propaganda to be mainstreamed.\n\nThe solution is to not use their educational system. Homeschooling, especially Unschooling, is far superior. These days sending your kids to a government run school is borderline child abuse.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ian789q",
                                    "author": "MichaelAischmann",
                                    "score": 1,
                                    "created_utc": 1653989599.0,
                                    "response": "Political success means serving the electorate.\n\nYou can say that keeping finance out of education is deliberate and that it's working. But that doesn't make the politics or politicians a success in the eyes of the electorate.\n\nI am not a politician, hence not having received financial education is a political failure from my point of view. ONLY political leaders could call this a success IF they truly don't care about their electorate.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ian92cg",
                                            "author": "rhelwig7",
                                            "score": 2,
                                            "created_utc": 1653991217.0,
                                            "response": ">Political success means serving the electorate.\n\nThat is VERY naive and has never been reflected in reality.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "ian3sno",
                            "author": "Brainsick001",
                            "score": 1,
                            "created_utc": 1653986433.0,
                            "response": "It’s done on purpose to keep the average Joe from improving his/her life. \n\nSchool is a scam. A government organ. They can teach you whatever they want. If you’re 5 and they teach you eat shit every day it makes you healthy! Everyone would start doing it. \n\nEducate yourself.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ian7bzs",
                                    "author": "MichaelAischmann",
                                    "score": 1,
                                    "created_utc": 1653989692.0,
                                    "response": "Educate yourself, then educate others. That second half sentence is important.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "ianbyae",
                            "author": "Lesharian",
                            "score": 1,
                            "created_utc": 1653993616.0,
                            "response": "Correction. I had to take mandatory classes in finance (incl basic accounting) business and economics from 11-13 grade in Germany (Wirtschaftsgymnasium). So some places teach that in school.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iamov2b",
                    "author": "Rey_Mezcalero",
                    "score": 6,
                    "created_utc": 1653974014.0,
                    "response": "People just want simple lives. They just want to get paid and be able to easily spend it and pay bills.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ianb9g6",
                            "author": "Get_the_nak",
                            "score": 0,
                            "created_utc": 1653993073.0,
                            "response": "Until their money become worthless.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iamm6lg",
                    "author": "dat9553",
                    "score": 3,
                    "created_utc": 1653972175.0,
                    "response": "People need a big change in life to have motivation for learning new ideas.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iamn9rr",
                    "author": "ndgoLiberty",
                    "score": 3,
                    "created_utc": 1653972912.0,
                    "response": "People can remain stupid longer than companies can remain insolvent.\n\nWait…no I think I got that quote wrong.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iamurtl",
                            "author": "Puzzled_Raccoon8169",
                            "score": 1,
                            "created_utc": 1653978493.0,
                            "response": "No. I think you may be right. But companies can remain insolvent for a fairly long time if their primary source of revenue is buying and selling their OWN stock because stupid people keep it propped up for MOASS. Zombie companies doing surprisingly well these days.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iamvsuj",
                                    "author": "ndgoLiberty",
                                    "score": 2,
                                    "created_utc": 1653979343.0,
                                    "response": "The original quote, “the market can remain irrational longer than you can remain solvent” turned upside down… somehow works. Weird.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iamwzek",
                                            "author": "Puzzled_Raccoon8169",
                                            "score": 2,
                                            "created_utc": 1653980336.0,
                                            "response": "I think we’re in an alternate universe not unlike the upside down. If an adult went into a coma 10 years ago and woke up today, they wouldn’t believe they woke up. 20 years would be even worse. Too much has changed that used to be considered basic truths. Now there’s only subjective chaos rooted in nothingness. In every facet of existence.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iamxc5b",
                                                    "author": "ndgoLiberty",
                                                    "score": 2,
                                                    "created_utc": 1653980629.0,
                                                    "response": "25 years ago and I think they’d have a melt down.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iamoryf",
                    "author": "normcrypto",
                    "score": 2,
                    "created_utc": 1653973951.0,
                    "response": "You're early.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iamtk1z",
                    "author": "medialAxis",
                    "score": 2,
                    "created_utc": 1653977510.0,
                    "response": "\"Most people would rather die than think and many of them do!”,  Bertrand Russell, The ABC of Relativity.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iamu107",
                    "author": "BitcoinUser263895",
                    "score": 2,
                    "created_utc": 1653977892.0,
                    "response": ">  it is incredibly frustrating going to /r/personalfinance and giving advice to people \n\nDuh, why you wasting life on that.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iamyq7r",
                    "author": "Crawlero",
                    "score": 2,
                    "created_utc": 1653981839.0,
                    "response": "As market cap rises the swings will get softer, we are in a 50% drawdown which is a lot softer than the typical 80% drawdowns we have come to expect.  As swings get softer more will accept it as a valid investment.  Will everyone understand it? No, most people don't understand anything, but I don't think its necessarily necessary.  Here's a short story of bitcoins potential use case.\n\nI just bought a house.  A week before closing, the house appraised lower than estimated and due to the conditions of a VA loan they had to rewrite my mortgage.  This immediately cancelled the deal I had cut, to roll the ~$13,000 closing costs into the mortgage; instead of receiving $4000 back now I'd owe about $10,000.  This is a swing in liquidity requirements that I was not financially prepared to eat, I didn't keep enough in my bank account to cover it and nearly lost the whole deal.\n\nThe complexity of solving this was not something I had the power to solve, I had money on the stock market but it would have taken 5 days for an ACH transfer between my stock broker and bank to cover.  If Schwab and navy federal both held bitcoin as a tradable reserve asset, then theoretically they could have used bitcoin to facilitate the transaction and my account would have settled in 30 minutes.\n\nInstead, I had to eat a loss of ~40 basis points on my loan, raising my mortgage payments by several hundred a month.  This type of financial inefficiency is a challenge for every large institution, and it will be difficult to ignore.  Banks, like jpmorgan chase just has, will want to reorganize their reserve asset portfolio to take this into account.\n\nI'm not sure who can \"game\" this, aside from traders who are good at identifying where we are on the cycle, buying and selling for profit.  All bitcoin needs to do is remain a neutral money, not favoring one group or another.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iamzwxw",
                            "author": "Crawlero",
                            "score": 1,
                            "created_utc": 1653982895.0,
                            "response": "I'd say keep your head up and be wise about who you spend your time on.  Most people really, really don't care, and you shouldn't worry about them.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iampp47",
                    "author": "frunf1",
                    "score": 1,
                    "created_utc": 1653974606.0,
                    "response": "It's also one of my worries. And the fud in the media is placed nicely to turn down many that took the decision to look into BTC or even just searched for information once.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iamsn0s",
                    "author": "SunRev",
                    "score": 1,
                    "created_utc": 1653976799.0,
                    "response": "I wonder how long it took for ancient people to discover and accept that gold had value?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ianah3j",
                            "author": "lloyd_braun_no_1_dad",
                            "score": 1,
                            "created_utc": 1653992424.0,
                            "response": "Is this satire? This comment feels like satire.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iamujc6",
                    "author": "tldrpg",
                    "score": 1,
                    "created_utc": 1653978297.0,
                    "response": "I started out on that sub way back in the day, when life was simple. I had just got out of debt and it helped me to reflect on my spending habits, credit and so forth. It was a part of a number of subs I perused  that seemed to compliment each other. That is until I found bitcoin and realized after a while  I had become quite the outcast. But I don't really mind since bitcoin has helped me become much better off then if I had followed the \"safe\" path. \n\nDo realize that everyone's different and might be struggling just to get by and bitcoin won't be a short term solution for those needing financial stability now. Also, be aware that this space is rife with scams waiting to take advantage of anyone wishing to get a jumpstart on stacking sats.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iamwfu1",
                    "author": "extrastone",
                    "score": 1,
                    "created_utc": 1653979877.0,
                    "response": "Inflation is reported only at 8%.  As it rises people will pay more attention.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iamwsvk",
                    "author": "simplelifestyle",
                    "score": 1,
                    "created_utc": 1653980182.0,
                    "response": "> I wonder if Bitcoin will suffer eternally due to the people that it benefits,\n\nBitcoin doesn't care. Is just a decentralized base protocol like the internet (TCP/IP). Anybody who dismissed it, did it at his own disadvantage. **Eventually, they'll *have* to use it whether they want it or not.**\n\n> Satoshi: \"If you don't believe me or don't get it, I don't have time to try to convince you, sorry\"\n> \n> @Davincij15 (about 10 years ago): \"Everyone buys Bitcoin at the price they deserve\"",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iamzf5e",
                    "author": "solomonsatoshi",
                    "score": 1,
                    "created_utc": 1653982454.0,
                    "response": "USD vs DCEP vs BTC",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ian15ia",
                    "author": "Bitcoin__Hodler",
                    "score": 1,
                    "created_utc": 1653984018.0,
                    "response": "OP: that might be a great chance for you.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ian1atk",
                    "author": "JeremyLinForever",
                    "score": 1,
                    "created_utc": 1653984150.0,
                    "response": "People refuse to learn about Bitcoin at r/personalfinance because people in that sub are helplessly tied in debt to the dollar or their native currency to depend on getting out of debt. They have no choice but to believe in their own currency because their well-being depends on it. Kind of sad really but that’s the mental game that the US instilled on basically the entire world when they became a global reserve currency.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ian4i89",
                    "author": "protestersunited",
                    "score": 1,
                    "created_utc": 1653987081.0,
                    "response": "Yes?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ian53zk",
                    "author": "zampyx",
                    "score": 1,
                    "created_utc": 1653987646.0,
                    "response": "Stupid people will always be there, but I don't think it matters much.\n\nIf BTC succeed as global money, which is still quite an IF, it will inevitably result in inequality and people who didn't bother to have a basic understanding of it will be fucked as much as they are today.\nIn that scenario, no matter if you still denominates stuff in FIAT or not, people with less BTC will be worse off than people with more. As long as your nominal returns are above your cost of living you are ripping the average person. It won't change much with BTC in my opinion. And that's why even if you don't think is such a big deal you should just buy some and drop it in cold storage for 10 years.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ian8a7b",
                    "author": "G_MONEY333",
                    "score": 1,
                    "created_utc": 1653990533.0,
                    "response": "Still so early. Got in when btc was around 450-500$ usd per btc. \n\nGet ready everyone 📈",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ianbmd1",
                    "author": "Experienced_AP",
                    "score": 1,
                    "created_utc": 1653993354.0,
                    "response": "OP, just recall or review how people viewed the internet in the late 90s/early 2000s.\n\nArticle after article about how it is useless, no point to it, it's not going anywhere.\n\nEven made it to The Simpsons when Homer says, \"The internet? Is that thing still around?!\"\n\nIf there's any parallels between the two, BTC is going to explode in adoption and when it does... I can't imagine.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iancdf4",
                    "author": "PremdeepVR",
                    "score": 1,
                    "created_utc": 1653993941.0,
                    "response": "The volatility of bitcoin is still high and people dont want to be in a position where they have to withdraw in loss to support an emergency requirement. The amount which is invested in bitcoin is for a long term hodl until we see more value/profit than invested fiat",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iancinq",
                    "author": "ExtremelyQualified",
                    "score": 1,
                    "created_utc": 1653994055.0,
                    "response": "It’s probably good to consider possibilities other than “early” and “everyone else is dumb”",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ianco9z",
                    "author": "Bisquick_in_da_MGM",
                    "score": 1,
                    "created_utc": 1653994175.0,
                    "response": "No one here is early. Maybe it’s time to start thinking that adoption is a really long way off or will never happen.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iancohn",
                    "author": "tzt1324",
                    "score": 1,
                    "created_utc": 1653994179.0,
                    "response": "We are still early",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ianctl6",
                    "author": "WallStLegends",
                    "score": 1,
                    "created_utc": 1653994285.0,
                    "response": "How many millenials knew what HTTP was? (not many) How many millenials have used HTTP? (everyone)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ianczu5",
                    "author": "Mpy71",
                    "score": 1,
                    "created_utc": 1653994417.0,
                    "response": "Bitcoin won’t be used by the masses until it is as brainless a process as usd system. My belief is that bitcoin will never be used as a currency directly, but a storage of value asset alongside utility as monetary network for transporting value. I don’t think the latter will require users to touch bitcoin or even know they’re using it to move money. Everyone into crypto forgets that vast majority do not give two shits about finance/how they exchange value with others. They just want to be able to do it easily. Companies like block/strike will be the ones who make bitcoin popular by making its’ use cases brainless",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iand3fc",
                    "author": "wollier12",
                    "score": 1,
                    "created_utc": 1653994492.0,
                    "response": "Im not exactly sure how Bitcoin helps people…..it’s extremely volatile at the moment…..for most it’s worth less than they bought it for….it doesn’t pay dividends or have rent income so it’s not really an investment.   So it’s not a true investment, and it’s not a true currency…….it may become such, but at the moment it has no widely accepted value. I have some so hopefully it explodes someday, but currently I’m down, which means I’d be forced to use it or sell it at a loss, which means it’s essentially worthless to me, just a placeholder on my books. It in its current state is providing absolutely no value to me…….maybe it will go up and I’ll sell it. But that’s about where it’s value ends for the average user.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iane1sk",
                    "author": "JqiLight",
                    "score": 1,
                    "created_utc": 1653995195.0,
                    "response": "It’s almost as if our academic career is designed to keep us ignorant to personal finance.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ianey7y",
                    "author": "Jadedinsight",
                    "score": 1,
                    "created_utc": 1653995847.0,
                    "response": "People don't like to have their beliefs questioned and usually consider it only when it slaps them in their face.\n\nOf course, by then it's usually too late.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ianfnlj",
                    "author": "FutureNotBleak",
                    "score": 1,
                    "created_utc": 1653996333.0,
                    "response": "It’s not that the people with money don’t care, they just don’t want to admit that they’re wrong. This is about hubris. There is only one outcome for people like that in times like these.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ianguy1",
                    "author": "kwaker88",
                    "score": 1,
                    "created_utc": 1653997150.0,
                    "response": "I do sympathize greatly with your views. The stupidity is eternal and going to a Bitcoin Standard could be a very long time frame relative to our lifespan and time preference.\n\nThe smart money will only want Bitcoin, and I think this will happen relatively quick. The herd will follow and this will happen slowly then suddenly. They will never understand the concept of hard money, or even what money is. They just use whatever is convenient for them. Adoption does not require people to understand.\n\nThis is the sad truth but the sheep just follow blindly into indoctrination. I don't think convincing sheep is a good use of our time.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iamv091",
                    "author": "RS_Germaphobic",
                    "score": 0,
                    "created_utc": 1653978686.0,
                    "response": "People are investing into shitcoins, we are early.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iamvuf1",
                    "author": "DagiUr",
                    "score": 0,
                    "created_utc": 1653979379.0,
                    "response": "but we know the truth. others can listen us or stay poor forever.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ian9ia0",
                    "author": "po00on",
                    "score": 0,
                    "created_utc": 1653991588.0,
                    "response": "The same ruling class spray poisons on the peasants food, and convince them it's for their benefit. They stoke victim ideologies through the lying news media & centrally controlled government education systems. No wonder so many are so mixed up. The solution seems to be continuing to speak the truth. If those you're spreaking to are too obtuse to receive the message, move on to others who are ready to hear it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iana7y1",
                    "author": "Halifornia35",
                    "score": 0,
                    "created_utc": 1653992210.0,
                    "response": "Had someone in a personal finance Reddit argue vehemently that Bitcoin can be double spent so it’s not a secure way to transfer money. After providing  websites that clearly detail the protocol and how BTC Avoids the double spending problem, we Got nowhere and the guy still disagreed",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}