{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "v0ttoe",
            "title": "Lightning Network Startup ideas",
            "url": "https://www.reddit.com/r/Bitcoin/comments/v0ttoe/lightning_network_startup_ideas/",
            "author": "Comfortable_Kiwi_290",
            "created_utc": 1653891595.0,
            "score": 11,
            "num_comments": 6,
            "subreddit": "Bitcoin",
            "selftext": "I’ve started learning about the lightning network recently and found that there is so much potential in services that can be offered through it. I’m planning to take a sabbatical from my job to explore the same. Any advice in terms of where should I start, technicals, business ideas and services would greatly help. TIA!",
            "stickied": false,
            "comments": [
                {
                    "id": "iaiq5zx",
                    "author": "Nervous-Papaya-5675",
                    "score": 5,
                    "created_utc": 1653894719.0,
                    "response": "Set homepage to SN and keep looking around. https://stacker.news/",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaje0bc",
                            "author": "Comfortable_Kiwi_290",
                            "score": 1,
                            "created_utc": 1653914277.0,
                            "response": "Good website this is. Thanks for your input.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iaiouqy",
                    "author": "general010",
                    "score": 3,
                    "created_utc": 1653893635.0,
                    "response": "https://youtu.be/l2VQkbucXns",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaiqcbl",
                    "author": "Wilynesslessness",
                    "score": 2,
                    "created_utc": 1653894868.0,
                    "response": "https://youtu.be/Tk1xVBv6Ilc\n\nhttps://lightning.network/lightning-network-paper.pdf",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iajdj2a",
                    "author": "dantebayer",
                    "score": 1,
                    "created_utc": 1653913985.0,
                    "response": "Make something that you would use and keep at it. Dont bother with this market research and what not :).Thats essentially the same as asking for permission to do something. Just create a product you like, Steve Jobs style. He relied on his taste rather than what others think and do. Thats the secret imo. Thats all im going to say.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iajdybg",
                            "author": "Comfortable_Kiwi_290",
                            "score": 1,
                            "created_utc": 1653914243.0,
                            "response": "Thanks. I’ve ordered a Raspberry pi for setting up a Bitcoin full node. I believe in a month’s time I’ll be up and running my own Bitcoin node and Lightning node.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "v0tpq5",
            "title": "Where do these people coming from ??? How retard you have to be to believe this ?????",
            "url": "https://i.redd.it/pozgdy1y1k291.jpg",
            "author": "ErosTHE",
            "created_utc": 1653891131.0,
            "score": 2,
            "num_comments": 8,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "iaim4ib",
                    "author": "l34rn3d",
                    "score": 5,
                    "created_utc": 1653891446.0,
                    "response": "Probably just a bot...",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaitj9o",
                    "author": "Equivalent-Cloud-365",
                    "score": 7,
                    "created_utc": 1653897650.0,
                    "response": "I wasn’t quite sure who was the retard based on the replies in the screenshot",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iajazsi",
                            "author": "ErosTHE",
                            "score": 2,
                            "created_utc": 1653912355.0,
                            "response": "On the opposite I was expecting a bit more sofisticated reply. But in any case I love redit community:)",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iaitc9k",
                    "author": "ikkatop",
                    "score": 2,
                    "created_utc": 1653897479.0,
                    "response": "The title wording..... 😣😣😣\n\nAnd they're slating retards.....😂😂😂",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iajeda6",
                    "author": "Bitcoiniswin",
                    "score": 2,
                    "created_utc": 1653914493.0,
                    "response": "The world lost upwards of 16 million IQ points as a result of exposure to lead coming from leaded gasoline before it was banned.  Explains a lot of what we're seeing these days.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iajmsxl",
                    "author": "RunKlutzy5350",
                    "score": 2,
                    "created_utc": 1653919128.0,
                    "response": "I saw 29.8B (or something darn close to that) was scammed over the phone last year by those shitty Indian call centers alone. \n\nWhen you bot something that bad it only needs to trick one of the 15,000 people you send it to ya know.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "v0tnuw",
            "title": "Mentor Monday, May 30, 2022: Ask all your bitcoin questions!",
            "url": "https://www.reddit.com/r/Bitcoin/comments/v0tnuw/mentor_monday_may_30_2022_ask_all_your_bitcoin/",
            "author": "rBitcoinMod",
            "created_utc": 1653890916.0,
            "score": 24,
            "num_comments": 36,
            "subreddit": "Bitcoin",
            "selftext": "Ask (and answer!) away! Here are the general rules:\r\n\r\n* If you'd like to learn something, ask.\r\n* If you'd like to share knowledge, answer.\r\n* Any question about Bitcoin is fair game.\r\n\r\nAnd don't forget to check out /r/BitcoinBeginners\r\n\r\nYou can sort by new to see the latest questions that may not be answered yet.",
            "stickied": true,
            "comments": [
                {
                    "id": "iaitgkc",
                    "author": "Desperate-Barnacle-4",
                    "score": 3,
                    "created_utc": 1653897585.0,
                    "response": "Can someone help me understand how to make P2TR addresses from my BIP32 master private? Pseudo code, python or golang?\n\nIs this rough flow correct? Derive private key (bip86?) -> Tweak public key to make unspendable root of script? (Not the address we see?) -> Create a branch on the script to spend from the private key?\n\nWhat is the advantage of the tweaked key in this case? Or is it the address we see? Does this give us the opportunity for spendable vanity addresses for example?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iajfsn6",
                            "author": "pwuille",
                            "score": 7,
                            "created_utc": 1653915340.0,
                            "response": "The process would be:\n\n* Start from the BIP32 master key\n* Derive the BIP32 leaf according to the path you're using (BIP86 or other)\n* Let `P` be the point with just the X coordinate of your derived leaf above, and even Y coordinate.\n* Let `Q = P + H_TapTweak(P.x)G`, the point obtained by tweaking `P` by value `H_TapTweak(P.x)`.\n* Encode the X coordinate of `Q` in a BIP350 address (witness version 1, program size 32 bytes, bech32m checksum).\n\nIf you don't plan to use the P2TR script path at all, it doesn't actually matter how you obtain `Q`. It just has to be some point you know the private key to, as that will be required when signing for it. You could use `Q=P` directly, and strictly speaking you don't even need to use BIP32 to derive `P` (though many wallets may not offer any other way).\n\nAs to why the tweaking from `P` to `Q` is still recommended: there are more advanced scenarios in which you may wish to be able to *prove* that no script path exists. Using the tweaking mechanism permits that, as you can reveal `P` and the method by which `Q` was computed from it (without revealing the private key), which should suffice to convince another party that you didn't hide any actual scripts in there. In the single-key single-party use case you're talking about, there is nobody to convince probably, so this doesn't matter, but for compatibility reasons it's nicer to pick a single standard.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iajrnf6",
                    "author": "Weekly-Craft-9878",
                    "score": 3,
                    "created_utc": 1653921494.0,
                    "response": "Is there a way I can allow clients to pay me with bitcoin without coordinating with them the time they’re ready and always sending unique public keys every single time? I’m used to receiving bitcoin to my ledger and that just wouldn’t work with my large business. I want a method similar to a Venmo handle, “here is the address, send on your own time when you’re ready” … and ideally something standard that be repeatedly used on every invoice sheet",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iajs55w",
                            "author": "Rannasha",
                            "score": 5,
                            "created_utc": 1653921725.0,
                            "response": "BTCPay is an open source invoicing system / payment processor for Bitcoin payments. It probably has what you need, though I'm not sure how much work it is to set it up.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iajs8hp",
                                    "author": "Weekly-Craft-9878",
                                    "score": 2,
                                    "created_utc": 1653921769.0,
                                    "response": "Thanks I’ll check it out!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "ial0nv6",
                            "author": "_ich_",
                            "score": 1,
                            "created_utc": 1653941973.0,
                            "response": "As said below... BTCpay!\n\nBut you can also choose between different payment processors: CashApp, Paypal, BiPay, Coinbase, EllyPay... (if you are not tech savvy).",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iairrhq",
                    "author": "__01000010",
                    "score": 5,
                    "created_utc": 1653896083.0,
                    "response": "I'm confused about how wallets generate secret keys. Even if a cryptographically secure pseudorandom number generator is used, isn't there still a possibility that the key generated is identical to one already used by someone else on the network? And if so, isn't that a major security issue?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaitwhl",
                            "author": "Desperate-Barnacle-4",
                            "score": 7,
                            "created_utc": 1653897970.0,
                            "response": "Checkout chapter 5 from the 'mastering bitcoin' book: [https://github.com/bitcoinbook/bitcoinbook/blob/develop/ch05.asciidoc](https://github.com/bitcoinbook/bitcoinbook/blob/develop/ch05.asciidoc) \n\nRandom distribution is achieved using a hash. Given your entropy BIP39 says 'using pbkdf2\\_hmac and sha512, hash the entropy 2048 times'. From that hash you get your 'master private key'. The master private is then hashed again with a path \"m/0\", \"m/1\" etc to make an infinite number of private keys. I have simplified here but the page linked above gives all the details.\n\nThe 256-bit key space is so large that there is no meaningful chance of collision.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iais9a1",
                            "author": "saltypandaa",
                            "score": 2,
                            "created_utc": 1653896518.0,
                            "response": "You soon see how unlikely it is when see the number of possible keys. I don't know the actual figures but Andreas Antonopolus does a good explanation of this. In conclusion, its not an issue.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "ialde91",
                            "author": "MiguelLancaster",
                            "score": 2,
                            "created_utc": 1653948137.0,
                            "response": "try it out for yourself \n\nhttps://keys.lol/bitcoin/random",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iais5sh",
                            "author": "Cheesebaron",
                            "score": 1,
                            "created_utc": 1653896434.0,
                            "response": "Yes, there is a possibility but it is incredibly small. Here is a video explaining how small of a chance it is to guess a digital signature (265bit) https://m.youtube.com/watch?v=S9JGmA5_unY",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iaiu3kq",
                                    "author": "__01000010",
                                    "score": 1,
                                    "created_utc": 1653898147.0,
                                    "response": "Thanks, the video puts things into perspective",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iaix5wk",
                                            "author": "Cheesebaron",
                                            "score": 2,
                                            "created_utc": 1653900940.0,
                                            "response": "To me the scary part is more about how this random number is generated or picked because computers are incredible deterministic (deterministic = they do the same thing everytime) machines.... Poker Stars, for example, uses cosmic background radiation to shuffle their card decks and cloud flare takes pictures of lava lamps to generate random numbers (interesting video here: https://youtu.be/1cUUfMeOijg). Of coarse there are no lava lamps or cosmic background detectors in the average PC or smartphone so another approach is needed. Most modern computers probably have a good random number generator. I say probably because this part is usually in the \"secure area\" of the CPU and is not open source but researchers have looked at the outputs of these random number generators and have determined that they most likely do generate true random numbers. The problem is more with computers that do not have that and have to rely on pseudo-randomness. A third concern is how the wallet software uses these functions,... I remember a very poor implementation of a wallet that simply used the date and time as the input to generate the seed. Once this was discovered people were able to \"guess\" or \"re-generate\" other peoples seed. The rabbit hole is endless and if you really want to go full tinfoil hat here, there are hardware wallets that allow you to flip coins or roll dice to generate a true random number.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ialhcfx",
                                                    "author": "igadjeed",
                                                    "score": 1,
                                                    "created_utc": 1653950101.0,
                                                    "response": "> cosmic background radiation\n\nWhat if they're receiving a SETI message, as in the Contact movie? All their keys will be deterministically derived from TV frames of the Berlin Olympic Games  \n\nIn the real world, the entropy generation in a modern computer and operating system has improved during the life of Bitcoin. The keys for spending all those unspent 50 BTC reward coins from 2009 might be less random than they would be today",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "ialgjnq",
                            "author": "igadjeed",
                            "score": 1,
                            "created_utc": 1653949698.0,
                            "response": "> isn't there still a possibility that the key generated is identical to one already used by someone else on the network\n\nThere is a non-zero probability. The key size is chosen to make that probability small enough to be practically impossible in the time before the sun enlarges to engulf the earth  \n\nThis is not specific to Bitcoin. All cryptography relies on key length making collision probability too small to matter. Zero probability does not exist",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iaiqy2t",
                    "author": "Crawlero",
                    "score": 1,
                    "created_utc": 1653895373.0,
                    "response": "What level of NFTs can work on bitcoin, can I create a tradable access token?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaiu258",
                            "author": "Desperate-Barnacle-4",
                            "score": 1,
                            "created_utc": 1653898111.0,
                            "response": "It is possible on an L2 for example Liquid [https://blog.blockstream.com/en-light-nite-launches-liquid-powered-gaming-nfts/](https://blog.blockstream.com/en-light-nite-launches-liquid-powered-gaming-nfts/) and RGB [https://diba.io/](https://diba.io/)",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ialikdw",
                                    "author": "Crawlero",
                                    "score": 1,
                                    "created_utc": 1653950718.0,
                                    "response": "Interesting, liquid in general seems interesting.  Thanks for the response.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iakul3u",
                    "author": "dantebayer",
                    "score": 1,
                    "created_utc": 1653939089.0,
                    "response": "Is there any solution to the ever growing size of the blockchain?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ial00to",
                            "author": "Cats_n_Porn",
                            "score": 2,
                            "created_utc": 1653941665.0,
                            "response": "Is a solution even needed? By all estimates advances in data storage and bandwidth will outpace the growth of the Blockchain.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iald6cb",
                            "author": "escodelrio",
                            "score": 2,
                            "created_utc": 1653948029.0,
                            "response": "The Blockchain is under 400 gigs, which is after over 12 years. Garbage altcoins need to worry about blockchain size far more than Bitcoin.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "ialcn0d",
                            "author": "CallingVoid",
                            "score": 1,
                            "created_utc": 1653947757.0,
                            "response": "It's a problem that cannot be solved, you just have to try to keep chain growth low enough that the falling cost of storage outstrips its growth.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "ialcs8q",
                            "author": "MiguelLancaster",
                            "score": 1,
                            "created_utc": 1653947831.0,
                            "response": "It's a non-issue\n\nIt's estimated that medical data accounts for 30% of all of the world's data volume. We're talking ungodly numbers here -- thousands of exabytes out of zettabytes\n\nThe current size of the bitcoin blockchain somewhere around 400GB, I believe. Its growth in size will not outpace affordable consumer storage drives",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ialqelj",
                                    "author": "Etovia",
                                    "score": 1,
                                    "created_utc": 1653954775.0,
                                    "response": "> The current size of the bitcoin blockchain somewhere around 400GB, I believe. Its growth in size will not outpace affordable consumer storage drives\n\nit is about sync time, not about storage size. already it is a burden.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iakxzp4",
                    "author": "yolodogewtf",
                    "score": 1,
                    "created_utc": 1653940693.0,
                    "response": "What type of smart contracts can taproot run?  \n\nHow different is it compared to what that other Vitalik coin does?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ial6zrh",
                            "author": "Fiach_Dubh",
                            "score": 4,
                            "created_utc": 1653944974.0,
                            "response": "smart contract is such a subversive marketing buzz word used by shitcoins. Bitcoin already had/has smart contracts before taproot. Taproot enabled some more privacy solutions.\n\nsmart contracts have always existed in Bitcoin, its just the script kiddies can't code and are too smooth brained to use it.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iamail3",
                    "author": "thefullmcnulty",
                    "score": 1,
                    "created_utc": 1653965133.0,
                    "response": "If I use a ColdCard (mk3) with Electrum on my MacBook Pro (with a VPN) is there any information I’ll leave behind that could reveal my identity linked to my fresh ColdCard addresses? \n\nI’m building a non-KYC apocalypse stack and want those addresses just floating out there untethered to me in any way.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iamcwrd",
                            "author": "sciencetaco",
                            "score": 1,
                            "created_utc": 1653966432.0,
                            "response": "Whichever Electrum node you connect to will know the addresses are being checked. \n\nYou can run your own node and connect Electrum to it for ultimate privacy.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iamdug2",
                                    "author": "thefullmcnulty",
                                    "score": 1,
                                    "created_utc": 1653966966.0,
                                    "response": "Interesting, thanks for the reply. I’m unable to run a node because my internet is terrible. I’m located rural and just can’t get good high speed internet here. I’m holding out hope for Starlink but it’s not available yet. \n\nSo if the Electrum node knows when I check the addresses what information specifically will be discernible from that action?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iame4pl",
                                            "author": "sciencetaco",
                                            "score": 1,
                                            "created_utc": 1653967130.0,
                                            "response": "My guess is the addresses being checked and the IP address of the VPN node or Tor exit node.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iamem33",
                                                    "author": "thefullmcnulty",
                                                    "score": 1,
                                                    "created_utc": 1653967407.0,
                                                    "response": "That makes sense. \n\nI’m desperate to run a node but I just can’t right now.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iamhqn8",
                    "author": "AEMGrowthVentures",
                    "score": 1,
                    "created_utc": 1653969287.0,
                    "response": "How does the network's security fare after the next halving? I've heard another side where btc security is at risk when mining is less competitive? Can you make more sense of this to me. thanks",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iamkd67",
                            "author": "igadjeed",
                            "score": 1,
                            "created_utc": 1653970964.0,
                            "response": "Bitcoin is secured by its node network. The mining reward halving has no effect",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iam8m8i",
                    "author": "MotorHemped",
                    "score": 0,
                    "created_utc": 1653964131.0,
                    "response": "How to MORB?",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}