{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "urxlys",
            "title": "Interested in hearing reasons against this proposal",
            "url": "https://www.reddit.com/r/Bitcoin/comments/urxlys/interested_in_hearing_reasons_against_this/",
            "author": "mrmishmashmix",
            "created_utc": 1652824901.0,
            "score": 0,
            "num_comments": 12,
            "subreddit": "Bitcoin",
            "selftext": "Thought Experiment: Rather than keeping the 2.1 Quadrillion limit, Continue to subdivide btc and add on zero's on so that mining may long continue. \n\n&#x200B;\n\nI'm just interested in arguments for and against this. Obviously we have one hundred years ahead of us to prepare for this, but I quite like the idea of block rewards continuing in perpetuity. But doubtless there may be some very good reasons why this is impractical and stupid. Thoughts?",
            "stickied": false,
            "comments": [
                {
                    "id": "i901jst",
                    "author": "Inevitable_River_509",
                    "score": 4,
                    "created_utc": 1652825090.0,
                    "response": "There will only be 21 million btc, there are shitcoins for infinite supplies if that’s a preference.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9022zd",
                    "author": "WritingFun8769",
                    "score": 2,
                    "created_utc": 1652825326.0,
                    "response": "that’s not possible. subdividing doesn’t increase the amount of bitcoins, and so mining would still lose its block reward when the final reward is produced by the blockchain.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i904zjd",
                    "author": "SpiritmongerScaph",
                    "score": 2,
                    "created_utc": 1652826653.0,
                    "response": "I don't quite get the idea:\n\nEither you end up creating more than 21m (big no)\n\nOr\n\nYou still end up with 21m and it doesn't change anything",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i90e9aa",
                    "author": "goobar_oz",
                    "score": 2,
                    "created_utc": 1652831032.0,
                    "response": "I don’t think most commenters understand what OP is saying. He’s not suggesting increase in 21 m BTC. He’s saying that in 2140, when block rewards are 1 sat, and it is time to half rewards, rather round up to reward the last sat to complete 21m, continue to divide so that block rewards become 0.5 sat, then 0.25 sat, etc. \nOP, it actually would make no difference as miner rewards would be 99.99% based on fees on then.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i901k4r",
                    "author": "SirSkittles111",
                    "score": 2,
                    "created_utc": 1652825094.0,
                    "response": "So just infinitely print coins? What makes it so different to fiat at that point",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i90atgx",
                    "author": "SmoothGoing",
                    "score": 1,
                    "created_utc": 1652829386.0,
                    "response": "Mining must continue indefinitely. Has nothing to do with sat limit.\n\nYou don't understand divisibility. Measuring a day in seconds instead of hours doesn't make the day longer. So subdividing units doesn't make mining more rewarding. If you want a coin with unlimited issuance you have lots of shitcoin options.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i90dxwn",
                    "author": "E-renter",
                    "score": 1,
                    "created_utc": 1652830880.0,
                    "response": ">so that mining may long continue\n\nThis is absolutely not necessary. There will always be transaction fees for miners. I wish people understood this, pretty much every day in this subreddit I see people asking what happens when the mining rewards end. They will never end, because there will always be transaction fees.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i90eygc",
                    "author": "thats_just_right",
                    "score": 1,
                    "created_utc": 1652831372.0,
                    "response": "Subdividing is not the same as continued mining. Perpetual mining is bad because one of Bitcoin's biggest advantages over fiat currency is that it cannot be infinitely inflated. \n\nBut if you're asking about subdividing more than the current limit of 100k Satoshis/BTC, I think of it like this. Imagine some glorious future where 1BTC = $100,000,000 USD. At that point one Satoshi would be worth a dollar (assuming I'm doing my math right). So you might argue that people could no longer buy anything for less than a dollar. Then I would counter, that by that time, a dollar would be so debased, that you couldn't buy anything for $1USD anyway. Just like you can't buy anything (that I'm aware of) for a penny today.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i90m77w",
                    "author": "Major_Bandicoot_3239",
                    "score": 1,
                    "created_utc": 1652834827.0,
                    "response": "Go Google Market Cap. Then come back to Reddit.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i90pudk",
                    "author": "swgo1",
                    "score": 1,
                    "created_utc": 1652836550.0,
                    "response": "2nd layer systems can divide SATs if needed.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9020ll",
                    "author": "gsurfin",
                    "score": 0,
                    "created_utc": 1652825296.0,
                    "response": "This defeats the whole purpose of Bitcoin.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}