{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "urlrvg",
            "title": "I think that inflation isn't the only reason that FIAT causes higher costs of living.",
            "url": "https://www.reddit.com/r/Bitcoin/comments/urlrvg/i_think_that_inflation_isnt_the_only_reason_that/",
            "author": "ProEngineerXD",
            "created_utc": 1652791916.0,
            "score": 2,
            "num_comments": 4,
            "subreddit": "Bitcoin",
            "selftext": "At the last couple of months I have been trying to take a more neutral approach to look at bitcoin, I was trying to figure out if bitcoin really offers value to humanity or maybe I am just biased because I want the value to increase. I came to the realization that FIAT kills the middle class, and it is not just because of the inflation, it is mainly due to the fact that you are allowed to borrow money that doesn't exist. Before the dollar was disconnected from the gold, getting a house and food was much more affordable - the quality of life has indeed improved due to technology, but I really do think that it could have been MUCH better. When you are allowed to take a debt for something as crucial as a home, you will do it no matter what as it is the most important physical thing that we can own in this world. The supply may grow a little bit, but the competition is willing to pay what-ever it takes, and as banks are allowed to give away money that they don't even have, they are more than willing to make you their slave for the next 30 years. If they were only allowed to give away money that they do have, the costs of real-estate were much lower and the chain effect would take care of many more aspects of life.\n\nI do not think that inflation is necessary for a functioning economy, if bitcoin really becomes the reserve currency and it's buying power increases in a rate that is similar to the growth of the world's economy I think that it is is very reasonable. I also think that the lowering costs of living would increase birth-rate which is the most crucial thing to the future of the world's economy and our continuation in this universe.\n\nLighting network is awesome and centralized custodians are necessary for mass adoption, while the option to store bitcoin on your own wallet is a bonus.\n\nThe energy usage of bitcoin is not a problem with lightning, it has potential to solve many more of bitcoin's problems and I also believe that the way to go about energy usage is by trying to solve problems instead of trying to reduce energy consumption, we have way more energy than we need, we just need to learn how to use it well.\n\nThere are a lot more things that I have considered, but my final conclusion is that the world would be a much better place if bitcoin becomes the reserve currency. I'm starting to really love the analogy that bitcoin is a Trojan horse, people join because of pure greed without even understanding that it is a revolution that ***could*** change the world for better.\n\nMy main concern right now would be that some people do not deserve become super wealthy just because they bought bitcoin early, there are a lot of people who contribute a lot to humanity in their jobs that still can't see what's happening here - but I guess it is what it is..",
            "stickied": false,
            "comments": [
                {
                    "id": "i8xx9ml",
                    "author": "turbosecchia",
                    "score": 1,
                    "created_utc": 1652793090.0,
                    "response": "False difference. Creating money via borrowing is inflation as long as you define inflation as the increase in the money supply.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8xylln",
                    "author": "village_of_idiots",
                    "score": 1,
                    "created_utc": 1652793748.0,
                    "response": "\"fiat\" is a Latin word not an acronym",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8xznoj",
                    "author": "ma0za",
                    "score": 1,
                    "created_utc": 1652794263.0,
                    "response": ">My main concern right now would be that some people do not deserve become super wealthy just because they bought bitcoin early, there are a lot of people who contribute a lot to humanity in their jobs that still can't see what's happening here - but I guess it is what it is..\n\nlets thank god you are not the one to decide who deserves what.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8xzc6r",
                    "author": "Iguana_The_Wise",
                    "score": 1,
                    "created_utc": 1652794108.0,
                    "response": "*\"My main concern right now would be that some people do not deserve become super wealthy just because they bought bitcoin early\"*\n\nThey absolutely deserve it.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}