{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "sultun",
            "title": "Jordan Peterson has been CONFIRMED as a speaker at the 2022 Bitcoin conference!",
            "url": "https://i.redd.it/rf2uq52dgdi81.jpg",
            "author": "CryptoLouis",
            "created_utc": 1645094270.0,
            "score": 1020,
            "num_comments": 818,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "hxc98lk",
                    "author": "BashCo",
                    "score": 1,
                    "created_utc": 1645122607.0,
                    "response": "Many of the accounts coming here to try and get this censored by abusing the report function have never been to a Bitcoin conference and have no intention of attending this Bitcoin conference. The list of speakers has no bearing whatsoever on any of their lives.\n\nFor the record, the authoritarian bigots lingering in this subreddit recently are doing a great disservice to Bitcoin. https://twitter.com/TheKavernacle/status/1494643729432514603",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hxanjl3",
                    "author": "man-vs-spider",
                    "score": 975,
                    "created_utc": 1645097288.0,
                    "response": "What is his relevance to Bitcoin?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hxawnc8",
                            "author": "Schwickity",
                            "score": 707,
                            "created_utc": 1645102913.0,
                            "response": "He literally just understood bitcoin a few weeks ago",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hxb5zf6",
                                    "author": "genius_retard",
                                    "score": 10,
                                    "created_utc": 1645107431.0,
                                    "response": "\"Understood\". I doubt he really understands it any more than at the most superficial level.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "hxaz1qn",
                            "author": "loosemooseweekend",
                            "score": 250,
                            "created_utc": 1645104165.0,
                            "response": "He’s going to theorize badly on the state of gender and race as it compares to digital currency",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hxb29o7",
                                    "author": "Kinojitsu",
                                    "score": 127,
                                    "created_utc": 1645105740.0,
                                    "response": "Nah he's gonna spend 40 minutes ranting about Cultural Marxism without even mentioning the word Bitcoin once.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hxb51ok",
                                            "author": "DrPoontang",
                                            "score": 59,
                                            "created_utc": 1645107012.0,
                                            "response": "He’s also going to do that thing with his voice where he makes it it sound like he’s about to start crying at any moment so that it triggers your empathy response which increases the likelihood that you’ll listen to him drone on and on instead of doing something productive.￼",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "hxb1vjr",
                                    "author": "DrunkManiac",
                                    "score": 32,
                                    "created_utc": 1645105554.0,
                                    "response": "🤣🤣🤣🙏🏻",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "hxaw8xq",
                            "author": "Hough_G_Rection",
                            "score": 51,
                            "created_utc": 1645102688.0,
                            "response": "He’s not relevant to BTC, but neither was Tim Dillon",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hxb18vc",
                                    "author": "humanstink01",
                                    "score": 19,
                                    "created_utc": 1645105248.0,
                                    "response": "Tim Dillon is at least funny.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "hxb04ke",
                                    "author": "gotbeefpudding",
                                    "score": 4,
                                    "created_utc": 1645104704.0,
                                    "response": "Don't you talk shit about our favourite cum pig!",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hxb1aop",
                                            "author": "Hough_G_Rection",
                                            "score": 5,
                                            "created_utc": 1645105272.0,
                                            "response": "Oh I would never. I fucking love that man",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "hxawz58",
                            "author": "MEGACOMPUTER",
                            "score": 188,
                            "created_utc": 1645103094.0,
                            "response": "He is a know grifter and crypto is a space vulnerable to scams. Fuck this little benzo gremlin.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hxb2ivd",
                                    "author": "innocuousremark",
                                    "score": 3,
                                    "created_utc": 1645105856.0,
                                    "response": "Known by whom, and why?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hxb3r6m",
                                            "author": "ReeceM86",
                                            "score": 32,
                                            "created_utc": 1645106428.0,
                                            "response": "By anyone that has followed his move from boring U of T prof to a top earner on patreon, and all through his Russian hospital time. Dude is excellent at taking money from idiots.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hxb576l",
                                                    "author": "innocuousremark",
                                                    "score": -8,
                                                    "created_utc": 1645107081.0,
                                                    "response": "A grift means some kind of fraud, though. What's the actual grift here?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "hxb5c2k",
                                                            "author": "ReeceM86",
                                                            "score": 13,
                                                            "created_utc": 1645107142.0,
                                                            "response": "You are incorrect. To grift is to swindle or rip off. Also known as a con artist or snake-oil salesman. It is not a legal term like fraud.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "hxb5yrx",
                                                                    "author": "Vladimus44",
                                                                    "score": -9,
                                                                    "created_utc": 1645107422.0,
                                                                    "response": ">swindle or rip off. Also known as a con artist or snake-oil salesman.\n\nBut deceptive advertising is still illegal...\n\n>It is not a legal term like fraud\n\nIt sounds like you know you can't prove anything he's said is illegal, but you just don't like what he's said.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "hxb6aqk",
                                                                            "author": "ReeceM86",
                                                                            "score": 7,
                                                                            "created_utc": 1645107573.0,
                                                                            "response": "Not at all. The guy makes large sums of money pandering to uniformed listeners and collecting donations. It isn’t illegal, it’s also grifting. \nTake a look at his self help titles. Find one concept that isn’t a rehash of the past dozen big self help books. Again, not illegal, not getting flagged for plageriam, still scum (like most self help authors). I don’t think you know who JP is or what he does based on the way you are approaching this. It’s not a false advertising issue. \n\nNot understanding why this concept is so difficult for people to get. Maybe his fan boys don’t want to admit they were fleeced.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "hxb8g5p",
                                                                                    "author": "Vladimus44",
                                                                                    "score": -1,
                                                                                    "created_utc": 1645108512.0,
                                                                                    "response": ">Find one concept that isn’t a rehash of the past dozen big self help books.\n\nHe openly says he's trying to take concepts from the past, and present them to a modern audience. Which is why he has lectures on the bible, and tends to cut out the fire and brimstone stuff.\n\n\n>Again, not illegal, not getting flagged for plageriam, still scum\n\nAh, I see.\n\nYou don't actually understand what plagiarism is. Ideas are not inherently owned by anyone. Especially very old ideas.\n\nPeterson is fairly explicit in where he gets a lot of his ideas from. Carl Jung and some other influences.\n\n>I don’t think you know who JP is or what he does based on the way you are approaching this. It’s not a false advertising issue. \n\nIt's very much the other way around.\n\nIronically, you are just regurigiting the same talking points about him that I've heard countless times, without the ability to cite specific examples.\n\nIt's always vague assertions, because you don't actually know the details.\n\nI've spent a lot of time investigating Peterson because I've been a fan of Sam Harris, who has engaged him in debate several times. I'm fairly confident Peterson is sincere in his beliefs, and he is just wrong.\n\nBeing wrong isn't a grift. Sorry.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "hxba4s8",
                                                                                            "author": "ReeceM86",
                                                                                            "score": 8,
                                                                                            "created_utc": 1645109228.0,
                                                                                            "response": "Thanks for taking the time to put this together. \n\nYour initial points look like attempts to conflate his academic career (maps and meaning, lectures, Carl Jung), and his post-academic podcast and book career. \n\nI should have explained the  plagiarism comment better. I was saying that he is not being accused of plagerism, as he and pretty much all the self help writers peddling the same type of content use this semi authoritarian style to their self help books while providing nothing new or of substance. (See extreme ownership for another example).\n\nWe agree he is wrong, we will not agree regarding his motivations. \n\nHope you enjoyed the dive into Harris, especially his work on meditation.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "id": "hxb6rgn",
                                                                                    "author": "JingleBellBitchSloth",
                                                                                    "score": -6,
                                                                                    "created_utc": 1645107779.0,
                                                                                    "response": "But why is it a \"scam\" if people have claimed his literature to be useful and/or helpful? Like, I understand that you may look at it and see \"scam\" because you're already familiar with the concepts he writes/talks about, but for anyone with no prior exposure, and especially if they find it to be helpful/useful in their lives, is that really a negative thing?",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "hxb72ng",
                                                                                            "author": "ReeceM86",
                                                                                            "score": 11,
                                                                                            "created_utc": 1645107913.0,
                                                                                            "response": "If you buy 12 rules and get some value out of it, that’s great. If you buy 12 rules, tune into to his podcast where he waded into topics he knows  wry little about (conflates economic theory, dabbles into gender dynamics…) and start donating because he is your new “free speech advocate”, you’ve been grifted. There is a reason he is often referred to as the dumb persons smart guy.\n\nEdit: at the end of the day, if you want to donate to a guy that is pandering to your confirmation bias and peddling content he knows to be disingenuous at best, you have supported his grift.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "hxb89m5",
                                                                    "author": "innocuousremark",
                                                                    "score": -5,
                                                                    "created_utc": 1645108434.0,
                                                                    "response": "Con artists and snake oil salesmen are defined by the fraud they engage in. I can't find a definition of \"grift\" that doesn't involve fraud, including your own examples.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "hxb8j97",
                                                                            "author": "ReeceM86",
                                                                            "score": 7,
                                                                            "created_utc": 1645108549.0,
                                                                            "response": "It is you claiming grift is the same as fraud. Take it up with Webster.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "hxb955i",
                                                                                    "author": "innocuousremark",
                                                                                    "score": 4,
                                                                                    "created_utc": 1645108812.0,
                                                                                    "response": "Mirriam-Webster's definition of grift is \"to obtain (money or property) illicitly (as in a confidence game).\" That is fraud. So what is the illicit activity Peterson engages in to obtain money? Rember, illicit means illegal.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "hxb9dhx",
                                                                                            "author": "ReeceM86",
                                                                                            "score": 10,
                                                                                            "created_utc": 1645108911.0,
                                                                                            "response": "Again you try to make this a legal discussion. Illicit may refer to legality, but also can mean immoral or in violation of customs and noms (again, as per Webster).\n\nThe activity Peterson has taken part in is a donation based pandering scheme combined with the publication of numerous self help books that are just rehashes of typical low quality self help. Like many other self help writers, he preys in an uninformed and curious audience base.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "hxb3tj2",
                                            "author": "natestewiu",
                                            "score": -6,
                                            "created_utc": 1645106458.0,
                                            "response": "This is a troll. Leave it under the bridge.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "hxb8kad",
                            "author": "blorbschploble",
                            "score": 53,
                            "created_utc": 1645108562.0,
                            "response": "He’s part of GOOP for men; Rogan, Shapiro, Peterson, Bitcoin, NFTs, stonks",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hxbwy3v",
                                    "author": "Hot-Canceld",
                                    "score": 11,
                                    "created_utc": 1645118071.0,
                                    "response": "LOL",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "hxb8fkm",
                            "author": "Byaaah",
                            "score": 41,
                            "created_utc": 1645108506.0,
                            "response": "Grifters gonna grift",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hxb3srn",
                            "author": "timbulance",
                            "score": 11,
                            "created_utc": 1645106448.0,
                            "response": "Don’t know don’t care. Tick tock next block",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hxb361v",
                            "author": "ilikedevo",
                            "score": 21,
                            "created_utc": 1645106158.0,
                            "response": "He only eats meat and he thinks Bitcoin is a small cut of beef.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hxb3lpw",
                            "author": "ReeceM86",
                            "score": 2,
                            "created_utc": 1645106360.0,
                            "response": "He just pops into anything he can really. Dude knows how to grow his audience and make donation money.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hxb7m4o",
                            "author": "hdmx539",
                            "score": 1,
                            "created_utc": 1645108148.0,
                            "response": "Nothing. This is gross.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hxb2ms3",
                            "author": "AAAdamKK",
                            "score": -1,
                            "created_utc": 1645105908.0,
                            "response": "None really. Though he is a good public debater/ speaker and has expressed interest in Bitcoin and what it stands for quite recently.\n\nI don't agree with him on everything but he does often present thought provoking ideas in his talks. Even if he does sound a bit pretentious sometimes with his Post-Neo-Marxist psychology mumbo jumbo.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hxb1v77",
                            "author": "RiskyRabbit",
                            "score": -4,
                            "created_utc": 1645105550.0,
                            "response": "Everyone has relevance to Bitcoin. That’s the point. We’re not gonna get very far if we get upset when people who’s opinion we disagree with talk in favour of it.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hxb573l",
                                    "author": "man-vs-spider",
                                    "score": 19,
                                    "created_utc": 1645107080.0,
                                    "response": "I disagree, getting speakers with no direct relevance to Bitcoin is counterproductive if they are controversial. With no further context this will push people away.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hxb9g95",
                                            "author": "Ninetails_009",
                                            "score": 1,
                                            "created_utc": 1645108943.0,
                                            "response": "Saying men have penises and women have vaginas are considered controversial these days. \n\nI don't understand the hate this guy is getting. He talks about men's rights, tech censorship, and self reliance. Why is this so controversial to you?",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "hxapc8d",
                            "author": "Playful_Magazine8427",
                            "score": -96,
                            "created_utc": 1645098561.0,
                            "response": "Bitcoin is a socioeconomic revolution, in addition to a technological one. \n\nPeterson is a psychologist with long studies in socioeconomic affairs and history, and a guy who studies different topics multiple hours a day. \n\nWhy isn’t he relevant to Bitcoin? Aren’t we all relevant to Bitcoin after all?\n\nAnd anyway, let’s hear what he has to say.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hxaqi8k",
                                    "author": "Sunzoner",
                                    "score": 25,
                                    "created_utc": 1645099315.0,
                                    "response": "Only if what he will be saying is relevent to bitcoin.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "hxatewz",
                                    "author": "BjiZZle-MaNiZZle",
                                    "score": 85,
                                    "created_utc": 1645101092.0,
                                    "response": ">a guy who studies different topics multiple hours a day.\n\nCringe.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hxaxs91",
                                            "author": "ShittingOutPosts",
                                            "score": 14,
                                            "created_utc": 1645103520.0,
                                            "response": "Soooo he’s an internet expert?  Great…",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "hxaxwgv",
                                    "author": "Friendly_Crab",
                                    "score": 17,
                                    "created_utc": 1645103581.0,
                                    "response": "multiple hours a day huh? Impressive",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hxbmfdx",
                                            "author": "Playful_Magazine8427",
                                            "score": 0,
                                            "created_utc": 1645114114.0,
                                            "response": "How many books have you read in the last 2 years?\n\nYes, multiple hours of reading EVERY day can make you an expert in a matter of months.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "hxara0l",
                                    "author": "IceNinetyNine",
                                    "score": 43,
                                    "created_utc": 1645099797.0,
                                    "response": "Lmfao none of those are reasons. He's not an economist he's a grifter, and he's also losing it mentally.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "hxaqm6b",
                                    "author": "Beatplayer",
                                    "score": 24,
                                    "created_utc": 1645099384.0,
                                    "response": "Let’s not eh?",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "hxauy32",
                                    "author": "WorriedViolinist7648",
                                    "score": 18,
                                    "created_utc": 1645101977.0,
                                    "response": "And he is someone with an agenda that ultimately favours rich elites. He wraps it nicely for the untrained eye but it is there.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "hxazgql",
                                    "author": "dopelicanshave420",
                                    "score": 5,
                                    "created_utc": 1645104373.0,
                                    "response": "Delicious pasta",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "hxb2efb",
                                    "author": "emptysoul365",
                                    "score": 2,
                                    "created_utc": 1645105799.0,
                                    "response": "> Why isn’t he relevant to Bitcoin? Aren’t we all relevant to Bitcoin after all?\n\nI eagerly await my invitation to speak at the next conference.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hxbnuzf",
                                            "author": "Playful_Magazine8427",
                                            "score": 3,
                                            "created_utc": 1645114664.0,
                                            "response": "To be clear, I have better understanding and knowledge of Bitcoin than Peterson. But that doesn’t make him irrelevant, nor can I go speak in a conference. I have no public speaking experience and no credentials, just personal knowledge.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "hxbmgyy",
                                            "author": "Playful_Magazine8427",
                                            "score": 2,
                                            "created_utc": 1645114132.0,
                                            "response": "Ask for it.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "hxb0rob",
                                    "author": "Devilman6979",
                                    "score": 4,
                                    "created_utc": 1645105017.0,
                                    "response": "Peterson is a fucking incel hack.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "hxaw8jk",
                                    "author": "carboonpn",
                                    "score": -14,
                                    "created_utc": 1645102682.0,
                                    "response": "Fuck those downvoters they are ignorant and have personal issues with some of his fresh views. \n\nJordan Peterson has the broadest view on society as a whole and he's great thinker.\n\nLet's hear what he has to say.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hxb2kzj",
                                            "author": "emptysoul365",
                                            "score": 4,
                                            "created_utc": 1645105884.0,
                                            "response": "> fresh views\n\n😂😂😂",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hxb44a2",
                                                    "author": "carboonpn",
                                                    "score": -2,
                                                    "created_utc": 1645106595.0,
                                                    "response": "Let's reply in emoji. 🥱",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "hxb4k2z",
                                                            "author": "emptysoul365",
                                                            "score": 1,
                                                            "created_utc": 1645106792.0,
                                                            "response": "👍",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "hxavhq6",
                            "author": "TrudleR",
                            "score": -21,
                            "created_utc": 1645102272.0,
                            "response": "he represents \"sanity\" (and order) and is a huge symbol for millions of people, me included! he is not \"in it for the tech\", he's in it because he sees an advantage for the whole of humanity!\n\ni absolutely look forward to him being on this conference!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hxayjy7",
                                    "author": "MachineHoneyBadger",
                                    "score": 19,
                                    "created_utc": 1645103919.0,
                                    "response": "Is this like a parody comment or?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "hxb0s7s",
                            "author": "_beastayyy",
                            "score": -4,
                            "created_utc": 1645105025.0,
                            "response": "He's a fucking smart guy so it's great to have a smart person talking???",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hxanxff",
                    "author": "shaddowkhan",
                    "score": 808,
                    "created_utc": 1645097573.0,
                    "response": "Why though? Guy learned about Bitcoin 5 minutes ago.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hxasxmv",
                            "author": "your_inner_monologue",
                            "score": 166,
                            "created_utc": 1645100806.0,
                            "response": "He sees another opportunity to grift",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hxayz2o",
                                    "author": "zomgitsduke",
                                    "score": 20,
                                    "created_utc": 1645104127.0,
                                    "response": "This. Make his own coin. Push some sales pitch disguised as philosophy. Make millions.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hxazs2f",
                                            "author": "NotLurking101",
                                            "score": 10,
                                            "created_utc": 1645104529.0,
                                            "response": "You basically just described why crypto has value 9/10",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "hxazqrn",
                                            "author": "discwrangler",
                                            "score": 2,
                                            "created_utc": 1645104511.0,
                                            "response": "Never smile, make millions.  I don't think I could do it.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "hxazkyp",
                            "author": "kittenconfidential",
                            "score": 9,
                            "created_utc": 1645104432.0,
                            "response": "he only wants to send money to the traffic blockers in ontario",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hxb7p6v",
                                    "author": "A-Ok88",
                                    "score": 3,
                                    "created_utc": 1645108185.0,
                                    "response": "Lol 100%",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "hxaswsh",
                            "author": "New_Dawn",
                            "score": -2,
                            "created_utc": 1645100792.0,
                            "response": "Maybe there's some psychology he can go into. Plus his audience is huge and they'll get some exposure through him.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hxau2kb",
                                    "author": "businessman99",
                                    "score": -2,
                                    "created_utc": 1645101474.0,
                                    "response": "It's religion for the masses",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hxb66cr",
                                            "author": "Vladimus44",
                                            "score": 3,
                                            "created_utc": 1645107518.0,
                                            "response": "Isn't religion always for the masses?",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "hxarlr1",
                            "author": "timbulance",
                            "score": -4,
                            "created_utc": 1645100002.0,
                            "response": "That’s pretty common ^ people learn about BTC everyday",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hxayslg",
                            "author": "knuF",
                            "score": -4,
                            "created_utc": 1645104038.0,
                            "response": "He probably understands it’s profound impact now.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hxaoz4u",
                    "author": "Deafboy_2v1",
                    "score": 510,
                    "created_utc": 1645098320.0,
                    "response": "Did we really need another proof that miami conference has nothing to do with Bitcoin?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hxaqru1",
                            "author": "Reywas3",
                            "score": 69,
                            "created_utc": 1645099483.0,
                            "response": "Truckers eh",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hxayw9x",
                                    "author": "dncoosnasvycicp",
                                    "score": 12,
                                    "created_utc": 1645104088.0,
                                    "response": "That would really really do it",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hxaplox",
                    "author": "DismalSpell",
                    "score": 874,
                    "created_utc": 1645098730.0,
                    "response": "Great, we've got Ted Cruz and Jordan Peterson. Next lets get Alex Jones on our side. Really try and get Bitcoin adopted by the most controversial people possible, that'll help convince everyone.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hxar1uf",
                            "author": "Krisbone",
                            "score": 335,
                            "created_utc": 1645099656.0,
                            "response": "Exactly. The more crackpots we add the more I think my family is right about crypto being a pump n dump I'll eventually lose everything I have invested in.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hxas111",
                                    "author": "ThoughtsObligations",
                                    "score": 211,
                                    "created_utc": 1645100263.0,
                                    "response": "Seriously. Not the team I want.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hxaujy0",
                                            "author": "Deafboy_2v1",
                                            "score": 28,
                                            "created_utc": 1645101757.0,
                                            "response": "Not the team we want, but the team we deserve!",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hxb93si",
                                                    "author": "520throwaway",
                                                    "score": 2,
                                                    "created_utc": 1645108796.0,
                                                    "response": "The fuck did we do to deserve THIS?!",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "hxbwoiq",
                                            "author": "BashCo",
                                            "score": -1,
                                            "created_utc": 1645117971.0,
                                            "response": "Luckily, you have no control over who uses bitcoin.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "hxauc1a",
                                    "author": "BastiatF",
                                    "score": 30,
                                    "created_utc": 1645101628.0,
                                    "response": "'Crypto' IS a pump n dump",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "hxbe7hg",
                                    "author": "Gracket_Material",
                                    "score": 5,
                                    "created_utc": 1645110900.0,
                                    "response": "Then leave now before the dump",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "hxbll09",
                                    "author": "lDrinkY0urMi1kshak3",
                                    "score": -4,
                                    "created_utc": 1645113791.0,
                                    "response": "You've obviously been on Reddit longer than you've been learning about Bitcoin.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "hxar7xn",
                            "author": "AutisticDalekOnSpeed",
                            "score": 55,
                            "created_utc": 1645099759.0,
                            "response": ">Next lets get Alex Jones\n\nhttps://news.bitcoin.com/alex-jones-lost-laptop-10000-bitcoins/",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hxbh3aj",
                                    "author": "CognitiveDissident7",
                                    "score": 21,
                                    "created_utc": 1645112056.0,
                                    "response": "Alex is one of the most prominent liars alive, I wouldn't put much stock in anything he says. He has had Max Keiser on for years though and Max offered to pay him in btc for an ad or something way back in the day and max makes fun of him now because if he had taken it the bitcoin would be worth tens of millions now.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "hxb8er1",
                                    "author": "kegman83",
                                    "score": 36,
                                    "created_utc": 1645108496.0,
                                    "response": "\"lost laptop\" and not \"hide my assets from Sandy hook families\". Alex must do a lot of boating.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hxbe5a0",
                                            "author": "Gracket_Material",
                                            "score": 2,
                                            "created_utc": 1645110874.0,
                                            "response": "Captain Hook never had a part time job",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "hxb91jh",
                            "author": "520throwaway",
                            "score": 7,
                            "created_utc": 1645108768.0,
                            "response": "But Crypto is turning frogs gay!!!1!",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hxblbyb",
                            "author": "lDrinkY0urMi1kshak3",
                            "score": 31,
                            "created_utc": 1645113694.0,
                            "response": "Bitcoin is for everyone. That includes your enemies, people you disagree with and blood thirsty murderers. Bitcoin is apolitical. Bitcoin doesn't need to convince everyone.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hxava6p",
                            "author": "ANTEEZOMAA",
                            "score": 14,
                            "created_utc": 1645102159.0,
                            "response": "Exactly this. EXACTLY THIS. Ugh.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hxb6k1e",
                            "author": "Vladimus44",
                            "score": 9,
                            "created_utc": 1645107688.0,
                            "response": "Bitcoin is for enemies, not friends.\n\nIt was always meant for that purpose. If you don't understand that Bitcoin's adoption necessarily means that people you don't like will use it extensively, then you've fundamentally misunderstood Bitcoin from the very beginning.\n\nUnderstand this, Bitcoin's success means **alot of people you dislike using it**.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hxb3gei",
                            "author": "ilikedevo",
                            "score": 32,
                            "created_utc": 1645106292.0,
                            "response": "Ive actually considered getting out of crypto because of this shit.  If it’s the new alt right currency they can keep it.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hxb6miy",
                                    "author": "TranscodedMusic",
                                    "score": 55,
                                    "created_utc": 1645107719.0,
                                    "response": "Absolutely — and this sub has turned into an astroturfing haven for alt right bullshit. It reeks of the Russian trolls that popped up all over Reddit hyping Trump in 2016.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hxbaide",
                                            "author": "Goat_Remix",
                                            "score": 26,
                                            "created_utc": 1645109383.0,
                                            "response": "Dude. I thought I was the only one who noticed it.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "hxbo2dg",
                                            "author": "ScarPersonal",
                                            "score": -10,
                                            "created_utc": 1645114743.0,
                                            "response": "Have you ever considered that maybe the left wings views have shifted to weirdo land and the subs has stayed where it’s always been?",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "hxbcfqe",
                                            "author": "Mjlikewhoa",
                                            "score": -2,
                                            "created_utc": 1645110180.0,
                                            "response": "In really surprised how many negative comments about jordan \"what would we do without men?!\" P In this sub. Bitcoin is here to stay. We don't need to shill every person that has joined the bitcoin space just cause it furthers use of bitcoin.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "hxbnwd1",
                                    "author": "ScarPersonal",
                                    "score": 30,
                                    "created_utc": 1645114678.0,
                                    "response": "Lmao. You are lost my friend. \n\nIf anything the fact that extreme left wing and right wing people are all posting here says bitcoin is decentralised and doing it’s job perfectly",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "hxb7ei1",
                                    "author": "MegaSuperSaiyan",
                                    "score": 2,
                                    "created_utc": 1645108056.0,
                                    "response": "Money for enemies",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "hxb3fhv",
                            "author": "DonOregano",
                            "score": 2,
                            "created_utc": 1645106281.0,
                            "response": "Yeah, and then we all cheer loudly when Putin, Erdogan and Khameini join too...",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hxay5vf",
                            "author": "PKMachinez",
                            "score": 3,
                            "created_utc": 1645103717.0,
                            "response": "Charles Hoskinson keeps talking about doing Rogan when the time is right.\nRemember, Rogan was having Andreas on long before a lot of people. A few times\nPetersons on Rogan a lot. Charles has been on Lex Friedman, as well as Vitalik. And Lex has been on Rogan a few times..\n\nAnd its all these circles of the 'Alt-Web' that slightly touch one another.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hxas0dl",
                            "author": "timbulance",
                            "score": 0,
                            "created_utc": 1645100252.0,
                            "response": "Bitcoin is controversial if you haven’t noticed.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hxayv26",
                            "author": "mysecondaccount420",
                            "score": 0,
                            "created_utc": 1645104072.0,
                            "response": "Yeah f that guy!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hxamups",
                    "author": "vanmarcel",
                    "score": 241,
                    "created_utc": 1645096768.0,
                    "response": "The minimum requirement to be allowed to speak at a Bitcoin conference should be that you run a full node.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hxaqfhk",
                            "author": "nnulll",
                            "score": 71,
                            "created_utc": 1645099267.0,
                            "response": "Yep. It’s like kickflips. If you can’t kickflip then you don’t actually skate.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hxaua0d",
                                    "author": "Asum_chum",
                                    "score": 15,
                                    "created_utc": 1645101596.0,
                                    "response": "Not fair.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hxbddu7",
                                            "author": "trlygnrly",
                                            "score": 30,
                                            "created_utc": 1645110565.0,
                                            "response": "Life ain't fair, kid. Now go practice those kickflips.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "hxb11ux",
                                    "author": "subvgchucker",
                                    "score": 2,
                                    "created_utc": 1645105155.0,
                                    "response": "Ouch, can't kickflip my longboard though.... Okay I have seen it done, maybe I'm just shit",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hxb4meo",
                                            "author": "nnulll",
                                            "score": 17,
                                            "created_utc": 1645106821.0,
                                            "response": "That’s ok. You’re not a skater… you longboard.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "hxaqcz6",
                            "author": "KnewAllTheWords",
                            "score": 30,
                            "created_utc": 1645099222.0,
                            "response": "And Peterson is running on half a node at best.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hxaxio3",
                    "author": "ChurchOfAtheism94",
                    "score": 398,
                    "created_utc": 1645103380.0,
                    "response": "Are we the baddies?\n\nEdit: thank you kind strangers",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hxazcw6",
                            "author": "afBeaver",
                            "score": 160,
                            "created_utc": 1645104319.0,
                            "response": "Yeah, my reaction too… if we get Ted Cruz, Tucker, and this guy, maybe we’re in the wrong camp… :/",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hxb4qpt",
                                    "author": "ChadBitcoiner",
                                    "score": 4,
                                    "created_utc": 1645106875.0,
                                    "response": "bitcoin is for enemies",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "hxb0zs0",
                                    "author": "Leathergoose8",
                                    "score": -25,
                                    "created_utc": 1645105128.0,
                                    "response": "Get out then, I’ll buy all your coins for cheap",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hxb7lm9",
                                            "author": "Fuzzy-Asshole",
                                            "score": 0,
                                            "created_utc": 1645108142.0,
                                            "response": "Vacuum up them sats.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "hxb4li1",
                            "author": "jugsofjupiter",
                            "score": 113,
                            "created_utc": 1645106809.0,
                            "response": "i fucking hate what the community has become and who associates with it",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hxb812m",
                                    "author": "Carboneraser",
                                    "score": 83,
                                    "created_utc": 1645108330.0,
                                    "response": "Its melting my brain as a Canadian when this sub started getting flooded with all sorts of Canadian political commentary...\n\nI hate to see that any group I'm apart of shares the idea that Trudeau is like Hitler and Canada is suffering from the tyranny to end all tyranny. And it's usually posted by Americans.\n\nPeople say it's good for Bitcoin, but the convoy will be a flash in the pan and all of it's participants will go back to being losers eventually, and all that will have been accomplished is a blemish on the use-case argument for Bitcoin.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hxbidjn",
                                            "author": "ReeceM86",
                                            "score": 52,
                                            "created_utc": 1645112561.0,
                                            "response": "Fellow Canadian, similar views. The association of Bitcoin and the convoy has alienated people that were previously getting curious about Bitcoin. It’s quite disheartening",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "hxbobre",
                                            "author": "ScarPersonal",
                                            "score": -12,
                                            "created_utc": 1645114841.0,
                                            "response": "The only thing melting your brain is that you have totally misunderstood what bitcoin is. \n\nSeparating money from state is the entire point of bitcoin. \n\nYour false god Trudeau is acting like a dictator and Peterson has tonnes more integrity than him.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "hxb6zzc",
                                    "author": "Vladimus44",
                                    "score": 16,
                                    "created_utc": 1645107881.0,
                                    "response": "Wtf are you talking about? \n\nBitcoin has essentially **ALWAYS** had shady pump and dumpers in the community. Literal felons who have fled the US government and gone onto create scam coins.\n\nWhy is everyone suddenly so shocked by this?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hxb7pau",
                                            "author": "jugsofjupiter",
                                            "score": 22,
                                            "created_utc": 1645108186.0,
                                            "response": "because suddenly the cesspit of outspoken, far right, conspiracy-loving populists have discovered bitcoin",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hxb8r30",
                                                    "author": "Vladimus44",
                                                    "score": 8,
                                                    "created_utc": 1645108643.0,
                                                    "response": "Wrong again.\n\nYou **really** haven't been paying attention.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "hxayksc",
                            "author": "LouRG3",
                            "score": 8,
                            "created_utc": 1645103930.0,
                            "response": "Yes.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hxb5vpu",
                            "author": "TheUnstoppableBTC",
                            "score": 1,
                            "created_utc": 1645107385.0,
                            "response": "A decentralised, secure, democratic, reliably hard asset with the same rules applying to everyone, to provide financial sovereignty and independence to all. If that constitutes evil i'm not sure what level of reality i'm supposed to be operating on.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hxb6s9e",
                                    "author": "Skinoob38",
                                    "score": -3,
                                    "created_utc": 1645107789.0,
                                    "response": "> with the same rules applying to everyone,\n\nWhy are there so many forks then?\n\nhttps://forkdrop.io/how-many-bitcoin-forks-are-there",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hxb7frt",
                                            "author": "TheUnstoppableBTC",
                                            "score": 9,
                                            "created_utc": 1645108072.0,
                                            "response": "Forks, in other words, not bitcoin.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hxb7m6z",
                    "author": "bundleogrundle",
                    "score": 18,
                    "created_utc": 1645108148.0,
                    "response": "Clean your house and make your bed before you buy your bitcoin",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hxaqfel",
                    "author": "gzben",
                    "score": 191,
                    "created_utc": 1645099266.0,
                    "response": "JP doesn’t know fuck all about Bitcoin. I’ve watched a few of his interviews with Bitcoin ‘gurus’ on YouTube. He was talking about how he’s recently become interested in the Austrian school of economics and all the rest of it. He speaks like he’s an authority on subjects he’s really not very well qualified to speak publicly about. Climate change, economics…",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hxax0wu",
                            "author": "thefronk",
                            "score": 58,
                            "created_utc": 1645103122.0,
                            "response": "Jordan “Climate is everything” Peterson lmao.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hxay9ye",
                                    "author": "Friendly_Crab",
                                    "score": 62,
                                    "created_utc": 1645103776.0,
                                    "response": "Honestly he talks meaningless shit most of the time but uses complicated language to make it sound impressive and authoritative, and he mostly gets away with it",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hxb2ypw",
                                            "author": "emptysoul365",
                                            "score": 41,
                                            "created_utc": 1645106064.0,
                                            "response": "Dumb people think he's intelligent.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "hxb2tkc",
                                            "author": "vegancryptolord",
                                            "score": 20,
                                            "created_utc": 1645105998.0,
                                            "response": "Not going to lie. That sounds exactly like almost all the big BTC personalities and posts in this sub.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hxaovn6",
                    "author": "ArtFewl",
                    "score": 132,
                    "created_utc": 1645098252.0,
                    "response": "Eww",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hxb46sr",
                    "author": "HenryHenderson",
                    "score": 10,
                    "created_utc": 1645106627.0,
                    "response": "That night every Miami hotel room will be extremely tidy and clean.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hxapny4",
                    "author": "Maca_Najeznica",
                    "score": 127,
                    "created_utc": 1645098770.0,
                    "response": "Central to this bonehead's theory is the notion that present power dynamics are somehow good and natural, how is that compatible with the idea that Bitcoin is revolutionary technology? This unhealthy clown is overrated as fuck.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hxb4dq0",
                            "author": "uselessartist",
                            "score": 13,
                            "created_utc": 1645106712.0,
                            "response": "There’s a venn diagram somewhere with libertarianism in it.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hxaqsnp",
                            "author": "Reywas3",
                            "score": 8,
                            "created_utc": 1645099497.0,
                            "response": "Yea dude",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hxar575",
                            "author": "watabotdawookies",
                            "score": -20,
                            "created_utc": 1645099712.0,
                            "response": "Since he, along with most conservative leaning people are most worried about Goverment power and tyranny your point is pretty silly. Conservatives are pretty pro-bitcoin from what I've seen.\n\nHe also didn't say that present power dynamics are good, but that its the best that we've got.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hxatyr1",
                                    "author": "SortaSticky",
                                    "score": 21,
                                    "created_utc": 1645101410.0,
                                    "response": "You've made a compelling case via your mishmash of logical fallacies and obviously false assertions that Jordan Peterson and Turd Cruz and all the rest of the rightwing grifter bitcoin bandwagoners do indeed have an audience among some crypto enthusiasts. We can put JP in the geek tent where he can bite the heads off chickens while he tells us \"this is the best it gets plz donate.\"",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hxaunav",
                                            "author": "watabotdawookies",
                                            "score": -5,
                                            "created_utc": 1645101809.0,
                                            "response": "Did you put some words into a word scrambler and press send?\n\nPlease tell me what part was a logical fallacy? Your comment is just a bunch of assertions and weird shit tbh.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hxb6ive",
                                                    "author": "octaw",
                                                    "score": 4,
                                                    "created_utc": 1645107673.0,
                                                    "response": "Gonna step in here with you and say yes the guy you responded to is low iq",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hxapkvs",
                    "author": "OwieMustDie",
                    "score": 123,
                    "created_utc": 1645098715.0,
                    "response": "That's a shame.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hxar8f8",
                            "author": "timbulance",
                            "score": -23,
                            "created_utc": 1645099769.0,
                            "response": "Why’s that a shame ?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hxaonz2",
                    "author": "food_dudes_",
                    "score": 160,
                    "created_utc": 1645098105.0,
                    "response": "Fuck this guy",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hxb6o62",
                            "author": "NobgasNeon",
                            "score": 12,
                            "created_utc": 1645107739.0,
                            "response": "Why?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hxb9m58",
                                    "author": "hekali",
                                    "score": -5,
                                    "created_utc": 1645109011.0,
                                    "response": "“Jordan Peterson is also a right-wing internet celebrity who has claimed that feminists have “an unconscious wish for brutal male domination,” referred to developing nations as “pits of catastrophe” in a speech to a Dutch far-right group, and recently told a Times reporter that he supported “enforced monogamy.”” Amongst a million other things which you can look up yourself. \n\nHe’s also off his tits on benzos. Which is fine. But if you’re an “academic” it’s slightly problematic if I’m to trust a single thing he says.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hxawzv0",
                    "author": "MrRGnome",
                    "score": 68,
                    "created_utc": 1645103105.0,
                    "response": "Is this that absurd miami shit show again? Fuck this harmful conference and the people enabling it.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hxb3rhw",
                            "author": "Sluttystockbroker11",
                            "score": 13,
                            "created_utc": 1645106432.0,
                            "response": "It’s no longer about bitcoin.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hxamopj",
                    "author": "jesschester",
                    "score": 90,
                    "created_utc": 1645096641.0,
                    "response": "Found it impossible to listen to this guy talk when he went on Rogan the other day.  Couldn’t get a point across to save his life. “We just don’t know man.. there’s too much we don’t know” was all he kept saying",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hxao4ec",
                            "author": "Xpertbasterd",
                            "score": 46,
                            "created_utc": 1645097709.0,
                            "response": "Yep it was 4 hours of words but nothing was actually said",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hxblmel",
                                    "author": "VLHACS",
                                    "score": 16,
                                    "created_utc": 1645113806.0,
                                    "response": "Let's you unconsciously fill in the blanks with your own biased conclusions, and you end up thinking he's a genius.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hxb656n",
                    "author": "MandoBandano",
                    "score": 6,
                    "created_utc": 1645107504.0,
                    "response": "Haa what a bunch of clowns.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hxamgjz",
                    "author": "Teleporter55",
                    "score": 84,
                    "created_utc": 1645096468.0,
                    "response": "He used to be pretty interesting guy but the last few years his medical shit has clearly effected his persona",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hxantxw",
                            "author": "littleday",
                            "score": 128,
                            "created_utc": 1645097504.0,
                            "response": "And his ability to get facts right. His last podcast with Rogan, he got more shit wrong than right. He’s lost a lot of credibility.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hxb0ekv",
                                    "author": "erez27",
                                    "score": 9,
                                    "created_utc": 1645104842.0,
                                    "response": "I didn't watch the last one. What kind of stuff did he get wrong?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hxb5b2g",
                                            "author": "littleday",
                                            "score": 28,
                                            "created_utc": 1645107129.0,
                                            "response": "Well one for example was the part where he was talking about a sustainable fishing alternative and he was talking about how it was gonna change the world and give every one fish. Then the next day Rogan literally had a chick on who actually knew this report inside out and works in the industry and she basically went through how that report got retracted ages ago due to the report essentially being funded by the fishing lobby. \n\nNow I know that doesn’t seem so huge, but the guy spits so much data out, that if he didn’t bother to check that story or even do a basic google to try prove his point wrong, which everyone should do. Then I start to really question everything else he says. And that’s a good thing. \n\nI love rogans podcasts but anything super awesome and interesting that’s talked about I then go an google the shit out of it to make sure I’m not spitting non truths. And Peterson should be doing the same with his large reach.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hxbbwh2",
                                                    "author": "erez27",
                                                    "score": 4,
                                                    "created_utc": 1645109958.0,
                                                    "response": "Dunno about the specific example you gave, but I agree with everything you said. (re doubting & googling)\n\nTbh, I'm not sure he's good at much beyond being a psychologist and social scientist. But I find him really interesting within those domains.\n\nedit: lol downvoted for what",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "hxbmtbm",
                                                    "author": "Romytens",
                                                    "score": 1,
                                                    "created_utc": 1645114263.0,
                                                    "response": "I listened to that one too, JP was in full verbal flow to put it nicely. \n\nI think he takes in SO much information that he has little time to sort it out. I wish my brain was like that. \n\nWhat you mentioned is what’s great about podcasts in general. Not only can they go as long as they want saying anything they want, but you can have someone with another view or a subject matter expert on another show to share counter points. \n\nJR does a great job of listening and keeping his opinions to himself so the guest will share more. He says he’s going to bring more counter arguments from different guests in the future so hopefully he follows through on that. His platform is so big he has an opportunity to get a lot of voices heard and clearly doesn’t give a fuck about the backlash.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "hxar3vr",
                            "author": "Malakay_sun",
                            "score": 109,
                            "created_utc": 1645099690.0,
                            "response": "As a public person, he claims to know how to live well, or at least is known as someone who researches this subject matter.\n\nHe does not strike me as someone who lives well, or would know how. He does not come across as a happy person, or someone who is satisfied by his creative works. He argues about everything. He constructs overly intellectual narratives which, knowingly or unknowingly, allow him to have pretty much any arbitrary stance on a subject, as long as his reasons and arguments go deep enough so no appropriate length or depth of discussion can ever stand up to it.\n\nOf all the people in the world, there are some who are intelligent enough to realize that you can argue any point indefinitely. And then there are a few who also realize that this is not constructive or compassionate. You want to learn from those few rather than the some.\n\nIn every video clip of him he engages in populist debate subjects with the full force of an academic. That is like me arm wrestling my two year old niece. I am going to win, but that does not make me a good arm wrestler.\n\nHis attitude is scientismic rather than scientific or rational. His demeanor is labored. To me, he is not someone who has understood or mastered what it means to be human, or how to live a good life, yet his public perception or presentation implies that.\n\nEdit: typos",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hxb14hi",
                            "author": "Tannz0rz",
                            "score": 11,
                            "created_utc": 1645105190.0,
                            "response": "He was never interesting.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hxayepf",
                            "author": "raylgive",
                            "score": 3,
                            "created_utc": 1645103844.0,
                            "response": "I no longer listen to him but visits his old lectures time to time.\n\nI don't think he will add any value to the bit coin conference.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hxanh09",
                            "author": "iCryptToo",
                            "score": 1,
                            "created_utc": 1645097236.0,
                            "response": "Yeah, nobody can really withstand all the shit he’s been though. It’s gonna change you.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hxb8grf",
                                    "author": "Carboneraser",
                                    "score": 5,
                                    "created_utc": 1645108519.0,
                                    "response": "I wouldn't be able to withstand telling drug addicts for years that our addiction is our fault, and that we need to take personal responsibility for ourselves (like him) to avoid it, treat it, or prevent it. Sort of fair, except that he's literally a benzo addict who was too scared of withdrawals that he flew to Russia to be put in a coma. Then got back on benzos anyways.\n\nAlso, his room is a fucking mess.\n\nDo as he says, not as he does. Or, just ignore the dickwad.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "hxamyht",
                            "author": "-send_me_bitcoin-",
                            "score": -14,
                            "created_utc": 1645096845.0,
                            "response": "That's as well as I've heard it put. A genius and great motivational speaker before his head broke and/or realized how easy grifting is.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hxanp6n",
                            "author": "dreganxix",
                            "score": 0,
                            "created_utc": 1645097404.0,
                            "response": "yup!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hxb3nqt",
                    "author": "cryptocongress",
                    "score": 5,
                    "created_utc": 1645106385.0,
                    "response": "BOOM!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hxb6pja",
                    "author": "pink_raya",
                    "score": 6,
                    "created_utc": 1645107755.0,
                    "response": "did Elon say no?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hxb4pvs",
                    "author": "WhiteHawk570",
                    "score": 40,
                    "created_utc": 1645106864.0,
                    "response": "I understand that Peterson does not appeal to everyone. I understand that he has a cult following. I also understand that he may not be the most qualified to talk about either Bitcoin or climate change.\n\nBut why are so many people in this thread being so unbelievably vile towards him as a person? Why would you bring up his family life, addiction and suffering as a means to simply conjure the most ill-intended and malevolent ways to discredit his humanity?\n\nI am not even a fan, but this thread is merely a disgusting echo chamber. You should be ashamed of yourselves.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hxb9n6k",
                            "author": "TargetJams",
                            "score": 34,
                            "created_utc": 1645109023.0,
                            "response": "What you're describing is basically just reddit.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hxbd9gf",
                                    "author": "WhiteHawk570",
                                    "score": 11,
                                    "created_utc": 1645110516.0,
                                    "response": "It is a large portion of reddit, but most of the subreddits I am subscribed to aren't anything like what I've seen here. \n\nI guess my naivete got the better of me. Of course I shouldn't expect anything else, especially when it comes to ideologically laden topics such as this. It's just simple tribalism.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hxbhnyy",
                                            "author": "TargetJams",
                                            "score": 6,
                                            "created_utc": 1645112284.0,
                                            "response": "What's indicative of why you're right is that we're both being downvoted despite neither of us saying anything positive about the man's ideas or public statements.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "hxcawbn",
                            "author": "BashCo",
                            "score": 8,
                            "created_utc": 1645123218.0,
                            "response": "Reddit has been overwhelmed by authoritarian fascists whose primary tool is to censor and slander anyone who contradicts their failed ideology. This thread in particular probably triggered some alerts in off-site brigade groups based on the name in the headline.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hxaubyu",
                    "author": "umbrtheinfluence",
                    "score": 22,
                    "created_utc": 1645101627.0,
                    "response": "god damnit, whos idea was this",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hxbd4aq",
                    "author": "lib3rty47",
                    "score": 33,
                    "created_utc": 1645110456.0,
                    "response": "Unpopular opinion: Good. Let him speak. Bitcoin is free speech. We cant choose who dislikes or likes bitcoin or how they view it based on your personal preference on who the type of person should be. That's the point of a uncensored permissionless tool. You can't have it both ways.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hxbsnxk",
                            "author": "ChuckyBravo",
                            "score": 22,
                            "created_utc": 1645116472.0,
                            "response": "This is the only sane comment in this entire thread. Everyone else is triggered and freaking out, acting like this will ruin Bitcoin somehow. Bitcoin doesn't care about JP or the people whining about JP. It is money for everybody, no matter someones views or political leanings. It also doesn't care about how long you've been a Bitcoiner.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hxblta7",
                    "author": "lDrinkY0urMi1kshak3",
                    "score": 4,
                    "created_utc": 1645113879.0,
                    "response": "This comment section lol",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hxas4z4",
                    "author": "Deafboy_2v1",
                    "score": 13,
                    "created_utc": 1645100328.0,
                    "response": "On the [list of speakers](https://b.tc/conference/speakers), Adam Back is 10th, Roasbeef 22nd, Stick 47th. We're all here today thanks to their work, yet the headliners are just parasites leeching off of their success.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hxb0pp1",
                    "author": "Baker198t",
                    "score": 7,
                    "created_utc": 1645104991.0,
                    "response": "Good fucking lord… why?!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hxb7i0u",
                    "author": "DubWubber",
                    "score": 14,
                    "created_utc": 1645108099.0,
                    "response": "So much hate lol, Bitcoin is for everybody, even for those you politically don't agree with",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hxb9uhl",
                    "author": "giszmo",
                    "score": 19,
                    "created_utc": 1645109108.0,
                    "response": "So after reading about 400 top comments ... this thread is getting heavily brigaded by JBP haters. They all know more about JBP than about Bitcoin.\n\nI know none of the haters from prior interactions and RES would tell me.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hxbb9co",
                            "author": "pjb4466",
                            "score": -3,
                            "created_utc": 1645109689.0,
                            "response": "Bro you can make the same comment over and over but the illusion that many people agree only works when we can’t see your username on every post.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hxbdang",
                                    "author": "giszmo",
                                    "score": 9,
                                    "created_utc": 1645110530.0,
                                    "response": "I wrote the same as a reply twice and now as a top comment, too. So what? You have not commented in r/bitcoin in the last 5 months but somehow now care to shit on JBP.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hxbds7e",
                                            "author": "pjb4466",
                                            "score": 4,
                                            "created_utc": 1645110726.0,
                                            "response": "I read comments for five minutes and ran into you complaining of “brigading” multiple times. \n\nNo, I don’t post here much at all. What does that matter? Lurkers can’t have an opinion because they usually have nothing to add? Stupid argument.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hxb06np",
                    "author": "Infrared_01",
                    "score": 14,
                    "created_utc": 1645104733.0,
                    "response": "Not saying he has anything to do with BTC and should be there, but what's with the extra vitriolic hatred?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hxb38hz",
                            "author": "Imaginary-Friendship",
                            "score": 11,
                            "created_utc": 1645106189.0,
                            "response": "My guess is because Reddit is filled with lots of folks that align with the left politically and JP aligns with the right.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hxb5lur",
                                    "author": "giszmo",
                                    "score": 0,
                                    "created_utc": 1645107262.0,
                                    "response": "This thread here feels not like r/bitcoin at all. I'm speechless. Is it all bots? Yes, wokeism dominates r/worldnews and many other subs but r/bitcoin? Really? Is it that bad or is it bots?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hxbmp66",
                                            "author": "_scampy",
                                            "score": 4,
                                            "created_utc": 1645114218.0,
                                            "response": "Over the last month or so I've noticed a definite uptick in what I assume are bots in this sub. The funny thing about them is that what they post is completely harmless and generally just one-liner gibberish. I have no idea what their agenda is.\n\nMany of the posts I see in *this* vitriolic thread are sophisticated enough to be human. I'm guessing the recent bull-run drew in a lot of newcomers who are more concerned with the price action than anything else, and don't appreciate the part where Bitcoin is an open-source protocol that can be adopted by friend and foe alike.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hxbuye6",
                                                    "author": "giszmo",
                                                    "score": 7,
                                                    "created_utc": 1645117325.0,
                                                    "response": "\"Bitcoin is for enemies\"\n\nYeah, I noticed the one-word or at top one-line comments, too. Soo many of them. I think the point is to drown the comment section so that legit users can't coordinate. If you have to scroll through 500 comments from 490 bots that all up-vote each other and down-vote everything else, it gets hard to let legit comments bubble to the top even if in the end some 500 legit users join the conversation. Most will not find the hidden gems, not reading beyond the top 100 comments.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hxawu92",
                    "author": "european_hodler",
                    "score": 16,
                    "created_utc": 1645103017.0,
                    "response": "not a fan",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hxbb0g4",
                    "author": "pjb4466",
                    "score": 6,
                    "created_utc": 1645109587.0,
                    "response": "The more right wing grifters that flock to Bitcoin the more worried I become that it’s being primed as a scam. Having some populist douche who learned only recently what Bitcoin is get up and talk about it is not the way to quicker adoption.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hxb8572",
                    "author": "epapi169",
                    "score": 16,
                    "created_utc": 1645108381.0,
                    "response": "Why is JP getting so much hate. Has anyone actually listened to his psychology classes? This man is intelligent and can express himself well. \n\nPeople mentions he uses grand words to confuse individuals but it’s just how he communicates. He does the same in his psychology classes. \n\nIn regards to bitcoin, and my earlier point about his ability to speak well, this may be a good thing.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hxbjfzy",
                            "author": "wackyasshole",
                            "score": 16,
                            "created_utc": 1645112970.0,
                            "response": "Yeah I also thought Bitcoiners where smarter than this. I see a lot of just straight up hate here.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hxcn7rn",
                                    "author": "BashCo",
                                    "score": 17,
                                    "created_utc": 1645127823.0,
                                    "response": "Most of the accounts here aren't Bitcoiners. They have virtually no evidence of participation in this subreddit prior to the recent political turmoil involving government censorship and oppression. The name in the headline probably triggered some off-site brigade groups who are attempting to censor people they disagree with, a common tactic among authoritarian fascists.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hxayolj",
                    "author": "username802",
                    "score": 15,
                    "created_utc": 1645103983.0,
                    "response": "This guy is a dipshit.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hxapk7i",
                    "author": "dies_und_dass",
                    "score": 9,
                    "created_utc": 1645098703.0,
                    "response": "If anything he should be attending as an audience member. My dog probably knowns more about Bitcoin than him (notwithstanding his interesting views elsewhere)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hxax44f",
                    "author": "BigPlayCrypto",
                    "score": 6,
                    "created_utc": 1645103171.0,
                    "response": "Who???",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hxauutd",
                    "author": "TheRevvX",
                    "score": 16,
                    "created_utc": 1645101927.0,
                    "response": "It's funny to me how much people hate Jordan Peterson. Reading his works has truly helped me pull myself out of my depression and anxiety, and the ways of life I've learned through him are irreplaceable. Sucks that he has such a bad reputation because of people simply putting words in his mouth",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hxayv2z",
                            "author": "Phoenix2683",
                            "score": 13,
                            "created_utc": 1645104072.0,
                            "response": "That's awesome but what does it have to do with Bitcoin",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hxb3jk8",
                                    "author": "TheRevvX",
                                    "score": -1,
                                    "created_utc": 1645106333.0,
                                    "response": "Nothing. Just hate to see JP being hated for being an \"alt-right\" when that is FAR from the truth",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hxb5xbl",
                                            "author": "Phoenix2683",
                                            "score": 1,
                                            "created_utc": 1645107404.0,
                                            "response": "To me it just feels more like a cultural or political choice than someone who can educate or speak on Bitcoin",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "hxazbtv",
                            "author": "norfbayboy",
                            "score": 5,
                            "created_utc": 1645104304.0,
                            "response": "We don't need another Bitcoin newb lecturing to other newbs, and certainly not to bitcoiners who have been driving this movement for years.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hxb3nsv",
                                    "author": "TheRevvX",
                                    "score": 1,
                                    "created_utc": 1645106386.0,
                                    "response": "People like you are what stops newcomers from being comfortable with cryptocurrency. Accept new people, appreciate their naivety, and educate them. This is how widespread adoption is achieved.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hxb9l64",
                                            "author": "norfbayboy",
                                            "score": 5,
                                            "created_utc": 1645109000.0,
                                            "response": "I do accept new people, appreciate their naivety, and educate them. Which is why I care that someone new to Bitcoin, who was not paying attention to it for the last decade, is intending to lecturing about Bitcoin to people who are new to Bitcoin, as well as people who know more about Bitcoin than he does. I've been around long enough to recognize people who \"just heard about Bitcoin and they are here to fix it\" for us.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "hxb5lv1",
                            "author": "benaffleckisaokactor",
                            "score": -1,
                            "created_utc": 1645107263.0,
                            "response": "This feels like a caricature of every single Peterson defender ever. Needless to say, just because he taught you that you indeed needed to wipe your ass everyday before setting out doesn’t make him an expert in philosophy or on politics, and certainly not on blockchain",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hxbdmf0",
                                    "author": "New_Dawn",
                                    "score": 1,
                                    "created_utc": 1645110661.0,
                                    "response": "Yeah? and what makes *you* so special? I'm already hearing crickets...",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "hxawd48",
                            "author": "New_Dawn",
                            "score": -8,
                            "created_utc": 1645102752.0,
                            "response": "It's because the mob is here to cancel him. They came here to create the illusion that everyone hates him or he's somehow bad.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hxayjz3",
                            "author": "Pumping_Grumpy",
                            "score": -1,
                            "created_utc": 1645103919.0,
                            "response": "Is this not the most important post in this thread.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hxb3gh8",
                                    "author": "TheRevvX",
                                    "score": 1,
                                    "created_utc": 1645106293.0,
                                    "response": "No? It's not important or significant really. If I had to assume, JP will probably discuss the fundamentals of cryptocurrency and what type of precedents that sets. I don't think it's particularly important though",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "hxax40q",
                            "author": "S1imSkit",
                            "score": -3,
                            "created_utc": 1645103170.0,
                            "response": "It's sad really",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hxaqltt",
                    "author": "wackyasshole",
                    "score": 7,
                    "created_utc": 1645099378.0,
                    "response": "So much salt here in the comments. Remember folks Bitcoin is for everyone. \n\nJP has a huge following. That is a plus positive. \n\nThere are people who can’t stand Saylor as well but he is a plus positive to Bitcoin.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hxaz75v",
                            "author": "aleksanderlias",
                            "score": 7,
                            "created_utc": 1645104240.0,
                            "response": "I get what you’re saying but there is huge business in talking… he’s getting paid big bucks to be there. He’s being invested in. There are so many great people that could have spoken that are not him.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hxayxxz",
                            "author": "ojedaforpresident",
                            "score": 6,
                            "created_utc": 1645104112.0,
                            "response": "Imagine comparing Saylor to Peterson in this context. One is an investor with a vision who is honest about his intentions, who lives, breathes and reeks of BTC, the other knows nothing about BTC. \n\nThis shit reeks of Peter Thiel.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hxb1gfe",
                    "author": "ask_for_pgp",
                    "score": 5,
                    "created_utc": 1645105352.0,
                    "response": "one reason not to go. can't stand the guy",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hxaxsky",
                    "author": "TradeBitter",
                    "score": 3,
                    "created_utc": 1645103525.0,
                    "response": "Bitcoin is for everyone. Everyone being the key word.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hxb0bg6",
                            "author": "aleksanderlias",
                            "score": 1,
                            "created_utc": 1645104799.0,
                            "response": "The stage for speakers is not, for everyone.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hxb2baz",
                                    "author": "TradeBitter",
                                    "score": 4,
                                    "created_utc": 1645105760.0,
                                    "response": "You're right but Bitcoin will rat out the ones who it doesn't favor.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hxb856p",
                                            "author": "ILikePracticalGifts",
                                            "score": 5,
                                            "created_utc": 1645108381.0,
                                            "response": "What tf does that even mean? 🤣",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hxatqzu",
                    "author": "Pumping_Grumpy",
                    "score": 4,
                    "created_utc": 1645101290.0,
                    "response": "Bitcoin: The Future of Money is one of the best Philosophical discussions of Bitcoin you will ever hear. Most here seem to think that if you are not an expert on the “Mechanics” of Bitcoin and digital information, then you have no place in the discussion. Most of us don’t give two shits for how it works, we just want to know how it will affect our lives. I would say that the sociology of Bitcoin and how that impacts our relationship with stores of value is of much greater relevance to mass adoption. Jordan Peterson is as eloquent a thinker and speaker as anyone they might find to disseminate the deeper meaning of Bitcoin. Not to mention that the 2022 Bitcoin conference just gained a Much larger audience.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hxavcmg",
                            "author": "runningactor",
                            "score": 0,
                            "created_utc": 1645102195.0,
                            "response": "I mean that would be great if he would stick to his profession and background when he talks but he has recently become an expert on whatever he feels like talking about he seems to think",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hxb57f2",
                    "author": "ridnovir",
                    "score": 3,
                    "created_utc": 1645107084.0,
                    "response": "Mr. Peterson although new to crypto will sure have some well thought through insights in the blockchain tech and its potential\n\nBTW non of the shitposter woksters on this subreddit are going to be speakers or meaningful contributors to any btcoin conference",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hxb2m77",
                    "author": "Barbie_and_KenM",
                    "score": 3,
                    "created_utc": 1645105900.0,
                    "response": "Wow this is a bad look for bitcoin. I went to the conference a few years ago. I would never pay for a ticket to see this nutjob speak.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hxb5cwi",
                    "author": "breakfastatsniffanys",
                    "score": 3,
                    "created_utc": 1645107152.0,
                    "response": "What does he know about bitcoins",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hxcmohw",
                            "author": "BashCo",
                            "score": 0,
                            "created_utc": 1645127617.0,
                            "response": "What do *you* know, astroturfer?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hxayr3v",
                    "author": "PtansSquall",
                    "score": 3,
                    "created_utc": 1645104017.0,
                    "response": "He's a grifting piece of garbage, I don't want him and his awful reputation anywhere near this...",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hxb6gw4",
                    "author": "Kinojitsu",
                    "score": 2,
                    "created_utc": 1645107649.0,
                    "response": "Now that's a certified lobster moment.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hxaw159",
                    "author": "Huge_Yak6380",
                    "score": 3,
                    "created_utc": 1645102568.0,
                    "response": "Ew",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hxaw1ei",
                    "author": "mortonifi",
                    "score": 2,
                    "created_utc": 1645102572.0,
                    "response": "Bitcoin is ours keep these self serving attention seeking freaks away from it",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hxb1kn9",
                    "author": "deepstatelady",
                    "score": 2,
                    "created_utc": 1645105409.0,
                    "response": "Ugh. This absolute hack is not going to help Bitcoin's image at all.\nHe's the idiot's version of an intellectual.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hxaxytw",
                    "author": "hiero_",
                    "score": 2,
                    "created_utc": 1645103615.0,
                    "response": "Yeah, if I ever needed a sign to stop hodling, I think this is it",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hxaycp0",
                    "author": "PhilipWulfsberg",
                    "score": 1,
                    "created_utc": 1645103815.0,
                    "response": "I mean just beacuse he uses fancy words does not mean he is an expert in every field. Go watch him talk about climate change prediction on Joe Rogans podcast, they share 1 brain cell",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hxb1j0g",
                    "author": "Fraeyaoriginalbest",
                    "score": 4,
                    "created_utc": 1645105387.0,
                    "response": "I'm so glad all the comments are about how this is a terrible idea.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hxazsak",
                    "author": "publicman13",
                    "score": 3,
                    "created_utc": 1645104533.0,
                    "response": "This is not the good news you think it is OP",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hxb0kd8",
                    "author": "Grabow",
                    "score": 1,
                    "created_utc": 1645104920.0,
                    "response": "Hmmm, should be interesting to hear what he has to say on the matter. Loved his description of the \"Bible\" on JRE.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hxb1l2j",
                    "author": "Bombdizzle1",
                    "score": 1,
                    "created_utc": 1645105415.0,
                    "response": "I don't remember bitcoin being mentioned in the bible?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hxba8ab",
                    "author": "bquintb",
                    "score": 3,
                    "created_utc": 1645109268.0,
                    "response": "I appreciate the guy for his psychology expertise and how he gets young, 20-year-old men to stop being losers and straighten up their damn rooms. (probably explains most of the hate here)\n\n But I don't understand what he has to do with bitcoin, didn't he find out about it just like last week? If he wants to be in the crowd, that's fine, but I don't think he should be leading anything. Either way I'm staying away from Florida.... that's how you end up a Florida Man.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hxas0ps",
                    "author": "RadicalFarCenter",
                    "score": 0,
                    "created_utc": 1645100258.0,
                    "response": "Clean up your keys",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hxb1git",
                    "author": "ianyboo",
                    "score": 2,
                    "created_utc": 1645105353.0,
                    "response": "Oh great, maybe Deepak Chopra and Ken Ham can open for him.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hxazw4e",
                    "author": "randompittuser",
                    "score": 1,
                    "created_utc": 1645104586.0,
                    "response": "Ugh why\n\nEDIT: This makes me seriously doubt the leadership at the \"Bitcoin Conference\".",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hxatjcb",
                    "author": "jeywgosjeb",
                    "score": -1,
                    "created_utc": 1645101166.0,
                    "response": "Might have something to say about the psychological side of money and history dudes prett smart. \n\nI’ll listen",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hxb133v",
                    "author": "Cypher91",
                    "score": 0,
                    "created_utc": 1645105172.0,
                    "response": "Jordan Peterson's greatest quality is as a salesman. He has this ability to talk with authority on subjects he is not qualified to speak on. He has a large following which the organisers are probably hoping will follow his advice on buying bitcoin etc.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hxbvhz0",
                    "author": "brantvogt",
                    "score": -1,
                    "created_utc": 1645117525.0,
                    "response": "Lol to all the useful idiots crying about this speaker on this dumpster fire of an app - if you're so mad, please sell your coins. I'll be happy to take them off of you.\n\nCry harder",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hxalp0q",
                    "author": "PapaRacoon",
                    "score": -2,
                    "created_utc": 1645095878.0,
                    "response": "Haha",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hxazy40",
                    "author": "Potential-Designer42",
                    "score": 3,
                    "created_utc": 1645104613.0,
                    "response": "Quack",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hxbwlz4",
                    "author": "Funkywurm",
                    "score": 0,
                    "created_utc": 1645117945.0,
                    "response": "🤮",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hxasdie",
                    "author": "Temerity2",
                    "score": -11,
                    "created_utc": 1645100471.0,
                    "response": "Laughing my ass off at these comments. What a knee jerk reaction. Will be interesting to see what angle he takes. He's a very smart guy with a lot of interesting perspectives.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hxavkgp",
                            "author": "vember_94",
                            "score": 1,
                            "created_utc": 1645102314.0,
                            "response": "He’s absolutely a smart guy, but his takes on pretty much everything outside of psychology are preposterously bad and often outright false.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hxb4esn",
                                    "author": "Temerity2",
                                    "score": 3,
                                    "created_utc": 1645106726.0,
                                    "response": "Like what?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hxbawo0",
                                            "author": "FFpain",
                                            "score": 8,
                                            "created_utc": 1645109544.0,
                                            "response": "Every time someone bashes jp I ask for examples and they never give any or they put words in his mouth that he did not say.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "hxb19yz",
                            "author": "better_off_red",
                            "score": -2,
                            "created_utc": 1645105263.0,
                            "response": "bUt hE’S A grIfTeR!!!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hxaz470",
                    "author": "knuF",
                    "score": -2,
                    "created_utc": 1645104199.0,
                    "response": "Lol so much hate. I’m interested in what he’ll say. Sure he might not know the details, but if he’s going to speak he’s obviously thought about the profound implications which I’ll be interested to hear.\n\nAnd if this sub represents Bitcoin (does it?) then he’ll get booed off stage.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hxb7345",
                    "author": "nik_tha_greek",
                    "score": 0,
                    "created_utc": 1645107919.0,
                    "response": "Didn't know what to expect when I opened up the comments, but I'm pretty pleased to see the overwhelming disgust on this sub about this announcement. \n\n&#x200B;\n\nThis guy is a moron and everyone at the conference will be dumber having heard him speak. Also, and most importantly, he doesn't know shit about Bitcoin.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hxb32u4",
                    "author": "yeho_meta",
                    "score": -4,
                    "created_utc": 1645106117.0,
                    "response": "I don't understand why so many people here hate everything \"related\" to the conservative sphere when you see how the liberal / leftist are all about control and will obviously be the firsts to willing to ban Bitcoin use (see Trudeau in Canada for example...)",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hxb8hp0",
                            "author": "giszmo",
                            "score": 4,
                            "created_utc": 1645108531.0,
                            "response": "Totally agree! All bots or this post got brigaded by some JBP haters. Most hate commenters appear to know more about JBP than about Bitcoin.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hxau8qk",
                    "author": "Unnormally2",
                    "score": -5,
                    "created_utc": 1645101576.0,
                    "response": "I like JP :(  A little saddened to see the general dislike (to downright hatred) in the comments here.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hxb0ep1",
                            "author": "_scampy",
                            "score": 2,
                            "created_utc": 1645104844.0,
                            "response": "You're not alone. I'm a fan of his too and am pleasantly surprised about this announcement. [Saifedean must have really left an impression](https://www.youtube.com/watch?v=FXvQcuIb5rU).\n\nI find it helps to not take Reddit too seriously. It's an excellent tool for following and conversing with experts, but unfortunately the wider community can on average have some pretty garbage takes. Ah well.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hxawlb8",
                            "author": "New_Dawn",
                            "score": -5,
                            "created_utc": 1645102881.0,
                            "response": "It's because the mob is here to cancel him. They came here to create the illusion that everyone hates him or he's somehow bad.\n\nI mean.. just look at the pattern of the vitriol .. it's almost like it's all written by the same two or three people",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hxb8y6r",
                    "author": "darthva",
                    "score": 0,
                    "created_utc": 1645108728.0,
                    "response": "Also confirmed: Insane Clown Posse, the ghost of President Taft, and a large shoe. They all have about as much to do with Bitcoin as Jordan Peterson does.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hxba90z",
                    "author": "Dr_Hibbert_Voice",
                    "score": -1,
                    "created_utc": 1645109276.0,
                    "response": "Oh god this is embarrassing",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hxaytwp",
                    "author": "bueno_hombre",
                    "score": -1,
                    "created_utc": 1645104056.0,
                    "response": "Gross",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hxb68ch",
                    "author": "octaw",
                    "score": -2,
                    "created_utc": 1645107543.0,
                    "response": "Fucking idiots in here. Jordan got invited because he has a platform of 100 million people.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hxb8k89",
                    "author": "AVeryRealHumanity",
                    "score": -1,
                    "created_utc": 1645108561.0,
                    "response": "Cringe",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hxb8u1b",
                    "author": "SolarPanelDude",
                    "score": -1,
                    "created_utc": 1645108679.0,
                    "response": "Bitcoin conferences should strive to get names associated with smart money to speak, not bigot psychologists who were ostracized by their peers.\n\nSome of you are rooting for shooting yourself in your own foot and don't even know it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hxauf41",
                    "author": "CptSuperBeans",
                    "score": -7,
                    "created_utc": 1645101678.0,
                    "response": " I smell pussy in the comment section.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hxb08ud",
                            "author": "aleksanderlias",
                            "score": 5,
                            "created_utc": 1645104764.0,
                            "response": "Yeah you stink, can you go shower pls.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hxb3a3b",
                            "author": "Maca_Najeznica",
                            "score": 2,
                            "created_utc": 1645106210.0,
                            "response": "Take a deep breath, that's the only pussy you'll ever smell boy",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hxb7hif",
                            "author": "benaffleckisaokactor",
                            "score": 1,
                            "created_utc": 1645108092.0,
                            "response": "Trimethylaminuria",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hxb18r7",
                    "author": "hiddenfrommyboss",
                    "score": -2,
                    "created_utc": 1645105246.0,
                    "response": "This is terrible news for Bitcoin holders",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hxavzzr",
                    "author": "NeilDiamondHandz",
                    "score": -1,
                    "created_utc": 1645102550.0,
                    "response": "🐸🐸🐸",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hxb44ak",
                    "author": "Gweedx-",
                    "score": 0,
                    "created_utc": 1645106595.0,
                    "response": "Oh fuck this I’m selling",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hxb8ewf",
                    "author": "thegoldencashew",
                    "score": 0,
                    "created_utc": 1645108498.0,
                    "response": "Great, another self-important wing nut spewing his half-baked opinion on a complex topic he partially understands. Super.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hxb7vap",
                    "author": "edwardianpug",
                    "score": -1,
                    "created_utc": 1645108259.0,
                    "response": "Ew\n\nEDIT: To clarify, if we're looking to make BTC a more inclusive crowd, this is a bad booking. He speaks to a demographic that is already well/ overly represented in the BTC space",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hxatybu",
                    "author": "New_Dawn",
                    "score": -10,
                    "created_utc": 1645101403.0,
                    "response": "Wow so much vitriol and hate for certain figures who don't conform to progressive degeneracy. It's going to be fun but also sad watching you realize you were the assholes all along. 🍿",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hxazldf",
                            "author": "aleksanderlias",
                            "score": 6,
                            "created_utc": 1645104438.0,
                            "response": "You need help",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hxb4nkj",
                    "author": "333chordme",
                    "score": -2,
                    "created_utc": 1645106835.0,
                    "response": "What the fuck.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hxb64ta",
                    "author": "mattferg222",
                    "score": -2,
                    "created_utc": 1645107500.0,
                    "response": "Oh god please no",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hxbcwrq",
                    "author": "pmogy",
                    "score": -2,
                    "created_utc": 1645110371.0,
                    "response": "Oh gosh. Not a fan of this bloke",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hxb6zlp",
                    "author": "im_lost_in_reddits",
                    "score": 0,
                    "created_utc": 1645107877.0,
                    "response": "he might talk about how to handle sufering and pain when Bitcoin drops lol   \ni luv this man tho, but idk wtf is he doing here",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hxb7g5m",
                    "author": "readevola",
                    "score": 0,
                    "created_utc": 1645108076.0,
                    "response": "For everyone that's in here griping about this endorsement, do you really believe that a few bad reputations can destroy bitcoin? If THAT is your concern with BTC why are you so heavily invested?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hxb4sby",
                    "author": "MrPresident075",
                    "score": -3,
                    "created_utc": 1645106895.0,
                    "response": "what the actual fuck.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hxakyd6",
                    "author": "mofallag",
                    "score": -23,
                    "created_utc": 1645095309.0,
                    "response": "I like the dud 👍🏻",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hxanyqb",
                    "author": "b_billy_bosco",
                    "score": -2,
                    "created_utc": 1645097598.0,
                    "response": "doesn't this guy design and sell clothes?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hxb73bt",
                            "author": "benaffleckisaokactor",
                            "score": 2,
                            "created_utc": 1645107921.0,
                            "response": "No he promotes his own bust alongside busts of Napoleon and Neitzche. PS I’m not joking",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hxb0piz",
                    "author": "JohnnyGoodnight",
                    "score": -1,
                    "created_utc": 1645104989.0,
                    "response": "When taxi drivers / psychologists start giving you investment advice. It's time to sell.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hxb4wsy",
                    "author": "NewRedditSameTaste",
                    "score": -3,
                    "created_utc": 1645106952.0,
                    "response": "Yikes. He gives off major “I did my own research” vibes",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hxbef4z",
                    "author": "le-bistro",
                    "score": -3,
                    "created_utc": 1645110989.0,
                    "response": "Why can’t I downvote this? That guy’s a hoser!",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uvh9ci",
            "title": "Significance of owning 1 millionth of the entire Bitcoin supply",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uvh9ci/significance_of_owning_1_millionth_of_the_entire/",
            "author": "thesidechain1",
            "created_utc": 1653244988.0,
            "score": 18,
            "num_comments": 38,
            "subreddit": "Bitcoin",
            "selftext": "A lot of people mention of owning 0.28 BTC could put you in the top 1% of all bitcoin holders in the future.\n\nInstead of chasing 0.28 BTC, what if we chased after owning 1 millionth of the entire bitcoin supply?\n\n21,000,000 x 0.000001= 21 BTC\n\nI ran some comparative numbers to see where that would put you if you bought tech stocks like Apple, Google, Amazon, or Tesla stock early and held them until now.\n\nIf you bought and held 1 millionth shares of shitcoins like ExxonMobil or Gold for the past 10-20 years, they would not have created generational wealth for yourself.\n\nIf Bitcoin and other altcoins are still early in the \"S\" adoption curve, owning 1 millionth of the entire supply seems like a good number to chase after while bitcoin price is down more than 50% from ATH. Because of Bitcoin's ridiculously small and finite supply compared to other assets, even chasing just 10 millionth totaling 2.1 BTC seems like a worthwhile effort.\n\nhttps://preview.redd.it/o5otcil4p2191.jpg?width=2358&format=pjpg&auto=webp&s=5cae07a534c8e820dcc7e9783ced6c6e3ebb7736",
            "stickied": false,
            "comments": [
                {
                    "id": "i9lhcp4",
                    "author": "___TG1___",
                    "score": 42,
                    "created_utc": 1653246562.0,
                    "response": "I think everyone here would want 21 BTC, but having $630,000 to get there is the obstacle",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9li8yk",
                            "author": "Asum_chum",
                            "score": 14,
                            "created_utc": 1653246974.0,
                            "response": "Yes but a Reddit post about it costs nothing so why not post about it and then go back to buying $100 on a 50% dip.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9lg5wj",
                    "author": "arbalest_22",
                    "score": 22,
                    "created_utc": 1653246033.0,
                    "response": "I’m just trying to get to 1 out of 21m. Let’s take this one baby step at a time.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9lhldv",
                            "author": "thesidechain1",
                            "score": 5,
                            "created_utc": 1653246672.0,
                            "response": "I hope you secure that 1 whole BTC soon!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9lk67k",
                                    "author": "arbalest_22",
                                    "score": 5,
                                    "created_utc": 1653247853.0,
                                    "response": "Thank you! I’m only a little over $3k away. I hope the current pieces hold or drop more in the next month then I’ll have it in the bag.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9lokth",
                    "author": "Hank___Scorpio",
                    "score": 10,
                    "created_utc": 1653249871.0,
                    "response": "In terms of ownership of entire supply, owning 1 bitcoin is like owning 19 pounds of gold.\n\nPounds not ounces for those of you doing the wrong calculation. Lazy bastards.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9lz0p2",
                            "author": "jojothehodler",
                            "score": 3,
                            "created_utc": 1653254677.0,
                            "response": "I'm laughing in metric system here.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9mmr0z",
                            "author": "obi_wan_baracus",
                            "score": 1,
                            "created_utc": 1653266729.0,
                            "response": "You’re calculating based on total supply? Cause 19lbs of gold is around 450k USD",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9mo3zy",
                                    "author": "Hank___Scorpio",
                                    "score": 2,
                                    "created_utc": 1653267432.0,
                                    "response": "Even after I told you not to. You still did it. Lol",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9mohft",
                                            "author": "obi_wan_baracus",
                                            "score": -1,
                                            "created_utc": 1653267630.0,
                                            "response": "What?\n\nYour original post is ambiguous and could mean:\n-\tone Bitcoin (30k) is worth 19lbs of gold (30k… which would be wrong)\n-\tone Bitcoin (of a total supply of 21m) is akin to owning 19lbs of the total supply of gold  <— which is what I think you meant to say.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9mrasw",
                                                    "author": "Hank___Scorpio",
                                                    "score": 1,
                                                    "created_utc": 1653269060.0,
                                                    "response": "In terms of ownership of total supply. Super ambiguous.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9mrcz5",
                                                            "author": "obi_wan_baracus",
                                                            "score": 1,
                                                            "created_utc": 1653269091.0,
                                                            "response": "Agreed",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9lfvp0",
                    "author": "meatismoydelicious",
                    "score": 22,
                    "created_utc": 1653245907.0,
                    "response": "That's a whole lot of words to say \"Buy more Bitcoin.\"",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9lfc7f",
                    "author": "NotPresidentChump",
                    "score": 5,
                    "created_utc": 1653245661.0,
                    "response": "Why not both?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9lhn8p",
                            "author": "thesidechain1",
                            "score": 7,
                            "created_utc": 1653246696.0,
                            "response": "21.28 BTC baby!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9lhwa0",
                                    "author": "NotPresidentChump",
                                    "score": 3,
                                    "created_utc": 1653246812.0,
                                    "response": "A boy can dream.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9mcg9s",
                                    "author": "StiltonG",
                                    "score": 1,
                                    "created_utc": 1653261304.0,
                                    "response": ">21.28 BTC baby!\n\nWait...am I missing something?  Wouldn't it be 23.1 BTC?  (ie, 21 + 2.1...?)",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9ljrld",
                            "author": "Ok-Imagination-7014",
                            "score": 1,
                            "created_utc": 1653247666.0,
                            "response": "What btc and gold?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9lvbc3",
                    "author": "AndyZuggle",
                    "score": 4,
                    "created_utc": 1653252966.0,
                    "response": "A person owning 21 Bitcoins is called a \"Millionthaire\".  The concept has been around for years, maybe a decade.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9mcjp3",
                            "author": "StiltonG",
                            "score": 2,
                            "created_utc": 1653261353.0,
                            "response": "Back in 2013-2014 it was typically called the \"1 in a Million club\" IIRC.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9lyprt",
                            "author": "JMurph3313",
                            "score": 1,
                            "created_utc": 1653254532.0,
                            "response": "Also the 21 club?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9m98ys",
                    "author": "procabiak",
                    "score": 3,
                    "created_utc": 1653259652.0,
                    "response": "21,000,000 x 0.00001= 210 BTC\n\nYou missed a 0 =)\n\nWhy not just divide by a million.\n\n21,000,000 / 1,000,000 = 21 BTC\n\nBut 21 BTC is basically a house now. People have sold their houses to chase wealth in Bitcoin in the past and would've gotten 210~2100 BTC. Have heard many stories over the years on Reddit, especially the 2013 and 2017 bubbles, of people doing it and taking a leap of faith. Despite the number of people telling them don't do it. These people would be in the multi hundred millionaires now, depending on how old their post was.\n\nYou would have needed incredible foresight to have acquired 21 BTC back then while it was still cheap, and kept it till today. Now it's unreachable by many. Better get 1~2.1 BTC while you can if you want to hold a milestone number.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9me6td",
                            "author": "thesidechain1",
                            "score": 1,
                            "created_utc": 1653262210.0,
                            "response": "Thanks for catching my typo. Your math and grabbing ~2 BTC is sound.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9nce7k",
                    "author": "WikiRando",
                    "score": 2,
                    "created_utc": 1653280535.0,
                    "response": "Finally, someone aiming big here",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ljgh6",
                    "author": "thefullmcnulty",
                    "score": 3,
                    "created_utc": 1653247521.0,
                    "response": "I cherish every sat I can get in my cryptographic vault. \n\nI think 1/10,000,000 of total supply is a good realistic goal for the convicted bitcoin accumulator.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9lo23f",
                    "author": "hodlyourground",
                    "score": 2,
                    "created_utc": 1653249640.0,
                    "response": "I laughed heartily when you called ExxonMobil and Gold shitcoins",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9lzsz4",
                    "author": "OldLatinGuy",
                    "score": 2,
                    "created_utc": 1653255052.0,
                    "response": "Not sure what you're trying to demonstrate, but Apple went public in 1980 with 4.6 million shares at $22/share. So you would have bought 4.6 shares for an investment of $101. There have been 5 splits since then :\n\nJune 16, 1987: 2 for 1 = 9.2 shares\n\nJune 21, 2000: 2 for 1 = 18.4 shares\n\nFebruary 28, 2005: 2 for 1: 36.8 shares\n\n June 9, 2014: 7 for 1 = 257.6 shares\n\nAugust 28, 2020: 4 for 1 = 1030.4 shares\n\nCurrent price is $137.59 \\* 1030.4 = $141,772.74\n\nIf you'd snagged 21 BTC back in 2009 for basically nothing you'd have on the order of $630,000 today provided you didn't buy a pizza. But...\n\nBTC cannot be borrowed against (apart from shady exchanges). It does not pay a dividend (just like cash, or gold). You can't write calls against it or hedge with puts. \n\nThose 1000 shares of APPL pay an annual dividend of $0.92 each or $920 a year. I can write well out of the money covered calls for $1400-$1500 additional income each month. If I'm assigned I can write CSEPs for the same kind of income until it comes back to me. \n\nFrom an investor's POV, BTC is a highly speculative, highly volatile foreign currency. Do I own some? Yes. I also buy a little each month. I even have a couple FutureBit Apollo miners running in the basement stacking SATs. \n\nDo I expect to \"get rich\"? Nope. My lifestyle is paid for by dividend paying \"blue chip\" equities, careful options trading (mostly sale of covered calls and CSEPs) and the fact that I have virtually no debt relative that income.\n\nOh, and try that exercise with T while reinvesting dividends. (Hint - that's how \"generational wealth\" accumulates.)",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9mang8",
                            "author": "thesidechain1",
                            "score": 3,
                            "created_utc": 1653260369.0,
                            "response": "To have 16403  shares of Apple today would equate to using your stock splits going back to IPO, one would have needed to buy 73.23 shares x $22 = $1611\n\nThe reason that the numbers don't match your 4.3 initial shares is probably because it doesn't take into account the number of times Apple issued new shares causing inflation and diluting shares holders wealth.\n\nThere are Tesla, Apple or any other asset-specific bulls with high conviction in their investment thesis that basically go all-in on that one thing.\n\nSeems like owning 1 millionth of the entire pie of something looks to be significant based on companies or assets that have done well. Apple is a mature company and if you had invested up to 1 millionth at any time before today, then $2.3 million worth of Apple stake is what you end up with. And the further you go back in the time curve, you would be more profitable.\n\nNo one really knows the potential of Bitcoin or altcoin, but new use cases are popping up everywhere and ability to use it as a multi-purpose financial instrument is real. \n\nSo my point is, if anyone were to bet on a a single horse that would outperform most other investments, what is the investment size needed today?\n\nI think when sizing an investment bet early in the game, buying up 1 millionth of the shares is an interesting idea. Obviously, snagging up 21 BTC is out of reach for many now so then maybe chasing 2.1 BTC would be good be a better target than trying to accumulate up to 1 or 0.28 BTC.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9ma6v9",
                            "author": "SubstantialNinja",
                            "score": 1,
                            "created_utc": 1653260133.0,
                            "response": "I sell calls against my bitcoin all the time on Legderx which was bought by [FTX.us](https://FTX.us). I usually try to sell out of the money calls for the next month and when they expire worthless I can use the premium to buy in the money calls for 2023.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9lhyeq",
                    "author": "NiceDoctorBeam",
                    "score": 1,
                    "created_utc": 1653246839.0,
                    "response": "Nobody gets old and says, \"I wish I'd saved *less* for retirement.\"",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9lm0zb",
                            "author": "Suspicious_Plan3394",
                            "score": 9,
                            "created_utc": 1653248708.0,
                            "response": "Trust me they do. Some people who saved too much and didn’t enjoy it when they were younger or regret not stretching for that dream house etc. obvious the minority but you did say nobody.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9m0a2p",
                                    "author": "NiceDoctorBeam",
                                    "score": 0,
                                    "created_utc": 1653255281.0,
                                    "response": "Bullshit.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9m1xmv",
                                            "author": "Suspicious_Plan3394",
                                            "score": 4,
                                            "created_utc": 1653256069.0,
                                            "response": "I have clients that worked like mad to save for retirement, they didn’t see their family as much as they probably should have because they worked late at the office. Now they’re retired their family doesn’t know them as they were never around. Everything is a balance.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9mnpsj",
                                                    "author": "Even-Home-9126",
                                                    "score": 2,
                                                    "created_utc": 1653267232.0,
                                                    "response": "And the cats in the cradle and the silver spoon...",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9m0kya",
                                    "author": "OldLatinGuy",
                                    "score": 1,
                                    "created_utc": 1653255423.0,
                                    "response": "Exactly right! Since I retired 6 years ago I've tuned my lifestyle to let me cover costs while indulging various passions and spoiling my grandchildren. \n\nWhile my son and his family would no doubt enjoy inheriting a big wad of cash, they will get some really nice urban real estate, money to cover college for their kids, and some awesome vintage Port I probably won't live long enough to enjoy.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9lmj2h",
                            "author": "solidepic",
                            "score": 0,
                            "created_utc": 1653248939.0,
                            "response": "Dead people don’t speak. But they might have a different opinion.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9n5l2z",
                    "author": "BlueberryBags15",
                    "score": 1,
                    "created_utc": 1653276419.0,
                    "response": "How do I get 21 BTC? I'm a whale in waiting.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ngps9",
                    "author": "Sea_Conversation2799",
                    "score": 1,
                    "created_utc": 1653283495.0,
                    "response": "Damn . You mean if I invest 600k I just might make it? This is a real breakthrough in thought. I'm not sure I've ever seen anyone mention owning 21 coins in this subreddit. Wow. Mind fucking blown",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uvhk2a",
            "title": "Is this correct logic?",
            "url": "https://i.redd.it/6kgsbpx8r2191.jpg",
            "author": "Comfortable_Kiwi_290",
            "created_utc": 1653245869.0,
            "score": 0,
            "num_comments": 43,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9lglvw",
                    "author": "Girafferage",
                    "score": 17,
                    "created_utc": 1653246227.0,
                    "response": "Their argument is akin to \"you wouldnt buy into a stock that already went up a bit, because half the people who will ever buy it made a little more money than you will\".\n\nIts also irrelevant since being used as a monetary movement platform is a value in and of itself. You dont switch your dollars around to whatever fiat is popping off that day because you buy things with it and switching it would be a huge pain in the ass. Same with crypto's. If crypto is used as a payment, why would I keep my money out of it if its for spending on day to day things",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9lisbg",
                    "author": "No-Claim-6316",
                    "score": 34,
                    "created_utc": 1653247216.0,
                    "response": "What they’ve written is one of the most insanely idiotic things I have ever read. At no point in their rambling, incoherent post were they even close to anything that could be considered a rational thought. Everyone in this subreddit is now dumber for having read it. I award them no points, and may God have mercy on their soul.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9n3am7",
                            "author": "Superjointron82",
                            "score": 4,
                            "created_utc": 1653275188.0,
                            "response": "Nice! Billy Madison is the best!",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9nszi4",
                            "author": "dlq84",
                            "score": 1,
                            "created_utc": 1653293617.0,
                            "response": ">What they’ve written is one of the most insanely idiotic things I have ever read\n\nIn true buttcoin fashion.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9lhevy",
                    "author": "SmoothGoing",
                    "score": 14,
                    "created_utc": 1653246590.0,
                    "response": "No. Money never goes \"into\" BTC. It goes to the seller. Zero fiat supply is 'in\" BTC at any given time.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9lgyj5",
                    "author": "unred",
                    "score": 13,
                    "created_utc": 1653246385.0,
                    "response": "No, this does not make sense.\n\nWhy would the value decrease for the second 50%? The value would increase as more people buy. The supply is limited.\n\nWhen people buy bitcoin, the supply available goes down.\n\nAs demand for bitcoin increases, the price goes up.\n\nIf there is only .01% of bitcoin left available on exchanges, and everyone else is holding, the competition to get that last .01% is higher than ever, and people will pay higher prices than ever.\n\nSupply and demand.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9lolup",
                    "author": "MatthewMaitreya",
                    "score": 8,
                    "created_utc": 1653249885.0,
                    "response": "I don't know about you guys, but I didn't want to buy a car because most of the world already had cars, making them more valuable, which then cost me more money upfront, and my ROI then was reduced. So I just kept walking.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9lhn19",
                    "author": "NiceDoctorBeam",
                    "score": 6,
                    "created_utc": 1653246693.0,
                    "response": "No.  That logic is not correct.  False premises.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9libjk",
                    "author": "deadontheinternet",
                    "score": 4,
                    "created_utc": 1653247006.0,
                    "response": "Man I wish we would stop reposting / mentioning buttcoin here lol. It’s fucking retarded",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9lvai4",
                    "author": "elipticslipstick",
                    "score": 2,
                    "created_utc": 1653252955.0,
                    "response": "Market cap does not determine the price, bids on the exchange determine the price. If the last person buys in and there’s only one Ask on the exchange for $1 then that person gets to buy BTC at $1.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9lgjke",
                    "author": "Nada_Lives",
                    "score": 3,
                    "created_utc": 1653246199.0,
                    "response": "Bitcoin's goal is not to be a store of value. But people might choose to use it as one.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9lh7dv",
                    "author": "NYKNYb",
                    "score": 3,
                    "created_utc": 1653246496.0,
                    "response": "No but that's the logic displayed by the last 50% of that story.\n\nThey don't understand that if BTC even approaches that critical mass, they will be forced because every other option will be much worse.\n\nThey're the ones getting rugpulled and they don't even know it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9lh8tk",
                    "author": "bland_wagon",
                    "score": 2,
                    "created_utc": 1653246514.0,
                    "response": "https://en.m.wikipedia.org/wiki/Zeno%27s_paradoxes",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9lio3l",
                    "author": "spadezero",
                    "score": 2,
                    "created_utc": 1653247163.0,
                    "response": "Correct logic? I don't see any logic with that post. Nowhere is logic to be seen.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ljeq6",
                    "author": "Dormage",
                    "score": 2,
                    "created_utc": 1653247499.0,
                    "response": "Thats some next level bird logic.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9lm5tj",
                    "author": "brustopher01",
                    "score": 2,
                    "created_utc": 1653248770.0,
                    "response": "this is the dumbest logic ever lmfao. you simply have to look at every single asset pump in history to see that human nature works the exact opposite way: when something goes up in value and demand, people want more of it, not less.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9lmbba",
                    "author": "Lazy-Substance-5161",
                    "score": 2,
                    "created_utc": 1653248840.0,
                    "response": "That sub is so unreal omg",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9lncvb",
                    "author": "Charming-Meringue-68",
                    "score": 2,
                    "created_utc": 1653249317.0,
                    "response": "No, completely wrong",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9lnf2d",
                    "author": "Rtbrosk",
                    "score": 2,
                    "created_utc": 1653249346.0,
                    "response": "these people are clueless....so funny",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9liqem",
                    "author": "adigabusymind",
                    "score": 1,
                    "created_utc": 1653247192.0,
                    "response": "I’m theory maybe correct. But I don’t thinks that’s how it’s going to work. \n\nYou are assuming the only way to get Bitcoin is through Fiat. While this is mostly true right now. But in the Future, when 50% is Bitcoin, and you do “work” you might be incentivized to exchange your effort “time/ energy” for Bitcoin directly. Reducing Fiat with every transaction. \n\nThis happens today with every currency. When countries forget to sell oil or gas for Dollars,Euros, rubles, etc etc.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9lhz3h",
                    "author": "vitalyevodin",
                    "score": 1,
                    "created_utc": 1653246848.0,
                    "response": "it is half correct, people don’t need to buy BTC not all people have value to exchange it to BTC, in case above people will start work to be payed in btc instead of any other currency just to be save \n\njust imagine that if dollar collapses, it force people like in Venezuela and different counties for looking for more save asset, but their already lost on devaluation of their currency not because BTC price is up, people already lost they value if they holded in fiat currency\n\ngrowing BTC price means that people appreciate it as save asset and they want something more stable then dollar or whatever",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9li08l",
                            "author": "Paid-Not-Payed-Bot",
                            "score": 1,
                            "created_utc": 1653246863.0,
                            "response": "> to be *paid* in btc\n\nFTFY.\n\nAlthough *payed* exists (the reason why autocorrection didn't help you), it is only correct in:\n\n * Nautical context, when it means to paint a surface, or to cover with something like tar or resin in order to make it waterproof or corrosion-resistant. *The deck is yet to be payed.*\n\n * *Payed out* when letting strings, cables or ropes out, by slacking them. *The rope is payed out! You can pull now.*\n\nUnfortunately, I was unable to find nautical or rope-related words in your comment.\n\n*Beep, boop, I'm a bot*",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9ll247",
                                    "author": "Nada_Lives",
                                    "score": 1,
                                    "created_utc": 1653248260.0,
                                    "response": "The *line's* payed out. *Haul* away!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9li839",
                    "author": "bandoonparade",
                    "score": 1,
                    "created_utc": 1653246963.0,
                    "response": "What? That doesn't make any sense. Why are we assuming the last 50% have no incentive to adopt?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9lj1u0",
                    "author": "swgo1",
                    "score": 1,
                    "created_utc": 1653247335.0,
                    "response": "Not sound. IMHO",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ljwf7",
                    "author": "StiltonG",
                    "score": 1,
                    "created_utc": 1653247727.0,
                    "response": "The logic in that buttcoin post is faulty in many ways.\n\nBy that logic, even if you bought some bitcoins as an investment when they were < $1K, you shouldn't have done so, because by that time > 50% of the coins which would ever exist had been mined already & because what you were buying back then were higher in price than what early adopters paid.\n\nBut the main logical fallacy I see in the post is that it is based on a theory of what would happen if Bitcoin were the only money/currency worldwide.  No one ever said that Bitcoin had to be the *only* currency. AFAICS no one is arguing Bitcoin, to be successful, has to *replace* all other forms of currency.  To the contrary, Bitcoin could become universally accepted as digital gold, or an underlying base layer as a store of value with plenty of other currencies in the world still being used.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9lqxp8",
                    "author": "igadjeed",
                    "score": 1,
                    "created_utc": 1653250951.0,
                    "response": "It's a fake logical regression  \n\nNot important. Bitcoin can never be a global currency, because of other fundamentals. The supply limit doesn't matter. It's huge",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9lsbib",
                    "author": "AlexDRibeiro",
                    "score": 1,
                    "created_utc": 1653251600.0,
                    "response": "Dormir ti be correct or wrong it had to have logic first",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9lsd58",
                    "author": "po00on",
                    "score": 1,
                    "created_utc": 1653251621.0,
                    "response": ">Lets just assume\n\nYou know what they say.... Assume, and you'll make an ass out of u and me",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9m9kn2",
                    "author": "98gffg7728993d87",
                    "score": 1,
                    "created_utc": 1653259816.0,
                    "response": "I mean lets assume money goes down 2% per year. and lets assume now its going down faster cause people simply do not see why it should retain its value. You're on a sinking ship. There's another ship, bitcoin, thats not sinking. 50% of people have hopped on to the non sinking ship. It makes no difference if you want to stay on the ship and sink thats your funeral. And your money is going down in value either way, whether you're in the first 50% or not has absolutely nothing to do with it. Your choice is to get off the sinking ship, or stay on. Think of it that way. You have cash now you're presented with a chance to \"cash out\" in to something more stable and not printable. You can buy anything. \n\n&#x200B;\n\nDoesn't matter if you're in the first 50% to buy that thing or not. I mean it does matter in the sense that the sooner you understand that you shouldn't hold cash the sooner you'll stop holding it and you'll be better for it since the cash is constantly steadily losing value by design.  \n\n&#x200B;\n\nAlso the 50% rule simply makes no sense. I could be the first person to buy bitcoin, I could be in the 1% earliest buyers. I could buy 100% of all coins, then I could set the price to 30k per coin immediately. the 2nd person who buys it, lets say they're the 2%, they have to pay 30k per coin cause I own all of them. So by being below 50% that doesn't inherently mean anything at all. whether your 50% or not doesn't really indicate how much resources you have etc. Really maybe what you wanted to say is you want to be in the first 50% of resources to get in to bitcoin. But what you said still makes no sense. There's no way you're losing money \"cause you're in the 2nd 50%\".\n\n&#x200B;\n\nI think what would help you is if you tried to write out the steps, one by one. Explain how this 50% rule works in an example. Write the mechanistic steps, so person in the 25% buys bitcoin, explain their steps. now explain person in the 51% buys bitcoin, and explain the situation. I think you'll find it just doesn't hold up quite as seamlessly as you made it sound. I absolutely definitely have a vague inclination of what you're getting at though, and there is some truth to it: generally being an early adopter of a new investment/technology is better than being a late adopter. But you know what else is generally true? Better late than never. There's no upside to refusing to participate in something because you believe you're late. It only makes sense to not invest if you believe its going down in value. I think thats a good place to start- don't focus on the percentages of individual so much, focus on the value itself. It doesn't matter what % I am, if im holding devaluing cash and switch to something which holds its value, im better off today than I was yesterday. Doesn't matter how long it took me to figure it out. \n\n&#x200B;\n\nMaybe you're suggesting bitcoin will go up until we reach 100% adoption, and from there can only go down? which I don't agree with, but lets humor it: in that case the 50% rule still makes no sense. Why do you assume bitcoin wouldn't keep going down beyond wherever it was when the 50% person bought in?\n\n&#x200B;\n\nLets take a look at another investment. Real estate. Lots of families have real estate. Maybe most families. Does that mean its too late to buy real estate and that you'd actually be losing money by buying real estate? I see no reason to assume that would be the case? it could be true, sure, but there's no indication that that is DEFINITELY true? \n\n&#x200B;\n\nLets just humor this thought, I don't believe this necessarily, but this is an example simply to show you how your view simply doesn't make sense. lets say in the year 2,000 50% of people own real estate. and lets say in the year 2010 100% of the people own real estate. and lets say in 2020 the value of real estate is higher still. So was it a mistake to take your devaluing cash and put it in to real estate?\n\n&#x200B;\n\nOr lets imagine in 2060 everyone uses bitcoin, we're at \"full\" adoption, and price rises by 40% each year for the past 40 years. and in 2100, everyone still uses bitcoin, and the price has kept rising? why? cause they keep printing money and the population keeps growing. and people simply feel the value should rise? Why does the value of the Mona Lisa go up over time? Its the same painting as it was the year before? everyones already aware of its existence? You need to detail this out more. 50% of a population invests in something, on its face it means nothing. Explain your thought process more, what are the series of events and how does this 50% come in to play with those events.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9mbd9c",
                    "author": "98gffg7728993d87",
                    "score": 1,
                    "created_utc": 1653260733.0,
                    "response": "Would you like to start by explaining why you think this makes sense? Cause to me its just completely off base. I hope that if I go to this post on buttcoin even they would say this is not the writing of someone who understands how investing works, not even someone who understands how investing in stocks works. This statement makes no sense, and this same statement, applied to stocks, would also make no sense. Its hard to even pinpoint where to start explaining how this is wrong cause its unclear how the writer believes the mechanics of the situation work. The statements are all very disconnected from each other, though the author appears to repeatedly allude to what they seem to think is an obvious connection. In reality the shortest way I can answer the question is \"that is simply not how it works.\". I think from there, in an ideal world, you would begin to ask questions starting with the first question that pops in to your head, and we in this thread can bring you question by question to a more accurate understanding of the dynamics at play here.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9mti2i",
                    "author": "NotMiningBitcoin",
                    "score": 1,
                    "created_utc": 1653270140.0,
                    "response": "It's like this fool lives in a universe where FOMO is not a thing",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9mz32d",
                    "author": "Grief-Inc",
                    "score": 1,
                    "created_utc": 1653272985.0,
                    "response": "Your data became skewed when you attempted to introduce logic into the mix.  Logic is typically a non factor in regards to, well...anything.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9n27sr",
                    "author": "tightwhitebussy",
                    "score": 1,
                    "created_utc": 1653274612.0,
                    "response": "There are plenty of platforms online to research more throughly and revise your logic. I wish you the best of luck next time. Eventually you will get it right.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9n5wqu",
                    "author": "Kahoobbb",
                    "score": 1,
                    "created_utc": 1653276602.0,
                    "response": "Well he said that bitcoin is bad for the enviroment when its actually good for the enviroment if you watched \"this machine greens\". Good bitcoin documentary.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ne6tt",
                    "author": "The_Estranger_0001",
                    "score": 1,
                    "created_utc": 1653281739.0,
                    "response": "Can’t understand any logic about this. I’ve been seeing so many low quality arguments like this. These kind of posts alway start with several self-fulfilled assumptions, then develop a whole story.\n\nWhat is “100% of all money supply goes into BTC”? What is meant by money supply? Your employer? Government? Which government?\n\nThen why “as the number approaches 50%, there would be no incentive for 2nd 50% to buy”? What logic is that?\n\nIs the OP even sober?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9nr880",
                    "author": "Mufasa341",
                    "score": 1,
                    "created_utc": 1653291964.0,
                    "response": "BTC doing rugpulls? What did he smoked?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9nrrb3",
                    "author": "StoicTechInvestor",
                    "score": 1,
                    "created_utc": 1653292461.0,
                    "response": "Fiat currency debasement versus Metcalfe's law in conjunction with Reeds law. At least you know you're steadily losing circa 7% per annum in Fiat.\n\nCheck out TF Peterson's academic writings on Bitcoins value, it's pure maths and with any network value the only assumption is network growth.\n\nAsk yourself why you'd want to be in Bitcoin and not Fiat. Two columns, 'for' and 'against' and stick to facts. Bertrand Russell style.\n\nThese far left deeply biased critics use the energy card whilst using bank accounts and things made by oil and gas, they are the biggest hypocrites known to humanity. They fail to be mindful of the other facets to ESG. Why don't they shut down the traditional banking system too? It is even more impactful in terms of using energy than Bitcoin. If this is all about energy use then surely the only equitable thing is to shut down all non-essential things which use energy? Christmas lights, computer gaming, sporting industry, all uses huge amounts of energy. \n\nStandard extreme views which always leads to prosperity for humanity doesn't it...selective dictatorship characteristics.\n\nThe gap in equality grows and grows but I don't see these far left individuals talking about that or trying to find a solution. \n\nIf people were actually being fair and logical they'd ask themselves; is there any good in finding a solution for millions of people to protect their wealth? How much better would the environment be if everyone on the planet could be lifted out of poverty? Reduction in polluting habits, exploitation of the natural world and it's creatures to put food on your families table, rid the world of bush meat trade, poaching, drug trade, slavery trade etc etc\n\nGive people the means to protect their wealth and I'd very much imagine that the world starts becoming a better place. Unfortunately people cannot see things in a holistic way, they focus on siloed fashionable topics which they pursue to purely make themselves feel better about their lives. Total lacking in emotional intelligence as they are consumed by intellectual insecurity. The narcissist pandemic will rage on for years, they will never admit they are wrong even when the facts are undeniable. Not yours or mine concern, they will adopt CBDC'S and will have limited financial freedom.\n\nGreat people create and do they don't go around pouring criticism onto others who are at least trying to improve things. \n\nEven if Bitcoin fails then surely it's better to at least try to improve the way humanity distributes economic gain and preserves individual wealth. If we carry on with this trajectory of poverty then how do you think it all ends?? Peacefully....I don't think so and I can safely say war in human society is far worse for the environment than anything else.\n\nWhen Bitcoin is 100% renewable my guess is the narrative from the elite publications and banking giants will change dramatically into pro Bitcoin. Energy grids are like musical symphonies and base loads are vital to the health of energy grids. Bitcoin fills this gap beautifully and energy companies know this now and are actively working with Bitcoin miners. 100% renewable and there's no attack.\n\nDraw your mind map (pro and con diagram) and stick to the facts. Then you'll have more conviction one way or the other. Individual choice is democracy, how I use my energy I pay for is my choice, especially if I create that energy myself.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9nst5a",
                    "author": "StoicTechInvestor",
                    "score": 1,
                    "created_utc": 1653293446.0,
                    "response": "You may also want to form an understanding of the Agricultural Revolution as well as the Industrial Revolution. These events gave birth to many many things that the critics of Bitcoin use every day of their lives, some of which are vital. Without these events in our history you'd have no space travel or advance medicine et al. \n\nWe're in the Digital Revolution now and Bitcoin underpins this. You'll always have critics when innovation is concerned.\n\nMotor vehicle, light bulb, personal computer, telephone etc etc\n\nHow many people use those things now??",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ljdxy",
                    "author": "AbeAlrighty",
                    "score": 0,
                    "created_utc": 1653247488.0,
                    "response": "Consider this: People will NEED to buy/use/rely on Bitcoin as it’s the most efficient monetary solution.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}