{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "rlceos",
            "title": "Exodus or electrum?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/rlceos/exodus_or_electrum/",
            "author": "i-hate-steven",
            "created_utc": 1640084843.0,
            "score": 3,
            "num_comments": 11,
            "subreddit": "Bitcoin",
            "selftext": "I have bitcoin and a few other coins that I want to move to exodus and/or electrum. I was thinking of putting my bitcoins into my electrum wallet and rest in exodus. Is this a smart thing to do? What would be the cheapest and safest way?",
            "stickied": false,
            "comments": [
                {
                    "id": "hpevcai",
                    "author": "castorfromtheva",
                    "score": 8,
                    "created_utc": 1640085598.0,
                    "response": "The cheapest and safest way would likey be using TailsOS (pgp-veryfied) where Electrum is already integrated.\n\nhttps://tails.boum.org/\n\nNevertheless a hardware wallet isn't that expensive but tremendously more secure.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hpezmee",
                    "author": "abhilodha",
                    "score": 6,
                    "created_utc": 1640088730.0,
                    "response": "No doubt electrun on usb live session of linux",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hpeykcc",
                    "author": "lil_phil_42069",
                    "score": 6,
                    "created_utc": 1640088010.0,
                    "response": "Don’t trust exodus. I had my coins disappear from that wallet many years ago. It was definitely not my fault. One day I wake up and check the balance, and it shows 0 btc. Support team ignored me. I think exodus is a shady wallet. At least from my previous experience.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hpeywpr",
                            "author": "castorfromtheva",
                            "score": 4,
                            "created_utc": 1640088246.0,
                            "response": "In the first place Exodus is closed source. So not trustable for bigger amounts of funds.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hpeyzlg",
                                    "author": "lil_phil_42069",
                                    "score": 3,
                                    "created_utc": 1640088300.0,
                                    "response": "Exactly. Thanks for mentioning that. Any closed source wallets… I say fck u to their developers.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hpezi3m",
                    "author": "Geoknysis",
                    "score": -4,
                    "created_utc": 1640088650.0,
                    "response": "I use Exodus. It's refined, versatile, and quite secure.\n\nI also use Electrum. It's basic, poorly designed, and simple to use.\n\nIf I had to choose, I would say Exodus. It's [partly open source](https://support.exodus.com/article/89-is-exodus-open-source) and the co-founder has done quite a lot of open source stuff. Exodus has a reputation to uphold in order to keep its userbase and earn the fees it does from transactions using its integrated exchange/conversion feature (if you want to use it). You get your keys and your wallet is encrypted. [Neither is stored on their servers](https://support.exodus.com/article/46-where-are-my-private-keys-stored). It also has a mobile version on the Play Store that functions perfectly.\n\nElectrum has me more worried because as good as people say it is, I can't help but wonder how much effort really goes into the software when the devs can't even get icons to fit in boxes properly, or have text scale proportionately with window size... Also, while they say you can verify the signatures, the process is broken and cannot be done. Supporting instructions to verify the signatures are out of date. I suspect the 'option' to verify signatures is sufficient for some to implicitly trust there is a level of security, but in reality it's unverifiable. There is also a broken version on the Play Store. Basic oversights like this concern me greatly as it's typically a reflection of sloppy coding and support all around.\n\nOpen source doesn't always mean better. The modem software on your phone is closed source while the Android OS is partly open source. This is to ensure security. The same concept applies to Exodus.\n\nWhat about [Bitcoin Core](https://en.wikipedia.org/wiki/Bitcoin)? It's the oldest Bitcoin Wallet and seems like the best of both worlds? I use it too, and I like it quite a bit!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hpf1q71",
                            "author": "Mallardshead",
                            "score": 2,
                            "created_utc": 1640090117.0,
                            "response": "Electrum's only problem has been the phishing industry. If it weren't for the scam 3rd party upgrade or download links, I'm not sure we could point to the wallet ever having much of a problem over a decade. \n\nPlenty of nodes run Electrum as I plan on doing with my LN node.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hpf01gy",
                            "author": "castorfromtheva",
                            "score": 2,
                            "created_utc": 1640089014.0,
                            "response": "Electrum doesn't give a fuck about icons. It gives a fuck about transparency and security though. And it is highly compatible with the best hardware wallets outhere. But some obviously rather prefer blink-winky glitter and care less about trustlessness and real security.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hpjoqqq",
                    "author": "igadjeed",
                    "score": 1,
                    "created_utc": 1640173775.0,
                    "response": "Exodus is closed source. Do not trust Exodus. Nobody cares what you do with your altcoins",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}