{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "utrheo",
            "title": "Central bankers from 44 countries using Bitcoin in El Salvador",
            "url": "https://i.redd.it/eqwdtpam2m091.jpg",
            "author": "Reahvenz",
            "created_utc": 1653043887.0,
            "score": 1282,
            "num_comments": 160,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9clagi",
                    "author": "Riqqat",
                    "score": 11,
                    "created_utc": 1653065276.0,
                    "response": "Do you have a list for the names of those 44 countries?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9f8ke6",
                            "author": "TenshiS",
                            "score": 5,
                            "created_utc": 1653114347.0,
                            "response": "Nayib Bukkele tweeted a list of all the countries in this thread: https://twitter.com/nayibbukele/status/1526029996787216387?t=d_yeTFxIVT1fi7sEvTMy4Q&s=19",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9d4fhb",
                            "author": "Rokey76",
                            "score": 3,
                            "created_utc": 1653073610.0,
                            "response": "I can't find a list anywhere, but this is the group that is meeting. You can probably find them all there (just not in list format that I could find).\n\n[https://www.afi-global.org/?fbclid=IwAR0jh9i-mFY83emWP9G6Xbyy-teJlk6TQ59zl7iByNGcQ2ov1VWS9ZTZYKg](https://www.afi-global.org/?fbclid=IwAR0jh9i-mFY83emWP9G6Xbyy-teJlk6TQ59zl7iByNGcQ2ov1VWS9ZTZYKg)",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9bo3i1",
                    "author": "ThreetoedJack",
                    "score": 80,
                    "created_utc": 1653051710.0,
                    "response": "Bitcoin in theory is good. But the real orange pill for most normies is when they make their first transaction. Especially if they have some understanding of the legacy system.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9c47q3",
                            "author": "redshadow90",
                            "score": 51,
                            "created_utc": 1653058541.0,
                            "response": "Very few normies understand the legacy system. Everybody thinks money transfer is instant or close to it",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9d2u3w",
                                    "author": "thrivecoin",
                                    "score": 10,
                                    "created_utc": 1653072857.0,
                                    "response": "The advantage of the legacy system (for winners) is that it's a system they trust to work for them. Trust is more important than instant vs. not-instant. As trust in bitcoin and crypto continues to rise, more and more central bankers (and winners in the predominant system) will continue to adopt it - as we've seen for years now.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9d5bvx",
                                            "author": "OutdoorRink",
                                            "score": 6,
                                            "created_utc": 1653074041.0,
                                            "response": "Not sure trust in crypto is going in the direction you think it is.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9d7pyl",
                                                    "author": "thrivecoin",
                                                    "score": 5,
                                                    "created_utc": 1653075133.0,
                                                    "response": "Fair enough. I've been through enough booms and busts to take the long view on moments in time like this one. This too shall pass, and crypto / blockchain / web3 will continue to make a greater and greater mark on humanity.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9fqwry",
                                            "author": "diydude2",
                                            "score": 1,
                                            "created_utc": 1653130827.0,
                                            "response": "Bitcoin is trustless.  That's the brilliance of it.\n\nWe don't trust.  We verify.\n\nSadly, many people are going to find out the hard way just how much that trust in their banks is really worth.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9fuzfh",
                                                    "author": "mustyoshi",
                                                    "score": 1,
                                                    "created_utc": 1653133916.0,
                                                    "response": "You have to trust that somebody will accept your btc at a favorable exchange rate for whatever good or service you're interested in.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9c4mz1",
                                    "author": "ThreetoedJack",
                                    "score": 30,
                                    "created_utc": 1653058711.0,
                                    "response": "They think it's instant until they go to buy a house.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9d4pz7",
                                            "author": "Mysterious_Mouse_388",
                                            "score": 6,
                                            "created_utc": 1653073749.0,
                                            "response": "really? buying a house felt close enough to instant for me.  I asked for a sheet of paper worth X dollars and they printed it off and then I handed it to my lawyer. I got to the bank minutes before close and I wasn't even the last person they helped.\n\nThe only time in my life when money isn't instant is when a customer wants a refund and Visa (not me) sits on the money for two weeks.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9duq8b",
                                                    "author": "Socialists-Suck",
                                                    "score": 4,
                                                    "created_utc": 1653085695.0,
                                                    "response": "Yeah, I know right?  it’s great for me too.   Have Amex will travel!   But what about the other [two and a half billion](https://www.statista.com/statistics/1246963/unbanked-population-in-selected-countries/)?",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i9erdf1",
                                                    "author": "Life_is_a_storm",
                                                    "score": 4,
                                                    "created_utc": 1653102765.0,
                                                    "response": "Why should we still need to go to a physical bank branch to pay for anything?",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i9e90pl",
                                                    "author": "GarethMJ23",
                                                    "score": 5,
                                                    "created_utc": 1653092990.0,
                                                    "response": "I don't think having to travel to a bank, getting them to print a piece of paper, and then handing that paper to a lawyer, plus the time for the funds to actually transfer between parties is \"instant\" (or even close to instant) in the same context Threetoedjack meant.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9dii1n",
                                            "author": "cryptoripto123",
                                            "score": 2,
                                            "created_utc": 1653079975.0,
                                            "response": "Seems like you haven't done a wire transfer before. It's not as instant as Bitcoin but is pretty close to instant in terms of most financial transfers in the fiat world. If it weren't real time, then wire fraud wouldn't be a real problem--you know the same way you can claw back credit card transactions pretty easily. Once wire transfers are sent, they're pretty much gone. You need to have bank cooperation at that point on the receiving end to hold/send those funds back.\n\nMaybe you're thinking ACH.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9dqshw",
                                                    "author": "ThreetoedJack",
                                                    "score": 6,
                                                    "created_utc": 1653083816.0,
                                                    "response": "Have to go to the bank, during business hours. And get to pay $30 for the privilege.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9e9t74",
                                                            "author": "cryptoripto123",
                                                            "score": 1,
                                                            "created_utc": 1653093412.0,
                                                            "response": "You don't have to go to the bank at all. I've done many wire transfers before from a few hundred $ up to six figure values. And in my bank I don't pay a fee at all. It's free for me, so I actually prefer using wire transfers to fund my exchanges because the funds clear same day (or next day at worst case) and I can withdraw them. No 10 day holding period like ACH on Binance.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9frjxr",
                                                                    "author": "ThreetoedJack",
                                                                    "score": 1,
                                                                    "created_utc": 1653131338.0,
                                                                    "response": "Dude, you realize your situation is not in any way normal for 99.999% of the population? The legacy system works for you. For most people it doesn't.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i9dt1zg",
                                                    "author": "Socialists-Suck",
                                                    "score": 4,
                                                    "created_utc": 1653084887.0,
                                                    "response": "Wire transfers in the US are pretty fast but you have to jump through hoops.  For significant amounts the bank requires a form, the form must be filled out and then they have to call you to verify the account and amount before sending.  International transfers via SWIFT are another story.  The transaction hops through a number of correspondent banks and can get “lost“ between hops.  They’ll find it eventually.  But it’s at least two days and likely more if you’re sending somewhere that doesn’t have good banking system.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9e9m2j",
                                                            "author": "cryptoripto123",
                                                            "score": 1,
                                                            "created_utc": 1653093306.0,
                                                            "response": "In my experience you don't need a form. I successfully completed wire transfers for real estate transactions (mind you SF Bay Area, so if that isn't significant enough then are you meaning 7+ figures transfers?) with no issues.\n\nIn my experience SWIFT was smooth but yes it can depend on the country and what not.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9cf53p",
                            "author": "redshadow90",
                            "score": 12,
                            "created_utc": 1653062878.0,
                            "response": "To be fair, nobody in general complains about how long transactions take on regular financial infra. It's the engineers who have to deal with maintaining a whole lot of bs integrations and infra for it",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9chsso",
                                    "author": "onlyherefortheclout",
                                    "score": 14,
                                    "created_utc": 1653063920.0,
                                    "response": "I complain every time I wire money and it takes 15 mins in the bank and days to hit the recipient.  I can't imagine I'm the only one",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9d36hk",
                                            "author": "OdoIcontradictmyself",
                                            "score": 3,
                                            "created_utc": 1653073018.0,
                                            "response": "And god forbid I have to send a wire from the west coast to the east coast on a Friday afternoon. They MIGHT get it Monday by EOB. International is way worse.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9d3onx",
                                                    "author": "Rokey76",
                                                    "score": 3,
                                                    "created_utc": 1653073258.0,
                                                    "response": "Do you do this often? I'm 45 years old and have never sent a wire payment in my life.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9d667d",
                                                            "author": "OdoIcontradictmyself",
                                                            "score": 2,
                                                            "created_utc": 1653074429.0,
                                                            "response": "I run a business that requires wires several times a week. Otherwise I wouldn’t do it either.",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "i9dqnsd",
                                                            "author": "onlyherefortheclout",
                                                            "score": 2,
                                                            "created_utc": 1653083754.0,
                                                            "response": "At least once a week for business",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "i9d56q6",
                                                            "author": "hemanoncracks",
                                                            "score": 1,
                                                            "created_utc": 1653073973.0,
                                                            "response": "Thank you. I’m 46 and have never done any of these things.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9cja4v",
                                            "author": "redshadow90",
                                            "score": 5,
                                            "created_utc": 1653064494.0,
                                            "response": "Each block confirmation on BTC takes 10 minutes on average, so waiting for 2 of those would take you 20 mins anyway. Lightning is faster but it isn't really committed to the chain until block confirmations if you're being more risk averse. Lightning is for smaller amounts anyway whereas wiring money is for larger ones typically for which you'd want to wait for block confirmations",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9clds3",
                                                    "author": "onlyherefortheclout",
                                                    "score": 8,
                                                    "created_utc": 1653065313.0,
                                                    "response": "Waiting 20mins in my living room is far better than driving to bank, waiting for someone to become available, fill out forms and drive home.  And then waiting for it to confirm with the 3rd parties before avail to recipient.  And if you need to do it over the weekend?  Goodnight!",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9cr3rr",
                                                            "author": "redshadow90",
                                                            "score": 6,
                                                            "created_utc": 1653067607.0,
                                                            "response": "The driving to a bank part is a lot different from what I was comparing, which was initiating a wire transfer online. It is a bit unfair to compare the physical transfer initiation case as bitcoin doesn't offer that option. For sure, the weekend case is correct and something I missed. I am not disputing that bitcoin is better but I want to keep it real :)",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "i9ebe46",
                                                            "author": "godlikeplayer2",
                                                            "score": 3,
                                                            "created_utc": 1653094256.0,
                                                            "response": "ever heard of online banking?",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9emh3v",
                                                                    "author": "onlyherefortheclout",
                                                                    "score": 1,
                                                                    "created_utc": 1653100108.0,
                                                                    "response": "Lol I've been doing this for a long time.  Money goes where online banking doesn't work.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9fj5sq",
                                                                            "author": "godlikeplayer2",
                                                                            "score": 1,
                                                                            "created_utc": 1653123791.0,
                                                                            "response": "when your local bank can wire it then you should be able to wire it via online banking as well. Or are you talking about living in a place where online banking does not work?",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "i9dr6ap",
                                                            "author": "NishizumiMiho",
                                                            "score": 2,
                                                            "created_utc": 1653083993.0,
                                                            "response": "The branch office i go to is usually pretty busy, the current staff shortage made the waiting time longer. I waited half hour just see someone.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9emvcb",
                                                                    "author": "onlyherefortheclout",
                                                                    "score": 1,
                                                                    "created_utc": 1653100328.0,
                                                                    "response": "Yup, crypto solves so much.  My bank is getting ready to start processing it soon, can't wait.  The irony of having to wire Fiat to an exchange to buy crypto, to send it to someone that you're trying to avoid wiring with.  \n\nI remember clearly when everyone was talking trash on online banking and even e-commerce.  \"Its dangerous, and it will never replace brick and mortar\". I'll bet you can still find some poor chap muttering this in the bar next to an Amazon Go shop\n\n✌️",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i9cqp19",
                                                    "author": "ludwigvonmises",
                                                    "score": 3,
                                                    "created_utc": 1653067440.0,
                                                    "response": "Lightning \"commits\" to the chain immediately once the transaction to open a channel confirms. All transactions on the Lightning network settle immediately.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9cvzzf",
                                                            "author": "redshadow90",
                                                            "score": 3,
                                                            "created_utc": 1653069681.0,
                                                            "response": "Wait, I'm a noob. I thought when lightning channel is opened, it keeps collecting txns and then finally commits to the chain either at a frequency or when the channel is closed. Does lightning push each txn to the mempool?",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9cybmn",
                                                                    "author": "diradder",
                                                                    "score": 4,
                                                                    "created_utc": 1653070743.0,
                                                                    "response": "Both parties in a LN channel update its balances (on each side) and have at each step a transaction they can broadcast on Bitcoin to close the channel if they want. They usually won't do it as it's cheaper to keep transacting on LN, but this mutual \"check\" makes it that previous states won't be broadcasted.\n\nIf they do broadcast an old state to close the channel, the other party can broadcast a punishment transaction (proving a more recent state exists, signed by both parties at the time it was created) on Bitcoin too and get the whole balance back. This kind of \"threat\" on both ends keeps everyone honest in general. (All of this assume the current channel mechanism known as Poon-Dryja channel, other mechanism will eventually be implemented).",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9cyjh2",
                                                                            "author": "redshadow90",
                                                                            "score": 3,
                                                                            "created_utc": 1653070842.0,
                                                                            "response": "That's so cool. Thanks for sharing!",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        },
                                                                        {
                                                                            "id": "i9dazwp",
                                                                            "author": "outdatedrhombus",
                                                                            "score": 2,
                                                                            "created_utc": 1653076586.0,
                                                                            "response": "So it's like proof of stake?",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i9dk83g",
                                                                                    "author": "diradder",
                                                                                    "score": 2,
                                                                                    "created_utc": 1653080760.0,
                                                                                    "response": "At the scale of a channel between two people you could draw some parallels, I suppose you mean the \"slashing\" of funds for bad actors in PoS. But really the parties just rely the Bitcoin blockchain to check if the channel is still open and their history of states to know the current balance/liquidity channels. This is why having a reliable Bitcoin node for your LN node is important.\n\nLN nodes gossip those payment channels with each other to have a graph of the LN around them in order to have an idea where they can/should route payments when needed.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i9dp1z8",
                                                                                            "author": "outdatedrhombus",
                                                                                            "score": 2,
                                                                                            "created_utc": 1653083006.0,
                                                                                            "response": "This is a serious question, I'm not trolling.\n\nBut my understanding of proof of stake (I might be wrong so do correct me if I am) is that a party gets to validate transactions based on the funds they have locked up. If there is any funny business their funds are confiscated? \n\nBut this sounds almost exactly like what is happening on the lightening network? I may be misunderstanding",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9cygff",
                                            "author": "BeefFeast",
                                            "score": 2,
                                            "created_utc": 1653070805.0,
                                            "response": "Patience is a virtue. Perhaps yoga?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9dqfor",
                                                    "author": "onlyherefortheclout",
                                                    "score": 1,
                                                    "created_utc": 1653083649.0,
                                                    "response": "I'm a patient man, but the person or business on the other end not so much.  Which makes me impatient indirectly 😁",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9ch5jh",
                                    "author": "codeByNumber",
                                    "score": 3,
                                    "created_utc": 1653063666.0,
                                    "response": "…send help.\n\n\nWorked for credit unions and banks for most of my career. I’m happy to be somewhere else now but ya, the majority of my career was painting lipstick on top of systems that under the hood were still orchestrating transactions on mainframe computers.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9d0wbo",
                                    "author": "StonksPeasant",
                                    "score": 2,
                                    "created_utc": 1653071943.0,
                                    "response": "I do.  Anytime I transfer between my banks or trading account and it takes several days its annoying af and I wonder why we use such a shit system",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9dcl5c",
                                            "author": "redshadow90",
                                            "score": 1,
                                            "created_utc": 1653077289.0,
                                            "response": "True but for most people it happens infrequently enough that it doesn't matter as much as a whole. Only matters a lot to a small subset who deal with this regularly",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9e6emi",
                                    "author": "StrivingPlusThriving",
                                    "score": 1,
                                    "created_utc": 1653091595.0,
                                    "response": "I complain any time I want to withdraw thousands in cash from my fiat bank account. Sometimes it's taken hours, even days. Pain in the rear. Bitcoin takes 10 minutes for final settlement.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9cpliw",
                            "author": "Popular_Bet_2849",
                            "score": 2,
                            "created_utc": 1653066994.0,
                            "response": "First time I used Bitcoin in a transaction was in response to my bank not letting me make the purchase (it was for a VPN). Even though it's permission-less like cash, it felt weird having that same sort of freedom for an online transaction. Like no one could stop me and I was in charge through the power of mathematics.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9d3sqe",
                                    "author": "Rokey76",
                                    "score": 1,
                                    "created_utc": 1653073312.0,
                                    "response": "Why did your bank prevent you from making the purchase? I don't think that's ever happened to me.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9d45rk",
                            "author": "fiedo87",
                            "score": 2,
                            "created_utc": 1653073485.0,
                            "response": "using the QR code and watching hundreds of thousands of dollars move without the trust of a third party is it.  I helped a wealthy mom of a friend and was skeptical buying and moving it from exchange to her ledger was what sold her on it and is buying hundreds of thousands more",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9elnsd",
                            "author": "tchubaina",
                            "score": 1,
                            "created_utc": 1653099660.0,
                            "response": "> But the real orange pill for most normies is when they make their first transaction.\n\nI’m a normie. \n\nWhat’s special about a first transaction with Bitcoin? Genuinely curious. \n\n> Especially if they have some understanding of the legacy system.\n\nCan you explain like I’m 5?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9cx0fv",
                    "author": "BashCo",
                    "score": 10,
                    "created_utc": 1653070140.0,
                    "response": "The activity in El Salvador seems to be triggering a lot of shitcoiners.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9c238f",
                    "author": "hateschoolfml",
                    "score": 3,
                    "created_utc": 1653057693.0,
                    "response": "And the lightening network",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9fkjch",
                            "author": "dlq84",
                            "score": 1,
                            "created_utc": 1653125084.0,
                            "response": ">Lightning",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9ecpjy",
                    "author": "shwirv",
                    "score": 3,
                    "created_utc": 1653094968.0,
                    "response": "This is a surreal sight. Can you imagine if 10-15 years ago, you were told that a conference of central bankers would gather to discuss and learn about a cryptocurrency?  \n\n\nThe developing nations have an advantage because they aren't beholden to their fiat currency or the IMF. Bukele is leading innovation from El Salvador. Developed nations like the United States need to step it up.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9br180",
                    "author": "Pandagames",
                    "score": 22,
                    "created_utc": 1653053041.0,
                    "response": "Does Bitcoin work well as a day to day currency when it's so volatile? I mean anyone exclusively on Bitcoin just lost half their savings due to no fault of their own. I know that can happen with any other currency but once that happens to the US dollar I got bigger things to worry about",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9c5j54",
                            "author": "FFmodsRcorrupt",
                            "score": 28,
                            "created_utc": 1653059072.0,
                            "response": "Most smaller country currencies are volatile as well and eventually succumb to hyper-inflation.\n\nZoom out on rub/usd for example. The past 30 years have been pretty intense.\n\nAlso, we're comparing everything to USD which itself has been losing value on an average ~2-7% per year for 50 years. The more you learn about bitcoin and its effects, the more you see through the veil of our entire financial structure and theory.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9ce4wq",
                                    "author": "lcarusLives",
                                    "score": 7,
                                    "created_utc": 1653062479.0,
                                    "response": "Just to expand, because I think this topic is important.  People who live in small country currencies have no choice other than to use their country's currency.  If that currency succumbs to hyper inflation or corruption, bitcoin is their only financial life raft.\n\n\nWe've seen this now with the Russian Ruple, a second world country involved with war.  Whether the people living in Russia are for/against the war, the currency has taken a hit impacting everyone's financial security and future.\n\n\nBitcoin simply offers borderless payments to anyone, anywhere for any amount.  Zooming out, seeing larger countries adopting bitcoin for its main utility in times of crisis is a silver lining.  \n\n\nWe may see more financially privileged countries adopt bitcoin primarily as a medium of exchange and secondary as a store of value, rather than the vice versa we see today.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9c9hwx",
                            "author": "kidneyprobs",
                            "score": 8,
                            "created_utc": 1653060650.0,
                            "response": "So did my 401k and my stock tho.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9ceoiq",
                                    "author": "Jjglo",
                                    "score": 4,
                                    "created_utc": 1653062694.0,
                                    "response": "The dollar is not worth 50% less now that it was 6 months ago.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9cwba0",
                                            "author": "BashCo",
                                            "score": 6,
                                            "created_utc": 1653069824.0,
                                            "response": "The US Dollar has lost roughly 80% of its purchasing power since 1970. Approximately 35% since the Bitcoin network was launched in 2009.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9brjqx",
                            "author": "AJ_14",
                            "score": 11,
                            "created_utc": 1653053270.0,
                            "response": "That assumed the person invested all their savings at the ATH.  Which is very unlikely.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9byj78",
                                    "author": "Western_Boris",
                                    "score": 8,
                                    "created_utc": 1653056251.0,
                                    "response": "AND sold it. Selling to fiat is the only way to lose. Hodl and spend directly as bitcoins after 20 years.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9cn8s4",
                                            "author": "mtndewaddict",
                                            "score": 3,
                                            "created_utc": 1653066050.0,
                                            "response": "Or for groceries, phone bill, utilities, rent, etc.  None of that is a constant BTC value and your buying power will fluctuate.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9do7k2",
                                                    "author": "GET_OUT_OF_MY_HEAD",
                                                    "score": 1,
                                                    "created_utc": 1653082614.0,
                                                    "response": "That's what I have fiat for. Any leftovers after bills, food, entertainment, and savings goes directly to BTC.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9cmpoo",
                            "author": "DOG-ZILLA",
                            "score": 1,
                            "created_utc": 1653065839.0,
                            "response": "Well, when you think of BTC in dollars, it doesn’t make sense to spend it much. \n\nI think what most Bitcoiner’s want in the future is a world where Bitcoin **IS** the currency. Then you don’t have this problem. You’re just exchanging sats for goods with no concept of needing to convert them to USD.\n\nYou could say the same about the USD compared to any other currency that devalues too, Bitcoin is just a little more extreme right now as it develops.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9d4uwn",
                                    "author": "Rokey76",
                                    "score": 1,
                                    "created_utc": 1653073813.0,
                                    "response": "But you can only do that if the price of Bitcoin stays the same.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9byq1h",
                            "author": "ibeforetheu",
                            "score": -11,
                            "created_utc": 1653056331.0,
                            "response": "Dude do you have any other arguments besides this one? All day long this is what you talk about",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9bzu87",
                                    "author": "Pandagames",
                                    "score": 5,
                                    "created_utc": 1653056785.0,
                                    "response": "What? I hardly ever post in here",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9by8jh",
                            "author": "iceman0855",
                            "score": 1,
                            "created_utc": 1653056131.0,
                            "response": "No, but it probarly will.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9bn923",
                    "author": "ed190",
                    "score": 18,
                    "created_utc": 1653051309.0,
                    "response": "Chivo wallet is sometimes a mess.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9bpaze",
                            "author": "Deep-Jump-803",
                            "score": 17,
                            "created_utc": 1653052269.0,
                            "response": "I agree, but either way I use it because it's incredibly cheap to received international payments and convert back to fiat on the atm",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9c5dxs",
                                    "author": "GibbsSamplePlatter",
                                    "score": 1,
                                    "created_utc": 1653059013.0,
                                    "response": "what's the hit/miss rate for Chivo wallet right now?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9c62sm",
                                            "author": "Deep-Jump-803",
                                            "score": 2,
                                            "created_utc": 1653059290.0,
                                            "response": "Can you explain more about \"hit/miss\"? What does that mean?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9c6ho5",
                                                    "author": "GibbsSamplePlatter",
                                                    "score": 2,
                                                    "created_utc": 1653059455.0,
                                                    "response": "sorry, how often does it work as expected with external wallets, for example.\n\nsend/receive etc",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9c77ye",
                                                            "author": "Deep-Jump-803",
                                                            "score": 4,
                                                            "created_utc": 1653059747.0,
                                                            "response": "Never had problems with that, I think the problem is that the app doesn't show you directly the wallet address to copy, but instead a qr code (that has the wallet address).\n\nI have my chivo wallet address in my favorites list, so I don't have to worry about typos or wrong address. I receive monthly paychecks there, I usually get paid on online platforms like paypal and then just buy btc to my chivo wallet (and convert back to usd in seconds)\n\nThen I just go to the atm to cash out my money, this flow is much more cheaper for me, because if I send the money directly to my bank last time they charged me like 10-15% of it, that's crazy",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9c9i9r",
                                                                    "author": "GibbsSamplePlatter",
                                                                    "score": 4,
                                                                    "created_utc": 1653060654.0,
                                                                    "response": "So to be clear:\n1) you do work\n2) get paid in paypal\n3) buy btc and send to your chivo\n4) convert to USD \n5) cash out via ATM\n?\n\nInteresting to hear a day to day real life use case",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9cb5jz",
                                                                            "author": "Deep-Jump-803",
                                                                            "score": 5,
                                                                            "created_utc": 1653061305.0,
                                                                            "response": "Yeah, basically that. I don't know how people use it locally but in my case is pretty useful as an international worker",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        },
                                                                        {
                                                                            "id": "i9cmzqx",
                                                                            "author": "ryanlmcl0101",
                                                                            "score": 1,
                                                                            "created_utc": 1653065951.0,
                                                                            "response": "I did not realize paypal allows you to send btc anywhere?",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "i9fqqyk",
                                                                    "author": "rhelwig7",
                                                                    "score": 2,
                                                                    "created_utc": 1653130694.0,
                                                                    "response": "Repeated use of the same address is a misuse of bitcoin. You should avoid using an address that you have sent funds from. The reason is that now the public key for that address is exposed (on the blockchain) and so the security is less.\n\nA good wallet should give you a new address each time you ask to show a receive address. (But I do know we're talking about Chivo :-) )",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9fzdsu",
                                                                            "author": "Deep-Jump-803",
                                                                            "score": 1,
                                                                            "created_utc": 1653136811.0,
                                                                            "response": "Didn't know that, thanks, maybe Chivo can implement that in the future",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "i9c7bww",
                                                                    "author": "Deep-Jump-803",
                                                                    "score": 1,
                                                                    "created_utc": 1653059792.0,
                                                                    "response": "I think the qr code is for being used from chivo-to-chivo",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9bo7m4",
                            "author": "Scholes_SC2",
                            "score": 8,
                            "created_utc": 1653051763.0,
                            "response": "Why no just use something like phoenix wallet?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9cpz5n",
                    "author": "tbuffum",
                    "score": 5,
                    "created_utc": 1653067149.0,
                    "response": "It's good to see the countries are adopting or at least understanding the crypto",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9c3w22",
                    "author": "mpbh",
                    "score": 2,
                    "created_utc": 1653058411.0,
                    "response": "You can still use USD",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9codxh",
                    "author": "TheBitBoy",
                    "score": 2,
                    "created_utc": 1653066505.0,
                    "response": "Amazing",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9dpt14",
                    "author": "keypusher",
                    "score": 2,
                    "created_utc": 1653083355.0,
                    "response": "feels a little desperate in here",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9e3eqg",
                    "author": "ShaneTwenty20",
                    "score": 2,
                    "created_utc": 1653090034.0,
                    "response": "Epic !",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9cjo0x",
                    "author": "DelmonicoSteaks",
                    "score": 2,
                    "created_utc": 1653064644.0,
                    "response": "Truly inspiring",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9bpn5z",
                    "author": "JSammut29",
                    "score": 1,
                    "created_utc": 1653052420.0,
                    "response": "this is **YUUUUUUUGE**\n\nBig Up!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9cebno",
                            "author": "whittycakes",
                            "score": 1,
                            "created_utc": 1653062554.0,
                            "response": "RIP Billy",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9bym15",
                    "author": "ibeforetheu",
                    "score": 1,
                    "created_utc": 1653056284.0,
                    "response": "Publicity stunt",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9bzsx5",
                            "author": "Marcion_Sinope",
                            "score": 11,
                            "created_utc": 1653056771.0,
                            "response": "Just like when the wheel was invented.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9e3w1y",
                            "author": "headgsket",
                            "score": 3,
                            "created_utc": 1653090282.0,
                            "response": "Doesn't matter what it is but it should be appreciated for us",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9c8j7p",
                            "author": "Fabtacular1",
                            "score": 1,
                            "created_utc": 1653060267.0,
                            "response": "Yeah, it was really eye-opening when I watched the Line Goes Up video and he was explaining how all those “Bitcoin Accepted Here” stickers on shops in pictures on social media were mostly out there by BTC-promoting tourists trying to “fake it til you make it” with BTC adoption in general commerce. \n\nIt also makes sense, in retrospect, why most of those pictures were in remote places / third world countries. Harder for people online to call it out as fake when the place in question is “a shop outside Nairobi” instead of a specifically identifiable place in a major city. \n\nAnd like, duh, of course nobody is going to want to use BTC in commerce. Its strongest proponents bang the drum continuously about how the price is only going up. So either you don’t believe in BTC, and therefore you don’t spend any because you don’t have any. Or you do believe in BTC, and so you don’t spend any because you believe it will only be more valuable in the future. \n\nThe commerce angle is just a non-starter, I think.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9d5a0a",
                                    "author": "Rokey76",
                                    "score": 1,
                                    "created_utc": 1653074016.0,
                                    "response": "\"What's for dinner tonight?\"\n\n\"We can only afford Ramen tonight, I'm afraid. However, Elon just tweeted about Bitcoin so surely we can have steak tomorrow.\"\n\nGood luck with an economy like that.\n\n\"Nah, I'm not going to buy it today cause it could be half the cost tomorrow.\"\n\n\"Yeah, but then I might not be selling it tomorrow for the same reason.\"\n\n\"We'll see who blinks first.\"",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9d5z84",
                                            "author": "Fabtacular1",
                                            "score": 3,
                                            "created_utc": 1653074344.0,
                                            "response": "To be fair, the hardcore proponents would argue that price fluctuations against the USD are irrelevant once everyone has adopted BTC.\n\nThe issue is that I don't see any way to get from here to there, even if that was desirable.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9cakx5",
                                    "author": "zfride",
                                    "score": 1,
                                    "created_utc": 1653061079.0,
                                    "response": "you can only \"not spend your bitcoin\" if you're cheating and using fiat too.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9c926m",
                                    "author": "ibeforetheu",
                                    "score": -2,
                                    "created_utc": 1653060479.0,
                                    "response": "Yeah but everyone keep downvoting these comments, keep it up. The only thing that isn't up is the value of your purchasing power babyyyhy the casino ride has ended and it's time to leave",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9c849e",
                    "author": "Proxi98",
                    "score": -1,
                    "created_utc": 1653060102.0,
                    "response": "It almost bankrupted them and you still celebrate this application? I like crypto, but this ain’t the example you’re looking for.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9cbv3m",
                            "author": "zfride",
                            "score": 3,
                            "created_utc": 1653061588.0,
                            "response": "how can a 2% investment brankrupt you?\n\n[sauce](https://www.thismorningonchain.com/articles/bitcoin/how-much-bitcoin-does-el-salvador-really-have-2/)",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9f6a51",
                                    "author": "DirectLTC",
                                    "score": 1,
                                    "created_utc": 1653112488.0,
                                    "response": "I think he has to pay in negative lol, 2% is not the bankruptcy for us",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9chvkh",
                                    "author": "Proxi98",
                                    "score": -7,
                                    "created_utc": 1653063951.0,
                                    "response": "2% are a lot lmao.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9ekvjj",
                            "author": "lrpedropires",
                            "score": 1,
                            "created_utc": 1653099241.0,
                            "response": "You only watch crypto as investment class but it has much more to do",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9d0x9q",
                    "author": "Runktar",
                    "score": -1,
                    "created_utc": 1653071954.0,
                    "response": "Isn't the country currently pretty much bankrupt because of the bitcoin reliance?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9dmtue",
                    "author": "drbigtoe",
                    "score": 0,
                    "created_utc": 1653081971.0,
                    "response": "the project is still a massive failure and causing a great deal of hardship for the population. A good concept, but premature at best given the economic status of the country. Even worse considering how much the country bought at all time highs.....",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9cqxwf",
                    "author": "SlvrMedalist",
                    "score": 1,
                    "created_utc": 1653067541.0,
                    "response": "well done for continuing what they started, because I doubted that they would develop Bitcoin policy.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ctf7u",
                    "author": "BitcoinFan1239",
                    "score": 1,
                    "created_utc": 1653068552.0,
                    "response": "lol what is this",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9dw4j6",
                            "author": "flows0me",
                            "score": 2,
                            "created_utc": 1653086378.0,
                            "response": "It's a picture of countries that want to adopt crypto",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9cuh91",
                    "author": "Somnial",
                    "score": 1,
                    "created_utc": 1653068999.0,
                    "response": "It’s weird to see these images because the only parts of El Salvador that I’ve seen my family live in are mostly out in the country side",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9cykrr",
                    "author": "phileo",
                    "score": 1,
                    "created_utc": 1653070858.0,
                    "response": "The one down on the left is a pretty hot central bank",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9czqgs",
                    "author": "traphouse2stackhouse",
                    "score": 1,
                    "created_utc": 1653071399.0,
                    "response": "Wut doin’ now?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9d1iu5",
                    "author": "Vigilias",
                    "score": 1,
                    "created_utc": 1653072232.0,
                    "response": "This is like Elon inviting Chevron and Exxon execs to drive his electric cars.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9d2to1",
                    "author": "jonesocnosis",
                    "score": 1,
                    "created_utc": 1653072851.0,
                    "response": "I wonder how much El Zonte's economy has benefited from the recent Bitcoin tourism. \n\nAre they building infrastructure, roads, houses, plumbing, electrical, internet, etc... ?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9dzvo8",
                            "author": "BitcoinUser263895",
                            "score": 1,
                            "created_utc": 1653088232.0,
                            "response": "> Are they building infrastructure, roads, houses, plumbing, electrical, internet, etc... ?\n\nIn El Salvador? With Bukele in complete and total control? Spending on real things? lol",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9d9xfk",
                    "author": "reddit_iz_rad",
                    "score": 1,
                    "created_utc": 1653076105.0,
                    "response": "What countries?! Is there supposed to be a link to an article or something? All I see is a random image",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9dchzp",
                    "author": "Snoo81200",
                    "score": 1,
                    "created_utc": 1653077249.0,
                    "response": "i hope they withdrawing lol",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9dzqy1",
                    "author": "BitcoinUser263895",
                    "score": 1,
                    "created_utc": 1653088166.0,
                    "response": "If only there was any press in the county we might have something other than Bukele's promo photos.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9efsm4",
                    "author": "AtomicFurion",
                    "score": 1,
                    "created_utc": 1653096617.0,
                    "response": "Why are they all stuck to 1/wallet?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9et33i",
                    "author": "sleeknub",
                    "score": 1,
                    "created_utc": 1653103725.0,
                    "response": "US federal government did Bitcoin a huge favor when they decided to seize Russian central bank reserves.  These 44 countries were paying attention.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ewskh",
                    "author": "candyclown1",
                    "score": 1,
                    "created_utc": 1653105893.0,
                    "response": "Now this is what am talking about",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9f4xhz",
                    "author": "AncapHodl",
                    "score": 1,
                    "created_utc": 1653111453.0,
                    "response": "Can anyone tell me who the individuals in these images are, the bottom left one in particular if possible? Thanks.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9fayae",
                    "author": "Emanuelsil",
                    "score": 1,
                    "created_utc": 1653116385.0,
                    "response": "Adoption",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9fazmm",
                    "author": "Emanuelsil",
                    "score": 1,
                    "created_utc": 1653116415.0,
                    "response": "Let’s all hope that 20 years from now there will be no banks at all",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9fjfas",
                    "author": "X_Fiery_Jack_X",
                    "score": 1,
                    "created_utc": 1653124032.0,
                    "response": "Sell now buy bullets or gold",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9fjflx",
                    "author": "X_Fiery_Jack_X",
                    "score": 1,
                    "created_utc": 1653124041.0,
                    "response": "Or and gold",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9fmgje",
                    "author": "realabrar",
                    "score": 1,
                    "created_utc": 1653126902.0,
                    "response": "El Salvador expects great success in the future",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9cjd7q",
                    "author": "Upper-Question-4962",
                    "score": -3,
                    "created_utc": 1653064528.0,
                    "response": "Vacation on tax payers money, Majority of the people from the countries of this 44 leaders are already suffering.\n\nCould have done everything via online conference and saved tax payers dollars. But ofcourse photo op won't be that good which is the only think most of this nuts care for.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9efkau",
                            "author": "hamletgr",
                            "score": 1,
                            "created_utc": 1653096491.0,
                            "response": "Their inflation is going up at high rate, and they are going to adopt crypto",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9eg12a",
                                    "author": "Upper-Question-4962",
                                    "score": 1,
                                    "created_utc": 1653096745.0,
                                    "response": "Bitcoin can help them with inflation for sure but underlying corruption is the root cause of many of their problems. Bitcoin can't help much their in those countries as every avenue is gate keeper by this leaders",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9ev5uv",
                            "author": "namelesscreature0",
                            "score": 1,
                            "created_utc": 1653104909.0,
                            "response": "The advantages of open crypto far outweight travel cost.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9evj4r",
                                    "author": "Upper-Question-4962",
                                    "score": 1,
                                    "created_utc": 1653105131.0,
                                    "response": "I truly wish that was true.\nMy guess is that as soon as this nuts figure out crypto works after this meetup, They will use it for their corrupt practices as crypto provide nice psuedo anonymity",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9d93l5",
                    "author": "jake13122",
                    "score": -1,
                    "created_utc": 1653075743.0,
                    "response": "https://www.wsj.com/articles/crypto-meltdown-exposes-hollowness-of-its-libertarian-promise-11652875201",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}