{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ur0nh8",
            "title": "This is how to understand the difference between Gold and Bitcoin as money in a digital world.",
            "url": "https://www.reddit.com/r/Bitcoin/comments/ur0nh8/this_is_how_to_understand_the_difference_between/",
            "author": "slvbtc",
            "created_utc": 1652720493.0,
            "score": 11,
            "num_comments": 6,
            "subreddit": "Bitcoin",
            "selftext": "Its 2022 and much of life is digital and internet based. Were not going back to physical gold coins, the world needs digital payments and digital money.\n\nMany gold proponents say gold can be used on the internet by making a gold backed digital payments system or gold backed crypto.\n\nHeres a very simple analogy.\n\nGold can be represented digitally and sent digitally by way of a gold backed centralised digital payments system, but that gold is not digitally native. Bitcoin is digitally native.\n\nSimilarly; a letter can be represented digitally and sent digitally by way of a fax machine, but a fax machine and the letter sent over that fax machine is not digitally native. Email is digitally native.\n\nBitcoin is like email and a trying to use gold over the internet is like using a fax machine.\n\nGold is not digitally native, bitcoin is.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8uaung",
                    "author": "satoshishash",
                    "score": 5,
                    "created_utc": 1652720930.0,
                    "response": "I like this. \n\nI also think it could be taken a step further to explain the benefits of being native?\n\nFor example, while gold tied to digital accounts could work (and does in many cases) it STILL creates unnecessary steps in between.. ripe for corruption and inefficiency.\n\nBitcoin is most efficient and secure method of accounting and transferring value.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ucwtd",
                    "author": "benditbackwards",
                    "score": 2,
                    "created_utc": 1652721753.0,
                    "response": "Your point is well made, I'd like to add too that gold proponents saying that gold can be used on the internet with a digital token is flawed and will not work since that is basically how fiat started.  The problem with digital gold is the same as with all the stable coins and fiat, there is counter party risk and it is centralized.  You have to trust (hence the risk) that a centralized authority will keep the precious asset safe that backs your digital token.  \nThat is the principle difference between those other forms of money and Bitcoin, in Bitcoin you don't have to trust, you can verify. (i.e. consult the public blockchain)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8v9zhk",
                    "author": "wetwoodfloors",
                    "score": 1,
                    "created_utc": 1652735127.0,
                    "response": "IMO Gold is more so represented as a letter being sent in the mail vs. bitcoin is an email.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8vdj2o",
                    "author": "Longjumping-Low3164",
                    "score": 1,
                    "created_utc": 1652736633.0,
                    "response": "Gold exists in physical form. ANY digital form of gold is \"trust 3rd party\". Bitcoin exists in digital form.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8wk5z9",
                    "author": "ShabbaLaFlare",
                    "score": 1,
                    "created_utc": 1652757452.0,
                    "response": "Gold is old simple as that",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ur0wws",
            "title": "Bitcoin ETF!",
            "url": "https://twitter.com/naiivememe/status/1525859621885292545?s=20&t=moCRNAnk6JXclSxfI6b7KQ",
            "author": "jibberdidee",
            "created_utc": 1652721193.0,
            "score": 2,
            "num_comments": 1,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": []
        }
    ]
}