{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "7tn2wa",
            "title": "Any sites that don't require ID?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/7tn2wa/any_sites_that_dont_require_id/",
            "author": "Swiftiezz",
            "created_utc": 1517173336.0,
            "score": 18,
            "num_comments": 26,
            "subreddit": "BitcoinBeginners",
            "selftext": "I have been on sites like coinbase and localbitcoins, looking to buy some coins, but they both want me to upload an ID, is there any site that doesn't require me to upload an ID?",
            "stickied": false,
            "comments": [
                {
                    "id": "dtdqv96",
                    "author": "Groawler",
                    "score": 6,
                    "created_utc": 1517175842.0,
                    "response": "Most of them require id if you want to withdraw ",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "dtdvkbt",
                    "author": "NoEtherNoCry",
                    "score": 2,
                    "created_utc": 1517181120.0,
                    "response": "I’ve bought quite a bit of crypto on Coinbase with no ID. Transactions have been as large as $7500 USD so far and they only have my name and email.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "dtec9z3",
                            "author": "jthawks",
                            "score": 1,
                            "created_utc": 1517200258.0,
                            "response": "They didn't ask for my ID either, but they have my bank account and I just opened my account this month.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "dte1ppk",
                    "author": "CoyotaTorolla",
                    "score": 2,
                    "created_utc": 1517188004.0,
                    "response": "Binance doesn't require verification for anything less than 2 BTC withdrawal per day (I think). ",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "dte3khg",
                            "author": "Goutham_Speaks",
                            "score": 1,
                            "created_utc": 1517190065.0,
                            "response": "right.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "dtdwdrt",
                    "author": "howsclark",
                    "score": 1,
                    "created_utc": 1517182018.0,
                    "response": "If you are looking to buy with fiat, not that I know of. You could alway go direct and use localbitcoin.com or a meetup group. If you’re looking to trade bitcoin for alts, you have more option. Check out kucoin for one, they have many options to choose from and you can literally get started in a few minutes. Good luck. ",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "dtdy3sz",
                    "author": "thomask02",
                    "score": 1,
                    "created_utc": 1517183886.0,
                    "response": "It's not required if you're buying with cash and in person on localbitcoins/paxful",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "dtegq5b",
                    "author": "kryptotin",
                    "score": 1,
                    "created_utc": 1517207571.0,
                    "response": "Try liberalcoins.com\nIt’s like localbitcoins.com but without any verification process and it offers more currencies.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "dte0kxr",
                    "author": "Brbcrypto",
                    "score": 0,
                    "created_utc": 1517186742.0,
                    "response": "giving out your ID to these sites might come as a surprise to a beginner but in the crypto world you give out your ID more than your username. They all want your ID and after you pop you ID sharing cherry you'll be giving it to anything that asks for it even the dodgiest looming sites that look like they're from 20 years ago ",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "dtedmda",
                            "author": "Swiftiezz",
                            "score": 2,
                            "created_utc": 1517202211.0,
                            "response": "Aren’t you afraid of identity theft and similar risks?",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "dtegusn",
                            "author": "butanebraaap",
                            "score": 1,
                            "created_utc": 1517207821.0,
                            "response": "Thats just stupid",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "dte1uwz",
                    "author": "marketcrashmoney",
                    "score": 0,
                    "created_utc": 1517188162.0,
                    "response": "this one doesn't...\nBest Bitcoin Futures and alt coins  Futures Trading Platform in the world! Incredible volume, simplicity of use, low fees, trade with margin upto 100 times! No minimum deposit to start trading. Account set up takes 2 minutes. No crazy lengthy verifications like everywhere else. Transfer bitcoin and trade in just a few minutes. Absolutely amazing! 1 contract equals $1 usd. Minimum position to open is only 1 contract. \n\n-Short as much as you want! \n\n-Excellent execution! \n\n-Trade Futures on many altcoins!\n\n-Low fees and margin costs!\n\n-Super easy to use!\n\n-Just transfer bitcoin and start trading! \n(if need to buy bitcoin to fund your trading account just text me at the number at the bottom and I 'll try to help)\n\n-24/7 the exchange never closes!\n\n-largest and most reliable Bitcoin Trading Platform in the world.\n\n-240,000,000 daily volume of contracts traded each day. Huge liquidity.\n\n-Use my affiliate link and get 10% off of already low commissions.\n\n THIS IS AN INTERNATIONAL EXCHANGE AND YOU WILL NEED A VPN SERVICE TO ACCESS IT IF YOU ARE LOCATED IN THE UNITED STATES.\nSTEP 1. There is a small secret to activate your account in the states. You will first need to install a DEDICATED VPN. Select Japan or Any country in Europe, say the Chezh Republic. Here’s a link for the cheapest dedicated VPN service (4.99 to 11.99 month, make sure you select “dedicated” service):\nhttps://portal.myip.io/client-area/aff.php?aff=62\n STEP 2. After VPN is installed connect to internet using it and goto: https://www.bitmex.com/register/w5tXlu\n Register your account and start trading in less than 2 minutes! Thanks you can also text me or call me at 3864ninezero43ninezero with any questions or to say thanks! You will love this platform. ",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "dtdpgc7",
                    "author": "Orionaux",
                    "score": -2,
                    "created_utc": 1517174317.0,
                    "response": "Robinhood, once they roll it out of you get on the list, and if you meet their requirements for first round of users. \n\nYou do have to submit your name, address, and SSN though so it still might be what you are looking for. ",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}