{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "t1zq9c",
            "title": "A Two of Two Wallets (but just one mnemonic)",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/t1zq9c/a_two_of_two_wallets_but_just_one_mnemonic/",
            "author": "planet_hallows",
            "created_utc": 1645889677.0,
            "score": 3,
            "num_comments": 21,
            "subreddit": "BitcoinBeginners",
            "selftext": "Can I use the same wallet with two different wallet softwares? Any risks/cautions about that?\n\nBitPay gave me a hard time getting my ID verification approved, so I used the Mnemonic they generated to import my wallet into Electrum. Worked great and I've already paid for things via Electrum. However, my BitPay balance now shows 0, while Electrum shows the correct remaining balance on one of the change addresses of my wallet.\n\nBitpay's next receive address matches the next unused receive address in Electrum, so I'm confident they're working with the same wallet. But shouldn't Bitpay scan at least the first 20 receive and change addresses from the wallet to discover any balances? Is this just a deficiency of Bitpay, or do all wallets work that way? Is it a bad idea to use the same wallet/master key with two different wallet softwares, even if they're both BIT39-compatable?\n\nNow Bitpay says the resolved the ID verification issue (their support isn't quick, but they do respond). So now I'm mad that I'll have to pay the miners \\~700 SAT for Bitpay to recognize the BTC that's already in what should be the same wallet.",
            "stickied": false,
            "comments": [
                {
                    "id": "hyj72g4",
                    "author": "Narmotur",
                    "score": 3,
                    "created_utc": 1645894712.0,
                    "response": "You can use the same mnemonic with two wallets, assuming they both aren't shit. Seems like the Bitpay one is shit. Good luck!",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ssl1tb",
            "title": "Is Paypal a good place to buy bitcoin?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/ssl1tb/is_paypal_a_good_place_to_buy_bitcoin/",
            "author": "Hopeful-Brilliant572",
            "created_utc": 1644871969.0,
            "score": 3,
            "num_comments": 33,
            "subreddit": "BitcoinBeginners",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "hwyfkbo",
                    "author": "GoodBot88",
                    "score": 17,
                    "created_utc": 1644873041.0,
                    "response": "No.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hwyqje0",
                    "author": "12_nick_12",
                    "score": 5,
                    "created_utc": 1644878438.0,
                    "response": "No, I like and use the strikeapp",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hwydhp0",
                    "author": "hyperactiveanonymous",
                    "score": 3,
                    "created_utc": 1644872202.0,
                    "response": "Read the subreddit about section or pinned posts. Explains all.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hwyebds",
                    "author": "bitusher",
                    "score": 5,
                    "created_utc": 1644872533.0,
                    "response": "https://www.reddit.com/r/BitcoinBeginners/search?q=paypal&restrict_sr=on&include_over_18=on",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hwydi7s",
                    "author": "BigPapiInDaHouse",
                    "score": 3,
                    "created_utc": 1644872207.0,
                    "response": "By your question I'm assuming you're barely getting into crypto. If you don't want to go through the hassle of getting it in an exchange, then yes, you can get it on paypal. Just be careful with the fees",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hwyft60",
                    "author": "geogrant1000",
                    "score": 3,
                    "created_utc": 1644873141.0,
                    "response": "NO!",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ui92n9",
            "title": "Is it viable to just get a big loan and dump it all into bitcoin?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/ui92n9/is_it_viable_to_just_get_a_big_loan_and_dump_it/",
            "author": "FamiliarKnowledge289",
            "created_utc": 1651677809.0,
            "score": 5,
            "num_comments": 95,
            "subreddit": "BitcoinBeginners",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i7azien",
                    "author": "bitusher",
                    "score": 28,
                    "created_utc": 1651679123.0,
                    "response": "Keep in mind that this bear market can last another 1 to 1.5 years. Also even if it does work out for you this is programming your mind to make ill advised and risky investment choices\n\n\nI would not do this\n\n\nIf you do , at least make sure the interest rate is below 5% for the loan",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7awoe1",
                    "author": "rraattbbooyy",
                    "score": 62,
                    "created_utc": 1651677966.0,
                    "response": "Unwise, as you can never guarantee your rate of return will be greater than the interest rate on your loan.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7b2ikb",
                    "author": "DudeIncogneto",
                    "score": 19,
                    "created_utc": 1651680401.0,
                    "response": "No, that is a terrible idea and a good way to wreck yourself",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7b3rn4",
                    "author": "armywhiskers",
                    "score": 15,
                    "created_utc": 1651680936.0,
                    "response": "Better check yourself before you wreck yourself",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7b1o00",
                    "author": "sebreg",
                    "score": 8,
                    "created_utc": 1651680034.0,
                    "response": "Depends if you can pay back the loan even if btc gets crushed, then it's not as crazy. But personally I would never buy a volatile asset on credit especially in difficult market conditions where liquidity is drying up. I say this as a longterm believer in btc.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7bi1ey",
                    "author": "Boutitj",
                    "score": 9,
                    "created_utc": 1651686503.0,
                    "response": "We did it when BTC was around $4k. Just got lucky I guess.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7b967y",
                    "author": "thecryptovantage",
                    "score": 6,
                    "created_utc": 1651683066.0,
                    "response": "We would certainly not recommend to do so. Just DCA into Bitcoin with money you can afford to lose.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7b0s0p",
                    "author": "crypto_crypto_guy",
                    "score": 21,
                    "created_utc": 1651679659.0,
                    "response": "If you can afford to lose it all, then yes, otherwise - no.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7c3nzx",
                            "author": "naturr",
                            "score": 7,
                            "created_utc": 1651694935.0,
                            "response": "If you're getting a loan then you obviously don't have the money to lose.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7bb22x",
                    "author": "ToffielMia",
                    "score": 4,
                    "created_utc": 1651683795.0,
                    "response": "Of course not. The main rule of investments - is don't spend more, than you can afford to lose. BTC may stay at the same price or fall for a year or more, and you'll not be able to sell it and get more money than you loaned. I spend about 10% of my salary every month on Bitfinex and that's enough I think.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7bepyw",
                    "author": "Delicious-Exit-7478",
                    "score": 4,
                    "created_utc": 1651685219.0,
                    "response": "This is stupid, why get a loan just to buy bitcoin, you realize you'd have to pay it back eventually..",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7bkhx9",
                            "author": "MrQ01",
                            "score": 4,
                            "created_utc": 1651687456.0,
                            "response": "I think OPs intention is to get a fiat loan to buy Bitcoin, on the expectation it would appreciate in value. Either they just pay the interest rate, or else eventually sell a portion of their newly appreciated Bitcoin and pay off the loan, leaving them with the rest of the Bitcoin at no cost besides loan fees.\n\nIn practice it's an extremely risky strategy. But let's not assume it to be a senseless one.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7diz9i",
                    "author": "lotta_lola559",
                    "score": 3,
                    "created_utc": 1651716758.0,
                    "response": "uh? No. do not do that.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ui7fvr",
            "title": "PSA: Secure your Bitcoin - 2FA",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/ui7fvr/psa_secure_your_bitcoin_2fa/",
            "author": "information-zone",
            "created_utc": 1651673340.0,
            "score": 27,
            "num_comments": 68,
            "subreddit": "BitcoinBeginners",
            "selftext": "I’m sure the veterans in here already know this, so this is for any actual Beginners reading this sub.\n\nOnce you start to accumulate BTC, you should worry about scammers trying to trick you out of your Bitcoin.\n\nYou thought your Bitcoin was safe on the exchange because you turned on 2FA with an SMS as the second factor, but no.  \n\nOne thing that really does happen is a SIM-swap attack. This is where the thieves trick the phone company into issuing a new SIM for your number & they then use that to reset your password on the exchange, stealing all your Bitcoin.\n\nYou should get a hardware device, like a Yubikey, and use that for the 2FA. Most emails and many other financial institutions support these devices also. Turn it on everywhere. And to be smart, you should have a backup of that key… so buy two.\n\nI decided to post this today because Yubikey is running a promo today where you can get 2 for the price if one.\n\nIf you haven’t considered Yubikey before, consider it today.\n\nI am not affiliated with Yubikey in anyway. I am just a fan of their products.\n\n\nhttps://www.yubico.com/store/2022/may-the-4th",
            "stickied": false,
            "comments": [
                {
                    "id": "i7anq8a",
                    "author": "CSDude01",
                    "score": 10,
                    "created_utc": 1651674374.0,
                    "response": "Most exchanges don't use 2FA via SMS, so SIM-swapping doesn't work. An authenticator like Authy or Google Authenticator is much safer than SMS-2FA, but a security key is the safest one, obviously.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7apiiw",
                            "author": "information-zone",
                            "score": 6,
                            "created_utc": 1651675113.0,
                            "response": "All of the US-based exchanges I’ve used offered SMS-based 2FA (when I first signed up)\n- Coinbase\n- Gemini\n- crypto.com\n- River",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i7bo8d9",
                            "author": "Simcom",
                            "score": 4,
                            "created_utc": 1651688914.0,
                            "response": "Just a reminder, Authy is susceptible to sim swap attacks unless you manually go into the settings and disable \"Allow multi-device\". If \"Allow multi-device\" is on, it's essentially the same as SMS 2FA and will automatically migrate to any new phone.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7anoyf",
                    "author": "KallistiOW",
                    "score": 11,
                    "created_utc": 1651674358.0,
                    "response": "Don't leave your coins on exchanges.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7apao2",
                            "author": "information-zone",
                            "score": 8,
                            "created_utc": 1651675025.0,
                            "response": "Not everyone is ready for self-custody, but that is the ideal. Everyone should strive for self-custody!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7cddmi",
                                    "author": "NeuroLingual",
                                    "score": 7,
                                    "created_utc": 1651698712.0,
                                    "response": "I’m going to get downvoted but self-custody doesn’t give interest and Bitcoin has been trading sideways all year.\n\nI’ll take on the risk.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i7cn74i",
                                            "author": "lordsamadhi",
                                            "score": 6,
                                            "created_utc": 1651702617.0,
                                            "response": "Won't downvote you, but I'd like to encourage you and others to look into all the other reasons to be part of this revolution beyond only number-go-up.  Bitcoin is more like a charity than an investment to me.  Let's change the world for the better!",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i7anqe8",
                    "author": "valoremz",
                    "score": 5,
                    "created_utc": 1651674376.0,
                    "response": "How would the scammer know your phone number to begin with? \n\nIt seems like they would need a ton of info to make this happen: \n\nFirst the email address you use to login to the exchange and also your password. I guess they could get this from a data breach.\n\nTwo, when the 2FA prompt pops up, it will send something you phone. At this stage, the scammer would need to know your phone number. How would they know it?\n\nThree, assuming they know your phone number, they call the phone company to do the SIM swap, but the phone company is going to ask for your name, address, and probably your PIN (Verizon does this). I don't know how the scammer would have all this info.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7aoxcf",
                            "author": "bitusher",
                            "score": 8,
                            "created_utc": 1651674872.0,
                            "response": ">How would the scammer know your phone number to begin with? \n\nOne of many examples that is not a hypothetical is the ledger leak \n\n>but the phone company is going to ask for your name, address, and probably your PIN (Verizon does this). I don't know how the scammer would have all this info.\n\nThese aren't hypothetical attacks , they do happen all the time with social engineering or the employees themselves",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "ui1p54",
            "title": "App to trade",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/ui1p54/app_to_trade/",
            "author": "FlimsyIce2457",
            "created_utc": 1651651975.0,
            "score": 7,
            "num_comments": 41,
            "subreddit": "BitcoinBeginners",
            "selftext": "Hi, I would like to ask if there is app that does not constraint the amount of bought bitcoin. I looked at binance on euro currency. I have to pay at least 35 euro to buy crypto. Do you know app that does not have such constraints?",
            "stickied": false,
            "comments": [
                {
                    "id": "i79pxrk",
                    "author": "bitusher",
                    "score": 3,
                    "created_utc": 1651653825.0,
                    "response": "I would use Kraken.com instead as the withdrawal fees are much lower at 0.00002 BTC onchain or Free with a lightning withdrawal",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i79verl",
                    "author": "Faceless1820",
                    "score": 3,
                    "created_utc": 1651658674.0,
                    "response": "You will always have to pay a fee to buy bitcoin. Some exchanges have higher fees than others. You'll have to research what exchanges are available to you.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i79vxe3",
                            "author": "bitusher",
                            "score": 1,
                            "created_utc": 1651659113.0,
                            "response": ">You will always have to pay a fee to buy bitcoin. \n\nThis isn't necessarily true. I can buy bitcoin for pennies",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i79w4nh",
                                    "author": "Faceless1820",
                                    "score": 2,
                                    "created_utc": 1651659282.0,
                                    "response": "I would argue the pennies you pay are a fee for buying.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i79waga",
                                            "author": "bitusher",
                                            "score": 2,
                                            "created_utc": 1651659413.0,
                                            "response": "Sorry , I misread your statement to say \"high fee\" , its late. You are right",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i79ntm5",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1651651976.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i79ntmn",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1651651976.0,
                    "response": "For trading related topics, there is also /r/bitcointrading\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i79owuy",
                    "author": "Jon_Hodl",
                    "score": 1,
                    "created_utc": 1651652924.0,
                    "response": "It depends on what you’re trying to do but you should be able to buy bitcoin in the EU with Relai and the fees should be much less than €35.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7a6jun",
                    "author": "anonymustanonymust",
                    "score": 1,
                    "created_utc": 1651666254.0,
                    "response": "Kraken I think allows you to buy 0.00002 minimum orders",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7ab5ys",
                    "author": "BlockchainPyro",
                    "score": 1,
                    "created_utc": 1651668693.0,
                    "response": "Coinbase",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7ait2r",
                    "author": "Luxuriosa_Vayne",
                    "score": 1,
                    "created_utc": 1651672273.0,
                    "response": "I'm also a newbie. Bought 3 times now on Coinbase pro. SEPA deposit (bank transfer) was free to put in currency.\n\nBitcoin buying itself has very tiny fee and so was withdrawal.\n\nFor me kraken had higher fees to deposit (end up getting less bitcoin) so I never tried it",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7b2z0r",
                    "author": "squishfacedog",
                    "score": 1,
                    "created_utc": 1651680597.0,
                    "response": "I was shocked that binance took an entire 5% of what I deposited to buy bitcoin with, when it also requires me to buy such a large amount. Seemed way higher than what I was expecting and had heard about from others.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7mba85",
                    "author": "Chineyo",
                    "score": 1,
                    "created_utc": 1651882458.0,
                    "response": "Since you are in Europe then I think Blockbank will be the best option for you. There are no such constraints on the platform",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7no81o",
                    "author": "ApplicationNo5082",
                    "score": 1,
                    "created_utc": 1651913284.0,
                    "response": "I tried Binance. Like it",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7cnz07",
                    "author": "lordsamadhi",
                    "score": 0,
                    "created_utc": 1651702934.0,
                    "response": "Strike has the lowest fees out there.  I think Jack even said it's \"free\" to buy BTC on Strike.  Ive used a lot of other platforms and can confirm Strike is the cheapest",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}