{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uysijs",
            "title": "Global Elite in Davos Just Revealed Plan To Control Your Money",
            "url": "https://www.youtube.com/watch?v=ECZlcJz4QlM",
            "author": "simplelifestyle",
            "created_utc": 1653635289.0,
            "score": 0,
            "num_comments": 1,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "ia61l93",
                    "author": "afrosamuraiy",
                    "score": 1,
                    "created_utc": 1653636420.0,
                    "response": "Weak simplistic worldview. Dislike.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uysl6n",
            "title": "Live in Oslo: Jeff Booth on Bitcoin to Solve Our Debt Crisis",
            "url": "https://www.youtube.com/watch?v=n2hXIVOFepI",
            "author": "simplelifestyle",
            "created_utc": 1653635602.0,
            "score": 16,
            "num_comments": 7,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "ia7wdk3",
                    "author": "foxy-agent",
                    "score": 1,
                    "created_utc": 1653673576.0,
                    "response": "I did enjoy the question of “will there be debt and credit in a future with bitcoin.” I don’t think he answered it very well. Likewise, he said no-one has explained why we need inflation. \n\nTo simplify the problem of debt, credit and inflation, imagine if there are only 2 people in this example, say 2 children in a school yard. One of them has 50 marbles, and the other one has no marbles. The one without any marbles wants 5 marbles to play with (a loan) and promises to give them back later. To make it worth while, the child with the marbles wants “interest” on the 5 marble loan, and will lend 5 marbles if they get paid 6 marbles back. But there are only 50 marbles on the school yard, so where does the second child get a 6th marble from? The answer is, more marbles are added. This is the same thing as the central bank printing more money to pay back the debt that was created in society. \n\nNow, if we are to re-think of a society where there are only 21 million marbles, and there are 8 billion children in the school yard, how can anyone pay back the interest on a debt? \n\nEven if people only buy a house with savings and forgo mortgages and loans, businesses will still need capital and startup costs. I can’t see how society will function if you can’t get a loan because there is no incentive to make a loan if there is no way to pay back more than you have borrowed.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iacdel1",
                            "author": "orbag",
                            "score": 1,
                            "created_utc": 1653764815.0,
                            "response": "Well, in your example, the second child would use the 5 marbles to produce something that the first child is willing to pay 8 marbles for, afterwards the second child repays the 6 marbles and pockets the 2 remaining marbles as profit",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iacfg7f",
                                    "author": "foxy-agent",
                                    "score": 1,
                                    "created_utc": 1653765778.0,
                                    "response": "In your example, the marble loan is most closely related to a SBA (small business loan), which would allow someone to start or grow a business that “produces something that the first child is willing to pay 8 marbles for.” \nHowever, people take out loans for many reasons, for example to buy a house, to build an addition on their house, to buy a car, to pay for a wedding or  medical fees. In these cases there is no production of something that the lending party would value more than value of the original loan.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iacxbzf",
                                            "author": "orbag",
                                            "score": 1,
                                            "created_utc": 1653774284.0,
                                            "response": "Well, in that case, person B would buy a house with the 5 marbles and come to an agreement with person A that person B would work for person A for a compensation of 1 marble per month. Person B would work for person A for 6 months until his debt + interest is paid off",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "iackohe",
                            "author": "LucSr",
                            "score": 1,
                            "created_utc": 1653768297.0,
                            "response": "> I can’t see how society will function if you can’t get a loan because there is no incentive to make a loan if there is no way to pay back more than you have borrowed\n\nWhen the borrower Bob and the lender Luke are happy with the credit risk, the IOU can appear.  Assume the agreed interest is 0.012 per year and Bob and Luke initially have 1000 and 100 money:\nLuke: 990 money, 10 IOU (aka IOU asset) priced at 1.000 per unit\nBob: 110 money, -10 IOU (aka IOU debt) priced at 1.000 per unit\n\nLuke or the agreed calculation agent evaluates the unit price of the IOU monthly.  Say, when Bob has good progress, the unit price of the IOU becomes 1.001 and Bob earns 0.1 money thanks to the IOU's help on his business, and the statements after one month are:\nLuke: 990 money, 10 IOU (aka IOU asset) priced at 1.001 per unit.  Total value 1000.010 money\nBob: 110.1 money, -10 IOU (aka IOU debt) priced at 1.001 per unit. Total value 100.09 money\n\nOr, Bob may have a bad time:\nLuke: 990 money, 10 IOU (aka IOU asset) priced at 1.001 per unit.  Total value 1000.01 money\nBob: 109.9 money, -10 IOU (aka IOU debt) priced at 1.001 per unit.  Total value 99.89\n\nOr, even worse, Luke starts suspect Bob's credit:\nLuke: 990 money, 10 IOU (aka IOU asset) priced at 0.8 per unit.  Total value 998\nBob: 109.9 money, -10 IOU (aka IOU debt) priced at 0.8 per unit.  Total value 101.9\n\nBecause it always requires the same amount of energy to raise 1 kg higher 1 meter, the energy is the universal accounting base.  If the IOU is very long term that the money appreciates (due to economy expansion and constant money volume), then Bob and Luke can also agree a purchasing power (this is easy to estimate for PoW tokens) adjustment term in the contract:\nThe money's purchasing power is 1E+12 joules per unit at contract start and the money's purchasing power is 1E+13 joules per unit at contract end, then Bob only returns 1 money instead of 10 as the total principal.\n\nTo cope with the economy size, money shall either increase/decrease its volume if its purchasing power is defined to be constant or increase/decrease its purchasing power if its volume is defined to be constant.  The design of bitcoin chose the second approach because of technical difficulty of proportional distribution of tokens in the first approach.  You could imagine your bitcoin stash becomes x10 rather than its price becomes x10, both are mathematically equivalent.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iacl7pp",
                                    "author": "foxy-agent",
                                    "score": 1,
                                    "created_utc": 1653768565.0,
                                    "response": "Thank you for trying to explain it, but unfortunately I couldn’t follow",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}