{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ut6yf3",
            "title": "A question about hard forks and decentralization",
            "url": "https://www.reddit.com/r/Bitcoin/comments/ut6yf3/a_question_about_hard_forks_and_decentralization/",
            "author": "Graphenist",
            "created_utc": 1652976975.0,
            "score": 4,
            "num_comments": 8,
            "subreddit": "Bitcoin",
            "selftext": "That i know of, Bitcoin seems to be the only crypto that doesnt ever do hard forks. It only does soft forks. (And the difference i believe is hard forks break previous versions while soft forks do not...) Bitcoin *feels* a lot more decentralized than all the altcoin projects out there... But why?\n\nA) Is Bitcoin more decentralized because it *chooses* not to do hard forks? \n\nB) Is Bitcoin unable to do hard forks because its too decentralized in the first place?\n\nC) Are lack of hard forks and presence of decentralization just correlated, both caused by ossification and size of the project?\n\nD) Or is it something about the nature of Bitcoin that uniquely prevents hard forks?\n\nDifferent altcoiners have different theories, theyll like say for example that the Bitcoin devs simply refuse to let anyone do hard forks. But I think this is ridiculous, because nobody ordains them as Bitcoin devs but the compliance of the decentralized Bitcoin community...\n\nWhat is your theory? What is the relationship between decentralization and (lack of) hard forks?",
            "stickied": false,
            "comments": [
                {
                    "id": "i982km1",
                    "author": "dlq84",
                    "score": 3,
                    "created_utc": 1652980042.0,
                    "response": "There are many hard forks of Bitcoin, all of them has failed.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i97xgh9",
                    "author": "2xfun",
                    "score": 2,
                    "created_utc": 1652977997.0,
                    "response": "Read this: the Bitcoin Standard... Knowledge is power",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i97zrhi",
                    "author": "NiceDoctorBeam",
                    "score": 2,
                    "created_utc": 1652978919.0,
                    "response": "Bob sends 7 BTC to Alice.  No central authority was involved: No banks, nor government agencies/agents, nor corporations, nor third individual approved/settled/censored/denied the transaction.\n\nBitcoin is decentralized.  There is no central authority, no CEO to arrest, no small group to round up, no headquarters to search/seize/bomb/spy upon...\n\nThere is no central authority to dictate changes to Bitcoin.  Any changes are made by consensus.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i984xbe",
                    "author": "wolfofone",
                    "score": 2,
                    "created_utc": 1652980985.0,
                    "response": "Anyone can hard fork bitcoin. Doesn't mean their fork will be worth anything or that any BTC users on the main fork will switch to or use the new fork.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i98llpa",
                    "author": "krisycoll",
                    "score": 2,
                    "created_utc": 1652987771.0,
                    "response": "Bitcoin had hard forks. A hard fork have as result a different blockchain, so if you did not study some bitcoin history, you can't identify a hard fork by looking into the blockchain, because the hard fork is a different blockchain. Bitcoin had hard forks like Bitcoin Cash or Bitcoin Satoshi Vision (Bitcoin SV). \n\nA) Decentralization makes harder to find a global consensus, so things tend to stay in an status quo (if bitcoin is working well and the fork have no a big consensus, things will remain as they are). A hard fork can be made by you and 3 or 4 friends, but nobody will care. When a lot of people care, the hard fork is more famous, but if there is still no consensus, the hard fork will happen in a new blockchain, not in the current one. \n\nB) Bitcoin is able to do hard forks, but if a majority agree it will not be a fork, just a change, and if the majority do not agree, the fork will be a new blockchain, and not bitcoin blockchain. \n\nC) Bitcoin is a big monster difficult to change because it grow organically, without premines and without a person of influence, a CEO or a group of people saying what to do. Other coins can't say the same. So, taking into account that when you joined bitcoin you knew the rules and agree with it, once you are in there, there are little incentives to change that rules. And rules are the same for miner nodes, user nodes, developers, and everyone in bitcoin, each one with their own interest. And we all agree in the rules because bitcoin works! Why change it?\n\nD) Too big, pretty well decentralized and with a good incentive alignment for all the parts. If you want a change you will have to convince a lot of different people and that is really hard. \n\n&#x200B;\n\nEnglish is not my native language. Please correct what is wrong I'm learning! Thxs",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i97z65r",
                    "author": "Halo22B",
                    "score": 3,
                    "created_utc": 1652978682.0,
                    "response": "Bcash was a hardfork",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i992pv5",
                    "author": "sciencetaco",
                    "score": 1,
                    "created_utc": 1652995698.0,
                    "response": "A centralised altcoin can easily hard fork because the developers, leaders, and foundation/company coordinate with a small set of validators to do the hard fork. Everyone else is just along for the ride. \n\nBitcoin hard forks happen but the proponents of the fork need to gather support of the node operators and wider community in order for it to become the dominant fork. That won’t happen unless a hard fork is required for a very important reason.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}