{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "usg3i2",
            "title": "Vitalik says he wants his project to be more like BTC!",
            "url": "https://www.youtube.com/watch?v=Zlz1DmmdlwI",
            "author": "BHN1618",
            "created_utc": 1652889323.0,
            "score": 3,
            "num_comments": 9,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i937o1u",
                    "author": "WritingFun8769",
                    "score": 2,
                    "created_utc": 1652890425.0,
                    "response": "and here we have a prime example of the stupid smart person",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i936f9r",
                    "author": "Fun_Square_8737",
                    "score": 1,
                    "created_utc": 1652889907.0,
                    "response": "Well then he’s gotta burn some coins and stop producing more . Maybe then I’d feel safer investing in it, I don’t like investing in things where you can make more of them ie; US dollar",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9372e6",
                            "author": "BHN1618",
                            "score": 5,
                            "created_utc": 1652890176.0,
                            "response": "I don't think it's ever going to actually happen so BTC will win",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i93hxo4",
                    "author": "star1s3",
                    "score": 1,
                    "created_utc": 1652894541.0,
                    "response": "He's facing the fact that he's the inventor of the mother of all the shitcoins, generator of casino tokens and useless NFTs morally worth zero. I suppose it's hard to accept that things aren't going the way you wanted, but you can't let it go because you're too involved.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93lyq8",
                    "author": "makito_burgerito",
                    "score": 1,
                    "created_utc": 1652896164.0,
                    "response": "And POS is one step closer to BTC",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93mnoc",
                    "author": "Festortheinvestor",
                    "score": 1,
                    "created_utc": 1652896438.0,
                    "response": "Btc is impossible to recreate. Think about it, the launch was fair, there was no pre mine, people jumped in when they heard about it or when they were ready. \nThen the whole crypto industry turns up trying to mimic BTC or do something else, often something nobody needs.\n\nThe genie is out of the bottle, Bitcoin is the hardest money we’ve ever discovered/created and it is impossible to match it. \n\nOther cryptos will have use cases, but when it comes to money, bitcoin is and will always be king.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "usg2yi",
            "title": "Info on BTC Crime",
            "url": "https://www.reddit.com/r/Bitcoin/comments/usg2yi/info_on_btc_crime/",
            "author": "throwaway234234348",
            "created_utc": 1652889279.0,
            "score": 0,
            "num_comments": 16,
            "subreddit": "Bitcoin",
            "selftext": "I've been trying to make a post, but they haven't been approved. Maybe I was using some bad keywords.\n\nDoes anyone have info regarding the Tesla / BTC giveaway ploy? I understand if it'd be easier to just say I'm an idiot (and I agree), but this scam was aided by the video being recommended on my homepage. It looked legitimate at first glance.\n\nI know from reading posts over the last 10 years that everyone who participated is likely out of luck, but I wanted to try to reach out just in case. This is a multi-billion dollar facilitating this.",
            "stickied": false,
            "comments": [
                {
                    "id": "i936k9x",
                    "author": "Nada_Lives",
                    "score": 2,
                    "created_utc": 1652889965.0,
                    "response": "*I've been trying to make a post, but they're not being approved by the moderators.*\n\nTry writing something about bitcoin.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i937b13",
                            "author": "throwaway234234348",
                            "score": -1,
                            "created_utc": 1652890275.0,
                            "response": "There is ongoing criminal activity on a major video website conning people out of bitcoin.\n\nThis post is meant to make people aware, as it's not a typical phishing attack.\n\nThousands of people are apparently watching, and it's been days of users reporting it.\n\nEven well informed people that have been in the bitcoin space for a long time might be susceptible.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i937pea",
                                    "author": "DesmondNav",
                                    "score": 1,
                                    "created_utc": 1652890441.0,
                                    "response": "No, well informed people don’t fall for „send me 1 BTC I’ll send you 2 BTC back“.\nThis scam is so old that I can’t remember when it started. I reported this guys YT streams alrdy 3 days ago, many people did as well, google doesn’t care.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i938kz2",
                                            "author": "throwaway234234348",
                                            "score": -1,
                                            "created_utc": 1652890798.0,
                                            "response": "My apologies for saying something you don't agree with. I've read plenty of these post and never thought I'd be on this end of it.\n\nThank you for reporting it. I'm trying my best to minimize the damage. If people that were taken in can band together, at the very least maybe we can inform others.\n\nI know it was greedy and stupid. Doesn't change that I'm desperate to turn this into something positive.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i93jc4a",
                                                    "author": "Nada_Lives",
                                                    "score": 1,
                                                    "created_utc": 1652895109.0,
                                                    "response": "Figure out how to stop greed and stupidity and you can post anywhere!",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i93jxm6",
                                                            "author": "throwaway234234348",
                                                            "score": -1,
                                                            "created_utc": 1652895352.0,
                                                            "response": "?",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i93qzze",
                                                    "author": "ProfeshPress",
                                                    "score": 1,
                                                    "created_utc": 1652898183.0,
                                                    "response": "Perhaps ask yourself why the front-page of r/cars isn't riddled with PSAs earnestly dissuading 'well-informed drivers' from handing their keys to the first halfway-plausible stranger who promises to turn their Hyundai into a Bugatti Veyron.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i94tivy",
                                                            "author": "throwaway234234348",
                                                            "score": 1,
                                                            "created_utc": 1652914328.0,
                                                            "response": "It was an accident.\n\nI'm not wealthy, and I'm in a bad situation.\n\nI understand I fucked up.\n\nWhat are you getting at?",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i98cy1i",
                                                                    "author": "igadjeed",
                                                                    "score": 1,
                                                                    "created_utc": 1652984233.0,
                                                                    "response": "> What are you getting at?\n\nWe all believe you were ripped off  \nWe're trying to tell you that fraud is fraud, that using Bitcoin for fraud does not make your loss on-topic in this subreddit",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i98eo2g",
                                                                            "author": "throwaway234234348",
                                                                            "score": 1,
                                                                            "created_utc": 1652984939.0,
                                                                            "response": "What community on Reddit would you suggest is the best to gather information on this scam.\n\nI've tried to post on /YouTube and /scams, but it's 'off-topic' there either.\n\nI'm trying to gather the people that made this same mistake, so that we can combine our efforts in making an inquiry to YouTube as to why this content was featured.\n\nThis subreddit is the best place. Not to mention that I've been a member of this community since it's inception.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i98fjic",
                                                                                    "author": "igadjeed",
                                                                                    "score": 1,
                                                                                    "created_utc": 1652985300.0,
                                                                                    "response": "> I've been a member of this community since it's inception\n\nIf that was true, you'd be aware of 5 years of \"fake Elon\" scams, hundreds and hundreds of them  \n\nYou're obsessed with \"fixing\" one Youtube stream. If all scam victims brought their scams here to fix, there wouldn't be any discussion about Bitcoin. The scam you're obsessed with isn't special. You're not special. We'd prefer not to be flooded with \"I found another scammer\" posts",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i939s7n",
                    "author": "Narmotur",
                    "score": 1,
                    "created_utc": 1652891281.0,
                    "response": "Unfortunately your only recourse is law enforcement in the country where you reside, and you are extremely unlikely to see your money returned.\n\nAnyone who contacts you claiming they can recover your funds is a scammer, and you will only lose even more money if you engage with them.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i98cntl",
                    "author": "igadjeed",
                    "score": 1,
                    "created_utc": 1652984115.0,
                    "response": "> Maybe I was using some bad keywords\n\nMaybe your post is off-topic. It's not relevant to Bitcoin. Fraud is fraud. The victims of this fraud are greedy and gullible",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i98f4zs",
                            "author": "throwaway234234348",
                            "score": 1,
                            "created_utc": 1652985133.0,
                            "response": "I agree that I was greedy and gullible, but it doesn't change that I'm a person.\n\nNot everyone here is wealthy and well-off. People are desperate to survive.\n\nI've used YouTube for a long time, and this is the first time something like this has ever happened.\n\nIt was fraud that uses BTC, so this subreddit seems to be the best place to inquire about other victims—past or present.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i98funz",
                                    "author": "igadjeed",
                                    "score": 1,
                                    "created_utc": 1652985427.0,
                                    "response": "Back in 20 minutes. My tissues ran out",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}