{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "us5khk",
            "title": "An interesting take on Bitcoin from professor Capelis. What was misrepresented?",
            "url": "https://m.youtube.com/watch?v=J9nv0Ol-R5Q&t=30s",
            "author": "Dormage",
            "created_utc": 1652851318.0,
            "score": 0,
            "num_comments": 4,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i91i3in",
                    "author": "Only_An_Ass_Assumes",
                    "score": 1,
                    "created_utc": 1652851995.0,
                    "response": "He’s an actual expert.\nSorry. But how¿",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i91jolu",
                    "author": "E-renter",
                    "score": 1,
                    "created_utc": 1652853172.0,
                    "response": "> Throughout the history of Bitcoin there have been bubbles driven by fake money.\n\nYou mean like the fact that the US dollar has done a 5x in the last 2 years type of fake money? You mean bubbles like the stock market and real estate market driven by the exponential expansion of fiat currencies under fancy names like quantitative easing type of fake money? You mean bubbles in things like food and gasoline caused by unprecedented inflation in Western fiat currencies type of fake money?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i91kbfy",
                    "author": "Nada_Lives",
                    "score": 1,
                    "created_utc": 1652853663.0,
                    "response": "What was misrepresented? Let's start with his claim that he's an expert.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i91kom1",
                    "author": "nullama",
                    "score": 1,
                    "created_utc": 1652853939.0,
                    "response": "He's basically ranting for an hour.\n\nThere's also a big mix of concepts from all the other altcoins as well.\n\nIn short, there's nothing wrong about Bitcoin. It just takes more effort to use it properly.\n\nI think the main point is in this slide:\n\n\"The True Value of Cryptocurrencies: Censorship Resistance\"\n\nThat's one of the keys to Bitcoin. But of course this professor just went on with \"it's for drug dealers\"...\n\nAny other use of a blockchain can be done better in a centralized way. That's true. So all the blockchain solutions that you see these days for NFTs, or whatever, are just not great projects. Only when you care about censorship resistance, that's when it matters. And Bitcoin is a great example of that.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}