{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uv3o0i",
            "title": "Withdrawing from coinbase pro",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/uv3o0i/withdrawing_from_coinbase_pro/",
            "author": "callback7",
            "created_utc": 1653194427.0,
            "score": 5,
            "num_comments": 15,
            "subreddit": "BitcoinBeginners",
            "selftext": "When I go to withdraw my bitcoin off of coinbase pro to my trezor the amount of bitcoin I have is changing and thus it is difficult to withdraw all of your bitcoin. You type in an amount to withdraw and then it changes a second later and says insufficient funds. How can the amount of bitcoin I have be changing?",
            "stickied": false,
            "comments": [
                {
                    "id": "i9j5pk9",
                    "author": "hendricm2006",
                    "score": 5,
                    "created_utc": 1653196131.0,
                    "response": "Wait until all your deposits clear because they will allow you to take the profit from the deposit but not the principle.  This is normal.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9jcuez",
                    "author": "comfyggs",
                    "score": 4,
                    "created_utc": 1653201844.0,
                    "response": "You have to pay a fee. So if you have 0.01 BTC and the withdrawal fee is 0.00000291 BTC, you can withdraw a total of 0.00999709 BTC (to make a total of 0.01BTC) it will always tell you the fee prior.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9j6sfn",
                    "author": "johnson5067",
                    "score": 3,
                    "created_utc": 1653196938.0,
                    "response": "I vaguely remember this happening to me sometimes even if all my deposits had already cleared. If you take your BTC balance and subtract the withdrawal fee yourself, you can manually type in the amount to withdraw and click Withdraw. I remember that working even if there was some message that said the amount was too high.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9j3bul",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653194428.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9jntqq",
                    "author": "siennasolo",
                    "score": 1,
                    "created_utc": 1653211765.0,
                    "response": "Hit the \"Max\" option",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9jruaj",
                    "author": "igadjeed",
                    "score": 1,
                    "created_utc": 1653215383.0,
                    "response": "The amount of Bitcoin is not changing. The \"insufficient funds\" message on Coinbase Pro is caused by a 1-Satoshi miscalculation of the fee, a Coinbase Pro error. Add 0.00000001 to the fee amount, subtract that from your total Bitcoin amount, and withdraw that amount",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}