{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uqdl4a",
            "title": "NOOO! Based on a true story smh",
            "url": "https://i.redd.it/f8llipw2zoz81.jpg",
            "author": "EB_In_The_House",
            "created_utc": 1652643157.0,
            "score": 194,
            "num_comments": 16,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8qhpkx",
                    "author": "arbalest_22",
                    "score": 3,
                    "created_utc": 1652645780.0,
                    "response": "Buy buy buy!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8qnka7",
                    "author": "Kangaroo_Low",
                    "score": 1,
                    "created_utc": 1652648317.0,
                    "response": "Lmao quality post",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8qg037",
                    "author": "only_crank",
                    "score": 5,
                    "created_utc": 1652645026.0,
                    "response": "It‘s just on sale",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8qja7b",
                            "author": "tdempsey33",
                            "score": 6,
                            "created_utc": 1652646476.0,
                            "response": "I have never cared much for that mindset. It’s not on sale it’s been massively devalued due to a massive risk of investor mindset, a collapse in a highly used “stable” coin and most likely margin washout. \n\nSaying it’s on sale assumes it’s undervalued. It’s never over or undervalued. It’s valued at exactly the amount the market has determined.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8qr9e3",
                                    "author": "davidcwilliams",
                                    "score": 1,
                                    "created_utc": 1652649935.0,
                                    "response": "Oh, hey look, an adult.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8qkyju",
                                    "author": "bstardif",
                                    "score": 2,
                                    "created_utc": 1652647206.0,
                                    "response": "Upvoted. I agree with the idea and direction of bitcoin and its users but some of the sayings and such here are odd.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8qlv9x",
                                            "author": "tdempsey33",
                                            "score": 1,
                                            "created_utc": 1652647594.0,
                                            "response": "I’m trying to cope with the rest of them. I think I’m just salty at the price action.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i8qks1y",
                                    "author": "only_crank",
                                    "score": 2,
                                    "created_utc": 1652647127.0,
                                    "response": "I believe in bitcoin, I believe it will hit 100k in the next years that‘s why I‘m saying for me it‘s on a sale right now because I‘m buying for the long term. I would probably buy right now anyway, if for 35k or 30k I don‘t care so if it drops and I can get a good price fuck yeah I‘ll take it.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8qpd1f",
                                            "author": "Vveo",
                                            "score": 1,
                                            "created_utc": 1652649100.0,
                                            "response": "You talk about the current price as a sale, asuming it is worth more, arguing with a potential future price. What you fail to see is the current price has nothing to do with anything. Potential Ups and Downs compared to when you put your Money in is what matters. \n\nTalking about it as a sale just because YOU bought it at a higher price preveously, is only tricking yourself.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8qgrkk",
                    "author": "smooth_grooves",
                    "score": 2,
                    "created_utc": 1652645360.0,
                    "response": "The story of 2022",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8qhmaa",
                    "author": "VirtuaFighter6",
                    "score": 3,
                    "created_utc": 1652645740.0,
                    "response": "2025",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8qthg0",
                    "author": "HBRex",
                    "score": 1,
                    "created_utc": 1652650896.0,
                    "response": "It always goes down before it goes up. Every time.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8qtp9r",
                    "author": "mantits-",
                    "score": 1,
                    "created_utc": 1652650989.0,
                    "response": "My friend panic sells when this happens, I just get excited and giddy then buy more.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uqaw7e",
            "title": "A Bitcoin Investment Strategy Involving FASB Accounting Guidance Changes",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uqaw7e/a_bitcoin_investment_strategy_involving_fasb/",
            "author": "PayDre",
            "created_utc": 1652635519.0,
            "score": 3,
            "num_comments": 4,
            "subreddit": "Bitcoin",
            "selftext": "For those that are not aware, under current accounting standards, public companies holding Bitcoin have to report the assets as other intangibles. Other intangibles are subject to impairment losses when a triggering event occurs (price decreases) which creates a negative impact to the profit a loss statement. Other intangibles do not record a gain even if the price increases so holding Bitcoin can only negatively impact the public company holding it. This method of recording it is primarily due to the Financial Accounting Standards Board (FASB) lacking proper guidance specific to the new digital asset technology. I also believe it is a large reason why more companies don’t hold it. \n\nRecently, FASB voted to dedicate time and money in developing new standards specific to companies that hold Bitcoin which could most likely result in those assets being marked to fair value under those new rules. As such, any company that had previously recorded Bitcoin as other intangible and suffered heavy impairment losses would now record a large fair market gain and positive impact on the income statement/balance sheet. I could see this create a surge in stock prices for those companies that has previously written those assets down and now have a large gain in one quarter when that new guidance is adopted. \n\nSo the strategy would be to buy a company like MicroStrategy who is expected to record a large impairment loss for Q2 2022 due to recent price drops and micro strategy has a sell off. Buy the stock with the anticipation that the new rules will require a large fair market gain and large earnings recording. \n\nI know a lot will say, “why don’t you just buy bitcoin directly?”. Well this would be for individuals that have money tied up in retirement assets and don’t want to pay 2% on bitcoin fund fees and want to have exposure.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8puura",
                    "author": "phikapp1932",
                    "score": 1,
                    "created_utc": 1652635687.0,
                    "response": "The research is great but the plan is not so much. There’s potential, but basically the plan is “buy stock when low”",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8q4wfp",
                    "author": "Nada_Lives",
                    "score": 1,
                    "created_utc": 1652640086.0,
                    "response": "*For those that are not aware, under current accounting standards...*\n\nFor those who are not aware, the legacy fiat monetary system has been shown the door. Left behind. Superceded. 86'ed, Cast off. Disowned. Rejected...",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uqdjdn",
            "title": "Only opportunities",
            "url": "https://i.redd.it/3xljha8oyoz81.jpg",
            "author": "AggressiveAwareness2",
            "created_utc": 1652643021.0,
            "score": 142,
            "num_comments": 14,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8qcv2v",
                    "author": "txhex",
                    "score": 14,
                    "created_utc": 1652643637.0,
                    "response": "10 years later…..\n\n::buttcoiners chanting::",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8qw415",
                            "author": "Ok_Aerie3546",
                            "score": 2,
                            "created_utc": 1652652047.0,
                            "response": "I dont get how someone with a straight face can say something is a bubble for 10 years.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8r2qdm",
                                    "author": "louisbrunet",
                                    "score": 1,
                                    "created_utc": 1652655114.0,
                                    "response": "they’re idiots, they don’t have shame. when the market is down they call it a scam and when it’s up they call it a bubble. If you look at the profile of the average buttcoiner they’re either invested balls deep in silver/tech stocks  or just average depressed nihilists posting on r/lostgeneration r/antiwork and r/socialism_101\n\nThey don’t like bitcoin cause it goes against their worldviews, but the thing they don’t understand is that bitcoin doesn’t give two shits about them and their opinion.\n\nalso, for people that don’t like crypto, they surprisingly [spend an aweful lot of time on crypto-related subs](https://subredditstats.com/subreddit-user-overlaps/buttcoin)",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8r6gxh",
                                    "author": "Dont_Say_No_to_Panda",
                                    "score": 1,
                                    "created_utc": 1652656933.0,
                                    "response": "I’m not trying to defend buttcoiners, but you can say that the dotcom bubble of 2000 unequivocally happened, and was a “bubble” and that there was still a huge untapped market for the internet to grow into (ie be a huge “dotcom bull.”) These are not mutually exclusive claims. \n\nMy point being, someone could say a bitcoin today is worth $25k. That’s what they’ve calculated the price to be based on avg cost of energy, the current subsidy/reward, hash rate, etc… they might then predict the price in 5 years to be $50k. If the price shot up tomorrow to $69k that person could say it’s a bubble and not be undermining their long term bill thesis in BTC. \n\nThat said, I don’t think that’s necessarily the argument buttcoiners are making but nonetheless.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8qnedm",
                    "author": "Brainsick001",
                    "score": 5,
                    "created_utc": 1652648245.0,
                    "response": "Fucking legend.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8qdn21",
                    "author": "WritingFun8769",
                    "score": 5,
                    "created_utc": 1652643982.0,
                    "response": "these comments from hal, satoshi, etc should be used like mantras when panicking. i always feel like i’m in touch with the truth when i read them and it brings me (even greater) peace.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8qsiha",
                    "author": "throwsx123",
                    "score": 1,
                    "created_utc": 1652650478.0,
                    "response": "RIP\nFor me he is Satoshi",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8qtzav",
                            "author": "Big_Party_4731",
                            "score": 2,
                            "created_utc": 1652651108.0,
                            "response": "He is not, but f legend nevertheless",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8r7323",
                            "author": "travelingalpha",
                            "score": 1,
                            "created_utc": 1652657233.0,
                            "response": "Len sassaman",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8qz9wd",
                    "author": "grayjacanda",
                    "score": 1,
                    "created_utc": 1652653472.0,
                    "response": "Bitcoin and the Bayesian Market hypothesis",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8r8dss",
                    "author": "Rappareenola",
                    "score": 1,
                    "created_utc": 1652657879.0,
                    "response": "stack sats",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8r9dq0",
                    "author": "Used-Astronaut6720",
                    "score": 1,
                    "created_utc": 1652658372.0,
                    "response": "Even a broken clock or right twice a day lol",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}