{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uvx6nc",
            "title": "How long does it take for bitcoin to appear in account after purchasing?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/uvx6nc/how_long_does_it_take_for_bitcoin_to_appear_in/",
            "author": "typrod42",
            "created_utc": 1653301869.0,
            "score": 2,
            "num_comments": 20,
            "subreddit": "BitcoinBeginners",
            "selftext": "I bought bitcoin on  Coinbase, 1k$ and it says only 15$ of it is available. I bought 500$ on block chain and It says 0$ is available when I try sending money. How long does it take for the bitcoin to appear so I can send it? I bought it on Sunday, my bank account says it’s pending. I am from the USA. Is there any wallet that allows you to send bitcoin instantly instead of waiting?",
            "stickied": false,
            "comments": [
                {
                    "id": "i9o6hmx",
                    "author": "hendricm2006",
                    "score": 4,
                    "created_utc": 1653305205.0,
                    "response": "Deposits on Coinbase can be immediately used to purchase crypto assets, but you have to wait 5-7 days for the deposit to clear before you can move or withdraw it.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9og54v",
                            "author": "sossolha9ira",
                            "score": 1,
                            "created_utc": 1653311041.0,
                            "response": "Why does it take all this time?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9ojrn9",
                                    "author": "MadMaxwell92",
                                    "score": 1,
                                    "created_utc": 1653312893.0,
                                    "response": "Exchange communicates with bank to check balance, bank processes transaction to central banking clearing houses. Transaction gets confirmed and sent back to bank to authorize the transfer of funds after being recorded in central bank ledger.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9ormj8",
                                            "author": "sossolha9ira",
                                            "score": 1,
                                            "created_utc": 1653316578.0,
                                            "response": "So central banks knows how much bitcoin I had?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9osrbi",
                                                    "author": "MadMaxwell92",
                                                    "score": 1,
                                                    "created_utc": 1653317078.0,
                                                    "response": "If you used your bank account to buy the bitcoin then yes. The only way to buy bitcoin discretely that I know of are directly from another person that owns it or a bitcoin atm that doesn’t use kyc.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9oy7tm",
                                                            "author": "sossolha9ira",
                                                            "score": 0,
                                                            "created_utc": 1653319468.0,
                                                            "response": "What if 69% of users use their bank account to purchase ( since a lot of people are lazy and scammers are everywhere—pretty hard to find a person to exchange with) then central banks gather data about users (like Purchase date-purchase amount, Sale date-Sale amount) this data can help them to predict bitcoin price in the future and also sell these data to some range of people ( private equity...) that can manipulate the bitcoin market( or the whole crypto markets), it‘s not anymore a decentralized currency, also to purchase via a trading platform or a cryptocurrency exchange we need to pay taxes at the end, why they still call it *Decentralized currency* ??",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i9oxn1p",
                                                    "author": "bitusher",
                                                    "score": 1,
                                                    "created_utc": 1653319225.0,
                                                    "response": "no, thats not the central banks role . Perhaps you are thinking about your private bank or irs or fincen?\n\nWhat are your specific concerns?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9oyty9",
                                                            "author": "sossolha9ira",
                                                            "score": 1,
                                                            "created_utc": 1653319731.0,
                                                            "response": "Can central banks holds some data about my purchases (which can be a precious data for them of course)??",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9p03w0",
                                                                    "author": "bitusher",
                                                                    "score": 1,
                                                                    "created_utc": 1653320270.0,
                                                                    "response": "Its not their interest or role to have this information. Other governmental departments track this info like Fincen if you make a tx over 10k in value or structure",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9p0jxi",
                                                                            "author": "sossolha9ira",
                                                                            "score": 1,
                                                                            "created_utc": 1653320459.0,
                                                                            "response": "Ok \nThanks! \nSuch a nice group here 😊",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9oy47q",
                                    "author": "idwpan",
                                    "score": 1,
                                    "created_utc": 1653319426.0,
                                    "response": "Exchanges often place a hold on withdrawing crypto bought with a recent fiat deposit, as fiat can be reversed. Once they let you withdraw the bitcoin, if your fiat payment bounces, they are out that money. Placing a hold until the payment clears helps prevent them from being defrauded.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9o229q",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653301869.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ojgyq",
                    "author": "MadMaxwell92",
                    "score": 1,
                    "created_utc": 1653312744.0,
                    "response": "I use Gemini to make spot purchases. Sometimes CashApp if I’m feeling lazy and it’s not that much. As long as you’ve established connection to your bank account in my experience the btc has been available almost instantly and the transaction is fully confirmed in about 20 minutes, or 2 blocks.\n\nExchanges work differently from each other. I have one exchange that won’t allow the bitcoin transaction to execute until the ach transfer from my bank has fully cleared. This can take up to 4 business days or longer thanks to the inner workings of our central banking systems. I have another exchange that will let the purchase happen immediately rather than wait for the transaction to clear. I’m sure it’s all on the terms and conditions for each exchange.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9p0d1j",
                    "author": "Bjasmine098",
                    "score": 0,
                    "created_utc": 1653320378.0,
                    "response": "Done",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9p0g3e",
                    "author": "Mean_Rutabaga5353",
                    "score": 1,
                    "created_utc": 1653320414.0,
                    "response": "You can try trust wallet or binance",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}