{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ut6yf3",
            "title": "A question about hard forks and decentralization",
            "url": "https://www.reddit.com/r/Bitcoin/comments/ut6yf3/a_question_about_hard_forks_and_decentralization/",
            "author": "Graphenist",
            "created_utc": 1652976975.0,
            "score": 7,
            "num_comments": 12,
            "subreddit": "Bitcoin",
            "selftext": "That i know of, Bitcoin seems to be the only crypto that doesnt ever do hard forks. It only does soft forks. (And the difference i believe is hard forks break previous versions while soft forks do not...) Bitcoin *feels* a lot more decentralized than all the altcoin projects out there... But why?\n\nA) Is Bitcoin more decentralized because it *chooses* not to do hard forks? \n\nB) Is Bitcoin unable to do hard forks because its too decentralized in the first place?\n\nC) Are lack of hard forks and presence of decentralization just correlated, both caused by ossification and size of the project?\n\nD) Or is it something about the nature of Bitcoin that uniquely prevents hard forks?\n\nDifferent altcoiners have different theories, theyll like say for example that the Bitcoin devs simply refuse to let anyone do hard forks. But I think this is ridiculous, because nobody ordains them as Bitcoin devs but the compliance of the decentralized Bitcoin community...\n\nWhat is your theory? What is the relationship between decentralization and (lack of) hard forks?",
            "stickied": false,
            "comments": [
                {
                    "id": "i982km1",
                    "author": "dlq84",
                    "score": 4,
                    "created_utc": 1652980042.0,
                    "response": "There are many hard forks of Bitcoin, all of them has failed.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9c3uq8",
                            "author": "igadjeed",
                            "score": 1,
                            "created_utc": 1653058395.0,
                            "response": "These hard forks did not fail  \nhttps://en.bitcoin.it/wiki/Value_overflow_incident  \nhttps://en.bitcoin.it/wiki/BIP_0150",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i98llpa",
                    "author": "krisycoll",
                    "score": 3,
                    "created_utc": 1652987771.0,
                    "response": "Bitcoin had hard forks. A hard fork have as result a different blockchain, so if you did not study some bitcoin history, you can't identify a hard fork by looking into the blockchain, because the hard fork is a different blockchain. Bitcoin had hard forks like Bitcoin Cash or Bitcoin Satoshi Vision (Bitcoin SV). \n\nA) Decentralization makes harder to find a global consensus, so things tend to stay in an status quo (if bitcoin is working well and the fork have no a big consensus, things will remain as they are). A hard fork can be made by you and 3 or 4 friends, but nobody will care. When a lot of people care, the hard fork is more famous, but if there is still no consensus, the hard fork will happen in a new blockchain, not in the current one. \n\nB) Bitcoin is able to do hard forks, but if a majority agree it will not be a fork, just a change, and if the majority do not agree, the fork will be a new blockchain, and not bitcoin blockchain. \n\nC) Bitcoin is a big monster difficult to change because it grow organically, without premines and without a person of influence, a CEO or a group of people saying what to do. Other coins can't say the same. So, taking into account that when you joined bitcoin you knew the rules and agree with it, once you are in there, there are little incentives to change that rules. And rules are the same for miner nodes, user nodes, developers, and everyone in bitcoin, each one with their own interest. And we all agree in the rules because bitcoin works! Why change it?\n\nD) Too big, pretty well decentralized and with a good incentive alignment for all the parts. If you want a change you will have to convince a lot of different people and that is really hard. \n\n&#x200B;\n\nEnglish is not my native language. Please correct what is wrong I'm learning! Thxs",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i97zrhi",
                    "author": "NiceDoctorBeam",
                    "score": 2,
                    "created_utc": 1652978919.0,
                    "response": "Bob sends 7 BTC to Alice.  No central authority was involved: No banks, nor government agencies/agents, nor corporations, nor third individual approved/settled/censored/denied the transaction.\n\nBitcoin is decentralized.  There is no central authority, no CEO to arrest, no small group to round up, no headquarters to search/seize/bomb/spy upon...\n\nThere is no central authority to dictate changes to Bitcoin.  Any changes are made by consensus.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i984xbe",
                    "author": "wolfofone",
                    "score": 2,
                    "created_utc": 1652980985.0,
                    "response": "Anyone can hard fork bitcoin. Doesn't mean their fork will be worth anything or that any BTC users on the main fork will switch to or use the new fork.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i97z65r",
                    "author": "Halo22B",
                    "score": 3,
                    "created_utc": 1652978682.0,
                    "response": "Bcash was a hardfork",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i97xgh9",
                    "author": "2xfun",
                    "score": 1,
                    "created_utc": 1652977997.0,
                    "response": "Read this: the Bitcoin Standard... Knowledge is power",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i992pv5",
                    "author": "sciencetaco",
                    "score": 1,
                    "created_utc": 1652995698.0,
                    "response": "A centralised altcoin can easily hard fork because the developers, leaders, and foundation/company coordinate with a small set of validators to do the hard fork. Everyone else is just along for the ride. \n\nBitcoin hard forks happen but the proponents of the fork need to gather support of the node operators and wider community in order for it to become the dominant fork. That won’t happen unless a hard fork is required for a very important reason.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i99b35z",
                    "author": "BitcoinUser263895",
                    "score": 1,
                    "created_utc": 1652999574.0,
                    "response": "\"More energy than Iceland\" That's why.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i99ga80",
                    "author": "fjjjfjfnfnfng",
                    "score": 1,
                    "created_utc": 1653002135.0,
                    "response": "Mostly B. In the (supposedly) last Satoshi’s email he states that bitcoin was created with the purpose of being hard to change without reaching almost universal consensus. And that is truly difficult in such a decentralized network. Bitcoin is meant to last for centuries, thus every critical movement (hard fork) is critical for its survival and only be made if truly needed or benefits the whole network",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9c3jgu",
                    "author": "igadjeed",
                    "score": 1,
                    "created_utc": 1653058270.0,
                    "response": "Yes, it's about decentralization, and about that aspect of decentralization where nodes do not vote, nodes can not be counted, and the \"correct\" fork can not be chosen by numeric majority  \n\nThe Core software is updated. The network has no upgrade notification or mandatory upgrade. Nodes which don't upgrade keep on working. The network is always a mixture of different versions  \n\nA hard fork splits the network. Those who do not upgrade will reject new blocks which contain transactions which do not follow the pre-fork consensus rules. Their chain therefore diverges from the chain maintained by nodes which have new consensus rules  \n\nWhat is consensus? Every Bitcoin node is independent, not directed by a master controller, not directed by its peer nodes. Yet, every node's blockchain contains the same transaction history - consensus  \n\nHow does a hard fork affect consensus? The nodes which do not upgrade will fork their chains to a different transaction history  \n\nDoes this matter?  \n\nIn a sense it does not matter. To me, a node operator, my copy of the blockchain on my node is the correct Bitcoin history. It's not better than any other node's blockchain. It's that my node (being independent) has the only history which matters. I don't have a reason to compare it with my neighbors  \n\nBut eventually, I'll need to spend some Bitcoin. I broadcast a transaction. It is accepted by at least one other node. It gets mined by a miner. But my merchant says his node did not receive it. He's on the upgrade side if the fork, but I'm not aware the network forked, I only know my node's blockchain is correct. Now I become aware that the merchant's node has a different (correct from his node's point of view) blockchain, that there was a fork  \n\nAt this point, I have to choose whether to follow my fork or the upgrade fork  \n\nDoesn't seem like a big deal. Some inattentive node operator was unaware of an upgrade and couldn't transact with a merchant. He's now going to \"comply\"  \n\nMaybe not. Maybe I persuade my merchant to revert his node so that it matches mine. After all, I'm not the only node on the no-upgrade fork. There is at least one who accepted my transaction, and enough miners' nodes still adding to the no-upgrade blockchain  \n\nThat's what would have happened if a significant portion of Bitcoin nodes and miners had followed the BCash fork  \n\nHard forks aren't impossible. But their promoters would need to be certain that the no-upgrade fork has insignificant support, particularly on the mining side. I might be inattentive, but I might notice if the number of blocks validated by my node dropped to substantially less than 144 per day. Or I might not notice, if the fall was handled by the next 2 or 3 difficulty adjustments  \n\nThe problem is that the promoter of an upgrade can not predict whether the no-upgrade nodes and miners create a significant, viable fork, until after he pushes the upgrade. He's at a disadvantage, not from hostile node operators, but from apathetic, inattentive node operators  \n\nConsensus forms as a supermajority, a concept of \"everybody except those who are away for the day\", not a numeric majority. Bitcoin nodes do not vote, can not be counted  \n\nA BIP9 vote can help the promoter of an upgrade. With measurable support from mining hashpower, there's less risk in leaving behind the inattentive, no-upgrade nodes, because their fork will grow very slowly. This mining slowdown alerts the no-upgrade nodes that there was a fork, and creates a participation incentive for them to upgrade and follow the other fork  \n\nThe problem with BIP9 is that it's a vote of mining pools, so it's very centralized, compared with the node network  \n\nThe network has a risk of losing the no-upgrade nodes. Decreasing node counts tend towards centralization. This issue would matter less if more people choose to run a node. The node count seems to have been fluctuating above and below 50,000 for about 4 years. This is enough. But hard forks would make it fall, and then after a few hard forks, it might fall too far",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}