{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "urxlys",
            "title": "Interested in hearing reasons against this proposal",
            "url": "https://www.reddit.com/r/Bitcoin/comments/urxlys/interested_in_hearing_reasons_against_this/",
            "author": "mrmishmashmix",
            "created_utc": 1652824901.0,
            "score": 0,
            "num_comments": 27,
            "subreddit": "Bitcoin",
            "selftext": "Thought Experiment: Rather than keeping the 2.1 Quadrillion limit, Continue to subdivide btc and add on zero's on so that mining may long continue. \n\n&#x200B;\n\nI'm just interested in arguments for and against this. Obviously we have one hundred years ahead of us to prepare for this, but I quite like the idea of block rewards continuing in perpetuity. But doubtless there may be some very good reasons why this is impractical and stupid. Thoughts?",
            "stickied": false,
            "comments": [
                {
                    "id": "i904zjd",
                    "author": "SpiritmongerScaph",
                    "score": 5,
                    "created_utc": 1652826653.0,
                    "response": "I don't quite get the idea:\n\nEither you end up creating more than 21m (big no)\n\nOr\n\nYou still end up with 21m and it doesn't change anything",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i93gdxy",
                            "author": "mrmishmashmix",
                            "score": 1,
                            "created_utc": 1652893916.0,
                            "response": "Sorry I wrote this last night after a few beers and reading it back to myself, I can understand why I've confused people. I'm not suggesting increasing 21 million coin limit. I'm suggesting block reward continues forever. Apologies for my imprecise description.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i90e9aa",
                    "author": "goobar_oz",
                    "score": 5,
                    "created_utc": 1652831032.0,
                    "response": "I don’t think most commenters understand what OP is saying. He’s not suggesting increase in 21 m BTC. He’s saying that in 2140, when block rewards are 1 sat, and it is time to half rewards, rather round up to reward the last sat to complete 21m, continue to divide so that block rewards become 0.5 sat, then 0.25 sat, etc. \nOP, it actually would make no difference as miner rewards would be 99.99% based on fees on then.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9279bu",
                            "author": "Sevenio",
                            "score": 1,
                            "created_utc": 1652873155.0,
                            "response": "Lol you comment made me realise how stupid  ethereums decision to make its supply infinite is.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i93gux3",
                            "author": "mrmishmashmix",
                            "score": 1,
                            "created_utc": 1652894109.0,
                            "response": "Yes exactly, reading my post again though made me realise how poorly I expressed myself. Your comment makes lots of sense (block reward compared to tx fees is miniscule so what's the point) and also as lightning already has millisats, why would we need to do this. Thanks man.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9022zd",
                    "author": "WritingFun8769",
                    "score": 2,
                    "created_utc": 1652825326.0,
                    "response": "that’s not possible. subdividing doesn’t increase the amount of bitcoins, and so mining would still lose its block reward when the final reward is produced by the blockchain.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i93h4je",
                            "author": "mrmishmashmix",
                            "score": 1,
                            "created_utc": 1652894218.0,
                            "response": "Yes apologies, my post was expressed very poorly. I meant carry on halving, naturally the limit won't change.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i93kmfg",
                                    "author": "WritingFun8769",
                                    "score": 1,
                                    "created_utc": 1652895633.0,
                                    "response": "that would still be impossible. halving will inevitably end unless the limit were increased, and then a new halving process would have to adjust the block reward. it just doesn’t make any sense",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i90atgx",
                    "author": "SmoothGoing",
                    "score": 2,
                    "created_utc": 1652829386.0,
                    "response": "Mining must continue indefinitely. Has nothing to do with sat limit.\n\nYou don't understand divisibility. Measuring a day in seconds instead of hours doesn't make the day longer. So subdividing units doesn't make mining more rewarding. If you want a coin with unlimited issuance you have lots of shitcoin options.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i90pudk",
                    "author": "swgo1",
                    "score": 2,
                    "created_utc": 1652836550.0,
                    "response": "2nd layer systems can divide SATs if needed.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i93h6ns",
                            "author": "mrmishmashmix",
                            "score": 1,
                            "created_utc": 1652894242.0,
                            "response": "This makes sense. Cheers",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i901jst",
                    "author": "Inevitable_River_509",
                    "score": 3,
                    "created_utc": 1652825090.0,
                    "response": "There will only be 21 million btc, there are shitcoins for infinite supplies if that’s a preference.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i93gi5y",
                            "author": "mrmishmashmix",
                            "score": 1,
                            "created_utc": 1652893964.0,
                            "response": "No not at all. I like the hard cap. I'm suggesting halve coin reward forever.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i901k4r",
                    "author": "SirSkittles111",
                    "score": 4,
                    "created_utc": 1652825094.0,
                    "response": "So just infinitely print coins? What makes it so different to fiat at that point",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i93h943",
                            "author": "mrmishmashmix",
                            "score": 1,
                            "created_utc": 1652894270.0,
                            "response": "Sorry, I didn't mean increase the cap. Only to carry on halving.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i93i083",
                                    "author": "SirSkittles111",
                                    "score": 1,
                                    "created_utc": 1652894570.0,
                                    "response": "Ah gotcha, well thats a problem for future bitcoiners to handle. If it really takes off like we all predict it to and singular sats are really worth that much then going further to half a sat may be in the question",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i90dxwn",
                    "author": "E-renter",
                    "score": 1,
                    "created_utc": 1652830880.0,
                    "response": ">so that mining may long continue\n\nThis is absolutely not necessary. There will always be transaction fees for miners. I wish people understood this, pretty much every day in this subreddit I see people asking what happens when the mining rewards end. They will never end, because there will always be transaction fees.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i93jpnj",
                            "author": "mrmishmashmix",
                            "score": 1,
                            "created_utc": 1652895263.0,
                            "response": "I do understand this, but from reading my post again this morning I completely understand why you think I don't!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i93k1br",
                                    "author": "E-renter",
                                    "score": 1,
                                    "created_utc": 1652895394.0,
                                    "response": "Oh okay glad to hear it bro :)",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i90eygc",
                    "author": "thats_just_right",
                    "score": 1,
                    "created_utc": 1652831372.0,
                    "response": "Subdividing is not the same as continued mining. Perpetual mining is bad because one of Bitcoin's biggest advantages over fiat currency is that it cannot be infinitely inflated. \n\nBut if you're asking about subdividing more than the current limit of 100k Satoshis/BTC, I think of it like this. Imagine some glorious future where 1BTC = $100,000,000 USD. At that point one Satoshi would be worth a dollar (assuming I'm doing my math right). So you might argue that people could no longer buy anything for less than a dollar. Then I would counter, that by that time, a dollar would be so debased, that you couldn't buy anything for $1USD anyway. Just like you can't buy anything (that I'm aware of) for a penny today.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i90m77w",
                    "author": "Major_Bandicoot_3239",
                    "score": 1,
                    "created_utc": 1652834827.0,
                    "response": "Go Google Market Cap. Then come back to Reddit.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i93jyvm",
                            "author": "mrmishmashmix",
                            "score": 1,
                            "created_utc": 1652895367.0,
                            "response": "Nothing I've said has anything to do with market capitalisation. That said, I regret posting such an imprecise description. I meant, block reward continues to halve forever.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i92o5ev",
                    "author": "igadjeed",
                    "score": 1,
                    "created_utc": 1652882207.0,
                    "response": "> so that mining may long continue\n\nMining continues forever",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i93kd3y",
                            "author": "mrmishmashmix",
                            "score": 1,
                            "created_utc": 1652895529.0,
                            "response": "Sorry my post was really poorly expressed. I meant block reward halves forever. Are there technical reasons why this would be a bad idea on the main chain. I think goobar\\_oz point that the proportion from block reward will be so small as to be really not worth having, but mathematically it appeals to me to keep the block reward. Who can't appreciate the finite nature of a geometric sum to infinity?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i93myg8",
                                    "author": "igadjeed",
                                    "score": 1,
                                    "created_utc": 1652896557.0,
                                    "response": "> mathematically it appeals to me\n\nThis forum is full of people who think they can improve on Satoshi's invention, with tiny changes to one insignificant part  \n\nListen to Adam Back (one of the innovators credited in Satoshi's white paper) describe the time and effort he spent trying to find ways to make Bitcoin better  \nhttps://youtu.be/QfLHB4bq_d4",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9020ll",
                    "author": "gsurfin",
                    "score": 0,
                    "created_utc": 1652825296.0,
                    "response": "This defeats the whole purpose of Bitcoin.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}