{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uw1ewd",
            "title": "\"This Just Happened NOW when I bought BTC!\" | Gareth Soloway Bitcoin Price Prediction. https://youtu.be/M2o3LXYUC68. YOUTUBE savvy freedom. #bitcoin #gareth soloway #crypto",
            "url": "https://i.redd.it/od8dak3kj8191.jpg",
            "author": "No-Interview2787",
            "created_utc": 1653315923.0,
            "score": 0,
            "num_comments": 0,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uw14y1",
            "title": "How Bitcoin Saves The Planet",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uw14y1/how_bitcoin_saves_the_planet/",
            "author": "youbehasbeen",
            "created_utc": 1653315163.0,
            "score": 8,
            "num_comments": 11,
            "subreddit": "Bitcoin",
            "selftext": "# The Structure of Fiat\n\nFiat money must increase in supply forever. This is because every dollar is nothing but a debt owed with interest, the interest of which has to come from new dollars, which themselves are owed as debts with interest. When the debts are repaid, the dollars cease existing as the debts are cancelled out. In other words, this is a ponzi-scheme like design of necessary, infinite growth. Without that growth, the system collapses.\n\nDebts are largely taken out by productive, economic ventures (as opposed to government printing into the void) which means the economy is required to keep growing to keep the money supply from collapsing.\n\n# Unlimited Growth - A Cancer\n\nEric Weinstien calls this an \"embedded growth obligation\" (ego) which I think is a great term. [Nate Hagens](https://www.youtube.com/channel/UCWJOjGOpN8oSVr_OoJLzk9g) has done great work showing that economic growth is coupled almost 1:1 with planetary resource extraction and material consumption.\n\nProblem: infinite growth on a finite substrate is called cancer. There are only so many resources we can extract before we start hitting \"planetary limits\" and exceed the \"carrying capacity\" of the earth.\n\nNate's channel has shown that in 100 years, our current economic \"growth\" rate will have brought us past the point the planet can sustain. We will have hit a planetary wall and there won't be enough free resources to extract and subsidize our growth. We will have reached this point mainly because fiat money requires infinite growth, though there are other forces driving growth as well (multi-polar rivalrous competition, dissatisfaction in all of our hearts with a steady-state existence, etc).\n\n# Bitcoin - A Solution\n\nBut Bitcoin supply won't increase after 21M. This means there's no embedded growth obligation in the money, giving society a monetary paradigm that can abide with steady-state planetary flows and not be obligated to deplete resources exponentially, forever.\n\nBitcoin still *allows* economic growth - it would just look like an increase in the productive value of the currency, balanced against other inflationary pressures.\n\nI'd recommend everyone study Daniel Schmachtenberger and Nate Hagens work on Youtube.\n\nI'd welcome any criticisms of my points.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9oreoj",
                    "author": "StannisBaratheon6969",
                    "score": 0,
                    "created_utc": 1653316481.0,
                    "response": "We have to be able to grow our money supply. A country’s money supply has a significant effect on a country’s macroeconomic profile, particularly in relation to interest rates, inflation, and the business cycle. The Federal Reserve determines the level of monetary supply. When the Fed limits the money supply via contractionary or hawkish monetary policy, interest rates rise and the cost of borrowing increases. This can dampen inflationary pressures, but also risk slowing down economic growth. Without the ability to grow the money supply, Bitcoin would make borrowing too expensive and the world would forever be under economic pressure against growth. That is, in my view, no bueno. \n\nGoing off the gold standard allowed the US to grow into the world’s largest economy. History shows this worked well.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ot3m3",
                            "author": "Geoknysis",
                            "score": 4,
                            "created_utc": 1653317230.0,
                            "response": "While true, this has been temporary. Fiat backed by faith and inflation has only created temporary bubbles of wealth that have facilitated the creation of an unstable and unsustainable solution to help an economy grow. \n\nBaseless fiat is actually more like a cancer that when unleashed in an economy eventually rots it out over a set period of time given the inflation rate. The major problem here is an inability to preserve and measure accurately wealth. \n\nWhat is required is a store of value that humans can have access to but where select few cannot permanently manipulate. This is Bitcoin.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9punwe",
                            "author": "youbehasbeen",
                            "score": 1,
                            "created_utc": 1653333185.0,
                            "response": "You have a rearward looking perspective from the frame of a central banker.\n\nYou don't factor that low interest rates and constant growth are pushing hidden costs onto the very substrate that sustains our species (the planet).\n\nI will give you one thing: fiat money has allowed the US to gain a short term advantage over other countries. But where and when does it all end?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9q3b7u",
                                    "author": "StannisBaratheon6969",
                                    "score": 1,
                                    "created_utc": 1653336876.0,
                                    "response": "I may have that perspective - but how would borrowing work without a federal reserve? If the US were not able to control its currency, how would the government be funded? Without the ability to sell bonds, the economic world we have known - the one which allows the US to be the largest economy ever known to man - vanishes.\n\nBitcoin has it own environmental costs that are well known. If your hope is Bitcoin saves the planet, I am not sure I see it. I hope something saves this planet - man thus far seems less worried about his home that I think is prudent under any, let alone these, circumstances. But alas, as an economic analysis alone, the dollar is a better currency for Americans than any other. \n\nThe world cannot function with a static amount of wealth. I think a true zero sum gain is a poor model for economic activity, as even if that existed already, the belief it does not exist drives economic activity positively. \n\nI cannot see the a world where a fixed sum of currency exists. We tried it with the gold standard, and I think most economists admit it failed. We need a currency that promotes stability, full employment and consistent, controlled inflation. Deflation must be kept away, too. Inflation is surely controlled by a Bitcoin economy, but deflation and full employment would both be beyond control if we used Bitcoin. Bitcoin is essentially gold 2.0, with the same problems as gold (insufficient supply and high environmental costs of mining) thus I think it cannot work as a national currency. The dollar appears the best choice of all the known choices. \n\nThoughts?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9qdt07",
                                            "author": "FlightOfThePigs",
                                            "score": 1,
                                            "created_utc": 1653341506.0,
                                            "response": "This is very well said! Not sure why you're even being downvoted because everything you said was correct. Some people just have tunnel vision I guess.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9pql44",
                    "author": "solomonsatoshi",
                    "score": 1,
                    "created_utc": 1653331431.0,
                    "response": "Even worse in many countries more than half the new fiat money/debt issued by the banks is not toward productive businesses but toward housing - here in NZ over 60% of bank lending is toward housing so the interest paid is a non productive drag on the economy making NZ a tenant to the banks who are majority owned by USA and Australian shareholders.\n\nIn this context fiat is a system of tribute paid by nations via rentseeking foreign banks.\n\nLook at the military alliances like 5 eyes and the banks mirror those structures.\n\nFiat is in large part a system of debt obligation based money supporting military and monetary hegemony/slavery.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9pspz1",
                            "author": "youbehasbeen",
                            "score": 2,
                            "created_utc": 1653332354.0,
                            "response": "Yes, good points",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}