{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uz5ud4",
            "title": "Liquidate/Trade Shit Coins at Lose for BTC?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uz5ud4/liquidatetrade_shit_coins_at_lose_for_btc/",
            "author": "Rich_Search2096",
            "created_utc": 1653679812.0,
            "score": 26,
            "num_comments": 50,
            "subreddit": "Bitcoin",
            "selftext": "Unfortunately, I had just come to understand that BTC is the only actual decentralized currency, and anything else is either a shit or shill coin. At the time I became properly educated in BTC, everything crashed before I could trade my shitcoins to BTC...\n\nNow I sit and gamble with my alts, pray that they return to previous highs before trading, rather than be destroyed all together? Or just cut my loses and trade to BTC?\n\nI'm not close to in over my head if I lose it all, just want to know the best strategy in the current market, knowing many alts will die. \n\nRecession, future planned pandemics, WEF, WW3... very dark times are coming, this is just the beginning.",
            "stickied": false,
            "comments": [
                {
                    "id": "ia8jeg7",
                    "author": "TheTonik",
                    "score": 15,
                    "created_utc": 1653683806.0,
                    "response": "I did this exact thing two weeks ago. Sold everything and converted to BTC. I am now a multi-coiner and even though I am at a huge loss (50% overall), I am resting easy knowing that if there's any chance to make life changing money, it's going to be with Bitcoin.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia9zlz8",
                            "author": "AlphaGainzzz",
                            "score": 1,
                            "created_utc": 1653710725.0,
                            "response": "Same here, just on a much smaller scale",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia8jxyl",
                    "author": "cpt_charisma",
                    "score": 8,
                    "created_utc": 1653684057.0,
                    "response": "To make successful financial decisions, you need to be objective.  This is very difficult for most people.  In this case, I would advise watching out for the sunk cost fallacy.  The sunk cost fallacy is saying \"I have already invested so much money in this that I can't back out now.\"  The best way to look at these decisions is to say, \"I thought it was a good investment, but had I known then what I know now, I would not make the same decision.\"  Then it is easy to see the correct action - accept the loss and move on to more profitable endeavors.\n\nThe best time to buy Bitcoin was 10 years ago. The second best time is now :D",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia8bc7w",
                    "author": "Charming-Meringue-68",
                    "score": 15,
                    "created_utc": 1653680148.0,
                    "response": "Personally, I would cut your losses and but BTC. We can still go lower, and alts will get hammered",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia8bg2z",
                    "author": "Brettanomyces78",
                    "score": 11,
                    "created_utc": 1653680196.0,
                    "response": "While no one knows the future, I will say this.  Just because some shitcoin is down 90% from its high, doesn't mean it can't go down another 90% from where it is now.  It's not necessarily a good value, and if you hold some, only you can decide when to cut your losses & when to be patient and pray.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia9s7tn",
                            "author": "Wsemenske",
                            "score": 3,
                            "created_utc": 1653706542.0,
                            "response": "You'll enjoy the youtuber Benjamin Cowen, he says a phrase almost exactly like this.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia8okbv",
                    "author": "Old-Lavishness-9546",
                    "score": 8,
                    "created_utc": 1653686239.0,
                    "response": "You give people BTC next thing you no. People are selling pictures of monkeys.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia8kfc6",
                    "author": "MattLDempsey",
                    "score": 3,
                    "created_utc": 1653684280.0,
                    "response": "I know people see Twitter as a cesspit but if you follow the right people, some of the high level discussions on there are phenomenal. They really make you realise it’s bitcoin, not crypto.\n\nI’ve always been at least 80% btc but im going back to 100% for sure, everything else really is shitcoins.\n\nI just want CDC coin to go back up a bit before I trade it, lost so much money on it",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia8l5c1",
                    "author": "Marcion_Sinope",
                    "score": 3,
                    "created_utc": 1653684618.0,
                    "response": "There's one lifeboat remaining. Get on it while you can.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia9e418",
                    "author": "s1lverbox",
                    "score": 3,
                    "created_utc": 1653699098.0,
                    "response": "Trading ALTs (spot)only works in uptrend only. Perps works in every moment of the cycle. \nAltcoins are simply leveraged long or short position against USD or BTC. Rewards denominated in BTC or USD are higher or losses are also bigger if position movie Ng against you. \n\nTo be successful, recognise the cycle and choose good moment to rotate in to BTC. \n\nSell ALTs for BTC and later move BTC to stables at right moment. When time is right DCA back to BTC and cold wallet  till next cycle. \n\nIf you skip rotating to BTC and keep ALTs you simply loosing more than just with BTC. \n\nI know this looks so easy and more difficult to do but many normal people need at least 3 cycles to get to life changing money 💰 which are in the bank and not in blockfolio. \n\nTake profit. Buy yourself watch, car or motorbike. Pay your debt and help family to live.life without stress. Next cycle you will have same or bigger amount of BTC due to your new skill of profit taking and rotating in right moment. \n\nAltcoins should be bought with BTC and not USD. USD should be at the end of the cycle. \n\nRight way is Btc(up-end of up only ATH)->atlcoins(ATH or silly number)->BTC(second retest of ATH or close to ATH)->USD.\n\nthat's all. After you get USD just wait for dump and DCA back to BTC. Viola.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia8daas",
                    "author": "solomonsatoshi",
                    "score": 8,
                    "created_utc": 1653681025.0,
                    "response": "Shitcoins are close to 100% worthless. Gambling with intent for gain has obvious risks.\n\nEven Bitcoin only has value if you understand what fiat debt slavery is and want to be part of the revolution seeking an alternative. \n\nThere is no guarantee of gain with Bitcoin . . .  but there is an ethos and purpose you may wish to support.\n\nUSD vs DCEP vs BTC",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia8uk7j",
                            "author": "sangderenard",
                            "score": 1,
                            "created_utc": 1653689118.0,
                            "response": "Who is to say what the final value could be monetarily, the value it has intrinsically, if you can say anything has intrinsic value, is profound",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia8d95b",
                    "author": "Longjumping-Low3164",
                    "score": 4,
                    "created_utc": 1653681011.0,
                    "response": "You have to understand that altcoins are like tulip mania. They are next to worthless. They can pump of course. But it is impossible to tell. Bitcoin is different.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia8ncvv",
                            "author": "Spl00ky",
                            "score": -5,
                            "created_utc": 1653685658.0,
                            "response": "Bitcoin is different simply because it was first. Doesn't mean bitcoin won't get dragged down along with shitcoins. But it will be the only one to survive.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia8qxob",
                                    "author": "Longjumping-Low3164",
                                    "score": 5,
                                    "created_utc": 1653687373.0,
                                    "response": "Being first in this case is not the only factor.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "ia8tzzw",
                                    "author": "sangderenard",
                                    "score": 3,
                                    "created_utc": 1653688848.0,
                                    "response": "It's fundamentally different in a way that it lacks unnecessary and imperfect compromises, since what other coins and tokens are are all attempts to wrestle bitcoin closer to the elements of financial policy that are broken",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia8cbmk",
                    "author": "Longjumping-Tie7445",
                    "score": 2,
                    "created_utc": 1653680591.0,
                    "response": "AAPL/AMZN/MSFT is to penny stock as BTC is to shitcoin.\n\nYou *can* speculate on penny stocks if you want, just realize what you’re doing and that it’s unnecessary to do so.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia8sjh6",
                    "author": "Marc-Thompson",
                    "score": 2,
                    "created_utc": 1653688145.0,
                    "response": "Cut loses and hold fiat, i think btc will go lower soon. patience is required",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia8bup6",
                    "author": "OrangeHODLr",
                    "score": 2,
                    "created_utc": 1653680380.0,
                    "response": "Get out now and into BTC.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia8f4aa",
                    "author": "SickBoyNoFuture",
                    "score": 1,
                    "created_utc": 1653681854.0,
                    "response": "Bro, buy BTC until it so cheap!!!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia8qq4s",
                    "author": "G405TX",
                    "score": 1,
                    "created_utc": 1653687272.0,
                    "response": "Oh man, here we go... You're asking in a BTC sub.\n\nWhat do you expect?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaagv9v",
                            "author": "Rich_Search2096",
                            "score": 1,
                            "created_utc": 1653724078.0,
                            "response": "I know I know... But I tried posting in other crypto subs and they deleted the post. Even with the bias, there are some great insights in this comment section.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia8i99j",
                    "author": "EQfanatic90",
                    "score": -5,
                    "created_utc": 1653683282.0,
                    "response": "Btc only has value because we say it does. Alt coins have value because often they are either utility or a “share” of a protocol that offers some type of service. I feel like 90% of ppl bashing alt coins just don’t understand the perks that come with decentralized finance protocols. If your buying alts without reading white papers/docs/medium articles and participating within the ecosystems then yes your better off just buying btc.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia8lkga",
                            "author": "98gffg7728993d87",
                            "score": 1,
                            "created_utc": 1653684816.0,
                            "response": "Any type of money fundamentally only has value because we say it does",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia8lygr",
                                    "author": "EQfanatic90",
                                    "score": -3,
                                    "created_utc": 1653685001.0,
                                    "response": "Your right. Way to go. You have it all figured out.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia8p3h3",
                                            "author": "solomonsatoshi",
                                            "score": 5,
                                            "created_utc": 1653686491.0,
                                            "response": "Shitcoin/alts are not truly decentralised. Only Bitcoin is.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia8w2pi",
                                                    "author": "sangderenard",
                                                    "score": 1,
                                                    "created_utc": 1653689857.0,
                                                    "response": "is it accurate to say anything an altcoin can do bitcoin could do with an application using bitcoin as collateral to sort out higher speed operations whose sum can be recorded at regular or necessary intervals to the blockchain. Can you not scale as much as you want, as fast and as wide, so long as you can carry collateral for operations and report eventual outcomes slow enough for bitcoin. Apologies if this is a dumb question, Ive got bitcoin stars in my eyes",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "ia8uw6i",
                                            "author": "ikkatop",
                                            "score": 2,
                                            "created_utc": 1653689277.0,
                                            "response": "__YOU'RE__ right.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia8h014",
                    "author": "floorcondom",
                    "score": 1,
                    "created_utc": 1653682710.0,
                    "response": "How are you sleeping?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia8kpwj",
                    "author": "RoscoRoscoMan",
                    "score": 1,
                    "created_utc": 1653684419.0,
                    "response": "I'd move everything to btc asap",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia8mx7b",
                    "author": "Mallardshead",
                    "score": 1,
                    "created_utc": 1653685453.0,
                    "response": "Yes:\n\n[https://www.reddit.com/r/Bitcoin/comments/uybyho/fat\\_protocol\\_thesis/?utm\\_source=share&utm\\_medium=web2x&context=3](https://www.reddit.com/r/Bitcoin/comments/uybyho/fat_protocol_thesis/?utm_source=share&utm_medium=web2x&context=3)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia8ottl",
                    "author": "dadlif3",
                    "score": 1,
                    "created_utc": 1653686364.0,
                    "response": "Alts will continue to wither on the vine, most will never recover.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia8s5gw",
                    "author": "Pineapple_Massacre",
                    "score": 1,
                    "created_utc": 1653687958.0,
                    "response": "Cut your losses. Hope will not save you from the stampede heading towards the door.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia98d7o",
                    "author": "Farrellfernandez",
                    "score": 1,
                    "created_utc": 1653696056.0,
                    "response": "Bitcoin rules,All the other Coins are Copy Cats,or Scam Coins.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia9al1c",
                    "author": "ApplicationNearby320",
                    "score": 1,
                    "created_utc": 1653697215.0,
                    "response": "Shit coins pump more than BTC",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia9yvba",
                    "author": "jacklucas_",
                    "score": 1,
                    "created_utc": 1653710271.0,
                    "response": "AGREE: Trading ALTs (spot)only works in uptrend only. Perps works in every moment of the cycle. Altcoins are simply leveraged long or short position against USD or BTC. Rewards denominated in BTC or USD are higher or losses are also bigger if position movie Ng against you.  \nTo be successful, recognise the cycle and choose good moment to rotate in to BTC.  \nSell ALTs for BTC and later move BTC to stables at right moment. When time is right DCA back to BTC and cold wallet till next cycle.  \nIf you skip rotating to BTC and keep ALTs you simply loosing more than just with BTC.  \nI know this looks so easy and more difficult to do but many normal people need at least 3 cycles to get to life changing money 💰 which are in the bank and not in blockfolio.  \nTake profit. Buy yourself watch, car or motorbike. Pay your debt and help family to live.life without stress. Next cycle you will have same or bigger amount of BTC due to your new skill of profit taking and rotating in right moment.  \nAltcoins should be bought with BTC and not USD. USD should be at the end of the cycle.  \nRight way is Btc(up-end of up only ATH)->atlcoins(ATH or silly number)->BTC(second retest of ATH or close to ATH)->USD.  \nthat's all. After you get USD just wait for dump and DCA back to BTC. Viola.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaa73oa",
                    "author": "4-1-2022",
                    "score": 1,
                    "created_utc": 1653715944.0,
                    "response": "I did exactly this in 2018. Bit the bullet took the loss, and kept stacking BTC only.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaageqd",
                            "author": "Rich_Search2096",
                            "score": 1,
                            "created_utc": 1653723659.0,
                            "response": "Years later, how do you feel about going all on on BTC including those loses?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia8mg0h",
                    "author": "heyhihowyahdurn",
                    "score": 0,
                    "created_utc": 1653685229.0,
                    "response": "I think it depends how much you have. If it's less than say $100 it won't make much of a difference either way. But if they're a substantial amount theres a good chance they won't ever recover. You could wait for the next bull market and find out but theres no guarantee's.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}