{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uqpaiu",
            "title": "When my friends say \" Bitcoin and cryptocurrencies Are Scam\" if i could do this i do. Idiots 🤣. still in 19 century",
            "url": "https://i.redd.it/p5wlu2qk6sz81.jpg",
            "author": "AggressiveAwareness2",
            "created_utc": 1652681999.0,
            "score": 20,
            "num_comments": 10,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8shdxw",
                    "author": "MorrisSchaefer",
                    "score": 4,
                    "created_utc": 1652682584.0,
                    "response": "Cryptocurrencies are scams. Bitcoin is not.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8slud6",
                            "author": "Asum_chum",
                            "score": 2,
                            "created_utc": 1652686226.0,
                            "response": "Yep, OPs friends are 50% correct.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8sikwx",
                            "author": "ndgoLiberty",
                            "score": 1,
                            "created_utc": 1652683533.0,
                            "response": "This right here. Yes.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8si1i1",
                            "author": "chente08",
                            "score": -2,
                            "created_utc": 1652683108.0,
                            "response": "Wrong",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8solk8",
                    "author": "Verallendingen",
                    "score": 1,
                    "created_utc": 1652688655.0,
                    "response": "they are 50% right.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8sjdpl",
                    "author": "ProperProfit2724",
                    "score": 1,
                    "created_utc": 1652684174.0,
                    "response": "Bruh what",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8sijug",
                    "author": "ndgoLiberty",
                    "score": 0,
                    "created_utc": 1652683510.0,
                    "response": "They’re half right. cRyPtOe is a scam. All of it every little bit.\n\nThere is only one successful cryptocurrency and that is bitcoin.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8sm5le",
                    "author": "Regular_Chapter_788",
                    "score": 0,
                    "created_utc": 1652686504.0,
                    "response": ">When my friends say \" Bitcoin and cryptocurrencies Are Scam\"\n\nThey are half right.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8snutd",
                    "author": "blopblipbloup",
                    "score": 1,
                    "created_utc": 1652687998.0,
                    "response": "We are buying Bitcoin at a discount, they will buying it at a fair price",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8srslm",
                    "author": "aj2704",
                    "score": 1,
                    "created_utc": 1652691589.0,
                    "response": "It can't actually go to zero. Someone would always be willing to pay a dollar for it. At least that much.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uqp879",
            "title": "Mentor Monday, May 16, 2022: Ask all your bitcoin questions!",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uqp879/mentor_monday_may_16_2022_ask_all_your_bitcoin/",
            "author": "rBitcoinMod",
            "created_utc": 1652681735.0,
            "score": 5,
            "num_comments": 3,
            "subreddit": "Bitcoin",
            "selftext": "Ask (and answer!) away! Here are the general rules:\r\n\r\n* If you'd like to learn something, ask.\r\n* If you'd like to share knowledge, answer.\r\n* Any question about Bitcoin is fair game.\r\n\r\nAnd don't forget to check out /r/BitcoinBeginners\r\n\r\nYou can sort by new to see the latest questions that may not be answered yet.",
            "stickied": true,
            "comments": [
                {
                    "id": "i8sto19",
                    "author": "Crawlero",
                    "score": 1,
                    "created_utc": 1652693299.0,
                    "response": "So, lightning, I am asking myself whether it solves our scaling problems whatsoever (and I am a typing chimp so correct me where I'm wrong here).  Ideally, it allows us to compress the number of transactions required on-chain, but there is presumably a theoretical limit to this right?  At the end of the day, if there are 1 million users that would like to settle, that is an absolute minimum of 1 million transactions sent to the chain, even if this cuts down from 10 or 100 million transactions this starts to look worrisome.  What happens when we have 50 million people using lightning, all who would like to settle once per month, its mathematically impossible, isn't it?  I know layer 1 isn't supposed to be daily transactions, but will normal people EVER be able to afford to settle or perform on chain transactions?  Will this mean that lightning will be the only form of bitcoin many will ever see?  Really, if opening a channel requires an on-chain action (from what I understand it does), will that make it impossible for normal people to even open a payment channel?  Will we all be at the mercy of trust based bitcoin bankers, transacting on layer 3?\n\nEdit\\* and to be clear, I love bitcoin, I just practice adversarial thinking.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8sy210",
                            "author": "CallingVoid",
                            "score": 1,
                            "created_utc": 1652697107.0,
                            "response": "You don't need to settle once a month, and you probably won't. A lightning channel can be used for as many transactions as you like for as long as possible. There are also potential solutions to channel creation in the pipeline (like channel factories) that could mitigate the issue.\n\nIf hyperbitcoininisation comes to pass then the base layer will become fiscally impractical for the every day user to interact with (but critically, not impossible at all). It may be that only big companies end up settling on chain. And maybe that is ok! Buying and using sats on the lightning network is the same as buying and selling bitcoin.\n\nWho knows what L3 on top of lightning might look like. It is possible that in the distant future it's the principal way to handle bitcoin, but there is nothing to suggest you will be at the mercy of a bitcoin bank any more than L2 makes you at the mercy of one imo.\n\nHell, as robust as lightning is, it may be that someone comes up with something even better and everyone jumps ship for that.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8svj54",
                    "author": "Stop_Technical",
                    "score": 1,
                    "created_utc": 1652694989.0,
                    "response": "I live in a country where crypto gains are taxed 56% and losses can be deducted 26%, making it very hard to trade. Now, I got a stash of crypto, mainly BTC that I have been adding to since '17. Even if I'm irresponsibly long BTC, compared to everything else in my private economy 🙈- I kindda feel like its a forced hold, through the bull/bear cycles, as brutal as that has been. Is it, or is there a better way? Thx🙏",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}