{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uvniud",
            "title": "I'm going to be paying for my Bitcoin Pizza with Strike so I keep my stash. But, here is my salute to Laszlo!",
            "url": "https://anchor.fm/bitcoinbulletin/episodes/52-Bitcoin-Pizza-Day-May-22nd--2022-e1itdq2",
            "author": "cocoabeachbrews",
            "created_utc": 1653263876.0,
            "score": 1,
            "num_comments": 0,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uvnfrw",
            "title": "My friend is a catfish",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uvnfrw/my_friend_is_a_catfish/",
            "author": "Ok_Cycle5178",
            "created_utc": 1653263575.0,
            "score": 1,
            "num_comments": 1,
            "subreddit": "Bitcoin",
            "selftext": "I am fed up now so I am writing this thread.\nMy old friend from Pakistan had a UK girl who used to supply him with pictures to grow his twitter and crypto paid group. \n\nHis paid group failed because bitcoin dumped but now he's doing paid promotions for dog shit projects \nHe is at 130.000 followers now. \nYears ago the girl stopped supplying pictures but he kept re using her old pictures to get paid promotions\n\nHe even started flirting with dumb men talking about sex and feet pictures to get free bitcoin\nAt this point he should get a sex change but he doesn't stop \n\nHow can I stop this guy from catfishing for bitcoin",
            "stickied": false,
            "comments": [
                {
                    "id": "i9mh01k",
                    "author": "ndgoLiberty",
                    "score": 1,
                    "created_utc": 1653263687.0,
                    "response": "Idk how this is related to bitcoin but your friend needs a J O B",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uvnel4",
            "title": "6 best cryptocurrencies to buy now for a solid portfolio",
            "url": "https://cryptosorted.info/best-cryptocurrencies-to-buy/",
            "author": "CryptoSorted",
            "created_utc": 1653263459.0,
            "score": 0,
            "num_comments": 3,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9mi0o7",
                    "author": "swgo1",
                    "score": 1,
                    "created_utc": 1653264227.0,
                    "response": "BTC, BTC, BTC, BTC, BTC, and BTC.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9mivz3",
                    "author": "PerformanceVarious45",
                    "score": 1,
                    "created_utc": 1653264688.0,
                    "response": "Get rekt shitcoiners",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uvnb8p",
            "title": "Are we using bitcoin the wrong way?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uvnb8p/are_we_using_bitcoin_the_wrong_way/",
            "author": "danielqba",
            "created_utc": 1653263141.0,
            "score": 1,
            "num_comments": 15,
            "subreddit": "Bitcoin",
            "selftext": "I am fairly new to crypto (bitcoin) and all I keep hearing is “bitcoin is the future of money” but actually, currently, it may not be. \n\nSince all I read/see around is everyone trying to hodl or buy the dip, or sell, and bulls and bears.\n\nBut does anyone really uses it like money? Apart from El Salvador people, do you go get a coffee and pay with your bitcoins? Or is it a mentality that someday you will regret since what you payed for that coffee is now worth millions or whatever. \n\nI understand that everything began with a pizza, and yes, with current value, that was an expensive pizza, but it was what started the wheel. \n\nDo we use bitcoin in everyday transactions (bills, goods, taxes, etc) or do we hodl until we are rich?\n\nAre we using bitcoin as money or just as a store of value?\n\nEnglish is not my first language, and I am fairly new to bitcoin, be kind lol.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9mgpld",
                    "author": "thisischalupa",
                    "score": 2,
                    "created_utc": 1653263530.0,
                    "response": "I use it as a store of value. I’m not too worried about current prices or short term future prices. I’m in for the long haul.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9mgv8w",
                            "author": "danielqba",
                            "score": 1,
                            "created_utc": 1653263615.0,
                            "response": "That’s my point, then bitcoin is not “money” is just something like gold or any metal that we expect to rise in value.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9mild2",
                                    "author": "lsmod1",
                                    "score": 1,
                                    "created_utc": 1653264532.0,
                                    "response": "Gold, silver were money long time ago. Gold coin! But there were counterfeiting issues and difficulty to send it abroad.\nBTC can be a mean of exchanges too. Hard money seems a good definition for BTC. One days billions will want it",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9mno3m",
                                    "author": "solomonsatoshi",
                                    "score": 1,
                                    "created_utc": 1653267208.0,
                                    "response": "Money without SoV is bad money. Bitcoin SoV is inherent and so is the basis for good money. \n\nHowever use of Bitcoin is highly obstructed by the legacy fiat debt slavery banking cartel in most jurisdictions.\n\nLightening Network delivers superior MoE - where regulatory powers allow it!",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9mi6v6",
                                    "author": "PerformanceVarious45",
                                    "score": 1,
                                    "created_utc": 1653264317.0,
                                    "response": "Ok...",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9mj1sw",
                    "author": "ETAVEGAMING",
                    "score": 1,
                    "created_utc": 1653264772.0,
                    "response": "There are stages to adoption. Adoption is not a guarantee.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9mkgp9",
                    "author": "solomonsatoshi",
                    "score": 1,
                    "created_utc": 1653265515.0,
                    "response": "Payments channels are still highly obstructed in most jurisdictions- obstructed by the fiat debt slavery cartel.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9mkwkc",
                            "author": "danielqba",
                            "score": 1,
                            "created_utc": 1653265747.0,
                            "response": "That might be, but if it is P2P what stops me to sell you something and accept Bitcoin? IDK, I am not from USA.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9ml4me",
                    "author": "SmoothGoing",
                    "score": 1,
                    "created_utc": 1653265866.0,
                    "response": "There are no explicit requirements. Use it however you want. It isn't money, it isn't currency, it isn't digital gold, it isn't an inflation hedge, it isn't freedom, it isn't any of the other nonsense narratives. It is whatever you want it to be for you. Save it, spend it, trade it, give it away to earn interest. Nobody cares. Go nuts.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9mln39",
                            "author": "danielqba",
                            "score": 1,
                            "created_utc": 1653266139.0,
                            "response": "lol I actually like your response. I completely agree with you!\n\nBut I would really like it to become money!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9mh0ox",
                    "author": "Accomplished-Row5989",
                    "score": 1,
                    "created_utc": 1653263697.0,
                    "response": "You need to run bitcoin if you really want to use it the right way by that i mean have a node. umbrel or mynodebtc software great way to start",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9mh6ds",
                            "author": "danielqba",
                            "score": 2,
                            "created_utc": 1653263782.0,
                            "response": "I do. I am running a node.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9mmdea",
                    "author": "Leading_Zeros",
                    "score": 1,
                    "created_utc": 1653266528.0,
                    "response": "People have this wierd percption that money is only for use in the act of exchange for goods. When that is the precise moment you stop using a portion of money and the merchant begins using that money. Money is the tool that allows you to store the value of your labour through time.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9mmlzr",
                    "author": "ralphyb0b",
                    "score": 1,
                    "created_utc": 1653266656.0,
                    "response": "Nic Carter talks about it being the base layer of money on the Lex Friedman pod. When you swipe your Visa card, you’re about 5+ layers removed from the base layer of the US financial system and it doesn’t actually get settled until around a month later.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9mndlr",
                    "author": "uncontrollableop",
                    "score": 1,
                    "created_utc": 1653267057.0,
                    "response": "when a new money replaces an old money, the old money is the one that gets spent. \n\nbitcoin also doesn't enjoy the same tax benefits that fiat currency does. so govt is punishing bitcoin users for using a new kind of money.  \n\nall in due time though.  \n\nfurther, i think you're conflating currency and money. which is natural having grown up in a world where fiat currency has no pretense of backing.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uvndwp",
            "title": "Crypto Enthusiasts Celebrate Bitcoin Pizza Day All Over the World",
            "url": "https://thenewscrypto.com/crypto-enthusiasts-celebrate-bitcoin-pizza-day-all-over-the-world/",
            "author": "Loud_Dingo7261",
            "created_utc": 1653263396.0,
            "score": 0,
            "num_comments": 1,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9moj5p",
                    "author": "coinfeeds-bot",
                    "score": 1,
                    "created_utc": 1653267653.0,
                    "response": "tldr; Bitcoin Pizza Day honors the day in 2010 when a Florida-based BTC miner purchased two Papa John’s pizzas using Bitcoin. Hanyecz shelled out 10,000 BTC for the purchase of a pizza, which was worth around $41 at the time. Every year on May 22, Bitcoin enthusiasts gather to purchase pizza and eat it together and celebrate it.\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR.*",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uvnb0w",
            "title": "In the memory of most expensive Pizza 🍕 I’m buying pizza and dip tonight.😂",
            "url": "https://i.redd.it/qu5kc3mj64191.jpg",
            "author": "DjVutra",
            "created_utc": 1653263120.0,
            "score": 0,
            "num_comments": 1,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9mp23j",
                    "author": "RogerWilco357",
                    "score": 1,
                    "created_utc": 1653267918.0,
                    "response": "It wasn't the most expensive pizzas, it was $40.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}