{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uw87j8",
            "title": "I can't really describe how much I love it!!",
            "url": "https://i.redd.it/h9tklg3f1a191.png",
            "author": "Away-Expert986",
            "created_utc": 1653334120.0,
            "score": 226,
            "num_comments": 36,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9qthqy",
                    "author": "BashCo",
                    "score": 1,
                    "created_utc": 1653348997.0,
                    "response": "There are many spammers on reddit who try to sell t-shirts. Usually they will post a pic, then cheat the votes to gain visibility. Then they'll use a sock puppet account like u/Old-Presentation4719 to post something like, *\"Wow! where did you get it??\"* and then the OP will drop some sketchy link you've never heard of. Whether it's a scam or just shitty marketing, don't fall for it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9q2s7i",
                    "author": "Good-Rooster-9736",
                    "score": 7,
                    "created_utc": 1653336647.0,
                    "response": "I have the same shirt. Wear it often and it’s always a conversation starter. For better or worse",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9q085k",
                    "author": "ariN_CS",
                    "score": 13,
                    "created_utc": 1653335552.0,
                    "response": "True giga chad",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9qe0ph",
                            "author": "ibeforetheu",
                            "score": -3,
                            "created_utc": 1653341605.0,
                            "response": "just needs a shave and truly attractive.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9pyi0x",
                    "author": "4nelio",
                    "score": 2,
                    "created_utc": 1653334816.0,
                    "response": "The B$ caps are nice by merchandise9",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9qd7a6",
                    "author": "hcollector",
                    "score": 10,
                    "created_utc": 1653341231.0,
                    "response": "You should focus on your health, wealth comes second.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9q0kxh",
                    "author": "laziruss",
                    "score": 1,
                    "created_utc": 1653335700.0,
                    "response": "Have the exact same shirt and a hoodie just like it!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9q4khi",
                    "author": "stateofidleness",
                    "score": 4,
                    "created_utc": 1653337419.0,
                    "response": "Doesn’t this kinda advertise you have btc most likely? I feel like it makes you a target. Read an article (on Reddit I think) about criminals targeting people and mugging them for their crypto. \n\nBut all that aside, cool shirt! 😇",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9qjg8k",
                            "author": "Hefty_Jicama",
                            "score": 3,
                            "created_utc": 1653344132.0,
                            "response": "Everybody has money and is a target. That car you drive might say a lot more than a person with 0.001 btc because he has a shirt",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9qi4b0",
                            "author": "daterkerjabs",
                            "score": 2,
                            "created_utc": 1653343498.0,
                            "response": "nb: a lot of wallets allow you to have a phantom account that you can give a person if under duress",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9q3wn8",
                    "author": "Franzel-Pure-Net",
                    "score": 2,
                    "created_utc": 1653337137.0,
                    "response": "Should rather have gotten one that's standing on a small island with the way bitcoin price is dropping 🤣",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9q69dz",
                    "author": "johndoeisback",
                    "score": 1,
                    "created_utc": 1653338158.0,
                    "response": "Am I the only one who reads this shirt as *\"I invested a couple of bucks in bitcoin, please go ahead and buy some so the price goes up and I can sell\"* ?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9q98c4",
                            "author": "HurricaneHarvey7",
                            "score": 1,
                            "created_utc": 1653339454.0,
                            "response": "I guess someone like you would see it that way.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9qjxz5",
                    "author": "CWB4LIFE73",
                    "score": 2,
                    "created_utc": 1653344364.0,
                    "response": "I wonder how much he loved it when it went from 68,000 back to 30,000",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9qcf1h",
                    "author": "apexfurryhunter",
                    "score": -2,
                    "created_utc": 1653340878.0,
                    "response": "fat",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9r014d",
                            "author": "Main_Sergeant_40",
                            "score": 4,
                            "created_utc": 1653352261.0,
                            "response": "Be a better person",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9r42qd",
                    "author": "pob125",
                    "score": 1,
                    "created_utc": 1653354209.0,
                    "response": "Ffs...crypto merch is really a sad point in life for me....if its on a footy shirt or f1 or as a sponsorship fair enough....but like if my missus bought me a btc birthday cake...I'd be like wtf you doing....\"oh you like btc\"....no bitch its an investment...wheres my fucking nasqaq crackers...I like that too...because it makes money go up....I don't a fucking cake or tee shirt to tell every bastard where my money is.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9rbe0s",
                            "author": "nagato1125",
                            "score": 1,
                            "created_utc": 1653357718.0,
                            "response": "how abt a reddit award cake? 😅",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9qg186",
                    "author": "Argyrus777",
                    "score": 1,
                    "created_utc": 1653342529.0,
                    "response": "I like it but would rather just have the photo without the bitcoin at the bottom. Just the little flag is enough for me",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9qhp5r",
                    "author": "Satoshiman256",
                    "score": 1,
                    "created_utc": 1653343303.0,
                    "response": "I avoid letting anyone know I might have crypto.  I don't have crypto.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9r08l5",
                    "author": "torontowatch",
                    "score": 1,
                    "created_utc": 1653352365.0,
                    "response": "where did you get this tshirt from?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9r35j7",
                    "author": "pob125",
                    "score": 1,
                    "created_utc": 1653353775.0,
                    "response": "Its like loving a fake girlfriend on the Internet that you will never get to kiss because you will be too scared to touch lips...but you'll HODL for life...and for you that's enough.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9rc64b",
                    "author": "avibox954",
                    "score": 1,
                    "created_utc": 1653358092.0,
                    "response": "would look nicer if the flat earth was below",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9qdzf6",
                    "author": "ibeforetheu",
                    "score": -3,
                    "created_utc": 1653341588.0,
                    "response": "haha nice shirt, but it would look a bit better if your belly wasn't so full from all the BTC gains!! No more BTC Pizzas!!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9r062l",
                            "author": "Main_Sergeant_40",
                            "score": 3,
                            "created_utc": 1653352329.0,
                            "response": "And you’d have friends if you were a better human being.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9r5iio",
                                    "author": "ibeforetheu",
                                    "score": 0,
                                    "created_utc": 1653354905.0,
                                    "response": "dude that was uncalled for. I was just making a joke poking fun. I'm fat too, and i'm sure you are too",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9q9jf4",
                    "author": "superboget",
                    "score": -2,
                    "created_utc": 1653339588.0,
                    "response": "How to get mugged in a single step",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uw67tl",
            "title": "WEF: Bitcoin can't be a currency because it relies on a trust network. Also WEF: Currency is about trust, which is why CBDC's will help re-establish trust in money.",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uw67tl/wef_bitcoin_cant_be_a_currency_because_it_relies/",
            "author": "Keith_Kong",
            "created_utc": 1653328786.0,
            "score": 48,
            "num_comments": 30,
            "subreddit": "Bitcoin",
            "selftext": "I highly recommend people watch how the World Economic Forum (WEF) and the International Monetary Fund (IMF) is framing Bitcoin in their CBDC talk:\n\n[https://www.youtube.com/watch?v=6194fpFP0AI](https://www.youtube.com/watch?v=6194fpFP0AI) (As I try to post this, it appears they took the video down... sus... the way their channel sensors, disables comments, etc. makes their whole agenda seem so much more authoritarian... another video from the forum talks about instilling trust in young people and it's all this BS about \"look here's a young person we brought so that young people have a say\"... no public dialogue allowed, only shows what they want you to see)\n\nThey are trying so hard to dismiss Bitcoin by framing the recent crash as a \"loss in trust\" for Bitcoin. There are points where they talk about how someone needs to be \"in charge of\" and \"responsible for\" the value of money. They given no further explanation, but simply posit the idea as a way to describe why Bitcoin cannot be money.\n\nIt's so blatantly contradictory to someone with a deeper knowledge of Bitcoins game theory, but what really scares me is their blatant attempts to call it a ponzi scheme while being careful not to directly say it. They talk more generally about \"pyramids\" in \"blockchain assets\" and then make sure to say something about Bitcoin right after, saying something like it's a \"real asset\" but \"not money\".\n\nI wasn't too concerned about CBDC's before recently and I still mostly see skeptics in this community as being a bit too conspiracy theorist... but there really is something to be worried about here. The people in these institutions are so disingenuous and are, at best, out of touch with the world. They are going to come down hard on Bitcoin with narratives and bad money with good rails.\n\nIt's more important than ever that Bitcoin becomes easier to understand and use.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9q1mof",
                    "author": "Nada_Lives",
                    "score": 21,
                    "created_utc": 1653336149.0,
                    "response": "Was Bitcoin invited to the conference? Probably not.\n\nBitcoin doesn't care.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9q54p8",
                            "author": "Keith_Kong",
                            "score": 1,
                            "created_utc": 1653337664.0,
                            "response": "I'm willing to bet quite a few hedging Bitcoin holders were indeed at the conference. Their words and their fears are not the same.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9q8gx4",
                    "author": "hominidnumber9",
                    "score": 13,
                    "created_utc": 1653339118.0,
                    "response": "WEF = Cringe",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9r6y7q",
                    "author": "mr_crackboy",
                    "score": 11,
                    "created_utc": 1653355600.0,
                    "response": "btc is a trustless network. Thats the whole point. Dont trust. Verify.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9r9zeb",
                            "author": "Keith_Kong",
                            "score": 5,
                            "created_utc": 1653357054.0,
                            "response": "In this context trust refers to the \"monetary value\" aspect of currencies. Bitcoin, just like every other currency, involves a network of trust that others will treat the ledger as if it holds value. This argument has been made by other Bitcoiners to explain why BCH and other forks don't magically hold their value regardless of being the same fixed supply monetary policy.\n\nWhere the IMF gets dishonest is when they say that this network of trust needs something \"backing\" it. In reality, given fiat is not actually \"backed\" by anything the only thing they are really doing is legalizing its use as an untaxed (in terms of capital gains) medium of exchange. In doing so, they grant themselves power to debase that medium of exchange as they see fit.\n\nInversely, Bitcoin draws trust from the fact that it doesn't give anyone the right to debase it. The remaining barrier is to reach a much larger, more stable market cap where the people can finally rise up and demand it be made a legal, untaxed medium of exchange. They will be left with no more excuses and it will either result in civil unrest or a relinquishing of power... and least that's my hope.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9rovd3",
                                    "author": "meatismoydelicious",
                                    "score": 1,
                                    "created_utc": 1653364801.0,
                                    "response": "By \"anti-trust\", in the white paper it's pretty clearly stated as meaning one doesn't have to verify a transaction.  through third parties. The ledger holds its value in that after any mistake in the chain, it becomes exponentially more difficult for a similar mistake to happen again and that it will be corrected in time regardless. Monetary value has nothing do with the discussion of bitcoin's nature-it's about being your own bank. If 1btc=1btc, monetary value be damned. This becomes even more true the more the supply is mined and prices stabilize.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9rqz7y",
                                            "author": "Keith_Kong",
                                            "score": 2,
                                            "created_utc": 1653366073.0,
                                            "response": "Right, it’s trustless transactions. Agreed.\n\nIt’s just not fundamentally true to say that 1 BTC holds its purchasing power independent of its spot price or the perception of merchants willing to accept it at that spot price.\n\nI don’t think the white paper was claiming that the purchasing value would be trustless… doesn’t matter if it was because it’s fundamentally not true.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9s7xct",
                                                    "author": "bobderbobs",
                                                    "score": 2,
                                                    "created_utc": 1653379240.0,
                                                    "response": "Same thing with gold. You have to trust it holds its monetary value.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9t5kqg",
                                                            "author": "Keith_Kong",
                                                            "score": 1,
                                                            "created_utc": 1653401910.0,
                                                            "response": "Yeah that’s my point it’s true for any medium of exchange, any currency. It’s not a flaw with Bitcoin, just a statement of necessary trust being an element.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i9sn5tb",
                                                    "author": "meatismoydelicious",
                                                    "score": 1,
                                                    "created_utc": 1653392146.0,
                                                    "response": "That's not what trust means here dude. Lol",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9suj0l",
                                    "author": "HumbleAbility",
                                    "score": 1,
                                    "created_utc": 1653396537.0,
                                    "response": "I think of fiat as an undercollateralized Algo Ponzi coin. Except there's one big difference. If confidence in the system is lost there are dudes with guns who will use violence against you to support the peg.\n\nFiat is backed by faith in the system and the violence of the fiat maxis. The WEF is just a bunch of toxic fiat maxis.\n\nWell, I read somewhere that the government is going to look at the accounting rules for bitcoin for corporations. I think that'll go a huge way to actually letting public investors know what's actually happening with their investment. It's definitely a step forward, but it seems like it's being treated as property, which is fine for now. Legal and untaxed might be on the table after bitcoin is bigger than gold. But bitcoin will need to be the basis of cyber defense in that scenario imo. Incurring a cost of action on the internet would really fix so much, but it seems like it'll be a while before any of that infrastructure will be built.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9r3gb1",
                    "author": "SupplyChainMuppet",
                    "score": 4,
                    "created_utc": 1653353917.0,
                    "response": "All my homies hate the WEF.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9qe0oj",
                    "author": "bittenbycoin",
                    "score": 7,
                    "created_utc": 1653341605.0,
                    "response": "Thanks to bitcoin, the bottom 6 billion people on the planet have direct access to, at a minimum, a savings account and debit card (well, equivalent to a debit card), when storing or spending using the \"free for all to access\" bitcoin network . This as opposed to now, when the bottom 6 billion are unbanked and shut out from economically participating in this world by \"trusted 3rd parties\" gatekeepers. \n\nBitcoin loves all 8 billion of you equally, and only cares that the bitcoin you send is authentic and isn't being double spent. Why on earth would these three letter organizations not support and encourage bitcoin for every darn person on the planet is beyond my capacity to understand.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9qjww7",
                            "author": "Keith_Kong",
                            "score": 4,
                            "created_utc": 1653344350.0,
                            "response": "If we're being honest Bitcoin loves the more technically savvy still. From a buy and hodl standpoint most people can figure it out if they put the time into it–but using it as a medium of exchange over lightning is not super straight forward just yet. Especially if you're looking for a sovereign solution to this.\n\nStrike is a great start, but even there it's a bit too complex to manage an on-chain savings wallet along with a smaller amount on their lightning wallet to use for spending. I'm really looking forward to Block's multisig solution. They describe a single wallet where spending with their lightning integration limits spending such that you are protected from total loss under most forms of theft/attack.\n\nThis stuff needs to become much more app centric without being centralized. It will always be a bit more complex but I think we're going to see much better solutions in the next couple of years.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9ryxys",
                                    "author": "rocketeer8015",
                                    "score": 1,
                                    "created_utc": 1653371624.0,
                                    "response": "Muun wallet is at least as simple as any banking app, simpler if we are honest and only requires a smartphone which are prevalent in even poor countries. It is totally straight forward. \n\nYou can for example make an invoice to sell a chicken for $20 over lightning, that creates a QR code the other guy scans and $20 worth of bitcoin wander into your wallet immediately, you could then turn around and pay a dozen other peoples to buy a variety of vegetables.\n\nI find it very intuitive and as long as you use it as a medium of exchange the volatility of bitcoin hardly matters.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9rzl1s",
                                            "author": "Keith_Kong",
                                            "score": 1,
                                            "created_utc": 1653372117.0,
                                            "response": "Yeah don’t have personal experience with muun but I’ve heard good things. It’s just not obvious to use them I guess.\n\nIt’s also not obvious where you can buy those chickens with muun (I know that Strike has opened up a lot of retail now, mainly just speaking to the mind-space of the average person).\n\nIt’s still very non-obvious why you would switch to using Bitcoin for payments in most places. Part of that is a multitude of apps that need to connect together (can you buy Bitcoin on muun wallet or do you have to buy somewhere else and then transfer it over? Etc). Part of it is the volatility (we just haven’t grown large enough to really treat as more than a long term store of value).",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9s01mw",
                                                    "author": "rocketeer8015",
                                                    "score": 1,
                                                    "created_utc": 1653372475.0,
                                                    "response": "I was thinking more in a p2p context. You know, people **earning** bitcoin and then spending bitcoin for necessities. The idea being that you just want to trade work/goods for other work/goods, you just need a layer between that to turn it divisible. That layer can be cash, salt, casino chips, bitcoin, Paypal, doesn’t really matter.\n\nIt’s obviously attractive to those we call unbanked, if you are unbanked funding your PayPal presents the same challenges as funding a bitcoin wallet.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9s0vcq",
                                                            "author": "Keith_Kong",
                                                            "score": 1,
                                                            "created_utc": 1653373148.0,
                                                            "response": "Yeah I get it, I liking “playing” unbanked but I personally don’t have the network to really do that for real. My job pays dollars, the local stores don’t have NCR and Blackhawk machines (some use square terminals but not sure that works with Bitcoin yet).\n\nI can see that we are technologically there, but I wouldn’t call the infrastructure “complete” in the same way I wouldn’t call a few paved roads in the early 1900’s “infrastructure complete”.\n\nIt’s possible, now we just need the widespread adoption of both the currency and the payment rails. Pretty bullish on this btw, just think there’s more to come in the next 2-5 years.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9sjcw5",
                            "author": "Stunning_Novel9398",
                            "score": 1,
                            "created_utc": 1653389454.0,
                            "response": "Sadly around a third of people have never seen the internet so…",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9q24wo",
                    "author": "Nada_Lives",
                    "score": 3,
                    "created_utc": 1653336364.0,
                    "response": "[https://www.youtube.com/watch?v=6194fpFP0AI](https://www.youtube.com/watch?v=6194fpFP0AI) is a \"private video\" according to YouTube.\n\nThey know about these things much better than you.\n\nTrust them.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9q2uza",
                            "author": "Keith_Kong",
                            "score": 6,
                            "created_utc": 1653336681.0,
                            "response": "Yup I was watching it as I made this post, suddenly the video stopped, reloaded as a “private video”, and suddenly their extremely significant plans for a CBDC goes dark.\n\nCombine that with the fact they don’t let anyone post comments on their videos… no desire for actual public dialogue. They just want to put some puppet figure heads and naive “young people” that are vetted to be in-line with their narratives.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9sus4i",
                                    "author": "HumbleAbility",
                                    "score": 1,
                                    "created_utc": 1653396672.0,
                                    "response": "These are the same people who build bot armies on Twitter to make it seem like their narrative is resonating with people.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9q40t0",
                    "author": "dima054",
                    "score": 3,
                    "created_utc": 1653337185.0,
                    "response": "They aren't out of touch. It's just that their world isn't your world.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9qfc1i",
                            "author": "PrognosticalSon",
                            "score": 4,
                            "created_utc": 1653342205.0,
                            "response": "Their world will never be my world. I'll see to it, with my last breath if I have to.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9q4zp4",
                            "author": "Keith_Kong",
                            "score": 1,
                            "created_utc": 1653337603.0,
                            "response": "That's kind of the definition of \"out of touch\" but I know what you're saying. That's why I used the phrase \"at best\".",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9s924n",
                    "author": "metalzip",
                    "score": 2,
                    "created_utc": 1653380290.0,
                    "response": "You will eat ze bugs.\n\nYou will get the c19 (and monkeypox) shot.\n\nYou will live in ze pod.\n\nYou will trade ze POS shitcoins.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ra3vp",
                    "author": "Jetjones",
                    "score": 1,
                    "created_utc": 1653357113.0,
                    "response": "Video was deleted",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ra8lo",
                            "author": "Keith_Kong",
                            "score": 2,
                            "created_utc": 1653357176.0,
                            "response": "Yup, noted it in my post. Sus.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9rau4y",
                                    "author": "Jetjones",
                                    "score": 0,
                                    "created_utc": 1653357460.0,
                                    "response": "Sorry, read diagonally at first. I mean.. they’re not wrong to doubt it. Nobody is wrong to doubt bitcoin. If btc does grow back to a new ATH once the economy gets better, I can see an even bigger wave of believers happening. The more bitcoin will grow, the steadier it will become. Most people will adhere to it when it’s mostly stable. Who can blame them? Nobody want their wealth to go 80% down",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9rcmc1",
                                            "author": "Keith_Kong",
                                            "score": 2,
                                            "created_utc": 1653358304.0,
                                            "response": "It’s their reasoning that is dangerous. Bitcoin has to grow before we can even consider it more than a long term store of value. They are trying to claim that someone needs to be in charge, establishing a way to block it should it reach that stable future we hope to see. CBDC’s are a dangerous tool that will improve the rails of fiat without actually fixing it. They will then do everything to keep Bitcoin smaller and volatile, hoping they can get it to kill itself. Luckily, without going full authoritarian I don’t think they can pull it off.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "id": "uw8c7o",
            "title": "This gas would have stayed in the ground if it wasn't for bitcoin",
            "url": "https://thebulletin.org/2022/05/this-gas-would-have-stayed-in-the-ground-if-it-wasnt-for-bitcoin/",
            "author": "Prunestand",
            "created_utc": 1653334463.0,
            "score": 6,
            "num_comments": 28,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9q9f8n",
                    "author": "superboget",
                    "score": 3,
                    "created_utc": 1653339538.0,
                    "response": "So... Is this post against Bitcoin then ?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9qmboc",
                    "author": "explorer-9",
                    "score": 2,
                    "created_utc": 1653345498.0,
                    "response": "Upvoting since, the author has done good original research from what I see, not many authors bother these days. I don't know if they've misunderstood these businesses or if these mining businesses are literally digging up gas i.e. not following the more profitable route of harnessing flared gas, which has a high methane content. Good content about flared gas here https://youtu.be/kiiLzsleuwU. Would be good to see more research into these businesses, I'm sure they'd like to harness flared gas as it's there - they wouldn't need to buy gas wells and open them up.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9q6fff",
                    "author": "SmoothGoing",
                    "score": 3,
                    "created_utc": 1653338232.0,
                    "response": "That gas was OK in the ground. Pulling it out to burn it for bitcoin security which doesn't need more of it isn't a good justification.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9qghnz",
                    "author": "PrognosticalSon",
                    "score": 1,
                    "created_utc": 1653342736.0,
                    "response": "Cringe FUD article. \n \nCompanies will seek to increase profits any way they can.\n \nIf cubbing baby seals were profitable, then that would happen too. Let's ban hammers.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9rmsv1",
                            "author": "EvaUnit_03",
                            "score": 1,
                            "created_utc": 1653363570.0,
                            "response": "you havent heard have you... https://priceonomics.com/the-business-of-seal-clubbing/",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9qjulz",
                    "author": "BitcoinUser263895",
                    "score": 1,
                    "created_utc": 1653344321.0,
                    "response": "I love this take on things. They contend that oil mining will just stop if Bitcoin doesn't help make it profitable.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9rk9to",
                    "author": "DudeBroManCthulhu",
                    "score": 1,
                    "created_utc": 1653362165.0,
                    "response": "What about the gas from the burrito I ate?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9q44rh",
                    "author": "Crawlero",
                    "score": -7,
                    "created_utc": 1653337231.0,
                    "response": "Good, I'm looking forward to growing food year round in a 6B zone and sipping margaritas in Alaska.  CO2 makes up every organic entity on earth, the more of it we return to the environment the more life there will be. Tens of thousands of square miles of new coastal shelf will be created for the fish, the Savannah will turn green, and humanity will be rich.  See you there.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9q69bn",
                            "author": "SmoothGoing",
                            "score": 4,
                            "created_utc": 1653338157.0,
                            "response": "Yes 0.8 million people in Alaska will be happy with warmer climate. 1.5 billion people in India would not appreciate their country turning into a desert though.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9q8tt0",
                            "author": "phileo",
                            "score": 7,
                            "created_utc": 1653339276.0,
                            "response": "Yeah ... no. This is not how it works. What you get with too much CO2 is an environment like Venus. It's a cascading effect leading to draughts, hurricanes etc. Please read up on how CO2 impacts our climate. You won't be sipping margaritas in Alaska, nor anywhere else.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9qen80",
                                    "author": "Crawlero",
                                    "score": -1,
                                    "created_utc": 1653341892.0,
                                    "response": "Earth going into thermal runaway is not possible, and the idea of it falls on its face.  We would top out at 1000ppm, roughly where we were at in the time of the dinosaurs.  The reason for this is pretty obvious, at that time there were no polar ice caps or fossil fuels, that I'd where all the carbon has been sequestered to, and when released we can expect roughly the same environment.  Further, in 100 years when this is all predicted to happen, humanity will be much better adapted to rising sea levels and warmer climates, unless we remain a low energy species, then we are sure to die off in the inevitable environmental change.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9qk668",
                                            "author": "BitcoinUser263895",
                                            "score": 1,
                                            "created_utc": 1653344469.0,
                                            "response": ">  roughly where we were at in the time of the dinosaurs\n\nNo problem then! ;D",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9qlujd",
                                                    "author": "Crawlero",
                                                    "score": 1,
                                                    "created_utc": 1653345272.0,
                                                    "response": "Yea, well it might be a bit on the humid side but the plants like it.  Higher oxygen content too, that has its benefits.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9r70pi",
                                            "author": "shleebs",
                                            "score": 1,
                                            "created_utc": 1653355633.0,
                                            "response": "One of the most poorly researched responses I've ever read",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i9ryze1",
                                            "author": "phileo",
                                            "score": 1,
                                            "created_utc": 1653371654.0,
                                            "response": "Do you get your data directly from the coal industry because it doesn’t work like that. It’s sad to see you being fed with lies. Please get better sources.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9s11e2",
                                                    "author": "Crawlero",
                                                    "score": 1,
                                                    "created_utc": 1653373276.0,
                                                    "response": "Don't talk to me about sources without citing one.  Bitcoin mining ensures the security of bitcoin; compare that with the dollar, how many wars do we have to start to ensure the security of the dollar? How many millions of civilians must die? How many countries must we bomb back to the stone age? The US government is the greatest purveyor of violence of all time, and any who escape our drones will lose their sovereignty to IMF loans and the WEF.  So sorry, but I just don't care about bitcoin mining using natural gas LOL, it can burn up all the natural gas in Texas and west Virginia for all I care.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9sbuxr",
                                                            "author": "phileo",
                                                            "score": 1,
                                                            "created_utc": 1653382947.0,
                                                            "response": "Hey I’m all for bitcoin. it’s the future. I just don’t like it when natural resources like coal, oil and gas are used to mine them. Mining blocks should be done with renewable energy sources. Is all I’m saying.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9se39q",
                                                                    "author": "Crawlero",
                                                                    "score": 1,
                                                                    "created_utc": 1653385001.0,
                                                                    "response": "OK, sure.  Here's the stitch, the cleaner a form of energy is the higher the upfront cost.  Generally, you have a lower cost overall, but it requires a big investment to get started, so you have to either have the money saved or get a loan.  Either will require a profitable history of mining, and presumably you were doing so with a lower form of energy like fossil fuels.  Telling people they can't mine with fossil fuels is essentially telling poorer people that they aren't allowed to join the club, and you give them no ability to work their way up the energy ladder.  Even if you want everyone to use renewable energy, increasing energy prices or regulating fossil fuels, despite appearances, will not help.  Further, natural gas produces like 3x less co2 per kWh than coal, its not fair to lump them in the same category.  Finally, as I eluded to earlier, fossil fuels are used for everything in modern life, if you believe in bitcoin then you agree that mining isn't wasted energy, it has as much a claim on producing CO2 as any other product.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9sm26x",
                                                                            "author": "phileo",
                                                                            "score": 1,
                                                                            "created_utc": 1653391400.0,
                                                                            "response": "I agree with you there. Using our resources to burn for energy is not a long term solution so incentivizing the use of renewables is something that bitcoin does and that’s good. We should get off of burning our resources altogether, not only for mining, but that will take time. We need to make it clear for everyone that fossil fuels are not good in general (we are a closed system) and we should promote renewables.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i9sn4ks",
                                                                                    "author": "Crawlero",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653392123.0,
                                                                                    "response": "Don't be so quick to dismiss my comments on the environment as sarcasm.  I am serious, think about the state of human development in a hundred years time, we will be geoengineering without a doubt.  We already perform small scale geoengineering with cloud seeding.  If we want more prosperity then we should increase the temperature and have more oxygen, you can accomplish both of those by burning carbon.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i9tipj9",
                                                                                            "author": "phileo",
                                                                                            "score": 1,
                                                                                            "created_utc": 1653407476.0,
                                                                                            "response": "I'm all for progress but meddling with the environment is a dangerous game. Changing something small can have unforeseen repercussions that could escalate into our demise (not even considering all the innocent animals that die beforehand, as is already happening). As an engineer myself, I know what I'm talking about and got burned many times. Vital systems should be left as is. We screwed up our climate enough and thinking we can \"fix\" it is arrogant imo. It's too complex of a system for us to fully understand.. even in 100 years.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9sebyh",
                                            "author": "igadjeed",
                                            "score": 1,
                                            "created_utc": 1653385223.0,
                                            "response": "> humanity will be much better adapted to rising sea levels and warmer climates\n\nIn this scenario, adaptation means human population of earth falling to less than 1 billion. The culled 9 billion can be used to enrich the soil",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9sk7cl",
                                                    "author": "Crawlero",
                                                    "score": 1,
                                                    "created_utc": 1653390090.0,
                                                    "response": "Or building a seawall, having fewer humans is a surefire way to see earth turn to an iceball, something it actually has a history of doing, unlike thermal runaway",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9sn3f8",
                                                            "author": "igadjeed",
                                                            "score": 1,
                                                            "created_utc": 1653392101.0,
                                                            "response": "> building a seawall\n\nYou'd only save 1 million by building a seawall",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9so4br",
                                                                    "author": "Crawlero",
                                                                    "score": 0,
                                                                    "created_utc": 1653392768.0,
                                                                    "response": "Cool math bro",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9q4vzt",
                            "author": "pinheadatelead",
                            "score": 1,
                            "created_utc": 1653337559.0,
                            "response": "LOL",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9s3ere",
                    "author": "DoodleRoodle",
                    "score": 0,
                    "created_utc": 1653375226.0,
                    "response": "The company's name \"Big Dog Energy\" made me smile",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}