{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "usam95",
            "title": "Bitcoin Optech Newsletter #200",
            "url": "https://bitcoinops.org/en/newsletters/2022/05/18/",
            "author": "TheGreatMuffin",
            "created_utc": 1652873146.0,
            "score": 12,
            "num_comments": 4,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i92798g",
                    "author": "TheGreatMuffin",
                    "score": 3,
                    "created_utc": 1652873153.0,
                    "response": "> This week’s newsletter summarizes a discussion about the minimum change to Bitcoin’s Script language necessary to enable recursive covenants, examines a revised proposal to add an OP_TX opcode, and reviews research into adapting output script descriptors for hardware signing devices. Also included are our regular sections with the summary of recent changes to Bitcoin services and clients, new releases and release candidates, and notable changes to popular Bitcoin infrastructure software. Additionally, we celebrate the publication of Optech’s 200th regular newsletter.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i92alkt",
                    "author": "coinfeeds-bot",
                    "score": 1,
                    "created_utc": 1652875261.0,
                    "response": "tldr; In a discussion on the Bitcoin-Dev mailing list about re-adding the OP_CAT opcode removed from Bitcoin in 2010, developer ZmnSCPxj claimed the opcode needed to be combined with proposed opcodes OP_TX, OP_CHECKSIGFROMSTACK (CSFS), or a similar feature to enable inescapable \"recursion\" contracts. Recursion contracts enforce that all bitcoins received to the contract can only be spent to the same contract.\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i951l3j",
                    "author": "whitslack",
                    "score": 1,
                    "created_utc": 1652918116.0,
                    "response": "It's always sad how few upvotes these newsletters receive here. The quality of this content is miles above the garbage that floods this sub every day.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}