{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "tsbgrw",
            "title": "Apple Rumored to Be Partnering With Strike for Bitcoin Lightning Payments",
            "url": "https://medium.com/coinmonks/apple-rumored-to-be-partnering-with-strike-for-bitcoin-lightning-payments-48ed39737b2b",
            "author": "simplelifestyle",
            "created_utc": 1648660804.0,
            "score": 697,
            "num_comments": 283,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i2qmkmf",
                    "author": "HH0115",
                    "score": 171,
                    "created_utc": 1648661166.0,
                    "response": "Using strike for 14 months I believe. This is huge if true. Imagine using Apple Pay to use lightning natively on iPhone to buy, sell and transmit sats. Apple has greater monetary power than many countries. This could be a huge anti war move and help push nation state adoption. It’s also a huge move for human rights for people under tyrannical governments.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i2rp3js",
                            "author": "BirdSetFree",
                            "score": 59,
                            "created_utc": 1648676408.0,
                            "response": "I think stuff like this is whats gonna tip the boat over to global adoption",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i2tstym",
                                    "author": "Walmart_Warrior_420",
                                    "score": 8,
                                    "created_utc": 1648719125.0,
                                    "response": "\"Slowly, and then all of a sudden\"        ( ͡° ͜ʖ ͡°)",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i2tbpvn",
                                    "author": "linshizhao",
                                    "score": -2,
                                    "created_utc": 1648705086.0,
                                    "response": "Let's hope that the governments will consider this and accept cryptocurrency.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i2tda10",
                                            "author": "CmpltlyPrvtPblcAccnt",
                                            "score": 6,
                                            "created_utc": 1648706199.0,
                                            "response": "Fuck governments. Bitcoin was made to get out from under them. People need to realize governments' stances on Bitcoin are irrelevant and should treat them as such. \n\nBitcoin is a better game. People who don't wanna play or who wish to try to shut down the game for other players (aka a lot of current governments) should not be asked for permission, and instead, told kindly to go fuck themselves. \n\nEventually there will be so many players and the Bitcoin game so evidently better that governments will have to ask the players' permission to join the fray, not the other way around.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i2t3p43",
                            "author": "Most-Caterpillar1116",
                            "score": 6,
                            "created_utc": 1648700055.0,
                            "response": "Yeah as if the U.S. government is going to allow a single corporate entity to have that much power.  Utopian fantasy.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i2ty7e4",
                                    "author": "knut11",
                                    "score": 4,
                                    "created_utc": 1648723445.0,
                                    "response": "This is indeed the perfect move for the US Gov. The world reserve currency is falling apart.\n\nAt this point US is among the strong Bitcoin countries. Both in mining and holders within their borders.\n\nFirst mover advantage among the big countries, is quite significant.\n\nAchieving a new world reserve currency, without war is in everyones interest.\n\nApple is not likely consider this, if they thought the goverment would move against their deciscion.\n\nLets see. Fun times.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i3gznvm",
                                            "author": "OkStep8829",
                                            "score": 1,
                                            "created_utc": 1649153330.0,
                                            "response": "Usa literally invented btc lmao of course they will go for it",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i3sf9j4",
                                    "author": "Quiet_Distribution91",
                                    "score": 1,
                                    "created_utc": 1649353616.0,
                                    "response": "Somewhat a fantasy in the near future, let’s not forget we the people are the ones who decide with our votes.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i2tsi4z",
                                    "author": "hicoBM",
                                    "score": -2,
                                    "created_utc": 1648718843.0,
                                    "response": "Hahahaha delusionals thinking that you can move money across without any money transmitter license…. The sec it’s going to fuck strike very easy…. Strike don’t had the right licenses to move money… Jack you need to learn more of the payment sector….",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i2s3yi1",
                            "author": "markasoftware",
                            "score": -11,
                            "created_utc": 1648682963.0,
                            "response": "Strike is a web wallet: https://strike.me/en/faq/bitcoincustody\n\nDo not use Strike.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i2s4uat",
                                    "author": "HH0115",
                                    "score": 14,
                                    "created_utc": 1648683373.0,
                                    "response": "People can’t go 0 to maxi. I literally get my direct deposit in there and can immediately decide to send fiat to the bank or get BTC and send to cold storage or any combination. Use the thing before you comment on the thing. The alternative is I wait for it to go to my bank then wait for it to go to an exchange and then buy then send out maybe it gets delayed on the way out for some bullshit reason. My friend in Jordan (the country) can’t even get a self hosted wallet (so he says, as a non BTC guy maybe he just believes the government). There are levels to this. Protocol, monetary policy and privacy are educating people at different rates in different parts of the world.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i2s5khe",
                                            "author": "markasoftware",
                                            "score": -4,
                                            "created_utc": 1648683712.0,
                                            "response": "Using a real wallet is not difficult. You don't need to study computer science to use one.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i2tr1vh",
                                                    "author": "lambdatrader",
                                                    "score": 4,
                                                    "created_utc": 1648717579.0,
                                                    "response": "That's absolutely right but I think everyone should understand Basic concept about security and decentralization before using any wallet.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i2s61g0",
                                                    "author": "HH0115",
                                                    "score": 9,
                                                    "created_utc": 1648683934.0,
                                                    "response": "I know my man. I’m in chat groups with old Asian people. I work with young people. I think it’s easy as shit. But these guys can’t get into their bios if their life depended on it. Maybe we’re just gifted. But until they have that light bulb moment we need to at least get them into the game. Once they have sats/skin in the game we can start asking questions about “what if this service went down?”  That’s how I approach it. It’ll be way more obvious to them when they can’t get their money from the bank, that’s for sure!",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i2sit9p",
                                                            "author": "Stoopiddogface",
                                                            "score": 2,
                                                            "created_utc": 1648689755.0,
                                                            "response": "A part that is often misunderstood is the concept of \"need\".\n\nIm an x-leniel, I grew up analog, adulted digital... For many boomers, they see no need to have crypto. They have only known a life of fiat. Many of them still dont shop online bc of internet robbers... The world is changing, and theyll get left behind. Oh well...",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i2sm8uj",
                                                                    "author": "HH0115",
                                                                    "score": 3,
                                                                    "created_utc": 1648691311.0,
                                                                    "response": "Yes.  And when central banking, visa, Mastercard etc reimburse them for their mistakes who pays the price? Everyone holding dollars. This is why you can’t have a whole generation of grey hairs saying I told you so when they can’t even protect themselves from a Nigerian Prince. I’m not paying for someone who calls me an idiot while falling for paying taxes with Google play cards. You’re going to see a lot of 20-30 year olds saying fuck you to their parents who grew up in the best time of North American prosperity who have been chastising their children for wanting a fraction of what they had. Respect is is a two way street and the older generation want respect without giving any. The result will be an orderly selling their ass and a tub of Vaseline to the highest bidder when their progenies don’t cow tow.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i2snmgz",
                                                                            "author": "Stoopiddogface",
                                                                            "score": 2,
                                                                            "created_utc": 1648691946.0,
                                                                            "response": "This is the same generation that mocked the internet as a \"fad\" and dont trust a phone with no buttons... The same lack of trust however is tossed out the window when it comes to having an Alexa in their house for some reason... Anyway, I digress...\n\nOTOH, the world has to be getting rather scary for them...",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i2v6vkx",
                                                                                    "author": "operationatlanta",
                                                                                    "score": 2,
                                                                                    "created_utc": 1648744372.0,
                                                                                    "response": "That's right and most of them are now in the Parliament and that's why it is important to tell them about the cryptocurrency and the future of IT.",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "id": "i2vpa3b",
                                                                            "author": "ysiioxfo",
                                                                            "score": 1,
                                                                            "created_utc": 1648751359.0,
                                                                            "response": "I believe that even banking industry is going to adopt blockchain soon.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "i2t8axx",
                                                                    "author": "bdgiles1",
                                                                    "score": 2,
                                                                    "created_utc": 1648702817.0,
                                                                    "response": "Great things take time to implement and we can see that the transformation will be there at a slower pace.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "i2sjzvz",
                                                            "author": "markasoftware",
                                                            "score": -1,
                                                            "created_utc": 1648690291.0,
                                                            "response": "Bitcoin's only advantage over traditional financial infrastructure is that it's decentralized. If these people you are introducing to Bitcoin don't care about decentralization, they will be better served by traditional finance.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i2slcsv",
                                                                    "author": "HH0115",
                                                                    "score": 7,
                                                                    "created_utc": 1648690907.0,
                                                                    "response": "Agree to disagree. The last audit of the fed they could only account for 80% of the funds and they thought they were doing great with that. The fact that that a $50 single board computer can tell you what is happening with the life blood of the economy is huge. The fact that it is decentralized makes it so it can’t be censored and extremely resistant to state attacks, game theory yada yada. They don’t need to care. We want to change the world. There are a lot of non-technical people. Let’s educate. Better served by traditional finance? That can’t keep up with inflation? I’m not rich but Bitcoin in 6 years has gotten me to the point where in two years I’m going to be a Bitcoin Mormon. It’s the first time in my life I can relax. Do you think we’re going to experience 1920s, 1970s or 2008 in the next 24 months? Yea I’m going to diversify and get some property when it’s time to buy the dip on real estate but the five year return on being a maxi has been pretty pretty good pretty pretty pretty good! (Insert Larry David)",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i2to081",
                                                                            "author": "coinsen10",
                                                                            "score": 3,
                                                                            "created_utc": 1648714894.0,
                                                                            "response": "I partially agree with you because decentralization is definitely impacting the traditional payment methods and it is giving birth to the new ecosystem.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        },
                                                                        {
                                                                            "id": "i2sltkl",
                                                                            "author": "markasoftware",
                                                                            "score": 0,
                                                                            "created_utc": 1648691116.0,
                                                                            "response": "You are mentioning all these great things about *Bitcoin*. They don't apply when you're using Strike. The fed audit could only account for 80% of their funds? At least they're getting audited at all! NOBODY is holding Strike accountable. They may be insolvent for all we know. You made so much money with Bitcoin? If you were holding it in a Strike wallet, it might disappear one day and there'd be nothing you could do about it.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i2smq54",
                                                                                    "author": "HH0115",
                                                                                    "score": 2,
                                                                                    "created_utc": 1648691530.0,
                                                                                    "response": "As I said I withdraw right away. You’re trying to go from 0 to maximalist hero. I’ve been yelling to a guy with 7phd’s about Bitcoin for six years… and at least publicly he still hasn’t made a purchase and asks me dumb questions. The conditioning is strong. When I can tell someone at the bar I’m going to fuck them up harder than Pete McCormick’s multi-sig then the general populace cannot be excused for not having cold storage. Until then, enjoy the ride.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i2uezr4",
                                                                                            "author": "nachofb84",
                                                                                            "score": 1,
                                                                                            "created_utc": 1648733106.0,
                                                                                            "response": "Using hardware or any cold storage is always recommended in such case.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "id": "i2tio69",
                                                                                    "author": "karabaster",
                                                                                    "score": 1,
                                                                                    "created_utc": 1648710349.0,
                                                                                    "response": "Even some exchange people are recommending their users not to keep their cryptocurrency on the exchanges.",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "i2u098z",
                                                                    "author": "goodwinrush",
                                                                    "score": 1,
                                                                    "created_utc": 1648724884.0,
                                                                    "response": "You are right because Bitcoin doesn't care about much decentralization but it is definitely going to revolutionize the traditional payment ecosystem.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "i2vnus5",
                                                            "author": "geneerinen21",
                                                            "score": 1,
                                                            "created_utc": 1648750812.0,
                                                            "response": "Sometimes any technical issue can affect the service and the the online status of it.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i2ssieo",
                                                    "author": "HugeCorn",
                                                    "score": 3,
                                                    "created_utc": 1648694216.0,
                                                    "response": "This seems like an oversimplification. It's difficult enough that it's enough to deter people from using one. There's a lot of evidence for this already in the amount of bitcoin living in exchange spot wallets. An even easier-to-use example is an external hard drive to back up your photos and files. So few people with their livelihoods in their file storage use external hard drives.  Before automatic (centralized) cloud back up for iphones, people would lose all of their photos when they broke their phone. The fact that you have to buy a secure device, set up passwords and remember a large seed phrase can be a deterrent to bitcoin adoption. Storing most of your wealth in a hardware wallet will still be the recommended thing to do, but most people live paycheck to paycheck.  If you believe in bitcoin's benefits beyond a store of wealth asset, (i.e. replacing the petrodollar) then you have to believe in maximizing usage and adoption. Accessibility, especially in the beginning, is the most important thing Bitcoiners should care about or we will never \"cross the chasm\" of adoption. You still get protection from a government controlled currency even if a lot of the banking and payments are done in a centralized cloud environment.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i2tgpd9",
                                                            "author": "markapapa",
                                                            "score": 3,
                                                            "created_utc": 1648708776.0,
                                                            "response": "I certainly agree that the situation is complicated but it is not impossible to solve. I think we will have to give sometime for awareness and then we will see simplification.",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "i2t7scf",
                                                            "author": "markasoftware",
                                                            "score": 1,
                                                            "created_utc": 1648702485.0,
                                                            "response": "If you aren't capable of backing up photos or using a real wallet (doesn't have to be hardware), sooner or later you're going to lose your Bitcoin. You'll get scammed, or you'll forget your seed. A trustless system is only trustless if users know what they're doing.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i2uyub3",
                                            "author": "KUZMICH350GS",
                                            "score": 1,
                                            "created_utc": 1648741307.0,
                                            "response": "Thanks for sharing the quick review about it because most of the people will stop using that wallet if there is no good review.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i2sktz2",
                                    "author": "Bone-Head-J",
                                    "score": 4,
                                    "created_utc": 1648690673.0,
                                    "response": "Just because you use strike doesn’t mean you need to keep majority of your funds on the app lol. Saying do not use strike isn’t correct. You should say don’t store your bitcoin with strike",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i2tut4z",
                                            "author": "kasock",
                                            "score": 1,
                                            "created_utc": 1648720781.0,
                                            "response": "I agree that there might be differences of opinion here about any exchange but I will definitely use any exchange as far as it is not scammy.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i2s4kav",
                                    "author": "FancyVegetables",
                                    "score": 2,
                                    "created_utc": 1648683246.0,
                                    "response": "I use Strike, I just started putting mine into my new Trezor.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i2vorkk",
                                            "author": "hossein512",
                                            "score": 1,
                                            "created_utc": 1648751161.0,
                                            "response": "That's great using any exchange is not bad but if we are not keeping our money in the hardware wallet or any cold storage then it is a very risky decision.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i2t4jeh",
                                    "author": "senfmeister",
                                    "score": 1,
                                    "created_utc": 1648700547.0,
                                    "response": "Strike is a great place to buy Bitcoin. Like any exchange, it's not a great place to store Bitcoin.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i2u48pc",
                                    "author": "Zadranab",
                                    "score": 1,
                                    "created_utc": 1648727461.0,
                                    "response": "I have never used it and I have alo never heard any reviews about it but I mostly use hardware wallet only. However, if it is a good wallet then people will definitely use it.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i2s251i",
                            "author": "chewy1ss",
                            "score": -13,
                            "created_utc": 1648682133.0,
                            "response": "Anti war move lol BiTcOiN FiXeS tHiS 🤡",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i2s9cb9",
                                    "author": "RavisTrice",
                                    "score": 9,
                                    "created_utc": 1648685459.0,
                                    "response": "What happens when people no longer want to hold the ever debasing currency and governments can no longer print infinite fiat and sell treasuries to fund unsuported wars? If people demand btc then wars have to be funded in btc, and the waring nation would have to earn the btc like us common folk when they want to buy something. Very war prohibitive. \n\nAdditionally it can't be taken as spoils of war like gold or other physical assets, so the incentives for murder combat go down.\n\nThose are just 2 ways it can be anti-war.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i2ucmp9",
                                            "author": "pazzanegro",
                                            "score": 1,
                                            "created_utc": 1648731985.0,
                                            "response": "The current war is forcing some people to use Bitcoin but there are some people who are using it just because they are not allowed to use Fiat currency now. I think they will understand the benefits of it and they will use it in the long run.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i2v9vgi",
                                    "author": "almonds111133",
                                    "score": 0,
                                    "created_utc": 1648745494.0,
                                    "response": "Bitcoin has answers to some problems but Bitcoin doesn't have answers to all the problems and that's why linking it with everything is not a wise idea.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i2t7d14",
                            "author": "Ultimatenub0049",
                            "score": 1,
                            "created_utc": 1648702221.0,
                            "response": "Apple Pay is connected to a TON of other payment methods. I know this because my I-phone is constantly asking if I want to Apple Pay",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i2t7mwh",
                                    "author": "HH0115",
                                    "score": 2,
                                    "created_utc": 1648702391.0,
                                    "response": "And we need air to breathe. Can I give you reverse CPR because I think you completely missed the point. Stay beautiful.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i2tfe2x",
                                            "author": "Ultimatenub0049",
                                            "score": 1,
                                            "created_utc": 1648707770.0,
                                            "response": "Hardly but I’ll give you an A for effort in your attempt to insult 😂👍🏻",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i2tsvma",
                                    "author": "hicoBM",
                                    "score": -1,
                                    "created_utc": 1648719163.0,
                                    "response": "They had their own wallet…. apple wallet but ppl thinks that apple are going to melt their wallet to put strike hhahahahajhhahhhhhahahahahahahaha",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i2ts7dp",
                            "author": "hicoBM",
                            "score": 1,
                            "created_utc": 1648718588.0,
                            "response": "To move money you need money transmitter license… go to google and search if strike app and ZAP had any money transmitter license btw you need 50 to operate in the USA….",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i2ur4c0",
                            "author": "mapes911",
                            "score": 1,
                            "created_utc": 1648738287.0,
                            "response": "You are absolutely right and I agree with the theory of national adoption.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i2r69s7",
                            "author": "youngWuuf",
                            "score": -45,
                            "created_utc": 1648668893.0,
                            "response": "How long does lightning pay take? My experience with BTC in general is trash I can send money myself on a donkey faster",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i2r6zce",
                                    "author": "HH0115",
                                    "score": 25,
                                    "created_utc": 1648669172.0,
                                    "response": "Lightning is less than 2 seconds. Using on chain I have gotten 1 sat/byte through in under 24 hours many times. If you know how the mempool works and choose an appropriate fee I have always gotten it done in 20ish minutes if I needed to on the base chain. Trezor suite simplifies this by saying something like slow, medium, fast. Bitcoin is slow by nature and it’s part of the security. This is why lightning is so amazing because it’s faster than our credit cards and with final settlement on the base chain for lower fees than any existing fiat rails.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i2r7hdf",
                                            "author": "HH0115",
                                            "score": 8,
                                            "created_utc": 1648669370.0,
                                            "response": "Lightning is so cheap there could be a future where I can pick bananas and get paid per banana picked for my work. Child support payments could be streamed negating the exorbitant costs of the bloated legal / enforcement system. In a world where everyone is feeling doom and gloom the possibilities and imagination happening in the space Bitcoin are amazing!",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i2uh74w",
                                                    "author": "fxf0311",
                                                    "score": 1,
                                                    "created_utc": 1648734113.0,
                                                    "response": "We need cheap transactions only to include mass adoption.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i2tgopl",
                                            "author": "dieduin",
                                            "score": 1,
                                            "created_utc": 1648708761.0,
                                            "response": "That's great and even if there is less fee, I am sure that most of the people will start using it in their day to day transactions.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i2r7yci",
                                            "author": "youngWuuf",
                                            "score": -23,
                                            "created_utc": 1648669555.0,
                                            "response": "I’m not arguing against BTC, I personally wish it wasn’t the leader because it just isn’t the best…but I have never sent USD to someone and it not be instant. I know that like bank wires etc take time but when this gets largely accepted, don’t you think most transactions will be purchases/send money to friend/family etc? The fact that it is decentralized is great, but many people want their shit NOW in this day in age and if needs to be easy, can’t be explaining to everyday people about  on chain choosing fees. Idk just thoughts.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i2rbnjh",
                                                    "author": "PoissonTriumvirate",
                                                    "score": 14,
                                                    "created_utc": 1648671000.0,
                                                    "response": "> I have never sent USD to someone and it not be instant\n\nThis means you're too rich to need remittances and too poor to need money transfers of serious size.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i2rfnex",
                                                            "author": "bitsteiner",
                                                            "score": 7,
                                                            "created_utc": 1648672578.0,
                                                            "response": "There is no service that transmits fiat money instantly over distance between end users. There are only claims exchanged via middlemen, which makes is so expensive. Although it might appear at zero cost, in the end ypu pay the hidden fees.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i2s305m",
                                                                    "author": "PoissonTriumvirate",
                                                                    "score": 2,
                                                                    "created_utc": 1648682527.0,
                                                                    "response": "True, but I don't think the GP would understand if I went off about settlement cycles and so on.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i2vlala",
                                                                            "author": "bitsteiner",
                                                                            "score": 1,
                                                                            "created_utc": 1648749834.0,
                                                                            "response": "As long as the system runs smoothly, not many are really interested. It's like power comes out of wall and they are not interested how it's made or transported. Only in a power outage people will wonder about the cause. With fiat money they will learn it the hard way through bank collapses, bank runs, bank holidays, capital controls aso.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "i2u43h5",
                                                            "author": "thechamp1685",
                                                            "score": 2,
                                                            "created_utc": 1648727372.0,
                                                            "response": "I believe that poor people need remittance facility at lower cost all the time.",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "i2rc56v",
                                                            "author": "youngWuuf",
                                                            "score": -4,
                                                            "created_utc": 1648671192.0,
                                                            "response": "Well when talking about integration into society we need to talk about general uses. Or should we only talk about extremes when it comes to trying to get crypto mainstream? I don’t understand your comment tbh",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i2s33wk",
                                                                    "author": "PoissonTriumvirate",
                                                                    "score": 2,
                                                                    "created_utc": 1648682575.0,
                                                                    "response": "It's not \"extreme\" for me to want to transfer $10k to my brokerage, which I cannot do as cheaply or efficiently as with bitcoin.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i2s38ld",
                                                                            "author": "youngWuuf",
                                                                            "score": -1,
                                                                            "created_utc": 1648682634.0,
                                                                            "response": "Yeah that’s a specific scenario that wasn’t discussed. I never said that was extreme??",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i2ra4p8",
                                                    "author": "HH0115",
                                                    "score": 4,
                                                    "created_utc": 1648670407.0,
                                                    "response": "This is exactly why lightning is important. I can double click a button on my phone and align a QR code and it’s instant. And then it settles on the BTC chain so you have the best of both worlds. Lightning is like a series of contracts that have a fallback fail safe if someone tries to cheat. The end result is you get everything from Bitcoin except cold storage and instant transfers, if you want privacy you’ll need to run your own node like Bitcoin. If Apple integrates strike you’ll be able to convert to fiat instantly as well. You need to use lightning and then you’ll understand the power my friend. Everything you’re saying it can’t do… it can do lol.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i2vkqqw",
                                                            "author": "qweewq11",
                                                            "score": 1,
                                                            "created_utc": 1648749626.0,
                                                            "response": "You are right and I am sure that we will see more development in lightning network soon.",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "i2rbfj9",
                                                            "author": "youngWuuf",
                                                            "score": -1,
                                                            "created_utc": 1648670914.0,
                                                            "response": "I should and will try it, I just am used to tech like this since like 2018 is all I’m saying. I guess you can swap the engine of an old car to make it faster. IDC tbh as long as the world starts using crypto",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i2vtxup",
                                                                    "author": "brown_matthew_n",
                                                                    "score": 1,
                                                                    "created_utc": 1648753159.0,
                                                                    "response": "I believe that world is all set for using cryptocurrency and we just have to explain them the process of joining in.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i2ra802",
                                                    "author": "TimmoJarer",
                                                    "score": 3,
                                                    "created_utc": 1648670443.0,
                                                    "response": "We are in the early stages and just like the Internet, chances are that that the protocols built on top of Bitcoin will be lot faster and some people theorise that in the future, we won't even touch the base chain. It will be lightning and whatever comes on top of that.\n\nWith that being said, Bitcoin is without doubt the best Blockchain in existence. Flashy TPS numbers/smart contracts/contant hard forks don't work well on base chains. The prevailing opinion in our community is that security/simplicity and decentralisation are the way to go and so far, we've been proven right at every turn. Just look at the 2015 DAO hack on Eth, constant Solana outages etc...Bitcoin, as of today is the apex Blockchain, with time you will come to understand.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i2rdy1i",
                                                            "author": "cyanwoh",
                                                            "score": 1,
                                                            "created_utc": 1648671903.0,
                                                            "response": "then what will the base chain be needed for?",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "i2u8653",
                                                            "author": "carlitobe",
                                                            "score": 1,
                                                            "created_utc": 1648729719.0,
                                                            "response": "That's absolutely right and that's why we can expect huge potential even from this point.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i2reqvc",
                                                    "author": "Jacked_1",
                                                    "score": 3,
                                                    "created_utc": 1648672219.0,
                                                    "response": "But it is the best. You're judging speed on the settlement layer alone. Do you know how crazy that sounds? Do you think fiat is faster? Fiat can take days or even weeks to settle. BTC takes minutes to hours on average.\nYou  should look at lightning urgently before sharing such misinformation with anyone else.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i2rhd36",
                                                            "author": "youngWuuf",
                                                            "score": -2,
                                                            "created_utc": 1648673257.0,
                                                            "response": "First of all, I don’t understand this negative angry vibe I’m getting from you; there is no place for it. Second, I was simply asking about lighting because I am ignorant on it specifically. What did I say that was misinformation? What is the process of using lightning like what do I have to do? These are questions 50 year olds will be asking if it becomes mainstream. Right now if I use a large exchange and send BTC it takes quite a while, which I don’t even care about tbh. Chill and have a convo with me.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i2rmdb7",
                                                                    "author": "Bigbutts0lie",
                                                                    "score": 1,
                                                                    "created_utc": 1648675284.0,
                                                                    "response": "XD",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                },
                                                                {
                                                                    "id": "i2rpezt",
                                                                    "author": "GammicK",
                                                                    "score": 1,
                                                                    "created_utc": 1648676540.0,
                                                                    "response": "These are not questions they will be asking. It's really good that anyone can use their own node if they want to, but most people will be using software they are familiar with, like Apple Pay, and the software will use Bitcoin in the background because that is the best way to settle transactions of economic value.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i2rpqte",
                                                                            "author": "youngWuuf",
                                                                            "score": 1,
                                                                            "created_utc": 1648676679.0,
                                                                            "response": "I guess you are right if you predict the future correctly? Does Apple Pay support lighting now?",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i2rz3k1",
                                                                                    "author": "Farmy",
                                                                                    "score": 1,
                                                                                    "created_utc": 1648680743.0,
                                                                                    "response": "Uh the title of the article you're commenting on..?",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i2rzhz5",
                                                                                            "author": "youngWuuf",
                                                                                            "score": 1,
                                                                                            "created_utc": 1648680924.0,
                                                                                            "response": "Ah, so that title suggests that Apple indeed DOES support it.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "i2tln7r",
                                                                    "author": "Jacked_1",
                                                                    "score": 1,
                                                                    "created_utc": 1648712856.0,
                                                                    "response": "There was definitely no anger behind my comment.\n\nMerely stating facts.\n\nYou did not ask \\*anything\\* about lightning. Everything you mentioned was on-chain(settlement layer) related.\n\nThere's something essential which many AltCoin supporters haven't realised - An Altcoin performing a settlement layer as quickly as they do, and with as low fees as they do, is NOT a good, sustainable thing. \n\nFirst off, if you're buying from a Centralised Exchange, that's a problem, but I won't go into it as it's off-topic, but encourage you to do further research on why CEXs and KYC are to the detriment of your sovereignty.\n\nAs for interacting with Lightning, it's dead-simple at this point. Download a lightning wallet - Muun or Phoenix as a couple of examples and send an on-chain BTC TX - This will open a Lightning channel, which will mean you can send outbound via lightning (close to, minus on-chain+service fees) as much as you received. And then you can send and receive via lightning multiple, multiple times (until the channel is closed) with extremely low fees.\n\nOnce you're comfortable with that, and do some further studying in Lightning concepts, if you further interested, either run your own node or download Blixt wallet, which will allow you to open/close/manage your own channels, which means you can choose low-fee/no-fee peers to connect to, which means the service fees that service providers take are no longer taken.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i2revjs",
                                                    "author": "bitsteiner",
                                                    "score": 2,
                                                    "created_utc": 1648672271.0,
                                                    "response": "Market decides what is the best and the market is always right. There are many parameters important not only on-chain-speed.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i2riat9",
                                                            "author": "youngWuuf",
                                                            "score": 1,
                                                            "created_utc": 1648673631.0,
                                                            "response": "I agree with you on your second point, but using your logic is Apple better than Microsoft? Does Nike sell the best products? You don’t think name recognition plays a roll in markets, or in this case simply being first? Personally I like Apple for phones but I love Microsoft way better for desktops. I like Nike branding but they have been known for using dog shit materials. Idk you could be right, just another angle.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i2umdom",
                                                                    "author": "grajson",
                                                                    "score": 2,
                                                                    "created_utc": 1648736363.0,
                                                                    "response": "I think both the companies are having different ideologies and work process so if they are giving good solutions to the people who need it we can appreciate it.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "i2u2mu9",
                                                            "author": "dxgdfhfgjg",
                                                            "score": 1,
                                                            "created_utc": 1648726463.0,
                                                            "response": "Market decides what is best but I think sometimes it is manipulated by the big people. However, I am very much optimistic about the growth of it in the long term.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i2vk9x6",
                                                                    "author": "bitsteiner",
                                                                    "score": 1,
                                                                    "created_utc": 1648749451.0,
                                                                    "response": "BTC is least susceptible to manipulation since it is very decentralized. I don't say that it doesn't happen with BTC but they are short lived only.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i2r92i9",
                                                    "author": "arcrad",
                                                    "score": 4,
                                                    "created_utc": 1648669994.0,
                                                    "response": "Lightning takes 2 seconds.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i2ug01s",
                                                            "author": "cybercaptive001",
                                                            "score": 1,
                                                            "created_utc": 1648733570.0,
                                                            "response": "Yes and that's the beauty of it because not everyone is having more time for waiting to get the transaction confirmed.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i2rdpc2",
                                                    "author": "PrognosticalSon",
                                                    "score": 1,
                                                    "created_utc": 1648671808.0,
                                                    "response": "The great thing is you don't have to use BTC if you don't want to.\n \nStay away if you feel it is not for you. No need to be convinced.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i2reae8",
                                                            "author": "youngWuuf",
                                                            "score": 1,
                                                            "created_utc": 1648672039.0,
                                                            "response": "Whether you like it or not it’s gonna be useful simply because of its place in the market, not to mention you can use it for collateral",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i2vury3",
                                                                    "author": "systemap",
                                                                    "score": 6,
                                                                    "created_utc": 1648753485.0,
                                                                    "response": "That's absolutely right and we are going to see the entire ecosystem around it in the future.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "i2thxll",
                                                            "author": "Crytek1337",
                                                            "score": 1,
                                                            "created_utc": 1648709750.0,
                                                            "response": "You have nailed it because most of the people don't know if they are ready to use it or not.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i2rkqus",
                                                    "author": "schmelf",
                                                    "score": 1,
                                                    "created_utc": 1648674617.0,
                                                    "response": "It’s not instant when you send USD, it just appears that it is. It needs someone working on the back end to check that the balance actually align (I.e. you actually have the money in your account that you’re trying to send). This is why it can’t take payments and checks a day or two to clear with your bank. With btc, you don’t have the UI to make it seem like it’s working while it checks in the back end. With lightning you actually move it much faster than on chain too because it’s based on the amount you put into the channel (or something to that effect) so it can check and send without putting transactions on chain until the channel is closed.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i2rkyz1",
                                                            "author": "youngWuuf",
                                                            "score": 1,
                                                            "created_utc": 1648674711.0,
                                                            "response": "Well that’s good, I’m aware of how USD works and I much prefer BTC even without lightning.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i2rl6zi",
                                                                    "author": "schmelf",
                                                                    "score": 1,
                                                                    "created_utc": 1648674803.0,
                                                                    "response": "Well you just said that sending usd was instant - I was just clarifying that it’s not truly instant. It just appears that way because of UI but in reality takes days to clear.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i2rlp13",
                                                                            "author": "youngWuuf",
                                                                            "score": 1,
                                                                            "created_utc": 1648675009.0,
                                                                            "response": "Yeah I know, but the person receiving the money can use it instantly, look I’m not in favor of USD I hate it, I hate banks I don’t keep any more money in my bank than just in case of an emergency. I was just trying to learn more about lightning. When crypto becomes truly mainstream the average person doesn’t give a fuck about what the block is doing, how efficient it is etc. That is just the world we live in",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        },
                                                                        {
                                                                            "id": "i2tcg87",
                                                                            "author": "rekitir",
                                                                            "score": 1,
                                                                            "created_utc": 1648705604.0,
                                                                            "response": "Sometimes it is true because it is based on the complicated system which is manual in some cases and that's why it takes time.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "i2un8z7",
                                                                    "author": "jamiewelsh1183",
                                                                    "score": 1,
                                                                    "created_utc": 1648736723.0,
                                                                    "response": "Most of the people prefer between even without lightning but if the fee is going down then it will adopt More market share because more people will start using it.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "i2tqwti",
                                                            "author": "LUCKFRANK",
                                                            "score": 1,
                                                            "created_utc": 1648717457.0,
                                                            "response": "You are right and automatic process is the only solution for a faster transactions.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i2swwyb",
                                                    "author": "tsosa14",
                                                    "score": 1,
                                                    "created_utc": 1648696356.0,
                                                    "response": "I’m thinking this sub may not be right for you",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i2uusgq",
                                                            "author": "DianneStitham",
                                                            "score": 3,
                                                            "created_utc": 1648739743.0,
                                                            "response": "As long it as it is giving information to the people it is right for everyone.",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "i2t1fh2",
                                                            "author": "youngWuuf",
                                                            "score": 1,
                                                            "created_utc": 1648698758.0,
                                                            "response": "Why",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i2t6hut",
                                                                    "author": "tsosa14",
                                                                    "score": 1,
                                                                    "created_utc": 1648701695.0,
                                                                    "response": ">My experience with BTC in general is trash I can send money myself on a donkey faster\n\nVery hyperbolic. I’m sorry your experience hasn’t been the most pleasant, however the majority of hodlers will strongly disagree about the speed of transaction. And with the lightning network being utilized more it’s becoming quicker. This is also why I enjoy Strike, super fast, low fees, and super reliable.\n\n> I’m not arguing against BTC, I personally wish it wasn’t the leader because it just isn’t the best\n\nPerhaps you’ve not found the right exchange yet?\nYou’re letting your own bad experiences be your pitfall. Just keep reading and learning as much as you can on the subject from as many valid sources as you can. If it’s not the best though, why dabble with it?",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i2tij1g",
                                                    "author": "coinjaf",
                                                    "score": 1,
                                                    "created_utc": 1648710232.0,
                                                    "response": "You must have never bought more than an ice cream. USD transfers \"instant\" /facepalm",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i2u52gk",
                                                            "author": "youngWuuf",
                                                            "score": 1,
                                                            "created_utc": 1648727963.0,
                                                            "response": "I don’t eat much sugar",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i2v8do4",
                                                    "author": "mullacy",
                                                    "score": 1,
                                                    "created_utc": 1648744934.0,
                                                    "response": "Things are still in development mode and that's why we are here to discuss the better growth opportunities for it. Criticizing it won't take us anywhere and that's why productive input is always appreciated.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i2vhu1p",
                                                            "author": "youngWuuf",
                                                            "score": 1,
                                                            "created_utc": 1648748537.0,
                                                            "response": "Is criticism not productive? Where I come from it is. Idk people must have taken my direct language and donkey joke to heart. I’m in the sub for a reason. I own BTC even if you don’t like btc it’s a good idea. I don’t put feelings into investments.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i2regu9",
                                    "author": "bitsteiner",
                                    "score": 5,
                                    "created_utc": 1648672112.0,
                                    "response": "Lightning is instant, use it on bitrefill a lot, so real world experience. If you mean by sending money cc, debit, money apps, ACH or wire transfer you are comparing apples and oranges. A confirmed Bitcoin transaction is a cleared, irreversible transaction comparable to RTGS or daily net clearing of the Fed. This would be comparable but bitcoin operates 24/7 worldwide at much lower cost and everyone can access it.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i2u84ij",
                                            "author": "my_money_send1",
                                            "score": 1,
                                            "created_utc": 1648729694.0,
                                            "response": "I will always prefer using cryptocurrency for sending money abroad because it is more transparent and user-friendly.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i2rer44",
                                            "author": "youngWuuf",
                                            "score": 0,
                                            "created_utc": 1648672222.0,
                                            "response": "Noice",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i2riwfe",
                                    "author": "BitcoinFan1239",
                                    "score": 3,
                                    "created_utc": 1648673870.0,
                                    "response": "well better get yourself a donkey i guess",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i2rj02s",
                                            "author": "youngWuuf",
                                            "score": 2,
                                            "created_utc": 1648673911.0,
                                            "response": "Lol maybe I could buy it with BTC",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i2rnn0n",
                                                    "author": "r3dd1t0r77",
                                                    "score": 2,
                                                    "created_utc": 1648675808.0,
                                                    "response": "If that line goes down, you can kiss your ass goodbye.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i2ro55d",
                                                            "author": "youngWuuf",
                                                            "score": 1,
                                                            "created_utc": 1648676013.0,
                                                            "response": "Wha?",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i2rq27q",
                                                                    "author": "r3dd1t0r77",
                                                                    "score": 1,
                                                                    "created_utc": 1648676810.0,
                                                                    "response": "Sorry, play on words. If BTCUSD goes down, you won't realize your dream of owning a donkey (ass).",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i2rq50t",
                                                                            "author": "youngWuuf",
                                                                            "score": 2,
                                                                            "created_utc": 1648676843.0,
                                                                            "response": "OH lol this went right over my head. Good one",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i2vmhzb",
                                            "author": "clawrence1158",
                                            "score": 1,
                                            "created_utc": 1648750294.0,
                                            "response": "I think donkey will leave the the private key on the Internet and it will create a bizarre.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i2s6731",
                                    "author": "Mrs-Lemon",
                                    "score": 3,
                                    "created_utc": 1648684005.0,
                                    "response": "> My experience with BTC in general is trash I can send money myself on a donkey faster\n\nSend me .01 cent via donkey faster than you can send me .01 cent over the bitcoin network and I'll give you 1 BTC.  100% serious.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i2s6jvh",
                                            "author": "youngWuuf",
                                            "score": -1,
                                            "created_utc": 1648684172.0,
                                            "response": "Twas a joke lad!!! But I was just trying to learn more about lightning but people on this sub are low key kinda soft. Not even talking about you",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i2sfwln",
                                                    "author": "FaithlessnessDry605",
                                                    "score": 3,
                                                    "created_utc": 1648688441.0,
                                                    "response": "Forgot to say \"bad uninformed\" joke. Maybe use /s....",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i2sgff3",
                                                            "author": "youngWuuf",
                                                            "score": 0,
                                                            "created_utc": 1648688671.0,
                                                            "response": "Oi",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i2u3uvo",
                                    "author": "mol2483",
                                    "score": 3,
                                    "created_utc": 1648727228.0,
                                    "response": "It is not only about sending money but it gives more advantages and those advantages generally include decentralization and complete freedom of transaction.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i2rt0vi",
                                    "author": "TheBobbyMan9",
                                    "score": 1,
                                    "created_utc": 1648678054.0,
                                    "response": "Don’t know what your using but lightning is a couple seconds",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i2rt791",
                                            "author": "youngWuuf",
                                            "score": 1,
                                            "created_utc": 1648678130.0,
                                            "response": "OG btc.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i2r0b86",
                            "author": "Timcrypto1308",
                            "score": -22,
                            "created_utc": 1648666563.0,
                            "response": "I agree until you said human rights.\n\nHuman right are constructivistic and egalitarian and therefore against anything bitcoin stands for.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i2r1i1i",
                                    "author": "HH0115",
                                    "score": 4,
                                    "created_utc": 1648667028.0,
                                    "response": "You’re putting words in my mouth. Human rights aren’t clearly defined unlike the term egalitarian. I think being able to store your work and take it anywhere is a human right is all. I see idiots everyday supported by the state not asking but demanding their fifth pair of Bluetooth headphones or foodstuffs that go into the trash and pollute the planet and themselves. On a Bitcoin standard they will get to trade their goods/services in a way which is agreeable to both parties. It’s going to be a rude awakening kicking the heroin that is the fiat way of life. A lot of this terrible behavior isn’t going to be tolerated. If the US loses it’s status in the world to other super powers it probably will be because of it’s focus on egalitarianism over all else and I agree with you. Pretty sure this is what the woke movement is about.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i2resat",
                                            "author": "Timcrypto1308",
                                            "score": -5,
                                            "created_utc": 1648672235.0,
                                            "response": "Human rights are constructivistic because nobody cares about them.\n\nNobody has human rights, the only people who have rights are those who have the power to enforce them.\n\nHuman rights are just a small part of the whole egalitarian narrative and congratulations, you fell for it.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i2r1qtk",
                                    "author": "CrypoFiend",
                                    "score": 5,
                                    "created_utc": 1648667124.0,
                                    "response": " The one thing I hate about this Bitcoin sub is the amount of hate from right-wing extremists about anything they deem as non-conservative.\n\nTruth is none of the political parties give an F about you.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i2rejbz",
                                            "author": "Timcrypto1308",
                                            "score": -4,
                                            "created_utc": 1648672139.0,
                                            "response": "Your comment doesn’t make any sense\n\n>right Wing extremism \n\n>conservative \n\n>political parties\n\nI‘m not a boomer, why would I care about what political parties think? Wtf? I do not care about politics in the slightest, I was just correcting this guy.\n\nAnd you clearly don’t understand bitcoin if you downvoted my comment.\n\nBitcoin is NOT about human rights and egalitarianism, not in the slightest",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i2r5hfv",
                    "author": "GrindingWit",
                    "score": 22,
                    "created_utc": 1648668584.0,
                    "response": "Apple owns, checking my notes, lots of US dollars.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i2tyh27",
                            "author": "knut11",
                            "score": 2,
                            "created_utc": 1648723641.0,
                            "response": "Aaaaand? USD is a depriciating asset.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i2qmpkj",
                    "author": "vnielz",
                    "score": 44,
                    "created_utc": 1648661219.0,
                    "response": "Probably mallers’Lightning + Apple integrated and announced on april 7th in Miami. Huge ✊🔥🚀",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i2r1e0d",
                            "author": "uikhgfzdd",
                            "score": 44,
                            "created_utc": 1648666983.0,
                            "response": "I believe it when I see it",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i2r4l34",
                                    "author": "jmw74",
                                    "score": 28,
                                    "created_utc": 1648668238.0,
                                    "response": "Me too. Apple and bitcoin couldn't be more diametrically opposed.\n\nApple: we control everything\n\nBitcoin: you control everything\n\nEdit: there may be some sort of partnership but I expect it'll be very distant and not the game changer people are hoping for.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i2r817v",
                                            "author": "Llonga",
                                            "score": 41,
                                            "created_utc": 1648669586.0,
                                            "response": "Plus, if true, Apple will want to announce it under their own narrative. Not a dude in Crocs at a Bitcoin conference.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i2rhxsq",
                                                    "author": "DonOregano",
                                                    "score": 19,
                                                    "created_utc": 1648673486.0,
                                                    "response": "This. \n\nThis is what makes this rumour completely unbelievable.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i2u92wt",
                                                    "author": "Boodsie",
                                                    "score": 2,
                                                    "created_utc": 1648730202.0,
                                                    "response": "Im pretty sure if Tim Cook was listed as a speaker the cat would be out of the bag lol",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i2su2ug",
                                                    "author": "giszmo",
                                                    "score": 2,
                                                    "created_utc": 1648694959.0,
                                                    "response": "Last year, Bukele wasn't on the speakers list neither.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i2swbzq",
                                                    "author": "Parking_Meater",
                                                    "score": 1,
                                                    "created_utc": 1648696057.0,
                                                    "response": "I mean that's kinda their whole demographic.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i2tuxpq",
                                                            "author": "LiteratureUsual614",
                                                            "score": 1,
                                                            "created_utc": 1648720885.0,
                                                            "response": "I took that personally",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i2rkkt7",
                                                    "author": "tjsmind",
                                                    "score": -1,
                                                    "created_utc": 1648674547.0,
                                                    "response": "Don’t forget the hoodie and baseball cap",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i2rt58s",
                                                            "author": "explosiveplacard",
                                                            "score": 3,
                                                            "created_utc": 1648678106.0,
                                                            "response": "Or broadcasting from his empty closet.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i2st5kp",
                                            "author": "HugeCorn",
                                            "score": 9,
                                            "created_utc": 1648694521.0,
                                            "response": "I disagree. For being one of the most profitable companies in the history of mankind, they're surprisingly pro-encryption and privacy from a technical sense. They are pioneers in multiple encryption technologies and have a comparatively good track record of security compared to other software+hardware companies. I think bitcoin aligns with their principals from both a user experience and a technology perspective.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i2u88i7",
                                                    "author": "jmw74",
                                                    "score": -1,
                                                    "created_utc": 1648729756.0,
                                                    "response": "A lot of people here have really been drinking the Apple kool aid.\n\nI never said apple is insecure. I said they don't give you control over your own device.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i2rjt0s",
                                            "author": "Public-Gap4804",
                                            "score": 5,
                                            "created_utc": 1648674234.0,
                                            "response": "Nope. On iphone you can turn off everything you don't want to share. They only control things that can make your phone unsafe.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i2rkyee",
                                                    "author": "jmw74",
                                                    "score": 4,
                                                    "created_utc": 1648674704.0,
                                                    "response": "I meant like you can't install any software that apple doesn't explicitly approve or otherwise make an iPhone do something you want that apple doesn't want.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i2roex0",
                                                            "author": "Public-Gap4804",
                                                            "score": 8,
                                                            "created_utc": 1648676125.0,
                                                            "response": "I know what you mean, but that makes these devices safe. I would be terrified to have a crypto app on a Chinese brand Android phone.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i2sfy2l",
                                                                    "author": "whitslack",
                                                                    "score": 0,
                                                                    "created_utc": 1648688459.0,
                                                                    "response": "I have a Chinese-brand Android phone. The trick is to put an open-source OS image on it right away. Don't use the spyware-infested factory load. How great that Android lets you compile your own OS from sources if you want to. Meanwhile, iOS isn't even open-source. Security by obscurity, anyone?",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i2uzhbc",
                                                                            "author": "Public-Gap4804",
                                                                            "score": 2,
                                                                            "created_utc": 1648741551.0,
                                                                            "response": "i don't need to change my ringtone to a Bieber song, i don't need pikachu font in sms app, i am all good. If you need to be a hacker/it guy to use your brand new phone, it is not serious.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "i2su351",
                                                                    "author": "hiyadagon",
                                                                    "score": 1,
                                                                    "created_utc": 1648694962.0,
                                                                    "response": "Safe\\[r\\]. Remember the fake Trezor app that slipped past them?",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i2uzoj3",
                                                                            "author": "Public-Gap4804",
                                                                            "score": 1,
                                                                            "created_utc": 1648741628.0,
                                                                            "response": "nice fail from Apple, never heard about it, lol",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "i2tftos",
                                                                    "author": "Get_the_nak",
                                                                    "score": 1,
                                                                    "created_utc": 1648708102.0,
                                                                    "response": "Where do you think your iPhone is built?",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i2uzze1",
                                                                            "author": "Public-Gap4804",
                                                                            "score": 1,
                                                                            "created_utc": 1648741743.0,
                                                                            "response": "and what it has to do with OS? Phone can see if screen is not original, you think chinese can hide hacked stuff inside phones? :D",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i2rlzq3",
                                                    "author": "gaytechdadwithson",
                                                    "score": 0,
                                                    "created_utc": 1648675130.0,
                                                    "response": "like their dumb air tags that makes your phone find other peoples stuff?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i2romu8",
                                                            "author": "Public-Gap4804",
                                                            "score": 3,
                                                            "created_utc": 1648676217.0,
                                                            "response": "How is that bad for you? I don't mind if that helps other people.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i2rorpp",
                                                                    "author": "gaytechdadwithson",
                                                                    "score": 2,
                                                                    "created_utc": 1648676273.0,
                                                                    "response": "i didn’t say that, just that it’s something you can’t control/share",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i2s7ihq",
                                            "author": "qbtc",
                                            "score": 1,
                                            "created_utc": 1648684619.0,
                                            "response": "Strike is pretty aligned to \"we control everything\"\n\n(but fake rumor nonetheless imo)",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i2s7pjz",
                                                    "author": "jmw74",
                                                    "score": 1,
                                                    "created_utc": 1648684711.0,
                                                    "response": "I don't think apple sees strike that way though.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i2sfj5w",
                                            "author": "whitslack",
                                            "score": 1,
                                            "created_utc": 1648688273.0,
                                            "response": ">there may be some sort of partnership but I expect it'll be very distant and not the game changer people are hoping for. \n\nSomething like the extremely minimal \"integration\" that Twitter \"implemented\" (namely, being able to add a Lightning payment link on your Twitter profile). Maybe Apple will allow adding one's Strike account as a card in Apple Pay, basically a glorified bookmark to the Strike website. I wouldn't even expect automatic sign-in.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i2tmnzl",
                                            "author": "Medical-Confidence-4",
                                            "score": 1,
                                            "created_utc": 1648713731.0,
                                            "response": "Diametrically opposed, foes.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i2v29dx",
                            "author": "AffectionateCanary25",
                            "score": 1,
                            "created_utc": 1648742621.0,
                            "response": "Someone was saying that allowing Bitcoin would disrupt apple's current payment system, apple pay. \n\nI don't know enough about payment systems but does apple have a reason to adopt something that would disrupt their current business? \n\nThat's like a horseshoe maker adopting tires. Yeah it makes sense because the tech is better, but isn't the horseshoe business (the incumbent moneymaker) going to be hurt by allocating time and resources to tires? \n\nI don't know if that makes sense, but apple seems to always want a monopoly on whatever they do.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i2qwexq",
                    "author": "PizzaForCats",
                    "score": 66,
                    "created_utc": 1648665032.0,
                    "response": "Highly doubt Apple would add native lightning support or a bitcoin exchange to Wallet app, mostly because of energy FUD, they are too concerned about their image to be an early mover in that space. \n\nMy guess is that is not a partnership from Apple, but the (soon to be released) Strike Card in the wallet app, sort of like what BitPay did. \n\nI hope I'm wrong and it's native support, but seems too good to be true.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i2qzhsi",
                            "author": "Ok_Aerie3546",
                            "score": 14,
                            "created_utc": 1648666244.0,
                            "response": "I think this is more likely.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i2r1rdq",
                            "author": "Raine386",
                            "score": 7,
                            "created_utc": 1648667130.0,
                            "response": "Good point. I feel like the mainstream tech companies all know that Bitcoin is going to take over. They're all trying to get in as quietly as possible, while continuing the energy FUD to keep the prices low for as long as possible\n\nBut I don't know shit so",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i2r2bkj",
                            "author": "coffee_for_dinner",
                            "score": 6,
                            "created_utc": 1648667353.0,
                            "response": "This seems a lot more likely. I was imagining lighting in your Apple Wallet but I doubt Apple will even have a presence at the conference. They're not going to move in until everyone and their mum is using bitcoin.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i2rha29",
                            "author": "bitsteiner",
                            "score": 2,
                            "created_utc": 1648673224.0,
                            "response": "Regarding energy fud, their whole infrastructure from chip making, fabrication, data centers uses tons of energy and other resources. Probably in similar dimension of bitcoin's PoW.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i2r3hpz",
                            "author": "VanillaGoy",
                            "score": 1,
                            "created_utc": 1648667814.0,
                            "response": "Yes. It will remain unavailable to states not currently allowing strike",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i2tmn28",
                                    "author": "Medical-Confidence-4",
                                    "score": 1,
                                    "created_utc": 1648713709.0,
                                    "response": "What other services like Strike are allowed?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i2vnalv",
                            "author": "dinglebarry9",
                            "score": 1,
                            "created_utc": 1648750598.0,
                            "response": "You are probably correct. Apple did release a cryptography kit 2yrs ago, just like Samsung did prior to launching the Samsung Blockchain Wallet.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i2qxtu2",
                    "author": "Mishack47",
                    "score": 8,
                    "created_utc": 1648665592.0,
                    "response": "KYC included, I suppose...",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i2rixk6",
                            "author": "BitcoinFan1239",
                            "score": 2,
                            "created_utc": 1648673884.0,
                            "response": "this could be so huge!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i2qn8y9",
                    "author": "coinfeeds-bot",
                    "score": 17,
                    "created_utc": 1648661431.0,
                    "response": "tldr; Jack Mallers, CEO of Bitcoin and payments app Strike, is expected to announce a partnership between Apple and Strike to enable Bitcoin Lightning payments on the tech giant’s devices. The announcement will be made at the Bitcoin 2022 conference in Miami during April 6–9.\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR.*",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i2rpwmq",
                            "author": "hidde-30",
                            "score": 34,
                            "created_utc": 1648676746.0,
                            "response": "Ah yes the CEO of Bitcoin",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i2s0j13",
                                    "author": "TheWorldofGood",
                                    "score": 1,
                                    "created_utc": 1648681391.0,
                                    "response": "Accidentally exposed as Satoshi",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i2t165j",
                                    "author": "AtheistMantis69",
                                    "score": 1,
                                    "created_utc": 1648698612.0,
                                    "response": "He managed to climb up to CEO? I remember him as head of HR in the Bitcoin headquarters.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i2qr1o8",
                    "author": "hyperinflationUSA",
                    "score": 31,
                    "created_utc": 1648662914.0,
                    "response": "Tim Cook has mentioned that he personally bought some Bitcoin not too long ago.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i2r9hwt",
                            "author": "reddit4485",
                            "score": 7,
                            "created_utc": 1648670160.0,
                            "response": "https://twitter.com/jackmallers/status/1508564108802670600?s=12\nJack Mallers' (founder of Strike) twitter feed that started the speculation.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i2rjdqm",
                                    "author": "llewsor",
                                    "score": 7,
                                    "created_utc": 1648674063.0,
                                    "response": "whoa, fucking crazy if true. \n\njack is orange pilling nations and corporations 🍊🍎",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i2vla7n",
                                    "author": "ualdayan",
                                    "score": 1,
                                    "created_utc": 1648749830.0,
                                    "response": "That is what people are going off of?  I think he was more emphasizing “think different” rather than trying to drop some Apple specific hint of future business partnerships.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i2s8csx",
                            "author": "joecool42069",
                            "score": 3,
                            "created_utc": 1648685007.0,
                            "response": "Tim Apple",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i2r7uuv",
                            "author": "Llonga",
                            "score": 8,
                            "created_utc": 1648669516.0,
                            "response": "“Crypto”. Not specifically Bitcoin.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i2r9xl7",
                                    "author": "admiralCeres",
                                    "score": 11,
                                    "created_utc": 1648670331.0,
                                    "response": "He didn’t say crypto. The question was did you own Bitcoin and as he started to answer the questioner added “or other crypto “ and Tim Apple responded “yes”.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i2snm4g",
                    "author": "cbblythe",
                    "score": 5,
                    "created_utc": 1648691941.0,
                    "response": "All this because Mallers wore an apple hat?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i2sv61e",
                            "author": "TakeCareOfYourM0ther",
                            "score": 5,
                            "created_utc": 1648695480.0,
                            "response": "Yea and him tweeting a legendary ad that could mean a million of different things. Apple isn’t partnering with strike.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i2ssaml",
                            "author": "BHN1618",
                            "score": 4,
                            "created_utc": 1648694114.0,
                            "response": "Hopium",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i2s28ve",
                    "author": "TheWorldofGood",
                    "score": 5,
                    "created_utc": 1648682181.0,
                    "response": "Strike is not even available outside of the US, El Salvador, and Argentina. Apple won’t partner with anything unless it’s proven to be rock solid with many customers like Visa and Mastercard.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2qytgu",
                    "author": "Tetons21",
                    "score": 15,
                    "created_utc": 1648665983.0,
                    "response": "Shouldn’t this be holy shit level news!?!?\n\nIf Mallers is just hyping and this doesn’t deliver I’m gunna lose a lotta respect. For Dorsey too who was retweeting the same hype.\n\nBut if Apple does integrate, congrats to all my fellow holders, cause we are taking off!!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i2ra824",
                            "author": "admiralCeres",
                            "score": 2,
                            "created_utc": 1648670444.0,
                            "response": "I think this is why Apple and Bitcoin have both been in a run in the past 10 days. We’ll see.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i2rymy7",
                            "author": "Oo0o8o0oO",
                            "score": 1,
                            "created_utc": 1648680535.0,
                            "response": "The news would be holy shit news.\n\nThe rumor is typical speculative bitcoin and apple news.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i2qyp4w",
                    "author": "Temporary-Welder7588",
                    "score": 7,
                    "created_utc": 1648665936.0,
                    "response": "I could see it happening. But only if Apple actually buys strike. And they wouldn't announce it at Bitcoin Conference. It would be during an actual Apple event.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i2r8ebt",
                            "author": "Llonga",
                            "score": 3,
                            "created_utc": 1648669731.0,
                            "response": "This.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i2rkgdu",
                            "author": "BitcoinFan1239",
                            "score": 5,
                            "created_utc": 1648674496.0,
                            "response": "apple could 100% buy strike",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i2tt5in",
                                    "author": "hicoBM",
                                    "score": 1,
                                    "created_utc": 1648719393.0,
                                    "response": "Hahahahahahahah delusional as fuck!!!!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i2ra2st",
                            "author": "admiralCeres",
                            "score": -2,
                            "created_utc": 1648670387.0,
                            "response": "Why is everyone saying this as if it’s a known fact. How do you know what they would do?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i2rb7ps",
                                    "author": "Temporary-Welder7588",
                                    "score": 5,
                                    "created_utc": 1648670831.0,
                                    "response": "Because I've been a closer watcher of Apple for my entire life and Apple needs to do things their way.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i2rhbkq",
                                            "author": "admiralCeres",
                                            "score": -4,
                                            "created_utc": 1648673240.0,
                                            "response": "A watcher of Apple. Oh, I wasn’t aware. I had no idea. You definitely would know what they would do.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i2rhn4w",
                                                    "author": "Temporary-Welder7588",
                                                    "score": 4,
                                                    "created_utc": 1648673367.0,
                                                    "response": "Name one instance of where Apple partnered with another company on a major feature, and then it was announced at a random non-Apple event?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i2rkzwf",
                                                            "author": "admiralCeres",
                                                            "score": 1,
                                                            "created_utc": 1648674721.0,
                                                            "response": "There has never been anything like Bitcoin before and there probably never will be again.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i2s1jje",
                    "author": "VVaId0",
                    "score": 3,
                    "created_utc": 1648681856.0,
                    "response": "Strike is wonderful.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2sxz4m",
                    "author": "NinjaLingua",
                    "score": 3,
                    "created_utc": 1648696906.0,
                    "response": "Fuck Apple.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2szc1q",
                    "author": "ih8te123",
                    "score": 3,
                    "created_utc": 1648697631.0,
                    "response": "I get my SATS on STRIKE.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2tebc5",
                    "author": "dexX7",
                    "score": 3,
                    "created_utc": 1648706966.0,
                    "response": "I don't think so. Strike isn't even available globally yet",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2qr97a",
                    "author": "fiercygoat",
                    "score": 9,
                    "created_utc": 1648662996.0,
                    "response": "This is very bullish",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i2r38tl",
                            "author": "VanillaGoy",
                            "score": 5,
                            "created_utc": 1648667716.0,
                            "response": "Unless you live in NY or other states that dont allow strike.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i2rbc0p",
                                    "author": "irisuniverse",
                                    "score": 5,
                                    "created_utc": 1648670877.0,
                                    "response": "Pretty sure bullish means price likely to go up. Having restrictions in your state fur lightning doesn’t make a difference on if the coin you own goes up in value or not based on the news.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i2rglrv",
                                            "author": "VanillaGoy",
                                            "score": -2,
                                            "created_utc": 1648672957.0,
                                            "response": "Bullish=positive",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i2skh6l",
                                    "author": "mackey_",
                                    "score": 2,
                                    "created_utc": 1648690508.0,
                                    "response": "What's with NY not having Strike?",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i2tt87h",
                                    "author": "hicoBM",
                                    "score": 1,
                                    "created_utc": 1648719455.0,
                                    "response": "Hahahaha no money transmitter licenses but ppl thinks that you can partner with big boys like apple acting like a rookie in the payment sector!!!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i2ttgvh",
                            "author": "hicoBM",
                            "score": 1,
                            "created_utc": 1648719658.0,
                            "response": "Bullish to what!!!????? This app don’t had the right money transmitter license and you are yelling bullish… hahahaha if you wanna move money around the country or around the world son you need to do everything by the law…. strike app or zap doesn’t had compliance… if you can’t operate in NY it’s a huge red flag son… Jack are taking chances with the app and playing with a lot of fire!!! Fincen are going to fuck it up!!!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i2sf34l",
                    "author": "Tremulant1",
                    "score": 6,
                    "created_utc": 1648688070.0,
                    "response": "That would be great. But why does Apple need Strike for anything? If they want to integrate lighting of Bitcoin into Apple Wallets they can just do it all themselves. Or they can buy Strike I suppose.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2r229b",
                    "author": "coffee_for_dinner",
                    "score": 5,
                    "created_utc": 1648667250.0,
                    "response": "Was going to say this is fake until I saw the Mallers tweets... Dayum.\n\nEdit: Interesting... Apple has added the Bitcoin symbol to their icons: https://twitter.com/hugodouchet/status/1509198874996621313\n\nYou can download them here to see yourself. Apparently they have been there for a couple of years though... So not exactly news.\n\nhttps://developer.apple.com/sf-symbols/",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2rpe7z",
                    "author": "mellowyellow313",
                    "score": 2,
                    "created_utc": 1648676531.0,
                    "response": "Great if true but I’ll believe it when I see it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2rqp0s",
                    "author": "Stocksugardaddy",
                    "score": 2,
                    "created_utc": 1648677071.0,
                    "response": "Apple getting rid of Goldman",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2ttfnu",
                    "author": "Labius",
                    "score": 2,
                    "created_utc": 1648719630.0,
                    "response": "We're just going with this narrative huh? Based on nothing than an ad which sounds like a bunch of self-mastubatory noise about how revolutionary bitocoin is. Can you imagine Apple letting someone else make the announcement, at some feral conference?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2qlzo4",
                    "author": "pnemi",
                    "score": 3,
                    "created_utc": 1648660940.0,
                    "response": "What",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i2qmjze",
                            "author": "Fatbaldmuslim",
                            "score": 15,
                            "created_utc": 1648661159.0,
                            "response": "Apple Rumored to Be Partnering With Strike for Bitcoin Lightning Payments",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i2r1tfj",
                                    "author": "Raine386",
                                    "score": 3,
                                    "created_utc": 1648667153.0,
                                    "response": "Wait, what?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i2qqvv2",
                            "author": "Mr_Popo55",
                            "score": 4,
                            "created_utc": 1648662849.0,
                            "response": "Their doing who in the waht now?!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i2st2zl",
                    "author": "hiitstyler",
                    "score": 2,
                    "created_utc": 1648694487.0,
                    "response": "apple will claim they invented it",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2qrsn6",
                    "author": "igadjeed",
                    "score": -2,
                    "created_utc": 1648663208.0,
                    "response": "Fake rumor",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i2qs1xb",
                            "author": "TreS-2b",
                            "score": 7,
                            "created_utc": 1648663310.0,
                            "response": "We wont have to wait long to see if thats true or false.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i2qsnoj",
                                    "author": "igadjeed",
                                    "score": -3,
                                    "created_utc": 1648663549.0,
                                    "response": "It's false, like all the other \"Apple loves Bitcoin\" posts, which will continue being false forever",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i2qtzw9",
                            "author": "DarthPlatypus23",
                            "score": 3,
                            "created_utc": 1648664080.0,
                            "response": "https://twitter.com/wclementeiii/status/1509210097460912137?s=21&t=Uxag1GqTWZNtey6wsX1RxQ",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i2qutss",
                            "author": "thadiusb",
                            "score": 2,
                            "created_utc": 1648664408.0,
                            "response": "Jack droppin mad hints tho. It was only a matter of time before Apple capitalized. One day, “fake rumor” will end up being true.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i2s3vpx",
                    "author": "markasoftware",
                    "score": -1,
                    "created_utc": 1648682928.0,
                    "response": "Strike is a web wallet: https://strike.me/en/faq/bitcoincustody\n\nDo not use Strike. Coins held in Strike do not belong to you.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i2sxawm",
                            "author": "One_Psychology_6500",
                            "score": 3,
                            "created_utc": 1648696556.0,
                            "response": "No one using strike is under the illusion that they hold their own keys. It’s a wallet meant for simple transactions and a marketplace for cheap access to bitcoin. A little more nuance would suit everyone.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i2t6lyq",
                            "author": "senfmeister",
                            "score": 3,
                            "created_utc": 1648701765.0,
                            "response": "You can't even deposit Bitcoin into Strike. It's not really a wallet, but it's a good place to buy sats that you can withdraw to a wallet.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i2qycbb",
                    "author": "Zestyclose_Ad4257",
                    "score": 0,
                    "created_utc": 1648665795.0,
                    "response": "Fake as always! Apple would be the last to buy Bitcoin!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i2u622u",
                            "author": "Wise_Recover9576",
                            "score": 1,
                            "created_utc": 1648728541.0,
                            "response": "Dont need to buy bitcoin to use the network",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i2rcnl2",
                    "author": "MrRGnome",
                    "score": 0,
                    "created_utc": 1648671395.0,
                    "response": "The rumor should be \"Apple rumored to be running bitcoin and lightning node for payments\". Not \"Bitcoin-fiat middleman rumored to replace fiat middleman\". How far we as a community have moved away from our values that this is what we applaud.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2qxfwn",
                    "author": "sceaga_genesis",
                    "score": 1,
                    "created_utc": 1648665439.0,
                    "response": "This is the news I’ve been waiting for. It’s akin to Apple buying bitcoin for their treasury, but with even more network power.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2r34o8",
                    "author": "comfyggs",
                    "score": 1,
                    "created_utc": 1648667670.0,
                    "response": "Incredibly bullish",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2rjj5z",
                    "author": "Public-Gap4804",
                    "score": 1,
                    "created_utc": 1648674122.0,
                    "response": "If this is true, adoption will EXPLODE",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2rq6u2",
                    "author": "hashgraph9",
                    "score": 1,
                    "created_utc": 1648676863.0,
                    "response": "instruction very clear:  betting my family farm on the rumors!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2rs37x",
                    "author": "futuretothemoon",
                    "score": 1,
                    "created_utc": 1648677657.0,
                    "response": "Just a rumour..",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2ru1wg",
                    "author": "mohanad_najeeb",
                    "score": 1,
                    "created_utc": 1648678501.0,
                    "response": "Not a chance",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2ryqjf",
                    "author": "stick-robot",
                    "score": 1,
                    "created_utc": 1648680580.0,
                    "response": "Could be related https://arstechnica.com/gadgets/2022/03/apple-plans-to-build-its-own-financial-infrastructure-for-payments-and-lending/",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2sgs7s",
                    "author": "DeMejia",
                    "score": 1,
                    "created_utc": 1648688830.0,
                    "response": "Never owned an iPhone but I would legit swap",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2sjnq9",
                    "author": "davidw_-",
                    "score": 1,
                    "created_utc": 1648690139.0,
                    "response": "Makes absolute zero sense",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2slw1r",
                    "author": "adichandra",
                    "score": 1,
                    "created_utc": 1648691148.0,
                    "response": "Apple keeps lightning for the foreseeable future? Ahh shitt, here we go again.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2sndpt",
                    "author": "crazypostman21",
                    "score": 1,
                    "created_utc": 1648691832.0,
                    "response": "I've been using strike for probably a year, I have had some difficulties and problems but their customer support is nice and helpful also responds pretty quickly. Seems to be a trustworthy app.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2su204",
                    "author": "Creative_Visit122",
                    "score": 1,
                    "created_utc": 1648694948.0,
                    "response": "Oh shit, yes stack the sats, a guide to bitcoin should include lightning on ramps and notable utility coins.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2thvqk",
                    "author": "sylsau",
                    "score": 1,
                    "created_utc": 1648709708.0,
                    "response": "Adoption continues to progress. Step by step.\r\n\nThe first GAFA to switch will logically drag the others into the Bitcoin world.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2tkpkn",
                    "author": "bazookateeth",
                    "score": 1,
                    "created_utc": 1648712050.0,
                    "response": "Ummm this could be game changing in a massive way.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2tqdpt",
                    "author": "aliensmadeus",
                    "score": 1,
                    "created_utc": 1648716997.0,
                    "response": "please let them integrate bitcoin into the apple wallet, please",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2u00lf",
                    "author": "apesex67",
                    "score": 1,
                    "created_utc": 1648724719.0,
                    "response": "Don't get your hopes up, this seems like a lot of BS",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2u2uw7",
                    "author": "turn3daytona",
                    "score": 1,
                    "created_utc": 1648726604.0,
                    "response": "X doubt. \n\nApple is not going to partner with Strike lol.  Y’all are trippin",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2u5h3t",
                    "author": "Tegridy-Weed",
                    "score": 1,
                    "created_utc": 1648728201.0,
                    "response": "I thought this was a done deal not rumour?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2u82fv",
                    "author": "jaapiekrekel101",
                    "score": 1,
                    "created_utc": 1648729662.0,
                    "response": "Rumor = 1 photo of a Apple cap and a tweet",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2v8ff8",
                    "author": "gohagin",
                    "score": 1,
                    "created_utc": 1648744952.0,
                    "response": "If it is happening in real then I am sure that it will help the growth of Bitcoin.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i3unt95",
                    "author": "jon_jingleheimer",
                    "score": 1,
                    "created_utc": 1649386778.0,
                    "response": "Hah. No just NCR. One of the largest POS providers.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i3vouxg",
                    "author": "efbrown3",
                    "score": 1,
                    "created_utc": 1649411146.0,
                    "response": "Well this rumor turned out to be complete bullshit….lol",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2ts27x",
                    "author": "hicoBM",
                    "score": -1,
                    "created_utc": 1648718463.0,
                    "response": "Strike doesn’t had money transmitter licenses so go with this delusional post to the exit…. Ppl thinks that you had permission to move money without the correct compliance… apple it’s not going to take chances to use strike… Jack you are a clown thinking that you could do it in the payment sector and had only a one license at Washington hahahhhahahahahhhahahahahahhhahahahahahha",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2qwr72",
                    "author": "SuspiciousSquid94",
                    "score": 0,
                    "created_utc": 1648665169.0,
                    "response": "I want to know what apples incentive to do this is.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i2rcgky",
                            "author": "00DEADBEEF",
                            "score": 2,
                            "created_utc": 1648671317.0,
                            "response": "What incentive did Apple have to make Apple Pay? They don't directly make money from you registering your card in your Wallet. They did it because they knew people wanted it. People will buy iPhones if it does the things they want.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i2r1d24",
                            "author": "jon_jingleheimer",
                            "score": 1,
                            "created_utc": 1648666973.0,
                            "response": "Innovation",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i2r1lh2",
                                    "author": "SuspiciousSquid94",
                                    "score": -1,
                                    "created_utc": 1648667065.0,
                                    "response": "This can’t be a legitimate answer 😂",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i2r2ich",
                                            "author": "jon_jingleheimer",
                                            "score": 1,
                                            "created_utc": 1648667427.0,
                                            "response": "Are you fucking dense? Do you think tech companies want to just wait until their competitor does it? Like what incentive did apple have for adding emojis? Bec people want to use them.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i2r4ucd",
                                                    "author": "SuspiciousSquid94",
                                                    "score": 0,
                                                    "created_utc": 1648668336.0,
                                                    "response": "I work in tech, specifically corporate for a fortune 5 company. These companies are data driven, “innovation” is a buzzword you hear mostly in marketing on the consumer side. It’s not an answer. At the end of the day what matters is the dollars,cents and the data which normally plays into a multi-year plan to develop a product or a platform.\n\nI’m asking what’s in it for apple, saying innovation isn’t helpful. I’m curious how adopting bitcoin is helpful both in the short and long term IE: I want a better understanding of their big picture and how bitcoin payments are beneficial to their ecosystem as a whole.\n\nAlso, apple traditionally has their own spin on the technologies they implement so i’m curious to see the specifics of how they would implement this.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i2rm4nk",
                                                            "author": "jon_jingleheimer",
                                                            "score": 1,
                                                            "created_utc": 1648675186.0,
                                                            "response": "Do you think that Bitcoin is the future of money?",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i3und2a",
                                                                    "author": "SuspiciousSquid94",
                                                                    "score": 1,
                                                                    "created_utc": 1649386566.0,
                                                                    "response": "Seems apple has no incentive as of now.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i3unx22",
                                                                            "author": "jon_jingleheimer",
                                                                            "score": 1,
                                                                            "created_utc": 1649386828.0,
                                                                            "response": "Hah. No just NCR. One of the largest POS providers.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i3uo94g",
                                                                                    "author": "SuspiciousSquid94",
                                                                                    "score": 1,
                                                                                    "created_utc": 1649386983.0,
                                                                                    "response": "Pretty cool though regardless, definitely not as “hype” though.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i3uokr4",
                                                                                            "author": "jon_jingleheimer",
                                                                                            "score": 1,
                                                                                            "created_utc": 1649387135.0,
                                                                                            "response": "Really? Apple is just one company. NCR has a ton of major companies run through it. I honestly think this is bigger than any apply pay integration.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i2rgkug",
                    "author": "chriskzoo",
                    "score": 0,
                    "created_utc": 1648672946.0,
                    "response": "Apple could incorporate it into Podcasts using Podcasting 2.0 - wouldn't need Strike, per se, to do so, but maybe using their tech.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2rw56z",
                    "author": "Hefty_Jicama",
                    "score": 0,
                    "created_utc": 1648679424.0,
                    "response": "Huge if true",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i2rwe8x",
                    "author": "tito_807",
                    "score": 0,
                    "created_utc": 1648679538.0,
                    "response": "Cool, but they still have their 30% taxe on apple store, so don't use apple store.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "v0ri6z",
            "title": "The time is ripe #BITCOIN",
            "url": "https://www.reddit.com/r/Bitcoin/comments/v0ri6z/the_time_is_ripe_bitcoin/",
            "author": "CWCOfficial",
            "created_utc": 1653882594.0,
            "score": 27,
            "num_comments": 12,
            "subreddit": "Bitcoin",
            "selftext": "&#x200B;\n\n[The time is ripe #BITCOIN](https://preview.redd.it/4aepct2icj291.jpg?width=1321&format=pjpg&auto=webp&s=dad0f7e9ecd04f6e2041d80b51871cf7f67b6336)",
            "stickied": false,
            "comments": [
                {
                    "id": "iai9rep",
                    "author": "BTC-maxi",
                    "score": 15,
                    "created_utc": 1653883165.0,
                    "response": "The time is ripe and so am I",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaiazt9",
                            "author": "CWCOfficial",
                            "score": 8,
                            "created_utc": 1653883877.0,
                            "response": "Me too",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iaiae08",
                    "author": "wwmore11",
                    "score": 5,
                    "created_utc": 1653883516.0,
                    "response": "Sweet lines on chart!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaiaz49",
                            "author": "CWCOfficial",
                            "score": 2,
                            "created_utc": 1653883866.0,
                            "response": "Nice chart so far",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iaicpn2",
                                    "author": "wwmore11",
                                    "score": 0,
                                    "created_utc": 1653884939.0,
                                    "response": "so far indeed",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iaifhxe",
                    "author": "Argyrus777",
                    "score": 2,
                    "created_utc": 1653886712.0,
                    "response": "Can’t remember which YouTuber showing similar graph but it’s like 300 or 250 days instead",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaigvnr",
                            "author": "TurdsBurglar",
                            "score": 1,
                            "created_utc": 1653887637.0,
                            "response": "Maybe chico",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iaij33e",
                    "author": "Romsel87",
                    "score": 1,
                    "created_utc": 1653889170.0,
                    "response": "I read Stonk Monkey lol. \n\nNGU4L",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaij49x",
                    "author": "kuzkokronk",
                    "score": 1,
                    "created_utc": 1653889193.0,
                    "response": "MY BODY IS READY",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaikjh6",
                    "author": "afBeaver",
                    "score": 1,
                    "created_utc": 1653890229.0,
                    "response": "Ah… lines on a chart predicting the future. Those are always correct!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaiklyj",
                    "author": "rowdysheeps",
                    "score": 1,
                    "created_utc": 1653890280.0,
                    "response": "Am I the only one that wants the price to stay down for longer?!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaicsn5",
                    "author": "smilingbuddhauk",
                    "score": 0,
                    "created_utc": 1653884991.0,
                    "response": "NGU tech cannot fail!",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}