{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uzof0p",
            "title": "Planet Earth is backed by a single energy source.",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uzof0p/planet_earth_is_backed_by_a_single_energy_source/",
            "author": "Sealobo",
            "created_utc": 1653747958.0,
            "score": 21,
            "num_comments": 88,
            "subreddit": "Bitcoin",
            "selftext": "Everything is directly/indirectly powered by the sun. Energy is the ultimate unit of account. Bitcoin makes so much sense once it’s viewed in such frame of reference.",
            "stickied": false,
            "comments": [
                {
                    "id": "iacdq57",
                    "author": "Zealousideal_Lab537",
                    "score": 10,
                    "created_utc": 1653764969.0,
                    "response": "Magma in the middle of the planet: am I a joke to you?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iacibjb",
                            "author": "GoldenTrike",
                            "score": -6,
                            "created_utc": 1653767132.0,
                            "response": "If the sun disappeared tomorrow the earth’s core would solidify in about 5,000 years. And we’d be living as tunnel people. So yeah in the grand scheme of things the sun is like 99% of all power and without it all other sources would also eventually stop existing.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iacnwkc",
                                    "author": "crustycalzone",
                                    "score": 8,
                                    "created_utc": 1653769843.0,
                                    "response": "This is false.  The earth is cooling, and the surface heat from the sun has little effect on this.  There are 3 energy sources listed for the heat in the earth, and none of them are the sun.  It is mostly radioactive decay.\n\nhttps://www.scientificamerican.com/article/why-is-the-earths-core-so/",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iaeao6m",
                                            "author": "Stallj",
                                            "score": 2,
                                            "created_utc": 1653802384.0,
                                            "response": "What about my farts?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iagmows",
                                                    "author": "nachofb84",
                                                    "score": 1,
                                                    "created_utc": 1653853066.0,
                                                    "response": "I don't think that there is any option to use fart as the energy source or not.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "iae0n1d",
                                            "author": "Pin_ups",
                                            "score": 1,
                                            "created_utc": 1653795563.0,
                                            "response": "Interesting idea but if our star to become red giant by then, we shouldn't worry about Earth core cooling, I do understand that there are atmospheric escape.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "iacqony",
                                            "author": "GoldenTrike",
                                            "score": -2,
                                            "created_utc": 1653771154.0,
                                            "response": "Can the core heat the surface like the sun? Because if not then we’re fucked.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iadhtmj",
                                                    "author": "hatsuseno",
                                                    "score": 4,
                                                    "created_utc": 1653784750.0,
                                                    "response": "There was no doubt we'd be fucked, but the core won't solidify in 5k years, not by any stretch of the imagination.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "iaerkva",
                                                    "author": "OverSoft",
                                                    "score": 1,
                                                    "created_utc": 1653816900.0,
                                                    "response": "No, but that wasn’t what you said.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "iaepyqe",
                                    "author": "Simple_List_3092",
                                    "score": 2,
                                    "created_utc": 1653815436.0,
                                    "response": "> If the sun disappeared tomorrow the earth’s core would solidify in about 5,000 years. \n\nThat's wrong.\n\nAlso you missed Uranium.  It's radioactive and not powered by the sun.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "iad5fn5",
                                    "author": "ianyboo",
                                    "score": 1,
                                    "created_utc": 1653778179.0,
                                    "response": "\nCompletely false. Why take the time to type out a comment if you have no clue what you are talking about?\n\nCheck here for the actual answer: https://youtu.be/bZDbrayj5O0",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iadjy2r",
                                            "author": "GoldenTrike",
                                            "score": -1,
                                            "created_utc": 1653785930.0,
                                            "response": "Dude links a 33 minute video to convey a point that could be explained in 5 minutes. Brevity isn’t your strong suit. \n\nWe would still be living like tunnel people. And our survival is dependent on our technology advancing enough.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iadkse7",
                                                    "author": "ianyboo",
                                                    "score": -1,
                                                    "created_utc": 1653786392.0,
                                                    "response": "Sorry your attention span isn't up to the task of actually taking the time to have an accurate picture of reality.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iadl8oe",
                                                            "author": "GoldenTrike",
                                                            "score": 0,
                                                            "created_utc": 1653786642.0,
                                                            "response": "Damn personal attacks too eh? Go touch\nGrass bud.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iadeeof",
                    "author": "piquant-nuggets",
                    "score": 6,
                    "created_utc": 1653782887.0,
                    "response": "How high were you when you wrote this?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iacqonq",
                    "author": "SamWizza",
                    "score": 7,
                    "created_utc": 1653771154.0,
                    "response": "If energy as unit of account means having an intrinsic value that can be related to energy output, Bitcoin doesn’t have energy output, so I think the premise is shaky.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iadaerz",
                            "author": "youbehasbeen",
                            "score": 1,
                            "created_utc": 1653780752.0,
                            "response": "Energy as a unit of account means you value based on energy *input.* And item is valuable based on how much energy it holds.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iadbqfp",
                                    "author": "SamWizza",
                                    "score": 1,
                                    "created_utc": 1653781449.0,
                                    "response": "Which means BTC is way overpriced even at these discounted levels?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iadm4x8",
                                            "author": "youbehasbeen",
                                            "score": 1,
                                            "created_utc": 1653787143.0,
                                            "response": "Do you have a model of the cost of energy input that's currently held across each bitcoin? I would be curious to see that.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "iad3sgo",
                            "author": "remarkablemayonaise",
                            "score": 0,
                            "created_utc": 1653777363.0,
                            "response": "I'm sure I read one of the BTC geniuses explain that mining Bitcoin is like charging a battery. But as you said all that's happened is that entropy has increased, we have the solution to another useless maths question (with unnecessary repetition of effort) and an experimental financial network is secure.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iabfeze",
                    "author": "gapema",
                    "score": 31,
                    "created_utc": 1653748705.0,
                    "response": "False. \n\nGeothermal energy is not powered by the sun. \n\nNuclear energy is not powered by the sun.\n\nTidal energy is not powered by the sun.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iacvprb",
                            "author": "ColdFusion3456",
                            "score": 3,
                            "created_utc": 1653773578.0,
                            "response": "Bitch just got mother fucking schooled. Welcome to school mother fuckers",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iafzuch",
                            "author": "13dca",
                            "score": 3,
                            "created_utc": 1653842522.0,
                            "response": "That's a very solid argument but I would like to read more about it because that sounds really interesting.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iabfwok",
                            "author": "Praxxtice",
                            "score": 26,
                            "created_utc": 1653748947.0,
                            "response": "Fusion creates those elements in a star fyi. Geothermal would not exist without fusion in a star.\n\nThe Sun(a star) actually does have an affect on the tides directly, and the moon wouldn't exist without fusion.\n\nDown vote me all you want I'm right.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iabj01s",
                                    "author": "MinimalGravitas",
                                    "score": 12,
                                    "created_utc": 1653750434.0,
                                    "response": "> Fusion creates those elements in a star fyi.\n\nNot the sun though. Everything 'heavier' than iron (so uranium for example) was created in supernova explosions. Our sun is at least a 3rd generation star, Earth and the other planets formed from the debris of previous stellar deaths. Therefore u/gapema is correct in that you can't say that the nuclear power we use in any way came from the sun.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iabj7v8",
                                            "author": "Praxxtice",
                                            "score": 1,
                                            "created_utc": 1653750537.0,
                                            "response": "That's my argument. All that energy is created in a star. Well except maybe hydrogen. I'm pretty sure that forms in the death of a black hole(which I look at as a black star, or a light fusion reactor, because it does emit energy on the electro magnetic spectrum.)\n\nHmm horizontal in vertical out. What if the gamma out is how a galaxy changes its orientation? Makes sense it's escaping using the path of least resistance.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iabm5n6",
                                                    "author": "MinimalGravitas",
                                                    "score": 7,
                                                    "created_utc": 1653751902.0,
                                                    "response": "> That's my argument. All that energy is created in a star.\n\nCool, I think we agree then, but the OP is technically incorrect just because they say the sun rather than stars in general!\n\n\n> Well except maybe hydrogen\n\nAlmost all Hydrogen, most Helium and a bit of Lithium were created in the hot, dense moments after the big bang. I did postgrad work on the difference in lithium ratios in long lived brown dwarfs as compared to expected values from the initial interstellar medium.\n\nYou're right about a little bit of EM radiation being emitted from black holes slowly losing mass (Hawking radiation - not something I understand very well) but I don't think that is a source of hydrogen. They really die like other stars but rather just shrink away as the Lorenz force converts them into energy.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iabmkru",
                                                            "author": "Praxxtice",
                                                            "score": 0,
                                                            "created_utc": 1653752100.0,
                                                            "response": "So if light doesn't leave and F = intg(fx:fn) what is the first element you think forms?",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "iabo85r",
                                                                    "author": "MinimalGravitas",
                                                                    "score": 3,
                                                                    "created_utc": 1653752871.0,
                                                                    "response": "I don't really understand the first premise of the question. I thought that a little light (well lower frequency EM radiation I suppose) *does* leave?",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "iabp1r0",
                                                                            "author": "Praxxtice",
                                                                            "score": 1,
                                                                            "created_utc": 1653753251.0,
                                                                            "response": "I'm sorry I should have stated visible light. I'm suggesting light integrates into hydrogen in a black hole. F= intg(fx:fn)",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "iabpzru",
                                                                                    "author": "MinimalGravitas",
                                                                                    "score": 2,
                                                                                    "created_utc": 1653753694.0,
                                                                                    "response": "Well with the caveat that this absolutely isn't my area of expertise, I'm not sure that visible light escapes, and if it does I don't know that it converts back into matter. Black holes are complicated.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "iacw15x",
                                                                                            "author": "ColdFusion3456",
                                                                                            "score": 1,
                                                                                            "created_utc": 1653773710.0,
                                                                                            "response": "Look...fuck the police.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "iabn2f6",
                                                    "author": "3DprintRC",
                                                    "score": 1,
                                                    "created_utc": 1653752328.0,
                                                    "response": "Other stars/supernovas is not part of the single energy source (the sun).",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "iabxp93",
                                            "author": "Gamma-512",
                                            "score": 0,
                                            "created_utc": 1653757291.0,
                                            "response": "Micro nova google it.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iac1pup",
                                                    "author": "MinimalGravitas",
                                                    "score": 1,
                                                    "created_utc": 1653759179.0,
                                                    "response": "Don't they predominantly just produce Helium like a normal nova? I haven't read the latest Nature article from last month, but you have reminded me that I was going to!",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "iaeq51w",
                                    "author": "Simple_List_3092",
                                    "score": 2,
                                    "created_utc": 1653815592.0,
                                    "response": "Do you think radioactive material in the earth came out of the sun?\n\nLike the sun made earth from lost material?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iaf3ris",
                                            "author": "Praxxtice",
                                            "score": 1,
                                            "created_utc": 1653826782.0,
                                            "response": "This is my response to a different question that should answer your question as well.\n\nThis can also be looked at like a rocket launching a satalite.\n\n\"Hmm what if the last star center was between \"Earth and Venus\" at it's closest orbit?\n\nMass of Mars  ~ 6.4 * 10²³\n\nMass of Earth ~ 6 * 10²⁴\n\n~ ¡Twinsies! ~ \n\nMass of Venus ~ 5 * 10²⁴\n\nMass of Mercery ~ 3.3 * 10²³\n\nLooks like Earth is REALLY SPECIAL \n\nPasses Newton's 1st law) things are still in motion.\n\nPasses Newton's 2nd law) \n\nF= MA = AM = F\n\nPasses Newton's 3rd law) Every action has an equal and opposite reaction.\n\nIf you observe a nuclear blast you'll notice the force always travels in the path of least resistance(more up vs out vs down). The \"Sun\" was the path of the most resistance. The Gas giants were the path of least resistance. \n\nThe mass distribution appears to follow same thought process if you look at Jupiter as the largest most outer blast area, and pluto being the tip.\"\n\nTo expand on this it makes sense as to why everything is in a simular plane if the fusion occurs with the force comming from the z axus with the least path of resistance being the x axis. This is the path of least resistance because of gravity pulling from other stellar bodies. \n\nThis appears to be replicated on a larger scale if you look at black holes. Where the energy and mass are comming from the x-axis the path of least resistance is the y or z-axis. This would also explain the gaps in spiral galaxies where there is a mass collision on the y or z-axis.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iag2n46",
                                                    "author": "Praxxtice",
                                                    "score": 1,
                                                    "created_utc": 1653843786.0,
                                                    "response": "On another note if every action has an equal and opposite reaction is indeed 100% true there is guaranteed life on the exact opposite side of the galaxy or the oppositesideof the universe if the same requirements aren't met on the other side of the universe. This same concept is argued in quantum physics as  quantum entanglement. If applied on a Galactic scale I'd like to call this Galactic Equilibrium, or a universal scale Universal Equilibrium.\n\nThis would be the first thought experiment that could potentially confirm the existence of a multiverse.\n\nF = MA = AM = F\n\nThe only place this could break down is life changing something by choice, and even that might follow the same path unintentionally. So maybe we can see 100,000 years in the past if we look hard enough.\n\nIf this is true and if society survives another 100,000 years your probably already being observed by other humans. Well in 100,000 years anyways. Because the other me would have just typed this on the other side of the galaxy.\n\nAnother great place to look would be at the same distance from the center of the galaxy at different angles. Probably starting at a 90°/270°, then 45°, 135°, 22.5°, 67.5°, 112.5°, 157.5° ect. for the highest potential likeness.\n\nØ Fīnn",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "iabxmxj",
                                    "author": "Gamma-512",
                                    "score": 1,
                                    "created_utc": 1653757262.0,
                                    "response": "I agree.  We’d be a ball of lifeless ice without the Sun",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iagjuku",
                                            "author": "Lerifod",
                                            "score": 1,
                                            "created_utc": 1653851736.0,
                                            "response": "It would be a very scary place and I believe that we should do everything to prevent what Earth is all about.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "iacq3se",
                            "author": "Competitive_Cry2091",
                            "score": 2,
                            "created_utc": 1653770867.0,
                            "response": "To stress: geothermal energy (as well as the energy needed to initialize the processes of the sun itself are gravity driven. So, if any, the weakest of them forces, gravity, is the backing of earth’s energy sources.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iacv06k",
                            "author": "n-Ro",
                            "score": 0,
                            "created_utc": 1653773238.0,
                            "response": "Geothermal energy is a derivative of the sun.\nNuclear energy is the molecular reconstruction of the sun's nuclear process.\nTidal energy is indirectly powered by the sun's gravitational field. (The sun keeps the moon in check)\n\nSooo......it's all pretty true.\n\nYou can cite wind energy if you want. Wind is caused by different temperatures in a system, higher temps causd directly by the sun.\n\nEverything and everyone at some point came as the result of a star exploding. Everything past hydrogen and helium on the periodic table of elements is a derivative of those two elements.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iaddn81",
                                    "author": "johnfintech",
                                    "score": 2,
                                    "created_utc": 1653782478.0,
                                    "response": "Confusion between fission and fusion. Two body systems exist (no strict need for a third body). Wind is caused by pressure difference (which isn't necessarily caused by just temperature difference). OP may have a point from an artistic point of view. Not from a scientific point of view.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iadfayk",
                                            "author": "n-Ro",
                                            "score": 1,
                                            "created_utc": 1653783372.0,
                                            "response": "Good call. I've gotten them mixed up before. We could go beyond the molecules into the quarks and shit too.\n\nWhat I love is the iron magnetic core along the Earth's north and south pole. Simply because the iron molecules are aligned...we get this property of magnetism and a magnetic field around the planet that redirects the highest energy light waves coming from the Sun. Without the magnetic core, our planet would burn wouldn't it?\n\nThe iron in the magnetic core comes from a previous star exploding. So in a way, the sun created this protection mechanism to shield life from the destruction of the creator, the creation being another form of itself (a derivative/fractal). You could draw analogies to God/Jesus, Horus/Osiris (just from a story point of view). Amazing!",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iadwxcx",
                                                    "author": "johnfintech",
                                                    "score": 0,
                                                    "created_utc": 1653793292.0,
                                                    "response": "No offense, but why do you insist on talking about things you clearly don't understand very well but as if you did?\n\n>we get this property of magnetism and a magnetic field around the planet that redirects the highest energy light waves coming from the Sun\n\nEarth's magnetic field \"protects\" (to an extent) against solar wind, which are charged particles (the kind that have mass), and not \"highest energy light waves\" (not sure you know what that means). The ozone layer \"protects\" (to an extent) against some high frequency EM waves, e.g. UV radiation.\n\n>So in a way, the sun created this protection mechanism\n\nNo, the sun didn't do that.\n\n>the creation being another form of itself (a derivative/fractal)\n\nA fractal is not a derivative. \"Another form of itself\" is not a fractal.\n\n>We could go beyond the molecules into the quarks and shit too\n\nLet's not.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iadxxto",
                                                            "author": "n-Ro",
                                                            "score": 1,
                                                            "created_utc": 1653793892.0,
                                                            "response": "Okay man damn, never said I was an expert. So feisty. I was just excited about it",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "iabg7ch",
                            "author": "Sealobo",
                            "score": -4,
                            "created_utc": 1653749088.0,
                            "response": "The Earth orbiting around the sun allowed all of the above to exist / come to existence. No?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iabiifk",
                                    "author": "senfmeister",
                                    "score": 4,
                                    "created_utc": 1653750204.0,
                                    "response": "Uranium was created in supernovae and neutron star mergers before the sun existed.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iabxt3y",
                                            "author": "Gamma-512",
                                            "score": 1,
                                            "created_utc": 1653757341.0,
                                            "response": "Also micro novae",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "iabgt65",
                                    "author": "varikonniemi",
                                    "score": 4,
                                    "created_utc": 1653749382.0,
                                    "response": "we could transport earth away from the sun and still have them, so no. They are native to our planet, not the sun. So we are not completely powered by the sun.\n\nUnless you subscribe to electric universe theory",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "iacnb99",
                                    "author": "AskALettuce",
                                    "score": 1,
                                    "created_utc": 1653769582.0,
                                    "response": "No",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "iabyg82",
                            "author": "theproblemofevil666",
                            "score": 1,
                            "created_utc": 1653757640.0,
                            "response": "Nuclear energy is exactly what powers the sun...",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iadiovy",
                                    "author": "hatsuseno",
                                    "score": 1,
                                    "created_utc": 1653785232.0,
                                    "response": "You're confusing fission and fusion. And even if they were the same process, that still doesn't mean the sun provides said power to the earth, if you move the earth away from the sun those processes don't suddenly stop or something.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "iacpiq4",
                            "author": "Ground_Lazy",
                            "score": 1,
                            "created_utc": 1653770580.0,
                            "response": "Well if there was no sun , there wouldn't be any geothermal energy",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iadifmj",
                                    "author": "hatsuseno",
                                    "score": 1,
                                    "created_utc": 1653785089.0,
                                    "response": "Incorrect, the Sun has no bearing on the geothermal output of the earth, that's mostly driven from remaining heat from the formation of the planet and nuclear fission reasons happening in the core.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iadu5g2",
                                            "author": "Ground_Lazy",
                                            "score": 1,
                                            "created_utc": 1653791672.0,
                                            "response": "How do you think the earth is able to produce geo thermal energy. It's because of the sun obviously. The sun was there from the start. It's obvious it can retain energy after being powered already. Plus all the miners and the industries that produce heat . If there was no sun , the earth would end up cold at a bigger time scale",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iaduf5w",
                                                    "author": "hatsuseno",
                                                    "score": 1,
                                                    "created_utc": 1653791823.0,
                                                    "response": "I already told you how I think it does, and the sun still isn't part of that explanation.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iae9p93",
                                                            "author": "Ground_Lazy",
                                                            "score": 1,
                                                            "created_utc": 1653801653.0,
                                                            "response": "Well the sun isn't a part of the solar system according to your statements. So it's probably true. We must be living in a dream . Right ?",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "iaddwue",
                            "author": "Expired_Lizard_Milk",
                            "score": 1,
                            "created_utc": 1653782623.0,
                            "response": "But doesn't tidal energy require the sun otherwise all the oceans would just freeze solid?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iadi3ve",
                                    "author": "hatsuseno",
                                    "score": 1,
                                    "created_utc": 1653784907.0,
                                    "response": "Yes, but that does not make tidal forces outright disappear. The moon will still be tugging at the earth, even if we don't have a means to use that energy (as easily) as we do using oceans of liquid water.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "iadsu0o",
                            "author": "Trenchapo",
                            "score": 1,
                            "created_utc": 1653790916.0,
                            "response": "And Windmills are not powered by the sun they are powered by wind !!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iabsp7g",
                    "author": "Fine-Artichoke-7485",
                    "score": 3,
                    "created_utc": 1653754959.0,
                    "response": "❤️  Sun ☀️🌞☀️",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iacfq6o",
                    "author": "Linkaiser",
                    "score": 2,
                    "created_utc": 1653765908.0,
                    "response": "Well I see your point, however, we all die if we no longer have the sun, life goes on if we no longer have bitcoin.  \n\n\nHonestly I think a lot of people just have completely delusional daydreaming ideas about Bitcoin.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iabtet2",
                    "author": "wood8",
                    "score": 1,
                    "created_utc": 1653755295.0,
                    "response": "That's why men need to work in order to get something is such a bullshit. Human never work, we only move products the sun made to the place we need. Fruits, vegitables, coal, oil... all made by the sun. Self learning robot powered by the sun will replace human worker, and money will be a stupid concept, we want something we just ask.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iad3ycu",
                    "author": "noyrb1",
                    "score": 1,
                    "created_utc": 1653777445.0,
                    "response": "Amen",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iad40yg",
                    "author": "CryptoBehemoth",
                    "score": 1,
                    "created_utc": 1653777480.0,
                    "response": "You should read George Bataille.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iad4fr2",
                    "author": "ferfc",
                    "score": 1,
                    "created_utc": 1653777683.0,
                    "response": "Saylor is that you?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iad51t0",
                    "author": "Bp820",
                    "score": 1,
                    "created_utc": 1653777987.0,
                    "response": "While you get blown up by the son worshipers I get what your saying, bitcoin is a value stored from power being spent, some people say oh it doesnt have anything backing it up like the dollar used to be with gold, spent power is a thing, especially when it becomes so much that it takes up a fraction of a percent in the global usage from people mining them. It's a value kept, and one way it is kept by the amount of power that was neccessary to achieve it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iad688w",
                    "author": "Arde1001",
                    "score": 1,
                    "created_utc": 1653778583.0,
                    "response": "Praise the sun!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iad6x3a",
                    "author": "dfunkmedia",
                    "score": 1,
                    "created_utc": 1653778925.0,
                    "response": "IF ONLY I COULD BE SO GLORIOUSLY INCANDESCENT",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iae9mnv",
                            "author": "Starkrall",
                            "score": 1,
                            "created_utc": 1653801602.0,
                            "response": "Please help me what is this from?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iaehs7u",
                                    "author": "dfunkmedia",
                                    "score": 1,
                                    "created_utc": 1653808125.0,
                                    "response": "Solaire, a knight from Dark Souls. He says this when you find him at the top of the castle staring at the sun.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iaf5ae0",
                                            "author": "Starkrall",
                                            "score": 1,
                                            "created_utc": 1653827757.0,
                                            "response": "Ah yes of course, thanks!",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iae1s2e",
                    "author": "Malecite",
                    "score": 1,
                    "created_utc": 1653796288.0,
                    "response": "I read the explanation of the title and laughed so hard the water I was drinking is pouring out my nose.\n\nGod I love this sub, the laughs are endless.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaftktv",
                    "author": "dolfcao",
                    "score": 1,
                    "created_utc": 1653839766.0,
                    "response": "That's right and that's why we should start using it as a renewable energy for Bitcoin mining.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iabkp0h",
                    "author": "Independent-Snow-129",
                    "score": 0,
                    "created_utc": 1653751216.0,
                    "response": "Here's a question , what is the difference between an electricity spark and a spark ?\n\nWhat if we could create our own mini-sun , wouldn't this be pretty neat  ?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iabp2ru",
                            "author": "MinimalGravitas",
                            "score": 2,
                            "created_utc": 1653753265.0,
                            "response": "> if we could create our own mini-sun , wouldn't this be pretty neat  ?\n\nThat's what a hydrogen bomb is, in a star the expansive force caused by the energy release is countered by the gravitational pressure of the huge amount of mass. This is called hydrostatic equilibrium. When a nuke explodes there isn't the counter balance to the energy released and so it explodes outwards in a process that is probably better described as messy rather than 'neat'!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iabrtoo",
                                    "author": "Independent-Snow-129",
                                    "score": 1,
                                    "created_utc": 1653754549.0,
                                    "response": "Great comment, I will look it up!\n\nI don't know anything about bomb, I'm more the futurama type ! It would be pretty neat to create something else than a hydrogen bomb with all these mathematics , **wouldn't it ?**\n\n***Or*** could the sun be at **two (*****or more*****) different place at the same time**, maybe on different scale but with similar properties  ? ( *edited* \\---> It would obviously be **3** (or more)\n\n***Or*** Could the second \"mini-sun\" be weightless having different properties but still usable(Similar to a reflection) ?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iabuxk1",
                                            "author": "MinimalGravitas",
                                            "score": 1,
                                            "created_utc": 1653756008.0,
                                            "response": "> It would be pretty neat to create something else than a hydrogen bomb with all these mathematics , **wouldn't it ?**\n\nAbsolutely. There is ongoing research into controlled fusion going on, but so far it always takes more energy to perform than is released. Partly because there's not really a known substitute for the containing force of gravity. Lots of experiments use high energy electromagnetic fields to keep the 'explosion' contained, but that only stops charged particles, meaning you have limited options of what reactions can be utilized, and obviously it takes a lot of electricity to generate the magnetic fields needed to contain what is effectively an H-bomb explosion!\n\nAs for weightless suns etc, it's fun to speculate on things like that, but very hard to work though how anything might work if it's not running on the physics we currently understand.\n\nThere has been fairly legitimate research done on time travel, wormholes and 'warp drives' though, so it would be foolish to completely write-off ideas just because no one has published work on them yet.\n\nIf you're interested in the more sci-fi-but-not-ridiculous side of things I really recommend the website Atomic Rockets which has a section on fusion rockets [http://www.projectrho.com/public_html/rocket/fusionfuel.php] as well as loads of other fun, related topics. Don't let the 1990's design fool you into thinking it lacks legitimacy!",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iaby9vh",
                                                    "author": "Independent-Snow-129",
                                                    "score": 1,
                                                    "created_utc": 1653757557.0,
                                                    "response": "**When you look in a mirror, don't you see yourself ?**\n\nWhat If the sun reflected with the help of spacial gold reflectors bouncing electromagnetic wave like nodes making it a decentralized source of solar energy 24/7 around the globe ?\n\n**Where's the gravity sir ?**  The earth gravity would actually help the whole process wouldn't it ? *Edited*: It gives it a *blue* boost in magnetic acceleration .  \n\n&#x200B;\n\nThanks for your great comment , your php file isn't secure, but I love that stuff ! (Don't click on it fellow bitcoiners without a trusty environment, *or verify!)*\n\n*Edited*: What about the **moon**!!! Alright , alright, alright, I'll stop...",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iac1zyk",
                                                            "author": "MinimalGravitas",
                                                            "score": 2,
                                                            "created_utc": 1653759311.0,
                                                            "response": "Oh, sorry for the dodgy looking link. You can find the site just by searching for 'Atomic Rockets', and are absolutely right not to trust anyone's links!",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "iac3kbv",
                                                                    "author": "Independent-Snow-129",
                                                                    "score": 1,
                                                                    "created_utc": 1653760060.0,
                                                                    "response": "*Only theorizing - Or* trust everyone link who target you, and learn on them?  ( I wouldn't do this , but it is potentially quite logical too) . \"Wolf in sheep's clothing\" **strategy** ?",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "iae9xi4",
                                            "author": "Starkrall",
                                            "score": 1,
                                            "created_utc": 1653801824.0,
                                            "response": "It *would have* been mutually beneficial for the whole planet. It sort of is today, but stigma surrounding anything remotely nuclear will make sure we never have global clean energy, at least from that source.  All thanks to humankind's proclivity to self destructive territorialism.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "iaeqn6g",
                                    "author": "Simple_List_3092",
                                    "score": 1,
                                    "created_utc": 1653816041.0,
                                    "response": "That's misleading.\n\nThe sun produces energy/heat at the rate of a landfill, with fusion instead of biochemical breakdown.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "iabu8r2",
                            "author": "Careless_Author_5881",
                            "score": 2,
                            "created_utc": 1653755686.0,
                            "response": "Spider-Man is gonna kick your ass",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iabywvb",
                                    "author": "Independent-Snow-129",
                                    "score": 1,
                                    "created_utc": 1653757857.0,
                                    "response": "Dragonfly's don't care, when one *die* , 1000 appears  !  \n\n*\" Tik-tok, next block ! \"*",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "id": "uzokrc",
            "title": "Best Bitcoin podcast to recommend to a curious mind?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uzokrc/best_bitcoin_podcast_to_recommend_to_a_curious/",
            "author": "ys2020",
            "created_utc": 1653748470.0,
            "score": 12,
            "num_comments": 56,
            "subreddit": "Bitcoin",
            "selftext": "Hey guys!  \n\n\nJust a quick one: any recommendations on a good btc podcast material? Something I could recommend to a newcoiner that's genuinely interested? Not super techy but with clear explanation of fundamentals?  \nI personally prefer MS so may be a good one with him?  \nThanks!\n\n*Thank you for absolutely killer suggestions! :)\nAnd for the award!*",
            "stickied": false,
            "comments": [
                {
                    "id": "iabfg5y",
                    "author": "Mallardshead",
                    "score": 21,
                    "created_utc": 1653748721.0,
                    "response": "Go with *What Bitcoin Did.* Many of those past episodes are relevant and easily digestible\n\nCheck out *Andreas Antonpolous* YouTube and Twitter. He's a phenomenal teacher.\n\nWhen you get enough knowledge, check out *Stephan Livera's* podcast which is definitely the most technical.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iac2izr",
                            "author": "FreakyPriest",
                            "score": 2,
                            "created_utc": 1653759565.0,
                            "response": "What happened to \"Speaking of Bitcoin“? I really liked it and there hasn't been a new episode in quite a while.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iacemj8",
                                    "author": "Daprosy",
                                    "score": 2,
                                    "created_utc": 1653765393.0,
                                    "response": "https://podcasts.google.com/feed/aHR0cHM6Ly93d3cuc3ByZWFrZXIuY29tL3Nob3cvMzQ3ODM4NS9lcGlzb2Rlcy9mZWVk?ep=14\nThe bitcoin standard podcast I think took over. Could be remembering wrong.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iacw2um",
                                            "author": "FreakyPriest",
                                            "score": 2,
                                            "created_utc": 1653773730.0,
                                            "response": "No, it's a totally different podcast. I just found out that Speaking of Bitcoin moved to Apple podcast. It's no longer on Google Podcast and YouTube. This sucks a lot.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iaeidje",
                                                    "author": "Jacobgraham1738",
                                                    "score": 1,
                                                    "created_utc": 1653808642.0,
                                                    "response": "No way I've been waiting for a new episode to. How could they do this to us? Not very decentralized of them.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iaellwe",
                                                            "author": "FreakyPriest",
                                                            "score": 1,
                                                            "created_utc": 1653811495.0,
                                                            "response": "Exactly. I just found out that the new episodes are also on Spotify.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "iacnzty",
                            "author": "ys2020",
                            "score": 2,
                            "created_utc": 1653769884.0,
                            "response": "great, thank you. Andreas is good, yeah",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iagkviy",
                            "author": "cpt_charisma",
                            "score": 2,
                            "created_utc": 1653852214.0,
                            "response": "I'll second What Bitcoin Did.  Just make sure your newcoiner can handle listening to people he may disagree with.  They have a very wide variety of guests with radically differing viewpoints on a wide range of topics.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iajenuv",
                                    "author": "ys2020",
                                    "score": 1,
                                    "created_utc": 1653914672.0,
                                    "response": "understood, thanks",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "iach7tp",
                            "author": "dancrypted",
                            "score": 1,
                            "created_utc": 1653766596.0,
                            "response": "This.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iabj5d7",
                    "author": "cooldave88",
                    "score": 10,
                    "created_utc": 1653750504.0,
                    "response": "What is Money by Robert Breedlove. Start with the 17 part Saylor series.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iac6ji1",
                            "author": "ABCRYPTO33",
                            "score": 1,
                            "created_utc": 1653761492.0,
                            "response": "#Seconded!!!!!",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iaclvv3",
                            "author": "meadowpoe",
                            "score": 1,
                            "created_utc": 1653768900.0,
                            "response": "This guy is a terrible scammer.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iaco3q6",
                            "author": "ys2020",
                            "score": 1,
                            "created_utc": 1653769932.0,
                            "response": "cool thanks, I'll check it out",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iact6hk",
                            "author": "Cozmikk",
                            "score": 1,
                            "created_utc": 1653772356.0,
                            "response": "Is this on his website?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iacxdqd",
                                    "author": "cooldave88",
                                    "score": 1,
                                    "created_utc": 1653774304.0,
                                    "response": "On YouTube. It’s not hard to find.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iadu8m9",
                                            "author": "Cozmikk",
                                            "score": 1,
                                            "created_utc": 1653791723.0,
                                            "response": "Just his podcast episodes? I was sorta confused when googling it",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iadvaqw",
                                                    "author": "cooldave88",
                                                    "score": 1,
                                                    "created_utc": 1653792334.0,
                                                    "response": "Search What is Money? on YouTube",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iacd0tz",
                    "author": "patchmoeney",
                    "score": 9,
                    "created_utc": 1653764638.0,
                    "response": "I've got a list:\n\nVijay boyapati:\nBitcoin Audible ep 407 \nBullish Case for Bitcoin \n\nWhat Bitcoin Did ep 300 \nUltimate Bitcoin 101 \n\nWe Study Billionaires btc ep 002\nCase for Bitcoin \n\nStephan Livera Podcast ep 185 \nWhat Bitcoin Is \n\n\nDerGigi:\nBitcoin Audible ep 256, 257, 258\n21 Lessons of the Bitcoin Rabbit Hole \n\nBitcoin Audible ep 389 \nDear Family, Dear Friends \n\nBitcoin Audible ep 503 \nBitcoin is Time \n\nBitcoin Audible ep 537 \nBitcoin is an Idea\n\n\nAlex Gladstein\nWhat Bitcoin Did ep 056\nWhy Bitcoin Matters for Freedom \n\nBitcoin Rapid-fire Podcast\nBitcoin is Freedom Money \n\nWe Study Billionaires btc ep 023 \nBitcoin's International Impact \n\n\nBrandon Quittem\nWhat is Money Podcast ep 161 \nBitcoin is a Pioneer Species \n\nBitcoin Audible Chat #67 \nPioneer Species \n\n\nNik Bhatia\nLayered Money (book. Audiobook available on Audible) \n\nWe Study Billionaires btc ep 010 \nBitcoin and Layered Money \n\n\nTomer Strolight\nBitcoin Audible ep 558 \nWhy Bitcoin \n\n\nJack Mallers\nWe Study Billionaires ep 007 \nBitcoin Disrupting Payment Clearing Houses\n\nThat should keep anyone busy!\n\nAlso for some more advanced discussion: \nCafe Bitcoin on Twitter Spaces. They're live Monday to friday 10am EST. Released as Cafe Bitcoin Podcast afterwards (on Spotify and such). Some of the best news, current events, interviews and discussions about bitcoin. \n\nSwan Signal Live. Similar thing. Live on youtube then released as podcast.\n\nBoth are hosted by Swan Bitcoin.\n\nBitcoin Magazine Podcast has some great content as well.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iachwgx",
                            "author": "Lyt_Diamond_Hands",
                            "score": 3,
                            "created_utc": 1653766929.0,
                            "response": "Nice work my friend!",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iacihk7",
                            "author": "ys2020",
                            "score": 2,
                            "created_utc": 1653767216.0,
                            "response": "\n\noh wow thanks!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iabg509",
                    "author": "ESG_girl",
                    "score": 9,
                    "created_utc": 1653749056.0,
                    "response": "Beginner: What Bitcoin Did\n\nIntermediate: Stephan Livera Podcast\n\nAdvanced: Rabbit Hole Recap",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iachsrq",
                            "author": "Lyt_Diamond_Hands",
                            "score": 3,
                            "created_utc": 1653766879.0,
                            "response": "Agree with beginner and advanced - love them both.  Not experienced with Livera but will have to check it out.  \n\nI would add “What Bitcoin Did” is must listen to material.  Very wide spectrum as it relates to BTC.  I also recommend “The Bitcoin Standard” podcast although in my opinion some guests are far superior to others.  \n\nFinally any podcast with Michael Saylor is must hear.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iajeppm",
                                    "author": "ys2020",
                                    "score": 1,
                                    "created_utc": 1653914703.0,
                                    "response": "perfect, thanks",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "iabnm9z",
                            "author": "Mallardshead",
                            "score": 4,
                            "created_utc": 1653752585.0,
                            "response": "I concur",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iabplvb",
                                    "author": "5liveR",
                                    "score": 3,
                                    "created_utc": 1653753514.0,
                                    "response": "Advanced II: Bitcoin Audible\n\nAdvanced III: Citadel Dispatch",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "iaco4hz",
                            "author": "ys2020",
                            "score": 1,
                            "created_utc": 1653769942.0,
                            "response": "awesome thank you",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iabfplz",
                    "author": "NiceDoctorBeam",
                    "score": 4,
                    "created_utc": 1653748849.0,
                    "response": "Intro: The Trust Machine (22 min):\nhttps://www.youtube.com/watch?v=ZKwqNgG-Sv4\n\nSaylor Explains:\nhttps://www.reddit.com/r/Bitcoin/comments/s54g8x/send_this_to_your_contacts_interested_in_bitcoin/\n\nRead: \"The Bitcoin Standard,\" by S. Ammous\n\n\nNick:\nhttps://youtu.be/ic1ITcwnozY?t=858",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaco5tk",
                            "author": "ys2020",
                            "score": 2,
                            "created_utc": 1653769959.0,
                            "response": "good stuff ty",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iabg717",
                    "author": "denimsquared",
                    "score": 4,
                    "created_utc": 1653749084.0,
                    "response": "Bitcoin Audible is my personal favorite.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaco6mi",
                            "author": "ys2020",
                            "score": 1,
                            "created_utc": 1653769970.0,
                            "response": "will check it out",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iabh8s4",
                    "author": "Charming-Meringue-68",
                    "score": 3,
                    "created_utc": 1653749588.0,
                    "response": "Those listed above + We Study Billionaires (Wed. show is on BTC) + whatever shows Michael Saylor is on",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iabwvez",
                    "author": "RewtDooDoo",
                    "score": 3,
                    "created_utc": 1653756909.0,
                    "response": "Jeff Booth, Greg Foss but that could be my Canadian bias. Jeff Booth is much more philosophical, while Foss is an ex hedge fund trader who focuses on risk-analysis.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iajer0k",
                            "author": "ys2020",
                            "score": 1,
                            "created_utc": 1653914724.0,
                            "response": "I love Jeff Booth, thank you",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iadyah2",
                    "author": "ShibaBoner",
                    "score": 3,
                    "created_utc": 1653794105.0,
                    "response": "CryptosRUs- hosted by Gorge  all news related to crypto and bitcoin,  on YouTube and on Twitter",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iajev83",
                            "author": "ys2020",
                            "score": 1,
                            "created_utc": 1653914791.0,
                            "response": "will check it out, thank you",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iabvqxt",
                    "author": "Cheap_Meaning",
                    "score": 2,
                    "created_utc": 1653756391.0,
                    "response": "I still think the Tucker Carlson Michael Saylor 1 hr interview is good for beginners.   Saylor does an awesome job describing the problem with fiat and how Bitcoin is the solution.   It's not techy just explains why you need it.   \n\nLex Friedman with Breedlove is 4hrs.    That's a good one.  The Saylor one with Friedman is also great.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iabxffi",
                    "author": "SpecialistRough3962",
                    "score": 2,
                    "created_utc": 1653757167.0,
                    "response": "Joe rogan has 3 podcasts with Andreas M. Antonopoulos.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaco80v",
                            "author": "ys2020",
                            "score": 1,
                            "created_utc": 1653769988.0,
                            "response": "right on!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iac99ro",
                    "author": "NiceDoctorBeam",
                    "score": 2,
                    "created_utc": 1653762819.0,
                    "response": "The Daily Bitcoin News:  \n\nhttps://www.youtube.com/watch?v=wPZzqwZpt94",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iajertv",
                            "author": "ys2020",
                            "score": 1,
                            "created_utc": 1653914737.0,
                            "response": "cool, thanks!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iacmfzm",
                    "author": "deepoak40965",
                    "score": 2,
                    "created_utc": 1653769181.0,
                    "response": "What Bitcoin Did:  with guest Darin Feinstein.  Really great episode that made me want to smash buy hard.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iacoaac",
                            "author": "ys2020",
                            "score": 2,
                            "created_utc": 1653770016.0,
                            "response": "gotta check it out, thank you",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iaczkmt",
                                    "author": "deepoak40965",
                                    "score": 2,
                                    "created_utc": 1653775314.0,
                                    "response": "You will be glad you did.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iacy0gc",
                    "author": "sescobreezy727",
                    "score": 2,
                    "created_utc": 1653774584.0,
                    "response": "Fedwatch",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iajeswu",
                            "author": "ys2020",
                            "score": 1,
                            "created_utc": 1653914755.0,
                            "response": ">Fedwatch\n\nhaha good one",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iadevc3",
                    "author": "Suitable_Sport_2490",
                    "score": 2,
                    "created_utc": 1653783140.0,
                    "response": "Amazing recommendations in here. Make sure you listen to Jeff booth.  There are a lot of interviews with him on YouTube and he might be my favorite person in the space.  At first you think he’s going to be boring but he’s so Informative in the best way. \n\nAlso jack mallers is the goat",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iajeuaa",
                            "author": "ys2020",
                            "score": 1,
                            "created_utc": 1653914776.0,
                            "response": "yeah, he's great, thank you",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iadhtg9",
                    "author": "virtuzoso",
                    "score": 2,
                    "created_utc": 1653784747.0,
                    "response": "What Bitcoin did is my vote, especially the ones about \"what is money\" type of guests,like Robert Breed love, Nik Batia, Jeff Booth",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaekt2g",
                    "author": "Jacobgraham1738",
                    "score": 2,
                    "created_utc": 1653810780.0,
                    "response": "Haven't seen anyone mention tales from the crypt yet",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iabwzwp",
                    "author": "The_Magic_Bean",
                    "score": 2,
                    "created_utc": 1653756966.0,
                    "response": "The coinbureau podcast?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iacj67i",
                            "author": "Verallendingen",
                            "score": 1,
                            "created_utc": 1653767555.0,
                            "response": "is that a shitcoiner podcast?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iadjeka",
                                    "author": "Lagavulin",
                                    "score": 1,
                                    "created_utc": 1653785626.0,
                                    "response": "totally shitcoin but also very good when not shitcoining.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iabyglu",
                    "author": "SecretBuffaloSound",
                    "score": 1,
                    "created_utc": 1653757644.0,
                    "response": "The Coin Bureau podcast is heaps good",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iajewe8",
                            "author": "ys2020",
                            "score": 1,
                            "created_utc": 1653914811.0,
                            "response": "nice, will check them out",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}