{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "v18q2y",
            "title": "Mona Lisa, Cake & Bitcoin.",
            "url": "https://simplyhodl.com/uncategorized/mona-lisa-cake-bitcoin/",
            "author": "Greedy_Box_9356",
            "created_utc": 1653941454.0,
            "score": 1,
            "num_comments": 2,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "ial0g7s",
                    "author": "peaceduk",
                    "score": 1,
                    "created_utc": 1653941872.0,
                    "response": "btc scam",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ial5hzo",
                            "author": "Greedy_Box_9356",
                            "score": 1,
                            "created_utc": 1653944264.0,
                            "response": "no",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "v18tbx",
            "title": "People often use Gold's market cap as a benchmark for their Bitcoin price targets. How much of Gold's market cap is from its use purely as a monetary asset?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/v18tbx/people_often_use_golds_market_cap_as_a_benchmark/",
            "author": "LuDortian007",
            "created_utc": 1653941705.0,
            "score": 4,
            "num_comments": 24,
            "subreddit": "Bitcoin",
            "selftext": "It seems to me that the most common benchmark used in predicting Bitcoin's future price is having it equal to Gold's market cap, which currently sits at around [$12 trillion](https://8marketcap.com/). Bitcoin would equal this market cap at a price of $571,428 (assuming full dilution and that no coins are lost, which obviously isn't the case but not important for now). \n\nGold isn't solely a monetary asset though. It has value as an industrial metal, used in semiconductors, dentistry, etc, and as a decorative asset (jewelry, antiques, etc). \n\nAre there any reputable studies or estimates out there that break down the market cap of gold as influenced by each of these three categories? My sense is that gold as a monetary asset would constitute the majority of its market cap value, if not the plurality of it, and would love to see some actual estimates. Hard to find anything reputable online...",
            "stickied": false,
            "comments": [
                {
                    "id": "ial1bjw",
                    "author": "NiceDoctorBeam",
                    "score": 7,
                    "created_utc": 1653942285.0,
                    "response": "> How much of Gold's market cap is from its use purely as a monetary asset?  \n\nNearly all of it.  \n\nOtherwise, gold's price would be on par with aluminum and copper.  Gold is durable, divisible, recognizable, fungible, portable, and **scarce** and that is why it was once used as money.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ialo8nb",
                            "author": "Ok_Aerie3546",
                            "score": 1,
                            "created_utc": 1653953642.0,
                            "response": "This! About 90 percent is monetary use. You should also include jewelry and decorative gold in the monetary use as jewelry is not a higher order good.\n\nFor eg. You cant sell your old gold jewelry at a higher price than the gold inside it. But you can sell a steel frying pan at a higher price than the steel inside it.\n\nA monetary good is something that has the least number of higher order uses. Gold has about 10 percent, in semiconductors, lab equipment, aerospace, etc.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ialv47x",
                                    "author": "NiceDoctorBeam",
                                    "score": 1,
                                    "created_utc": 1653957211.0,
                                    "response": "Yes!\n\nThe whole *idea* of money is to use something with little or no intrinsic value as a general purpose, general public IOU.  In the case of Bitcoin, a public ledger but one where we don't have to trust anybody to maintain it fairly/honestly.\n\nI mean, few things have less intrinsic value than a ledger entry.  Bitcoin is great.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ialvp56",
                                            "author": "Ok_Aerie3546",
                                            "score": 1,
                                            "created_utc": 1653957508.0,
                                            "response": "Hahahahah. Whenever people say \"bitcoin has no intrinsic value\", I just say yes.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "ial31mp",
                            "author": "LuDortian007",
                            "score": 0,
                            "created_utc": 1653943097.0,
                            "response": ">Nearly all of it.\n\nI agree that is is likely the majority of the market cap. But, there are estimates that copper's market cap is in the trillions when looking specifically at total reserves (850 million tonnes at $10,000 per tonne) = $8.5 trillion. Total amount mined throughout history is estimated to be slightly lower but still close to this number. As for value consumed per year, that number is around $300 billion (30 million tonnes at $10,000 per tonne).\n\nThis is apples to oranges though, given Copper is FAR more abundant: only 250 thousand tonnes of Gold have been discovered to date, 80% of which has already been mined. You are spot on in that its more scarce but it is no longer used as a medium of exchange pretty much anywhere in the world, meaning that its value is no longer as a currency but rather as a scarce commodity.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ialo6is",
                                    "author": "Jon00266",
                                    "score": 1,
                                    "created_utc": 1653953612.0,
                                    "response": "Gold doesn't break down either right? So the gold used for things is infinitely reusable is it not? I don't actually know, not meaning to sound condescending",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ial1eiq",
                    "author": "Geoknysis",
                    "score": 2,
                    "created_utc": 1653942324.0,
                    "response": "About $9-6B is value-driven gold.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ial20yq",
                    "author": "TerribleD",
                    "score": 1,
                    "created_utc": 1653942620.0,
                    "response": "All gold has monetary \"value\" whether its in  jewelry or PC boards so I'm unclear what you mean by monetary asset. Perhaps you mean  gold coins in circulation being used as money (which would be a small number). Then you would want to compare that number with bitcoin in circulation being used as money and not sitting in wallets on exchanges or cold storage.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ial38vn",
                            "author": "LuDortian007",
                            "score": 4,
                            "created_utc": 1653943195.0,
                            "response": "To rephrase my question:\n\nIf Gold had no industrial or decorative value today, what would it’s market cap be?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ialqkzw",
                                    "author": "bobderbobs",
                                    "score": 1,
                                    "created_utc": 1653954870.0,
                                    "response": "If you have some gold jewelry you would sell it at the price of the gold in it. Therefore it doesn't matter for the price if it is some jewelry or a coin or whatever for the price. Therefore the jewelry aspect doesn't give gold any value (right now)",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ialrby3",
                                            "author": "LuDortian007",
                                            "score": 1,
                                            "created_utc": 1653955261.0,
                                            "response": "No because if people buy gold in it’s decorative form (or regardless of reason), they are adding to aggregate demand. Perhaps the craftsmanship doesn’t add value, but that’s irrelevant to my point: \n\nPeople demand gold for different reasons and things. ANY demand incrementally increases the price (and therefore the market cap) of gold",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "ialkzho",
                            "author": "Crawlero",
                            "score": 1,
                            "created_utc": 1653951954.0,
                            "response": "Banks hold gold as a reserve asset.  I believe that is what's being referred to",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ialu7tn",
                                    "author": "zachmoe",
                                    "score": 1,
                                    "created_utc": 1653956759.0,
                                    "response": "Which banks?\n\nI don't think banks even need reserves right now, but I'm fairly confident US retail banks almost exclusively use cash USD as the reserve asset in modernity, and by extensions foreign banks do as well as a consequence being that it is the world reserve currency.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ialvn9a",
                                            "author": "Crawlero",
                                            "score": 1,
                                            "created_utc": 1653957481.0,
                                            "response": "Many, most, certainly many central banks.  Canada owns many $billions in gold, many central and south american countries own several tons each, Russia is on the gold standard as of not too long ago, the US fed owns several thousand tons, Germany has a few thousand tons, the list goes on.\n\nhttps://www.canada.ca/en/department-finance/services/publications/monthly-official-international-reserves/2020/04.html\nhttps://www.statista.com/statistics/962195/gold-reserves-quantity-latin-america-country/\nhttps://www.newyorkfed.org/aboutthefed/goldvault.html\nhttps://tradingeconomics.com/germany/gold-reserves",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "ialvt3e",
                                            "author": "Crawlero",
                                            "score": 1,
                                            "created_utc": 1653957563.0,
                                            "response": "If you have time to dig I'm sure you'll find even many retail banks do as well, jpmorgan chase seems to.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "ial32un",
                            "author": "TerribleD",
                            "score": -2,
                            "created_utc": 1653943114.0,
                            "response": "And then Market Capacity simply refers to the total amount invested into any asset class. The BTC/Gold correlation is just a general observation of no real practical value. You could just as well try and measure the BTC/Bananas marketcap  ratio with perhaps even more meaning.\n\nI've always thought that the \"bitcoin is digital gold\" posit was a bad fiction. They are apples and oranges. They are both fruits  but you wouldn't want to try and make an orange pie.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iala3wb",
                                    "author": "ma0za",
                                    "score": 1,
                                    "created_utc": 1653946496.0,
                                    "response": "1. Its called market capitalization, not capacity\n\n2. It does not represent the Total amount invested in it. Market cap is current price x total supply.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ialax8a",
                    "author": "IgloosRcold",
                    "score": 1,
                    "created_utc": 1653946899.0,
                    "response": "I've always heard it was about 70/30. 70 as money,  30 as useful metal.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ialgt1x",
                    "author": "road22",
                    "score": 1,
                    "created_utc": 1653949832.0,
                    "response": "How do you price an asset when NOBODY actually knows how much is above ground and how much each person or country owns?\n\nWhen was the last time an Audit was done at Ft Knox?\n\nWhy does the USA even need to hold gold now that we are not backing USD with it.\n\nIf every gram of gold was traceable, verifiable, and attached to a wallet like BTC, I would not have sold my gold back in 2015 to by BTC.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ialv1h8",
                    "author": "senfmeister",
                    "score": 1,
                    "created_utc": 1653957174.0,
                    "response": "Aluminum used to be worth more than gold.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "v18t0y",
            "title": "Bitcoiner - There Can Be Only One",
            "url": "https://www.reddit.com/r/Bitcoin/comments/v18t0y/bitcoiner_there_can_be_only_one/",
            "author": "vvillehelm",
            "created_utc": 1653941683.0,
            "score": 3,
            "num_comments": 6,
            "subreddit": "Bitcoin",
            "selftext": "So, just for context, ***Highlander*** is a film from 1986 that chronicles the climax of an age-old war between [immortal](https://en.wikipedia.org/wiki/Immortal_(Highlander)) warriors, who can only be defeated by beheading. When they are defeated, their immense experience and power transfers to the victor in a storm of lightning and curiously excessive sweating. After millennia, only a few remain, and \"The Gathering\" is organised, to settle this ancient war.\n\nAnyway, it got me thinking about the scarcity of Bitcoin. There is of course a 21 million cap on the supply, but it is common knowledge that there will never be anywhere near that number of bitcoin in circulation, with perhaps 6 million permanently lost already. In fact, over time it would seem that the amount of bitcoin in the hands of the living will continue to decline, as wallets become inaccessible due to poor estate planning, or lack of heirs.\n\nThen it struck me, like the aforementioned lightning, surging through my mind and body with the power of the bitcoin warriors that have passed already. Drenched in sweat, it became clear to me that we have created a clan of \"immortals\", although not in human lifespan. Instead our lifeforce has been pseudonymously carved on an eternal timechain, our power transformed into information, passed on forever by our kind. You each hold some measure of this great power... but if I can find you, and destroy you in battle, your coins will be lost, and your power will become my own.\n\nSo it is apparent, the war has already begun. I hereby name myself Victor, of the Kurgans. Prepare yourselves, for **there can be only one**.",
            "stickied": false,
            "comments": [
                {
                    "id": "ialh9jb",
                    "author": "the-jade-rabbit",
                    "score": 3,
                    "created_utc": 1653950061.0,
                    "response": "I've been alive for four and half centuries, and I cannot die.  I shall await you at the halvening.\n\n\nDon't lose your head.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iam64mn",
                            "author": "Independent-Snow-129",
                            "score": 1,
                            "created_utc": 1653962835.0,
                            "response": "Alice ?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ial9ldi",
                    "author": "adigabusymind",
                    "score": 2,
                    "created_utc": 1653946243.0,
                    "response": "The fact that the number keeps going down is a bit worrying to be real. Like when people die, it might be impossible to inherit some of those bitcoins. I worry if I die tomorrow, will my daughter be able to get my bitcoins. It’s really scary.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iam4wb1",
                    "author": "TheBigKosher",
                    "score": 1,
                    "created_utc": 1653962205.0,
                    "response": "I just used a potion on you and you're now allergic to Bitcoin.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iam635r",
                    "author": "Independent-Snow-129",
                    "score": 1,
                    "created_utc": 1653962813.0,
                    "response": "You didn't read the rules of the game ...  Great fiction nonetheless!\n\nThis game looks dangerous. I'd go underground and refuse any duels making the game last *forever* until exhaustion !",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}