{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uru25r",
            "title": "Need advice",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uru25r/need_advice/",
            "author": "LatterSun6415",
            "created_utc": 1652815243.0,
            "score": 0,
            "num_comments": 17,
            "subreddit": "Bitcoin",
            "selftext": "I want to sell my btc and buy it back and use the loss as a tax write off with capital gains in the future. Should I wait until it goes up a little more and just sell and buy now? Thanks",
            "stickied": false,
            "comments": [
                {
                    "id": "i8zekk2",
                    "author": "radikaltruth",
                    "score": 9,
                    "created_utc": 1652815409.0,
                    "response": "You shouldn’t take financial advice on Reddit.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8zeogg",
                            "author": "jamkir",
                            "score": 3,
                            "created_utc": 1652815453.0,
                            "response": "This is some sound advice",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8zfnem",
                                    "author": "Ok_Aerie3546",
                                    "score": 2,
                                    "created_utc": 1652815854.0,
                                    "response": "Such a dilemma, now should he take the advice or not!!!! Im sweating!!!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8zgh5g",
                            "author": "LatterSun6415",
                            "score": 1,
                            "created_utc": 1652816192.0,
                            "response": "Should I sell my house?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8zgtg0",
                                    "author": "radikaltruth",
                                    "score": 2,
                                    "created_utc": 1652816330.0,
                                    "response": "Sell it all. Live in a box. It will go up again…..hopefully",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8zo50j",
                                            "author": "LatterSun6415",
                                            "score": 1,
                                            "created_utc": 1652819364.0,
                                            "response": "My life is in your hands sir",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8zrn69",
                                                    "author": "radikaltruth",
                                                    "score": 1,
                                                    "created_utc": 1652820824.0,
                                                    "response": "Okay send me all your Bitcoin. I’ll save it for you.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8zrbye",
                            "author": "OfficialMarsCurrency",
                            "score": 1,
                            "created_utc": 1652820694.0,
                            "response": "This is true.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8zg24q",
                    "author": "Narmotur",
                    "score": 3,
                    "created_utc": 1652816023.0,
                    "response": "You didn't say where you are, and the rules for this sort of thing will vary based on that. Also, don't take financial advice from reddit.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8zgcph",
                            "author": "LatterSun6415",
                            "score": 1,
                            "created_utc": 1652816142.0,
                            "response": "I’m in the US",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8zgmaq",
                                    "author": "Narmotur",
                                    "score": 2,
                                    "created_utc": 1652816251.0,
                                    "response": "Looks like you miiiiiiight fall under the wash-sale rules, meaning you cannot buy back the security for 30 days. More information here: https://www.investopedia.com/terms/w/washsalerule.asp\n\nAlso, seek accredited financial advice.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8zoojt",
                                            "author": "nagato1125",
                                            "score": 2,
                                            "created_utc": 1652819594.0,
                                            "response": "nope. bitcoin is not a security. op can sell and buy it asap.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8zjtk6",
                    "author": "NYKNYb",
                    "score": 1,
                    "created_utc": 1652817572.0,
                    "response": "If you hodl for 10 years or so paying taxes to a government when you use your bitcoin won't be a thing anymore.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8zmrup",
                    "author": "itsnoteasybutitsfine",
                    "score": 1,
                    "created_utc": 1652818796.0,
                    "response": "Kindly send me the btc and I’ll return it back to you",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8zn9yi",
                            "author": "LatterSun6415",
                            "score": 1,
                            "created_utc": 1652819005.0,
                            "response": "It’s only 3 😜",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8zwcq3",
                    "author": "The-Francois8",
                    "score": 1,
                    "created_utc": 1652822809.0,
                    "response": "No 30 days wash rules for bitcoin. \n\nI’m not an accountant and I did not stay at a holiday inn express last night.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9077z5",
                    "author": "jjkoto",
                    "score": 1,
                    "created_utc": 1652827682.0,
                    "response": "People typically wait until December to do this stuff for obvious reasons.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "urtqrh",
            "title": "Dog sitting for my receptive Uncle and left a little information for him",
            "url": "https://i.imgur.com/1owdCvv.jpg",
            "author": "thefullmcnulty",
            "created_utc": 1652814365.0,
            "score": 323,
            "num_comments": 186,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8zvomd",
                    "author": "Olorin_1990",
                    "score": 57,
                    "created_utc": 1652822527.0,
                    "response": "That’s not how inflation/currency value works.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8zyh7a",
                            "author": "Oglark",
                            "score": 42,
                            "created_utc": 1652823731.0,
                            "response": "This is the problem. People do not actually understand why BTC is a great idea.  Instead they write FiAt is DuMb.  \n  \nFiat works well for 99% of its uses. It sucks as a *store of value*. But BTC dropping with inflation and interest rate hikes show that it has not matured into its end form.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i90008t",
                                    "author": "bitusher",
                                    "score": 23,
                                    "created_utc": 1652824402.0,
                                    "response": "Fiat is indeed Better than gold in 5 of the 8 categories of good money. \n\nFiat is better than BTC (for the time being) in 2 of the categories of good money and Bitcoin is superior to fiat in 6 of the 8.  \n\n\n\n**1) Durability** = Gold is best here due to its history and physical nature. Bitcoin and fiat  being digital in nature means we must compare the  durability of the institution/network that issues and secures them. I would suggest that Bitcoin will slightly excel responsible nation states here and does far better than  unreliable forms of fiat when looking at the history of fiat compared the the history and properties of Bitcoin(2017 gave a lot of credibility to Bitcoin in it thwarting a powerful attack and nation states have repeatedly attacked Bitcoin to one degree or another)\n\n**2) Portability** = Gold is horrible in this category being physical, heavy and unable to be sent digitally(custodians don't count as you lose most the benefits of gold and it switched categories from a bearer asset to registered value). Bitcoin beats fiat here too as its peer to peer , global and lacks regulatory friction. \n\n**3) Fungibility** Gold and Bitcoin tie here. When comparing fiat to Bitcoin it is more complicated but Bitcoin beats fiat here overall and is significantly getting better each year (see link above) . Physical fiat has some advantages over Bitcoin in the sense that its easier to have strong privacy locally as long as the whole \"anonymity set\" (group of users) avoid depositing the fiat in ATMs and banks(physical cash has serial numbers that are tracked with OCR + bill readers everywhere). Bitcoin can be very private if you use the right wallet and you take precautions but if you make a mistake you can also have problems. Digital fiat isn't very fungible or private at all. Gold isn't as fungible as many people suggest either due to different grading, certifying prices, forms which all fetch different prices.\n\n**4) Scarcity** -- Bitcoin wins this hands down with a fixed and limited supply. ~2-4 million BTc have been permanently lost/destroyed and many people also a long term investors leading to more scarcity. Gold is a distant 2nd with concerns in asteroid mining - (Psyche 16 as an example) and not knowing if any other large deposit can be found but far superior to fiat. \n\n**5) Divisibility** Bitcoin is already divisible by 8 decimal places onchain and 1/1000 of a satoshi on other layers like lightning. Thus micro txs are possible with bitcoin and too impractical with gold and not as easily done with fiat due to regulatory friction  and costs. The idea is that machines and software can tip other software, machines, and services by the minute or second to allow for more granularity and thus more efficiency with lower prices.\n\n**6) Acceptability** - Fiat wins this category for the time being due to its acceptance worldwide , especially US dollars. Bitcoin being a global currency without regulatory friction can one day overtake even the most accepted fiat however. Almost no one accepts gold for payment so its last and this is unlikely to change. \n\n**7) Verifiability** - Bitcoin wins here slightly over gold and fiat. Gold can be verified but takes more effort and there are concerns with tungsten filled bars and fake gold. Bitcoin being swept from a private key(coin or paper) or accepting an open dime is better than fiat physical cash, and digital fiat has very large concerns and delays in verification (chargebacks, fraud, etc...)\n\n**8) stability as a unit of account** - While Bitcoin is better than certain forms of fiat in this category, most are more stable than bitcoin and so Bitcoin remains 3rd compared to fiat and gold. We hope that Bitcoin in time will become less volatile with a much larger market cap . This trend is already occurring ,and much economic theory supports this happening but its still an experiment as to how long it will take and what size market cap / liquidity is needed",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i90dhof",
                                            "author": "bitsteiner",
                                            "score": 3,
                                            "created_utc": 1652830662.0,
                                            "response": "6) is not a result of free market, but of an enforced monopoly. 8) is a derivative of market power.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i90frnq",
                                                    "author": "bitusher",
                                                    "score": 1,
                                                    "created_utc": 1652831769.0,
                                                    "response": "I agree , Salient points. To be fair one could make the argument that constantly tweaking the monetary supply allows economists to achieve better short term stability but this has yet to be seen. Conversely you could also fairly suggest that central planners meddling with a monetary policy can cause instability as well. \n\nThus perhaps comparing the market cap of a hard asset like gold to fiat is a better way to determine Bitcoin's possible future stability at the same market cap \n\nGold market cap - $11.512 T\n\nBitcoin market cap - $0.58 T\n\nUS dollar market cap - $39 T\n\nThere are plenty of fiat currencies with lower market caps than bitcoin however that are much more stable thus liquidity alone is not the only importance in stability as a unit of account. Part of the stability in fiat is likely in part due to their forced monopolies and the assets and resources a country has to hedge their fiat.  \n\nI would suggest Bitcoin can eventually become less volatile than gold based upon its fixed supply and steady monetary policy. IMHO we still don't know how stable bitcoin can become in relation to the most stable forms of fiat.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9029ii",
                                            "author": "Oglark",
                                            "score": 4,
                                            "created_utc": 1652825408.0,
                                            "response": "OMG just no. Please read something a little more well thought out than this web page. BTC was a never a fix for fiat and it can't be better than fiat if it was never designed to replace fiat.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i903w2t",
                                                    "author": "bitusher",
                                                    "score": 6,
                                                    "created_utc": 1652826145.0,
                                                    "response": "I agree that bitcoin will be unlikely to replace fiat in our lifetimes. Both will persist and many forms of fiat might use it as their hedge and reserve currency. One is a bearer instrument and the other registered value with different security assumptions and tradeoffs. Fiat has such entrenched network effects and is enforced by local violence that it will also persist. Another aspect with fiat is we still don't know if sufficient liquidity is going to be enough to make bitcoin as stable of a unit of account as the USD or euro. I would suggest that bitcoin would need to exceed the liquidity of an individual fiat currency by at least an order of magnitude to possibly become as stable as the most stable forms of fiat but this is still an experiment. \n\nBitcoin and fiat still compete as currency despite any of this. Let me know if you disagree with any of the properties above of good money.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i904xt0",
                                                            "author": "Oglark",
                                                            "score": 1,
                                                            "created_utc": 1652826630.0,
                                                            "response": "I think that some countries with weak central banks may be tempted to shift to a Bitcoin *standard* i.e. a note would be redeemable for a certain amount of sats.  I doubt that they will be disciplined enough to stay on that standard but I think some wil try. \n  \nI don't think of BTC as money just like I don't think of gold, silver or diamonds as money. I think of it as a valuable commodity with a limited supply which I can  choose to barter for other goods.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i907b68",
                                                                    "author": "bitusher",
                                                                    "score": 8,
                                                                    "created_utc": 1652827724.0,
                                                                    "response": "Once (or if) Bitcoin has enough liquidity than nation states will have no choice to hedge in some Bitcoin regardless what they desire. Please look at the historical example of governments using the silver standard competing to a gold standard and what that eventually did to their economies forcing them to switch to the gold standard. A country must at minimum be proportionally hedged in a hard money to survive a speculative attack. \n\n>I don't think of BTC as money\n\nI personally use bitcoin daily, with merchants (local stores and restaurants) accepting Bitcoin directly and they are keeping those Bitcoin and not selling it either creating a circular economy of p2p money.\n\nIf you want to treat bitcoin as an asset alone that is your prerogative. One of the great thing about bitcoin is its many different things to many people and can be used as a payment rail, timestamping protocol , SoV asset, p2p money, or smart contract platform.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i905pyw",
                                                    "author": "thefullmcnulty",
                                                    "score": 4,
                                                    "created_utc": 1652826985.0,
                                                    "response": "The well accepted tenets of money are an “OMG just no” situation? Right…\n\nGet real. You’re making shit up to suit your fictions.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i905m3n",
                                                    "author": "soooofa_king",
                                                    "score": 2,
                                                    "created_utc": 1652826935.0,
                                                    "response": "Lmao, that was the single thing out of all that you chose to whine about?  😂",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i90ardm",
                                            "author": "hatetheproject",
                                            "score": 0,
                                            "created_utc": 1652829357.0,
                                            "response": "No way you just said bitcoin is more portable than cash. Don’t visa process like a million transactions per second or something? lmao",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i90byis",
                                                    "author": "bitusher",
                                                    "score": 1,
                                                    "created_utc": 1652829923.0,
                                                    "response": "Visa Advertises as having a capacity over 24k TPS max capacity or 1,700 transactions per second on average (based on a calculation derived from the official claim of over 150 million transactions per day)\n\nhttps://usa.visa.com/run-your-business/small-business-tools/retail.html\n\nOn just one layer of Bitcoin like lightning , bitcoin has a capacity of millions of transactions per second. \n\nOver 99% of Bitcoin transactions occur offchain, and even onchain transactions often represent many txs with batching. Additionally, part of what hurts portability in fiat is the unbanked due to regulatory friction and regulations preventing the ability to send fiat to certain people or certain countries.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i90g7bf",
                                                            "author": "hatetheproject",
                                                            "score": 2,
                                                            "created_utc": 1652831988.0,
                                                            "response": "i revoke my comment lol",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i90b7mn",
                                    "author": "bundleogrundle",
                                    "score": 2,
                                    "created_utc": 1652829570.0,
                                    "response": "i.e. It’s still a risk asset",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i90cqpn",
                                    "author": "bitsteiner",
                                    "score": 2,
                                    "created_utc": 1652830300.0,
                                    "response": "> But BTC dropping with inflation and interest rate hikes show that it has not matured into its end form.\n\nZoom out.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i90eth6",
                                            "author": "Oglark",
                                            "score": -2,
                                            "created_utc": 1652831304.0,
                                            "response": "You are confusing its price with its behaviour. BTC went up because people are looking for a high return asset.  If it was gold it would go up when inflation is high because it is an inflation hedge. Instead it trended down with equity prices. \n  \nI expect that it will eventually stabilize at a price and not move very much.  \n  \nEdit. That price could be $5 or it could be $5 billion",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i8zys4a",
                                    "author": "thefullmcnulty",
                                    "score": 0,
                                    "created_utc": 1652823864.0,
                                    "response": "SoV is the comparison I’m demonstrating with the post.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8zzxak",
                                            "author": "Oglark",
                                            "score": 1,
                                            "created_utc": 1652824364.0,
                                            "response": "But you reasoning is wrong. Fiat does not lose value because it is \"infinite\". It loses value because it has a relative value against a pool of goods. \n  \nIf BTC was the de facto exchange currency it would suffer a far worse decline in value over time.  \n  \nBTC will never be a replacement for fiat. It is supposed to be a replacement for *gold*.\n  \nI strongly advise you to read up on why countries abandoned the Gold Standard and how that decoupling allowed gold to become a currency hedge.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i904mpd",
                                                    "author": "parkranger2000",
                                                    "score": 7,
                                                    "created_utc": 1652826491.0,
                                                    "response": "Of course it loses value as it’s supply increases. And there is no limit to how much that supply can increase.  Thus “infinite”",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i905k2f",
                                                            "author": "thefullmcnulty",
                                                            "score": 1,
                                                            "created_utc": 1652826908.0,
                                                            "response": "🎯",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "i90bl60",
                                                            "author": "Oglark",
                                                            "score": 0,
                                                            "created_utc": 1652829745.0,
                                                            "response": "That is not true. You can increase supply without decreasing value. In fact that has happened for long stretches of history.  \n  \nValue is destroyed by inflation.   \n  \nLook, to me, until a change in interest rates in BTC denominated loans affects economic activity it is not money.   \n  \nSomeone else here talked about selling in BTC for goods who buys from another person who sells in BTC\n Okay it is definitely a \"currency\". But it is only the tip of fiat money supply.  \n  \nRight now BTC just is not money, it is like trading cards. They have value because we say it has value but it sits on top of fiat.  \n  \nI understand there are a lot of idealogues who don't believe in the Government and Central Banks etc. And maybe they are right. But that does not mean that BTC is going to replace fiat because of infinite supply.  \n  \nIt might happen because *everyone* loses trust in the Government. But that has very little to do with whether the supply is infinite or not.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i90anre",
                                                    "author": "FancyPantsMacGee",
                                                    "score": 1,
                                                    "created_utc": 1652829309.0,
                                                    "response": "In your reasoning, the value of bitcoin would increase over time. As a scare item chases more goods, the value of the scare item becomes more valuable. This would deflate bitcoin as the same number of bitcoin chases an increasing amount of goods and services.\n\nThe reason the dollar inflates (aka loses purchasing power) is because there are more dollars chasing a similar amount of goods.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i90dz1q",
                                                            "author": "bitsteiner",
                                                            "score": 2,
                                                            "created_utc": 1652830895.0,
                                                            "response": "Increasing amount of goods and services is a result of credit creation (fiat inflation).\n\nDeflation is not devastating per se, but it is devastating to fractional reserve fiat, because its only mode is an exponentially growing feedback loop.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i90pbt2",
                                                                    "author": "FancyPantsMacGee",
                                                                    "score": 1,
                                                                    "created_utc": 1652836302.0,
                                                                    "response": "Increasing goods and services is a result of increases in real productivity. \n\nCredit creation can spur increases in productivity, if applied to the creation of more productive assets, but in itself doesn’t create more goods and services.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i90rphn",
                                                                            "author": "bitsteiner",
                                                                            "score": 1,
                                                                            "created_utc": 1652837421.0,
                                                                            "response": "Ask yourself, where does the money come from to pay for purchasing an increasing amount of goods and services. If money isn't added to the economy there would no demand for added goods and services. The additional money comes in form of credit creation by commercial banks, which asks for additional goods and services. Increased productivity is just the result of the need to service debt.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "i90e56a",
                                                            "author": "Oglark",
                                                            "score": 1,
                                                            "created_utc": 1652830977.0,
                                                            "response": "Okay here is a thought experiment. There is no fiat. 2 sats buy a dozen eggs, or a litre of gas.  Then there is a war. Suddenly, the price of eggs goes to 1.5 satoshis and gas is 3 sats.  \n  \nHow did the value of BTC go up? It didn't. The loss in value was due to the cost of producing or obtaining the goods.  \n\nIn a closed system this is expected to eventually balance out but it has been proven that it doesn't on real the world.  That used to get around this by devaluing currency to the ounces of gold it represented.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i90o6n4",
                                                                    "author": "FancyPantsMacGee",
                                                                    "score": 1,
                                                                    "created_utc": 1652835762.0,
                                                                    "response": "What is your example trying to say? You cannot escape the law of supply and demand. In your example the price of eggs decreased and gas increased. Since sats stayed consistent, as more cannot be printed, we can presume the demand of eggs decreased, or supply increased, and the opposite is true for gas. This makes no sense as an example.\n\nThe power of having a limited supply of sats is that it would not be inflated away. In your example let’s look at gas. We went to war, so presumable you think supply will decrease, demand will stay consistent, and this will lead to increases in prices. But the value of your sat relative to the original demand of gas is unchanged. The only thing that has changed is decreased supply of gas, leading to increased prices.\n\nIn a fiat currency, where more fiat can be created, the price would increase more than it would with a perfectly scarce currency (eg BTC). Because printing would occur, not only would supply for gas decrease, but more fiat would be chasing this commodity. This would lead to a higher increase in price due to the compounding of decreased supply and inflation of the currency.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i90kadw",
                                    "author": "crustycalzone",
                                    "score": 1,
                                    "created_utc": 1652833925.0,
                                    "response": "Why does fiat suck as a store of value? If anything, the opposite is true.  Fiat is a stable store of value, but you have to deal with censorship, regulation, industry insider capture, chilling effects, civil asset forfeiture, etc.\n\nFiat as a store of value currently stores much more than most assets. $30 trillion of US debt is much more than any private company or individual asset.  Not to mention the total value of bank deposits.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i90pi4i",
                                            "author": "Oglark",
                                            "score": 1,
                                            "created_utc": 1652836387.0,
                                            "response": "Fiat is eroded by inflation. BTC as a scarce commodity should increase with inflation like gold does",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i90pjf3",
                                            "author": "bitusher",
                                            "score": 1,
                                            "created_utc": 1652836404.0,
                                            "response": "SoV can be compared in windows of time \n\nSome forms of fiat are a better store of value short term (under 1 year) while fiat going through hyperinflation is a horrible store of value in all aspects \n\nGold has historical period of losing purchasing power for over 30 years so should only be considered a good store of value generationally. \n\nSp500 index can lose purchasing power for 3-4 years but longterm is a good SoV\n\nBitcoin historically has had bear markets of ~2 years so is a horrible store of value short term but an excellent one over 2 years \n\nAs you can see from the comparison above Bitcoin represents a good store of value in over 2 years and fiat represents an ever worsening short term store of value now that inflation is over 8% in most countries",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i905y1s",
                            "author": "Infamous_Bus1578",
                            "score": 3,
                            "created_utc": 1652827091.0,
                            "response": "It is exactly how it works lmao",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9065q1",
                                    "author": "thefullmcnulty",
                                    "score": 0,
                                    "created_utc": 1652827189.0,
                                    "response": "Nah bro, *trust him*",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i906z0p",
                                            "author": "Infamous_Bus1578",
                                            "score": 1,
                                            "created_utc": 1652827566.0,
                                            "response": "I’ve seen a lot of these pro fiat comments here lately. Pretty annoying",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i909tht",
                                                    "author": "Silarous",
                                                    "score": 3,
                                                    "created_utc": 1652828909.0,
                                                    "response": "A lot of people seem to have missed the very first homework assignment before buying into Bitcoin.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i90h3sn",
                                                            "author": "thefullmcnulty",
                                                            "score": 4,
                                                            "created_utc": 1652832420.0,
                                                            "response": "People can say any stupid shit they want on the internet… and boy do they take advantage of that reality.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i908syj",
                                                    "author": "thefullmcnulty",
                                                    "score": 1,
                                                    "created_utc": 1652828427.0,
                                                    "response": "Lot of nefarious stuff and bad actors on Reddit. \n\nI really like the idea of paying sats via LN to participate in social media. It would create a cost for all the disinformation / shills / trolls and I’d gladly pay a few dollars a month to clean up the trash from forums.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i90klzi",
                                    "author": "Olorin_1990",
                                    "score": 1,
                                    "created_utc": 1652834079.0,
                                    "response": "The amount of currency <> the availability of currency. You don’t consume or use currency, it’s used for exchange. As such the same unit of currency can be used in many transactions. So the availability has more to do with the willingness to spend/lend than the quantity of supply. Or thought of another way, how long money stays in an account without being lent out/spent.\n\nWhile an increased supply creates inflationary pressure, it’s hardly the whole story. A currency with increasing supply can deflate,  a currency with stagnant supply can inflate.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i90pmde",
                                            "author": "Infamous_Bus1578",
                                            "score": 1,
                                            "created_utc": 1652836443.0,
                                            "response": "So you’re telling the me the amount of currency available is not strongly positively correlated to the amount of currency created? OPs point stands either way. The holders proportion of the total supply of either currency available or currency created is always diminishing in a fiat system.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i90kvng",
                            "author": "Euphoric_Luck_8126",
                            "score": 0,
                            "created_utc": 1652834206.0,
                            "response": "So you’re telling me I’m not going to only have $1 from 1995??",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i90liqe",
                                    "author": "Olorin_1990",
                                    "score": 1,
                                    "created_utc": 1652834510.0,
                                    "response": "Im saying that buying power of a currency is more than just its supply, and is dictated by it’s availability, which has as much to do with the quantity available as how long it stays in accounts before being spent/lent.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i90mnlz",
                                            "author": "Euphoric_Luck_8126",
                                            "score": 1,
                                            "created_utc": 1652835040.0,
                                            "response": "Haha my man, I’m agreeing with you, it was a sarcastic comment. The reason why the infinity at the bottom doesn’t matter because everyone’s slice of the pie is also growing.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i90mup3",
                                                    "author": "Olorin_1990",
                                                    "score": 1,
                                                    "created_utc": 1652835135.0,
                                                    "response": "Oh, sorry lol.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i90g0p9",
                    "author": "GodOfThunder101",
                    "score": 8,
                    "created_utc": 1652831894.0,
                    "response": "This is something you expect to hear from a 14 year old. You’re not 14 are you?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i90go0p",
                            "author": "thefullmcnulty",
                            "score": -2,
                            "created_utc": 1652832210.0,
                            "response": "You are very in touch with today’s youth! They are constantly spray painting currency supply dynamics all over the damn place these days, the rascals! I was actually inspired by their graffiti, how did you know?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9046ll",
                    "author": "ScarPersonal",
                    "score": 11,
                    "created_utc": 1652826281.0,
                    "response": "There are a lot of shills in these comments. I like your drawing it sums up why bitcoin is the hardest asset in history nicely",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i909zuk",
                            "author": "Depx",
                            "score": 5,
                            "created_utc": 1652828993.0,
                            "response": "I don't really understand how BTC is a limited currency when you can go to seemingly any fraction of a BTC you want. I guess that of course can make the USD value of BTC rise since you can always pull out $1 in value in some decimal amount of BTC. BTC being able to be infinity fractioned though also means it'll probably never be a stable value.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i90n6k1",
                                    "author": "Trxth",
                                    "score": 1,
                                    "created_utc": 1652835295.0,
                                    "response": ">I don't really understand how BTC is a limited currency when you can go to seemingly any fraction of a BTC you want.     \n     \nIt's limited in its supply, not its divisibility (well, technically its divisibility *is* limited, but let's not get into the weeds too much). Like, if you have a 1.0oz gold bar, and you melt it down to mint 10 coins that contain 0.1oz of gold in each, how many ounces of gold do you have? Obviously, you still only have 1.0oz of gold. What if instead, you mint 100 very small coins that contain 0.01oz of gold per coin? Or 1,000 itty-bitty coins that contain 0.001oz of gold?     \n      \n>I guess that of course can make the USD value of BTC rise since you can always pull out $1 in value in some decimal amount of BTC.     \n     \nYes, and this is why being digital in nature gives bitcoin a much higher probability of becoming a currency than gold ever had. It's impractical to transact in microscopic denominations of a tangible asset, and you'd eventually reach an absolute limit to how many times you could subdivide an ounce of gold (i.e.- a single molecule). With bitcoin, however, the (theoretical) divisibility is truly infinite.     \n     \n>BTC being able to be infinity fractioned though also means it'll probably never be a stable value.    \n    \n\"Stable\" relative to what? On a long enough time scale, nothing in existence has a \"stable value\" because value itself is relative and subjective, and changes based on a little thing you may have heard of called \"supply & demand\". Once Bitcoin has matured to the point that it is as ubiquitous as the dollar is currently its value will be much more stable than it is now, but will still fluctuate due to economic conditions, population growth, \"lost\" coins, etc.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i90stjh",
                                            "author": "feyyd",
                                            "score": 1,
                                            "created_utc": 1652837945.0,
                                            "response": "Yup, the only reason everything is priced in USD atm is because its the most stable.  When everything is priced in USD, 1 USD always = 1 USD.  When/if BTC dominance takes over and is proven to be more stable (20+ year timeframe type of stuff), everything will be priced in BTC.  \n\nNow BTC is the \"stable\" thing, and everything else will \"appear\" to fluctuate, but EVERYTHING is always fluctuating, people just think USD seems stable because you $1 USD = $1USD so they assume the asset price is moving, not the price of dollar.  In reality, they both move, but people have more faith in $1 buying the same amount of goods (to some degree).\n\nIt is really a matter of faith, if USD faith stays strong, it will continue being the world reserve, mostly everyone in crypto thinks that USD (or fiat in general) is a failing proposition though, because they wiggle the levers whenever it benefits them.  They adjust the how many dollars are made, and they trade bonds for goods (ie, create money, they have to pay bond interest yearly, and they just pay it with more debt)\n\nBTC believers trust ledger more than fiat.  Right now its not really a hedge because of speculative investing, but the future is unwritten.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i90583q",
                            "author": "thefullmcnulty",
                            "score": -1,
                            "created_utc": 1652826762.0,
                            "response": "Thanks. Reddit is pretty infiltrated with junk no doubt but I really don’t mind. If you don’t have haters chiming in then you’re not getting traction. \n\nPlenty of good people on Reddit too so I’m here for interaction with them. Hope things are good for you wherever you’re at.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i905e53",
                                    "author": "ScarPersonal",
                                    "score": 4,
                                    "created_utc": 1652826836.0,
                                    "response": "♾/ 21 million is the core bitcoin thesis. Not sure why in a bitcoin sub people are mad for pointing this out.\n\nYou too man. Hope you’re good and keep stackin’",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i90bjda",
                                    "author": "ILikePracticalGifts",
                                    "score": 4,
                                    "created_utc": 1652829721.0,
                                    "response": "Bro it’s not haters it’s people saying you don’t know how money/currency works.\n\nYou can be pro bitcoin while also criticizing those who are too smart for their own good.\n\nYou’ve already got the traction. You’re in r/Bitcoin ffs.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8zpjci",
                    "author": "giantpotato",
                    "score": 7,
                    "created_utc": 1652819953.0,
                    "response": "There are not 21M bitcoin currently available. Bitcoin will continue to be \"printed\"/mined for the rest of your life, just at a slower and slower rate. The supply will only reach 21M after you're dead.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8zqr8t",
                            "author": "thefullmcnulty",
                            "score": 12,
                            "created_utc": 1652820455.0,
                            "response": "Lots of people in bitcoin use 21,000,000 as their currency supply denominator. We know that’s where it’s going and 90%+ of the 21M have been mined. Easier to just use final supply in these simplified examples. Using 19,042,650 as a denominator that’s consistently moving up isn’t as palatable. 21M works fine.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8zugs7",
                                    "author": "giantpotato",
                                    "score": 3,
                                    "created_utc": 1652822016.0,
                                    "response": "If the \"donominator is constantly moving up\", How can the \"holders share of supply remain proportional\"?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8zv67h",
                                            "author": "thefullmcnulty",
                                            "score": 4,
                                            "created_utc": 1652822313.0,
                                            "response": ">\tLots of people in bitcoin use 21,000,000 as their currency supply denominator. We know that’s where it’s going and 90%+ of the 21M have been mined. Easier to just use final supply in these simplified examples. Using 19,042,650 as a denominator that’s consistently moving up isn’t as palatable. 21M works fine.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i904vmc",
                            "author": "parkranger2000",
                            "score": 2,
                            "created_utc": 1652826602.0,
                            "response": "Total currency supply. Not right now. Just total.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8zs9zv",
                    "author": "Nappingspider",
                    "score": 11,
                    "created_utc": 1652821088.0,
                    "response": "You people try too hard lol",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8zsxp6",
                            "author": "thefullmcnulty",
                            "score": 2,
                            "created_utc": 1652821363.0,
                            "response": "Bitcoin is one of my many hobbies. I had fun drawing that and I’ll have fun talking to my Uncle about it when he calls me tonight.\n\nYou should try harder not to be a negative prick on the internet for no reason.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8ztqv1",
                                    "author": "Nappingspider",
                                    "score": 7,
                                    "created_utc": 1652821705.0,
                                    "response": "Seems like I hit the nail on the head lol",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8zuqqa",
                                            "author": "horsecyack",
                                            "score": -4,
                                            "created_utc": 1652822130.0,
                                            "response": "Was that your mission?",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i8zu8p7",
                                            "author": "thefullmcnulty",
                                            "score": -3,
                                            "created_utc": 1652821919.0,
                                            "response": "You succeeded in making yourself look like an idiot publicly. That’s it.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i8zyryc",
                                    "author": "Oglark",
                                    "score": 2,
                                    "created_utc": 1652823862.0,
                                    "response": "The problem is that you did not communicate basic economics so your whiteboard, while well intentioned, draws criticism.  \n  \nPerhaps you think that the Central Bank actually prints money?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i90hidi",
                                            "author": "thefullmcnulty",
                                            "score": 5,
                                            "created_utc": 1652832618.0,
                                            "response": "😂😂\n\nIt’s a doodle not an comprehensive research paper and illustrates these realities quite well.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i90dyit",
                                            "author": "freelee33",
                                            "score": 4,
                                            "created_utc": 1652830888.0,
                                            "response": "They create money out of thin air",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i90f0na",
                                                    "author": "Oglark",
                                                    "score": -1,
                                                    "created_utc": 1652831402.0,
                                                    "response": "Actually electrons. The question is why?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i90hcqb",
                                                            "author": "freelee33",
                                                            "score": 1,
                                                            "created_utc": 1652832541.0,
                                                            "response": "No that's not the question for me I was taught money doesn't grow on trees and can't be created out of thin air",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8zu5or",
                    "author": "AlwaysMooning",
                    "score": 4,
                    "created_utc": 1652821882.0,
                    "response": "I know what you’re trying to say, but people are going to nitpick your every word so be careful with phrasings and word choice.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8zw3m4",
                            "author": "thefullmcnulty",
                            "score": 3,
                            "created_utc": 1652822702.0,
                            "response": "They’re nitpicking ♾ as if communication must be 100% literal at all times. The symbol communicates the phenomenon concisely and in my opinion works just fine. Nuance is part of life and some people just can’t grasp that.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8zz5rr",
                    "author": "southbayellay",
                    "score": 5,
                    "created_utc": 1652824026.0,
                    "response": "I feel like there’s a lot of full retards in here",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i900cfp",
                            "author": "thefullmcnulty",
                            "score": 0,
                            "created_utc": 1652824552.0,
                            "response": "They live for these posts.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8zecm7",
                    "author": "bert_and_earnie",
                    "score": 0,
                    "created_utc": 1652815319.0,
                    "response": "- The dollar isn't Bitcoin's competitor; it's other investments.\n- There isn't an infinite supply of dollars. If there was, they would be worthless.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8zv5tb",
                            "author": "bitusher",
                            "score": 6,
                            "created_utc": 1652822309.0,
                            "response": "Bitcoin is primarily designed to be p2p money so indeed competes with the dollar. If most of the usage these days is as a speculative asset that merely means Bitcoin is both competing against fiat and other asset classes to the degree and percentage they are used in such manner. \n\nI personally use bitcoin daily, with merchants (local stores and restaurants) accepting Bitcoin directly and they are keeping those Bitcoin and not selling it either creating a circular economy of p2p money.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8zqys4",
                            "author": "Wookhooves",
                            "score": 8,
                            "created_utc": 1652820542.0,
                            "response": "How much did they print last year?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8zroaz",
                                    "author": "bert_and_earnie",
                                    "score": 10,
                                    "created_utc": 1652820837.0,
                                    "response": "A finite amount.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9010wz",
                                            "author": "ChristophAdcock",
                                            "score": 4,
                                            "created_utc": 1652824855.0,
                                            "response": "Yeah, at which number do they stop?",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i8zupro",
                                            "author": "thefullmcnulty",
                                            "score": -1,
                                            "created_utc": 1652822119.0,
                                            "response": "Effectively infinite. Works perfectly for this application. Most here don’t care for your pedantic bullshit. I wasn’t using ♾ as a mathematical absolute but to illustrate a concept, which it does perfectly. \n\nGo outside and get some air.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8zw841",
                                                    "author": "tjackson_12",
                                                    "score": 0,
                                                    "created_utc": 1652822754.0,
                                                    "response": "Well they can also burn dollars. So they can control both sides of the money supply…\n\nI agree though over time it does increase.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8zwm5u",
                                                            "author": "thefullmcnulty",
                                                            "score": 5,
                                                            "created_utc": 1652822923.0,
                                                            "response": "[The M2 chart](https://fred.stlouisfed.org/series/M2SL) is scary. So scary they discontinued it.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i90a6ci",
                                            "author": "Wookhooves",
                                            "score": 0,
                                            "created_utc": 1652829076.0,
                                            "response": "They printed trillions…..",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i90qnaa",
                                            "author": "GodLibertyGunsGold",
                                            "score": 1,
                                            "created_utc": 1652836931.0,
                                            "response": "Quite convenient that y'all forget that time exists.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9033kr",
                            "author": "parkranger2000",
                            "score": 3,
                            "created_utc": 1652825786.0,
                            "response": "It’s about how difficult it is to create more. Look at history to see what happens to any money that is easy to produce more of",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8zfvzq",
                            "author": "thefullmcnulty",
                            "score": 1,
                            "created_utc": 1652815953.0,
                            "response": ">\tThe dollar isn’t Bitcoin’s competitor; it’s other investments\n\nSubjective analysis. \n\n>\tThere isn’t an infinite supply of dollars. If there was, they would be worthless.\n\nThe supply of dollars is what’s needed by those who control money creation given the circumstances. Thus total supply is infinite as needed. \n\nThis is shown in the endless trillion dollar wars, myriad bailouts, subsidies, all of the “emergency” stimulus’ and acts, all of which is created when “needed” and with how the debt ceiling perpetually gets raised. They make as much money (debt) as they need. It never ends (until it collapses). And it will collapse due to the infinite nature of the supply.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9072ra",
                            "author": "bri8985",
                            "score": 1,
                            "created_utc": 1652827615.0,
                            "response": "Sorry no, other investments aren’t the competitor. You will always have land ownership, equities, debt, etc. \n\nBTC isn’t competing with other investments at a fundamental level, only now while people buy it in hopes of a future where they buy other products with it rather than their USD",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i90ep17",
                            "author": "bitsteiner",
                            "score": 1,
                            "created_utc": 1652831244.0,
                            "response": "> The dollar isn't Bitcoin's competitor;\n\nBecause the dollar has the monopoly as debt service medium, enforced by laws.\n\n> There isn't an infinite supply of dollars. \n\nThere is no prove for your claim. The Federal Reserve can create infinite amount of Dollars in an infinite time frame.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i900gsg",
                    "author": "frankiefrank1e",
                    "score": 2,
                    "created_utc": 1652824607.0,
                    "response": "Why did you have to write CHICKENSOUP just above? Now I want Chicken Soup, but I only have 5$. \n\nChicken soup, or 5$ of bitcoin? 🤔 \n\nI need to eat, primal needs first.\n\nBad advertisement!!\n\nlol jks i have nothing to do",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i900sps",
                            "author": "thefullmcnulty",
                            "score": 2,
                            "created_utc": 1652824754.0,
                            "response": "It says chicken coup. Much less appetizing.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9011g2",
                                    "author": "frankiefrank1e",
                                    "score": 1,
                                    "created_utc": 1652824861.0,
                                    "response": "😭 cropped picture. \n\nI still want chicken soup now",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i901b6k",
                                            "author": "thefullmcnulty",
                                            "score": 0,
                                            "created_utc": 1652824983.0,
                                            "response": "Get that!!!",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9037cq",
                    "author": "Stunning_Novel9398",
                    "score": 2,
                    "created_utc": 1652825835.0,
                    "response": "How is supply limited to 24m?\n\nEasy enough to make debt denominated in BTC",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i90fuep",
                            "author": "bitsteiner",
                            "score": 1,
                            "created_utc": 1652831806.0,
                            "response": "21m. BTC notes derived from debt are possible, but would make Bitcoin fractional reserve. Those notes would need to be trusted, they incur counter party risk, have limited acceptance, they wouldn't be easier to use than BTC and there is no central bank that could bail out the issuer. Almost certainly such notes would be doa.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i90ge0k",
                                    "author": "Stunning_Novel9398",
                                    "score": 0,
                                    "created_utc": 1652832076.0,
                                    "response": "Wouldn’t they be more widely accepted in a scenario where the value of bitcoin was more stable (aka mass adaptation)?\n\nPeople have done this to everything of value for a long time- why would BTC be any different? People want to borrow money and others want to get interest…\n\nLike how do you imagine you would get a loan to start a small business in a future world of BTC mass adaptation?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i90h5gt",
                                            "author": "bitsteiner",
                                            "score": 2,
                                            "created_utc": 1652832443.0,
                                            "response": "> People have done this to everything of value for a long time- why would BTC be any different? People want to borrow money and others want to get interest…\n\nLending of BTC will happen, but it doesn't increase supply.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i90l82o",
                                                    "author": "Stunning_Novel9398",
                                                    "score": 0,
                                                    "created_utc": 1652834372.0,
                                                    "response": "How does this not increase supply?\n\nAs soon as you lend something you create a note which is a form of money supply",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i90qha5",
                                                            "author": "bitsteiner",
                                                            "score": 1,
                                                            "created_utc": 1652836850.0,
                                                            "response": "Promissory notes wouldn't be widely accepted as method payment for the reasons I stated. Their addition to the money supply would be negligible. In addition there is no central bank which can create Bitcoins in exchange for debt notes like the Federal Reserve creates Dollars in exchange for government debt.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i90qywv",
                                                                    "author": "Stunning_Novel9398",
                                                                    "score": 1,
                                                                    "created_utc": 1652837079.0,
                                                                    "response": "Banks have issued such notes for a long time prior to the existence of reserve banking.\n\nIf BTC was widespread and more stable in value- why wouldn’t there be banks, given historically the issue of counter-party risk has been well tolerated. \n\nPeople would still want home loans and business loans for example and others would want return on capital- hence banking.\n\nEl Salvador is planning on selling government-backed Bitcoin bonds",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i900097",
                    "author": "Crooks7",
                    "score": 1,
                    "created_utc": 1652824402.0,
                    "response": "Currently, Bitcoin holders lose a certain amount of coinage/year. Either losing their password, or their wallet, or accidently sending some coin to a dead wallet, etc\n\nThis means over time, Bitcoin becomes more and more valuable... as is the supply shrinks while you're holding the same amount. \n\nThus, if Bitcoin becomes the official currency of any economy, it will actively encourage people to not spend their money. Essentially no investments into small businesses or the stock market, that all dries up.\n\nThe economy will tank. I'm confused why this is considered a feature and not a massive bug.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i900jax",
                            "author": "bitusher",
                            "score": 0,
                            "created_utc": 1652824637.0,
                            "response": "This is what is suggested would happen with scary terms such as \"deflationary death spiral\" but thus far Bitcoin has proven this incorrect. During period of high deflation(appreciation) tx velocity tends to increase and merchant processors actually see an increase in spending for goods and services and charitable giving in Bitcoin.\n\nThis is believed to be caused by the feeling of newfound wealth(because they are wealthier) eventually overrides their desire to \"hoard\" (when did savings become a negative thing?) their Bitcoin.\n\nOf course more data needs to confirm this and as we enter another bull cycle(rapid deflation) it looks like we will get another round of data to confirm this.\n\nBitcoin is already testing some economic theories and proving them somewhat inaccurate but the data gathering is far from over and we all have a lot to learn .\nI personally suspect that what matters for a viable currency besides these other properties discussed here\n\nhttps://www.reddit.com/r/BitcoinBeginners/comments/gnzeeo/will_bitcoin_ever_be_adopted_by_the_general_public/frcry8f/\n\nIs stability and thus either low and predictable inflation or low and predictable deflation (1-4%) can both be suitable. As Bitcoins market cap grows and monetary inflation drops it appears that we will likely see very low deflation (occasionally people losing some coins) which is perfectly fine because the market will factor those expectations into consideration for loans and debt.\n________________________________________\nI personally prefer slight deflation for these reasons :\n\n1)\tEncourages people to invest in things they really need instead of unnecessary fluff and short term desires which is good for society and the environment\n\n2)\tencourages more savings instead of debt slavery which removes choice, confidence and power away from individuals\n\n\n3)\tkeeps fiat currency in check where too much inflation will cause more capital flight to Bitcoin and prevents corrupt governments from abusing the backdoor tax of inflation\n\n4) Reduces the negative cantillon effect of fiat by removing some of the control over currency from a small group of people that is in part due to fiat being inflationary\nhttps://fee.org/articles/the-cantillon-effect-because-of-inflation-we-re-financing-the-financiers/",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9046u4",
                                    "author": "Crooks7",
                                    "score": 1,
                                    "created_utc": 1652826284.0,
                                    "response": "What I'm talking about specifically is the idea of having a deflationary currency. What it seems you're describing above is the deflation or inflation of the currency itself. This is slightly different. \n\nBy definition a deflationary currency becomes deflationary as more currency is lost than put into the market. In this sense, current blocks are being completed and a certain amount of Bitcoin is put into the market. Bitcoin will become deflationary when more Bitcoin is lost compared to what is put into the market in a given time period. A currency is either inflationary or deflationary, there are no \"periods\" of deflation/inflation.\n\n>This is what is suggested would happen with scary terms such as \"deflationary death spiral\" but thus far Bitcoin has proven this incorrect.\n\nYeah, cause it's not a deflationary currency yet. Depending on the % estimates of Bitcoin lost each year, deflationary status will hit between 2030 and 2040.\n\n>This is believed to be caused by the feeling of newfound wealth(because they are wealthier) eventually overrides their desire to \"hoard\" (when did savings become a negative thing?) their Bitcoin.\n\nWould love to see actual studies on this. Currently, with fiat currency, the cost of goods goes up each year and thus the value of money is less and less. Thus, it makes sense if people come into wealth, they would look to spend it. \n\nBut you're saying the same applies to Bitcoin. So if I wanted to redo my kitchen with my newfound Bitcoin wealth, I could spend say $10k worth of Bitcoin (say 10% of my Bitcoin)... or just wait a year until that deflationary currency increases in value and that $10k the next year is now only 5% of my Bitcoin. This logic does not work with a deflationary currency. There is no reason to spend that money. Hoarding is always the best investment which is horrendous for economies.\n\n>As Bitcoins market cap grows and monetary inflation drops it appears that we will likely see very low deflation (occasionally people losing some coins) which is perfectly fine because the market will factor those expectations into consideration for loans and debt.\n\nWith more coins in the market, there are more coins to be lost. Each coin has an individual probability of being lost at any time. Thus, you need to be considering a certain % of all Bitcoin that will be lost each day/month/year/etc. With the increasing number of coins on the market, more and more Bitcoin will be lost every year.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9068j9",
                                            "author": "bitusher",
                                            "score": -1,
                                            "created_utc": 1652827224.0,
                                            "response": "> What it seems you're describing above is the deflation or inflation of the currency itself. \n\nRead my previous post here \n\nhttps://www.reddit.com/r/Bitcoin/comments/urtqrh/dog_sitting_for_my_receptive_uncle_and_left_a/i8zw8mh/\n\n>Yeah, cause it's not a deflationary currency yet. \n\nRead the link above to understand the distinctions between monetary and economic inflation. Many people confuse the two because in fiat governments always try and insure that both are inflationary. \n\n>Would love to see actual studies on this.\n\nBitcoin Merchant processors , charitable giving and spending increase during a bull market. Tx velocity also increases but I'm not focusing on this because some suggest merely more adoption and speculative trading. It is very evident, but you aren't going to get any good studies on it due to the privacy found in bitcoin. \n\n>So if I wanted to redo my kitchen with my newfound Bitcoin wealth, I could spend say $10k worth of Bitcoin (say 10% of my Bitcoin)... or just wait a year until that deflationary currency increases in value and that $10k the next year is now only 5% of my Bitcoin. \n\nMoney is useless unless you can eventually use it. Your suggestion of constant hoarding does not match with my or many other bitcoin users experience. The \"lambo\" meme isn't just a meme but reflects early adopters spending during bull markets and you can see many Nouveau riche spending quite extravagantly. \n\nThe same can be seen with examples in technology products that are constantly dropping in value per model/feature set due to rapid improvements. Are you going to keep putting off buying a new cell phone or laptop because there will always be a much better one in the future or you can always buy last years model for cheaper? No, at most you might delay for a few months but will need to make a purchase eventually. \n\n>Thus, you need to be considering a certain % of all Bitcoin that will be lost each day/month/year/etc\n\nMost bitcoin were lost during the first 2 years when there wasn't good security, backups and bitcoin wasn't worth much. Very few bitcoin are lost these days. We can actually measure this onchain",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8zvg6w",
                    "author": "gorilla--",
                    "score": 1,
                    "created_utc": 1652822429.0,
                    "response": "well, in theory, USD supply could shrink\n\nit would require destruction, but it could be done",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8zx4wi",
                            "author": "thefullmcnulty",
                            "score": 3,
                            "created_utc": 1652823151.0,
                            "response": "[The long-term trend](https://fred.stlouisfed.org/series/M2SL) doesn’t look like the Fed will be doing any reduction in money supply.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8zxagi",
                                    "author": "gorilla--",
                                    "score": 1,
                                    "created_utc": 1652823217.0,
                                    "response": "just saying they could, so technically you’re wrong",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8zyggc",
                                            "author": "thefullmcnulty",
                                            "score": 0,
                                            "created_utc": 1652823722.0,
                                            "response": "The liabilities of the US are so great that a reduction of usd supply would create a global financial collapse. As Greg Foss says, “it’s mathematically guaranteed” that inflation of usd supply has to continue to service the compounding liabilities and to attempt to inflate away untenable long-term debts.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8zyofw",
                                                    "author": "gorilla--",
                                                    "score": 3,
                                                    "created_utc": 1652823820.0,
                                                    "response": "You’re still wrong.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i903a7z",
                                                            "author": "e4xit",
                                                            "score": 0,
                                                            "created_utc": 1652825871.0,
                                                            "response": "Technically the supply would always still be uncapped, so the graphic would still be correct.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i903hfk",
                                                                    "author": "gorilla--",
                                                                    "score": 1,
                                                                    "created_utc": 1652825961.0,
                                                                    "response": "no, because of the “always shrinks” language",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i90etq7",
                            "author": "bitsteiner",
                            "score": 1,
                            "created_utc": 1652831308.0,
                            "response": "In theory, but empirical evidence shows otherwise.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i90hdsm",
                    "author": "jsaaiman",
                    "score": 1,
                    "created_utc": 1652832555.0,
                    "response": "“They said put my money in bitcoin because dollar inflation would be 7%+ this year, now I’m down 50%” or however it goes",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i90hr41",
                            "author": "thefullmcnulty",
                            "score": -1,
                            "created_utc": 1652832736.0,
                            "response": "“Markets are a mechanism of transferring wealth from the impatient to the patient.”\n\nI’m happily feasting on these cheap sats brought to me by the impatient.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i90nu8k",
                                    "author": "PositiveNewspaper788",
                                    "score": 1,
                                    "created_utc": 1652835602.0,
                                    "response": "I think you mean the other way around",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i90r6uz",
                                            "author": "thefullmcnulty",
                                            "score": 1,
                                            "created_utc": 1652837181.0,
                                            "response": "Fixed. Thanks.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i90oygo",
                                    "author": "chribana",
                                    "score": 1,
                                    "created_utc": 1652836124.0,
                                    "response": "Good quote and thought but think you got it backwards",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i90r0ed",
                                            "author": "thefullmcnulty",
                                            "score": 1,
                                            "created_utc": 1652837098.0,
                                            "response": "I am dyslexic 😂\n\nFixed.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8zkxjs",
                    "author": "carmenvallone",
                    "score": -4,
                    "created_utc": 1652818031.0,
                    "response": "USD isn't an infinite supply though...",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8zmmye",
                            "author": "Western_Boris",
                            "score": 8,
                            "created_utc": 1652818741.0,
                            "response": "Then how is the supply growing all the time?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8zpf54",
                                    "author": "thefullmcnulty",
                                    "score": 11,
                                    "created_utc": 1652819905.0,
                                    "response": "Dollar supply will grow forever as it’s needed. It’s effectively infinite. \n\n“Bitcoin has no top because fiat has no bottom” is the exact same sentiment.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8zw5l8",
                                            "author": "26oclock",
                                            "score": 6,
                                            "created_utc": 1652822725.0,
                                            "response": "It is limited by trust.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8zxkjw",
                                                    "author": "thefullmcnulty",
                                                    "score": 3,
                                                    "created_utc": 1652823338.0,
                                                    "response": "Absolutely. And because fiat dollars can be created forever as needed it’s a system that will lose all trust (aka value) eventually.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8zzgi5",
                                                            "author": "26oclock",
                                                            "score": 2,
                                                            "created_utc": 1652824158.0,
                                                            "response": "But that makes it finite technically.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9019fe",
                                                                    "author": "thefullmcnulty",
                                                                    "score": 2,
                                                                    "created_utc": 1652824962.0,
                                                                    "response": "Treated as infinite until it breaks and that’s what breaks it. \n\nThis isn’t a research paper I’m submitting to Nature lol it’s just a for fun chart I drew in 3 minutes.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9022n9",
                                                                            "author": "26oclock",
                                                                            "score": 3,
                                                                            "created_utc": 1652825322.0,
                                                                            "response": "Sir. Please respect the rules of Reddit that random users can turn anything into an endless lasting discussion",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i902uhr",
                                                                                    "author": "thefullmcnulty",
                                                                                    "score": 2,
                                                                                    "created_utc": 1652825670.0,
                                                                                    "response": "They’re in here acting like the Fed with their never ending pedantic / useless comments to ♾",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8zvtcp",
                            "author": "bitusher",
                            "score": 1,
                            "created_utc": 1652822582.0,
                            "response": "There aren't currently 21 million bitcoins either. The dollar planned inflation schedule like most fiat is infinite overtime as regulators target low continuous inflation. Bitcoins planned disinflationary monetary policy caps out at 21 million. \n\nThe OP isn't suggesting an infinite amount of USD exist today.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i903am2",
                            "author": "parkranger2000",
                            "score": 1,
                            "created_utc": 1652825876.0,
                            "response": "Can you prove it?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8zv9ja",
                    "author": "cookmanager",
                    "score": 1,
                    "created_utc": 1652822352.0,
                    "response": "Clever dog!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i902w0v",
                    "author": "HIMcDonagh",
                    "score": 1,
                    "created_utc": 1652825690.0,
                    "response": "Brilliant",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i904qqx",
                    "author": "soooofa_king",
                    "score": 1,
                    "created_utc": 1652826542.0,
                    "response": "OK I am in!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i90d34t",
                    "author": "daishi55",
                    "score": 1,
                    "created_utc": 1652830466.0,
                    "response": "The supply of dollars is not infinite, what are you talking about? There is a finite number of dollars in existence at any given moment.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i90hbiy",
                    "author": "Ddogg788",
                    "score": 1,
                    "created_utc": 1652832525.0,
                    "response": "Dead on",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i90i00b",
                            "author": "thefullmcnulty",
                            "score": 2,
                            "created_utc": 1652832857.0,
                            "response": "My man! Be well.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i90jwve",
                    "author": "adavoudi",
                    "score": 1,
                    "created_utc": 1652833746.0,
                    "response": "Yep!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8zowez",
                    "author": "Tormian283",
                    "score": -5,
                    "created_utc": 1652819686.0,
                    "response": "holders share of supply only remains proportional if they get that bitcoin after its all been mined, which its not.\n\nAlso USD is not infinite, this post doesnt really make sense",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8zxan7",
                            "author": "bitusher",
                            "score": 2,
                            "created_utc": 1652823220.0,
                            "response": "The OP merely means to suggest that governments monetary policy targets a **continuous** low economic inflation value, and being continuous over time has a target of infinity if we assume an expanding universe which is what the cosmological data supports.   \n\nBitcoins monetary policy targets a disinflationary policy that ends with a cap of 21 million BTC near the year 2140 which means you will always have a proportional amount not being debased over the total planned supply. \n\nI suppose you could suggest that governments might change their policy to target low economic and monetary deflation in the future  or decide to create a cap on fiat supply but the incentives and game theory do not support this is likely.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8zpy0x",
                            "author": "thefullmcnulty",
                            "score": 1,
                            "created_utc": 1652820121.0,
                            "response": "I’m using the total supply cap as my denominator, so percentage of sats held remain proportional relative to 21M. \n\nDollars are infinite as has been demonstrated. No matter what financial crisis happens or what endless war is maintained or how many times the debt ceiling is raised…. There are *always* fiat dollars being created as needed. This is effectively an infinite dollar supply, until the system does eventually break. Which it will, due to its infinite (and unsustainable) nature.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8zsge3",
                                    "author": "Tormian283",
                                    "score": 4,
                                    "created_utc": 1652821162.0,
                                    "response": "that doesnt mean that the current supply is infinite, it just means the total supply on the denominator is going to keep increasing. Just because they can print as much USD as they want, does not mean its currently infinite",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8ztgwf",
                                            "author": "thefullmcnulty",
                                            "score": -1,
                                            "created_utc": 1652821585.0,
                                            "response": ">the denominator is going to keep increasing\n\nIt’s effectively infinite as you admitted yourself.\n\nIt’s also not possible to show with one character that supply will go up forever as needed. \n\n♾ works perfectly in this application and it’s effectively true. \n\n“Bitcoin has no top because fiat has no bottom”\n\nStop being an obtuse pedantic cunt. We all get what’s meant by the symbol.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8zuyrb",
                                                    "author": "Tormian283",
                                                    "score": 5,
                                                    "created_utc": 1652822225.0,
                                                    "response": "no... that is not what infinite means, if it was infinite then any amount of USD would be worth 0 of anything else...\n\n>It’s also not possible to show with one character that supply will go up forever as needed.\n\nexactly! thats why this post makes no sense.\n\nThis post is beginning to look a lot like one of those \"there will only be X bitcoin per person in the world\" or \"1 BTC = 1BTC\" posts. Meaningless and doesn't consider that scarcity is not the only factor when creating value.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8zv3qt",
                                                            "author": "thefullmcnulty",
                                                            "score": -2,
                                                            "created_utc": 1652822285.0,
                                                            "response": "1 BTC = 1 BTC",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8zy06m",
                    "author": "customtoggle",
                    "score": 0,
                    "created_utc": 1652823525.0,
                    "response": "I want that on a tshirt, thanks for the idea 😋",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i90dwgh",
                    "author": "manhattanabe",
                    "score": 0,
                    "created_utc": 1652830861.0,
                    "response": "How about my coin, abecoin.  I made only 10 of them, so\n\nCurrency Unit - 1.   \nCurrency Supply - 10.    \nHolders share of supply remains proportional.   \n\nWhy isn’t everybody running to buy my coin for $1 Zillion ?    \n\nThe answer is that these characteristics are not what gives a coin value.  Value comes from utility, and you can’t buy anything with my coin.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i90etb1",
                            "author": "thefullmcnulty",
                            "score": 3,
                            "created_utc": 1652831302.0,
                            "response": "Nobody is on the AbeCoin network and there is no infrastructure or security or development. It’s fundamentally vulnerable and has no participants and no trust. It’s also got centralized leadership that makes the protocol inherently variable.\n\nBitcoin has none of the fatal flaws and this is exactly why there is only one bitcoin and there will only ever be one bitcoin. It’s launch, fair distribution, lack of leadership, hash security and immutable nature separate it from all other currencies / monetary networks.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8zsiz8",
                    "author": "eatmyassbitchassbich",
                    "score": -5,
                    "created_utc": 1652821193.0,
                    "response": "Thats not true. If you invest your tax free $2k every year into your ira, it offsets inflation.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8ztssl",
                            "author": "AlwaysMooning",
                            "score": 5,
                            "created_utc": 1652821728.0,
                            "response": "If it’s in your IRA, it’s not USD. And you might be offsetting current inflation levels, but you never know when the USD will be Zimbabwe’d.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8zwxs1",
                                    "author": "eatmyassbitchassbich",
                                    "score": 1,
                                    "created_utc": 1652823064.0,
                                    "response": "That makes no sense. IRA are quantified by dollars.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8zy5nn",
                                            "author": "bitusher",
                                            "score": 2,
                                            "created_utc": 1652823594.0,
                                            "response": "Bitcoins are also valued in fiat and gold as well. This doesn't mean that Bitcoin is fiat. An IRA is an account that contains mutual funds, stocks, bonds, exchange-traded funds (ETFs), certificates of deposit (CDs),  money market funds, and even cryptocurrency.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i902dfc",
                    "author": "suuperfli",
                    "score": 1,
                    "created_utc": 1652825458.0,
                    "response": "[try this](https://i.imgur.com/tjG2wzF.jpg)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9066zn",
                    "author": "khedd",
                    "score": 1,
                    "created_utc": 1652827205.0,
                    "response": "Both have their advantages and have their disadvantages. However, for bitcoin “you” don’t need an authority which is quite crucial, and this picture doesn’t reflect that.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i90actn",
                    "author": "phamtruax",
                    "score": 1,
                    "created_utc": 1652829163.0,
                    "response": "Its around 18 million now, about  2million are lost and about a million left to mine",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i90ipkq",
                    "author": "Ddogg788",
                    "score": 1,
                    "created_utc": 1652833198.0,
                    "response": "You too brother",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i90ser9",
                    "author": "Lord_Despair",
                    "score": 1,
                    "created_utc": 1652837749.0,
                    "response": "At this point should the supply really be quoted as 21 million: I remember hearing/reading that like 3 million has been lost.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8zo2q0",
                    "author": "Vigilias",
                    "score": -4,
                    "created_utc": 1652819337.0,
                    "response": "New people are being born, so it's not proportional.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8zp252",
                            "author": "thefullmcnulty",
                            "score": 3,
                            "created_utc": 1652819754.0,
                            "response": "1/21,000,000 remains 1/21,000,000 within the system. Total supply remains the same and so sats held are always the same proportion relative to total supply.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8zrmzf",
                                    "author": "Vigilias",
                                    "score": -1,
                                    "created_utc": 1652820822.0,
                                    "response": "Let's do some quick math.\n\nEarth pop 7753/21\n\nThat's 369 people per Bitcoin. \n\nImagine a population increase of 1%. \n\nNow there are 372 people per Bitcoin. \n\nSo please explain to me how the same proportions are available for people to use?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8zscfe",
                                            "author": "thefullmcnulty",
                                            "score": 5,
                                            "created_utc": 1652821116.0,
                                            "response": "Human per bitcoin has not been brought up once in this entire discussion or in the post. \n\nProportion of total supply by anyone holding bitcoin is the metric. \n\nIf I have 1 bitcoin it will always be 1/21,000,000. Now, tomorrow and in 1000 years.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8zsxx0",
                                                    "author": "Vigilias",
                                                    "score": -1,
                                                    "created_utc": 1652821365.0,
                                                    "response": "Humans increasing per Bitcoin is called deflation. Bitcoins increasing per human is called inflation. \n\nI thought we were having an academic conversation here, but apparently not. I'm not going to answer anymore comments in this thread, you guys go nuts.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8zw8mh",
                                                            "author": "bitusher",
                                                            "score": 0,
                                                            "created_utc": 1652822760.0,
                                                            "response": "You need to separate out the difference between Economic inflation and monetary inflation . \n\nWith fiat currencies you have at least a 2-4% yearly **economic** inflation. (These days its closer to 8-15%) This is because central planners carefully track the economy and constantly try and target devaluing the fiat in the economy. \n\nWith bitcoin there is no group of central planners adjusting inflation like you find in fiat or some altcoins(including the most popular alt). The monetary inflation rate was set in stone in 2009 and remains the same today. Monetarily Bitcoin has a policy of being **disinflationary** till 2140 and than switching to 0 **monetary** inflation. **Economically** bitcoin is sometimes extremely deflationary (bull market) , sometimes mild deflation/or mild inflation (steady market) and sometimes inflationary(bear market). Eventually the goal is to have very steady and mild **economic** deflation(appreciating at 2-4% a year) with bitcoin. For now bitcoin remains volatile.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8zyb5m",
                                                                    "author": "Vigilias",
                                                                    "score": 1,
                                                                    "created_utc": 1652823658.0,
                                                                    "response": "Lol. Ok then.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i8zz4si",
                                                                            "author": "bitusher",
                                                                            "score": 1,
                                                                            "created_utc": 1652824015.0,
                                                                            "response": "New humans being born is a moot issue regardless because the economic target of inflation for governments is always positive thus this simply means governments increase their monetary supply more proportionally as the population increases to insure inflation continues without any maximum cap in fiat unlike Bitcoin. \n\nTo be fair, the OP is assuming that governments will continue to target low inflation and continue to not have a cap which is a safe assumption based upon the incentives and game theory but not known as we cannot predict the future with absolute certainty.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i8zziix",
                                                                                    "author": "Vigilias",
                                                                                    "score": 1,
                                                                                    "created_utc": 1652824183.0,
                                                                                    "response": "You don't have to keep explaining yourself, I'm good.",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "i909c66",
                                                                    "author": "culturedgoat",
                                                                    "score": 1,
                                                                    "created_utc": 1652828679.0,
                                                                    "response": "> With fiat currencies you have at least a 2-4% yearly economic inflation.\n\nWhat about deflationary economies (eg. Japan) where their fiat currency gains value over time? If the key argument for Bitcoin is a hedge against inflation, then I guess it wouldn’t really apply to those folks and they don’t have a pressing need to concern themselves with Bitcoin?",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i90ad2m",
                                                                            "author": "bitusher",
                                                                            "score": 1,
                                                                            "created_utc": 1652829166.0,
                                                                            "response": "Governments usually **target** low inflation these days despite some historical examples of deflationary periods in fiat. Past historical stagflation in Japan wasn't a direct result of targeting deflation either as often crudely simplified. Japan currently has a target of low inflation and not deflationary. Japan does indeed have one of the lowest economic inflation rates in the world however",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i90lze4",
                                                                                    "author": "culturedgoat",
                                                                                    "score": 1,
                                                                                    "created_utc": 1652834725.0,
                                                                                    "response": "Yes, but they’ve thus far failed to turn around deflation for any sustained period. In any case, my question was not about government idealism, it was about the reality for people labouring and earning in such economies: does Bitcoin have any relevance if your fiat currency is not inflationary?",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i90n3no",
                                                                                            "author": "bitusher",
                                                                                            "score": 1,
                                                                                            "created_utc": 1652835255.0,
                                                                                            "response": "Bitcoin has many different properties than fiat and tradeoffs and doesn't principally rely on having a disinflationary monetary policy. One important distinction is the fixed planned monetary policy (regardless what it is) that cannot be manipulated. Another big distinction is the pseudonymous nature of the currency onchain and more privacy on other layers. Another is the reliance of Proof of Work to make it a hard form of money. Another big distinction is bitcoin is a bearer asset instead of registered value like fiat. The list of distinctions is very long.\n\n>Yes, but they’ve thus far failed to turn around deflation for any sustained period\n\nJapan has inflationary quarters more often than deflationary ones and that is if you go by their numbers which under represent inflation",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i8zsl1w",
                                            "author": "Meowseeks",
                                            "score": 2,
                                            "created_utc": 1652821215.0,
                                            "response": "He’s saying that your holdings of Bitcoin can never be debased, unlike with Fiat currencies. Essentially, 1 BTC = 1 BTC",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i903nu4",
                            "author": "parkranger2000",
                            "score": 0,
                            "created_utc": 1652826040.0,
                            "response": "That’s neat they are born owning bitcoin?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i90o4sm",
                    "author": "hcollector",
                    "score": 1,
                    "created_utc": 1652835737.0,
                    "response": "Cringe",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i90oop1",
                    "author": "SquidMcDoogle",
                    "score": 1,
                    "created_utc": 1652835996.0,
                    "response": "Good luck with that.  When we need to burn all those tons of coal for a single transaction...\n\nBitcoin is myspace.  I mean I own a couple thousand, but only to do things with.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8zz6g3",
                    "author": "blackhat8287",
                    "score": 0,
                    "created_utc": 1652824035.0,
                    "response": "~~Holders~~ Hodlers\\* share of supply actually goes up, because people lose coins all the time.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i901t9s",
                            "author": "bitusher",
                            "score": 1,
                            "created_utc": 1652825207.0,
                            "response": "This is true if the hodler does not lose their coins at a proportional rate as everyone else. The crux of the post is focusing on maintaining a somewhat equal proportion of the monetary supply and avoiding being debased. \n\nThus with an estimated 2-4 million BTC lost , and very small amount of BTC expected to be lost/destroyed into the future the rough proportion would be ~1/16 million during our lifetimes per BTC owned",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i90485f",
                    "author": "KabuTheFox",
                    "score": 0,
                    "created_utc": 1652826301.0,
                    "response": "Usd currency supply is currently a bit over $2 trillion\n\nUsd, btc, and basically any kind of currency as we currently use can have an infinite supply",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i905fds",
                            "author": "thefullmcnulty",
                            "score": 0,
                            "created_utc": 1652826851.0,
                            "response": "Hawt take",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i905sj9",
                                    "author": "KabuTheFox",
                                    "score": 2,
                                    "created_utc": 1652827019.0,
                                    "response": "can look up the current usd in circulation and any crypto can have coins added (see luna.x) just like usd can be printed\n\nObviously btc circulation won't increase like luna's but it would be quite strange if the supply had a hard cap of only 21mil even after it reaches it\n\nAnd if you want to get technical btc is near-infinite anyways cause you can just keep adding more decimals, in most instances usd is just 2 decimal places",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i905wfd",
                    "author": "Infamous_Bus1578",
                    "score": 0,
                    "created_utc": 1652827070.0,
                    "response": "#math",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i90mk42",
                            "author": "HotelDefiant6326",
                            "score": 1,
                            "created_utc": 1652834994.0,
                            "response": "That’s why all the so called UFO, or UAF are here, they are here to invest in \nBTC = {better, keep, cash)",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i90ou2q",
                    "author": "bookworm010101",
                    "score": 1,
                    "created_utc": 1652836067.0,
                    "response": "1 has no use case\n\nthe other does",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}