{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "utn8hs",
            "title": "I would like a better way to on ramp.",
            "url": "https://www.reddit.com/r/Bitcoin/comments/utn8hs/i_would_like_a_better_way_to_on_ramp/",
            "author": "chanchanchanchaaan",
            "created_utc": 1653028800.0,
            "score": 8,
            "num_comments": 8,
            "subreddit": "Bitcoin",
            "selftext": "Recently I’ve been buying $100 of bitcoin every week through ramp. It’s what I’ve been using ever since. Yesterday night I was trying to use a new credit card and it caused a failed transaction. Following that came my card that I always use failing because of “suspicious activity.” Ramp then disabled my account and have ignored me ever since notifying me on my account being disabled because I had violated their terms of service. I then decided to use MoonPay and got so frustrated at all my cards being declined. I don’t trust Coinbase and haven’t heard of any other good on-ramps. Is there anything without a KYC that I can use? Or at least anything that isn’t gonna disable my account because of a couple of failed transactions.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9b0weo",
                    "author": "Charming_Sheepherder",
                    "score": 3,
                    "created_utc": 1653036999.0,
                    "response": "Most everyone has a fit over failed transactions.\n\nStrike is ok.\n\nBisq maybe what your looking for.\n\n~~Ive used bitquick too.~~\n\nBitquick seems to have been sold or something",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9atdfw",
                    "author": "SmoothGoing",
                    "score": 2,
                    "created_utc": 1653030296.0,
                    "response": "Credit card has your name on it so you're already identified.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9au01o",
                            "author": "chanchanchanchaaan",
                            "score": 0,
                            "created_utc": 1653030826.0,
                            "response": "And now you know my age.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9ayp94",
                    "author": "Amoci",
                    "score": 1,
                    "created_utc": 1653035015.0,
                    "response": "I always recommend Strike, although KYC is a requirement.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ba9gm",
                    "author": "johnathondeaux",
                    "score": 1,
                    "created_utc": 1653044257.0,
                    "response": "Avoiding KYC to on ramp is very difficult at best if not near impossible. Even when it can be done such as with local bitcoins (I think local bitcoins do kyc now though) or similar sites or with BTC ATMs you are usually paying a premium for your coins.\n\nThe best thing you can do is have a KYCd on ramp (I'm from Europe so I use swissborg) and mix your txs onchain with multiple wallets or put your coins on LN then transfer to a secondary wallet and remove them from LN onto your main wallet.\n\nAlso check out [kycnot.me](http://kycnot.me) if you're determined to find a non kyc onramp.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9bms8r",
                    "author": "nullama",
                    "score": 1,
                    "created_utc": 1653051081.0,
                    "response": "If you're in the US you can use Strike and use the Pay me in BTC feature, basically they give you a bank account number, and you set the % you want converted into BTC.\n\nAny time something lands into that account(your salary for example) it gets converted to BTC (the percentage you chose)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9c9isw",
                    "author": "cookmanager",
                    "score": 1,
                    "created_utc": 1653060660.0,
                    "response": "Bisq",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9cc2d5",
                    "author": "Nada_Lives",
                    "score": 1,
                    "created_utc": 1653061669.0,
                    "response": "Ask yourself if this is caused by:\n\n1. Bitcoin, or\n2. The legacy fiat system.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}