{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "v0uivq",
            "title": "The Central African Republic Clarifies Its Project With Bitcoin – The Goal Is to Become a Model for Africa. President Faustin-Archange Touadéra wants to seize a unique opportunity for a better future.",
            "url": "https://inbitcoinwetrust.substack.com/p/the-central-african-republic-clarifies",
            "author": "sylsau",
            "created_utc": 1653894628.0,
            "score": 62,
            "num_comments": 15,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "iaiqdrc",
                    "author": "coinfeeds-bot",
                    "score": 4,
                    "created_utc": 1653894902.0,
                    "response": "tldr; Central African Republic President Faustin-Archange Touadéra has made Bitcoin an official currency in his country. The country is ranked 188th out of 189 on the UN Human Development Index. Only 1 million people out of 5 million inhabitants in the Central African Republic have Internet, while only 1 in 6 people have access to electricity regularly.\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR.*",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iajen08",
                            "author": "Herosinahalfshell12",
                            "score": 1,
                            "created_utc": 1653914658.0,
                            "response": ">Only 1 million people out of 5 million inhabitants in the Central African Republic have Internet, while only 1 in 6 people have access to electricity regularly.\n\nOh well this is going to go just swimmingly",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iajqpmd",
                                    "author": "solomonsatoshi",
                                    "score": 3,
                                    "created_utc": 1653921047.0,
                                    "response": "It might do if it attracts sufficient investment capital to develop the infrastructure required. A similar program as El Salvador offering investors residency and zero income and CG taxes is being proposed. There are people with considerable Bitcoin capital looking for jurisdictions where they will be encouraged and able to develop Bitcoin based business models. If this can succeed it would demonstrate an alternative to the many other nations languishing under the current fiat institutional structures that have failed these countries in most cases. CAR has incredible wealth in natural resources but has not had the support structures in place to realise that wealth to benefit its people - instead those natural resources have been extracted by foreign powers and the CAR people and infrastructure left in ruins. What do such countries have to lose by trying an alternative now offered by the El Salvador model of freeing themselves from the IMF and World banks which are subservient to imperialist governments and corporates?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iakemf5",
                                            "author": "BrofessionalRetard",
                                            "score": 1,
                                            "created_utc": 1653931797.0,
                                            "response": "Uhh, why would anybody invest in something which is basically guaranteed a negative ROI?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iakfh5e",
                                                    "author": "VirtualityReal",
                                                    "score": 1,
                                                    "created_utc": 1653932176.0,
                                                    "response": "Yes, average African who earns $5 a month will invest.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iakhk1b",
                                                            "author": "BrofessionalRetard",
                                                            "score": 1,
                                                            "created_utc": 1653933103.0,
                                                            "response": "They were talking about attracting rich foreigners to invest. But your point still stands, these people are poor as fuck, so why would anybody invest there?",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "iakkeoi",
                                                                    "author": "solomonsatoshi",
                                                                    "score": 1,
                                                                    "created_utc": 1653934397.0,
                                                                    "response": "CAR is very wealthy in natural mineral resources. But the governments and infrastructure have been for decades corrupt and inadequate. The currency has been controlled by France and like most of Africa the development and extraction of resources has been dominated by external mostly European imperialists who deliberately manipulate the institutional and financial structures to advance their wealth extraction hegemony. Sound familiar El Salvador, Latin America, in fact most of the third world? Bitcoin can change that.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "iakjxm5",
                                                    "author": "solomonsatoshi",
                                                    "score": 1,
                                                    "created_utc": 1653934181.0,
                                                    "response": "Can you explain exactly what you mean by that?\n\nSilence.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iaj1ji2",
                    "author": "heyhihowyahdurn",
                    "score": 3,
                    "created_utc": 1653904928.0,
                    "response": "Finally the continent is embracing Btc to put a final end to corruption",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iais922",
                    "author": "solomonsatoshi",
                    "score": 6,
                    "created_utc": 1653896513.0,
                    "response": "I  hope  this can work  -  and if the intentions are genuine it has a good chance.\n\nThe reality is that for small nations like El Salvador and CAR the legacy institutions are little more than institutions of maintaining the status quo and subjugating the citizens and governments and sovereignty of the less powerful nations.\n\nEdit- It sounds like already the CAR president has seen the opportunity El Salvadors lead has created and is now following that example. There are probably many leaders in many countries who have long waited for such an opportunity that Bitcoin might now provide.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaj1pxq",
                            "author": "Raj_Taneja",
                            "score": 1,
                            "created_utc": 1653905085.0,
                            "response": "The belief in that opportunity is why Crypto and Web3 will thrive even if it is opposed by the people in power",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iaj23us",
                                    "author": "solomonsatoshi",
                                    "score": 6,
                                    "created_utc": 1653905428.0,
                                    "response": "Most crypto (shitcoins) are worthless scams but IMO Bitcoin definitely has the credibility and integrity to enable freedom from the fiat debt slavery imposed by the likes of IMF, World Bank, French Colonial Legacy and other rent seeking imperialist thugs.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iaj1mai",
                    "author": "Raj_Taneja",
                    "score": 1,
                    "created_utc": 1653904997.0,
                    "response": "This sounds like a good initiative. Hope it gets executed as planned. The majority of the projects don't end up in the way they had initially promoted.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iak9byr",
                    "author": "PV3T",
                    "score": 1,
                    "created_utc": 1653929463.0,
                    "response": "So far, there is neither a positive nor a negative understanding of the Bitcoin policy in the countries that have adopted it. Therefore, in my opinion, it is too early to draw conclusions.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iakcgtz",
                    "author": "Happiness_for_dogs",
                    "score": 1,
                    "created_utc": 1653930845.0,
                    "response": "These “nations” that are adopting btc are some of the worse most corrupt systems of government on earth. But yet the Internet is so “bullish” when this happens",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "v0uffi",
            "title": "The Deflationist Dilemma",
            "url": "https://i.redd.it/ve2qecg2bk291.png",
            "author": "Lemons_for_Sale",
            "created_utc": 1653894216.0,
            "score": 458,
            "num_comments": 86,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "iairxm7",
                    "author": "Wreck556",
                    "score": 75,
                    "created_utc": 1653896230.0,
                    "response": "This would be funny if it were funny",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iajm5oq",
                            "author": "Jjabrahams567",
                            "score": 23,
                            "created_utc": 1653918796.0,
                            "response": "Seriously poor people should just buy more money",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ial8id4",
                                    "author": "TheSubredditPolice",
                                    "score": 2,
                                    "created_utc": 1653945710.0,
                                    "response": "[Have you seen the price of money?](https://www.youtube.com/watch?v=kaoejgnFFP8)",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "iajoc3e",
                            "author": "instakin",
                            "score": 16,
                            "created_utc": 1653919893.0,
                            "response": "It would be better titled The Inflationist Dilemma, because you have no incentive to save money so you better eat while you can.\n\nIt doesn't make sense as the deflationist dilemma. If I save money, and it deflates, then I can eat more food later? If I need food now, of course I'm going to spend money on food now. It's a stupid meme as is.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iakhkab",
                                    "author": "Guartang",
                                    "score": -1,
                                    "created_utc": 1653933107.0,
                                    "response": "But if you eat less food now or consume less then your money is worth more later and you can get more thus the dilemma and why deflation is terrible for an economy and why deflationary currency isn’t a thing.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iakko7u",
                                            "author": "dfunkmedia",
                                            "score": 13,
                                            "created_utc": 1653934517.0,
                                            "response": "During the biggest economic boom in US history, the surge that saw the biggest growth of the middle class, and the biggest upward mobility in US history (post-WW2) our economy was deflationary due to the end of war spending and Bretton-Woods.\n\nThe problem was that the share of wealth taken by the top 1% decreased until the lowly disgusting worthless pig peasants we're keeping 70% of all economic gains during that period.\n\nFortunately Based Greenspan and Bernanke and JPow have fixed that historical error and now 80% of all wealth gains is where it belongs- the richest 1%",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iakl9h7",
                                                    "author": "Guartang",
                                                    "score": 2,
                                                    "created_utc": 1653934786.0,
                                                    "response": "Lol. This comment would be super funny if you weren’t serious.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iaklxyn",
                                                            "author": "solomonsatoshi",
                                                            "score": 1,
                                                            "created_utc": 1653935089.0,
                                                            "response": "Your inability to refute the facts as stated is both both obvious and embarrassing while your feeble attempt to gaslight to conceal your inability to refute the facts is equally pathetic and mildly amusing.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "iakmv5x",
                                                                    "author": "Guartang",
                                                                    "score": 6,
                                                                    "created_utc": 1653935503.0,
                                                                    "response": "Calling our economy deflationary after WW2 is one of the dumbest things I’ve ever heard. We literally had a tiny blip around 1949 where for a moment we had deflation. The rest of the time we’ve had inflation to around 2010. Crediting the post war boom that lasted decades to a tiny blip of deflation several years after the war that didn’t even last a year is just laughably stupid and anybody arguing such cannot be taken seriously.\n\nChart\n\nhttps://www.whitehouse.gov/cea/written-materials/2021/07/06/historical-parallels-to-todays-inflationary-episode/",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "iakogvv",
                                                                            "author": "solomonsatoshi",
                                                                            "score": 1,
                                                                            "created_utc": 1653936233.0,
                                                                            "response": "You fail completely to refute the massive growth in inequality since 1971. Your bad faith argument is based on a false equivalence- effectively diversion from the facts and issues raised.\n\nPrior to 1971 people could still save money in the bank and earn interest higher than the rate of inflation. This gave people the incentive to save and incentive not to take on unnecessary debt.\n\nPost the neoliberal monetarist deregulation of the banking sector that followed abandoning the gold standard in 1971 commercial banks were allowed to advance fiat debt finance toward any purpose, not just productive investments. This has seen a massive increase in the issuance of fiat debt finance toward non productive assets (mostly housing) and an equally massive reduction in the proportion of fiat debt finance toward productive purposes and infrastructure. This has increased the cost of housing and reduced the strength of the productive economy, causing both chronic trade deficits and inflation. The economy has thus been a mongrel hybrid of Keynesian and Monetarist dogma, an expedient and fundamentally dysfunctional and hypocritical mongrel that only serves parasitic debt leveraged speculators and bankers and comes at the expense of everyone else.\n\nBitcoin fixes this by restoring hard money and the incentives to save and have some security and hope, rather than slavery to debt.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "ialy5jj",
                                            "author": "Crawlero",
                                            "score": 1,
                                            "created_utc": 1653958760.0,
                                            "response": "I really wish I could understand whether there is a valid point here, I keep hearing it but I never see any elaboration.  Please define inflation first, so that we know what you are referring to.  \n\nHere is my take, deflation leads to people only spending what they absolutely have to, no one is going to starve themselves to death because they are expecting the currency to moon, they might eat the minimum required for their needs, but not less.  Investments will still be made in profitable businesses, rather than inflation pushing money into unprofitable businesses.  Do you have a specific error in my thinking to point to?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iam00v3",
                                                    "author": "Guartang",
                                                    "score": 1,
                                                    "created_utc": 1653959712.0,
                                                    "response": "For the purposes of this you can think of inflation as your money losing value over time and deflation as gaining value over time. \n\nPeople will certainly pay for food and what they need to stay alive. That’s what you’d do. Now imagine everybody doing that because tomorrow or the next day it will be worth more and they can buy more with it. Our economy consists of millions of jobs that aren’t directly tied to basic needs. You’d have entire industries for leisure and hobbies etc getting absolutely crushed, people losing their jobs who now have less to spend if they would with those with money pinching it. Industries whither and die because they depend on money being spent and people doing things with their money. \n\nThis is a decent read\n\nhttps://www.forbes.com/advisor/investing/what-is-deflation/",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iam2xcl",
                                                            "author": "Crawlero",
                                                            "score": 1,
                                                            "created_utc": 1653961203.0,
                                                            "response": "I suppose if you measure spending on luxury goods, then deflation leads to lower quality of life.  I'm not sure how I feel about this one, I understand it conceptually, but it glosses over the reason inflation has traditionally existed.  Perhaps if inflation was more predictable it would be more clear; under a gold standard its easier to project inflation and that money is pumping a profitable field, under fiat its unknowable how much the money supply is expanding and its going wherever politicians think is right",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "iam36lb",
                                                                    "author": "Guartang",
                                                                    "score": 1,
                                                                    "created_utc": 1653961330.0,
                                                                    "response": "Inflation has been far more manageable since leaving the gold standard. Pre breton woods wasn’t some glorious time for money.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                },
                                                                {
                                                                    "id": "iam3xk4",
                                                                    "author": "Crawlero",
                                                                    "score": 1,
                                                                    "created_utc": 1653961708.0,
                                                                    "response": "Ie. Under bitcoin, we know the inflation is the payment the miners receive for securing the blockchain, and the amount is perfectly predictable.  Whereas the fed had been engaging in pumping asset prices for political reasons (homeowners are the biggest voting block), and there is no one record of where all this money is coming from, where its going, or how much there is.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "ialy84h",
                                            "author": "Crawlero",
                                            "score": 1,
                                            "created_utc": 1653958797.0,
                                            "response": "I really wish I could understand whether there is a valid point here, I keep hearing it but I never see any elaboration.  Please define inflation first, so that we know what you are referring to.  \n\nHere is my take, deflation leads to people only spending what they absolutely have to, no one is going to starve themselves to death because they are expecting the currency to moon, they might eat the minimum required for their needs, but not less.  Investments will still be made in profitable businesses, rather than inflation pushing money into unprofitable businesses.  Do you have a specific error in my thinking to point to?",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iaj75nm",
                    "author": "RandomPlayerCSGO",
                    "score": 75,
                    "created_utc": 1653909626.0,
                    "response": "I wouldn't stop buying food just cause it would be cheaper next year, but I would stop buying random shit I don't need. Inflation promotes consumerism not responsible and rational consumption",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iajwd5h",
                            "author": "RandoStonian",
                            "score": 35,
                            "created_utc": 1653923693.0,
                            "response": "Woah woah woah, are you trying to make the entire economy collapse? \n\nIf you don't buy enough individually wrapped disposable goods, the economy will collapse, and it'll be *your fault* as a consumer for not consuming enough! /s",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iajy8v1",
                                    "author": "RandomPlayerCSGO",
                                    "score": 30,
                                    "created_utc": 1653924552.0,
                                    "response": "Actually there's people who seriously believe that and call themselves economists lol, keynesianism is such bullshit.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iakaebq",
                                            "author": "lordsamadhi",
                                            "score": 2,
                                            "created_utc": 1653929934.0,
                                            "response": "Actually there’s people who seriously believe that and call themselves Dogecoiners.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "ial17sh",
                                            "author": "NishizumiMiho",
                                            "score": 1,
                                            "created_utc": 1653942235.0,
                                            "response": "And sadly that is what thought in most of the Econ class in university/college. I had to learn the Austrian School on my own.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ial5eyv",
                                                    "author": "RandomPlayerCSGO",
                                                    "score": 1,
                                                    "created_utc": 1653944223.0,
                                                    "response": "Same, I go to econ uni in Spain and it's only Keynesianism",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "iak4p1h",
                            "author": "demonDDS_bot",
                            "score": 2,
                            "created_utc": 1653927432.0,
                            "response": "I want to teach people about Bitcoin! Pretty much no one is into it where I moved to.\n\nScares me how little people know about privacy also.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iaiq4zt",
                    "author": "solomonsatoshi",
                    "score": 60,
                    "created_utc": 1653894696.0,
                    "response": "This post is bullshit.\n\nIf you can save and live under fiat you can save and live even better under The Bitcoin Standard.\n\nThe fiat system punishes those who try to save and pushes people toward wasteful unnecessary debt and over consumption.\n\nThe fiat debt slavery cartel is the greatest threat to the environment, society and democracy.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaiwngf",
                            "author": "FarCanary",
                            "score": 26,
                            "created_utc": 1653900471.0,
                            "response": "I think the op is pointing out the absurdity of the fears of deflation.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iajow8f",
                                    "author": "LorkyMX2",
                                    "score": 10,
                                    "created_utc": 1653920169.0,
                                    "response": "If that is the case it makes even less sense, deflation in Austrian economics is fine, it is Armageddon for keynsian fiat inflationpalooza.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iajquov",
                                            "author": "SecondDumbUsername",
                                            "score": 1,
                                            "created_utc": 1653921114.0,
                                            "response": "My thoughts exactly, lol",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "iak41w9",
                                    "author": "humblevladimirthegr8",
                                    "score": 3,
                                    "created_utc": 1653927146.0,
                                    "response": "Yeah a clearer title like \"how inflationists view deflation\" would have prevented a lot of the confusion on this post",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "iaj25ij",
                                    "author": "Remarkable-Cat1337",
                                    "score": 6,
                                    "created_utc": 1653905469.0,
                                    "response": "some people can't see the charade",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "iaj53oh",
                            "author": "BobKurlan",
                            "score": 19,
                            "created_utc": 1653908012.0,
                            "response": "Bitcoin focuses value. You spend thoughtfully rather than thoughtlessly.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iajcgjr",
                            "author": "TrymWS",
                            "score": 3,
                            "created_utc": 1653913312.0,
                            "response": "Not really, it incentivizes saving in assets and investing in a growing economy.\n\nThe fact that you can’t look past saving money or spending money, is a problem with you and not the money.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iajfcmb",
                                    "author": "Plastic_Feedback_417",
                                    "score": 10,
                                    "created_utc": 1653915077.0,
                                    "response": "The world works on incentives. If you ever wonder why you can save but 60% of the country can’t come up with a surprise car repair it’s because of incentives. Fiat incentivized people to spend beyond their means and finance as much as possible. This led to society pushing massive consumerism. \n\nOf course people can always rise above with enough education. But if you want a better society, you have to align the incentives.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iakaou0",
                                            "author": "lordsamadhi",
                                            "score": 1,
                                            "created_utc": 1653930062.0,
                                            "response": "This.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iair1en",
                    "author": "solomonsatoshi",
                    "score": 28,
                    "created_utc": 1653895453.0,
                    "response": "Bitcoin - A solution to epidemic of obesity.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaj6hgv",
                            "author": "aeras1131",
                            "score": 20,
                            "created_utc": 1653909108.0,
                            "response": "Bitcoin- a solution that makes you stop buying dumbcrap. How anti-american of us ;)",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iakfbmx",
                                    "author": "teniceguy",
                                    "score": 4,
                                    "created_utc": 1653932110.0,
                                    "response": "It's Austrian for a reason.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iakfg39",
                                            "author": "aeras1131",
                                            "score": 2,
                                            "created_utc": 1653932163.0,
                                            "response": "The Austrians got me in one.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "iaj42bg",
                            "author": "Get_the_nak",
                            "score": 1,
                            "created_utc": 1653907146.0,
                            "response": "small if true",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iakf8ph",
                            "author": "teniceguy",
                            "score": 1,
                            "created_utc": 1653932073.0,
                            "response": "I think you underestimate fat people's love/addiction to food.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iakl4d0",
                                    "author": "solomonsatoshi",
                                    "score": 2,
                                    "created_utc": 1653934721.0,
                                    "response": "Definitely the composition of modern processed foods is deliberately manipulated to make foods addictive. This cannot be blamed entirely on Fiat Money, but is aggravated by entrenched poverty and feelings of powerlessness and hopelessness in many cases due to multiple causes. One cause is Fiat Money which has substantially reduced peoples financial independence by making saving extremely difficult while debt (slavery) has been made increasingly inevitable. The fiat debt slavery cartel has enslaved billions of citizens and most governments. Bitcoin can fix this sense of powerlessness and restores the incentives to Save and thereby restores and a sense of security and hope.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iaisn7x",
                    "author": "Popular_District9072",
                    "score": 4,
                    "created_utc": 1653896863.0,
                    "response": "trying to save money by buying less junk food",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iajvaj8",
                            "author": "smellyboi6969",
                            "score": 3,
                            "created_utc": 1653923194.0,
                            "response": "Junk food is like the cheapest way to buy calories. Junk food, rice, and beans is all you'd need if you want the cheapest way to buy food to survive.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iak4odr",
                                    "author": "Popular_District9072",
                                    "score": 1,
                                    "created_utc": 1653927424.0,
                                    "response": "I've been thinking more of chains like KFC or McDonald's",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "ialal67",
                                    "author": "redshadow90",
                                    "score": 1,
                                    "created_utc": 1653946734.0,
                                    "response": "Cheapest way to live a short life.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iaj7ilb",
                    "author": "New_Dawn",
                    "score": 4,
                    "created_utc": 1653909892.0,
                    "response": "This is not a real dilemma lol, obviously you just buy some food. I'm guessing it's just some bad satire...",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iajoclv",
                    "author": "Zonnins",
                    "score": 3,
                    "created_utc": 1653919900.0,
                    "response": "This does address a question I’ve had on bitcoin. Assuming bitcoin does become the universal standard of money, how would deflation work. Everything would have to get cheaper every year and everyone would have to get paid less or roughly the same. Raises would likely be very rare. Further, we’d have to move to 100% reserve banking. Watching the new terrible Obi-wan series they talk about transferring credits and I just thought of Bitcoin.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iajvvck",
                            "author": "smellyboi6969",
                            "score": 0,
                            "created_utc": 1653923465.0,
                            "response": "This is why it won't become the universal standard. The economy runs on growth and BTC would promote the opposite. So adopting it would just lead to a massive global economic depression and who would willingly do that? And with the supply capped it would lead to massive inequality. Those that own a small number of BTC would have so much wealth they would choose to hoard it at all costs. How do new entrants get their hands on some BTC? They'd have to work harder and harder to get their hands on what little is being distributed. All fiat are inflationary by design. People don't like inflation but it's necessary for a growing population.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iak5lyh",
                                    "author": "Zonnins",
                                    "score": 3,
                                    "created_utc": 1653927830.0,
                                    "response": "First, once we see the global depression when the dollar crashes it will be hard to argue that the current system of constant boom and bust cycles created by the Fed is better than a global bitcoin standard. It just requires a bit of a shift in our thinking. Future generations will understand easily but we’ll probably sound like our grandparents who talk about inflation and how cheap things use to be. We’ve recently seen the significant declines in flat screen TVs, solar panels, and other products due to productivity increases. I think no one would argue that’s bad. Bitcoin is essentially infinitely divisible so as long as people could provide a valuable service they’d be able to get paid in Bitcoin. I disagree that hard money created income inequality. The current system does that. Due to the constant money printing, people are forced to invest in assets to persevere wealth. Heaven forbid you need those funds during a downturn. Financial assets keep going up while the price of goods for average Americans goes up faster than their wages. Many of these average Americans cant put significant funds into financial assets like the stock market and real estate which has created massive income inequality. I think the top 10% own like 95% of financial assets. We didn’t see this income inequality when we were on the gold standard. We’ve learned that no government can be trusted and that’s why we need a rule based system like Bitcoin.  Bitcoin will be the greatest advocate for income equality our word has ever seen. Yes, early adopters will see a large transfer of wealth to them at first.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "iak7jz0",
                                    "author": "flutecop",
                                    "score": 2,
                                    "created_utc": 1653928676.0,
                                    "response": "BTC wouldn't promote or hinder growth. Economic factors would determine the state of the economy rather than monetary factors. \n\nBTC would inflate or deflate at the rate of economic growth. If the economy grew 2%, Btc would deflate 2%. If the economy contracted 3%, Btc would inflate 3%. (All other factors being equal)\n\nThe capped supply will lead to more equality, not less. Over time Btc will become more distributed as more people adopt it. Hoarders will eventually succumb to the value proposition as the price rises. Eventually they're going to want the mansion and a yacht. Eventually they will die and their Btc will be distributed through their estate.\n\nIf Btc becomes the standard, it is impossible that it doesn't become more distributed.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iajutf7",
                    "author": "qr52",
                    "score": 3,
                    "created_utc": 1653922976.0,
                    "response": "Want to prove this absurd?\n\nPick any asset that appreciates over time.  Do people sell it?   Why?  Why would people sell an asset that keeps going up in value?  Same argument.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iakmyj4",
                            "author": "solomonsatoshi",
                            "score": 1,
                            "created_utc": 1653935544.0,
                            "response": "In olden times, people with hordes of gold, often starved.\n\nNot.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iakg4op",
                    "author": "Devilmay_cry",
                    "score": 3,
                    "created_utc": 1653932466.0,
                    "response": "Bitcoin is deflationary. \nIf money is truly deflationary, \nPeople would only spend on what they truly need.\nThe perpetual cycle of materialism would halt.\nHumankind's carbon footprint would reduce.\nClimate change problem would be solved.\n\nBitcoin solves climate change.\nHence proved.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaj7u52",
                    "author": "Anon_Legi0n",
                    "score": 12,
                    "created_utc": 1653910136.0,
                    "response": "A lot of people in this post didn't get the joke",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaiqjo8",
                    "author": "BTC-maxi",
                    "score": 6,
                    "created_utc": 1653895040.0,
                    "response": "What would you stop buying if you knew it would be 2% cheaper next year?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iairmud",
                            "author": "skazz0r",
                            "score": 3,
                            "created_utc": 1653895973.0,
                            "response": "Toilet paper",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iaj447n",
                                    "author": "Get_the_nak",
                                    "score": 2,
                                    "created_utc": 1653907190.0,
                                    "response": "tooth paste",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iaj6m21",
                                            "author": "aeras1131",
                                            "score": 2,
                                            "created_utc": 1653909208.0,
                                            "response": "a good time.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "iaj46xw",
                            "author": "MrQ01",
                            "score": 1,
                            "created_utc": 1653907253.0,
                            "response": "Nothing stopping you. As if you wouldn't think the same thing next year. Nobody's going to starve themselves to death, nor lose their entire sense of materialism, on the basis that price will keep rising and so never come to a peak.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iajb9hb",
                            "author": "warkidooo",
                            "score": 1,
                            "created_utc": 1653912532.0,
                            "response": "I would stop buying groceries for 1-2 months at once.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iaipr9t",
                    "author": "EremesGuile90",
                    "score": 4,
                    "created_utc": 1653894377.0,
                    "response": "80% food stockpile, 20% investment. And go on with your life.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaixxjw",
                    "author": "Pin_ups",
                    "score": 2,
                    "created_utc": 1653901638.0,
                    "response": "Buy the tool to make food.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iak1h4z",
                            "author": "orange-seltzer",
                            "score": 3,
                            "created_utc": 1653926004.0,
                            "response": "Garden supplies and a house with space for a garden?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iakxezn",
                                    "author": "falling_maple",
                                    "score": 1,
                                    "created_utc": 1653940420.0,
                                    "response": "I think he meant a food replicator.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iajv24o",
                    "author": "MichaelAischmann",
                    "score": 2,
                    "created_utc": 1653923088.0,
                    "response": "Wonderful illustration of how deflation will NOT end economic activity.\n\nIt might end useless consumerism. But healthcare, food, housing, clothing and even amusement will still be paid for. Nobody is gonna postpone a birthday party just because next year you could have a bigger party. Nobody will sleep under a bridge just to sleep in a big villa tomorrow. Nobody will go to a doctor and ask them to fix their broken arm next year.\n\nYou get where I'm going with this.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iak4td3",
                    "author": "tommylouch",
                    "score": 2,
                    "created_utc": 1653927485.0,
                    "response": "Don't wish; do. \"The best way to make your dreams come true is to wake up.\" —Paul Valery",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iakbheo",
                    "author": "nutidizen",
                    "score": 2,
                    "created_utc": 1653930408.0,
                    "response": "Technology is deflationary. Yet you buy new cellphone, you buy new pc, etc...  Deflation is not an issue!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaj7r5v",
                    "author": "Anon_Legi0n",
                    "score": 6,
                    "created_utc": 1653910073.0,
                    "response": "Literally the most retarded assumption economists make about deflation",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iajiref",
                            "author": "MontyChain",
                            "score": 2,
                            "created_utc": 1653917002.0,
                            "response": "Economists get government funding and media presence if they adhere to this assumption. Pretty rational albeit immoral behavior.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iak4c5p",
                            "author": "Gunter5",
                            "score": 1,
                            "created_utc": 1653927273.0,
                            "response": "There are countries that experienced deflation. It's not an assumption",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iak1y6b",
                    "author": "bilabrin",
                    "score": 2,
                    "created_utc": 1653926215.0,
                    "response": "What kind of bullshit is this?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iajqf0v",
                    "author": "diadlep",
                    "score": 1,
                    "created_utc": 1653920904.0,
                    "response": "another word for austrian economist: simp",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iajen89",
                    "author": "PatnarDannesman",
                    "score": 1,
                    "created_utc": 1653914662.0,
                    "response": "You can do both. Buy only what you need. Save the rest.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iak0q8d",
                    "author": "Daikataro",
                    "score": 1,
                    "created_utc": 1653925669.0,
                    "response": "Have you all tried intermittent fasting? Eat one day, fast one month! Cuts down on avocado toast and Starbucks too!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iak1v38",
                    "author": "guido_lois",
                    "score": 1,
                    "created_utc": 1653926177.0,
                    "response": "Currently a lot of people in the UK are dealing with a dilemma between feeding themselves and keeping warm. It’s horrendous for some. Thankfully there is some support from the gov happening now. Not sure if it’s enough for some people on the edge though.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iak7nev",
                    "author": "irResist",
                    "score": 1,
                    "created_utc": 1653928720.0,
                    "response": "you health is the best investment you can possibly make. it does not matter how many sats you stack if you don't take care of number one. Because you will never get to enjoy them if your health is failing.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaknbn9",
                            "author": "solomonsatoshi",
                            "score": 1,
                            "created_utc": 1653935707.0,
                            "response": "Obesity is a silent but growing global pandemic.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iakgzeh",
                    "author": "TheHodlingHermit",
                    "score": 1,
                    "created_utc": 1653932848.0,
                    "response": "Can't save if you're dead. Shush.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iakueip",
                    "author": "UnderwaterCowboy",
                    "score": 1,
                    "created_utc": 1653939004.0,
                    "response": "Garbage.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ialgxrq",
                    "author": "etfche",
                    "score": 1,
                    "created_utc": 1653949897.0,
                    "response": "This is the more reason am onboarding new persons into to this ecosystem.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ialta7i",
                    "author": "bitchipmeister",
                    "score": 1,
                    "created_utc": 1653956280.0,
                    "response": "If Bitcoin wins, you’ll have to use it as your unit of account. \n\nIf it doesn’t, what exactly do you plan on doing?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iak641z",
                    "author": "fnc_pnts",
                    "score": 0,
                    "created_utc": 1653928047.0,
                    "response": "r/finanzen in a nutshell",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ialjgdo",
                    "author": "xiwefe2",
                    "score": 0,
                    "created_utc": 1653951175.0,
                    "response": "There is a button missing for buy AngelBlock NFTs hahaBut seriously jokes aside, ppl from NFT LA were really hyped bout them, and i can see why..allmost all sold out in such bearish conditions..bullish",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}