{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uk7fnc",
            "title": "Is there any way for someone to have access to your BTC wallet without your private key or seed?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/uk7fnc/is_there_any_way_for_someone_to_have_access_to/",
            "author": "redhattime",
            "created_utc": 1651905720.0,
            "score": 3,
            "num_comments": 8,
            "subreddit": "BitcoinBeginners",
            "selftext": "I know there’s tons of ways hackers can get your private key or seed but is it the only way they can get access to your wallet?",
            "stickied": false,
            "comments": [
                {
                    "id": "i7nhuyl",
                    "author": "sciencetaco",
                    "score": 3,
                    "created_utc": 1651907708.0,
                    "response": "No. They need the private key. The key is used to create a digital signature for a transaction. The signature provides mathematical proof that you have the key for the address/transaction without revealing the key itself. Without a valid digital signature the network will reject the transaction.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ujq5th",
            "title": "What's the safest/most economical way to store a couple thousand dollars of Bitcoin?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/ujq5th/whats_the_safestmost_economical_way_to_store_a/",
            "author": "dmantzoor",
            "created_utc": 1651851347.0,
            "score": 33,
            "num_comments": 110,
            "subreddit": "BitcoinBeginners",
            "selftext": "I see many people suggesting these expensive cold wallets and/or safe lock boxes which which i can't seem to justify given my not-so large stake in bitcoin. Are there any more affordable options that will   \nallow me to rest easy?",
            "stickied": false,
            "comments": [
                {
                    "id": "i7kfsin",
                    "author": "CoinCorner_Sam",
                    "score": 31,
                    "created_utc": 1651852076.0,
                    "response": "Most affordable hardware wallet would be a Trezor one (about $50). \n\nThe cheapest option is free - install Electrum or BlueWallet, create a wallet.\n\nA better one involves a Linux distro, called Tails, (preinstalled) Electrum and a USB stick (cheap 8GB USB 3.0) to run the system live from the drive. \n\n\nIn all cases, write the seed words down and store it **(always)** offline. Store your backups at two different places, hidden. Use a passphrase if possible (trezor or Electrum) and store it in a different form.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7l6l2e",
                            "author": "maxell87",
                            "score": 3,
                            "created_utc": 1651863312.0,
                            "response": "when you say stir your backups. are you taking about the “phrases” password? or can you back up the bitcoin somehow incase you loose your wallet or phone with wallet app?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7kvdxs",
                    "author": "0x1a3c3e7",
                    "score": 8,
                    "created_utc": 1651858388.0,
                    "response": "A hardware wallet is your best option.  It's not expensive when you compare the cost to the lifetime of the device and how much coin you plan to buy.  Also it gives you something substantive that you can hold in your hand that physically represents what exists only as data.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7kuy8w",
                    "author": "BlankEris",
                    "score": 9,
                    "created_utc": 1651858205.0,
                    "response": "I would still get a hardware wallet as you need to consider your couple thousand dollar investment being worth much more in the future.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7kuylj",
                    "author": "kilingangel",
                    "score": 6,
                    "created_utc": 1651858209.0,
                    "response": "Um you did say ‘couple’ ‘thousand’ dollars worth of btc so how does that not justify the price for one?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7kxxyc",
                    "author": "DanCryptoMan",
                    "score": 5,
                    "created_utc": 1651859477.0,
                    "response": "If you have $3000 ... 3% is 90... Is a one time 3% fee worth keeping you assets completely safe? Is 3% worth the piece of mind? \n\n...$90 is nothing in comparison to what you stand to lose by not keeping your money safe on a hard wallet.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7kjw31",
                    "author": "IEatYouSleep",
                    "score": 12,
                    "created_utc": 1651853706.0,
                    "response": "How is a 50-150 dollar hardware wallet not a good investment to stash thousands?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7lh5mq",
                            "author": "1800smellya",
                            "score": 22,
                            "created_utc": 1651868191.0,
                            "response": "Beginner sub does beginner things. \n\nEducate our new friends. Don’t be condescending. Help them see the way",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i7l11cb",
                            "author": "Trayf",
                            "score": 3,
                            "created_utc": 1651860830.0,
                            "response": "Especially when it may someday be worth tens of thousands.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "ujjp6x",
            "title": "Teach me how to off-ramp BTC",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/ujjp6x/teach_me_how_to_offramp_btc/",
            "author": "iannaibanana",
            "created_utc": 1651829970.0,
            "score": 23,
            "num_comments": 24,
            "subreddit": "BitcoinBeginners",
            "selftext": "Want to use BTC to pay for my overseas monthly mortgages.  Want to get your opinions on what's the cheapest and quickest options. \n\nFrom Hong Kong and paying for mortgages in UK (GBP) and NZ (NZD).",
            "stickied": false,
            "comments": [
                {
                    "id": "i7jy23t",
                    "author": "bennyroc190",
                    "score": 27,
                    "created_utc": 1651844740.0,
                    "response": "Good try IRS",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7kt3oz",
                    "author": "nitra007",
                    "score": 7,
                    "created_utc": 1651857428.0,
                    "response": "Best bet would be to get your mortgage payment receiver to accept it in BTC \n\nYou send directly to them",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7kz52f",
                            "author": "Fair_Command_9861",
                            "score": 3,
                            "created_utc": 1651859995.0,
                            "response": "I think so",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7jb8fe",
                    "author": "MaxSan",
                    "score": 5,
                    "created_utc": 1651831339.0,
                    "response": "Depends on the amount?",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ukdf71",
            "title": "What’s the best way to get leveraged in bitcoin?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/ukdf71/whats_the_best_way_to_get_leveraged_in_bitcoin/",
            "author": "Various_Ad_31",
            "created_utc": 1651930478.0,
            "score": 11,
            "num_comments": 21,
            "subreddit": "BitcoinBeginners",
            "selftext": "I mean deposit BTC as collateral and get Fiat to my bank account.",
            "stickied": false,
            "comments": [
                {
                    "id": "i7odd80",
                    "author": "bitusher",
                    "score": 10,
                    "created_utc": 1651931114.0,
                    "response": "\nlending out your Bitcoin is extremely dangerous and falls under one of these 3 categories:\n\n1) They lend out your BTC for X months to risky clients and at best you have tax complications and privacy problems and at worst might lose everything. Most of these lending platforms are likely fractional. You can also get margin called on short notice and need to immediately settle the loan \n\n2) They are are ponzi scheme , create a sketchy ICO from nothing , steal your BTC and replace it for this ICO token to \"stake\" and earn interest where they can pay older investors with new victims . They need a constant supply of new investors or \"stakers\" in their scamcoin to keep the whole scheme going or everything falls apart\n\n3) They are a straight up scam and will just steal your money\n\nAt minimum there is privacy and tax complications from staking/lending your bitcoin\n\nThan there are issues where data breaches lead to risks of you being targeted by hackers who will phish you or worse those that want kidnap you and torture you for your coins\n\nhttps://blockfi-s3-static-prod.s3.amazonaws.com/pdf/Incident+Post+Mortem%2C+May+14%2C+2020.pdf\n\nThan the custodian can get hacked(sometimes the employees or owners are the ones who perform the theft) like celsius who lost 50 million and you have a Mtgox scenario\n\nhttps://cointelegraph.com/news/crypto-lending-firm-celsius-reportedly-affected-in-badgerdao-exploit\n \nAnother issues is many of these services are likely fractional thus you are diluting the supply of your assets by using them and thus decreasing the ability for your investment to appreciate in value\n\n\n\nIf you need fiat than why not just sell some of your bitcoin?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7p3g9g",
                    "author": "nationshelf",
                    "score": 3,
                    "created_utc": 1651943069.0,
                    "response": "Unchained Capital multisig collateralized loans",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uk6t4f",
            "title": "What should I keep safe so my wallet doesn't get hacked?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/uk6t4f/what_should_i_keep_safe_so_my_wallet_doesnt_get/",
            "author": "Tacc63x",
            "created_utc": 1651903132.0,
            "score": 8,
            "num_comments": 43,
            "subreddit": "BitcoinBeginners",
            "selftext": "I've only invested $100 and I've written down the 12-word recovery phrase that Wasabi Wallet gave me. \n\nI understand that it is just as important to keep your private key safe. \n\nAs long as I don't directly send my private key to anyone and make sure my computer is not hacked/breached, then is it even possible for anyone to have access to my private key? \n\nI do plan on moving onto a hardware wallet in the future. Thanks for any help.",
            "stickied": false,
            "comments": [
                {
                    "id": "i7odaxj",
                    "author": "blaze1234",
                    "score": 5,
                    "created_utc": 1651931081.0,
                    "response": "Never digitise your Seed Recovery information, except to a hardware wallet or other dedicated airgapped device. Certainly never on anything capable of connecting to the internet.\n\nEtched onto steel plates, stored in multiple secure locations far from home, secure passphrase separately from 24-word mnemonic",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7ncwe8",
                    "author": "marshyr3d1and",
                    "score": 4,
                    "created_utc": 1651903710.0,
                    "response": "You've not got your keys on your computer have you?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7nubg0",
                    "author": "Milk77cookies",
                    "score": 11,
                    "created_utc": 1651918820.0,
                    "response": "Put your seed on a metal plate and dig a hole in your garden with a cross saying rex , people will think you had a dog 👩🏼‍💻",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uk0250",
            "title": "Question on how to use Ledger Nano S",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/uk0250/question_on_how_to_use_ledger_nano_s/",
            "author": "icocode",
            "created_utc": 1651879124.0,
            "score": 5,
            "num_comments": 22,
            "subreddit": "BitcoinBeginners",
            "selftext": "I got my first hardware wallet a few days ago, a Ledger Nano S. Kinda excited to try it, but I have a couple of questions.\n\n1. Is it safe to use the hardware wallet connected to a relatively unsecured computer? (Nothing crazy, it's got antivirus on it and all the updates, but it's Windows and used online daily.) Or would it be better to use the HW wallet with an Android phone maybe?\n\n2. Am I good if I use my hardware wallet as Ledger's tutorials instruct, connecting it to the computer via a USB? The reason I'm asking is I saw this thread earlier: [https://www.reddit.com/r/Bitcoin/comments/u7wrwk/this\\_is\\_honestly\\_the\\_most\\_practical\\_way\\_to\\_use\\_a/](https://www.reddit.com/r/Bitcoin/comments/u7wrwk/this_is_honestly_the_most_practical_way_to_use_a/) and there's a lot of talk about only ever using the hardware wallet in airgapped mode. I am not sure if Nano S can even be used in an airgapped mode; plus, it came without a sticker because apparently the Ledger Live app is meant to scan the device to confirm it's not been tampered with. What's the safest way to proceed from here? What level of security can I expect if I'm using Ledger Live with a not particularly secure computer?\n\nMany thanks in advance for any insight. And a thank you to all who help in this subreddit, you guys are amazing.",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uk40r9",
            "title": "Question regarding labels for receive adresses",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/uk40r9/question_regarding_labels_for_receive_adresses/",
            "author": "Tacc63x",
            "created_utc": 1651892320.0,
            "score": 3,
            "num_comments": 14,
            "subreddit": "BitcoinBeginners",
            "selftext": "Just to be clear, I am not a gambler but I had some money in an online casino account that I let sit there because I didn't want to go through the hassle of withdrawing it in crypto. Now that I've taken a bit of an interest in crypto I decided to withdraw it today.\n\nI just submitted a request to withdraw some money from an online casino into my wallet. I use Wasabi Wallet and when I create a receive address it requires me to create a label. When I withdrew it from the casino site it did not ask me to put in the label. Are labels required for transactions? Because I still put it under the \"comments\" tab and stated, \"the label is: money from wildcasinos\".\n\nsorry I'm sorta paranoid about this sorta stuff",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uj2dib",
            "title": "Can someone pls explain to me when we use the cold wallet and when we use the hot wallet?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/uj2dib/can_someone_pls_explain_to_me_when_we_use_the/",
            "author": "Several-Ad7828",
            "created_utc": 1651771259.0,
            "score": 5,
            "num_comments": 21,
            "subreddit": "BitcoinBeginners",
            "selftext": "I was reading some article talking about how is now during the economic crisis smart to invest in three assets Bitcoin, gold, and oil, and how some platform Duet Protocol provides all these three assets and so on and on, but I was pretty confused when they mentioned cold and hot wallet.   \n\n\nOfc I Googled it and okay one is used when you are online (hot), one when you're offline (cold), the first one is for frequent use and the second is for everyday use and that's all I figured it out lol.  \n\n\nHow do you even choose a wallet? Do you have any advice on how should I know which one to choose?  \n\n\nI've heard that there are like desktop wallets, mobile wallets, web wallets, hardware wallets, etc.   \n\n\nI must admit that when you're a newbie here everything seems confusing, how long did you guys take to figure all this out?",
            "stickied": false,
            "comments": []
        },
        {
            "id": "ukhm6v",
            "title": "What is Satoshi Nakamoto’s Bitcoin address?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/ukhm6v/what_is_satoshi_nakamotos_bitcoin_address/",
            "author": "SwurveMan",
            "created_utc": 1651942995.0,
            "score": 53,
            "num_comments": 27,
            "subreddit": "BitcoinBeginners",
            "selftext": "And where can you see the many bitcoins he is supposed to have?",
            "stickied": false,
            "comments": [
                {
                    "id": "i7p5lhg",
                    "author": "bitusher",
                    "score": 40,
                    "created_utc": 1651944009.0,
                    "response": "Satoshi having 1 million BTC is a myth created by sergio which was quickly shown to be flawed and contradictory.\nHere is Sergio's original post - \n\nhttps://bitcointalk.org/index.php?topic=175996.msg1832533#msg1832533\n\nand followup\n\nhttps://bitcointalk.org/index.php?topic=178629.0\n\nWhere Greg and others point out flaws in his research and how some of it is self contradictory \n\nHere is Bitmex's follow up research on the matter - \n\nhttps://blog.bitmex.com/satoshis-1-million-bitcoin/\n\n>In conclusion, although there is strong evidence of a dominant miner in 2009, we think **the evidence is far less robust than many have assumed.** Although a picture is worth a thousand words, sometimes pictures can be a little misleading. Even if one is convinced, the evidence only supports the claim that the **dominant miner may have generated significantly less than a million bitcoin in our view. Perhaps 600,000 to 700,000 bitcoin** is a better estimate.\n\n>**None of the above says much about whether the dominant miner was Satoshi**, although we know Satoshi mined block 9, which we have allocated to the dominant miner in our analysis. **However this is in a slope of just 11 blocks, so it’s certainly not conclusive**. Whoever the dominant miner was, it is of course **possible the keys have been lost or discarded by now**.\n\nThus block 9 and genesis block was created by Satoshi 100%, and the evidence reflects he might have mined 11 blocks at least in addition to the genesis under these assumptions .\n\nThis means the evidence suggests we definitely know satoshi mined 2 blocks , and likely mined 11 blocks, and that **perhaps** there was a dominant miner who mined between 600-700k bitcoin(not blocks). **There are other explanations for the extranonce pattern that do not point to a dominant miner. Simply a similar software setup can cause this.**\n\nSince there was over 5 days between the genesis block being mined and block 1 and difficulty was 1 it would be safer to assume satoshi waited for other miners to start mining before joining in .\n\nHere are examples of at least 2 early miners mining alongside satoshi from the start \n\nhttps://stephanlivera.com/episode/314/\n\nhttps://twitter.com/halfin/status/1110302988\n\n--------------------\n\n>What is Satoshi Nakamoto’s Bitcoin address?\n\nPeople tip satoshi to the genesis block address. Even though he cannot spend(there is serious doubts he is still alive) the 50 BTC from the genesis block he can still spend any tips sent to it. \n\nhttps://live.blockcypher.com/btc/address/12c6DSiU4Rq3P4ZxziKxzrL5LmMBrzjrJX/\n\nYou can see he received 1.34834495 btc over the years to this address and none of the tips spent",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7p69fx",
                    "author": "bitusher",
                    "score": 30,
                    "created_utc": 1651944305.0,
                    "response": "Do not type your seed phrase in the comments or ever enter them into any website , the other comment has been removed and Ill message them to not make jokes like this as some people are dumb enough to fall for it",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7p3a09",
                    "author": "AutoModerator",
                    "score": 7,
                    "created_utc": 1651942996.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7qnk75",
                    "author": "nullama",
                    "score": 7,
                    "created_utc": 1651969243.0,
                    "response": "> What is Satoshi Nakamoto’s Bitcoin address? \n\nThis is the genesis block, where Bitcoin started from Satoshi Nakamoto's computer: 12c6DSiU4Rq3P4ZxziKxzrL5LmMBrzjrJX\n\nYou can see it in any explorer, like this one: https://blockchair.com/bitcoin/address/12c6DSiU4Rq3P4ZxziKxzrL5LmMBrzjrJX\n\n> where can you see the many bitcoins he is supposed to have?\n\nYou can't.\n\nYou can have thousands of independent addresses, each one with different amounts of bitcoin.\n\nIn your wallet(s) you see all of them together, but for an outsider they can't know they belong to one person.\n\nThe most symbolic address would be Genesis, which definitely belongs to Satoshi Nakamoto",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7qqi7y",
                            "author": "GabrielT007",
                            "score": 6,
                            "created_utc": 1651970797.0,
                            "response": "Why so many people keep sending btc to that address?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7sfgja",
                                    "author": "bitusher",
                                    "score": 3,
                                    "created_utc": 1652012389.0,
                                    "response": "They are grateful for Bitcoin and want to tip him , buts its more of a proof of burn address that essentially becomes a tip to all bitcoin users as those bitcoin will likely never be spent",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i7s0slq",
                    "author": "Left_Iron3305",
                    "score": 3,
                    "created_utc": 1652000465.0,
                    "response": "You want to bribe him back to the surface?",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uk3az7",
            "title": "Transferred a small test amount last night from Coinbase to Ledger for 1st time. Coinbase shows transfer completed. Money still not in my wallet. Is this normal? Should I jabbed CB-CB Pro-Ledger?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/uk3az7/transferred_a_small_test_amount_last_night_from/",
            "author": "is300wrx",
            "created_utc": 1651889834.0,
            "score": 23,
            "num_comments": 29,
            "subreddit": "BitcoinBeginners",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i7mqm9u",
                    "author": "bitusher",
                    "score": 10,
                    "created_utc": 1651890127.0,
                    "response": "Are you using ledger live with the ledger HW wallet?\n\nIs this a bitcoin transaction?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7mqp1f",
                            "author": "is300wrx",
                            "score": 3,
                            "created_utc": 1651890166.0,
                            "response": "Yes-using Ledger live. This is for Bitcoin",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7mqqdg",
                                    "author": "bitusher",
                                    "score": 5,
                                    "created_utc": 1651890186.0,
                                    "response": "Have you looked up the receive address in a block explorer like blockstream.info?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i7mt001",
                                            "author": "is300wrx",
                                            "score": 3,
                                            "created_utc": 1651891369.0,
                                            "response": "I checked on blockchain and my ledger address matched correctly on the site. Shows “Unspent”?  Nothing shows on my ledger",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i7mtmhj",
                                                    "author": "bitusher",
                                                    "score": 6,
                                                    "created_utc": 1651891699.0,
                                                    "response": "You placed your address you gave coinbase to send to your ledger live in a block explorer and see the transaction as unconfirmed with the exact same amount you requested to withdraw?\n\nHave you checked in another explorer like blockstream.info?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i7mw0ej",
                                                            "author": "is300wrx",
                                                            "score": 14,
                                                            "created_utc": 1651892978.0,
                                                            "response": "I had to delete the cache and the deposit showed. Thank you for your help",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i7mwbx8",
                                                                    "author": "bitusher",
                                                                    "score": 5,
                                                                    "created_utc": 1651893152.0,
                                                                    "response": "great , cheers",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                },
                                                                {
                                                                    "id": "i7nlbug",
                                                                    "author": "Weak_Mastodon_8547",
                                                                    "score": 3,
                                                                    "created_utc": 1651910698.0,
                                                                    "response": "Ha sounds like you figured it all out properly. FYI the longest any wallet/exchange whatever should take to indicate a balance is after 6 block confirmations.\n\nIn many cases you'll see the balance prior to that although may be unable to spend.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}