{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uwo0sq",
            "title": "International tour and travel agency in Pitampura Delhi.",
            "url": "https://v.redd.it/x8mr4zl3me191",
            "author": "ajaykumar02",
            "created_utc": 1653389533.0,
            "score": 1,
            "num_comments": 0,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uwo1y7",
            "title": "Is bear mode is still active",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uwo1y7/is_bear_mode_is_still_active/",
            "author": "MeasurementMoist9503",
            "created_utc": 1653389659.0,
            "score": 6,
            "num_comments": 10,
            "subreddit": "Bitcoin",
            "selftext": "i want to buy some bitcoin but not sure which buy level is good",
            "stickied": false,
            "comments": [
                {
                    "id": "i9sm27b",
                    "author": "midastouch900",
                    "score": 8,
                    "created_utc": 1653391400.0,
                    "response": "It seems like a more ideal buy level was always 4 years ago. So in 2026, today will probably seem like a good buy level.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9sjqyk",
                    "author": "PurpleIodine4321",
                    "score": 3,
                    "created_utc": 1653389757.0,
                    "response": "If you want short term gain, it’s too uncertain. Long term gain = buy whenever",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9sjw6g",
                    "author": "PackLongjumping4935",
                    "score": 2,
                    "created_utc": 1653389865.0,
                    "response": "DCA.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9sl3d2",
                    "author": "Independent-Snow-129",
                    "score": 2,
                    "created_utc": 1653390733.0,
                    "response": "Could you do me a favor and pop a kickflip ?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9so2th",
                    "author": "WhoRDU",
                    "score": 2,
                    "created_utc": 1653392740.0,
                    "response": "Its HOLD mode!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9sq5fc",
                    "author": "VariousTransition795",
                    "score": 2,
                    "created_utc": 1653394022.0,
                    "response": "If you are a trader, then you already know that you may do profits from both bearish and bullish trends since you trade trends.\n\nIf you are an investor, you already know that investing is done over the years (what you invest today will fructify over years).\n\nIf you ask if it is a good time to buy on Reddit (or any other social media), you are probably under educated and should avoid the first option and stick to the second one.\n\nAnd this is my advice about the second one:  \nEducate yourself! Once you'll be able to answer \"is it a good time to buy?\", you'll be ready to spend your hard earn money wisely. Until then, your best investment remains yourself.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9sm3fo",
                    "author": "SeanyBlaze",
                    "score": 2,
                    "created_utc": 1653391423.0,
                    "response": "Look at how long the previous bear markets lasted, we're just getting started. Like most people have said, just DCA and remove the stress.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ssaro",
                    "author": "ApplicationAny1434",
                    "score": 1,
                    "created_utc": 1653395287.0,
                    "response": "Bitcoin activated stablecoin mode.  In 2018 Bitcoin didnt even move 5% up or down for 60 days. Now the same.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ssjqr",
                            "author": "MeasurementMoist9503",
                            "score": 1,
                            "created_utc": 1653395431.0,
                            "response": "appreciate",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9td4xt",
                    "author": "soggypoopsock",
                    "score": 1,
                    "created_utc": 1653405148.0,
                    "response": "Bear is the best time to buy just stay focused on DCA and don’t dump too much in at 1 time. Expect that it could go up, but also could go lower. Buying in chunks means you’ll have more cash on hand if the price dips further. \n\nFor example I’d take the cash i want to put in this year, split it into like 20 different allotments and execute 1 buy every week or 2",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uwnxwe",
            "title": "Blockchain.com Security Flaw",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uwnxwe/blockchaincom_security_flaw/",
            "author": "Janeenrai",
            "created_utc": 1653389210.0,
            "score": 4,
            "num_comments": 11,
            "subreddit": "Bitcoin",
            "selftext": " Hello Redditers. \n\nToday I informed [u/blockchainwallet](/user/blockchainwallet) that I had found two significant security flaws within their systems. Both of these exploits are substantial and would be extremely damaging to their brand should they get into the wrong hands. These exploits put both customers crypto holdings and privacy at risk. \n\nI have given [Blockchain.com](https://blockchain.com/) 7 days to respond and fix these issues. Once this time has passed, I plan to share my findings publicly and alert any customers who are at risk. \n\nI hope they will do the right thing and fix these asap.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9ssrjc",
                    "author": "Mallardshead",
                    "score": 3,
                    "created_utc": 1653395556.0,
                    "response": "Terrible company. Just awful. They almost make Binance look good.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9sk7pk",
                    "author": "Independent-Snow-129",
                    "score": 0,
                    "created_utc": 1653390097.0,
                    "response": "Why do you trust them more than the users ?   They could just find a new exploit in the exploit you found, and use it for their own benefit ?\n\n(I am just theorizing and not giving advices) Wouldn't it be wiser to *hack* them, they fix it , you give back or *unlock* what you *hack*  ?\n\nOp you could have a random accident and the site gets randomly hack ? ( Too much trust )\n\n&#x200B;\n\n**Overall,  I believe your post is FUD and has nothing to do with bitcoin!**",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ssjdo",
                            "author": "DGimberg",
                            "score": 2,
                            "created_utc": 1653395425.0,
                            "response": "It would still be criminal if he used the expliot and then held that sum as a \"ransome\". \n\nBut I know that it's  extremely frustrating when they don't seem to take the information seriously so you just want to show them why they need to take it seriously.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9sz26f",
                                    "author": "Janeenrai",
                                    "score": 1,
                                    "created_utc": 1653398854.0,
                                    "response": "I am an ethical person. I do not want to put customers of their products through the pain of seeing their accounts hacked or personal data exposed.\n\n  \nInstead what I have done is identified the accounts of senior Blockchain staff members. Once the 7 days are up I will use the exploits on the staff accounts as proof of its impact. I will then give them another 3 days to fix and return the funds in full if they solve the problem. \n\n  \nI have also offered to submit these exploits for a bug bounty and to sign an NDA and talk them through the whole process step by step if they agree to sign a confidentiality agreement that protects me from prosecution.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9t2j4r",
                                            "author": "Independent-Snow-129",
                                            "score": 1,
                                            "created_utc": 1653400521.0,
                                            "response": "How do you know this exploit wasn't already known by them ?  Being ethical doesn't mean giving yourself to the wolves .\n\n**If true** . Great catch nonetheless !",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9sty3i",
                                    "author": "Independent-Snow-129",
                                    "score": 0,
                                    "created_utc": 1653396218.0,
                                    "response": "(I am just theorizing and not giving advices) : You  could secure (*you can analogically think of  the term hot-fix)* the exploit without them even knowing about it and without transferring any funds, learn their behavior  !\n\nIn the end if you follow logic , you can evaluate how to communicate to the public and how to avoid these vulnerability while keeping a physical security leverage and potentially avoid a bad actor to use this for their own personal goals.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9vhq6z",
                            "author": "AAAQualityPoster",
                            "score": 1,
                            "created_utc": 1653438072.0,
                            "response": "On the contrary, what he stumbled upon is nothing compared to the security flaws exposed by Edward Snowden and Bruce Schneier about 6 months. Not only is block chain not secure, but privacy on Bitcoin is not at all guaranteed. These issues were well-documented at r/privacyselfdefense not long ago and here is just some of what I found at this above sub;\n\n[https://bcn.social/2022/03/18/snowden-discusses-bitcoins-lack-of-privacy/](https://bcn.social/2022/03/18/snowden-discusses-bitcoins-lack-of-privacy/)\n\n[https://www.wired.com/story/theres-no-good-reason-to-trust-blockchain-technology/](https://www.wired.com/story/theres-no-good-reason-to-trust-blockchain-technology/)\n\nRead for yourself, I am just the messenger.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9t625y",
                    "author": "cpt_charisma",
                    "score": 1,
                    "created_utc": 1653402118.0,
                    "response": "So, the industry standard is more like 30 days to fix security issues before disclosure.  While serious security issues *should* be fixed immediately, by providing so little time, you open yourself to liability.  Blockchain may say they were about to fix it, then you caused everyone's accounts to get hacked.  The best thing to do is communicate with them to find out how quickly they intend to fix it.  You are doing the right thing by notifying them and providing time to fix the issue.  Keep it up by working toward a solution that keeps everyone's funds safe.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9tk4xq",
                            "author": "Janeenrai",
                            "score": 0,
                            "created_utc": 1653408059.0,
                            "response": "Thank you. Very fair remarks around the time scales. If they respond to me to say they are working on it I will give them more time but these are pretty critical and they should really fix these urgently.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9tj69s",
                    "author": "Nada_Lives",
                    "score": 1,
                    "created_utc": 1653407665.0,
                    "response": "[Blockchain.com](https://Blockchain.com) is a commercial fiat franchise, not a part of Bitcoin. \n\nAnybody remember MtGox? You couldn't have stopped their mis-management with a howitzer.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9tkbz2",
                            "author": "Janeenrai",
                            "score": 1,
                            "created_utc": 1653408139.0,
                            "response": "One of the exploits is for their private key wallet access which is a un hosted wallet product  :(",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "uwo4nr",
            "title": "Consumer group: New Yorkers need prudence, not bans, on Bitcoin and cryptocurrency mining",
            "url": "https://consumerchoicecenter.org/new-yorkers-need-prudence-not-bans-on-bitcoin-and-cryptocurrency-mining/",
            "author": "ciceroson",
            "created_utc": 1653389945.0,
            "score": 20,
            "num_comments": 3,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9thkbz",
                    "author": "Nada_Lives",
                    "score": 3,
                    "created_utc": 1653407000.0,
                    "response": "Prudence? New York? Your betters don't WANT you to use Bitcoin. They want Bitcoin to die and go away.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9u6z56",
                    "author": "AntonNonymous",
                    "score": 1,
                    "created_utc": 1653417462.0,
                    "response": "It's good to see people (slowly) coming to the right conclusions",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}