{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ux3kwl",
            "title": "Lyn Alden on Nation State Bitcoin Adoption",
            "url": "https://youtu.be/LtivcluufoI",
            "author": "undertheradar48",
            "created_utc": 1653433567.0,
            "score": 57,
            "num_comments": 14,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9wpcty",
                    "author": "MrDopple68",
                    "score": 11,
                    "created_utc": 1653462546.0,
                    "response": "Why should anyone give a shit what Lyn looks like?\n\nShe's a macro economist not a reality TV star.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9wihio",
                    "author": "FlipnHodl",
                    "score": -21,
                    "created_utc": 1653457299.0,
                    "response": "Lyn Alden could do well with a makeover. She’s so brilliant and composed. She should be the face of this generation of macro investors but you either need to be outlandish or exceedingly attractive to move into those roles. She has great physical features, why not embellish her looks?  She should be everywhere.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9wjng2",
                            "author": "keanu4EvaAKitten",
                            "score": 18,
                            "created_utc": 1653458125.0,
                            "response": "Look I think your comment comes from a good place but this is fucking superficial bullshit. The only thing that matters is the content of her ideas. If you are interested in something else, go consume a different kind of content.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9wnyrj",
                                    "author": "FlipnHodl",
                                    "score": -9,
                                    "created_utc": 1653461422.0,
                                    "response": "Her content is only as important as its reach. The content won’t change if she’s being more heavily promoted, just more people will hear it.  \n\nI’ll concede that I’m projecting my personal bias of wanting to bring more people into the crypto space through intelligent conversation versus hyperbole. But I also feel like that’s what she’s attempting to do. \n\nIf she’s more interested in promoting androgynous no-makeup culture then I’d fully support her in that, but I’ve never once even heard her mention anything along those lines.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9x54xd",
                            "author": "rqzerp",
                            "score": 5,
                            "created_utc": 1653476159.0,
                            "response": "You superficial twat.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9wkg14",
                            "author": "Wsemenske",
                            "score": 7,
                            "created_utc": 1653458710.0,
                            "response": "Im the opposite. Honestly, her looks are what kept me from not immediately ignoring her. There are \"more attractive\" women in this sphere but their knowledge is often as superficial as their looks.\n\nLyn knows her shit.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9wmsif",
                                    "author": "FlipnHodl",
                                    "score": -5,
                                    "created_utc": 1653460498.0,
                                    "response": "My point is more about her reach. You’re deep in this space if you know who Lyn Alden is. And that’s a shame because she should be the person bringing people into the space. She’s fantastic.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9wngac",
                                            "author": "Wsemenske",
                                            "score": 2,
                                            "created_utc": 1653461012.0,
                                            "response": "No you misinterpret me. I don't listen to people more because they are attractive. And attractive people are not what brought me into Bitcoin. And I honestly think most people are like me, so I don't think it would help her reach.\n\nHer reach is better now than if she was \"hot\". I'd go so far as to say she is the most attractive person in Bitcoin that I listen to regularly.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9wqdzo",
                                                    "author": "FlipnHodl",
                                                    "score": -7,
                                                    "created_utc": 1653463407.0,
                                                    "response": "We’re not gonna reach the masses through bitcoin podcasts. The people listening to those are already bitcoiners. \n\nThe remaining 90% of the population, they’re gonna see Matt Damon, Tom Brady, Ted Cruz…any other cuck who knows next to nothing about bitcoin. Or pick your tv personality who never studied economics or computer science and can’t do more than parrot something they’ve been told about bitcoin.  And that’s who’s going to publicly go toe to toe with the professionals in these established markets that bitcoin is trying to unseat?  \n\nMeanwhile Lyn is a couple of strokes of blush and some mascara away from being the perfect public mouthpiece of crypto and we’re worried about being superficial?  I’d give anything to see her in a big public forum methodically destroying all the FUD anti-bitcoin sentiment spewing from whomever sits across the table. Instead, she’s making the rounds on 20k-subscriber bitcoin podcasts.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9x094d",
                                                            "author": "RealPontifexMaximus",
                                                            "score": 7,
                                                            "created_utc": 1653472251.0,
                                                            "response": "Fuck that noise.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9zi5jv",
                            "author": "3DprintRC",
                            "score": 1,
                            "created_utc": 1653513132.0,
                            "response": "I think she looks great. Fuck makeup.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9znag5",
                            "author": "hyperinflationUSA",
                            "score": 1,
                            "created_utc": 1653515344.0,
                            "response": "You know she's transgender MtF right",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9wsb5u",
                            "author": "bearCatBird",
                            "score": -6,
                            "created_utc": 1653465086.0,
                            "response": "You’re getting downvoted but looks do matter. Superficial or not, humans care about looks.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}