{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ut8aet",
            "title": "More than $200 billion erased from entire crypto market in a day as sell-off intensifies",
            "url": "https://www.reddit.com/r/Bitcoin/comments/ut8aet/more_than_200_billion_erased_from_entire_crypto/",
            "author": "crypto_dispensers",
            "created_utc": 1652980647.0,
            "score": 1,
            "num_comments": 3,
            "subreddit": "Bitcoin",
            "selftext": "Bitcoin went below $26,000 for the first time in 16 months, part of a bigger cryptocurrency sell-off that saw the entire market lose more than $200 billion in a single day. \n\nAccording to Coin Metrics, the price of bitcoin fell to $25,401.29 on Thursday. It's the first time the cryptocurrency has dropped below $26,000 since December 26, 2020.\n\nThoughts?",
            "stickied": false,
            "comments": [
                {
                    "id": "i984fcl",
                    "author": "DES4FIO",
                    "score": 1,
                    "created_utc": 1652980789.0,
                    "response": "Do we Look on the same chart? Because today is a good day",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i984f5a",
                    "author": "wolfofone",
                    "score": 1,
                    "created_utc": 1652980787.0,
                    "response": "Wish I had money to buy more lol.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i984g70",
                    "author": "Skorpex",
                    "score": 1,
                    "created_utc": 1652980799.0,
                    "response": "This post is lazy af",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i984hwo",
                    "author": "Creative-Molasses-60",
                    "score": 1,
                    "created_utc": 1652980817.0,
                    "response": "It’s at 30k ma boi",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ut83lb",
            "title": "On the State of Cryptocurrency’s Libertarian Promise",
            "url": "https://www.cato.org/blog/state-cryptocurrencys-libertarian-promise",
            "author": "BBQCopter",
            "created_utc": 1652980109.0,
            "score": 1,
            "num_comments": 2,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i983tup",
                    "author": "infopocalypse",
                    "score": 1,
                    "created_utc": 1652980551.0,
                    "response": "The article could have gone much further by pointing out all the instances of remittances, people around the world avoiding confiscation or currency collapse of authoritarian regimes, censorship proof payments sent and so on. Price alone isn't an indicator if something works or not.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ut8crl",
            "title": "Action Against YouTube Over BTC Fraud",
            "url": "https://www.reddit.com/r/Bitcoin/comments/ut8crl/action_against_youtube_over_btc_fraud/",
            "author": "throwaway234234348",
            "created_utc": 1652980827.0,
            "score": 3,
            "num_comments": 13,
            "subreddit": "Bitcoin",
            "selftext": "Bitcoin fraud video's are still being featured on YouTube's homepage.\n\nIf you'd like to participate in getting answers as to why this content is being recommended on a massive scale, please message me anytime.\n\nIt's not like this is some obscure website, or a phishing email with 1st grade spelling. I personally haven't even searched for anything related to the content, so my goal is to find out why this stuff was directed to me.\n\n&#x200B;\n\nAll the best.",
            "stickied": false,
            "comments": [
                {
                    "id": "i989m5z",
                    "author": "VariousTransition795",
                    "score": 2,
                    "created_utc": 1652982866.0,
                    "response": "I may sounds silly but...\n\nStop watching Elon Musk content and you'll stop having those reco.\n\nLong story;  \nThose vids are using tags.  When you watch X tag, you'll receive X reco.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i98b0zv",
                            "author": "throwaway234234348",
                            "score": 1,
                            "created_utc": 1652983443.0,
                            "response": "I've never watched nor searched for any content like that. That's the whole reason I can't make sense of this.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i98kycg",
                                    "author": "VariousTransition795",
                                    "score": 2,
                                    "created_utc": 1652987506.0,
                                    "response": "Content is recommended based on what you or any other network user previously watched.\n\nSame goes for any other type of targeted marketing.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i98nwu5",
                                            "author": "throwaway234234348",
                                            "score": 1,
                                            "created_utc": 1652988706.0,
                                            "response": "I understand that's how it's supposed to work, but what I'm asserting is that there might be something else going on.\n\nNo one on this IP address searched for watched content related to this. Lots of fishing and kayaking recommendations; nothing having to do with Tesla or BTC.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i99blzj",
                                                    "author": "BitcoinUser263895",
                                                    "score": 1,
                                                    "created_utc": 1652999824.0,
                                                    "response": "> I'm asserting is that there might be something else going on.\n\nIt's not. It's your recommendations.\n\n> No one on this IP address searched for watched content related to this. \n\nWhen they showed you something and your mouse hovered for a moment on it, the self-reinforcing begins.\n\nShit then you add the fact that Google knows everything about you...",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i99bja0",
                                    "author": "BitcoinUser263895",
                                    "score": 1,
                                    "created_utc": 1652999787.0,
                                    "response": "Click the hamburger menu next to the video and select \"Do not display content from\" or \"I am not interested in\".",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i984nv0",
                    "author": "NiceDoctorBeam",
                    "score": 1,
                    "created_utc": 1652980880.0,
                    "response": "Post it here.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9858ha",
                            "author": "throwaway234234348",
                            "score": 1,
                            "created_utc": 1652981109.0,
                            "response": "I haven't been able to post here using particular words. The bot moderators filter it out before it shows up. In any case, it's been running non stop the past few days, and apparently it's a long standing issue going back several years even.\n\nI'd just never heard of it until this week. I have a few other posts on other subreddits attempting to gather people affected.\n\nMost of the replies have been something to effect of 'your a moron'. And I agree to a fair extent, but I've used YouTube for almost 15 years and this just totally caught me off guard.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i98mmh9",
                    "author": "Hectic-Mind",
                    "score": 1,
                    "created_utc": 1652988177.0,
                    "response": "They're obviously promoting their own crypto scams. Not much else to say...",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i98nlcn",
                            "author": "throwaway234234348",
                            "score": 1,
                            "created_utc": 1652988574.0,
                            "response": "Why I'm concerned is that I don't have any idea why this content was recommended in the first place.\n\nI haven't searched YouTube for content related to Bitcoin or Telsla or anything of the sort. I'm trying to find out how I was targeted specfically.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i99bcxo",
                    "author": "BitcoinUser263895",
                    "score": 1,
                    "created_utc": 1652999704.0,
                    "response": "> why this content is being recommended on a massive scale\n\nStop watching Bitcoin related crap on youtube. There is nothing on there which you can possibly learn anything from.\n\nMy homepage is 100% clean of all Bitcoin content.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i99bukc",
                            "author": "throwaway234234348",
                            "score": 1,
                            "created_utc": 1652999938.0,
                            "response": "That is particularly what is so interesting.\n\nI don't watch anything related to Tesla or Bitcoin on YouTube. I started DCA years ago and haven't even thought it about.\n\nThis was totally out of the blue. I have no idea how or why it was recommended. Granted I should've known better, but YouTube featuring this video was an effective trick.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "ut7zc4",
            "title": "Recently got sent a disturbing email from Gemini...",
            "url": "https://www.reddit.com/r/Bitcoin/comments/ut7zc4/recently_got_sent_a_disturbing_email_from_gemini/",
            "author": "Specialist_Pipe_3998",
            "created_utc": 1652979781.0,
            "score": 13,
            "num_comments": 25,
            "subreddit": "Bitcoin",
            "selftext": "https://www.reddit.com/r/Gemini/comments/usvlny/just_received_a_disturbing_requestemail_from/?sort=confidence\n\nI used coincoin because I value my privacy and I like to experiment and learn inside the bitcoin ecosystem. Gemini apparently didnt like that and is demanding my reasoning for using coinjoin and for proof of my source of income/wealth. \n\nAm I wrong to feel this is crossing the line into an orwellian future? What I choose to do with my UTXOs before/after i purchase/sell them on an exchange should be my right.",
            "stickied": false,
            "comments": [
                {
                    "id": "i987gu9",
                    "author": "Nada_Lives",
                    "score": 15,
                    "created_utc": 1652982010.0,
                    "response": "When faced with a choice in losing you as a customer and losing their license to deal in fiat, they will dump you every time.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9a4ic5",
                            "author": "ducasaurus",
                            "score": 3,
                            "created_utc": 1653014226.0,
                            "response": "This shouldn't be surprising.  \nExchanges are businesses that must follow laws and regulations.  \nThey'll gladly drop you if their ability to operate is under threat.  \n  \nEven the CEO of Kraken warned everyone: https://i.imgur.com/brUJfpx.png  \nSource: https://twitter.com/degderat/status/1494461063080910850",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i98o8ma",
                    "author": "konokonohamaru",
                    "score": 6,
                    "created_utc": 1652988844.0,
                    "response": "Wow, that does seem Orwellian.  Also surprised at how many responses in the Gemini subreddit calling you childish.  I know it's not Gemini's fault, but to me this is enough of a reason for me to get my assets off Gemini and no longer do business with them.  I don't want to show them my bank statements",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i99vcuc",
                            "author": "Specialist_Pipe_3998",
                            "score": 1,
                            "created_utc": 1653009737.0,
                            "response": "Yeah i was quite surprised at the responses i got in that sub. Seems most are okay bending over. Shocking since i thought bitcoiners were into being financial sovereign",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9840sj",
                    "author": "DudeIncogneto",
                    "score": 3,
                    "created_utc": 1652980629.0,
                    "response": "What coinjoin implentation did you use? It is definitely a cross over the line",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i986q3g",
                            "author": "Specialist_Pipe_3998",
                            "score": 2,
                            "created_utc": 1652981711.0,
                            "response": "Wasabi",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i987z0m",
                                    "author": "DudeIncogneto",
                                    "score": 4,
                                    "created_utc": 1652982208.0,
                                    "response": "Unfortunately wasabi has a broken coinjoin implementation that is known to be flagged by exchanges. They also recently announced they are partnering with a chain analysis company to block certain utxos from using their coordinator for reasons that have not been shared with the public.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i99askx",
                                            "author": "BitcoinUser263895",
                                            "score": 3,
                                            "created_utc": 1652999433.0,
                                            "response": "> block certain utxos from using their coordinator for reasons that have not been shared with the public.\n\nlol \"We mix dodgy coins, but only dodgy coins we determine to be clean!!!\"",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i98j5d9",
                                            "author": "Aussiehash",
                                            "score": 1,
                                            "created_utc": 1652986769.0,
                                            "response": "I don't agree with their decision, but FYI there is a recent Stephen Livera Podcast episode with Max Hillebrand",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i98kcpn",
                                                    "author": "DudeIncogneto",
                                                    "score": 1,
                                                    "created_utc": 1652987262.0,
                                                    "response": "I might not have written that last sentence correctly. What I meant was that they have not explained what will cause a utxo to be blacklisted by zksnacks. If they do talk about this in the podcast I will give it a listen.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9aj4qz",
                                                            "author": "Aussiehash",
                                                            "score": 1,
                                                            "created_utc": 1653022624.0,
                                                            "response": "Max said it's a blackbox, all UTXOs are sent to their chainalysis provider, their plan is to only filter the strongest suspicion \"10\" level UTXOs, but he couldn't guarantee that wouldn't change and he did not disclose who the provider is.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9c05uu",
                                                                    "author": "DudeIncogneto",
                                                                    "score": 1,
                                                                    "created_utc": 1653056916.0,
                                                                    "response": "Interesting I will have to give it a listen. Thanks for the explanation",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i985rjj",
                    "author": "NitronBot106",
                    "score": 4,
                    "created_utc": 1652981323.0,
                    "response": "Exchanges are under immense regulatory scrutiny for fraud and money laundering so I doubt they care but just want to cover their ass. That being said Gemmini is being completely orwellian here. Tell them to fuck off, politely, and if they don't want to provide you their service, oh well. Find some place that does value privacy or use a DEX like bisq or robosats. Privacy is a right.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i98c042",
                            "author": "According_Ad5882",
                            "score": 3,
                            "created_utc": 1652983844.0,
                            "response": "Bisq ftw",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9ag6jd",
                    "author": "DivendedsRlife",
                    "score": 2,
                    "created_utc": 1653020714.0,
                    "response": "You don’t have any “rights” in the crypto space yet",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i985vxq",
                    "author": "caploves1019",
                    "score": 0,
                    "created_utc": 1652981373.0,
                    "response": "Look at the link my guy, this is a phishing scam. It's not from Gemini. Check the sender email addy.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9865ju",
                            "author": "caploves1019",
                            "score": 2,
                            "created_utc": 1652981482.0,
                            "response": "Also the whole point of coinjoin and wasabi is to privatize long term holdings and use Bitcoin p2p, not to go back to an exchange with those SATs.  Keep em private after you pay SATs you make them private. Then put them to use or burry them into lightning network liquidity. Completely breaking the chain after a while when you close the LN channel.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i987061",
                            "author": "Specialist_Pipe_3998",
                            "score": 2,
                            "created_utc": 1652981822.0,
                            "response": "The sender email addy is support@gemini.com.\n\nIm guessing they are use sendsafely as a dropbox service?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i98ejvl",
                                    "author": "caploves1019",
                                    "score": 1,
                                    "created_utc": 1652984892.0,
                                    "response": "Ah gotcha",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i98dclw",
                            "author": "C01n_sh1LL",
                            "score": 2,
                            "created_utc": 1652984400.0,
                            "response": "What's wrong with the link? If you do a web search for \"gemini sendsafely\", results indicate Gemini has been partnering with Sendsafely for years.\n\nThe sender email addy is *almost* meaningless as a datapoint when evaluating an email's legitimacy. It doesn't prove anything one way or another (unless it's obviously and totally wrong due to the scammer putting forth zero effort).",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9avyql",
                    "author": "KualaLJ",
                    "score": 1,
                    "created_utc": 1653032547.0,
                    "response": "Standard anti-laundering KYC protocol. This is a regulation the exchange needs to abide by to have a license to do business in the state/country they are in.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i99a9la",
                    "author": "BitcoinUser263895",
                    "score": -5,
                    "created_utc": 1652999176.0,
                    "response": "Coin mixers are stupid.\n\nPlay stupid games...\n\n> Am I wrong to feel this is crossing the line into an orwellian future? \n\nThe global monetary surveillance system only ever expands and it's very well established.\n\n>  should be my right.\n\nYou have a right to work and give them tax money.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i995tbi",
                    "author": "Extremely-Bad-Idea",
                    "score": 0,
                    "created_utc": 1652997106.0,
                    "response": "You either comply with government rules or leave.  Those are your choices.  It is not Gemini, but rather the government that sets the standards.  \"Know Your Customer\" rules have been around since the Patriot Act was passed after 9/11",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i99akdb",
                            "author": "BitcoinUser263895",
                            "score": 3,
                            "created_utc": 1652999322.0,
                            "response": "> or leave\n\nNowhere to go. US monetary surveillance has global reach, they force the banks to comply and do all their work for them.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i99dcl6",
                    "author": "ralphyb0b",
                    "score": 0,
                    "created_utc": 1653000665.0,
                    "response": "They're based in New York, which has some of the toughest financial restrictions in the world and you used a mixing service with their exchange. Not sure what you expected to happen.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ut85et",
            "title": "All this dip fiesta we are living through has allowed me, a small investor, to go from 0.15 to 0.25",
            "url": "https://www.reddit.com/r/Bitcoin/comments/ut85et/all_this_dip_fiesta_we_are_living_through_has/",
            "author": "Kennedy591",
            "created_utc": 1652980248.0,
            "score": 1304,
            "num_comments": 360,
            "subreddit": "Bitcoin",
            "selftext": "Imagine what I can accomplish just by dcaing. I‘m feeling good & positive.",
            "stickied": false,
            "comments": [
                {
                    "id": "i98eshs",
                    "author": "comfyggs",
                    "score": 83,
                    "created_utc": 1652984991.0,
                    "response": "1 is not far away! Keep stacking!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i98sme8",
                            "author": "ThatsARepost24",
                            "score": 37,
                            "created_utc": 1652990645.0,
                            "response": "1 then 2 then 3. There is no goal. It always moves!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i991dnr",
                                    "author": "c0horst",
                                    "score": 7,
                                    "created_utc": 1652995092.0,
                                    "response": "Well there's always a goal. You just need to set a new one when you hit it :)",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9bkonh",
                                            "author": "lyp8707",
                                            "score": 1,
                                            "created_utc": 1653050062.0,
                                            "response": "I have 5k in USDC , i'm considering buying in around 35k-38k .\n\nPersonally, I think it will go lower because the fed will continue to increase rates.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9bua3e",
                                                    "author": "hhazzah",
                                                    "score": 2,
                                                    "created_utc": 1653054459.0,
                                                    "response": "I’m assuming you meant 25k-28k? ;)",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i98vge7",
                                    "author": "Rednartso",
                                    "score": 7,
                                    "created_utc": 1652991863.0,
                                    "response": "Eh, humans like goals.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9cntg4",
                                            "author": "robot20131119",
                                            "score": 2,
                                            "created_utc": 1653066281.0,
                                            "response": "Each dip is an opportunity and opportunities are meant to be seized.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i98wh4e",
                                            "author": "HighRyder18",
                                            "score": -2,
                                            "created_utc": 1652992844.0,
                                            "response": "Then why do most people not set them much less never achieve them?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9909xj",
                                                    "author": "Rednartso",
                                                    "score": 11,
                                                    "created_utc": 1652994582.0,
                                                    "response": "Because their parents never taught them, or they've gone so long without any semblence of happiness that they need to attach their life to a 4 year cycle just to have something to cling to.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9cmvle",
                                                            "author": "wang77chuan",
                                                            "score": 1,
                                                            "created_utc": 1653065905.0,
                                                            "response": "Just wait a few more years, ignore it for a while. \n\nThe new all time high will erase your failure haha",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i9awaoy",
                                                    "author": "dankie44",
                                                    "score": 3,
                                                    "created_utc": 1653032845.0,
                                                    "response": "You could just wait a bit longer and buy high. Works for me every time.\n\nThat is what I do. Price too low. I rather panic buy when the prices moving up.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9d74ny",
                                                            "author": "truczen",
                                                            "score": 3,
                                                            "created_utc": 1653074864.0,
                                                            "response": "Well I am good with buying the dip with lower prices lol.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i9b5cjr",
                                                    "author": "Downtown-Ad-4117",
                                                    "score": 2,
                                                    "created_utc": 1653040469.0,
                                                    "response": "Fear of failure, and lack of discipline.\nMost folks just haven't got what it takes.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9c5fc4",
                                    "author": "NevadaLancaster",
                                    "score": 2,
                                    "created_utc": 1653059029.0,
                                    "response": "But it goes like this. 1000, 100, 10, 1, .5, .1, so on.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9c7xwa",
                                    "author": "cavk11",
                                    "score": 1,
                                    "created_utc": 1653060034.0,
                                    "response": "It can be very funny if I didn't spend all my usdt before the last big dip, but now it's true for me.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9dfjo2",
                            "author": "ddemorest",
                            "score": 1,
                            "created_utc": 1653078634.0,
                            "response": "It's simple, after a year of streched bullrun, retailers are just booking profit .",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9bio21",
                            "author": "Just_looking981",
                            "score": -1,
                            "created_utc": 1653049045.0,
                            "response": "Keep gambling",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i98c86h",
                    "author": "ScamJustice",
                    "score": 173,
                    "created_utc": 1652983937.0,
                    "response": "25 million sats, thats insane! Nice work",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9b14q3",
                            "author": "tschnoeck2803",
                            "score": 7,
                            "created_utc": 1653037208.0,
                            "response": "We will look back on this day and realize that it was just one huge opportunity to buy the dip!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9ddjc8",
                                    "author": "djaypark",
                                    "score": 3,
                                    "created_utc": 1653077724.0,
                                    "response": "That's why we should buy the dip and just chill with the investment.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i98kpzo",
                    "author": "soooofa_king",
                    "score": 31,
                    "created_utc": 1652987412.0,
                    "response": "Nice...I will be DCAing all the way down myself as well.  HODLer for life now that I have learned to stop trying to time the market.  That shit about killed me and accomplished nothing.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i98p0qt",
                            "author": "martinp82",
                            "score": 3,
                            "created_utc": 1652989167.0,
                            "response": "Yeah, I have developed a bad habit to try timing the market after I \"panic\" sold in the middle oft last correction. Now I consider either dca back in or to fire and forget the stack in bitcoin only this time.\n\nWhat would you recommend?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9b4o30",
                                    "author": "TestyLion",
                                    "score": 3,
                                    "created_utc": 1653039950.0,
                                    "response": "So there's this saying that seems to have worked for many of us.\n\"DCA is the way.\"\nAnd stick to it!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9dje3h",
                            "author": "GlenCarr",
                            "score": 1,
                            "created_utc": 1653080383.0,
                            "response": "Good to know that, keep holding and keep stacking mate.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i985k6l",
                    "author": "FogTub",
                    "score": 123,
                    "created_utc": 1652981240.0,
                    "response": "Most of the conversations I have with other people in crypto these days are pretty positive. If people look away from prices long enough to see how adoption is coming along it's very encouraging. This price crash is a huge opportunity.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i98ql2s",
                            "author": "bonafidebob",
                            "score": 12,
                            "created_utc": 1652989811.0,
                            "response": "> ...see how adoption is coming along...\n\nHow do you track adoption though?\n\nAFAIK the best indicator is what can you buy with Bitcoin (or any crypto).  That is, who is willing to take it in trade for goods and services.\n\nHas the price crash had any impact on businesses' willingness to accept it as payment?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i993n4m",
                                    "author": "generateduser29128",
                                    "score": 10,
                                    "created_utc": 1652996123.0,
                                    "response": "The problem is that in western countries it makes little sense to pay with Bitcoin. The alternatives work well enough and they don't require keeping track of every trade.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9b0435",
                                            "author": "akuznetsov2",
                                            "score": 2,
                                            "created_utc": 1653036302.0,
                                            "response": "Pro tip: when buying the dip, don’t go all in. You want to ladder in to your favorite coins.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i99cz6o",
                                    "author": "Melmokz",
                                    "score": 9,
                                    "created_utc": 1653000486.0,
                                    "response": "Imo BTC's final destination is the gold of crypto. You dont use gold to buy things... you convert it to cash and use that. Itll come. It just needs to level out a bit first.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i99e2y5",
                                            "author": "bonafidebob",
                                            "score": -9,
                                            "created_utc": 1653001028.0,
                                            "response": "Maybe, but I’m not convinced it’s necessarily going to happen.\n\nGold is scarce in a way that crypto just *isn’t.*  That is, there’s no “competing gold standard” that uses gold 2.0 or goold or whatever, but you can trivially clone any crypto algorithm.  Sure, you can have additional commodity markets with silver, or diamonds, steel, aluminum, oil, or even water… but none of those replace gold and gold doesn’t replace any of them.   It’s not really clear to me that we need to invent new ephemeral digital commodities to trade.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i99iiu4",
                                                    "author": "itsnotthatdeepbrah",
                                                    "score": 16,
                                                    "created_utc": 1653003268.0,
                                                    "response": ">gold is scarce in a way that crypto just isn’t \n\nYou’re half right. Gold is relatively scarce. Bitcoin (not crypto) is absolutely scarce. Gold’s supply increase each year by roughly 1-2% while Bitcoin’s supply is completely fixed to 21 million. For the first time in human history, we have an asset that is *more* scarce than gold.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i99j59h",
                                                            "author": "bonafidebob",
                                                            "score": 8,
                                                            "created_utc": 1653003584.0,
                                                            "response": "> For the first time in human history, we have an asset that is *more* scarce than gold.\n\nThat’s not true!  There are only about 100,000 hairs growing out of my head, and that number is getting smaller and smaller every year.   My hairs are even scarcer than bitcoin — so let’s make them the new gold standard!!",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9audfh",
                                                                    "author": "y8523835",
                                                                    "score": 5,
                                                                    "created_utc": 1653031151.0,
                                                                    "response": "Which triggered over a 50% drop earlier this year and tanked the whole market for months .",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                },
                                                                {
                                                                    "id": "i99jmj9",
                                                                    "author": "itsnotthatdeepbrah",
                                                                    "score": 9,
                                                                    "created_utc": 1653003826.0,
                                                                    "response": "The difference is your 100,000 hairs aren’t able to exceed $1 trillion in market cap and reach it without marketing from a centralised management team/executive board/VC investors. You can disagree all you want but the free market has already decided.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i99ka34",
                                                                            "author": "bonafidebob",
                                                                            "score": -6,
                                                                            "created_utc": 1653004157.0,
                                                                            "response": "To be fair though I haven’t put any effort into marketing my hairs.\n\nI notice you overlooked the very real issue, which is that my hairs are special in exactly the same way that bitcoin is special.  (*Your* hairs, on the other hand, are just shitcoin, ‘cause I thought of it first!)",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i99kl48",
                                                                                    "author": "itsnotthatdeepbrah",
                                                                                    "score": 9,
                                                                                    "created_utc": 1653004316.0,
                                                                                    "response": "I don’t understand what your argument is when the numbers speak for themselves. Men lie, women lie, numbers don’t. BTC is the fastest appreciating asset of the last decade. As I said before, you can disagree all you want but the free market has already decided.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i99m53f",
                                                                                            "author": "Zeus4365",
                                                                                            "score": 6,
                                                                                            "created_utc": 1653005114.0,
                                                                                            "response": "He just wants to make a good point, however hairs cannot be rhe same thing. Money is all about store of value and hardness. Better money stores its value longer and beats out other alternatives that arent as hard. Your hair will deteriorate rather quickly compared to btc, so while you could use it as $, no one else would, because there are better alternatives that last longer. Hypothetically you could use anything as money, in practice tho, people dont equate things of lesser hardness as valuable as a currency",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        },
                                                                                        {
                                                                                            "id": "i9d26n0",
                                                                                            "author": "brilly39",
                                                                                            "score": 2,
                                                                                            "created_utc": 1653072549.0,
                                                                                            "response": "I’ve done it so many times. I still struggle with this.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        },
                                                                                        {
                                                                                            "id": "i99ljnm",
                                                                                            "author": "bonafidebob",
                                                                                            "score": -3,
                                                                                            "created_utc": 1653004811.0,
                                                                                            "response": "> BTC is the fastest appreciating asset of the last decade.\n\nThat’s not true either.   If you’re willing to cherrypick the dates, there are lots of other assets that have appreciated much more quickly over even shorter spans of time.   Of course, most of them have since gone bust.   I’m not confident the same thing won’t happen here, because I don’t know what will prevent it.   “Too big to fail” seems to be about the best argument available…",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "id": "i9adb2l",
                                                                                    "author": "DownRodeo404",
                                                                                    "score": 2,
                                                                                    "created_utc": 1653018972.0,
                                                                                    "response": "Who said your hairs are special?  Just you?   As long as I do not agree to your terms, I do not need to accept your hair as payment. \n\n   Isn't that the basics of a trade?   2 party agreement?   You say your hairs are more valuable, and I don't agree with you.... you can't make me trade your hair....  so....",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i9aghs8",
                                                                                            "author": "bonafidebob",
                                                                                            "score": 1,
                                                                                            "created_utc": 1653020911.0,
                                                                                            "response": "Yup.  Isn’t crypto exactly the same?",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "id": "i9bl74s",
                                                                                    "author": "Julian1820",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653050314.0,
                                                                                    "response": "My luck every time I buy it dips so I first buy like very little , sure enough it dips then I split multiple times.\n\n Sometimes just run out of money and it keeps dipping lol .",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "id": "i9dj8qz",
                                                                            "author": "ipUnic0rn",
                                                                            "score": 1,
                                                                            "created_utc": 1653080314.0,
                                                                            "response": "This is FOMO defined. We all have it. But if we just do what we can, the rest will take care of itself.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "i9acxr7",
                                                                    "author": "DownRodeo404",
                                                                    "score": 1,
                                                                    "created_utc": 1653018750.0,
                                                                    "response": "But.... there is no market for your hair.   No one wants to buy your hair, thus it's worthless.  The # of bitcoin [21Million] is appealing because the issuance rate is predictable and mapped out until 2140.    Companies and institutions like that predictability.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9agltc",
                                                                            "author": "bonafidebob",
                                                                            "score": 1,
                                                                            "created_utc": 1653020982.0,
                                                                            "response": "So the only value is what people are willing to pay for it?    Huh.\n\nThe production rate of my hair is extremely predictable, thank you very much.  It doesn’t halve nearly as often either.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i9az4eg",
                                                                                    "author": "Wit_as_a_Riddle",
                                                                                    "score": 2,
                                                                                    "created_utc": 1653035401.0,
                                                                                    "response": "Your hair also isn't easily tradable.",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                },
                                                                                {
                                                                                    "id": "i9alf59",
                                                                                    "author": "DownRodeo404",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653024199.0,
                                                                                    "response": "Your Hair Doesn't halve...\n Yet.    \n\nYeah. The value is what other people are willing to pay for it.",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "i9aawke",
                                                                    "author": "xexcutionerx",
                                                                    "score": 1,
                                                                    "created_utc": 1653017598.0,
                                                                    "response": "Send bank info",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                },
                                                                {
                                                                    "id": "i9bpkmz",
                                                                    "author": "saggy777",
                                                                    "score": 1,
                                                                    "created_utc": 1653052389.0,
                                                                    "response": "You need to go back to school. Hair is not an asset.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9bqkjt",
                                                                            "author": "bonafidebob",
                                                                            "score": 1,
                                                                            "created_utc": 1653052837.0,
                                                                            "response": "And math is??",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i9ckj2q",
                                                                                    "author": "saggy777",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653064980.0,
                                                                                    "response": "Your stinky hair is something no one wants. It's priceless to you but to no one else therefore it has no value hence not an asset.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i9clqnv",
                                                                                            "author": "bonafidebob",
                                                                                            "score": 1,
                                                                                            "created_utc": 1653065453.0,
                                                                                            "response": "It was not meant seriously.  [Reductio ad absurdum](https://en.wikipedia.org/wiki/Reductio_ad_absurdum).\n\nIt was a whimsical argument to rebut the assertion that \"scarcity\" is valuable in and of itself.  Clearly \"scarcity\" is not the thing that gives BTC value, as you've gone on to clarify quite well.\n\nAlso, you haven't explained why math is any more valuable than hair.   Math is not a scarce resource.\n\nEDIT: you can actually [make good money selling hair](https://www.brandedhairextensions.com/how-much-money-can-you-make-from-hair-business/) so your assertion that there's no demand is ... weak.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "i9bc874",
                                                            "author": "megasoso",
                                                            "score": 1,
                                                            "created_utc": 1653045473.0,
                                                            "response": "Ain't no dip just the whales profit taking before the Magic.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i9abx88",
                                                    "author": "DownRodeo404",
                                                    "score": 2,
                                                    "created_utc": 1653018168.0,
                                                    "response": "You are not wrong.... my rebuttle is.... \n\nhow much [energy, resources, money, security, trust, ....] does it take to move $10Million dollars worth of gold?   How long does that take?   \n\nBitcoin can guarantee that $10Million dollars worth of bitcoin will get to where it's supposed to go, [specific addresses/wallets] in between 10 minutes and an hour.... depending on the blockchain traffic... and we both get a receipt for the transaction.  But the best part everyone else, [in the btc ecosystem] has a copy of the receipt too.    What's wrong with that?    \n\nBesides, the advent of the internet has made our world more global than ever before.   A neutral monetary system is the next step to advancing civilization.... maybe.   \n\nSo gold is cool, but can you move large amounts of gold in an hour or less?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9agvff",
                                                            "author": "bonafidebob",
                                                            "score": 0,
                                                            "created_utc": 1653021153.0,
                                                            "response": "> So gold is cool, but can you move large amounts of gold in an hour or less?\n\nSorta.  I can do what we’ve been doing for a long time and transfer ownership of a lot of gold very quickly, where the actual gold is held on deposit in a secure vault.   There’s no real need to move the actual physical gold around, as long as we can securely transfer ownership.   And we figured out how to do that several hundred years ago.  <shrug>\n\nIf I want to, I can go pick up the actual physical gold and do whatever I want with it.  But I don’t have to.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9altgt",
                                                                    "author": "DownRodeo404",
                                                                    "score": 4,
                                                                    "created_utc": 1653024485.0,
                                                                    "response": "So you are describing paper gold.   Can you verify that you actually have gold in the vault?  Under whose authority?  Do you actually see your gold?  Or are you trusting someone else that the gold is there? With bitcoin, that information is open on the blockchain.  Don't trust, verify.   \n\nHave you heard of fractional reserve lending?  It's been around since blacksmiths held villagers gold.  Loan more gold than you actually possess.  It's a blacksmith bet that not everyone asks for their gold back at the same time.   So.... you better not be the last one to convert the paper gold into actual gold.   \n\nBesides, there are way more dollars than gold backing it.  1971 was when the dollars were no longer redeemable for gold.    \n\nRemember when the government made possession of gold illegal?   Yeah, can't take bitcoin as easy either.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9brts5",
                                                                            "author": "bonafidebob",
                                                                            "score": 2,
                                                                            "created_utc": 1653053393.0,
                                                                            "response": "Why not use the blockchain to track shares of gold then?   You get all the benefits (and costs) of a widely distributed ledger, but also are guaranteed you can go down to the vault and take out your gold if you want to.\n\nWhy is it **better** that there’s nothing physical behind a crypto ledger??",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i9d4l28",
                                                                                    "author": "DownRodeo404",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653073683.0,
                                                                                    "response": "That last question is the quality question.   It is better to have a crypto ledger because it's faster, more secure, and decentralized.   As opposed to the gold In vaults that only depends on trust.    You can trust a banker or metals holder as much as you can Throw them.",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i9acfj5",
                                                    "author": "DownRodeo404",
                                                    "score": 1,
                                                    "created_utc": 1653018461.0,
                                                    "response": "You cannot clone bitcoin unless 95% of the nodes, and miners, agree to that condition.   Proposals are made often... but very few make it to 95% consensus.    So.... that's cool.  \n\n Before you ask, you got to know that bitcoin has a node [the thing that broadcasts a transaction between 2 wallets] on every continent.... except Antarctica.    That's pretty decentralized, or neutral.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i9awxiu",
                                                    "author": "nmccutcheon",
                                                    "score": 1,
                                                    "created_utc": 1653033418.0,
                                                    "response": "Also there’s no rule that says you have to keep buying every single dip. \n\nSometimes the right move is to do nothing.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i9bpe03",
                                                    "author": "saggy777",
                                                    "score": 1,
                                                    "created_utc": 1653052307.0,
                                                    "response": "You don't know what's different about BTC. Do you?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9bqmgg",
                                                            "author": "bonafidebob",
                                                            "score": 1,
                                                            "created_utc": 1653052860.0,
                                                            "response": "Not really.  It was first.  Is there more?",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9ciinb",
                                                                    "author": "saggy777",
                                                                    "score": 1,
                                                                    "created_utc": 1653064198.0,
                                                                    "response": "BTC quantity is mathematically capped to 21 million and that can't change. I say this because even if developers get corrupt and modify the software no miner will run it since it's a decentralized network. Everyone knows it's value will go to zero if those fundamentals are changed.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9cjy7s",
                                                                            "author": "bonafidebob",
                                                                            "score": 1,
                                                                            "created_utc": 1653064756.0,
                                                                            "response": "A supply cap is not a unique feature to BTC though, many other crypto variants include the same idea.\n\nAs far as going to zero when fundamentals change, there have already been [many changes to the fundamental algorithm](https://github.com/bitcoin/bitcoin/tree/master/doc/release-notes) and that hasn't happened.  I don't know why anyone would believe that the current version will not continue to be tweaked over time.  As long as a majority of miners update, the blockchain will keep running with new rules.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i9clr6h",
                                                                                    "author": "saggy777",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653065459.0,
                                                                                    "response": "It's not just supply cap, its combination of all factors - the ecosystem, non confiscatable nature, decentralized, permission less, international money with no corruption due government control and with a history of stability and reliability and I could go on..",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i9cmf8g",
                                                                                            "author": "bonafidebob",
                                                                                            "score": 1,
                                                                                            "created_utc": 1653065723.0,
                                                                                            "response": "> and I could go on..\n\nI wish you would.  Specifically, I wish you'd explain why *each and every one* of those other factors cannot be trivially duplicated in their entirety by another crypto.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9dpf43",
                                            "author": "elenaarb2013",
                                            "score": 1,
                                            "created_utc": 1653083176.0,
                                            "response": "If it dips even further tomorrow and again and again, but I don't have money anymore?\n\nNobody is even sure what a dip really is, if you zoom out days like today don't seem too dippy :D .",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9cd33p",
                                    "author": "ber201411",
                                    "score": 1,
                                    "created_utc": 1653062068.0,
                                    "response": "Remember to pump all your money in one go, don't scale in those purchases!",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9dfwh4",
                                            "author": "mumsayw8",
                                            "score": 1,
                                            "created_utc": 1653078797.0,
                                            "response": "DCA and just chill, that's the thing I can understand mate lol.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i98wq5n",
                                    "author": "atlantaisprettycool",
                                    "score": 0,
                                    "created_utc": 1652992968.0,
                                    "response": "Someone check on the businesses in el salvador",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i995f2f",
                                            "author": "mrcluezo",
                                            "score": 4,
                                            "created_utc": 1652996931.0,
                                            "response": "Everyone experienced it in a similar fashion. It was a stimulus check in the form of bitcoin. That will be known as this generations pizza day in about 10 years.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i990cxv",
                                            "author": "5823059",
                                            "score": 5,
                                            "created_utc": 1652994620.0,
                                            "response": "[Almost no app downloads in 2022, took their $30 incentive and ran, scared off by volatility](https://www.currentaffairs.org/2022/05/why-this-computer-scientist-says-all-cryptocurrency-should-die-in-a-fire/)",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i99e0wl",
                                                    "author": "Dormant123",
                                                    "score": 2,
                                                    "created_utc": 1653000999.0,
                                                    "response": "Dear god I couldn’t get past the first half of the article with how reductionist this guys take is. Lmfao.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i99nsvd",
                                                            "author": "Professional-Cod-927",
                                                            "score": 1,
                                                            "created_utc": 1653005967.0,
                                                            "response": "I mean he does raise very important points though.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9a1vt4",
                                                                    "author": "Dormant123",
                                                                    "score": 2,
                                                                    "created_utc": 1653012924.0,
                                                                    "response": "He can make all the great points he wants but he won’t sway anyone who’s pro crypto to his side making straw man arguments",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9a3mc2",
                                                                            "author": "Professional-Cod-927",
                                                                            "score": 1,
                                                                            "created_utc": 1653013783.0,
                                                                            "response": "But how would you know that if you didn't read the interview?",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i9a6fug",
                                                                                    "author": "Dormant123",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653015199.0,
                                                                                    "response": "Why are you acting like I said I didnt read any of the article.\n\n&#x200B;\n\nAre you intentionally misrepresenting what I said or was it just a mistake?",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i9a6rtk",
                                                                                            "author": "Professional-Cod-927",
                                                                                            "score": 2,
                                                                                            "created_utc": 1653015373.0,
                                                                                            "response": ">Dear god I couldn’t get past the first half of the article with how reductionist this guys take is. Lmfao.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9avodw",
                            "author": "crazywerd",
                            "score": 1,
                            "created_utc": 1653032291.0,
                            "response": "Yeah but then you'll wait for it to dip further and when it doesn't.\n\nyou'll try to buy before the next next dip.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9913wj",
                    "author": "jolly_brewer",
                    "score": 16,
                    "created_utc": 1652994967.0,
                    "response": "Added another 18 million sats and achieved my first whole coin so that's nice. Working on number 2 now.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i98f6to",
                    "author": "ethanwc",
                    "score": 41,
                    "created_utc": 1652985155.0,
                    "response": "I'm literally selling a ton of stuff to buy this dip.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i98urqq",
                    "author": "Familiar_Hotel_5269",
                    "score": 12,
                    "created_utc": 1652991533.0,
                    "response": "But yahoo finance told me that Bitcoin was dead",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ba8nq",
                            "author": "connell83",
                            "score": 3,
                            "created_utc": 1653044244.0,
                            "response": "Which one? In 2012, 2015, 2018 or 2022?",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9d0alm",
                            "author": "bsham84",
                            "score": 1,
                            "created_utc": 1653071664.0,
                            "response": "They have been saying that shit for a long time now lol.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9ds0uc",
                                    "author": "dhdidnxx",
                                    "score": 1,
                                    "created_utc": 1653084390.0,
                                    "response": "Bitcoin is shit, it’s nothing",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i983f4k",
                    "author": "DownRodeo404",
                    "score": 30,
                    "created_utc": 1652980386.0,
                    "response": "Stack them sats!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9886vx",
                    "author": "meatismoydelicious",
                    "score": 9,
                    "created_utc": 1652982295.0,
                    "response": "*damn*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i98kq47",
                    "author": "Iguana_The_Wise",
                    "score": 7,
                    "created_utc": 1652987414.0,
                    "response": "Dip fiesta haha\n\nI'm loving it.\n\nMoar!!!!!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i98pr1y",
                    "author": "silent_yuki",
                    "score": 7,
                    "created_utc": 1652989472.0,
                    "response": "Daaamn you might actually be able to get to whole coin status.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i99llyb",
                    "author": "Romando1",
                    "score": 7,
                    "created_utc": 1653004842.0,
                    "response": "Hey OP I’m going on a boating trip this weekend!!  Wanna come with?  It’s gonna be a blast!!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i99mjri",
                            "author": "Kennedy591",
                            "score": 4,
                            "created_utc": 1653005321.0,
                            "response": "Definitely friend. Omw actually. It will be fun.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i99tz5w",
                                    "author": "Romando1",
                                    "score": 7,
                                    "created_utc": 1653009060.0,
                                    "response": "Ok cool don’t bother with a life vest / my boat is safe and seaworthy.  You might want to bring your seed so it’s not at home alone prone to theft.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9d0j4i",
                                    "author": "kuvircoming",
                                    "score": 1,
                                    "created_utc": 1653071772.0,
                                    "response": "Let's meet together and have fun for buying the dip mate.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9cym5k",
                            "author": "minerfrank",
                            "score": 2,
                            "created_utc": 1653070876.0,
                            "response": "Well that's something good, I hope I can be there too lol.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i98pprp",
                    "author": "Acceptable-Risks",
                    "score": 22,
                    "created_utc": 1652989457.0,
                    "response": "You're almost to the first major milestone! Once you own .28 BTC you will be among the top 1% of holders compared to global population. \n\n\nMeaning, based on world population and finite supply, if you hold .28 BTC 99% of the current/future world population will not be able to accumulate as much as you have.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i996f5h",
                            "author": "002timmy",
                            "score": 9,
                            "created_utc": 1652997388.0,
                            "response": "And that’s assuming everyone in the top 1% owns .28 BTC, which obviously can’t/won’t be the case",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9an4ev",
                                    "author": "frumpydrangus",
                                    "score": 2,
                                    "created_utc": 1653025427.0,
                                    "response": "Maybe 40 years from now the 0.28ers will be billionaires, yeah? Hopium?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9ds2xi",
                                            "author": "tulpval",
                                            "score": 1,
                                            "created_utc": 1653084418.0,
                                            "response": "True that, we all can be billionaires if we keep holding.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9apcq1",
                                    "author": "phatfarmz",
                                    "score": 2,
                                    "created_utc": 1653027098.0,
                                    "response": "Two different %’s. I believe you are referring to the top 1% of the world in wealth. He’s talking about the top 1% of BTC holders. Not the same",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9aq6ah",
                                            "author": "002timmy",
                                            "score": 1,
                                            "created_utc": 1653027723.0,
                                            "response": "No, I’m referring to BTC holders. ~8b * .01 (top 1%) / 21,000,000 = .28. So if you own .28 BTC, you are guaranteed to have more BTC than 99% of the rest world.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9ds6r2",
                            "author": "dhdidnxx",
                            "score": 1,
                            "created_utc": 1653084468.0,
                            "response": "Dumbest comment I’ve ever read. The world doesn’t want bitcoin",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i98rhyx",
                    "author": "rounderuss",
                    "score": 5,
                    "created_utc": 1652990185.0,
                    "response": "Nice work! It’s always nice to hear about peoples goals. I’m at my happy place. I don’t invest anymore in crypto. Just watch my bag bounce down the road like superball.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9dr6i7",
                            "author": "traderltc",
                            "score": 1,
                            "created_utc": 1653083996.0,
                            "response": "So good man, we all should support everyone like that.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9dvqxl",
                                    "author": "rounderuss",
                                    "score": 1,
                                    "created_utc": 1653086192.0,
                                    "response": "I used to trade bubble gum cards. It’s the same thing.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i98qw97",
                    "author": "lordsamadhi",
                    "score": 4,
                    "created_utc": 1652989938.0,
                    "response": "Great!  Now get it off the exchanges and onto your own hardware wallet at home.  That's when the real fun begins.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i997ynz",
                            "author": "Kennedy591",
                            "score": 7,
                            "created_utc": 1652998092.0,
                            "response": "Already done my friend. I take out every 0.05 I add. 👍",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i98xp99",
                    "author": "Zebleblic",
                    "score": 6,
                    "created_utc": 1652993420.0,
                    "response": "I've been buying since November 2020. I'm now down about 10-12g.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i98y1if",
                            "author": "ronbas",
                            "score": 7,
                            "created_utc": 1652993574.0,
                            "response": "This is the way.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9czt7a",
                                    "author": "karabaster",
                                    "score": 1,
                                    "created_utc": 1653071435.0,
                                    "response": "I hope we all will achieve things because of the hardwork.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9dsvjd",
                            "author": "inkehad",
                            "score": 1,
                            "created_utc": 1653084800.0,
                            "response": "That's good mate, you are doing so great and I am damn sure you will achieve something big in coming days,  just keep believing in this bitcoin market, it's everything for all of us.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i991ukb",
                    "author": "Square-Dream2317",
                    "score": 3,
                    "created_utc": 1652995302.0,
                    "response": "I’m .20 ! The goal is .25, no, its never stop dcaing bitcoin. Well done 👏🏼",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i99q80b",
                    "author": "Zeaoses",
                    "score": 4,
                    "created_utc": 1653007193.0,
                    "response": "0.002 :(",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9bcvy4",
                            "author": "PumpkinSpice2Nice",
                            "score": 2,
                            "created_utc": 1653045864.0,
                            "response": "Keep DCAing my friend.  Every little bit helps and it will eventually gain in value on its own too.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9cmc12",
                    "author": "fincomcollege1",
                    "score": 4,
                    "created_utc": 1653065688.0,
                    "response": "I think stocks will dip even more, so waiting for btc to do the same soon.\n\nWho da fuk still has money? I’ve been broke and bought all the dip I can.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9cmxvw",
                    "author": "wizz135",
                    "score": 4,
                    "created_utc": 1653065930.0,
                    "response": "I wouldn't worry about what bitcoin does now because I'm sure what it will do after 3 years",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9csarh",
                    "author": "btc14",
                    "score": 4,
                    "created_utc": 1653068092.0,
                    "response": "Good buy. I know the Coinbase fees are high, but it probably the safest exchange.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i98i7d7",
                    "author": "knuF",
                    "score": 9,
                    "created_utc": 1652986387.0,
                    "response": "There he is! A quarter coiner. Can you believe it? (Future)",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9drpau",
                            "author": "moxyhar",
                            "score": 1,
                            "created_utc": 1653084238.0,
                            "response": "Well we can't believe the future because it will almost gonna be something impossible to have that much of a bitcoin, we need to invest just right now so we can have a good future.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i98r85b",
                    "author": "ketoboi1",
                    "score": 17,
                    "created_utc": 1652990074.0,
                    "response": "Congrats.  Tip: in the future .25 will be like have multiple bitcoin now.  As time goes on you might want to delete this post,",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i98vnfg",
                            "author": "DatBuridansAss",
                            "score": 8,
                            "created_utc": 1652992140.0,
                            "response": "I get that it's a lot of money, but honestly is having multiple Bitcoin that big of a deal? What if I told you I have a paid off house somewhere in the Midwest United States. That would be worth about 10-20 BTC at current prices, but people aren't all worried about disclosing the fact they paid off their house, yet everyone is all \"dude wtf delete this they'll come for you\"",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i98wglt",
                                    "author": "haddock420",
                                    "score": 19,
                                    "created_utc": 1652992838.0,
                                    "response": "A wallet is easier to steal than a house.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9dgc2b",
                                            "author": "LiteStig",
                                            "score": 3,
                                            "created_utc": 1653078992.0,
                                            "response": "Well yeah and I don't think someone can stole my wallet, I will put that shit in my underwear and then it's just a piece of cake to secure your money these days XDD",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i994mvp",
                                    "author": "One_Psychology_6500",
                                    "score": 5,
                                    "created_utc": 1652996577.0,
                                    "response": "Would you want to say online that you had a ton of gold in the basement of that house? Now imagine something a million times better than gold…..",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i99576j",
                                            "author": "DatBuridansAss",
                                            "score": 3,
                                            "created_utc": 1652996831.0,
                                            "response": "Right, but it's not like people who admit to having say 2 Bitcoin are sharing their home address online. \n\nI do understand the potential risk, but I think it's overblown. That said there's no upside and plenty of downside even if remote, so I agree it's best not to share specifics online.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i996ah2",
                                                    "author": "One_Psychology_6500",
                                                    "score": 2,
                                                    "created_utc": 1652997327.0,
                                                    "response": "True and Reddit’s anonymity seems pretty legit",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9dqhsj",
                                                            "author": "Totoporcaro",
                                                            "score": 1,
                                                            "created_utc": 1653083676.0,
                                                            "response": "Well I wanted to say the same damn thing right now lol.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9d0mog",
                                    "author": "rmcars",
                                    "score": 2,
                                    "created_utc": 1653071818.0,
                                    "response": "It's the correct time and we all gotta take that advantage.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i98wkjx",
                                    "author": "ketoboi1",
                                    "score": 3,
                                    "created_utc": 1652992892.0,
                                    "response": "Because bitcoin is undervalued.  6 figures to pay off a house?  Good for you.  10 bitcoin out of 21 million which millions are already lost?  Of course, you want to hide that.  Jerome Powell cant print bitcoin.  Nobody can.  \n\n\nIt's not a lot of money it's a lot of sats and in the future, it will be a lot of money too.  Far more than 6 figures and most likely 7+.   \n\n\nIf you're asking this you don't fully understand bitcoin.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i991wrj",
                                            "author": "DatBuridansAss",
                                            "score": 3,
                                            "created_utc": 1652995330.0,
                                            "response": "I'm with you as far as where Bitcoin is going. I'm stacking as fast as possible for that reason. I'm just saying I think some people go a little overboard with the \"reddit opsec\" stuff. You can identify some of the more active og bitcoiner types on this sub, and have a reasonable idea that they hold multiple BTC. It wouldn't surprise me if some of them have >50 based on their comments. \n\nNow that I know this, what am I able to do? That's all I'm saying.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i993v7n",
                                                    "author": "ketoboi1",
                                                    "score": 5,
                                                    "created_utc": 1652996226.0,
                                                    "response": "It's just basic bad people wanting something they cant have.- It's super scarce (as we agree)When everyone and their moms start to realize this and there isn't enough bitcoin to go around people with multiple bitcoin will be targeted.  Especially if you're online posting you have 1, 5, 10, 20, or 1000+ bitcoin. That's a fact. because people with fiat are targeted through elaborate schemes all the time.  Even now there are schemes for crypto (send one get two back, phishing links, etc). Post your 20 bitcoin wallet and watch the DMS come in.  Maybe you're smart and you won't fall for anything.  A lot of people will and do fall for this crap...\n\nThen comes confiscation, what if one day your bitcoin gets confiscated as gold did.  No one can confiscate what you don't have... just a thought without elaborating on that too much lol\n\nIn the end, you really have no benefit in telling people how much bitcoin or fiat you have unless it's an ego thing and you're just trynna flex. \n\nI understand people get excited online and wanna tell someone but that's why people warn people to be alert about it.\n\nThe benefits of not saying anything outweigh the negatives of publically disclosing.\n\nPeople like Elon and Saylor aren't dumb and they have a lot more resources to protect their wealth than average people here posting about becoming whole coiners.. or quarter coines..etc...My 2 sats on that...lol",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9cfxx0",
                                            "author": "GGZii",
                                            "score": 1,
                                            "created_utc": 1653063191.0,
                                            "response": "Yeah because famously expensive houses lose value /s. I mean, you can't print land",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9be1nc",
                                    "author": "parishiIt0n",
                                    "score": 1,
                                    "created_utc": 1653046546.0,
                                    "response": "The point of post deleting is not about the current price of bitcoin, but an eventual increase of it in the future.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9biv36",
                                            "author": "DatBuridansAss",
                                            "score": 2,
                                            "created_utc": 1653049147.0,
                                            "response": "Right but I was around when Bitcoin was trading for like 300 bucks and less. If someone had, for example, 50 BTC back then, that would be $15,000. Not a small amount of money, but not life changing either. If I said \"you know in less than 10 years, your $15,000 is going to be worth $1.5 million, you'd better delete that post\" it's not that that would be bad advice necessarily, but my point is here we are at that future, and I'm not hearing stories about 2012 redditors getting targeted. Of course it could happen, and if you go around broadcasting personal details I'm sure there would be certain criminals out there who could put the pieces together and come after you. \n\nBut it's mostly farfetched. If someone practices good internet hygiene in general, but sometimes gets into specifics about \"I bought at this price and I currently hold this much\", who out there is going to be able to use that information, really?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9d1if6",
                                                    "author": "NitrogenSot",
                                                    "score": 1,
                                                    "created_utc": 1653072227.0,
                                                    "response": "Damn that's something potential, thanks for this comment.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i98ej5d",
                    "author": "No_Information_530",
                    "score": 3,
                    "created_utc": 1652984884.0,
                    "response": "Good job keep stacking them sats.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9dvql9",
                            "author": "mifalkash",
                            "score": 1,
                            "created_utc": 1653086187.0,
                            "response": "This is what I want to say at the end of the day my man.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i98spet",
                    "author": "zerolimits0",
                    "score": 3,
                    "created_utc": 1652990679.0,
                    "response": "I have increased my DCA as well while we are here, we may go lower still which is fine but its a heck of a lot better to get more now than it was a few months ago.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9dn3py",
                            "author": "dodgeviperz13",
                            "score": 1,
                            "created_utc": 1653082100.0,
                            "response": "It's something good mate, keep investing and keep shining.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i98yh4i",
                    "author": "Omega3568",
                    "score": 3,
                    "created_utc": 1652993764.0,
                    "response": "Keep stacking! I’m hoping to get to 1.0 before I die",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9dfmse",
                            "author": "yyzlj",
                            "score": 1,
                            "created_utc": 1653078674.0,
                            "response": "I hope he will never stop investing in this bitcoin market, it's so important for all of us to understand the importance of this cryptocurrency market now, keep stacking you all!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i994le9",
                    "author": "mrcluezo",
                    "score": 3,
                    "created_utc": 1652996559.0,
                    "response": "Minnows eventually become whales.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9axiqb",
                    "author": "fxf0311",
                    "score": 3,
                    "created_utc": 1653033944.0,
                    "response": "Yeah...Me too adding small amounts but still nearing a full bitcoin now..",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9drnd4",
                            "author": "casprove",
                            "score": 1,
                            "created_utc": 1653084212.0,
                            "response": "Buy more and just more my man, we all know that this is just the starting and we all can do so much than this, it's the best thing time to prove ourselves in these dips my man.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i98krbr",
                    "author": "iammasvidal",
                    "score": 6,
                    "created_utc": 1652987427.0,
                    "response": "Big deal keep going",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9d1omd",
                            "author": "MrPythoner",
                            "score": 1,
                            "created_utc": 1653072307.0,
                            "response": "Man need to keep investing to see some good days in coming future, he is doing so good and I want that shit from almost all of us here, we all need to win like this dude.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i98958k",
                    "author": "Nakabroto",
                    "score": 6,
                    "created_utc": 1652982677.0,
                    "response": "Dude, Nice! That's a great milestone.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i98mloe",
                    "author": "AvisPhlox",
                    "score": 2,
                    "created_utc": 1652988169.0,
                    "response": "[Dip dip potato chip. Dip dip potato chip. Dipdippotatochip DIPDIPPOTATOCHIP!](https://youtu.be/_-auauk9F2w)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i98seos",
                    "author": "DrKhuntoshi",
                    "score": 2,
                    "created_utc": 1652990559.0,
                    "response": "You’re a CHAD! Good job on this achievement - I’m fucking proud of you 😤🤝",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i98ssq0",
                    "author": "TheRestisXX",
                    "score": 2,
                    "created_utc": 1652990716.0,
                    "response": "This is the way",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i997cya",
                    "author": "c_games_official",
                    "score": 2,
                    "created_utc": 1652997816.0,
                    "response": "Only 84 million other people can EVER say that have as much or more BTC. That sounds like a lot, but it still means you will always have more BTC than 98.9% of the rest.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i997nxq",
                    "author": "ilikefunnyusernames",
                    "score": 2,
                    "created_utc": 1652997955.0,
                    "response": "I sold OLD videogame boxes (Pokémon, zelda) I had been holding on to since I was a kid in order to buy more of this delicious dip.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i999ey9",
                    "author": "OleksiyG35",
                    "score": 2,
                    "created_utc": 1652998777.0,
                    "response": "Waiting for tax refund to finally hit 0.20 lol",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ddb6t",
                            "author": "Magwenn",
                            "score": 1,
                            "created_utc": 1653077620.0,
                            "response": "Well I hope they won't charge us so much with the tax.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i999u9f",
                    "author": "Henrychinaskismom1",
                    "score": 2,
                    "created_utc": 1652998972.0,
                    "response": "Wish I had more to invest.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i99duy7",
                    "author": "crinkneck",
                    "score": 2,
                    "created_utc": 1653000916.0,
                    "response": "I too have enjoyed going from small investor to less small investor. Well done.\n\nEdit: removed accident finger slip emoji.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i99jrkl",
                    "author": "Change21",
                    "score": 2,
                    "created_utc": 1653003897.0,
                    "response": "Getttttt ittttt 🤘🏻🫡",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i99ly9c",
                    "author": "Spare_Success_4488",
                    "score": 2,
                    "created_utc": 1653005019.0,
                    "response": "Nice i went from 0.10 in 2021 to 0.23",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9dt8h6",
                            "author": "smaraux",
                            "score": 1,
                            "created_utc": 1653084972.0,
                            "response": "That's good, I hope you will keep DCAing in the market.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i99t1n1",
                    "author": "Otherwise-Homework97",
                    "score": 2,
                    "created_utc": 1653008605.0,
                    "response": "Check on this person in 3 years🙌",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9dp3yn",
                            "author": "rjcllc",
                            "score": 1,
                            "created_utc": 1653083032.0,
                            "response": "That would be so good mate, we all wanna see that lol.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9aaqo1",
                    "author": "Uzivert-",
                    "score": 2,
                    "created_utc": 1653017508.0,
                    "response": "Dude, you own a quarter of a bitcoin. 1/4th of a bitcoin! Most people don’t even own HALF A TENTH (0.05)! Well done! You may not know it yet, but you’re gonna be legendary in your family. Oh, btw I hope you have it safe in cold storage. If you have it in an exchange, PULL IT OUT.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9dfcbh",
                            "author": "flows0me",
                            "score": 1,
                            "created_utc": 1653078540.0,
                            "response": "Man did something good with his brain, he is just good.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9b8otr",
                    "author": "Mr-Moon-Horse",
                    "score": 2,
                    "created_utc": 1653043158.0,
                    "response": "Yes, well done! \nI’m at 0.2 but my dream is to get to 1 eventually!\nTrouble is I’m saving for a house so I’ve got such a conflict to not spend my deposit savings on BTC",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9d394z",
                            "author": "renecop",
                            "score": 2,
                            "created_utc": 1653073053.0,
                            "response": "Good luck for the future my man, you gonna have that.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9bdq1p",
                    "author": "cvvmoney111",
                    "score": 2,
                    "created_utc": 1653046365.0,
                    "response": "Moved $1000 to btc as soon as i got notification that btc dropped to $41k. \n\nmy first time panic buying.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9cbopd",
                            "author": "kidneyprobs",
                            "score": 1,
                            "created_utc": 1653061517.0,
                            "response": "Welcome. You’re doing it right",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9d0pev",
                            "author": "acufeni",
                            "score": 1,
                            "created_utc": 1653071853.0,
                            "response": "Yeah mate, you did something good, good luck now lol.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9cokg4",
                    "author": "cottenself",
                    "score": 2,
                    "created_utc": 1653066579.0,
                    "response": "Buying more just like you, all of our dreams are going to be true in coming days if we keep believing and keep investing in this Bitcoin market, keep it up my brother.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i992snr",
                    "author": "okmr360",
                    "score": 1,
                    "created_utc": 1652995735.0,
                    "response": "Investment.....\n\nTo cash out for fiat when the time is right. This is 99% of Bitcoin holders",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i99tpdv",
                    "author": "GolfBikeRun",
                    "score": 1,
                    "created_utc": 1653008924.0,
                    "response": "Personally, I'm dcaing this dip, but i believe BTC will hit 15-20k before it hits 35k again.  The world economy is on the verge of crashing. Gas shortage will drive the US to even higher inflation/hyperinflation, which will crash the stock market which will also affect the crypto market. I have a good position already, but saving my bags for my goal price point.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9cpvnb",
                            "author": "qqnodes612",
                            "score": 1,
                            "created_utc": 1653067109.0,
                            "response": "But don't you think that market gonna drop more or something?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9cqm83",
                                    "author": "GolfBikeRun",
                                    "score": 1,
                                    "created_utc": 1653067408.0,
                                    "response": "I do, thats why i have only DCAed 2 times in the last month. Waiting for the ball to drop. Got my limit orders placed!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i98hwg8",
                    "author": "dancho_danov",
                    "score": 1,
                    "created_utc": 1652986262.0,
                    "response": "how",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i98mubg",
                    "author": "pierreman",
                    "score": 1,
                    "created_utc": 1652988267.0,
                    "response": "Good work",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i98nbss",
                    "author": "panixplays",
                    "score": 1,
                    "created_utc": 1652988465.0,
                    "response": "Let’s go! Good job my man!😍🍻🙌🏼",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i98u3w9",
                    "author": "filmrebelroby",
                    "score": 1,
                    "created_utc": 1652991259.0,
                    "response": "We shall dip further but I shall purchase more.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i99iycg",
                    "author": "civiltiger",
                    "score": 1,
                    "created_utc": 1653003485.0,
                    "response": "What does 0.25 mean?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i99kuaa",
                            "author": "NibelheimIncident",
                            "score": 5,
                            "created_utc": 1653004448.0,
                            "response": "A quarter. Like a quarter cup. So this would be 4 tbsp of Bitcoin.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9a98pc",
                                    "author": "civiltiger",
                                    "score": 2,
                                    "created_utc": 1653016687.0,
                                    "response": "Lol. Seriously though help a brother out",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9acxr8",
                                            "author": "Perdurabo306",
                                            "score": 1,
                                            "created_utc": 1653018750.0,
                                            "response": "He owns 1/4 of a coin or 25% of 1 Bitcoin",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9adyd5",
                                                    "author": "civiltiger",
                                                    "score": 2,
                                                    "created_utc": 1653019357.0,
                                                    "response": "Ah ok. Appreciate the explanation for a newbie like me",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9d0r2w",
                                    "author": "BennyBvB",
                                    "score": 1,
                                    "created_utc": 1653071875.0,
                                    "response": "I still can't believe we have to explain that shit lmao man.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9d40az",
                            "author": "astrodog4231",
                            "score": 1,
                            "created_utc": 1653073413.0,
                            "response": "I hope you got that now, it was something basic tho lol.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9d72yu",
                                    "author": "civiltiger",
                                    "score": 1,
                                    "created_utc": 1653074842.0,
                                    "response": "I am totally new to this.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i99ts19",
                    "author": "ddoublea96",
                    "score": 1,
                    "created_utc": 1653008962.0,
                    "response": "Hell yeah, I’m hoping it drops some more, everyone sell, we’ll get ready for 2025",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9d7kth",
                            "author": "fuxumshitup",
                            "score": 1,
                            "created_utc": 1653075068.0,
                            "response": "I give myself a certain price point when to buy. Otherwise DCA.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i99wfxc",
                    "author": "RepublicKev",
                    "score": 1,
                    "created_utc": 1653010267.0,
                    "response": "Me too buddy. It’s not all bad right.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9dbzw0",
                            "author": "jncurtis21",
                            "score": 3,
                            "created_utc": 1653077026.0,
                            "response": "Adele new song, instead of rolling in the deep is actually buying the dip.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i99wgwb",
                    "author": "thinkingperson",
                    "score": 1,
                    "created_utc": 1653010280.0,
                    "response": "Why do we have to imagine? You just told us that you have gone from 0.15 to 0.25.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9d1kgk",
                            "author": "eastcoast4lyfe",
                            "score": 1,
                            "created_utc": 1653072254.0,
                            "response": "I would like to buy at the bottom! Please let me know right before that happens.\n\nRealize that today’s prices could very likely be what the ‘bottom’ of the next bear market is.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i99wtjf",
                    "author": "DisguyExpensive",
                    "score": 1,
                    "created_utc": 1653010446.0,
                    "response": "Same here, went from 0.15 to 0.2 all at a time, took 1 year to reach 0.15 and now 1 month to buy 0.05",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9cymze",
                            "author": "gildanecroquini",
                            "score": 2,
                            "created_utc": 1653070887.0,
                            "response": "This is the real potential of buying the dip mate, so good.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9a0mjz",
                    "author": "failed_state_medz",
                    "score": 1,
                    "created_utc": 1653012300.0,
                    "response": "Well done mate. I can relate to this feeling",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9cjubh",
                            "author": "btctomek72",
                            "score": 1,
                            "created_utc": 1653064714.0,
                            "response": "Cant buy the dip if I have no more money left from buying at ATH's taps head.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9a14lu",
                    "author": "Inviction_",
                    "score": 1,
                    "created_utc": 1653012549.0,
                    "response": "Fiasco*?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9dhge7",
                            "author": "mobidick11",
                            "score": 1,
                            "created_utc": 1653079497.0,
                            "response": "What's that though? I have never heard about that word.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9diuw9",
                                    "author": "Inviction_",
                                    "score": 1,
                                    "created_utc": 1653080137.0,
                                    "response": "Like a disaster. Something that turns into a big, complicated failure\n\nIt's a good word. Underrated",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9a2jw1",
                    "author": "TSchnauz6575",
                    "score": 1,
                    "created_utc": 1653013252.0,
                    "response": "Dip fiesta sounds like a party with lots of delicious dips and chips",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9cvp7t",
                            "author": "zozulya3",
                            "score": 1,
                            "created_utc": 1653069549.0,
                            "response": "Oh boy if buy now thinking this is \"the dip\" you're gonna have a hard time.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9a2m2s",
                    "author": "SusGreen",
                    "score": 1,
                    "created_utc": 1653013282.0,
                    "response": "Woah sweet! Awesome Job;!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9dhash",
                            "author": "jwiminer",
                            "score": 3,
                            "created_utc": 1653079427.0,
                            "response": "Instructions unclear, stuck my d**k in the vacuum again!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9a9y6z",
                    "author": "Pockethulk750",
                    "score": 1,
                    "created_utc": 1653017072.0,
                    "response": "The upside of the downside! Good work!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9di50d",
                            "author": "stevebtce",
                            "score": 2,
                            "created_utc": 1653079810.0,
                            "response": "Lol you gotta save all your DCAing for the dips apparently. \n\nDon’t you dare DCA at the same time on a recurring schedule regardless of price.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9aekt3",
                    "author": "kidsseeghost1987",
                    "score": 1,
                    "created_utc": 1653019730.0,
                    "response": "🔥🔥🔥",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9bjvpe",
                            "author": "auttasak",
                            "score": 2,
                            "created_utc": 1653049655.0,
                            "response": "Some people here claim that they increase their DCA spending during dips. \n\nThe whole thing gives me a headache.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9dbssu",
                                    "author": "mrparzyk",
                                    "score": 1,
                                    "created_utc": 1653076940.0,
                                    "response": "Because that's the right game and most of us do that.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9akzu1",
                    "author": "Captainzron",
                    "score": 1,
                    "created_utc": 1653023912.0,
                    "response": "It's a bit arbitrary, I used to regularly buy 30 at a time.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9c2a9s",
                            "author": "alcasperboy",
                            "score": 1,
                            "created_utc": 1653057771.0,
                            "response": "Why is it that I'm always broke when there is a significant dip?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9apydc",
                    "author": "MyTitz",
                    "score": 1,
                    "created_utc": 1653027561.0,
                    "response": "Damn nice. I went from 0.36 to 0.29 lol",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9dpmt2",
                            "author": "samipasta",
                            "score": 1,
                            "created_utc": 1653083275.0,
                            "response": "Problem is, I spent all my fiat on crypto on pay day because I'm a compulsive addict so now I've nothing left to buy the dip .",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9av8j6",
                    "author": "magnat007",
                    "score": 1,
                    "created_utc": 1653031903.0,
                    "response": "The dip has only started.. It's gonna be deep . Cheers .",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9awnry",
                    "author": "pcvcolin",
                    "score": 1,
                    "created_utc": 1653033169.0,
                    "response": "Good, good.  \n\nMake it a habit:  \n\nhttps://dcabtc.com",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ayucl",
                    "author": "noxGOX_45",
                    "score": 1,
                    "created_utc": 1653035145.0,
                    "response": "We must all understand and embrace patience for whenever there are new changes.\n\n it will indeed have its ups and downs.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ayuma",
                    "author": "Yodel_And_Hodl_Mode",
                    "score": 1,
                    "created_utc": 1653035152.0,
                    "response": "Hell yes!  Keep going!\n\nThat being said, it isn't safe to talk about how much Bitcoin you own.  0.15 BTC might not sound like much today, but in a few years it'll be a big deal, and a few years later, it'll be a bigger deal.\n\nTo anybody who says \"Yeah, whatever\" remember this: In 2016, owning 1 BTC was no big deal.  In 2012, owning a hundred BTC was no big deal.\n\nKeep stacking!  But keep it secret, and keep it safe.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9b5pjk",
                            "author": "blue_black_nightwing",
                            "score": 1,
                            "created_utc": 1653040777.0,
                            "response": "And have an offshore account for it all",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9az7fm",
                    "author": "bit_kszys",
                    "score": 1,
                    "created_utc": 1653035477.0,
                    "response": "This is the time for quiet yet steady accumulation. No panic. \n\nNo fear. Check back in two years to see if the Euphoria is earned.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9b0e88",
                    "author": "mat1matik",
                    "score": 1,
                    "created_utc": 1653036561.0,
                    "response": "I tossed 75 in a bit ago. Not much...\n\nalso it’s not my DCA day and I’m still recovering from the holidays.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9d9jqd",
                            "author": "tsharkrider",
                            "score": 1,
                            "created_utc": 1653075939.0,
                            "response": "DCA and just DCA, this is the best shit we can see lol.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9bbzj2",
                    "author": "udnub",
                    "score": 1,
                    "created_utc": 1653045328.0,
                    "response": "Congrats! 0.1 was a big win for me also! 1 is on the way!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9dhiwi",
                            "author": "CQEFlash",
                            "score": 1,
                            "created_utc": 1653079530.0,
                            "response": "That's something cool, at least you are really confident.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9bdztu",
                    "author": "Potatodemonx",
                    "score": 1,
                    "created_utc": 1653046517.0,
                    "response": "We are all small investors, stacking. Except saylor. He’s a big investor lol",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9bfsx5",
                    "author": "DoWhileGeek",
                    "score": 1,
                    "created_utc": 1653047527.0,
                    "response": "Don't let you dreams be dreams.\n\nBitcoin's on discount",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9dny0c",
                            "author": "St5816",
                            "score": 1,
                            "created_utc": 1653082493.0,
                            "response": "That's right, it's important for all of us to invest as much as we can in this dip, it's just so amazing to see a large amount of people buying the dip in every fucking dip mate.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9biza2",
                    "author": "majopali",
                    "score": 1,
                    "created_utc": 1653049205.0,
                    "response": "It hurts seeing my investment go down everyweek yet I have to put my money in it coz DCA .",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9bk9y6",
                    "author": "lfynt01",
                    "score": 1,
                    "created_utc": 1653049858.0,
                    "response": "I would be, if I hadn’t already bought the dips before.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9bkxno",
                    "author": "maximumcoin",
                    "score": 1,
                    "created_utc": 1653050185.0,
                    "response": "Does anybody wait a little bit more before buying btc? \n\nMaybe it's going downstairs further?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9bvyoi",
                            "author": "Hiviq",
                            "score": 1,
                            "created_utc": 1653055178.0,
                            "response": "Maybe not - welcome to speculation",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9bodrq",
                    "author": "asimes1",
                    "score": 1,
                    "created_utc": 1653051845.0,
                    "response": "I also hit .25 today!!!!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9cnekd",
                            "author": "svcorp77",
                            "score": 1,
                            "created_utc": 1653066114.0,
                            "response": "That's something nice to hear mate, keep it up please.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9bslaq",
                    "author": "NYKNYb",
                    "score": 1,
                    "created_utc": 1653053727.0,
                    "response": "Everyone should have a quarter of a coin. \n\nOh wait...",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9bwm0n",
                    "author": "vladshefff1998",
                    "score": 1,
                    "created_utc": 1653055452.0,
                    "response": "Go all in but save for buying if it goes to to 30k like may.\n\nDefinitely, but I would start buying now in parts instead of waiting .\n\nThere were people who were waiting for 3$ when btc went to 4$ .",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9c5abw",
                    "author": "NevadaLancaster",
                    "score": 1,
                    "created_utc": 1653058973.0,
                    "response": "About the same. Still going. I'm eagerly awaiting better pricing. I'm risking everything by not buying but I'm speculating a short lived dip lower. I hope we get it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9c9jkv",
                    "author": "SOLID-FAISAL",
                    "score": 1,
                    "created_utc": 1653060668.0,
                    "response": "I'm going for that 0.1 too 👏",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9c9wcp",
                    "author": "Previous-Pea6642",
                    "score": 1,
                    "created_utc": 1653060808.0,
                    "response": "Oh my god yesterday I scrolled past this and read this as \"dancing\" and was really confused, but not confused to click on the post. Now I scroll through again and see it's \"dcaing\" lmao",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9cak8s",
                    "author": "dxgdfhfgjg",
                    "score": 1,
                    "created_utc": 1653061072.0,
                    "response": "That's a great strategy to buy and average out every time but only works if you can hold for 2 years from now.\n\nGreat to see felow bulls here who keep buying instead of looking at the price.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9cfrub",
                    "author": "ubermusaic",
                    "score": 1,
                    "created_utc": 1653063124.0,
                    "response": "Just would wait more and think a bit before buying the dip!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9cgq7h",
                    "author": "AffectionateCanary25",
                    "score": 1,
                    "created_utc": 1653063502.0,
                    "response": "Depending on your age, 0.18 Bitcoin may be enough to hedge your lifetime portfolio against inflation.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9clz8k",
                    "author": "grazeley",
                    "score": 1,
                    "created_utc": 1653065545.0,
                    "response": "Great job! Keep going!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9cm03r",
                    "author": "yazyoga",
                    "score": 1,
                    "created_utc": 1653065554.0,
                    "response": "When we dip you dip I dip.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9cp5r0",
                    "author": "gusbtc",
                    "score": 1,
                    "created_utc": 1653066818.0,
                    "response": "Just DCA and chill, this line is just winning our hearts and that's what we like about the market, I hope we all will keep investing and will keep shining like this.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9cul0d",
                    "author": "xiwefe2",
                    "score": 1,
                    "created_utc": 1653069046.0,
                    "response": "DCA is great, working out nicely for me..but u have to get bold for huge returns. But i rather play it safe and research, that's how i came acros BAYC NFTs in the early days..Now looking at AngelBlock, got the same if not bigger vibes with their plans and NFTs..Launchpads are a thing of the past, here is AngelBlock..innovation at its finest imo, their whitepaper is insane,THOL will be massive",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9cvs97",
                    "author": "adelawal111",
                    "score": 1,
                    "created_utc": 1653069587.0,
                    "response": "Investing in the right time is everything in this cryptocurrency market, I am glad that I am not the only one who is taking the real fucking advantage of this dip, that's good.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9d4hax",
                    "author": "weendee",
                    "score": 1,
                    "created_utc": 1653073633.0,
                    "response": "Stocks / crypto/ life when you have something you believe in with backing to feel it will go back up, you buy the dip. \n\nThings are dipping right now .",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9dakz9",
                    "author": "adroussel",
                    "score": 1,
                    "created_utc": 1653076396.0,
                    "response": "If everybody buys too much in the dip, it will go up again. \n\nSo, please, leave some bitcoin at lower prices for everyone. Don't be greedy.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9deyny",
                    "author": "quangtrung12573",
                    "score": 1,
                    "created_utc": 1653078367.0,
                    "response": "It's just so good to see people appreciating the efforts here, we all know that you are doing something good and it will help you and your beautiful future, keep it up my man.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9dhguk",
                    "author": "pixlmusic",
                    "score": 1,
                    "created_utc": 1653079504.0,
                    "response": "DCA is the one true path to financial independence",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9djkp0",
                    "author": "treyc2001",
                    "score": 1,
                    "created_utc": 1653080463.0,
                    "response": "As soon as i deposit my check this evening, it will be time to go for a dipski.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9dln9z",
                    "author": "bangzeed",
                    "score": 1,
                    "created_utc": 1653081425.0,
                    "response": "I want to buy this but I am already out of cash buying the previous dips.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i98xyml",
                    "author": "proof_in_pudding",
                    "score": -3,
                    "created_utc": 1652993538.0,
                    "response": "Just imagine how much you'll have when btc hits $10k!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i98y676",
                            "author": "humansubjects",
                            "score": 10,
                            "created_utc": 1652993630.0,
                            "response": "He'd have 0.25 BTC.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9axcgc",
                                    "author": "scalvin3",
                                    "score": 0,
                                    "created_utc": 1653033793.0,
                                    "response": "Big Tip, this isn't a dip. Buy a little now, but keep some cash for the real dip later .",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9br085",
                            "author": "mnjamm",
                            "score": 4,
                            "created_utc": 1653053028.0,
                            "response": "The fact that everyone in this sub is freaking out or even mentioning this means it’s full of newcomers .",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9bygxg",
                                    "author": "proof_in_pudding",
                                    "score": 1,
                                    "created_utc": 1653056225.0,
                                    "response": "Lolol yes",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i99omf3",
                            "author": "Outasiight",
                            "score": 3,
                            "created_utc": 1653006380.0,
                            "response": "The same as he has now...",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9d0a9k",
                                    "author": "TimTkin",
                                    "score": 1,
                                    "created_utc": 1653071660.0,
                                    "response": "This is the way,,,, bought the dip but it keeps dipping, ok,, I buy more .",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i987k0r",
                    "author": "ozzyyz",
                    "score": -27,
                    "created_utc": 1652982044.0,
                    "response": "Take profit,or you will regret it .",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i987r0t",
                            "author": "Kennedy591",
                            "score": 28,
                            "created_utc": 1652982121.0,
                            "response": "I have yet to see one person who held long-term regret his decision",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9damxc",
                                    "author": "xxskillerzz",
                                    "score": 1,
                                    "created_utc": 1653076422.0,
                                    "response": "People asked for another chance to buy below $60K\n\nBTC: There you go .\n\nPeople: Well now I’m not doing that .",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i987x6p",
                                    "author": "ozzyyz",
                                    "score": -28,
                                    "created_utc": 1652982188.0,
                                    "response": "Yeah but selling 0.25 and buying 0.30 at a lower price is still holding,but having profit.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i988nzi",
                                            "author": "Western_Boris",
                                            "score": 35,
                                            "created_utc": 1652982486.0,
                                            "response": "That, sir, is called gambling.\n\n\n\"I bet all my precious sats that the price will fall __%. Then I buy back cheaper!\"\n\n\n\"Oh shit, the price went up\"",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9bznd1",
                                                    "author": "wang1818",
                                                    "score": 1,
                                                    "created_utc": 1653056706.0,
                                                    "response": "Oh well, just gunna avoid FOMO and wait for the next one. Queen Hodl over here .",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i98b5c0",
                                            "author": "ILikeToSayHi",
                                            "score": 16,
                                            "created_utc": 1652983492.0,
                                            "response": "Great way to lose money yes",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9d2kcb",
                                                    "author": "assinuss",
                                                    "score": 1,
                                                    "created_utc": 1653072727.0,
                                                    "response": "Be right back, gonna take out a 2nd mortgage and put it in this.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i98rswp",
                                            "author": "ketoboi1",
                                            "score": 3,
                                            "created_utc": 1652990311.0,
                                            "response": "Time to do the selling was around 60k to 50k maybe 40k now is the time to accumulate.  It is a buyers market not a sellers market.  Yeah we could go lower but him buying at 28k vs. 16k isn’t worth missing out on the upside if things drastically change.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i98p1jf",
                                            "author": "groypley90",
                                            "score": 1,
                                            "created_utc": 1652989177.0,
                                            "response": "Why risk losing any Bitcoin for just .05? Especially since we know where this is going in the long run. Get out of the fiat mindset.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i98rwkg",
                                            "author": "LastRecognition4151",
                                            "score": 1,
                                            "created_utc": 1652990353.0,
                                            "response": "So you’re the one selling me those cheap sats",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9bgcyy",
                                                    "author": "ramil2405",
                                                    "score": 1,
                                                    "created_utc": 1653047830.0,
                                                    "response": "Whatever you do, dont listen to anyone on here, go with your own gut. \n\nNobody here knows shit about fuck.\n\nNice to see that most of us are agreeing on this post!",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9bajo4",
                                            "author": "sonfromhell",
                                            "score": 1,
                                            "created_utc": 1653044421.0,
                                            "response": "I had been hoping there would be a dip so I could fill some of my bags again.\n\nbut I recently left my job and don’t start my new one until January.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i98aoec",
                            "author": "cryptoklobby",
                            "score": 14,
                            "created_utc": 1652983299.0,
                            "response": "This is terrible advice",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9d06ff",
                                    "author": "timmyshh",
                                    "score": 1,
                                    "created_utc": 1653071610.0,
                                    "response": "My DCA is set automatically on pay day. \n\nI still have a long week in the fiat mines before I can buy this dip. \n\nSo I don’t mind if the market takes a while to get going again.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i98c5u9",
                            "author": "redshadow90",
                            "score": 1,
                            "created_utc": 1652983911.0,
                            "response": "What's profit? Is that a fish like pomfret, or a new gym chain, or a prophet as spelled in Indonesian?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9c28ic",
                                    "author": "rm44377",
                                    "score": 1,
                                    "created_utc": 1653057752.0,
                                    "response": "Yeah, Acquire more and more money, Then buy the dips.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i98n8re",
                            "author": "nickname432",
                            "score": 1,
                            "created_utc": 1652988431.0,
                            "response": "Doesn't sound like OP is in profit\n\nAnd although I wouldn't suggest to sell in this type of environment, it's pretty pathetic that you're being downvoted for sharing a perspective\n\nBtc has a good chance of appreciating as soon as the fed stops tightening",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i98pgkp",
                                    "author": "groypley90",
                                    "score": 1,
                                    "created_utc": 1652989349.0,
                                    "response": "Who cares about profiting in Dollar, the Euro or the Pound? These are the biggest shitcoins of all. Not only will you have to pay taxes, you'll be trading the hardest money in the world for currencies that are guaranteed to go down in value over the long run.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9by6y6",
                                    "author": "namefio2",
                                    "score": 1,
                                    "created_utc": 1653056113.0,
                                    "response": "I managed to buy at the ATH and I’m not selling til the bottom of the dip. That’s the rule is is not?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9c2cyy",
                                            "author": "nickname432",
                                            "score": 1,
                                            "created_utc": 1653057801.0,
                                            "response": "Let me know when you sell then\n\nStill have a couple of bugs on the sideline",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i999gv3",
                            "author": "CryptoJunkkey",
                            "score": 1,
                            "created_utc": 1652998801.0,
                            "response": "Now is a terrible time to take profit, I took profit at pretty much the top of the bull market. That’s when you swing trade. I’m a strong believer in the four year cycles and what do you know, I played it damn near perfectly. Sold about 90% of my portfolio. Now DCA time.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9beca3",
                                    "author": "eltanga85",
                                    "score": 1,
                                    "created_utc": 1653046717.0,
                                    "response": "When I’m hungry I can always eat these paper gains. Hahaha .",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9cgp7r",
                            "author": "kinglcj",
                            "score": 1,
                            "created_utc": 1653063491.0,
                            "response": "Noob: “But what if the dip keeps on dipping?”\n\nOP: “Did I stutter?”",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i98c9l7",
                            "author": "ozzyyz",
                            "score": -7,
                            "created_utc": 1652983953.0,
                            "response": "Wait i will say it in a better way.\n\nM8 there is a even better way to increase your holding,us investing in yourself.\n\nStudy some technical analysis and just increase your holding based on what you see in the chart !\n\nBecause sometimes you can easily see if you are buying at a good price,or you can get even better, without just parroting from youtube,but just trustung yourself !",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i98dmdr",
                                    "author": "Scarf_Darmanitan",
                                    "score": 3,
                                    "created_utc": 1652984510.0,
                                    "response": "Genuinely, best of luck friend\n\nIf you’ve actually got the crystal ball then let some of us know 😅",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9cxg4b",
                                            "author": "mercstills",
                                            "score": 1,
                                            "created_utc": 1653070338.0,
                                            "response": "It is a god time to go for more , before it starts surging up again.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9dqt4k",
                                    "author": "cuoitop1",
                                    "score": 1,
                                    "created_utc": 1653083824.0,
                                    "response": "Split the amount into 2 that you would put in every two weeks, and boom, you have weekly DCA.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i98nbki",
                    "author": "Bedroom-Eastern",
                    "score": 0,
                    "created_utc": 1652988462.0,
                    "response": "21m Bitcoin divided by 8b humans on earth\n= 0.002625 btc per human",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i991114",
                            "author": "MilkMySpermCannon",
                            "score": 2,
                            "created_utc": 1652994930.0,
                            "response": "Horrible metric since a large majority are in third world countries who literally have never heard of bitcoin and never will.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9b325n",
                                    "author": "jshouhbsb5",
                                    "score": 1,
                                    "created_utc": 1653038708.0,
                                    "response": "Woah many guys are waiting for more drop, hope they don't regret that.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9csas8",
                                    "author": "Bedroom-Eastern",
                                    "score": 1,
                                    "created_utc": 1653068092.0,
                                    "response": "Glad you like it.\nProvided by mymetric.org",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}