{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "usxzfx",
            "title": "Bitcoin mining in Norway has been given the green light - Blockbulletin",
            "url": "https://blockbulletin.com/news/bitcoin/bitcoin-mining-in-norway-has-been-given-the-green-light/",
            "author": "sebo28091995",
            "created_utc": 1652945330.0,
            "score": 60,
            "num_comments": 6,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i96wvqh",
                    "author": "VPNApe",
                    "score": 1,
                    "created_utc": 1652961393.0,
                    "response": "I think it's crazy that anyone needs permission to mine. I could make literally any business and consume as much power as I wanted but God forbid that power goes to mining Bitcoin. THEN we have an issue.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i96xb65",
                            "author": "ElephantsAreHeavy",
                            "score": 1,
                            "created_utc": 1652961652.0,
                            "response": "You do not need government permission to mine. The government 'giving' you permission is saving face and wasting time.\n\nAlmost like Putin would allow Ukraine to remain independent. It is not up to him.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9707ln",
                            "author": "Hadse",
                            "score": 1,
                            "created_utc": 1652963319.0,
                            "response": "As certain companies you got much cheaper electricity by the state. Been a question if crypto mining certifies as such company.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i96vtmx",
                    "author": "New_Dawn",
                    "score": 1,
                    "created_utc": 1652960749.0,
                    "response": "RightToMine",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i96x5uv",
                    "author": "ElephantsAreHeavy",
                    "score": 1,
                    "created_utc": 1652961564.0,
                    "response": "I was not aware permission was required to mine bitcoin. As long as you abide to the consensus rules in the code, you can mine.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i96ylyq",
                    "author": "iceman0855",
                    "score": 1,
                    "created_utc": 1652962408.0,
                    "response": "Tldr;   \nThree parties wanted to ban mining because of the amount of energy required to do so. They suggested the energy available should be spent elsewhere because we are coming to a point where we need to prioritize energy-use.\n\nBasically all the other parties said that was a bad deal, because you can't discriminate on how energy should be used. A few days later it was in the media that electricity companies in the north produced too much energy so that it only went to waste and that the electricity there could be free in some stages in the summer.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}