{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uqwoab",
            "title": "President Nayib Bukele Announces 44 Countries To Meet In El Salvador To Discuss Bitcoin",
            "url": "https://markethive.com/rico40/blog/presidentnayibbukeleannounces44countriestomeetinelsalvadortodiscussbitcoin",
            "author": "RonTate",
            "created_utc": 1652709695.0,
            "score": 9,
            "num_comments": 1,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8tkx4w",
                    "author": "Impalmator",
                    "score": 1,
                    "created_utc": 1652710255.0,
                    "response": "Misread it as Nayib Bukkake.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uqwzlh",
            "title": "EW Analysis Counting Bitcoin waves Leg Down Crash🚣‍♂️ 🌊",
            "url": "https://youtu.be/rcN9KOMf5vM",
            "author": "_BitBull_",
            "created_utc": 1652710569.0,
            "score": 2,
            "num_comments": 0,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uqx1ok",
            "title": "How to calculate Risk associated with bitcoin?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uqx1ok/how_to_calculate_risk_associated_with_bitcoin/",
            "author": "crasshumor",
            "created_utc": 1652710737.0,
            "score": 2,
            "num_comments": 15,
            "subreddit": "Bitcoin",
            "selftext": "Using excel, apart from Standard Deviation of Price/Returns, how else can I calculate risk associated with Bitcoin?\n\nWhat would be the most appropriate benchmark to compare the results of a bitcoin?",
            "stickied": false,
            "comments": [
                {
                    "id": "i8tm856",
                    "author": "sheldonth",
                    "score": 4,
                    "created_utc": 1652710836.0,
                    "response": "You’ve gotta risk it all to have it all.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8tsz0s",
                    "author": "NiceDoctorBeam",
                    "score": 1,
                    "created_utc": 1652713704.0,
                    "response": "When your private keys are properly secured, nobody can confiscate your Bitcoin.\n\nNobody can merely \"print\" tens of trillions of Bitcoin from thin air, backed by nothing.  Thus, no dickhead politician nor criminal central banker can devalue Bitcoin.  Bitcoin's supply is capped.  No more than 21 million will ever be created.  There's a 100% certainty that the USD will continue to be devalued.\n\nLet's look at Bitcoin's long term average ROI.\n\nFive years ago, the price was $2018.  Today it's about $30,000.  That works out to about 72% per year, compounded for five years.\n\nTen years ago, the price was about $6.  That works out to 134% per year, compounded for ten years in a row.  Yes, one Bitcoin sells for five thousand TIMES what it sold for just ten years ago.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8tt8ox",
                            "author": "crasshumor",
                            "score": 1,
                            "created_utc": 1652713817.0,
                            "response": "That's all good but my question was more of a statistical question. How do I quantify the risk in bitcoin investment. Normal shares have Beta, SD, Sharpe and Info Ratio etc. So what can I use to quantify risk in Btc",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8tu78z",
                                    "author": "NiceDoctorBeam",
                                    "score": 1,
                                    "created_utc": 1652714221.0,
                                    "response": "Guess and check.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8txb7l",
                                            "author": "extrastone",
                                            "score": 1,
                                            "created_utc": 1652715508.0,
                                            "response": "The check part sounds like a lot of fun!",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8u55t8",
                                                    "author": "NiceDoctorBeam",
                                                    "score": 1,
                                                    "created_utc": 1652718686.0,
                                                    "response": "Always wear seat belts.  \n\nWhen riding a bike, always wear a helmet (gloves are a pretty good idea, too).\n\nLook both ways before crossing - even on one-way streets.\n\nRemain seated until the ride has come to a complete stop.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8twto0",
                    "author": "extrastone",
                    "score": 1,
                    "created_utc": 1652715307.0,
                    "response": "Let's think about a few milestones.  To me a real bitcoin milestone is: \"we only accept bitcoin here.\"\n\nDrug dealer says: \"we only accept bitcoin.\"  Done that.\n\nSmall business says: \"we only accept bitcoin.\"  Not yet.\n\nLandlord says: \"I only accept bitcoin.\"  Not yet.\n\nLarge business says: \"we only accept bitcoin.\"  Not yet.\n\nNow let's think about how much bitcoin would be needed to service each one of these businesses.\n\nAt the same time we need to think about how pathetic local currencies would have to become for people to start refusing to accept them.\n\nThen we have to realize that by this time bitcoin will not have a real value in local currency but will probably have a value in barrels of oil because local currency will be so terrible that it won't even be worth relating to.\n\nSo at some point a non-negligible number of the world's businesses will only accept bitcoin and thus their customers will try to work for employers that pay in bitcoin.  At that point bitcoin will be easily valued at several hundred thousand dollars.  That will be more than a tripling.  Given the amount of risk involved in bitcoin it's still a buy.\n\nSend me a DM.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8u12pa",
                            "author": "mcintoshshowoff",
                            "score": 1,
                            "created_utc": 1652717035.0,
                            "response": ">So at some point a non-negligible number of the world's businesses will only accept bitcoin and thus their customers will try to work for employers that pay in bitcoin. At that point bitcoin will be easily valued at several hundred thousand dollars. That will be more than a tripling. Given the amount of risk involved in bitcoin it's still a buy.\n\nyeah, right.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8tyyp0",
                    "author": "mcintoshshowoff",
                    "score": 1,
                    "created_utc": 1652716180.0,
                    "response": "There is no way to accurately capture the risk of bitcoin because there's no way to value bitcoin. It doesn't return capital, it doesn't pay a dividend, and there's the left-tail risk of the west banning it, but you can't really quantify that. You're going to get a bunch of ridiculous answers here because no one here understands what risk management is or they wouldn't have their money tied up in bitcoin or waste their time here.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8tz4q4",
                            "author": "crasshumor",
                            "score": 1,
                            "created_utc": 1652716250.0,
                            "response": "What's a left tail risk?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8tzi58",
                                    "author": "mcintoshshowoff",
                                    "score": 1,
                                    "created_utc": 1652716402.0,
                                    "response": "extreme downside risk. a crypto ban would effectively take the price to zero relative to the current price.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8tz1b1",
                    "author": "_main_chain_",
                    "score": 1,
                    "created_utc": 1652716211.0,
                    "response": "Literally nobody has that answer. Please find it for us.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8u0biy",
                    "author": "No_Insurance6064",
                    "score": 1,
                    "created_utc": 1652716731.0,
                    "response": "I figured out that it is bigger risk to not own any BTC/sat amount",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8uahi1",
                    "author": "Ok_Aerie3546",
                    "score": 1,
                    "created_utc": 1652720783.0,
                    "response": "You compare alpha, beta, std dev, sharpe ratio and r2 with other asset classes. Thats the best you can do honestly.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}