{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uvbvkq",
            "title": "BEGINNERS / PRO ADVICE",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/uvbvkq/beginners_pro_advice/",
            "author": "Anthony__cook",
            "created_utc": 1653229057.0,
            "score": 15,
            "num_comments": 21,
            "subreddit": "BitcoinBeginners",
            "selftext": "over a long period of time, I've helped family and friends get started on crypto using coinbase but a recent research has shown the risk involved in storing your crypto in a centralized exchange platform.\n\nThe filling with sec states that \" in event of bankruptcy crypto assets held by the exchange could be considered property of the bankruptcy proceedings, and customers could be treated as a general unsecured creditors. \nAn unsecured creditor would be one of the last to be paid in any bankruptcy and the last in line for claims. \n\nThis means they take your money when they go bankrupt.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9kdzok",
                    "author": "bitusher",
                    "score": 10,
                    "created_utc": 1653229362.0,
                    "response": "Its much worse than this \n\nBitcoin is P2P currency. Storing bitcoins on exchanges, banks or web wallets makes you insecure and makes the whole ecosystem insecure indirectly by centralizing bitcoin. \n\nBitcoin is a bearer asset with ~immutable txs unlike fiat. This means that internal or external thieves  prefer to target what they can take and won't be reversed like digital fiat. Having centralized exchanges and banks store BTC makes it a desirable target for these attacks. \n\n\nThere are privacy concerns with storing your bitcoins with third parties\n\nYou are exposed to tax theft, asset forfeiture theft , civil theft \n\nYou are exposed to exit theft \n\nYou are exposed to the exchange refusing to support a split asset where they steal it , throw it away, or delaying a payout causing you to lose opportunity costs and profit\n\nYou place Bitcoin as a whole under more systemic risk by tempting exchanges to use fractional reserve banking and giving them too much influence\n\nYou potentially reduce the probability that your investment will appreciate in value because no exchanges are doing provable audits and they might be fractional. The more Bitcoin you personally control the more likely it will appreciate in value.\n\nExchanges in many jurisdictions are allowed to legally ~~take~~ steal your bitcoin in as little as 3 years on inactivity\n\nhttps://help.coinbase.com/en/coinbase/managing-my-account/other/escheatment-and-unclaimed-funds\n\n**Never store your bitcoins in a web wallet, custodian , or exchange . You own 0 bitcoins if you do not control your private keys.**",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9lswup",
                            "author": "laborans",
                            "score": 1,
                            "created_utc": 1653251867.0,
                            "response": "This is helpful",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9kdc73",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653229058.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9l7afr",
                    "author": "ross-um88",
                    "score": 1,
                    "created_utc": 1653242067.0,
                    "response": "So where do you store it",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9lc8k5",
                            "author": "bitusher",
                            "score": 5,
                            "created_utc": 1653244253.0,
                            "response": "If you have under 1k usd of Bitcoin just use an open source wallet in ios or android like one of these \n\nhttps://walletscrutiny.com\n\nhttps://docs.google.com/spreadsheets/d/1aZ1zbaUEzCo9NCctN8-eL2VLIiSdY009tTJvRXDUWEw/edit#gid=0\n\nhttps://www.reddit.com/r/BitcoinBeginners/comments/g42ijd/faq_for_beginners/\n\n\nOtherwise get a hardware wallet like one listed in the FAQ above",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9ljvwc",
                    "author": "TeddyMGTOW",
                    "score": 1,
                    "created_utc": 1653247721.0,
                    "response": "Coinbase will probably end up the Google of the Internet. That being said after you get your feet where it's probably a good idea to research hardware wallets and paper Cold storage.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}