{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "urgk72",
            "title": "Want to get yours send a DM, you don’t need to pay me for anything I just give you the tutorial that’s all you get yours and be happy 😊",
            "url": "https://v.redd.it/829un06ihzz81",
            "author": "Marilynflinda",
            "created_utc": 1652770528.0,
            "score": 0,
            "num_comments": 0,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "urgjbo",
            "title": "Hardware wallet or Software wallet?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/urgjbo/hardware_wallet_or_software_wallet/",
            "author": "akshaykmvlly",
            "created_utc": 1652770425.0,
            "score": 1,
            "num_comments": 10,
            "subreddit": "Bitcoin",
            "selftext": "I have this doubt, whether we use a hardware wallet like Trezor or Ledger, or a software wallet like a mobile app like Mycelium or Green wallet. In all those cases, we just have to store our seed phrase written somewhere.\nSo why do we need to spend on Hardware wallets as we just store our seed phrase in the same way in both the cases.\nOr Am I missing something?",
            "stickied": false,
            "comments": [
                {
                    "id": "i8x3wsr",
                    "author": "rsa121717",
                    "score": 4,
                    "created_utc": 1652771160.0,
                    "response": "Software wallets can be exploited by hackers, online, unlike hardware wallets (if you’re mindful when accessing the hardware wallet)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8x5hhl",
                    "author": "Thanatos_1",
                    "score": 3,
                    "created_utc": 1652772546.0,
                    "response": "The distinction isn't really between hardware and software wallet. It's between cold storage and hot storage.\n\nCold storage means, the private keys/seed are never on a device that touches the internet. For example a permanently offline computer or a hardware wallet.\n\nHot storage means, the private keys/seed are on an internet connected machine, even if the machine is only partially connected, it's still hot, because the seed could have been leaked outside.\n\nYou can use software wallets for cold storage. For example by using Electrum on Tails and never connecting to the internet.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8xl920",
                            "author": "akshaykmvlly",
                            "score": 1,
                            "created_utc": 1652786132.0,
                            "response": "I'm afraid to take my Bitcoin of the exchange",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8x5hz6",
                    "author": "BusinessBreakfast3",
                    "score": 3,
                    "created_utc": 1652772558.0,
                    "response": "A software wallet's seed phrase will appear on a device used for other things. \n\nA hardware wallet's seed phrase will not appear on a device used for other things.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8x4zoc",
                    "author": "gotamm",
                    "score": 2,
                    "created_utc": 1652772102.0,
                    "response": "You choose a hardware wallet to be able to store your seed offline, while using it to sign transactions!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8xhhac",
                    "author": "TheArabianNights",
                    "score": 1,
                    "created_utc": 1652783326.0,
                    "response": "[Aantonop Mobile wallet Vs Hardware wallet explanation](https://youtu.be/lx6PRNEUu6Q)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8x49v8",
                    "author": "Silver13Foxx",
                    "score": 3,
                    "created_utc": 1652771473.0,
                    "response": "short answer: trezor",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8xc7tn",
                            "author": "Amoci",
                            "score": 2,
                            "created_utc": 1652778727.0,
                            "response": "Long answer: coldcard",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8xeg9b",
                                    "author": "Thom5001",
                                    "score": 2,
                                    "created_utc": 1652780767.0,
                                    "response": "This",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8xgl28",
                    "author": "Mallardshead",
                    "score": 1,
                    "created_utc": 1652782587.0,
                    "response": "What are the most secure systems in the world? Ones that use both hardware and software to secure themselves. Think medical devices, airplanes, bitcoin, etc. Software wallets are perpetually online and you're relying on a 3rd party server. This means they're easier to hack. No hacker needs access to physical hardware in the physical world, so they can sit on their couch 5000 miles away brute forcing and running various automated tools probing for weaknesses and any bits of information that they can pool. Software wallets are fine for small amounts and spending. You don't even need to store keys securely for these. They're disposable checking accounts. Use them a few times then generate a new one. Hard wallets however, are where your savings go.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "urgmqh",
            "title": "question about deflationary currency.",
            "url": "https://www.reddit.com/r/Bitcoin/comments/urgmqh/question_about_deflationary_currency/",
            "author": "SuitDistinct",
            "created_utc": 1652770819.0,
            "score": 4,
            "num_comments": 8,
            "subreddit": "Bitcoin",
            "selftext": "Bitcoin is currently being subsidized by block rewards allowing miners to secure to network even if there is no one using the network and paying fees. The idea is that eventually adoption will pick up and the transaction fees will pay for network security. But what if everyone holds onto their Bitcoin and not spend it ?",
            "stickied": false,
            "comments": [
                {
                    "id": "i8x48ul",
                    "author": "Thanatos_1",
                    "score": 3,
                    "created_utc": 1652771449.0,
                    "response": "> But what if everyone holds onto their Bitcoin and not spend it ?\n\nThen you also don't need confirmations/blocks to secure a recent transaction. Everything just sits there.\n\nEconomically, there's no difference between you incurring the cost of mining by mining yourself, or by paying someone to mine for you. You pay for what you want to use.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8x54c8",
                            "author": "SuitDistinct",
                            "score": 1,
                            "created_utc": 1652772218.0,
                            "response": "So in that case, when miners mine they won't produce any new blocks ?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8x5lhw",
                                    "author": "Thanatos_1",
                                    "score": 3,
                                    "created_utc": 1652772644.0,
                                    "response": "When miners mine, they produce blocks, which include the transactions and the fees of the transactions. If nobody mines, but you want a block produced, you produce it yourself. It costs (approximately) the same for you to either buy the electricity to mine yourself, or pay someone else to mine for you.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8xklq4",
                                    "author": "Halo22B",
                                    "score": 3,
                                    "created_utc": 1652785685.0,
                                    "response": "No they continue to mine. The blocks just don't have any transactions. Every block mined makes the previous block more secure, so even empty blocks are important.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8xf6hb",
                    "author": "dat9553",
                    "score": 1,
                    "created_utc": 1652781394.0,
                    "response": "miners will reduce their mining scale to collect mining reward, there will be full of empty blocks by that time. But it's ok, because in that scenario, people have already put their btc in good use, like Lightning Network channels, to trade to each other, and no one need to close their channels",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8xft1n",
                    "author": "Mallardshead",
                    "score": 1,
                    "created_utc": 1652781922.0,
                    "response": "Empty blocks or blocks half full. Nothing changes, the block subsidy is fixed and halves every 210k blocks (~4 years). The only difference is miners wouldn't receive transaction fees, which are small (~2% of current subsidy).",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8xueg7",
                    "author": "swgo1",
                    "score": 1,
                    "created_utc": 1652791618.0,
                    "response": "Lots of people just hold gold. It keeps its value. The more that hold the less the supply. The less the supply the higher the price. The higher the price the more people will use and hold. Repeat.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8xv33x",
                    "author": "Hank___Scorpio",
                    "score": 1,
                    "created_utc": 1652791977.0,
                    "response": "If bitcoin was the dominant superior money, wouldn't you demand to be paid in bitcoin for your services? Someone would have to spend their bitcoin to hire you.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}