{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uu4mz9",
            "title": "Always be careful when you are new to the crypto world…Beware of www.unionbazaar.com trading scam/TheJoshGausdenScam",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/uu4mz9/always_be_careful_when_you_are_new_to_the_crypto/",
            "author": "The_JoshGausden_Scam",
            "created_utc": 1653071846.0,
            "score": 1,
            "num_comments": 4,
            "subreddit": "BitcoinBeginners",
            "selftext": "This is another trading scam website. Please beware. The scammer pretended/copied the account of Josh Gausden. Mr. Josh Gausden is a “finance guy” in instagram with 130k+ followers, and with a twitter account as well. On his bio he listed he was on reuters and yahoonews as well.I checked in Reuters linked and indeed he was mentioned as a young 20-something finance dude and wrote a book too. Impressive right?! The article was done by Mr. Vick Jack and William Schomberg of Reuters, giving Josh a ‘solid background’. So, was pretty confident I am following a credible person. Of course, I was wise enough to do the check if the Reuters article is legit, and it is. Then Josh contacted me on a different instagram account about some finance/trading information. Of course, checked again his first account to verify about the second account because we all know how scammers create other accounts. So, on his Instagram Bio he listed the second instagram account there. Along with the reuters, yahoonews, book link and what-have-you that he’s got. Well, so far everything verified. Decided  reply to the guy, got to talking on whatapp with his “business account” number there. He suggested to sign up on the trading platform www.unionbazaar.com where he said he works/or a part of. Did the signing up and he ended as my personal finance advisor. Long story short, lost a lot and I mean a looooot of money for falling for his b.s. Just making a post here on reddit so no one will fall for it as well. Be very careful![www.unionbazaar.com](www.unionbazaar.com)",
            "stickied": false,
            "comments": [
                {
                    "id": "i9d0ov7",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653071846.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9d0ow1",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653071846.0,
                    "response": "For trading related topics, there is also /r/bitcointrading\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9d101p",
                            "author": "The_JoshGausden_Scam",
                            "score": 1,
                            "created_utc": 1653071990.0,
                            "response": "!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9d136v",
                    "author": "Narmotur",
                    "score": 1,
                    "created_utc": 1653072030.0,
                    "response": "Unfortunately nobody who would fall victim to the scam will find your post before they are also victimized. Additionally, scam websites don't live very long, and identities are easy to change.\n\nSorry for your loss.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9d145s",
                    "author": "The_JoshGausden_Scam",
                    "score": 1,
                    "created_utc": 1653072042.0,
                    "response": "For the bitcoin newbies like me.. don’t fall for these type of scams.. instagram and social media “influencers”. They usually also follow each other.. so beware!",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}