{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "v02wfn",
            "title": "If a currency is backed by debt and the federal government starts canceling debt, such as student loans, what happens to the debt based currency?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/v02wfn/if_a_currency_is_backed_by_debt_and_the_federal/",
            "author": "hyperinflationUSA",
            "created_utc": 1653795642.0,
            "score": 15,
            "num_comments": 26,
            "subreddit": "Bitcoin",
            "selftext": "I can imagine that future barrowers of debt would take on even more debt. Going to college in the future would mean why choose the cheaper college, why live in the cheapest apartment possible or live with parents while in college. Go to the most expesnive housing and most expensive college possible cus who cares the debt might get forgiven. \n\n&#x200B;\n\nThey could do the same thing for mortgages, car loans, even countries could start demanding debt forgiveness instead of hyperinflating their own currency to repay the debt. The true madness is about to begin. The fiat currency is becoming rapidly more and more toxic. Hyperinflation insures and the path to new era of sound money hopefully follows. Get to the bitcoin lifeboats",
            "stickied": false,
            "comments": [
                {
                    "id": "iae3ezr",
                    "author": "Nichoros_Strategy",
                    "score": 5,
                    "created_utc": 1653797355.0,
                    "response": "I think the fiat currencies are more \"backed\" by the debt of the Country/Government itself, which, the US for example, has used (probably the majority of) to the build up and buy the largest military in the world, now we can say that the country is backed by its military and the debt allowed it to be possible at scale. This is quite the nasty deal though over the decades and centuries, because it means larger scale wars and a lot of death around the world over countries competing with armies that no one would be able to afford without all that debt. The US very may well have not become \"the greatest country in the world\" if it did not pull off such huge military wins with both World War 1 and World War 2 (the looting that the WW1 victors did to Germany is also kind of what led to Adolf Hitler taking power) all while taking relatively little damage to its own military and homeland, which is rough to say considering how many deaths there still were over it.\n\nThey have also used the debt to fund highly expensive Government programs, so one could argue that this also helps back the country. In a better world, it would be nice if countries could at least decide/agree with each other to use the vast majority of their debt capacity on building better infrastructure all the time, funding scientific research, educating its people thoroughly rather than just wanting them to be dumb consumers and workhorses, maybe more cultural activities that give the country a unique identity... instead of gigantic militaries. I suppose that would be difficult realistically, because of one simple emotion: paranoia.\n\nDebt is also a way to force/motivate people into doing more work, so in this regard the debt of the citizens supports the country's workforce. If they cancelled all student debt, or even a percentage of it, I would imagine it going a few potential ways: Either the Government only cancels public debt (those who got their loan from the Government) meaning private loans that people took from banks get no help. Or if they want to help everyone equally, they decide to take on more Sovereign debt to pay the banks and save them the losses. Or they just decide to F the banks and clear it which would do damage to the banking industry (probably the least likely thing, banks practically own Governments).\n\nIn any case here, if people were freed of all or some of their debts, depending on how much it is, more people would probably opt to work less hours, do an easier job that pays less, on the positive side, more may try to become entrepreneurs, which is a positive thing for the future but takes time to show results for the country, and of course many would fail.\n\nThis is all preferable as far as the Government is concerned over a Gold/Bitcoin standard, BUT, a Country that has reached the point where its currency will collapse from the inflation all the debt creates (new money circulating in the system), will cause a desperation and the Country may have no choice but to break out their commodity reserves and make a deal with their people that they can buy these resources (Gold, Silver, Bitcoin, Oil, Corn, whatever) directly from the Government's reserves at a nice discount, thus giving new value to the currency. They could also jack up interest rates until everyone is hoarding fiat and prices collapse instead, along with jobs, but they would need to raise it a lot, it would also hurt the Government itself and its ability to support more of its own debt, and of course, the banking industry when it gets to the point where very few in the country are willing to take their loans.\n\nSo, I personally think when the chips are down, they're more likely to go with a new Standard before really raising interest rates to where they'd need to be.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iae5ppj",
                            "author": "Nada_Lives",
                            "score": 2,
                            "created_utc": 1653798870.0,
                            "response": "Out with the old standard, in with the new. We've got a million of 'em!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iae72l2",
                    "author": "ndgoLiberty",
                    "score": 7,
                    "created_utc": 1653799787.0,
                    "response": "You’ve got fiat figured out.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iae9ydb",
                    "author": "igadjeed",
                    "score": 2,
                    "created_utc": 1653801842.0,
                    "response": "Fiat debt is not relevant to Bitcoin",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iae2c1c",
                    "author": "road22",
                    "score": 4,
                    "created_utc": 1653796644.0,
                    "response": "It is a bit more complex than that.\n\nMortgage debt and Auto loan debt, there is a underlying asset that can be foreclosed, repossessed, and resold.  It would be hard for the lender of student loans, who paid for the college education to confiscate the worthless knowledge students learned.\n\nBut when you live in an world where all debt is cancelled on homes, cars, education, and given out freely it is called communism.  Never really works because of the huge supply shortage.  Nobody works because they get paid the same if they dont work.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iae2mfe",
                            "author": "hyperinflationUSA",
                            "score": 2,
                            "created_utc": 1653796831.0,
                            "response": "Wasn't there a foreclosure ban. A eviction ban makes taking the house pointless",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iae913c",
                                    "author": "road22",
                                    "score": 1,
                                    "created_utc": 1653801162.0,
                                    "response": "Yes when the forced everyone to stay home, but that did not last long.\n\nWhen stock market keeps crashing, business start closing down, inflation gets out of control as we enter a inflationary depression, they might have to give rent/ home loan forgiveness again.   Then we are really fucked.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iaeewau",
                                            "author": "Spl00ky",
                                            "score": 1,
                                            "created_utc": 1653805704.0,
                                            "response": "If businesses get shut down now, it won't be from inflation but rather FED interest rate hikes that make borrowing money more costly. Theoretically, the FED could increase interest rates to 5% or some other number to really bring an end to the current hot inflation numbers, however, obviously the economy might not be able to handle that suddenly.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "iae5ppr",
                            "author": "theslapzone",
                            "score": 0,
                            "created_utc": 1653798870.0,
                            "response": "lul",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iaedb8c",
                            "author": "DeepFuckingVision",
                            "score": 0,
                            "created_utc": 1653804409.0,
                            "response": "Student debt is a lesson for professors and schools not to shovel dog shit. New school is they pay us for street knowledge",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iae3zjw",
                    "author": "uclatommy",
                    "score": 1,
                    "created_utc": 1653797731.0,
                    "response": "What do you mean by a \"currency backed by debt\"?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iae5du1",
                            "author": "RogerWilco357",
                            "score": 2,
                            "created_utc": 1653798652.0,
                            "response": "In Fractional reserve banking, banks can loan money that they don't have and the value of that loan gets entered as an asset on the balance sheet effectively creating money. Now fractional reserve is practically infinite so ever dollar in existence represents a debt owed. Modern fiat is considered to be debt money. Saying it is backed by debt isn't really accurate, since it IS debt. It is backed by bullets and bombs.\n\nIf all debts were paid there would be no money, or very little.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iae6853",
                                    "author": "Nichoros_Strategy",
                                    "score": 3,
                                    "created_utc": 1653799219.0,
                                    "response": "Consider the Sovereign debt too, though, it's functionally different from the debt of citizens. With the direction that all Countries have gone in the modern age, the issue remains that if any Government had decided a long time ago to not \"follow the herd\" and max out its own Sovereign Debt, and stick to those principles no matter what, that country would probably be invaded and easily defeated by the military of a debt based country. This has to be the biggest reason that countries are \"backed by debt\". The currency won't be having any value at all if the country gets annexed in war. That country would likely be an even juicier victory since a state that has been in full Austrian Economic mode, has probably got a whole lot of reserves to steal (Gold, Silver, Oil, Bitcoin, etc, whatever they mainly used to back their currency).",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iafbkh7",
                                            "author": "No_Release6675",
                                            "score": 1,
                                            "created_utc": 1653831267.0,
                                            "response": "Interesting point",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "iaeey9p",
                                    "author": "Spl00ky",
                                    "score": 2,
                                    "created_utc": 1653805749.0,
                                    "response": "Bitcoin would do nothing to stop IOUs from banks.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "iaf7t5m",
                                    "author": "outdatedrhombus",
                                    "score": 1,
                                    "created_utc": 1653829276.0,
                                    "response": "Your only partially right. Debt does increase the monetary supply but just not in the way your suggesting. Loans are assets to banks but they have to be financed by depositors - you can't lend out any cash if you don't have it in the first place. \n\nIt's really very interesting",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iae74ea",
                    "author": "southbayellay",
                    "score": 1,
                    "created_utc": 1653799821.0,
                    "response": "Did you say currency is backed by debt?\n\nAm I smoking crazy rocks?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaei0o7",
                    "author": "Bitcoin__Hodler",
                    "score": 1,
                    "created_utc": 1653808328.0,
                    "response": "Your Debt Is Someone Else's Asset",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaf6qam",
                    "author": "Ok_Aerie3546",
                    "score": 1,
                    "created_utc": 1653828636.0,
                    "response": "Its not backed by anything.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iafi2fd",
                    "author": "Amins66",
                    "score": 1,
                    "created_utc": 1653834519.0,
                    "response": "Gold, Silver, Real Estate & Bitcoin.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iafz8yn",
                    "author": "Jezzes",
                    "score": 1,
                    "created_utc": 1653842257.0,
                    "response": "Currency will get more imaginary. When faith is lost it will collapse.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iahjaxl",
                    "author": "Magikalmonkey",
                    "score": 1,
                    "created_utc": 1653869427.0,
                    "response": "GDP goes down",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iahjqvi",
                    "author": "GermanGenius",
                    "score": 1,
                    "created_utc": 1653869666.0,
                    "response": "I’ve paid off all my loans and I still support this. The system needs to change!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaei7xf",
                    "author": "Academic-Daikon-8662",
                    "score": 0,
                    "created_utc": 1653808504.0,
                    "response": "🚽",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}