{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uyk3ec",
            "title": "Pawn2Own Challenge on Bitcoin Core?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uyk3ec/pawn2own_challenge_on_bitcoin_core/",
            "author": "SnooBunnies3560",
            "created_utc": 1653606456.0,
            "score": 0,
            "num_comments": 6,
            "subreddit": "Bitcoin",
            "selftext": "It would be awesome to see a hacking challenge on Bitcoin's source code like what happened to Firefox this year in Vancouver, and Windows and Ubuntu last year (vulnerability which granted Ubuntu access to root access) at some other venue. These cyber punks find vulnerabilities that put me in awe. Should we challenge them to make Bitcoin stronger because we may never be sure if Bitcoin is 100% secured. Also, we need to do have a bounty money pot so who discovered a vulnerability gets awarded.",
            "stickied": false,
            "comments": [
                {
                    "id": "ia4pzna",
                    "author": "wkw3",
                    "score": 7,
                    "created_utc": 1653609028.0,
                    "response": "Bitcoin has been under constant attack by very skilled hackers since its inception, with potential prizes that put any contest to shame.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia4zz5p",
                    "author": "squareOfTwo",
                    "score": 6,
                    "created_utc": 1653613930.0,
                    "response": "The bounty is billions already, your late to the party.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia6ceo5",
                    "author": "LuKeNuKuM",
                    "score": 2,
                    "created_utc": 1653646088.0,
                    "response": "I'm pretty sure there are people trying all the time. Yet if it was hacked it would seriously devalue, it's futile unless you could pull it off secretly the BTC becomes worthless. There would be no winner in terms of the BTC bounty. Unless perhaps it was a government actor who can then be pleased they'd brought it down and we'll all have to continue drowning in fiat.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia9n6fy",
                    "author": "life762",
                    "score": 2,
                    "created_utc": 1653703903.0,
                    "response": "> Also, we need to do have a bounty money pot so who discovered a vulnerability gets awarded.\n\nSecurity researchers can just consider the Bitcoin available at the earliest addresses belonging to Satoshi, like [1A1zP1eP5QGefi2DMPTfTL5SLmv7DivfNa](https://mempool.space/address/1A1zP1eP5QGefi2DMPTfTL5SLmv7DivfNa), to be the bounty. If anyone can take those coins it will be a well-deserved reward.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iabce1n",
                            "author": "Independent-Snow-129",
                            "score": 1,
                            "created_utc": 1653747218.0,
                            "response": "By verifying the ledger, you then confirm the coins are still available?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia4kryt",
                    "author": "SnooBunnies3560",
                    "score": 0,
                    "created_utc": 1653606529.0,
                    "response": "Correction: Pwn2Own",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}