{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uwmrxu",
            "title": "If every homeowner in the US bought 1 Bitcoin after 20% of them have their Bitcoin, there will be no bitcoin left.",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uwmrxu/if_every_homeowner_in_the_us_bought_1_bitcoin/",
            "author": "88eth",
            "created_utc": 1653384300.0,
            "score": 0,
            "num_comments": 17,
            "subreddit": "Bitcoin",
            "selftext": "There are 79.36 million owner-occupied homes in the US.\n  \nTheres 21 million Bitcoin (probably a bit less, since some got lost.)\n  \nNow after the first 20 million US homeowners bought just 1 Bitcoin each, theres no Bitcoin left.\n  \nThe other 60 million Homeowners in the US wont be able to get a Bitcoin without massively driving the price up.\n  \nPretty awesome eh? And there isnt just the US. Lots of my friends in Kuwait, South Korea, China, Russia, Germany, UK, Spain, Italy also are buying up lots of Bitcoins!\n  \nImagine what prices homes in the US are at? Like 1 million at average ? But they can just \"print\" unlimited homes. Theres enough land in the US to build 20,50,100 million more homes.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9sgifa",
                    "author": "disgruntledtr4der",
                    "score": 7,
                    "created_utc": 1653387166.0,
                    "response": "at least 2million btc is lost , not including satoshis cold wallet of 1mil",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9si8ep",
                            "author": "Jay314stl",
                            "score": 1,
                            "created_utc": 1653388574.0,
                            "response": "There will be 14-15 million total in the end.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9sfg1p",
                    "author": "Hussard_Fou",
                    "score": 10,
                    "created_utc": 1653386246.0,
                    "response": "And yet another useless stat...",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9shk8s",
                    "author": "bryanchicken",
                    "score": 9,
                    "created_utc": 1653388028.0,
                    "response": "I want my time refunded from reading this",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9svcf9",
                    "author": "MartinCavallo",
                    "score": 2,
                    "created_utc": 1653396974.0,
                    "response": "In some ways it’s amazing how little it would take for liftoff",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9sdmgp",
                    "author": "SmoothGoing",
                    "score": 4,
                    "created_utc": 1653384576.0,
                    "response": "Average house price is not 1 million. It's lower than that.\n\nPeople generally need shelter. No one needs bitcoin.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9se5ag",
                            "author": "Asum_chum",
                            "score": 4,
                            "created_utc": 1653385054.0,
                            "response": "“No one needs bitcoin”\n\nMaybe one could do with checking their privilege?",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9sdqra",
                            "author": "88eth",
                            "score": 2,
                            "created_utc": 1653384687.0,
                            "response": "Lots of places where you cannot find a home for under $1m.\n  \nBut i jut looked it up for 2022 its $428,700 average home price.\n  \nSo thats 14 Bitcoin lol. Imagine every home owner wanted to own 14 Bitcoin.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9su7bo",
                                    "author": "TOmarsBABY",
                                    "score": 2,
                                    "created_utc": 1653396362.0,
                                    "response": "Average home price in Canada is $800k",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9se1qv",
                            "author": "88eth",
                            "score": 2,
                            "created_utc": 1653384964.0,
                            "response": "> People generally need shelter. No one needs bitcoin.\n\nYou did not get the point. It means if you have a bitcoin it will probably be worth a lot more than a home some day. I already am living from my Bitcoin. They pay the mortgage since 2017.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9si6xz",
                            "author": "Jay314stl",
                            "score": 1,
                            "created_utc": 1653388541.0,
                            "response": "BTC is shelter.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9smq95",
                            "author": "nullama",
                            "score": 1,
                            "created_utc": 1653391855.0,
                            "response": "It depends on where you're looking:\n\n[Australia's median house price hits a record $1.066 million\n](https://www.domain.com.au/news/australias-median-house-price-hits-1-066-million-but-have-prices-peaked-1114685/)",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9smh6f",
                    "author": "Troy_Ounces",
                    "score": 1,
                    "created_utc": 1653391682.0,
                    "response": "Worst TA hall of fame contender",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9sjyjn",
                    "author": "gigicaviteazu",
                    "score": 1,
                    "created_utc": 1653389915.0,
                    "response": "who says you have to be a full coiner?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9smjq7",
                    "author": "nullama",
                    "score": 1,
                    "created_utc": 1653391731.0,
                    "response": "That's what scarcity means...\n\nThere's also a limited amount of land where you can put homes.\n\nLimited amount of a lot of things.\n\nBitcoin is just one of them.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9t2wc8",
                    "author": "horsecyack",
                    "score": 1,
                    "created_utc": 1653400691.0,
                    "response": "This is like an elementary post, it worries me sometimes",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9t8eyh",
                    "author": "Courimis",
                    "score": 1,
                    "created_utc": 1653403144.0,
                    "response": "“If 21 million people bought one Bitcoin, there would be no more bitcoins”",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uwmsao",
            "title": "Private Bitcoin Node over I2P and Tor only",
            "url": "https://youtu.be/2kyt6O-T0nA",
            "author": "didnt_die_a_hero",
            "created_utc": 1653384348.0,
            "score": 13,
            "num_comments": 4,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9t4yxy",
                    "author": "didnt_die_a_hero",
                    "score": 2,
                    "created_utc": 1653401641.0,
                    "response": "(Not the creator I just always learn a ton from this dude so I like to share his stuff)\n\nSo…\nIf you are asking about being always over tor even before you connect your I2P, he’s pretty paranoid, that’s all covered, you’re never in the clear nor are you ever connected to any other node, (like some wallet’s)\nIf you’re asking how to do the Tor bit to begin with the Tor video link’s in the description: \nhttps://youtu.be/57GW5Q2jdvw\n\nBeyond that I must crib an answer from the autistic software itself: “Tor cannot help you if you use it wrong”.\nlol",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9tfc88",
                            "author": "Independent-Snow-129",
                            "score": 2,
                            "created_utc": 1653406070.0,
                            "response": "I see, you make sure to have trustworthy peers for it to be a successful private process .\n\nDo you think there's some easier path to achieve privacy  ?\n\nIf you can't connect to a different Tor peer which you control or give full trust, are you not opening more risk vector and making all this process irrelevant?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9sh1yz",
                    "author": "Independent-Snow-129",
                    "score": 1,
                    "created_utc": 1653387614.0,
                    "response": "Do you have to set something with Tor for it to be properly private?\n\nWhere's your first connection bouncing to with tor?\n\nCould the first bounce give room to a bad actor and create any vulnerability  ? (*edited format)*",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ws5xg",
                            "author": "didnt_die_a_hero",
                            "score": 1,
                            "created_utc": 1653464959.0,
                            "response": "\nOkay so if I understand this correctly…\n\nThe seed node is preset to like u/pwuille Pieter Wuille’s node or someone equally reliable, (same as when you go regular clearnet), you then get more I2P and Tor nodes off of his peers, based on the algorithm, (length of time running and whatnot)\n(Once you’re connected to multiple nodes randomness makes getting 100% FBI nodes or whatever mathematically impossible)\nIt automatically disconnects from the original seed node so you’re not even connected to that clearnet one. \n\nTo avoid even that:\nDNSSEED=0 makes sure you don’t connect to ANY seed node and you choose it manually. \n\nThere’s a core dev which I used for I2P because he posted his in response to a question on Twitter, (sorry I’m not where I can find it rn) and Tor nodes are so ubiquitous it’s pretty easy to find someone you trust. \n\nBut yes, you’re right. \nRegardless of how you do it, that first node needs to be one you trust, as your network spider webs out from it. \nBut that’s the case for all Bitcoin nodes running on any network, TCP/IP, Tor, I2P, CJDNS",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "uwmvqj",
            "title": "IMF “coin in Bitcoins name doesn’t make it money”. Bitcoin>gold>fiat currency.",
            "url": "https://i.redd.it/a7uxyexa8e191.jpg",
            "author": "Festortheinvestor",
            "created_utc": 1653384779.0,
            "score": 511,
            "num_comments": 218,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9sn0sg",
                    "author": "ElephantsAreHeavy",
                    "score": 180,
                    "created_utc": 1653392053.0,
                    "response": "You're taking a very liberal interpretation of fungible here...",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9sytcc",
                            "author": "UnamazingHero",
                            "score": 87,
                            "created_utc": 1653398736.0,
                            "response": "Right? \"Fiat isn't fungible with other fiat\" doesn't make sense as a criticism when Bitcoin isn't fungible with other currencies either.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9t14tq",
                                    "author": "ButtBlock",
                                    "score": 29,
                                    "created_utc": 1653399859.0,
                                    "response": "Also Bitcoin isn’t strictly speaking fungible. Coins from certain wallets aren’t quite acceptable due to KYC. A dollar bill is a dollar bill no matter where you find it.  The yuan isn’t fungible either. Yuan that exist in China trade at a different rate than yuan abroad, due to capital controls. \n\nMaybe I’m splitting hairs though.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9tu3gm",
                                            "author": "Schapsouille",
                                            "score": 10,
                                            "created_utc": 1653412116.0,
                                            "response": "You're right, regulator's attacks on Bitcoin's fungibility is a real issue.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i9urovd",
                                            "author": "theslapzone",
                                            "score": 5,
                                            "created_utc": 1653426199.0,
                                            "response": "Maybe you're not splitting hairs. I suppose in certain circumstances one could blacklist the dollar by serial number. Much like exchanges blacklisting coins by transaction history. But Bitcoin's *practical* fungibility comes with some caveats that cash doesn't typically have. I guess it's down to how black and white our measurement of fungible is?",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i9uxphm",
                                            "author": "Extension-Relation-3",
                                            "score": 10,
                                            "created_utc": 1653428825.0,
                                            "response": ">A dollar bill is a dollar bill no matter where you find it.\n\nunless that serial number has been blacklisted",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i9t72y9",
                                            "author": "ElephantsAreHeavy",
                                            "score": 1,
                                            "created_utc": 1653402561.0,
                                            "response": "One could write books about bitcoin's fungibility. On the protocol level, bitcoin is perfectly fungible. There is no differentiation between different transactions. Due to the design, no bitcoin can ever be refused. If you let a centralized intermediary decide if your money is valuable or not, then you run into problems. But that is like if you would give me cash, I accept it, and I tell you it was not cash. This is not a bitcoin problem. This is an idiot problem. Idiots being centralized entities and the governments that trust them. \n\nI have bitcoin in my private wallets, KYC or not, nobody can prevent me from spending them to buy cocaine, donating to the taliban, financing human traficking, donating to wikileaks or pay for my groceries. It is only up to me. \n\nAs I can have as many wallets as possible, 'tracing' becomes problematic as well. It would be like saying that a dollar bill with traces of cocaine is no longer valid.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9u7yb1",
                                                    "author": "XMR_LongBoi",
                                                    "score": 3,
                                                    "created_utc": 1653417873.0,
                                                    "response": "Except Marathon has already mined at least one “compliant block” which DID censor/exclude some transactions. Probably not a huge deal at this point, I’m sure those txs made it into the next block, but still really shouldn’t be something that’s even possible on a protocol level.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9udg9l",
                                                            "author": "generateduser29128",
                                                            "score": 4,
                                                            "created_utc": 1653420191.0,
                                                            "response": "On the protocol level miners can include our exclude whatever they want, and there is no way to force a highest fee order because every node may see different transactions.\n\nAs long as there are always some miners that don't discriminate the system is working as intended.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9uhrxj",
                                                                    "author": "XMR_LongBoi",
                                                                    "score": 3,
                                                                    "created_utc": 1653422007.0,
                                                                    "response": ">On the protocol level miners can include or exclude whatever they want\n\nRight. Which is why fungibility is important. TXs should be indistinguishable from one another so as not to be singled out by malicious miners. \n\n>As long as they are always some miners that don’t discriminate \n\nRight now it’s fortunate these “compliant” miners control a very tiny fraction of overall hash rate. But the fact that this type of censorship is possible is a flaw, imo.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9ulogt",
                                                                            "author": "generateduser29128",
                                                                            "score": 1,
                                                                            "created_utc": 1653423654.0,
                                                                            "response": "I don't think that there is a technical solution for forcing transactions to be included.\n\nLightning adds a whole lot more fungibility though.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i9wz2o9",
                                                                                    "author": "ElephantsAreHeavy",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653471226.0,
                                                                                    "response": "Miners are perfectly allowed to mine empty blocks, no problem with that. Game theory says they generally will include the transactions with the highest fees.",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "i9ufnl8",
                                                            "author": "ElephantsAreHeavy",
                                                            "score": 1,
                                                            "created_utc": 1653421120.0,
                                                            "response": "So?",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9ugp32",
                                                                    "author": "XMR_LongBoi",
                                                                    "score": 5,
                                                                    "created_utc": 1653421557.0,
                                                                    "response": "So, despite what you said in your earlier comment, Bitcoin is not perfectly fungible on the protocol level. We’re not talking about a CEX refusing a deposit, we’re talking about miners censoring transactions based on which wallets they came from.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9wz5yg",
                                                                            "author": "ElephantsAreHeavy",
                                                                            "score": 2,
                                                                            "created_utc": 1653471306.0,
                                                                            "response": "You do realize that mining is also decentralized, and miners do not know who will mine the next block either. This really is not a problem, it just makes the censoring mining operations less profitable, gives them an economical disadvantage, and will phase them out.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i9y43di",
                                                                                    "author": "XMR_LongBoi",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653493255.0,
                                                                                    "response": ">You do realize mining is also decentralized\n\nI do. Do *you* realize I’m not talking about a 51% attack? If Alice controls 5% of hash rate and doesn’t want Bob transacting, then over a long enough timeframe, Bob only has a 95% chance of getting his TX in the next block, regardless of what he pays in fees. And if lots of miners also have a problem with Bob, they don’t have to collude, they can each independently decide to censor him. \n\n>This really is not a problem\n\nMaybe not yet, but there’s nothing at the protocol level to stop it from becoming a problem. \n\n>it just makes the censoring mining operations less profitable\n\nTrue\n\n>gives them an economical disadvantage \n\nTrue\n\n>and will phase them out.\n\nMaybe, but you certainly can’t bank on this. Nor should the permissionless nature of the system depend on it. The solution is to engineer the protocol so as to not put miners in that position to begin with.",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "id": "i9uyujy",
                                                                            "author": "Edvardoh",
                                                                            "score": 1,
                                                                            "created_utc": 1653429321.0,
                                                                            "response": "Valid point. Guess that’s why it’s important to keep mining decentralized. And perfectly fungible is probably not the words I would use, however is it fungible enough? I think so, since all it takes is some of the miners not sensoring txs for BTC to be perfectly fungible. I’d argue it’s probably impossible to have a coordinated sensorship by al the miners on the network, it would be an attack similar to co opting the entire network.. even harder than a 51% attack!",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9vjzwn",
                                            "author": "procabiak",
                                            "score": 1,
                                            "created_utc": 1653439163.0,
                                            "response": "Dollars have serial IDs on them, technically they're also not fungible the same way Bitcoin wouldn't be because you can reject bills based on the IDs (especially at automated points like ATMs, cash counting machines, etc). I think it's too broad to apply fungibility that way.\n\nIf the code lets you merge two Bitcoin outputs into one, it is as fungible as the dollar in that you can treat them as exactly the same. You can trace the movements of and reject transactions with a certain black history, sure, that doesn't break fungibility just like you can choose to not accept a dollar bill with visible cocaine traces because that is not the same as a visibly concaineless dollar because that dollar clearly has a black history and the other not.\n\nOnce you mix the rejects into enough legit sources who don't have the capability to implement blacklisting (mom pop shops and other local businesses), large corpos eventually have to give up on it, otherwise you end up with too many customers with illegit coins and you can't do business with anyone.\n\nIf we want to fix Bitcoins fungibility, we just need to spread it everywhere. Get shops to accept Bitcoin, let them pay their employees/suppliers with it, etc. If it all goes back to an exchange, then that's where kyc will strangle Bitcoin's fungibility.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9tmjfu",
                                    "author": "xkulp8",
                                    "score": 5,
                                    "created_utc": 1653409049.0,
                                    "response": "And gold isn't fungible with other precious metals.\n\nI'd say USD is the *most* fungible medium of exchange around for now.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9ts8qv",
                                            "author": "TimmyTaterTots",
                                            "score": 10,
                                            "created_utc": 1653411362.0,
                                            "response": "Melt gold and good luck finding where it came from",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9tsk77",
                                                    "author": "xkulp8",
                                                    "score": -2,
                                                    "created_utc": 1653411493.0,
                                                    "response": "Doesn't matter. It's still gold.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9u3usx",
                                                            "author": "TimmyTaterTots",
                                                            "score": 14,
                                                            "created_utc": 1653416153.0,
                                                            "response": "That’s the point. Bro do you even know what fungible means?",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9v5aty",
                                                                    "author": "SonOfShem",
                                                                    "score": -2,
                                                                    "created_utc": 1653432202.0,
                                                                    "response": "I'm thinking you don't.\n\nFungible means it's interchangeable.  That there is no difference between two instances.\n\nNFTs are called Non-fungible-tokens because, like Bitcoin, they are unique.  Only one person may own a specific NFT.\n\nIn contrast, Dollars, Gold, and Bitcoin are all fungible.  One dollar is equivalent to every other dollar.  One oz of gold is the same as every other Oz of gold.  And every Bitcoin is the same as every other Bitcoin.\n\nHousing is an example of a non-fungible good, because even if two houses were built identically, they are located in different places, and this can give different value.  And over the, they wear differently which can give them different value.\n\nIf you're defining fungibility based on your ability to track things, then BTC isn't fungible, because I can track every purchase in the history of that coin.  From the day it was minted until today.  I may not know who the wallets represent, but I do know which wallets it was in.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9v9yu6",
                                                                            "author": "TimmyTaterTots",
                                                                            "score": 3,
                                                                            "created_utc": 1653434383.0,
                                                                            "response": "Yes I would say the ability to trace where the coin has been means it’s not fungible. Freshly minted coins with no history on the blockchain typically can be sold for more than the price of Bitcoin listed on exchanges. Also coins involved in a suspected crime can be black listed. Exchanges won’t take them meaning Bitcoin isn’t fungible. \n\nDollars are not completely fungible either. Each bill has a unique serial number on it that can be traced. Typically ATMs record the serial numbers when bills are withdrawn and deposited.\n\nOnce gold is melted down, it becomes 100% untraceable making it the most fungible currency",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i9wi86p",
                                                                                    "author": "SonOfShem",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653457126.0,
                                                                                    "response": "That's not the definition of fungible though:\n\n> fun·gi·ble\n\n> /ˈfənjəbəl/\n\n> adjective\n\n> (of goods contracted for without an individual specimen being specified) able to replace or be replaced by another identical item; mutually interchangeable",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i9wkji7",
                                                                                            "author": "TimmyTaterTots",
                                                                                            "score": 5,
                                                                                            "created_utc": 1653458779.0,
                                                                                            "response": "That definition agrees with what I said. One ounce of gold is indistinguishable from another ounce of gold (it cannot be marked). One marked bill is not interchangeable with an unmarked bill. One marked bitcoin is not interchangeable with a freshly minted bitcoin. Therefore gold = fungible while bitcoin & cash = not fungible\n\nSo I am not sure where you think I am mistaken.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i9vxyod",
                                                    "author": "kenlbear",
                                                    "score": 1,
                                                    "created_utc": 1653445752.0,
                                                    "response": "Melt monetary metal and you no longer have monetary metal. You have dory bars. Not the same value.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9yau5n",
                                                            "author": "TimmyTaterTots",
                                                            "score": 1,
                                                            "created_utc": 1653495894.0,
                                                            "response": "Gold is valued by the Troy ounce in any form",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9z7pt5",
                                                                    "author": "kenlbear",
                                                                    "score": 1,
                                                                    "created_utc": 1653508842.0,
                                                                    "response": "No it is not. Gold in various forms commands different prices. See the London Metals Exchange terms for bullion vs monetary metal.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9ttjif",
                                            "author": "ryanq99",
                                            "score": -5,
                                            "created_utc": 1653411888.0,
                                            "response": "I think the point its trying to make is that Fiat is different all over the world.\n\nGold in US is the same gold in China. Bitcoin in US is the same bitcoin in China. Fiat in US is not the same as in fiat in China.\n\nUSD is fungible with USD, but not so much with other Fiat.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9u5cx9",
                                    "author": "bitsteiner",
                                    "score": 1,
                                    "created_utc": 1653416779.0,
                                    "response": "Think in global terms.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9wdxru",
                                    "author": "fresheneesz",
                                    "score": 1,
                                    "created_utc": 1653454288.0,
                                    "response": "I suppose maybe they're saying that bitcoin has a chance to be a world currency in a way fiat currencies don't, because there's no country that controls it. However, that's speculation and its not quite the same thing as fungibility. I'd say they're all pretty equally fungible. Even dollars can be confiscated if those dollars are \"suspected\" of being involved in a crime. (Not from the US: read about civil forfeiture).",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9uwba9",
                            "author": "Dry_Advice_4963",
                            "score": 2,
                            "created_utc": 1653428210.0,
                            "response": "Yeah, that one really stood out and kind of ruined the rest of this chart...",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9u3j55",
                            "author": "jachymb",
                            "score": 0,
                            "created_utc": 1653416015.0,
                            "response": "TIL $ is a NFT.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9v6gtv",
                            "author": "treerabbit23",
                            "score": 0,
                            "created_utc": 1653432744.0,
                            "response": "Good use of icons, negative space, and color.\n\nNicely arranged dumb takes.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9wrtiy",
                            "author": "ZedZeroth",
                            "score": 1,
                            "created_utc": 1653464654.0,
                            "response": ">very liberal interpretation\n\nIs this the polite way of saying \"absolutely incorrect\"?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9wvl20",
                                    "author": "ElephantsAreHeavy",
                                    "score": 2,
                                    "created_utc": 1653468049.0,
                                    "response": "Yes, it avoids confrontational and aggressive replies. It also shows that I know what fungible means and OP's context is not what most people would use it, or anyone should for that manner. I could just as well have called op an idiot or stupid, but what is the fun in that...",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9x1l9c",
                                            "author": "ZedZeroth",
                                            "score": 1,
                                            "created_utc": 1653473392.0,
                                            "response": "😂",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9siaqf",
                    "author": "danktle",
                    "score": 33,
                    "created_utc": 1653388626.0,
                    "response": "The one that requires a data connection and power is also something to consider. If you don't have internet access in a remote area, how much money do you have? What if your phone battery dies and you're in an emergency situation? How much do you have to pay in order to show someone that you have the money? If I pay $0 for $20 cash in the middle of nowhere, people will accept it.\n\nEither way, currency is something that THIS species likes to use. All the other living things on this planet have no idea what currency is. Doesn't matter if it's gold or crypto.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ulsez",
                            "author": "MostBoringStan",
                            "score": 4,
                            "created_utc": 1653423700.0,
                            "response": "\"Ease of use\" or something like it should be on that list. Purchasing with fiat is easy, with gold or BTC it is difficult.  Like you said, needing a connection matters.\n\nWhat's the point of these charts if they are just going to hide the legit cons of BTC.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9w2yhi",
                                    "author": "HoxGM",
                                    "score": 3,
                                    "created_utc": 1653448183.0,
                                    "response": "Well this is Reddit, and this guy is posting on r/bitcoin so it’s either karma farming or circle jerking.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9vyorv",
                                    "author": "kenlbear",
                                    "score": 3,
                                    "created_utc": 1653446092.0,
                                    "response": "Depends on the size of the USD transaction. Obvious when you try to send large money via wire transfer or Western Union. It is no longer fungible. The KYC becomes an obstacle. No problem if you are buying coffee at Starbucks. Try buying a house for cash.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9wd5lc",
                                    "author": "fellowpleb",
                                    "score": 0,
                                    "created_utc": 1653453799.0,
                                    "response": "You had to learn how to use regular fiat money too. That's why people say that personal finance should be a class in highschool. You need to learn how to handle your money, what credit cards are, how to get a bank account, how to manage your credit score and look it up, how to get a car loan... There's a lot to learn, but we all just take it for granted because it's the society we live in\n\n\n\nYou also have to learn Bitcoin, and it isn't easy... But it's not much harder than learning the fiat world either. It's just different. I'm still learning. You have to learn how to buy it, how to store it in your own wallet, what seed phrases are, how to store a seed phrase, what multisig is, how to spend your Bitcoin, how to watch the mempool to determine what you should set the sats per vbyte fee for your transaction... But it's just a learning process same as with fiat money. Once you get it, you can use the knowledge from then on forward.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9sival",
                            "author": "ThePronto8",
                            "score": 6,
                            "created_utc": 1653389077.0,
                            "response": "So having internet access is like having your fiat wallet with you.. if you’re in the middle of nowhere and you don’t have your wallet on you, how much fiat do you have? About this same amount as bitcoin you have without internet access.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9sjbt6",
                                    "author": "stoicparallax",
                                    "score": 7,
                                    "created_utc": 1653389432.0,
                                    "response": "That’s right. To follow on your analogy, areas without internet are essentially places you can never bring a wallet to.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9sjes3",
                                            "author": "ThePronto8",
                                            "score": 7,
                                            "created_utc": 1653389495.0,
                                            "response": "Yes! Although with things like Project Kuiper and Starlink, soon those places won’t exist except perhaps on other planets.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9uvuz8",
                                                    "author": "bonafidebob",
                                                    "score": 1,
                                                    "created_utc": 1653428012.0,
                                                    "response": "> soon those places won’t exist\n\nHeh.  My house (in Silicon Valley) is one of \"those places\" for a few hours every month or two.  Thanks Comcast!\n\nAt least once a week I end up in a shop that has some problem with their point of sale system.  Usually it's only accepting ApplePay and I can still use a credit card, but I keep some paper money with me too and I've had to use it more than once.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9uy2xp",
                                            "author": "Extension-Relation-3",
                                            "score": 5,
                                            "created_utc": 1653428988.0,
                                            "response": "Unless you're China who solved this problem with a digital wallet design that's peer to peer and basically broadcasts pending transactions to every nearby device so when one of them reaches the internet the transaction can be submitted and settled.\n\nI'm not saying this is a good idea because it has a ton of security and privacy implications. But it's \\*possible\\*.\n\n(The only known source of this information, to me, is Richard Turrin's book Cashless about China's digital currency revolution. The design is valid, but I can't confirm its usage is actually widespread yet.)",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9us9gh",
                                    "author": "theslapzone",
                                    "score": 2,
                                    "created_utc": 1653426443.0,
                                    "response": "Not exactly a solid analogy. You just can't take emergency bitcoin with you somewhere. It's definitely a modern society convenience. I don't think the world is become less connected so that issue will slowly fade but never disappear.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9sjpj6",
                            "author": "PrognosticalSon",
                            "score": 0,
                            "created_utc": 1653389727.0,
                            "response": "Be the advanced civilization you want to see.  \nProgress was never made by naysayers and people who say things won't work, but by people who took risks and did thing that naysayers said could never possibly work.\n\nThe universe is abundant in electricity, and there are many ways to harness it and transmit it. Energy is universal currency. \n \nIn 10-20 years phones will be perpetually powered by kinetic or graphene thermal electricy or even some other bountiful electric power source. Who l knows even if we will have physical phones.\n \nAll I know is that every piece of technology that the current generation builds, gets incorporated as base pieces into the next generations tech.\n \nBitcoin is tech, and lime all tech it is built on other texh and continues to iterate.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9u8i05",
                                    "author": "LayPessimist",
                                    "score": 1,
                                    "created_utc": 1653418106.0,
                                    "response": "Not sure why you were downvoted, but good comment. I agree fully.\n\nThere was also this guy that said that the \"internet won't work\" back in the 90s.\n\nI still have a whole book here somewhere with quotes from naysayers that were horribly, horribly wrong when it comes to technology.\n\nYes, they managed to fill a whole book with it.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9ts61j",
                    "author": "TimmyTaterTots",
                    "score": 21,
                    "created_utc": 1653411331.0,
                    "response": "Bitcoin is not fungible",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9sm1uj",
                    "author": "learner77",
                    "score": 30,
                    "created_utc": 1653391394.0,
                    "response": "The chart leaves out “legal tender” - ie is it widely accepted when you want to buy goods/services. Seems like that should be at the top of the list (good luck trying to buy a pizza at pappa johns with bitcoin). Seems like a major omission.\n\nobviuously gold fails hard here too.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9u5m2n",
                            "author": "bitsteiner",
                            "score": 3,
                            "created_utc": 1653416887.0,
                            "response": "Fiat money is essentially the same as legal tender. \n\nBuying Pizza is possible through an intermediate: https://www.bitrefill.com/buy/usa/?hl=en&q=pizza\nWhen you use electronic fiat payments, there are many intermediates involved too.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9twl80",
                            "author": "PRMan99",
                            "score": 1,
                            "created_utc": 1653413141.0,
                            "response": "> good luck trying to buy a pizza at pappa johns with bitcoin\n\nWhat are you talking about? Laszlo bought 2 pizzas at Papa John's with bitcoin in 2010.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9ty2ur",
                                    "author": "learner77",
                                    "score": 7,
                                    "created_utc": 1653413757.0,
                                    "response": "That was a privately negotiated deal with the manager of one location. 12 years later, you can NOT walk in to a Pappa John’s and pay for a pizza with bitcoin (well, maybe if you can convince THAT manger, but not like you can just walk up to the register and they’ll accept your satoshis)",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9ug3d6",
                                            "author": "generateduser29128",
                                            "score": 4,
                                            "created_utc": 1653421304.0,
                                            "response": "No, some random guy ordered a pizza for usd and Laszlo paid that guy in btc.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9um1no",
                                                    "author": "MostBoringStan",
                                                    "score": 2,
                                                    "created_utc": 1653423808.0,
                                                    "response": "A bunch of random people. He did it several times, and over time he had to start reducing the amount of BTC he paid because the value started rising.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9sz50o",
                            "author": "RandomPlayerCSGO",
                            "score": -4,
                            "created_utc": 1653398892.0,
                            "response": "Legal tender just means imposed by the government, something being imposed by force doesn't make it good. They could say rocks are legal tender and that wouldn't make rocks better money than gold.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9tq0lg",
                                    "author": "learner77",
                                    "score": 5,
                                    "created_utc": 1653410450.0,
                                    "response": "I think volatility is a HUGE reason why Bitcoin isn’t being used right now. Sadly, I know a few companies that started to accept bitcoin (Tesla, Steam), but no longer do.   \n\n\nalso, bitcoin IS legal tender in El Salvador, and seems like it’s having problems getting traction as a payment method: [https://restofworld.org/2022/el-salvador-bitcoin/](https://restofworld.org/2022/el-salvador-bitcoin/)",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9tx6yv",
                                    "author": "yoshinosumoto",
                                    "score": 3,
                                    "created_utc": 1653413392.0,
                                    "response": "Legal tender means it can be used to pay taxes which gives it an inherent value.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9ucoq1",
                                            "author": "AbbydonX",
                                            "score": 2,
                                            "created_utc": 1653419876.0,
                                            "response": "It’s true that the requirement to pay taxes in the Government’s currency is what gives it value but that is slightly separate to the concept of legal tender. I live in the UK and I don’t think I’ve ever used legal tender to pay taxes. Almost no one will ever have done so either I expect. I’m not even sure how I would pay with banknotes and coins. HMRC much prefer to receive digital bank transfers instead as it is more convenient for them.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i9txdoi",
                                            "author": "RandomPlayerCSGO",
                                            "score": 1,
                                            "created_utc": 1653413468.0,
                                            "response": "Yeah, so that's what I said, you are forced to use it. Unless you pay taxes voluntarily and can choose not to, which I doubt is the case.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9vbmr6",
                                                    "author": "yoshinosumoto",
                                                    "score": 1,
                                                    "created_utc": 1653435161.0,
                                                    "response": "You never mentioned tax but ok.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9ubjpy",
                            "author": "AbbydonX",
                            "score": 1,
                            "created_utc": 1653419394.0,
                            "response": "While the intent of your point is valid it’s not really directly related to the concept of legal tender.\n\nLegal tender has a very narrow definition that is rarely relevant in real life. As the [Bank of England](https://www.bankofengland.co.uk/knowledgebank/what-is-legal-tender) says:\n\n> It means that if you offer to fully pay off a debt to someone in legal tender, they can’t sue you for failing to repay.\n\nBroadly speaking this is the meaning but more technically in the UK (and I’m no expert at this) I believe that a debtor must make a “payment into court” of a sufficient amount in “legal tender” to allow them to use a “tender before claim” defence against a creditor seeking payment via the court. There are [suggestions](https://www.justice.gov.uk/courts/procedure-rules/civil/rules/part37/pd_part37) that this might not even apply unless the debtor has no bank account and cannot write a cheque to the court. It’s all rather unclear.\n\nIn the UK at least it has absolutely nothing to do with whether or not it is accepted as payment for goods and services. In fact, most transactions are performed using private digitial money which isn’t legal tender rather than the Government’s legal tender (i.e. notes and coins).",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9v6mwb",
                            "author": "treerabbit23",
                            "score": 1,
                            "created_utc": 1653432824.0,
                            "response": "You just wrote a paragraph instead of saying \"fungible\".",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9vi2bp",
                                    "author": "learner77",
                                    "score": 1,
                                    "created_utc": 1653438235.0,
                                    "response": "Per [https://bitcoins.net/investing/fungibility](https://bitcoins.net/investing/fungibility)\n\n“Fiat currency is the best example for most people to get their heads around the concept of fungibility. A 20 EUR bill is fungible since it can be easily interchanged with two 10 EUR bills or four 5 EUR bills”\n\nthis isn’t what I was saying at all. So you either don’t understand what fungible means, or you didn’t really read my “paragraph”.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9ss3uq",
                            "author": "kos277",
                            "score": 0,
                            "created_utc": 1653395174.0,
                            "response": "I don't think it's necessary for something to be able to do it all. Consider how cash has been used to improve the usability of gold. It works the same way for Bitcoin (for now). Bitcoin is essentially an improvement on gold as a denominator of hard value. Cash is just a transactable medium that majority of stores primarily support (for now). If cash ever loses its reputation (hyperinflation) then nothing is stopping businesses from accepting payment in BTC. And this is where BTC shines against transacting with gold, for example.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9syy97",
                            "author": "cpafa",
                            "score": 0,
                            "created_utc": 1653398802.0,
                            "response": "It is instantly settleable into any currency in the world in highly liquid trading pairs. Not only can you exchange it to usd to buy whatever you want here in the states, but it is borderless money and you can send/exchange it nearly anywhere in the world… instantly.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9tr31n",
                                    "author": "learner77",
                                    "score": 2,
                                    "created_utc": 1653410886.0,
                                    "response": "all true, but 99.99% of the stuff I but is within the borders of the country I live in - no borders, exchanging currency, doing stuff with currency trading pairs, etc.\n\n&#x200B;\n\nper your example, I could see a use case of (for example) Apple using bitcoin to pay their suppliers in China. But I haven’t read any news of companies doing that. If you have, please post - would love to heard about that.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9tt0zi",
                                            "author": "dragonitanair",
                                            "score": 3,
                                            "created_utc": 1653411680.0,
                                            "response": "Because those company know that $30 SWIFT transfer bill is cheaper compared to percentage based exchange cut when you want to withdraw fiat?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9u111x",
                                                    "author": "cpafa",
                                                    "score": 2,
                                                    "created_utc": 1653414972.0,
                                                    "response": "If you think transferring business-size transactions from one currency to another is $30, you are going to have a bad time.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9vgsk4",
                                                            "author": "dragonitanair",
                                                            "score": 2,
                                                            "created_utc": 1653437622.0,
                                                            "response": "It is, how much do you think it is?",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9usmnb",
                    "author": "theslapzone",
                    "score": 5,
                    "created_utc": 1653426602.0,
                    "response": "There's a *lot* of problems with this info graphic.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9swup2",
                    "author": "ControversialTomato",
                    "score": 13,
                    "created_utc": 1653397756.0,
                    "response": "Bitcoin is not fungible. Want proof? Try depositing coinjoined/tainted btc into a cex.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9vz74i",
                            "author": "littleannointedone",
                            "score": 2,
                            "created_utc": 1653446340.0,
                            "response": "I think the goal is for bitcoin to be a peoples currency not a business/government currency. I'll take anyone's btc no matter how tainted. Cex are pretty irrelevant if you're a real bitcoiner. The point is to stack SATs not sell for trash cash.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9w4dos",
                                    "author": "ControversialTomato",
                                    "score": 1,
                                    "created_utc": 1653448900.0,
                                    "response": "Whether you like it or not, most people use centralized exchanges as an on/off ramp. Just because you will accept tainted coins doesn’t mean everyone else will.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9wbddj",
                                            "author": "littleannointedone",
                                            "score": 0,
                                            "created_utc": 1653452707.0,
                                            "response": "Again people that actually know what bitcoin is supposed to do wouldn't trade a valuable asset/money for another less valuable asset/money. The people you are talking about are just trading to try and get rich quick. So yes for the people that want to gamble and trade between the two currencies wouldnt want tainted coins. For the people that actually know what they're investing in won't care. Trading bitcoin for fiat is like trading a bar of gold for paper(fiat) its literally the most unproductive thing to do with your wealth. Bitcoin preserves wealth and can be used as a medium of exchange. Its completely leaving our corrupt economic system and entering into a people run economy. Trading back to fiat is just counterproductive to anyone that wants to obtain and preserve wealth. Might as well just trade stocks at that point.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9slmb5",
                    "author": "catesnake",
                    "score": 22,
                    "created_utc": 1653391106.0,
                    "response": "Bitcoin is NOT fungible, that's not what fungibility means. Also the chart needs a new column for digital Fiat and a row for privacy.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9souhn",
                            "author": "qwertyy94",
                            "score": -4,
                            "created_utc": 1653393223.0,
                            "response": "How come BTC is not fungible? If you're talking about coin history, the network itself doesn't care which address a coin came from. Only people might care, and since a \"clean to dirty\" coin process is ireversible, soon or later all coins will be \"dirty\", that is, fungible to people subjectivities.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9sz2ke",
                                    "author": "CapivaraMan",
                                    "score": 6,
                                    "created_utc": 1653398860.0,
                                    "response": "in BTC one coin is not equal do other, they can be diferentiated, traced, denied based on origin. Althoug it's not a problem to most people or the network itself it is enough to classify as not fungible",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9tww03",
                                            "author": "PRMan99",
                                            "score": 2,
                                            "created_utc": 1653413265.0,
                                            "response": "Then cash isn't either, since certain dollar serial numbers will be seized.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9vbekr",
                                                    "author": "CapivaraMan",
                                                    "score": 1,
                                                    "created_utc": 1653435057.0,
                                                    "response": "Yes, I think so, banks and government do whatever they want , that's why we need to build a truly decentralized net",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i9ve32c",
                                                    "author": "canadas",
                                                    "score": 1,
                                                    "created_utc": 1653436317.0,
                                                    "response": "Ya, thats why the always ask for unsequalized bills in movies.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i9vlevo",
                                                    "author": "Life_Airline_6767",
                                                    "score": 1,
                                                    "created_utc": 1653439829.0,
                                                    "response": "Whatttttt",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i9vlp98",
                                                    "author": "Life_Airline_6767",
                                                    "score": 1,
                                                    "created_utc": 1653439968.0,
                                                    "response": "How much money has been seized from you or your friends and family? What if you lose your cryptos passwords in a fire? Would everyone become broke who loses passwords ?",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9t07or",
                                    "author": "davvblack",
                                    "score": 1,
                                    "created_utc": 1653399417.0,
                                    "response": "the fact that this site can even exist: https://cryptodefendersalliance.com/blacklist",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9szm57",
                    "author": "Bludsh0t",
                    "score": 13,
                    "created_utc": 1653399125.0,
                    "response": "Gold is verifiable",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9tn8zy",
                            "author": "xkulp8",
                            "score": 2,
                            "created_utc": 1653409335.0,
                            "response": "Probably more than crypto or fiat are. Websites can be faked, paper can be counterfeited. Fastest way to verify gold is to put it on a scale. Most metals with similar density to gold go for about the same price, defeating the purpose of trying to counterfeit it.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9u8x95",
                                    "author": "LayPessimist",
                                    "score": 1,
                                    "created_utc": 1653418284.0,
                                    "response": "Lol. Tell that to the guys who counterfeited gold by providing gold-plated tungsten.\n\nGold is hard to verify actually. You need to chemically test it if you are doing it right. At least every bullion buyer needs to do that when buying your gold.\n\nWhich is also why they often pay you far under spot, as they have to make the costs for the testing.\n\nYou don't need to verify Bitcoin as it cannot be counterfeit.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9vqjxn",
                                    "author": "Correct-Log5525",
                                    "score": 1,
                                    "created_utc": 1653442271.0,
                                    "response": "You are incorrect.  Bitcoin is FAR easier to verify than gold.  There is no debating this",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9tptg3",
                            "author": "Environmental_Fan333",
                            "score": 1,
                            "created_utc": 1653410371.0,
                            "response": "Most people don’t hold their own gold and cannot verify it’s purity.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9vqgjw",
                            "author": "Correct-Log5525",
                            "score": 1,
                            "created_utc": 1653442226.0,
                            "response": "Gold is very difficult and expensive to verify",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9smuuy",
                    "author": "billionstonks",
                    "score": 3,
                    "created_utc": 1653391942.0,
                    "response": "Bitcoin may be a store of value but I thought we had moved well passed it being used as day to day money.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9uwngm",
                    "author": "OgFinish",
                    "score": 3,
                    "created_utc": 1653428359.0,
                    "response": "Bitcoin more durable over fiat? Do you live in a third world country?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9vqvn2",
                            "author": "Correct-Log5525",
                            "score": 2,
                            "created_utc": 1653442428.0,
                            "response": "Bitcoin is certainly more durable than fiat...  That point isn't really a debate",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9vq7iv",
                    "author": "OfWhomIAmChief",
                    "score": 3,
                    "created_utc": 1653442104.0,
                    "response": "Pretty nice infographic except for when it comes to fungibility, Bitcoin doesnt do that so well",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9whkpt",
                    "author": "flyinghippodrago",
                    "score": 3,
                    "created_utc": 1653456684.0,
                    "response": "Looks like an eighth grade project or something...\n\nGold is absolutely divisible to 8 decimal points and is fairly easy to prove if it's genuine",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9sr5op",
                    "author": "Normal_Cranberry_526",
                    "score": 12,
                    "created_utc": 1653394632.0,
                    "response": "Crypto maxi but God these points are stupid lol",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9u10jb",
                            "author": "perfect5-7-with-rice",
                            "score": 1,
                            "created_utc": 1653414966.0,
                            "response": "Yep, cash is only divisible if you trade it for smaller denominations. Gold you could trade it or break it...",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9vqr1r",
                                    "author": "Correct-Log5525",
                                    "score": 1,
                                    "created_utc": 1653442368.0,
                                    "response": "How will you pay for your milk with gold?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9vrkw9",
                                            "author": "perfect5-7-with-rice",
                                            "score": 1,
                                            "created_utc": 1653442756.0,
                                            "response": "I'm not sure what your point is (I agree gold isn't ideal for a lot of reasons), you'd need to get change.\n\nI'm just saying gold is divisible in the same way cash is - you need to make change in smaller denominations.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9xn3h2",
                                                    "author": "Correct-Log5525",
                                                    "score": 1,
                                                    "created_utc": 1653486153.0,
                                                    "response": "Right, but with gold it is impractical to make smaller denominations at a certain point.  Are you supposed to shave off a small sliver to pay for a candy bar?  Fiat divides down to a finer point than gold, allowing small transactions.  Bitcoin divides down to a MUCH smaller point than fiat, allowing for micro transaction that are small fractions of a penny.\n\nYou may ask why do we need such small denominations like a fraction of a penny and the reason is... Data.  Data transactions between machines in the future will sometimes be MUCH less than a penny and under the fiat or gold system that would be infeasible",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9ylq2r",
                                                            "author": "perfect5-7-with-rice",
                                                            "score": 1,
                                                            "created_utc": 1653500119.0,
                                                            "response": "Well you can't shave off a sliver of cash either.\n\nMy only point is that gold is at least as divisible as cash. If we did use gold (not that I'm advocating for it), businesses would likely have machine-cut slivers for change.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9sk010",
                    "author": "solomonsatoshi",
                    "score": 4,
                    "created_utc": 1653389947.0,
                    "response": "IMF lol",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ucd0i",
                    "author": "StubbornGoldBug",
                    "score": 3,
                    "created_utc": 1653419738.0,
                    "response": "Gold isn't portable? It depends on how much we're talking...\n\n$Billions? Ok, not easy to transport but these sizes of transactions don't take place often.\n\n$Millions? Not a breeze but certainly doable.\n\n$100,000s? Not a problem.\n\n$1,000s? You can hold $10,000+ worth in the palm of one hand and it wouldn't be a problem.\n\nIf you're wanting to carry $500,000+ worth of gold on your person at all times, yes gold wouldn't be considered portable.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9vr1x3",
                            "author": "Correct-Log5525",
                            "score": 1,
                            "created_utc": 1653442509.0,
                            "response": "If your definition of portable is hauling around gold bars then we definitely have different definitions",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9wz7pi",
                                    "author": "StubbornGoldBug",
                                    "score": 1,
                                    "created_utc": 1653471348.0,
                                    "response": "Wdym?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9xm3yw",
                                            "author": "Correct-Log5525",
                                            "score": 1,
                                            "created_utc": 1653485697.0,
                                            "response": "Real portability in the modern age is being able to instantly move your asset, anywhere in the world at the speed of light.  Carrying around a piece of gold in your pocket is no more portable than gold was 500 years ago..  most people talk about how Bitcoin being intangible is a negative but in reality it is the biggest positive you can have",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9ugog7",
                    "author": "production-values",
                    "score": 4,
                    "created_utc": 1653421550.0,
                    "response": "is btc really fungible though? canadian government has blacklisted people who donated to truckers",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9vqod8",
                            "author": "Correct-Log5525",
                            "score": 0,
                            "created_utc": 1653442332.0,
                            "response": "They can't prevent me from sending Bitcoin to them.. they can just prevent them from turning it into Canadian dollars on a centralized exchange in Canada..",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9vt3po",
                                    "author": "production-values",
                                    "score": 2,
                                    "created_utc": 1653443467.0,
                                    "response": "wxactly ... they can tell one apart from another",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9v45r9",
                    "author": "Zealousideal_Leg_630",
                    "score": 2,
                    "created_utc": 1653431682.0,
                    "response": "lol at the thought of Bitcoin \"maintaining purchasing power durability.\" Seriously, take an econ course or something. You bros are lost.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9visl9",
                            "author": "Festortheinvestor",
                            "score": 0,
                            "created_utc": 1653438587.0,
                            "response": "Modern Economics is flawed, as is fiat currency. Since Nixon moved the world off gold, bitcoins day has been coming. Maybe you should take an “econ class”, might help you see where we are headed…..\n\nDo you think they can control the inflation this time?\n\nThose interest rate hikes doing a wonderful job so far….\n\nThe CPI index isn’t fit for use….\n\nBitcoins laws are there to be seen by all, with a public ledger for transparency, Bitcoin will show you and you’ll benefit even if you’re not holding",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9vcy55",
                    "author": "canadas",
                    "score": 2,
                    "created_utc": 1653435778.0,
                    "response": "one nit pick is gold is far more divisible than BTC, at least technically",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9sdyjv",
                    "author": "Festortheinvestor",
                    "score": 3,
                    "created_utc": 1653384885.0,
                    "response": "Once bitcoin hits the 20 year mark and it’s track record will still be 99.9% uptime, these arguments still may exist, but ignore the naysayers, they have their own reasons to attack bitcoin. \n\nBitcoin is inevitable",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9semk9",
                            "author": "pink_raya",
                            "score": 3,
                            "created_utc": 1653385494.0,
                            "response": "bet that IMF lady will still be there when the sun goes out.\n\nJust because IMF doesn't have a T in its name doesn't mean they aren't terrorists.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9u6kdy",
                            "author": "bitsteiner",
                            "score": 1,
                            "created_utc": 1653417290.0,
                            "response": "When Bitcoin hits the 27 year mark, it exceeds the average life time of fiat currencies.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9tsqid",
                            "author": "muttley_magnificent",
                            "score": 0,
                            "created_utc": 1653411564.0,
                            "response": "Inevitably shit",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9vr9ld",
                                    "author": "Correct-Log5525",
                                    "score": 1,
                                    "created_utc": 1653442607.0,
                                    "response": "Totally.. like its been shit since 2017, 2013 and 2011... Don't y'all ever get tired of all the salt and thinking about how much price appreciation you have missed.  You're gonna miss it again next time we bull run... And then again",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9sov1f",
                    "author": "Burebista1981",
                    "score": 2,
                    "created_utc": 1653393232.0,
                    "response": "Gold will outperform all sooner or later….. proven history!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9spxgs",
                            "author": "MichaelAischmann",
                            "score": 3,
                            "created_utc": 1653393889.0,
                            "response": "only if you exclude some stocks, palladium, some crypto, land, gems... prove your history before you make such statements",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9u6o4w",
                            "author": "bitsteiner",
                            "score": 2,
                            "created_utc": 1653417333.0,
                            "response": "That won't be allowed.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9vrbo9",
                            "author": "Correct-Log5525",
                            "score": 1,
                            "created_utc": 1653442633.0,
                            "response": "No chance it outperforms Bitcoin over the next decade",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9wt583",
                                    "author": "Burebista1981",
                                    "score": 1,
                                    "created_utc": 1653465833.0,
                                    "response": "Once CBDC is in place BTC will go down and finished or illegal",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9xlar1",
                                            "author": "Correct-Log5525",
                                            "score": 2,
                                            "created_utc": 1653485313.0,
                                            "response": "Lol no it won't, no way Bitcoin will ever be made illegal in the US.  Way too many big players are involved now.  Also will the government be able to print more CBDC?  The answer is yes and so it is not a competitor to BTC",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9sqo70",
                    "author": "MichaelAischmann",
                    "score": 2,
                    "created_utc": 1653394343.0,
                    "response": "in contrast... a bank note is only just a note. perception makes it money.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9u6g8u",
                            "author": "bitsteiner",
                            "score": 0,
                            "created_utc": 1653417242.0,
                            "response": "Government force makes those paper notes money. The perception is just the result of that.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9vrk0m",
                                    "author": "Correct-Log5525",
                                    "score": 1,
                                    "created_utc": 1653442744.0,
                                    "response": "This has only been true for a few decades and in that short time a new way to wrest back control of money from them has been created.  Exciting times ahead",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9uyofy",
                    "author": "totalolage",
                    "score": 2,
                    "created_utc": 1653429247.0,
                    "response": "Where's the anonymity point? BTC is the only one where you cannot make a transfer without necessarily leaving an immortal record. To that point fiat should really be split into electronic and cash.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ttqqw",
                    "author": "sylsau",
                    "score": 1,
                    "created_utc": 1653411971.0,
                    "response": "The IMF refuses to see the truth in order to continue to protect its small power in a totally unfair monetary and financial system. But whether the IMF validates it or not, Bitcoin is really the future. Time is on its side. The IMF will have to bow.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ulbqd",
                    "author": "abhilodha",
                    "score": 1,
                    "created_utc": 1653423506.0,
                    "response": "Gold has lasted for 10k years in my history book.\n\nBITCOIn will have no future once blockreward cannot pay electricity bills.\n\nI am a concerned bitcoin maxi feeling brainwashed",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9vqt0e",
                            "author": "Correct-Log5525",
                            "score": 1,
                            "created_utc": 1653442394.0,
                            "response": "Your concerns are invalid",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9ts61c",
                    "author": "Nada_Lives",
                    "score": 0,
                    "created_utc": 1653411331.0,
                    "response": "\"*coin in Bitcoins name doesn’t make it money\"*\n\n\"Monetary\" in the International Monetary Fund's name does not make it money, either.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9sixti",
                    "author": "CutFabulous1178",
                    "score": -2,
                    "created_utc": 1653389134.0,
                    "response": "FIAT = Money printer goes Brrr, BTC = Store of value, this alone makes BTC worth everything",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ttszh",
                            "author": "muttley_magnificent",
                            "score": 1,
                            "created_utc": 1653411997.0,
                            "response": "What garbage",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9tywlm",
                    "author": "TenshiS",
                    "score": -1,
                    "created_utc": 1653414097.0,
                    "response": "Fiat is also forgeable, and gold's authenticity is difficult to verify. Definitely an important attribute",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9sl0ef",
                    "author": "alien3d",
                    "score": 1,
                    "created_utc": 1653390676.0,
                    "response": "between gold fiat and currency . Our country keep going down and gold up and bitcoin up and down . Some country citizen saving in dollar money and some paper gold .For muslim , if a man buy gold need tax , so ouch . Long term the best we unknown  and scary same time . Buying asset also can be out depreciation .",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9tuhib",
                    "author": "godofleet",
                    "score": 1,
                    "created_utc": 1653412277.0,
                    "response": "Just a thought i had recently- What if: \n\nBitcoin had instead been called IMP (Internet \\[of\\] Money Protocol) ...\n\nOr any other acronym that describe it similarly to TCP/IP or SMTP/POP ... like these technologies are fundamental to the internet we know - they are possibly some of the most globally valued and valuable software(s) - a phenomena in its own way of our collective progress/technological evolution.\n\nWould people have taken it differently, perhaps more seriously if it had been called something else?\n\nI guess NGU technology kinda fits this space lol",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9u1ir8",
                    "author": "NeckCrafty5641",
                    "score": 1,
                    "created_utc": 1653415175.0,
                    "response": "I’m pro BTC. I hold multiple coins. I am also pro Gold/Silver. Silver makes up the second largest asset in my portfolio next to BTC. Therefore, when I say I have a disagreement with The DIVISIBLE checklist, it’s because “small pieces” is a very subjective statement, and not because I don’t believe BTC is easier to break down into smaller values. \n\nI believe that After all this fuckery with our money is over, Gold and especially Silver will be revalued to a much higher fiat value. At the time of this post, Russia and other countries are considering GRAMS and MILLAGRAMS as a divisible form of Gold. As I said, DIVISIBLITY is a subjective and weak argument. This also bolsters Gold/Silvers portability “issue”. \n\nI 100% agree that BTC is superior in portability when compared to metals in a digitally dominant age, but it is by no means inconvenient for anything practical, especially if it were revalued. Lastly, when it comes to SCARCITY, there is a growing argument that there is more Gold on the planet than Silver. We don’t know the bottom line scarceness of Metals or BTC, but we have a lot better idea how scares BTC is. Yes we know 21m BTC bla bla bla. But how many were lost? We don’t know. How many will continue to be lost? We won’t know. But we WILL be a lot closer to knowing the total availability than anything else. Silver on the other hand is used in medic and electronics, among other things. We “burn” and literally consume Silver. There is also a growing argument that Silver could become more rare than Gold. \n\nJust some food for thought. Apple uses silver in their phones. If they wanted to make sure they could keep building their phones and control the cost, they could buy all the mined and unmined silver 5 times over. They could corner the market on silver. I encourage everyone to look into these points/ do their own research on these ideas. \n\nWe are living in a very fun times in which many truths have been hidden from us. As things come to light, it happens gradually and then suddenly. Don’t be surprised if within 10years metals will have 10X’d + … peace and love fellow bitcoiners. Keep stackin them Sats. \n\nTLDR: 1DAY 1USD = 1SAT",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9u7sn8",
                    "author": "SirSkittles111",
                    "score": 1,
                    "created_utc": 1653417807.0,
                    "response": "Gold is not scarce, asteroid mining isnt too far from the future",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ucr4w",
                    "author": "ivgur",
                    "score": 1,
                    "created_utc": 1653419904.0,
                    "response": "Looks like what humankind created recently (fiat) is just more practical but still shit compared to the good ol’ gold.\n\nCould someone enlighten a man tho? By durable should I understand inflation related? Seems like good and btc are inflation resistant while fiat isn’t",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9x1i7d",
                            "author": "kos277",
                            "score": 2,
                            "created_utc": 1653473319.0,
                            "response": "Yep. durable = resistant against losing purchasing power = maintaining value per unit = inflation resistant -/- unlike fiat. 1 million USD now is likely only worth max 500k in purchase power in 2030-2040",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9x1rct",
                                    "author": "ivgur",
                                    "score": 1,
                                    "created_utc": 1653473534.0,
                                    "response": "cheers mate ;)",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9ufjy7",
                    "author": "suuperfli",
                    "score": 1,
                    "created_utc": 1653421077.0,
                    "response": "I prefer [this comparison table](https://i.imgur.com/Ksg242B.jpg)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9unmf0",
                    "author": "manhattanabe",
                    "score": 1,
                    "created_utc": 1653424470.0,
                    "response": "Not sure why you have gold in your chart.  Gold isn’t money either according to the IMF.  In the US, you pay capital gains on the sale of\nGold, just like Bitcoin.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9upar3",
                    "author": "silverfox0155",
                    "score": 1,
                    "created_utc": 1653425180.0,
                    "response": "Lord of Grange NFT is both a verified California Gold Mine in an NFT.....nicely done as they say",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9uxc8k",
                    "author": "ggwpsmd",
                    "score": 1,
                    "created_utc": 1653428661.0,
                    "response": "It’s pointless making these posts, totally useless… why? Because only those retarded government’s need explanations why Bitcoin it’s better than Fiat, we all know it’s better, period. No need to explain or to make a book of it, they have no control over Bitcoin and obviously they want Fiat because they do. Bitcoin it’s better and that’s all, end of the story.\n\nEdit: I would suggest to whoever see this post, even if you having a hard time, stack Bitcoin every time it’s possible, live your life and enjoy everything but whenever it’s possible buy a little of Bitcoin. The future of Fiat seems to be bad , very bad so use Bitcoin as your savings if you have your chance.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9uznqv",
                    "author": "cl4yf4c3",
                    "score": 1,
                    "created_utc": 1653429669.0,
                    "response": "These are great features, but leave out the functions of money... functions are required while feature may vary. I think BTCs worst defect as money is its function as a store of value.\n\nA store of value is any commodity or asset that would normally retain purchasing power into the future and is the function of the asset that can be saved, retrieved and exchanged at a later time, and be predictably useful when retrieved.\n\nBTC isn't predictably useful for numerous reasons and doesn't retain purchasing power well either.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9uzy6h",
                    "author": "SnooChocolates7170",
                    "score": 1,
                    "created_utc": 1653429796.0,
                    "response": "Gold is not entirely fungible....\n\n...as a physical buyer and holder of gold I can testify that the liquidity and sale premium of a gold eagle, a maple, fortuna bar and a generic bar/round is crazy.\n\nYes, all is gold, but the form it comes makes a +5% to -10% of its acual price in grams/ounces",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9v392x",
                    "author": "American_Top",
                    "score": 1,
                    "created_utc": 1653431266.0,
                    "response": "Just because these people hold high positions doesn’t mean they’re reasonable, rational or independent. We knew who they are before they opened their mouths.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9v57mk",
                    "author": "Life_Airline_6767",
                    "score": 1,
                    "created_utc": 1653432161.0,
                    "response": "What does this mean?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9vj4b2",
                            "author": "Festortheinvestor",
                            "score": 0,
                            "created_utc": 1653438744.0,
                            "response": "It’s a comparison. \n\ntraits of money, gold vs bitcoin vs fiat currency \n\nLearn what those three are first. \n\nAbove is the monetary traits\n\nBitcoin appears to be the ‘hardest’ money (best)",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9vjf7t",
                                    "author": "Life_Airline_6767",
                                    "score": 1,
                                    "created_utc": 1653438888.0,
                                    "response": "I know what they are my friend :) thanks. \nwhat would you like to happen?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9vjvco",
                                            "author": "Festortheinvestor",
                                            "score": 1,
                                            "created_utc": 1653439102.0,
                                            "response": "I would have the people of earth to have a place they can store their wealth safely, I would like to take the money back from government and have it belong to the people again. \n\nNixon robbed us, I want justice, I want equity, there’s so much money hidden away, I want bitcoin to suck it out from the deep pockets of the world and into the wallets of the new.\n\nThings need to change in this world. Yeah",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9vjyca",
                                    "author": "Life_Airline_6767",
                                    "score": 1,
                                    "created_utc": 1653439141.0,
                                    "response": "The human species are pretty stupid. Would people be able to not Lose there bitcoin over time? Would they lose passwords and go from wealth to broke over night",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9vka7s",
                                            "author": "Festortheinvestor",
                                            "score": 2,
                                            "created_utc": 1653439294.0,
                                            "response": "No, it’s simple, even my elderly mother has bitcoin, I know where her seed phrase is in case of an accident. In time there will be more wallets that you can have guardians and accesss granted via wills, Bitcoins 13, wait until she’s all grown up….\n\nThe potential is huge",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9v8xd5",
                    "author": "Short-Shopping3197",
                    "score": 1,
                    "created_utc": 1653433888.0,
                    "response": "Promissory currency has been used for over 1000 years",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9v92av",
                    "author": "AdverseDodecahedron",
                    "score": 1,
                    "created_utc": 1653433952.0,
                    "response": "I think you are trying to think of these properties in some kind of ultimate theoretical conceptual terms. But these properties that you list are *required* for something to be money. The fact that fiat is universally used as money is itself proof that by definition it meets all of these criteria. If it ever stops meeting the criteria -- e.g. out of control inflation caused by printing money (reduction in scarcity) -- then it will stop being used as money. Here are some thoughts:\n\n\"Durability\" is a physical property. But you talk about purchasing power to classify fiat as non-durable? The point of \"durability\" is that your money won't dissolve in water or melt in direct sunlight or something like that.\n\n\"Fungible\" simply means that a unit of the money is interchangeable with another unit. This is true of all three. E.g. 1 pound of gold is equal in value to one pound of gold. $1 USD is equal to $1 USD, 1 BTC = 1 BTC.\n\n\"Track record\" is a bit missing the point -- the point is that people need to trust in the currency in order to use it. Doesn't matter if USD has a bad track record in the past as long as people trust it enough now to accept it as a payment method. \"Trust\" is really the more important property, and it is something that can ebb and flow.\n\n\"Scarcity\" -- scarcity of fiat is controlled by a central bank, that doesn't mean it isn't scarce, it means that the scarcity is under human control. Bitcoin is also artificially scarce, but the mechanism is automated instead of human-controlled. \n\n\"Verifiable\" -- just because Bitcoin is better at being verified doesn't mean the others aren't verifiable. And the nice thing about fiat is that you can have very straightforward methods for verifying that even a kid can understand, as well as more complicated/hidden methods only verifiable by a machine or trained eye , as well as super-secret methods only known by the central bank.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9v9g5a",
                    "author": "PolkaBjorn",
                    "score": 1,
                    "created_utc": 1653434135.0,
                    "response": "Lol. I'll stick with my gold, thanks. Your pipe dream bubble is coming close to popping. I unfortunately don't think there's anything I can say to convince you.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9vdwvm",
                    "author": "hyperparasitism",
                    "score": 1,
                    "created_utc": 1653436236.0,
                    "response": "this dude probably brags to his family about how he is “his own bank”",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9vjefc",
                            "author": "Festortheinvestor",
                            "score": 0,
                            "created_utc": 1653438878.0,
                            "response": "No, I’m not one for bragging.\n\nThey’re all well informed and the majority are invested. \n\nThe supply will shrink, another halving grows ever near. \n\nWe’re all buckled up for the ride, are you?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9vjh8j",
                                    "author": "hyperparasitism",
                                    "score": 2,
                                    "created_utc": 1653438915.0,
                                    "response": "proving my point",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9vg92e",
                    "author": "EliteProdigyX",
                    "score": 1,
                    "created_utc": 1653437359.0,
                    "response": "Sure, but you also have to remember that it’s online and since it isn’t physical, there is always a chance that your country or city could lose power or some other technological disaster like a solar flare could reallllllly mess with the crypto market & your accessibility to your funds. So it’s always good to have diversity when it comes to situations like that.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9vi3sp",
                            "author": "Festortheinvestor",
                            "score": 1,
                            "created_utc": 1653438255.0,
                            "response": "Thanks for your concern.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9vhnl9",
                    "author": "YoAmoAlAmerica",
                    "score": 1,
                    "created_utc": 1653438039.0,
                    "response": "Fuck this shit...\nI'm so sick of fucking bitcoin Fuck that shit! \nIt's going worthless this shiiiiiit...!!!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9vhual",
                            "author": "Festortheinvestor",
                            "score": 1,
                            "created_utc": 1653438125.0,
                            "response": "Ha ha. Bot 🔫",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9vizu3",
                                    "author": "YoAmoAlAmerica",
                                    "score": 1,
                                    "created_utc": 1653438684.0,
                                    "response": "nocoiner... 🤦🏻‍♂️",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9vo75u",
                    "author": "lordstickmax",
                    "score": 1,
                    "created_utc": 1653441150.0,
                    "response": "Get both. Different markets for different buyers",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9vtt9i",
                    "author": "MGTOW_and_Bitcoin",
                    "score": 1,
                    "created_utc": 1653443799.0,
                    "response": "This is the dumbest thing to continue to compare forms of money to what amounts to is commodity orbiting..\n\nWhere is all of the new characteristics of money like decentralisation? Fixed Supply? Baked in monetary policy?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9yjfs1",
                            "author": "NitrogenSot",
                            "score": 2,
                            "created_utc": 1653499234.0,
                            "response": "Yeah both scenario are different and we should not compare a commodity to a fiat or assets, now we are just watching the tip, most of the people don't even know the basic difference between these three",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9yrz1r",
                                    "author": "MGTOW_and_Bitcoin",
                                    "score": 1,
                                    "created_utc": 1653502572.0,
                                    "response": "But it drives me crazy whenever I see these types of distinctions as though there's nobody who works in economics willing to distinguish metal properties from ideal money properties .\n\nWhy is divisibility even an issue when we're talking about 21st century money... gold couldn't even work for a 20th century economy or late 19th.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9vu0f8",
                    "author": "MyAddidas",
                    "score": 1,
                    "created_utc": 1653443894.0,
                    "response": "You should add a row for \"Spendable\" to represent which ones can be readily used to buy products and services. That's a factor people consider when they evaluate money.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9w3wq4",
                    "author": "ravenhawk10",
                    "score": 1,
                    "created_utc": 1653448668.0,
                    "response": "Why is there a comparison with physical gold? It’s just a dumb strawman if gold was used day to day i’d be gold backed currency never the actually thing. Which fixes both portable and divisible issues. \nCounterfeit money sounds like a minor issue, more like 99% plus 1% minus thing. With more and more payments going digital the problem will only reduce. \nTrack record kinda overlaps with durable somehow in ur infographic. Not to mention bitcoins track record is terrible for money. Fiats value predictably decreases slowly, which is what most people actually want out of their currency. Bitcoins is all over the show, the volatility is nuts. It stores value as well as a NASDAQ ETF stores value.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9w4l6l",
                    "author": "leisdrew",
                    "score": 1,
                    "created_utc": 1653449005.0,
                    "response": "This might be the dumbest graphic I've ever seen in my life",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ww3sk",
                            "author": "nmalajmi",
                            "score": 2,
                            "created_utc": 1653468534.0,
                            "response": "It's not the dumb graphic but some points are hard to believe like fungible point which is not true for gold and money, we should see the other point as well, graphics and idea is good but poorly represented",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9w8c79",
                    "author": "Eshlay",
                    "score": 1,
                    "created_utc": 1653450989.0,
                    "response": "Gold is easily verifiable nowadays an still profitable I'm pretty sure about 6 years ago it's was around $20 per g now it's $80 aus not as big of jump as some of the massive crypto jumps but a lot more stable in my opinion",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9y1iuq",
                            "author": "rjmalolot",
                            "score": 1,
                            "created_utc": 1653492230.0,
                            "response": "Yeah and it's value is stable as well, but gold is losing it's shine, if you see the last decade it was giving good profit, but now those days are gone, gold should kept as precious metal only not as an investment",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9ylzv8",
                                    "author": "Eshlay",
                                    "score": 1,
                                    "created_utc": 1653500225.0,
                                    "response": "Yeah it is kinda but I feel it's more a fake stability like if shit went bad it could be worth noting in a matter of seconds it could also definitely go the other way to tho. I kinda think the opposite with the precious metals not being an investment I know this generations incredible different but precious metals have always been the main wealth for as far back as weve discovered an it mostly will be forever people are always gonna like shiny things an the fact it's actually rare it'll probably always be a valuable thing + there actual uses for it like in technology",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9wcnph",
                    "author": "fellowpleb",
                    "score": 1,
                    "created_utc": 1653453499.0,
                    "response": "Title:\n\n\nMe: Just because you say it's not money doesn't mean it's not",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9wekff",
                    "author": "fresheneesz",
                    "score": 1,
                    "created_utc": 1653454697.0,
                    "response": "My take:\n\nThe + - system does not allow for accuracy of ranking/scoring.\n\n* Durability is good for all of them\n* Divisibility is best for bitcoin and worst for gold\n* Fungibility is just as good for all of them (with gold maybe being the slight winner)\n* Bitcoin is way more portable than cold hard cash, and is rather more portable than digital fiat. Gold loses there obviously.\n* Verifiability: you got it. Tho gold might be better than fiat in that realm.\n* Scarce: agreed.\n* Track record: agreed.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9xzbtp",
                            "author": "joentx",
                            "score": 1,
                            "created_utc": 1653491344.0,
                            "response": "Curious of your fungibility statement. Bitcoin can be uniquely identified by address or am I misunderstanding the context of your statement?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9wqn1m",
                    "author": "fingusio",
                    "score": 1,
                    "created_utc": 1653463623.0,
                    "response": "Bitcoin is surely superior than gold and fiat, if you keep watching this chart till end, you will realize that Bitcoin is having a better value than these two, fiat value is deprecating every year with inflation not in control of our government",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9wr32u",
                    "author": "CryingRipperTear",
                    "score": 1,
                    "created_utc": 1653464007.0,
                    "response": "bitcoin is divisible to eight decimals, but that wont be enough if it goes crazy green number",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9wrvwr",
                    "author": "The_2nd_Coming",
                    "score": 1,
                    "created_utc": 1653464714.0,
                    "response": "The only problem I have here is with scarcity - can you can it scarce when it is possible to create another cryptocurrency with ease?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9x1xdz",
                            "author": "Festortheinvestor",
                            "score": 1,
                            "created_utc": 1653473674.0,
                            "response": "Other cryptos are not the same. Bitcoin is The only regulated as a commodity. Bitcoin has all the right traits to replace fiat currency and move civilisation forwards.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9trcj6",
                    "author": "muttley_magnificent",
                    "score": -1,
                    "created_utc": 1653410993.0,
                    "response": "Bitcoin is not currency\nNot encrypted",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9smwtm",
                    "author": "MichaelAischmann",
                    "score": 0,
                    "created_utc": 1653391979.0,
                    "response": "But by COINcidence, Bitcoin is money!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ttp0w",
                            "author": "muttley_magnificent",
                            "score": 2,
                            "created_utc": 1653411952.0,
                            "response": "More like CON incidence.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9u3etj",
                                    "author": "MichaelAischmann",
                                    "score": 1,
                                    "created_utc": 1653415965.0,
                                    "response": "nope. \"coincidence\" is the word that has \"coin\" in it.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9sqs30",
                    "author": "ResistPatient",
                    "score": 0,
                    "created_utc": 1653394406.0,
                    "response": "Gold is not durable.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9szbzm",
                            "author": "CapivaraMan",
                            "score": 2,
                            "created_utc": 1653398987.0,
                            "response": "why?",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9wddii",
                            "author": "DigVic",
                            "score": 1,
                            "created_utc": 1653453937.0,
                            "response": "I don't think your statement is correct, gold is durable and you should check the property of gold as well, then only you will understand the durability of gold in future, gold is deprecating day by day but it's still durable in market",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9sye1f",
                    "author": "Schedule-Muted",
                    "score": 0,
                    "created_utc": 1653398528.0,
                    "response": "I guess my grandchild will be happy with 0.0001btc in 2045",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9wcnl6",
                            "author": "jamiewelsh1183",
                            "score": 4,
                            "created_utc": 1653453497.0,
                            "response": "Yeah even that amount will be having high valuation in future, as compared to current value, In 2045 we will be having high value of Bitcoin, as the block chain will keep getting in use, we will understand the technology more in future",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9ttzg2",
                            "author": "muttley_magnificent",
                            "score": 3,
                            "created_utc": 1653412071.0,
                            "response": "They won't have any idea what you are on about",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9u2rg3",
                    "author": "ChrimsonChin988",
                    "score": 0,
                    "created_utc": 1653415688.0,
                    "response": "Fungibility argument is dumb... they're all fungible",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9x8hkp",
                            "author": "icute78",
                            "score": 1,
                            "created_utc": 1653478424.0,
                            "response": "Yeah it should not be placed in this chart because gold and fiat are also fungible at some extent, but with rest of Point I agree strongly that Bitcoin is far better than these two assets, Bitcoin in future",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}