{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uqza5k",
            "title": "HODL to the Grave. How to Leave Bitcoin in Your Will.",
            "url": "https://www.wills.com/articles/Crypto-Wills",
            "author": "BoroughN17",
            "created_utc": 1652716923.0,
            "score": 1,
            "num_comments": 0,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uqzm2h",
            "title": "Wyoming: 1st place in world to recognize digital asset keys belong to you no matter what form of custody they're held in. Kraken is licensed as SPDI in Wyoming. Coinbase is licensed in 42 states (including NY), & a U.S. territory, yet won't recognize your ownership of bitcoin -Who will you support?",
            "url": "https://archive.ph/CEkuV",
            "author": "pcvcolin",
            "created_utc": 1652717781.0,
            "score": 171,
            "num_comments": 36,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8u3nse",
                    "author": "NiceDoctorBeam",
                    "score": 41,
                    "created_utc": 1652718081.0,
                    "response": "I'm out walking around during a rush hour.  I get to an intersection where a lot of cars are making right turns.  \n\nAccording to the man-made laws of my state, I have the right of way.\n\nAccording to the laws of physics, if a driver hits me, their car is likely to fuck me up, whether the light was green or not.\n\nThe man made laws of Wyoming can say what they will. Meanwhile the law: \"Not your keys, not your Bitcoin.\" prevails nonetheless.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8v8huc",
                            "author": "NotMiningBitcoin",
                            "score": 8,
                            "created_utc": 1652734523.0,
                            "response": "Exactly. All the laws in the world can’t make more Bitcoin if any of these exchanges decides to sell more coin than what they actually hold themselves.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8u4vob",
                            "author": "pcvcolin",
                            "score": 3,
                            "created_utc": 1652718571.0,
                            "response": "Here's a link to SF0125 as it was signed into law, so that you don't get into three word circular arguments.  That's not exactly a head spinning, day winning argument in court.\n\n[https://www.wyoleg.gov/Legislation/2019/SF0125](https://www.wyoleg.gov/Legislation/2019/SF0125)\n\nAs noted, there are different forms of custody that can be performed there under a custody agreement, either by use of private keys (possibly where the exchange fully manages), or by multisignature, or by smart contract (see the details in the law cited above).\n\nNo other State in the United States of America other than Wyoming (and I think, there is no other country as well) has laws where, if the exchange is licensed under those laws, your bitcoin is somehow recognized as legally yours when it's on that exchange.  **None**.  There are some states that are working on it (based on the efforts that Wyoming made), but expect a lot more notices like Coinbase's in the meanwhile (remember, where Coinbase recently stated in its own report that \"the crypto assets we hold in custody on behalf of our customers could be subject to bankruptcy proceedings,\" and that users of Coinbase will become \"general unsecured creditors..\" - I've seen at least one other company use this exact language recently and there will be more since, while there are a good number of crypto companies operating in Wyoming, it's still a fairly new area and many crypto companies are instead operating in the inferior legal system which is to say outside Wyoming).  This is also true, as you know, of nearly every typical bank model, not only of crypto exchanges that operate in standard U.S. state legal structures that haven't yet upgraded to Wyoming similar law.\n\nAs exchanges move to acquire banks or become licensed as bank or bank-like organizations (which is happening, and that's the main point here - there is no sense in ignoring it or pretending that it isn't happening since not only is it happening, it will be better than having the traditional banks be in total control of the economy), there is no sense in them doing so unless they recognize that the clients have ownership of the assets when those assets are on the platform.  Otherwise confidence in those exchanges simply decreases and people will no longer use them (and I would argue will eventually shift to exchanges where ownership IS recognized).",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8u622q",
                                    "author": "NiceDoctorBeam",
                                    "score": 11,
                                    "created_utc": 1652719042.0,
                                    "response": "It doesn't matter what the state law says when I'm being run over by a pickup truck doing 35 mph and running a red light.  Yep.  He broke the law.  Yep, I'm still dead or mangled.\n\nLeave your bike unlocked, thinking, \"It's illegal to steal...\" and see if it's there where you come back.\n\nLeave your Bitcoin on an exchange, and perhaps suffer for it.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8w9bad",
                                            "author": "cl3ft",
                                            "score": 1,
                                            "created_utc": 1652751829.0,
                                            "response": "It's a shitty analogy, you're not dead if your bitcoin is lost or stolen, you can still sue. And the law in Wyoming increases your chances of being treated as more than an unsecured creditor. It's a positive step that will make local exchanges rethink their security and custody policies. \n\nNo one's saying it's safer than managing your own wallet (doubtful anyway these days) or that your deposits are guaranteed, but it's definitely a step in the right direction.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8wes6m",
                                                    "author": "NiceDoctorBeam",
                                                    "score": -1,
                                                    "created_utc": 1652754581.0,
                                                    "response": "> you can still sue\n\nLearn the hard way, Mr. KnowItAll.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i8u7hn6",
                                            "author": "pcvcolin",
                                            "score": -8,
                                            "created_utc": 1652719603.0,
                                            "response": ">It doesn't matter what the state law says\n\nThat's a nice thought, tell that to yourself the next time you hear about a Coinbase event.\n\nEdit:  You're wrong.  But it's nice to imagine it doesn't matter.  You can think that way until it does matter and you're on the wrong end of a catastrophe.  How many people do you think are using Coinbase right now?  You can look it up.  \n\nThe answer:  Far too many.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8ubi1w",
                                                    "author": "NewFilm96",
                                                    "score": 9,
                                                    "created_utc": 1652721189.0,
                                                    "response": "How exactly would this law have helped people who had btc on Mt. Gox when it died?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8w9m24",
                                                            "author": "cl3ft",
                                                            "score": 2,
                                                            "created_utc": 1652751982.0,
                                                            "response": "Perhaps if Mt Gox had known they were on the hook legally they wouldn't have treated the whole exchange like a Magic the gathering forum? Legal responsibility shapes behavior, like it or not.\n\nNo one is claiming this is a panacea, but hopefully it will lead to positive change.",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "i8ux1o5",
                                                            "author": "tylerfulltilt",
                                                            "score": 1,
                                                            "created_utc": 1652729856.0,
                                                            "response": "It wouldn't have stopped it. But it would have given greater recourse to the victims.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8v29lr",
                                                                    "author": "SaneLad",
                                                                    "score": 3,
                                                                    "created_utc": 1652731983.0,
                                                                    "response": "What recourse? The coins were gone. The claimants got the $ scraps that were left over by the bankruptcy proceedings. That's all the law can do for anyone.\n\nI think people need to learn the difference between ownership and possession. If you give your coins to an exchange you still own them. But you no longer possess them. If they are lost, the exchanges may legally owe you those coins, but it no longer possesses them, and the law cannot make them reappear.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "i93ns1r",
                                                            "author": "pcvcolin",
                                                            "score": 1,
                                                            "created_utc": 1652896888.0,
                                                            "response": "I'm not sure if you are aware, but Kraken had a limited role in the MtGox claim process, if for no other reason than that it was a reputable firm and the executives and employees were capable of helping in the process, I think.  [This is a link that describes it](https://support.kraken.com/hc/en-us/articles/360001421326-Kraken-s-limited-role-in-the-MtGox-Claim-Process).\n\nIf I recall correctly, Kraken's involvement and help in the claims process with MtGox (basically to the extent Kraken could) occurred long before the Wyoming SPDI (Special Purpose Depository Institution) license was eventually applied for by Kraken and eventually approved by the Wyoming Banking Division (that approval was in late 2020), and I don't think any of the funds relating to MtGox would ever have been held in custody with Kraken (to await release) although I could be wrong.  (remember, In a January 2015 interview, Kraken bitcoin exchange CEO Jesse Powell discussed being appointed by the bankruptcy trustee to assist in processing claims by the 127,000 creditors of Mt. Gox, but as time went on this role changed, see link in first paragraph of this comment.)\n\nAnd - the law you are asking about - Wyoming's SF0125 - became law in 2019.  Which (based on my recollection) I think that there may still have been some limited Kraken involvement in MtGox claims at that time, but I don't think that it had relationship to the custody issue.  (It wasn't until late 2020 that the Wyoming SPDI was approved, etc.)\n\nNow if I understand your question a different way, let's say **if Wyoming's SF0125 had existed back when MtGox died, how would that law have helped people who had btc on MtGox at that time, to ask your question in a way that emphasizes / rewords it a little to ask \"how would it have been different if this law had existed back then?\"**\n\nWell, MtGox was headquartered in Shibuya, Tokyo.  MtGox did get a license from the U.S. (FinCen (as an MSB)), but that's it if I recall.  Let's imagine for a moment that Wyoming digital asset laws had been passed before MtGox was created (**they weren't**, but let's assume for the sake of this hypothetical situation here that they were), and that in this hypothetical situation, MtGox had been developed in Wyoming (which follows along as a hypothetical situation that meets the criteria of your question) and had obtained a Wyoming SPDI license (that would have been impossible for Karpeles / MtGox, I think, because of the rigor of the application process).  But if we assume that the application process were to have been approved, and the funds were in custody, **there would have to have been 1:1 full reserves for those client funds and a mechanism so that the funds that clients could use to withdraw the funds would be fully independent from the bank's operating funds / anything that could be touched by a bankruptcy**.  In other words, a total financial catastrophe, **even malice or attempts at theft by the head of a corporation, would result in funds still being available for clients to withdraw**.  **Not only that, the funds in such a system (the hypothetical \"MtGox Wyoming system in the past\") would be the clients' property, whereas the MtGox funds under discussion today are not technically the property of those who have made claims for them.**  Finally, all this would be happening with oversight of the Wyoming Banking Division.\n\nNow, **in the event that a website such as that were to shut down without notice**, and no-one would be able to initiate withdrawals, there would have to be claims process set up, but there would be no question that the client (you) own the funds and no question that you would be able to have legal title to those funds.  In addition, a number of clients would not need to make a claim, because the WY SPDI custody model has options that allow for multisignature, smart contract, in other words, forms of self-custody.  So in this hypothetical past in which there was a \"MtGox Wyoming system,\" some undetermined number of clients (following the \"death of MtGox\") **would not even need to make a claim, because they would already have the funds immediately available even if the exchange went offline and the exchange's website was down.**\n\nThat is the fundamental difference between Wyoming laws and the laws of all the other states as of right now.  The exchanges that don't license in Wyoming are avoiding giving you ownership of bitcoin and states that are delaying adopting laws like Wyoming's are delaying or avoiding the necessity of developing state laws that ensure that your assets are protected (and assets are legally recognized as yours) at all points in time.\n\nHope that answers your question.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8wla5j",
                    "author": "Mangalz",
                    "score": 4,
                    "created_utc": 1652758077.0,
                    "response": "Kraken ceo is also based AF.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8wpby8",
                            "author": "pcvcolin",
                            "score": 1,
                            "created_utc": 1652760489.0,
                            "response": "Agreed.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8ufxdy",
                    "author": "Marcion_Sinope",
                    "score": 2,
                    "created_utc": 1652722950.0,
                    "response": "We're all Wyomingians now.\n\nThe less power the KYC exchanges have, the better. Obviously you shouldn't use them in the first place but I like the trend here.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8us0pj",
                            "author": "pcvcolin",
                            "score": 2,
                            "created_utc": 1652727785.0,
                            "response": "Thank you.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8vsi9l",
                                    "author": "LUNA_underUrsaMajor",
                                    "score": 2,
                                    "created_utc": 1652743438.0,
                                    "response": "So would this treat crypto the same as other property,say if you own stocks in apple on Fidelity, and fidelity goes bankrupt you still own your stocks. And will just transfer them to other brokerages. Ideally this will protect investors. There is however several ways brokers can sell your stocks without permission, so it will be interesting what loopholes exist in wyoming for kraken to sell your crypto or not actually have it when you buy it.\nThis is a good first step though",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8wiwdd",
                                            "author": "pcvcolin",
                                            "score": 1,
                                            "created_utc": 1652756748.0,
                                            "response": "It wouldn't be the same - the definitions are different than those that are addressing stocks.  But I understand what you are getting at.  No, it wouldn't allow things to be sold / loaned without your permission, and it would treat the underlying keys as your property, but that's definitely different than the way stocks work.  In the case of the WY SPDI, rehypothecation is avoided (prohibited), the only exception I can think of in the law is that the customer can grant the WY SPDI licensed firm limited permissions to do so since the law states, \"A bank shall not authorize or permit rehypothecation of digital assets under this section. The bank shall not engage in any activity to use or exercise discretionary authority relating to a digital asset except based on customer instructions.\"  My reading of both the law and the rules they've adopted to implement the law in Wyoming for this indicates that the customer can authorize the WY SPDI to engage in a limited range of lending of the digital asset, but the parameters of that are quite limited (as I understood it, it was intended to limit risk to whatever crypto-fiat banks might be approved). \n\nYou mentioned Fidelity, which made me think of Fidelity Charitable which accepts bitcoin and possibly now other digital assets.  However,  strictly speaking it isn't Wyoming licensed (which brings us back to the concern over legal ownership of funds in custody).  Fidelity Charitable offers a DAF (donor advised fund), and there are other orgs that accept / integrate bitcoin that also offer the DAF opportunity.  \n\nOf note, under current Wyoming and federal law,\r  \n\r  \n*- A Trust Department of the WY SPDI can house charitable accounts.*\r  \n*- A charitable remainder trust can be within the WY SPDI (this sort of use case depends on the exchange or licensed company as to whether it would be set up that way).*\r  \n*- A Donor Advised Fund (DAF) can provide up to 30 percent AGI deduction and no tax on invested income.*\r  \n\r  \nExamples of DAFs that accept crypto are provided via [Fidelity](https://www.fidelitycharitable.org/giving-account/giving-account-details.html) and [Endaoment](https://www.endaoment.org/), although I think that WY SPDI licensed organizations (such as [Kraken](https://www.kraken.com/en-us/learn/finance/spdi-bank-charter), [Custodia](https://custodiabank.com/) (formerly named Avanti), [Commercium](https://commerciumbank.com/), and [Wyoming Deposit and Transfer Corporation](https://wdtfinancial.com/organizational-status)) would be better because they are in fact directly SPDI licensed in Wyoming whereas Fidelity isn't (last I checked) nor is Endaoment (note:  the method by which funds can be received by nonprofits who ultimately benefit via Endaoment's system [is shown here](https://docs.endaoment.org/organizations/receiving-endaoment-grants), it does not involve bitcoin, whereas Fidelity's DAF system does involve bitcoin as an option.)  \n\nHopefully that answers some of your questions around this topic.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8urxew",
                    "author": "NYKNYb",
                    "score": 2,
                    "created_utc": 1652727747.0,
                    "response": "Noise.\n\nNot your keys, not your bitcoin.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8wp9vk",
                            "author": "pcvcolin",
                            "score": 0,
                            "created_utc": 1652760452.0,
                            "response": "Not an argument.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8y2uwp",
                                    "author": "Lagavulin",
                                    "score": 0,
                                    "created_utc": 1652795757.0,
                                    "response": "Not your keys, not your bitcoin muthafukka!  Now its an argument.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8w7kpc",
                    "author": "KaiSosceles",
                    "score": 1,
                    "created_utc": 1652750952.0,
                    "response": "When Kraken gives me 4% cash back, ill take my debit business to them.\n\nUntil then, Im not storing my long term holdings with any custodian but my own my wallet. Is Kraken giving me access to defi? To yield farming? To arbitrage? To leverage? To self paying loans? To do whatever I want with my coins without needing to store my KYC data in a place that will evebtually be hacked?\n\nCentral exchanges are bridges, not custodians, no matter what their terms say.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8wp37o",
                            "author": "pcvcolin",
                            "score": 1,
                            "created_utc": 1652760339.0,
                            "response": "Why would you want cash back [when it is doing this](https://www.usinflationcalculator.com/)?\n\nAt 4 percent? Are you crazy?\n\nYes, Kraken has an \"earn\" program on various assets.  But that's not the point here.  What you are saying is just pure unadulterated lunacy.\n\nI'm not going to tell you what to do with yourself, but for the sake of your own safety and general well being, don't condition decisions about your (limited or not so limited assets, I won't assume) based on whether you're going to be (shudder) given cash.  It literally sounds like you want to be thrown to the wolves.\n\nI'm not your family, I don't even know you, but I implore you to just make better decisions.\n\nEdit:  *Those who upvoted the above comment, what the hell?  Are you living in a cartoon?*",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8vu67s",
                    "author": "summertime_taco",
                    "score": 1,
                    "created_utc": 1652744252.0,
                    "response": "Until Kraken does ACH deposits I'll be using coinbase.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8w3x9q",
                            "author": "senfmeister",
                            "score": 1,
                            "created_utc": 1652749129.0,
                            "response": "Strike is great.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8wkj94",
                                    "author": "pcvcolin",
                                    "score": 0,
                                    "created_utc": 1652757656.0,
                                    "response": "Do you know what Strike is?\n\nLet me tell you what Strike actually is.  \n\nStrike is barely even an app.  Yes, it has very interesting functionality that's used by a great number of people, but it's basically glittery marketing backed by... a custodial service.  yes, a custodial service. \n\nFrom the Terms of Service of Strike:\n\n*5 a) General. Strike has* ***partnered with third parties to facilitate, provide, or otherwise offer certain parts of the Services (\"Third-Party Partners\").*** *You may be required to enter into additional agreements with such Third-Party Partners in order to enable or access certain functions of the Services.* ***Strike does not have control of, or liability for, the products or services offered by Third-Party Partners.***\r  \n\r  \n*(b) Prime Trust Terms.* ***As applicable, you appoint Strike or its Third-Party Partner or its agent to receive payments as part of any transaction on your behalf.*** *Strike is not a bank or other chartered depository institution.* ***Presently, Strike works with Prime Trust, LLC, a Nevada state-chartered trust company (\"Prime Trust\"), to accept and custody payments and to effect transfers to and from your Account.*** *You understand that you will access and manage your Prime Trust account through our Services, and Prime Trust account notifications will be sent by us, not Prime Trust. In order to use the payment functionality of the Services, you agree to (i) Prime Trust's privacy policy, available at https://www.primetrust.com/privacy, and (ii) those Prime Trust terms and policies applicable to the functionalities of your Account, including, as applicable, the Prime Trust Custodial Agreement in addition to other applicable Prime Trust terms (collectively, \" Prime Trust Terms \"). (...)*\n\n&#x200B;\n\nSo next time the \"Wheee! STrike Rulez the World!!!!\" marketing and tweets are pushed out, remember:  It's technically Prime Trust, LLC that allows that to happen... Or if not Prime Trust, LLC, then it will be another custodian tomorrow.  \n\nMaybe Strike should partner with Kraken since technically, Kraken is a custodian... Then the users of Strike would be certain that the private keys would indeed be legally treated as theirs at all moments no matter how long they remain with the custodian (whether for a few moments or for much longer).",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8wjjd2",
                            "author": "pcvcolin",
                            "score": 1,
                            "created_utc": 1652757103.0,
                            "response": "F",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8vb3m1",
                    "author": "Ethernovan",
                    "score": 1,
                    "created_utc": 1652735598.0,
                    "response": "I really wish Kraken would support ACH transfers",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8wj6y4",
                            "author": "pcvcolin",
                            "score": 2,
                            "created_utc": 1652756908.0,
                            "response": "maybe you're in NY or WA? [https://support.kraken.com/hc/en-us/articles/360061352231-ACH-online-banking-purchases](https://support.kraken.com/hc/en-us/articles/360061352231-ACH-online-banking-purchases)\n\nIf you are, move out of NY / WA or incorporate in Wyoming.  Then set up a Corp / business account on the exchange (using the WY LLC or literally any other state LLC other than NY or WA - but WY seems logical).  The corp / LLC is now the client, you're welcome.\n\nI realize you may have been talking about wanting to do just cash transfers into the account via ACH ([they already do ACH withdrawals](https://support.kraken.com/hc/en-us/articles/4408922630676-ACH-withdrawals)).",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8w09tn",
                    "author": "arbalest_22",
                    "score": 1,
                    "created_utc": 1652747299.0,
                    "response": "This only matters if you’re foolish enough to leave your crypto on an exchange.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8wndg7",
                            "author": "pcvcolin",
                            "score": 1,
                            "created_utc": 1652759295.0,
                            "response": ">This only matters if you’re foolish enough to leave your crypto on an exchange\n\n\\- on an exchange named Coinbase, or any exchange that does not utilize Wyoming or Wyoming-similar law and licensing.  That's the caveat.  \n\nYou have two solutions.\n\n1.  Remove your digital assets from the exchange, place them on your hardware wallet (**and, I would argue - stop supporting and close your accounts at any exchange that operates in a manner where its jurisdictional and licensing pathway it has chosen does not honor your desire to legally own your digital assets at all moments regardless of form of custody**).  This is a fancy way of saying \"don't just move away from traditional banks, stop supporting exchanges that don't recognize your ownership of digital assets at all moments in time - stop supporting exchanges that try to claim that your bitcoin is theirs.\"\n2. **Find another exchange to do business at that does recognize that your assets are yours.**  Again, right now, that would be one that is operating under Wyoming or Wyoming-similar law, which right now means that Kraken is the only crypto exchange operating that is doing that (and if I understand correctly the scope of these laws extend to U.S. persons, which means that people in other countries that don't have laws that recognize or protect ownership, that they have a lot to work on).  That doesn't mean you have to leave your bitcoin on the exchange, it just means that in the timeframe you need it to be there (whether it's for a few hours, or days or whatever your strategy requires) that it will in fact be understood to be yours.  Finally as to the question of decentralized exchanges (and why not just use those), I think there is only truly one that actually meets the definition of a truly decentralized exchange, and it is [bisq](https://bisq.network/), though like all exchanges, you'll still hit roadbumps periodically when using [the payment methods](https://bisq.wiki/Payment_methods) and limitations on what you can do with how much you can order / trade there. \n\nIn countries outside of the U.S., for example in the E.U., where there were controversial discussions and votes in March of 2022 regarding (amongst other things) requirements to disclose transfers to unhosted wallets, I'm not sure what to say except it's pretty obvious that E.U. doesn't seem to have any desire to protect ownership of assets.  In that case those in the E.U. may need to migrate fully to multisignature and smart contract solutions and begin a process of moving to redundant space (low earth orbit) backups (some of these services already exist to protect client assets).  As countries get more hostile and desperate such space-oriented redundant services will become necessary as a legal aspect of protection of one's lifetime savings.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8wbk60",
                    "author": "jordanlesson",
                    "score": 1,
                    "created_utc": 1652752957.0,
                    "response": "There is no such thing as ownership when it comes to Bitcoin. Whoever is in possession of an accounts private key is able to do whatever they like to the Bitcoin in that account. Having a central authority attempt to regulate that is a waste of money",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8wnq02",
                            "author": "pcvcolin",
                            "score": 2,
                            "created_utc": 1652759501.0,
                            "response": ">Whoever is in possession of an accounts private key is able to do whatever they like to the Bitcoin in that account.\n\nThat is the point that is being made by the article cited and by the discussion here.  The finer details are covered because they are important and can't be dismissed. If you ignore them (if you don't understand anything about terms, laws, choice of jurisdiction / licensing, etc., and its implications), you end up getting Coinbased.\n\n(That's called getting f\\*cked, in crypto world.)\n\nIt's fairly obvious there is no \"central authority\" over Bitcoin itself, but the law that is applicable when an exchange chooses to operate in certain areas and chooses its licensing, is in fact that law that applies and has relation in terms of how the assets are treated.\n\nCheers",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "uqzojr",
            "title": "Daily Bitcoin News May 15th,2022",
            "url": "http://youtu.be/rafxWPoJDzg",
            "author": "Simplybitcoin1",
            "created_utc": 1652717963.0,
            "score": 1,
            "num_comments": 1,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": []
        }
    ]
}