{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uwja63",
            "title": "What is bitcoin and how does it work",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uwja63/what_is_bitcoin_and_how_does_it_work/",
            "author": "hellwrap",
            "created_utc": 1653369043.0,
            "score": 0,
            "num_comments": 1,
            "subreddit": "Bitcoin",
            "selftext": " Bitcoin is a type of digital cryptocurrency that is fully decentralized, that is, bitcoin cannot be controlled by the government of any country or any person.\n\nSatoshi Nakamoto started Bitcoin in 2008, but to date, no one knows who Satoshi Nakamoto is, or what it looks like.\n\nThe price of bitcoin in 2008 was about 0.20 cents, but if you look at the price of bitcoin now, it is about 23,000 dollars.\n\nMaybe bitcoin will become a primary means of transactions in the future, if you ask the experts about bitcoin, then everyone trusts bitcoin, but some veteran investors still consider bitcoin a useless investment.\n\n**How does Bitcoin Works?**\n\nEvery bitcoin in the world is basically a type of computer file that is stored in a ‘digital wallet’ app on any smartphone or computer.\n\nAnyone can send any number of bitcoins to your digital wallet anytime and anywhere, and you can send any number of bitcoins to other people anytime and anywhere.\n\nEvery single bitcoin transaction is recorded on a public list called the blockchain.\n\nThis makes it possible to trace the history of bitcoin to prevent people from spending coins they don’t already have, making copies, or undoing transactions.\n\nRead more go to hellwrap site<<",
            "stickied": false,
            "comments": [
                {
                    "id": "i9rwzws",
                    "author": "HungryLikeTheWolf99",
                    "score": 1,
                    "created_utc": 1653370160.0,
                    "response": "If your exchange rate is $23,000 to 1BTC, I'll gladly buy all your BTC right now.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uwje54",
            "title": "Bitcoin’s enigma",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uwje54/bitcoins_enigma/",
            "author": "Emanuelsil",
            "created_utc": 1653369483.0,
            "score": 2,
            "num_comments": 2,
            "subreddit": "Bitcoin",
            "selftext": "The max Bitcoin supply is 21M the amount of people that holds BTC is growing , the game that funds are playing is limited so how come A. The volatility is still high B.the price of Bitcoin is not $1M min?",
            "stickied": false,
            "comments": [
                {
                    "id": "i9se0r0",
                    "author": "Hughski",
                    "score": 1,
                    "created_utc": 1653384941.0,
                    "response": "When it comes to price, you’ve just gotta ask: who the fuck would pay $1,000,000 for a BTC right now? Not very many people and that’s why it’s not priced at $1,000,000.\n\nPersonally I’m not happy to buy at the current price and am waiting for it to go lower. There will be others with similar views and obviously that’s gonna keep the price low for the time being",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9rxc0b",
                    "author": "solomonsatoshi",
                    "score": 0,
                    "created_utc": 1653370409.0,
                    "response": "A- Bitcoin is a very liquid asset which has experienced the highest level of appreciation of any liquid asset, in fact any asset and so it is used by some traders as a liquid store of capital- in general market dips they must cash it to cover calls.\n\nB- High growth assets tend toward volatility- just ask any broker.\n\nC- Significant numbers buy Bitcoin in hope of rapid gains and they bail upon market declines increasing volatility on the way up and down- these weak handed cucks lose money that is gained ultimately by those who bought with understanding and belief in the principles and ethos that is embodied by BTC.\n\nD- Long live the revolution seeking to restore monetary integrity and provision an alternative to fiat debt slavery . . . it will take a while longer and the ultimate outcome is not guaranteed, but its worth a try IMO.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uwj7mv",
            "title": "Daily Discussion, May 24, 2022",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uwj7mv/daily_discussion_may_24_2022/",
            "author": "rBitcoinMod",
            "created_utc": 1653368759.0,
            "score": 45,
            "num_comments": 259,
            "subreddit": "Bitcoin",
            "selftext": "Please utilize this sticky thread for all general **Bitcoin** discussions! If you see posts on the front page or /r/Bitcoin/new which are better suited for this daily discussion thread, please help out by directing the OP to this thread instead. Thank you!\n\nIf you don't get an answer to your question, you can try phrasing it differently or commenting again tomorrow.\n\n[Join us in the r/Bitcoin Chatroom!](https://discord.gg/K5H25KZHke)\n\nPlease check the [previous discussion thread](https://www.reddit.com/r/Bitcoin/comments/uvtpy6/mentor_monday_may_23_2022_ask_all_your_bitcoin/) for unanswered questions.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9rxq2q",
                    "author": "88eth",
                    "score": 18,
                    "created_utc": 1653370700.0,
                    "response": "Something most critics have ignored, over the last 2 years Bitcoin is still 300% up, while Nasdaq now is barely 20% up.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ryj64",
                            "author": "thefullmcnulty",
                            "score": 10,
                            "created_utc": 1653371310.0,
                            "response": "On the 10 year chart bitcoin has demolished every other asset and it’s not even close. \n\nPeople don’t care because they want to erroneously hate, disparage and nay-say to suit their own biases and delusions. In the end their dishonesty just sets them back. Fuck em.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9vu55a",
                                    "author": "koenbruin",
                                    "score": 1,
                                    "created_utc": 1653443956.0,
                                    "response": "People don't care as long as they're making profits. That's all they care about man.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9rzfzg",
                            "author": "WinAny9651",
                            "score": 3,
                            "created_utc": 1653372014.0,
                            "response": "And over the last 4.5 years?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9rzurr",
                                    "author": "88eth",
                                    "score": 7,
                                    "created_utc": 1653372324.0,
                                    "response": "Nasdaq is up 85% over the last 5 years. Bitcoin price 5 years ago was $2691. If you take the peak Bitcoin once was at $20k almost, its obviously just 50%. But you have to be pretty unlucky to buy exactly at the peak, right.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9s0v9t",
                                            "author": "RottenPlankton",
                                            "score": 3,
                                            "created_utc": 1653373147.0,
                                            "response": ">you have to be pretty unlucky to buy exactly at the peak\n\nIndeed. Barely anybody bought at the peak. That's why the price fell. It was only $19k for a very brief moment.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9tsipw",
                                                    "author": "sahalaximahai",
                                                    "score": 1,
                                                    "created_utc": 1653411476.0,
                                                    "response": "I mean the way people cry about it here, it seems a lot of people bought the peak lol.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9um38i",
                                                            "author": "lessioa",
                                                            "score": 1,
                                                            "created_utc": 1653423826.0,
                                                            "response": "People definitely bought the peak lol. I never see comments about that anymore tho",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9tl91r",
                                            "author": "victor_gener",
                                            "score": 1,
                                            "created_utc": 1653408518.0,
                                            "response": "I don't even know why we even comparing both the things at all.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i9td21p",
                                            "author": "ProphetOfADyingWorld",
                                            "score": 0,
                                            "created_utc": 1653405114.0,
                                            "response": "Most people likely fomoed at/near the peak though",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9w1mq9",
                                                    "author": "namefio2",
                                                    "score": 1,
                                                    "created_utc": 1653447519.0,
                                                    "response": "Yeah that's why they are having so much fear in market",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9ulcgc",
                                    "author": "Funnel1Cvq",
                                    "score": 1,
                                    "created_utc": 1653423514.0,
                                    "response": "All I gotta say that it's been amazing and if you wanna see that then you gotta zoom out.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9vit7n",
                            "author": "christianmeinhol",
                            "score": 1,
                            "created_utc": 1653438596.0,
                            "response": "Why would they do that, it doesn't fit their narrative. They're not going to do that.\n\nAnd they're only going to sa5 the things which may fit their narrative only. They'll not sag anything else.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9ugntc",
                    "author": "itsthesecans",
                    "score": 19,
                    "created_utc": 1653421542.0,
                    "response": "With the correlation between BTC and Nasdaq these days I decided to take a look at how the Nasdaq has recovered from down markets in the past.  The Nasdaq is down about 30% year-to-date.  I think it’s pretty safe to assume it will be a negative year.\n\n\r  \nYou may be surprised to learn, as I was, that in the 50 year history of the Nasdaq there have only been consecutive down years on two occasions.  The first time was 1974 & 1975 (-31% & -35%).  The other time was after the dotcom bubble crash in 2000 which was immediately followed by 9/11.  In this case there was actually 3 consecutive down years. \n\nhttps://www.macrotrends.net/1320/nasdaq-historical-chart\n\n\r  \nInflation was also very high in ‘74/’75 (11% & 9%).  Although it would get even higher in the early 80s.\r  \n\n\nFor a number of reasons I don’t think the current market is anything like the 2000 bust.\r  \n\r  \nThe last big down year was 2008 when the Nasdaq was down over 40%.  The next year it was up 43%.  Of course, a 40% gain doesn’t erase a 40% lose.  It took about 4 years for the market to regain previous highs.\r  \n\r  \nAnother thing I found interesting was that the 2008 market topped out in November of the previous year (like this time around) and selloff bottomed out in February of 2009.   After that it went on a 65% run over the next 12 months.  If history repeated itself, we would see a bottoming in February of 2023.  That’s about one year before the next bitcoin halving.  \n\nBut the current monetary environment is different today than in 2008-2009 so who knows.  None of the historical comparisons are perfect.  But just like with bitcoin it pays to zoom out and realize that markets never go down forever.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9v1sn5",
                            "author": "Ok-Abbreviations6442",
                            "score": 3,
                            "created_utc": 1653430619.0,
                            "response": "Interesting observations dude. Thought provoking 👍",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9vz8un",
                            "author": "avictor32",
                            "score": 2,
                            "created_utc": 1653446363.0,
                            "response": "This is a good writeup man, really good observations in here.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9sm8kx",
                    "author": "Familiar_Hotel_5269",
                    "score": 17,
                    "created_utc": 1653391520.0,
                    "response": "Would love to see that phony fraud Christine laggarde ban bitcoin so that it exposes her like it exposed xi in China",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9smfuj",
                            "author": "Familiar_Hotel_5269",
                            "score": 3,
                            "created_utc": 1653391657.0,
                            "response": "Then her justification of launching a crypto when the ECB said they were all ponzis: “so the central bank will be behind it and I think that is vastly different from any of those things” lmao you can’t make this up",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9u6f9y",
                                    "author": "adhgsw",
                                    "score": 1,
                                    "created_utc": 1653417231.0,
                                    "response": "Looks like people like to make things up, that's what they're doing.\n\nAnd on the other side I absolutely hate the people who make things in their heads and then share them with us here.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9vc1op",
                            "author": "nefyrekafus",
                            "score": 1,
                            "created_utc": 1653435356.0,
                            "response": "Lol, what even is that and what are you talking about here?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9sh39m",
                    "author": "Maticus",
                    "score": 15,
                    "created_utc": 1653387641.0,
                    "response": "Bitcoin lives rent free in the heads of the WEF davos crowd and the IMF planners.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9tqdug",
                            "author": "18116226916",
                            "score": 3,
                            "created_utc": 1653410601.0,
                            "response": "Yes it does lol, it's all that they could ever talk about man. It's amazing.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9ulh37",
                    "author": "HurricaneHarvey7",
                    "score": 13,
                    "created_utc": 1653423569.0,
                    "response": "Snapchat is down like 45% in one day, and you know some asshole over in /r/buttoncoin owns that stock",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9uloys",
                            "author": "NiceDoctorBeam",
                            "score": 2,
                            "created_utc": 1653423660.0,
                            "response": "Good.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9uo6k2",
                            "author": "Asum_chum",
                            "score": 1,
                            "created_utc": 1653424706.0,
                            "response": "Who came of it this time?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9seogz",
                    "author": "lessioa",
                    "score": 12,
                    "created_utc": 1653385544.0,
                    "response": "I can’t stop buying bitcoin, i think i have a addiction problem",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9t7jyu",
                            "author": "The_Estranger_0001",
                            "score": 4,
                            "created_utc": 1653402768.0,
                            "response": "Best addiction a person can have.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9vxpy0",
                            "author": "MGSXIV",
                            "score": 1,
                            "created_utc": 1653445637.0,
                            "response": "If that's the addiction, then I don't have any problems having that addiction man.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9uc22l",
                    "author": "just_thisGuy",
                    "score": 9,
                    "created_utc": 1653419609.0,
                    "response": "Anyone noticing this? Tech stocks are getting crushed, even Google, Bitcoin is actually slightly up, this could be huge, if it holds. If Bitcoin and stock market decouple it’s the biggest thing in crypto ever.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9v92ap",
                            "author": "inkehad",
                            "score": 2,
                            "created_utc": 1653433952.0,
                            "response": "Yeah unfollowing NASDAQ will be big achievement for the crypto",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9u95sd",
                    "author": "superSaganzaPPa86",
                    "score": 9,
                    "created_utc": 1653418383.0,
                    "response": "SNAP down 42% in a day but BTC is the volatile asset. Here is my thinking, all the companies at wildly high valuations are going to be corrected with extreme prejudice. Chickens come home to roost and at that point I think bitcoin will start looking like a more and more reasonable place to retain wealth. I know we can go lower but to be hovering at $30K amidst the financial winds of shit that are raging right now is actually impressive. \n\nAlso read the genesis block, if you truly believe in the vision we might be at the cusp of our first true test. Bitcoin was created to combat the corrupt financial institution. If it can prove it's salt here then bitcoin's place in the world will be impossible to ignore.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9vcb38",
                            "author": "yzhh1987",
                            "score": 2,
                            "created_utc": 1653435477.0,
                            "response": "Bitcoin is not a volatile currency but due to the cycle it's getting low",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9ung0w",
                            "author": "Western_Boris",
                            "score": 1,
                            "created_utc": 1653424395.0,
                            "response": "Bitcoin still is uncorruptable and cannot be counterfeit. It only needs to keep working just like it has done for 13 years. No need for any magical moves. Every day is proof (of work).",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9t6skd",
                    "author": "Impressive-Horse",
                    "score": 6,
                    "created_utc": 1653402438.0,
                    "response": "Just made a big buy. Incredible to be buying in the 20's. Inflation isn't going away. $29k today is more like the purchasing power of $20k a year or two ago. This is a total no-brainer to me.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9tcjei",
                            "author": "ProphetOfADyingWorld",
                            "score": 2,
                            "created_utc": 1653404895.0,
                            "response": "DCAing down is the way to go",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9tztao",
                                    "author": "Western_Boris",
                                    "score": 1,
                                    "created_utc": 1653414474.0,
                                    "response": "DCAing all the way down and all the way up. So easy. No matter what the price is, just buying more. Because there is not any other as hard money / investment / savings account as Bitcoin is.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9tbe9k",
                    "author": "Altruistic_Baker_423",
                    "score": 7,
                    "created_utc": 1653404415.0,
                    "response": "Whatever you do or don't, Bitcoin will persevere.\n\nAct accordingly.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9vwggr",
                    "author": "JlloydHodls",
                    "score": 8,
                    "created_utc": 1653445047.0,
                    "response": "Read the Bitcoin Standard if you haven’t yet, it’s a great book that gets you thinking. There’s an entire free audiobook of it on YouTube, slow it down to 0.75x speed because at regular speed the talking is very fast.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9tmkzv",
                    "author": "wackyasshole",
                    "score": 7,
                    "created_utc": 1653409067.0,
                    "response": "Relax and DCA we all been here before. 🥰",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9t5aec",
                    "author": "Sumo_Bro",
                    "score": 6,
                    "created_utc": 1653401782.0,
                    "response": "Peace love and joy to all citizens of Bitcoin!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9tdiq6",
                    "author": "redshift_11",
                    "score": 5,
                    "created_utc": 1653405310.0,
                    "response": "The night is dark and full of terrors..",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9vf763",
                            "author": "samipasta",
                            "score": 1,
                            "created_utc": 1653436847.0,
                            "response": "There is always a morning for the darkest night, remember this",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9te1ng",
                            "author": "bobbensonbill",
                            "score": -1,
                            "created_utc": 1653405531.0,
                            "response": "GoT FTW",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9thi0r",
                                    "author": "commonphenom",
                                    "score": 2,
                                    "created_utc": 1653406973.0,
                                    "response": "What does ftw stand for? F the wife?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9u1h91",
                                            "author": "Henry2k",
                                            "score": 3,
                                            "created_utc": 1653415158.0,
                                            "response": "For The Win.  I believe it's a Hollywood Squares reference (the Tic Tac Toe game with celebrities). Example: \"I'll go with Joan Rivers for the win please\"",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i9tht67",
                                            "author": "bobbensonbill",
                                            "score": 2,
                                            "created_utc": 1653407102.0,
                                            "response": "For The Win",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i9tn1sf",
                                            "author": "GoElastic",
                                            "score": 1,
                                            "created_utc": 1653409254.0,
                                            "response": "LOL, more genderlike \"F the husband\" too",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9w46kd",
                    "author": "Cats_n_Porn",
                    "score": 5,
                    "created_utc": 1653448806.0,
                    "response": "That's it fellas. The last chance to buy under 30k has passed... Until tomorrow.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9tr6sr",
                    "author": "OpticallyMosache",
                    "score": 11,
                    "created_utc": 1653410928.0,
                    "response": "If BTC wasn't getting stronger, it would be at like $6k already by the stock bros dumping it as a risk on asset. Unless we see adoption, innovation, and long term holders declining - then there's nothing to worry about. BTC just stepped onto the main stage.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9unyq5",
                            "author": "apotekhornan",
                            "score": 1,
                            "created_utc": 1653424613.0,
                            "response": "Bitcoin is stil a strong holder it's having a good resistance and support",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9rzlza",
                    "author": "tesseramous",
                    "score": 3,
                    "created_utc": 1653372136.0,
                    "response": "Are there really 80,000 longs on bitfinex or is that some kind of error? Their entire volume for the past 2 weeks cant be people opening longs.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9s0mj1",
                            "author": "88eth",
                            "score": 6,
                            "created_utc": 1653372952.0,
                            "response": "Its not that unrealistic. The crash was basically caused by TerraUSD right? So is the crash reasonable? \n  \nNow of course if theres only longs theres no way they all come true because it would break the bank lol, I guess Bitfinex could secure themselves, like by selling a lot of Bitcoin to drop the price and kill the longs",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9s7en6",
                                    "author": "tesseramous",
                                    "score": 3,
                                    "created_utc": 1653378761.0,
                                    "response": "Bitfinex is such a smaller exchange now that I dont think it has the liquidity to possibly be long 85,000 coins. And how can all the volume go to a single trade? Usually an exchange's volume is evenly split into a number of different trade types and bots and traders going in and out. I just think there is a chance that something is broken and not right with this data. Otherwise it looks really bad.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9sko4y",
                                            "author": "PrognosticalSon",
                                            "score": 3,
                                            "created_utc": 1653390425.0,
                                            "response": "I think they offset the longs with shorts. So if 85000 coins long and 4000 coins short, they only need to find 81000 coins.\n \nHowever for these leveraged positions they can only be closed after opening, and there is no way to send or use the bitcoin they have levered into. If that is true, then the exchange never needs bitcoin to beck the trades, just cash equivalent. \n \nIf shorts profit, longs get liquidated and their money goes to the shorts and vice versa. When the two sides of the books a re balanced this is pretty risk free, but when you have an outsized long, if bitcoin explodes to the upside, the exchange will be on the hook for a lot of cash to pay them. This scenario is what will blow up exchanges who are fractionally using their bitcoin reserves. \n \nI have never once seen a screenshot or notification saying how many bitcoins are locked up in trades. I'm pretty sure if tou had the cash they would let you leverage into a 22MM bitcoin position.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9u7xg7",
                                                    "author": "stifterl85",
                                                    "score": 1,
                                                    "created_utc": 1653417863.0,
                                                    "response": "That's still a lot of coins, I don't think they have the liquidity for all that many coins.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9vrv93",
                                                            "author": "PrognosticalSon",
                                                            "score": 1,
                                                            "created_utc": 1653442889.0,
                                                            "response": "I agree, they probably don't",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9uw5x9",
                                            "author": "xiangqiu",
                                            "score": 3,
                                            "created_utc": 1653428144.0,
                                            "response": "Yeah that's what I'm thinking, how do they have that many longs anyways?\n\nThis just doesn't add up I think there's something wrong here. I'm not getting good vibes about this man.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9txtry",
                                    "author": "bangzeed",
                                    "score": 1,
                                    "created_utc": 1653413652.0,
                                    "response": "Absolutely nothing about that crash was reasonable, that crash fucking sucked dude.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9v3yxo",
                            "author": "wapercz",
                            "score": 3,
                            "created_utc": 1653431595.0,
                            "response": "I don't think that's an error, that's just people being gamblers and gambling out there.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9tnutv",
                    "author": "myheartgoesshalala",
                    "score": 4,
                    "created_utc": 1653409580.0,
                    "response": "Love this price action. I am getting paid at the end of this month. So I am glad I can buy bitcoin this cheap.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9tof95",
                            "author": "Dizzy_Space_Invader",
                            "score": 5,
                            "created_utc": 1653409808.0,
                            "response": "Will be $100k by month end",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9tpty0",
                                    "author": "myheartgoesshalala",
                                    "score": 7,
                                    "created_utc": 1653410377.0,
                                    "response": "Wouldn't mind that either. I have enough bitcoin to be happy when it goes up. Win Win situation is what I got here.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9tqkus",
                                            "author": "The_Estranger_0001",
                                            "score": 5,
                                            "created_utc": 1653410680.0,
                                            "response": "True Bitcoiner!",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i9vzxbc",
                                            "author": "truczen",
                                            "score": 1,
                                            "created_utc": 1653446689.0,
                                            "response": "Bitcoin is going to get up in future again, waiting for BTC to rise",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9v276h",
                                    "author": "rose2392",
                                    "score": 1,
                                    "created_utc": 1653430799.0,
                                    "response": "That's too much hugh prediction about Bitcoin, let's see how it goes",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9wed3w",
                                            "author": "Dizzy_Space_Invader",
                                            "score": 1,
                                            "created_utc": 1653454563.0,
                                            "response": "Hugh Lorry?",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9w3jwb",
                            "author": "Rostik1450",
                            "score": 1,
                            "created_utc": 1653448485.0,
                            "response": "Wow nice, you are going to get the Bitcoin at low price, good for you",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9u4amz",
                    "author": "NectarineDirect936",
                    "score": 3,
                    "created_utc": 1653416337.0,
                    "response": "Belgium stacking for 1.5 year non stop so far. 💎🙌",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9uk81i",
                            "author": "lessioa",
                            "score": 3,
                            "created_utc": 1653423036.0,
                            "response": "Diamanten pollekes 💎🙌🏼",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9uolu5",
                    "author": "OpticallyMosache",
                    "score": 5,
                    "created_utc": 1653424885.0,
                    "response": "My argument for BTC as the only long term cyrpto investment is that it's the only crypto that is designed to go up and becomes more useful with more liquidity.\n\nI believe the other utility based cryptos should dilute their coin/token price to maintain their utility. Transactions should be cheap to support their usage. It makes no sense why you would want transactions to be  more expensive when the argument for why the blockchain is valuable is because it can be used. Why hold an altcoin that you hope goes up by burning coins, etc. when you could just hold BTC?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9uwwc5",
                    "author": "I-Know-What-To-Do",
                    "score": 3,
                    "created_utc": 1653428466.0,
                    "response": "Come on BTC just $500 more to reach $30k then shorties will do its job to bring it back to $28K-$29K\n\nCome on you can do it. Push it. Push it hard God damn it.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9w6ij8",
                            "author": "jcrsouza",
                            "score": 3,
                            "created_utc": 1653449993.0,
                            "response": "Hey man, if You're looking to buy you should be buying it now.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9w4j8g",
                            "author": "Corbimos",
                            "score": 1,
                            "created_utc": 1653448979.0,
                            "response": "[it's done](https://c.tenor.com/pbucMdEU8IkAAAAM/finished-elijah-wood.gif)",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9rxvwe",
                    "author": "psyquel",
                    "score": 10,
                    "created_utc": 1653370822.0,
                    "response": "I have sailed stormy seas on my long boat to raid and pillage, I have visited tibet and spoke with Steven Seagall, I have had fly agaric soup and sandwitch only to  realize that there is only the one, only the Bitcoin and only the rest - bunch of worthless shitcoins",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9vqixk",
                            "author": "bsham84",
                            "score": 1,
                            "created_utc": 1653442258.0,
                            "response": "Looks like that you've already done a lot of things in your life. \n\nIt's time to take a break now.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9serky",
                    "author": "88eth",
                    "score": 11,
                    "created_utc": 1653385627.0,
                    "response": "What happened to all these people who had their savings in USD since USD launched? Because USD lost 97% in value since its inception.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9t03e5",
                            "author": "HyprbolicTimeChamber",
                            "score": 8,
                            "created_utc": 1653399360.0,
                            "response": "They’re dead. And their children are poor.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9vo89k",
                            "author": "lorddiablo86",
                            "score": 2,
                            "created_utc": 1653441164.0,
                            "response": "And that's why folks we need btc. That's the real use case of btc.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9t5fbi",
                    "author": "DrizzyDoe",
                    "score": 3,
                    "created_utc": 1653401843.0,
                    "response": "Imagine you're in your early 20s, just landed your first job out of college, and are lucky enough to live with mom & pops.\n\nDo you shovel every extra dime into bitcoin while it goes sideways, or do you save for a down payment on a house? Or do your best to do both?\n\nI'm somewhat happy with my stack, and I really want to move out of my parent's house FWIW.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9t6n1a",
                            "author": "bobbytabl3s",
                            "score": 8,
                            "created_utc": 1653402370.0,
                            "response": "Owning a house is overrated IMO, especially with current housing market. I would just rent or keep living with mom&pops and invest 50/50 Bitcoin and stocks.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9tcs9w",
                                    "author": "DrizzyDoe",
                                    "score": 1,
                                    "created_utc": 1653405001.0,
                                    "response": "I know looking back in 5 years that will be the better decision but shit, I want to take a girl home to my own place. It's a silly thing, I know. I could see a housing market \"crash\" within 2 years, presenting a decent time to buy. Obviously nobody knows but I'm just trying to roughly map out the next few years.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9tl66q",
                                            "author": "NiceDoctorBeam",
                                            "score": 2,
                                            "created_utc": 1653408484.0,
                                            "response": "You're letting other people make you feel insecure about renting.  Don't do that.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i9tldo8",
                                            "author": "SatoshiBlockamoto",
                                            "score": 2,
                                            "created_utc": 1653408571.0,
                                            "response": "Get some buds to be roommates for a few years and keep stacking sats.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9ttmcx",
                                                    "author": "WoodenAd9208",
                                                    "score": 1,
                                                    "created_utc": 1653411921.0,
                                                    "response": "The more roommates you have, the cheaper it gets. For the last three years or so, I've been splitting a house with 7 other people. I'm able to put nearly all of my checks from work into crypto. Rent ends up costing me $4800 for a whole year, or about $400 a month.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9tliga",
                            "author": "NiceDoctorBeam",
                            "score": 5,
                            "created_utc": 1653408626.0,
                            "response": "About ten years ago, I put my down payment money into Bitcoin instead of real estate. It's up about 1000X. Bitcoin's price continues to grow at a very rapid rate, long term average. You see, there were good reasons for Bitcoin's rapid rise. Most of those reasons still exist. In fact, today there are even more good reasons than there were 10 or 5 years ago. It is reasonable to expect the long term average growth rate of Bitcoin to stay very high for the foreseeable future.\n\nReal estate has significant holding costs (eg: taxes, maintenance, insurance, sometimes fees, interest). Real estate isn't very liquid, and it has extremely high transaction costs.\n\nUltimately, the price of real estate (and rents) is limited by incomes. For example, in the long run people can't pay more for mort./rent than they earn. Realistically, they might be able to afford (at most) 35 or 40 percent of their net income for \"a place to live\". Thus, real estate prices are limited by incomes in the long run. Incomes tend to barely keep up with inflation.\n\nLooking at long term historical data, such as Case-Shiller, for popular real estate markets, we see, in fact, that real estate prices barely track the rate of inflation, especially when the significant holding costs are properly accounted for.\n\nBitcoin has no such limit. Bitcoin has no holding costs. Bitcoin is liquid. Bitcoin transactions are typically very little. Bitcoin's price has been more than doubling every year, long term average, and as mentioned before, can reasonably be expected to continues its rapid ascent.\n\nReal estate is currently in a bubble, as evidenced by the price-to-income ratios. The current bubble will pop, as the prior bubble eventually had to pop.\n\nReal estate is nailed down. Bitcoin can be taken with you to anywhere in the world. Real estate is a sitting duck for higher taxes. Real estate can be confiscated.\n\nWhen the private keys are properly stored, Bitcoin cannot be confiscated.\n\nKnowing all this, a person would be a total idiot to purchase real estate instead of investing in Bitcoin.\n\nHaving said that, I do plan on eventually using a small fraction (about 10 or 15 percent) of my Bitcoin holdings to buy my dream home - and to pay for it with Bitcoin, but still end up sitting on a serious stack of sats.\n\nI have zero regrets for investing in Bitcoin instead of real estate, and I never will.\n206",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9tssuh",
                                    "author": "DrizzyDoe",
                                    "score": 1,
                                    "created_utc": 1653411590.0,
                                    "response": "Wow, thank you so much for your reply. I completely agree with all the benefits bitcoin has over real estate and the holding costs can get ridiculous. I guess I'll continue to be the ugly duckling of those around me. Bitcoin's addressable market is much much larger than it's current valuation, it's just hard being the outlier.  My original comment was coming from a place where my family & friends are still in the boat of owning a house is what you do if you can make it happen, especially with mortgage rates being comparable to rent.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9u6tvh",
                                            "author": "NiceDoctorBeam",
                                            "score": 2,
                                            "created_utc": 1653417400.0,
                                            "response": "Do you want to be like everybody else?  Or do you want to become a multimillionaire?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9u90t9",
                                                    "author": "DrizzyDoe",
                                                    "score": 1,
                                                    "created_utc": 1653418325.0,
                                                    "response": "I simply want to use a money my government can't debase at will, eternal riches & big booty bitches will be a nice caveat. It's just wild how many people accept our government debasing our currency as normal. I'm the weird one for not wanting my money to lose value over time? Some days being different is harder than others, even with the utmost conviction in my stance.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9ukuk4",
                                                            "author": "NiceDoctorBeam",
                                                            "score": 1,
                                                            "created_utc": 1653423303.0,
                                                            "response": "Consider this: Buy Bitcoin, then hold, long term.  Perhaps DCA and/or buy the dips along the way.  About 10 to 15 years from now, you use a small fraction of your Bitcoin to buy a nice home - a really, really nice home - and still have a nice stack of Bitcoin.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9un0rl",
                                                                    "author": "DrizzyDoe",
                                                                    "score": 1,
                                                                    "created_utc": 1653424216.0,
                                                                    "response": "So just hope I can continue to afford rent over the next 15 years?",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9uodhn",
                                                                            "author": "NiceDoctorBeam",
                                                                            "score": 1,
                                                                            "created_utc": 1653424787.0,
                                                                            "response": "Ultimately, rents and home prices are limited by incomes.\n\nInstead of just hope, always be learning new skills to keep yourself employable.  When you have in-demand skills, you get paid more than grunt-workers do.  If you haven't yet, also learn to be very frugal - it's actually kind of fun when you get good at it and you see others blowing their hard-earned money without much thought.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9u1avx",
                    "author": "BisratDB",
                    "score": 3,
                    "created_utc": 1653415085.0,
                    "response": "Barely hanging onto the 29k and you know what? I feel good.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9u2hul",
                            "author": "onlyforthiscreated",
                            "score": 2,
                            "created_utc": 1653415577.0,
                            "response": "Booring 🦀",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9w95g0",
                    "author": "thefullmcnulty",
                    "score": 3,
                    "created_utc": 1653451439.0,
                    "response": "Bitcoin is a brilliant miracle. \n\nI will always trade my cuck bucks for sats. It’s the most obvious trade I’ve ever seen.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9rvswo",
                    "author": "DrKhuntoshi",
                    "score": 10,
                    "created_utc": 1653369290.0,
                    "response": "I LOVE BITCOIN! Stack while you can brothers, see you at The Bitcoin Bar in Hungary this summer.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ukyw3",
                            "author": "Johnny_jai",
                            "score": 5,
                            "created_utc": 1653423354.0,
                            "response": "See you guys at the bar, let's see how things turn out to be man.\n\nWe'll have to wait and see how this thing goes I guess. I hope that everything goes according to the plan tho. That'll be a really good thing man.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9uyet8",
                                    "author": "DrKhuntoshi",
                                    "score": 1,
                                    "created_utc": 1653429132.0,
                                    "response": "Options expire this Friday, been range bound for a few weeks now some big players playing this game to squeeze the small ones out and can’t forget about July 7th, the spot BTC ETF. Might get rejected again but I have hope. \n\nI’m still bullish on the future and I have no doubts that we will be laughing about this situation later on.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9rxyom",
                            "author": "psyquel",
                            "score": 10,
                            "created_utc": 1653370876.0,
                            "response": "Thats where everyone drinks water and hodls till they get kicked out",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9ry3ya",
                                    "author": "DrKhuntoshi",
                                    "score": 3,
                                    "created_utc": 1653370986.0,
                                    "response": "Not on my watch, haha. I’ll do a few rounds if you’re there 🤝",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9ttflw",
                                            "author": "StarmanXbX",
                                            "score": 5,
                                            "created_utc": 1653411845.0,
                                            "response": "Well that sounds like a deal to me, I'd like that if you did that man. I'd like that man.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9w82eo",
                                                    "author": "alexis013077",
                                                    "score": 1,
                                                    "created_utc": 1653450836.0,
                                                    "response": "If the deal goes right, we can go for it, looks good to me",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9ry6u7",
                                    "author": "Asum_chum",
                                    "score": 5,
                                    "created_utc": 1653371046.0,
                                    "response": "Thing is to get kicked out has to be a consensus decision so no individual can decide.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9rydf7",
                                            "author": "psyquel",
                                            "score": 2,
                                            "created_utc": 1653371186.0,
                                            "response": "Chumlee??",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9s3sa7",
                                                    "author": "LuKeNuKuM",
                                                    "score": 1,
                                                    "created_utc": 1653375547.0,
                                                    "response": "Chun-Li might kick you out",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9samln",
                                                            "author": "52134682",
                                                            "score": 1,
                                                            "created_utc": 1653381767.0,
                                                            "response": "I'd support that.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9u3yct",
                                                                    "author": "costerpat",
                                                                    "score": 2,
                                                                    "created_utc": 1653416195.0,
                                                                    "response": "I mean that would be something that I'd like so yeah, I think I'm going to support that too. I'm gonna support that man. That's a really cool thing that how things are turning out to be. Let's see how things go forward from here man.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "i9v5iok",
                                                            "author": "vncentvga",
                                                            "score": 1,
                                                            "created_utc": 1653432301.0,
                                                            "response": "And why is he going to do that? I just don't any reason for them to do that. I don't see any reason behind this thing man.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i9u50kx",
                                                    "author": "btcxxoo",
                                                    "score": 1,
                                                    "created_utc": 1653416635.0,
                                                    "response": "That's basically how he sounds here, he does sound like a chumlee to me here man.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9vyz6o",
                                            "author": "McDuckMoneyBags",
                                            "score": 1,
                                            "created_utc": 1653446231.0,
                                            "response": "I mean individual can decide it, we just don't know how many things that they can decide tho.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9sx3eg",
                                    "author": "mdiederiks",
                                    "score": 1,
                                    "created_utc": 1653397879.0,
                                    "response": "Everyone should be holding while they can, because selling it not gonna solve anything here. That's not the Solution to anything in my opinion.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9va9ju",
                                            "author": "cavk11",
                                            "score": 1,
                                            "created_utc": 1653434521.0,
                                            "response": "Selling in loss is not a good option for now, let's see how it goes",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9rx766",
                            "author": "Whatever3999086543",
                            "score": 4,
                            "created_utc": 1653370308.0,
                            "response": "Nice 1st post of the day.  👍",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9sawhy",
                    "author": "bobbytabl3s",
                    "score": 6,
                    "created_utc": 1653382035.0,
                    "response": "They see me HODLin' they hatin'",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9v67xe",
                            "author": "smaraux",
                            "score": 2,
                            "created_utc": 1653432631.0,
                            "response": "Doesn't matter what they do all you gotta do is to hodl man.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9szrf6",
                            "author": "admiralCeres",
                            "score": 1,
                            "created_utc": 1653399199.0,
                            "response": "☝️ this",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9t7lsh",
                    "author": "Jdjdjdbdjdkdkdbjddjb",
                    "score": 2,
                    "created_utc": 1653402789.0,
                    "response": "Snapchat bubble goes pop dip",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9tijh2",
                    "author": "ryanq99",
                    "score": 2,
                    "created_utc": 1653407408.0,
                    "response": "Commence inverse bart",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9u508u",
                    "author": "OpticallyMosache",
                    "score": 2,
                    "created_utc": 1653416631.0,
                    "response": "I've become a victim to the popular narrative that we're going much lower. I'm now holding back my aggressive buys in anticipation of a cheaper price. A week ago I was telling myself that I'm buying despite all the influencers saying sub $20k soon. Now I'm slowing my buys. I should ignore all the influencers. I don't like this sense of indecision and questioning BTC's long term price trajectory. When BTC was above $60k, I would have killed for $29k.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9u9ugw",
                            "author": "c_games_official",
                            "score": 7,
                            "created_utc": 1653418672.0,
                            "response": "You can break it down logically:\n\nIf you are questioning BTCs long term price trajectory (i.e. don't believe it will ever reach above the last ATH of $69k), then don't bother buying. Save your fiat for something you believe in.\n\nIf you don't question BTCs long term price trajectory and you do believe it will someday go beyond $69k then you have three options:\n\n1) Aggressively buy now. Worst case scenario is that we dip to 20k or lower before launching to the moon and you missed out on some extra gains\n\n2) Wait to see if it dips to $20k before buying. Worst case scenario is that it only goes up from here and the rocket departs without you.\n\n3) DCA every week. Worst case scenario is that it only goes up from here and your average buying price is much higher.\n\nNow lets consider the best and worst case scenarios when it hits 69k:\n\nOption 1) In the worst case you still more than doubled your money. Best case scenario is that you ONLY doubled your money.\n\nOption 2) Worst case is that you made zero money. Best case scenario is that you more than tripled your money.\n\nOption 3) Worst case is that you made decent returns on your money. Best case is that you took advantage of the dip but also lost potential money on the way up so you cancelled out the benefit of the dip.\n\nIn my opinion the logical choice is Option 1 since the worst case is that you still doubled your money.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9uh9up",
                                    "author": "OpticallyMosache",
                                    "score": 1,
                                    "created_utc": 1653421797.0,
                                    "response": "I like the logical outline. It's a simple framework for viewing the capital flow and ROI. I believe 100% BTC will reach a new all time high. I think I'll transition to a strict DCA. I need to fight the option 1 of aggressively buying now since my outcome analysis is that the ATH will likely be delayed until 2024.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9ukein",
                                    "author": "cody_comaboy",
                                    "score": 1,
                                    "created_utc": 1653423112.0,
                                    "response": "> you missed out on some extra gains\n\nyou say it like it's not at all relevant...",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9u6bdc",
                            "author": "Blex98",
                            "score": 3,
                            "created_utc": 1653417186.0,
                            "response": "Toss a coin, it has the same probability of being right about the future, just as any influencer, analyst, or anyone in the world. But ♾/21 Million does seem to suggest that in the long run Bitcoin will grow in terms of Fiat.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9uhyj4",
                                    "author": "OpticallyMosache",
                                    "score": 3,
                                    "created_utc": 1653422084.0,
                                    "response": "Haha I need to remain mature and ignore influencers and articles posted about BTC. I just have such strong conviction in BTC that I want to buy as much as I can but I would get a lot more for my buck at $12k.\n\nI think the world is greatly undervaluing BTC. And you know how they say future events are priced into the market? I don't think they are for BTC. The world thinks its a do nothing digital transaction on a decentralized database. Like a get lucky token.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9um7t2",
                            "author": "HurricaneHarvey7",
                            "score": 3,
                            "created_utc": 1653423879.0,
                            "response": "Take everything you can invest, put 50% in now, DCA the other 50% over the next few months.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9u6jho",
                            "author": "stockymonkey",
                            "score": 2,
                            "created_utc": 1653417280.0,
                            "response": "I would spend more time thinking about the concept that what you are doing is saving your excess earnings in the form of a hard asset that long term will not depreciate. Right now we are in the period of adoption, so it will be volatile as hell. But assuming widespread adoption happens, the \"true price\" of Bitcoin is massively higher than it is now. If it hits $1M, the last thing you will give a crap about is whether you bought it at $20k or $29k. You are moving your purchasing power into the future... or it all goes to shit and you don't have anything left",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9ujexe",
                    "author": "OpticallyMosache",
                    "score": 2,
                    "created_utc": 1653422692.0,
                    "response": "Was anyone around during the blocksize wars? I heard there was a really good argument for why increasing block size does not solve the long term problem with transaction processing speed and that smaller blocks are critical for node operators to maintain the full blockchain. Haven't the normal complaints about BTC been addressed and the reasons for not being faster defended?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ulzam",
                            "author": "NiceDoctorBeam",
                            "score": 7,
                            "created_utc": 1653423781.0,
                            "response": "Simple arithmetic.  If 7 to 10 transactions per second aren't enough, 14 to 20 won't be enough.  Thousands of transactions per second would cause the size of the blockchain to grow rapidly, and it would soon require several 4 TB hard drives to run a node.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9umq0s",
                                    "author": "OpticallyMosache",
                                    "score": 5,
                                    "created_utc": 1653424091.0,
                                    "response": "Such a valid point. You never hear the really long term arguments. BTC will be BTC 100 years from now. The text exchanges we're having now will be like the etching in stone tablets. Talking about an alien global asset/currency that will transact in whatever application/hardware of the future. We are so early when you think about it like that. This communication format will be so outdated.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9w0cou",
                                            "author": "dr3155",
                                            "score": 1,
                                            "created_utc": 1653446895.0,
                                            "response": "This definitely sounds like future to me man, it's the future here.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9umu4f",
                                    "author": "Western_Boris",
                                    "score": 5,
                                    "created_utc": 1653424139.0,
                                    "response": "When the rules get changed one time, it comes easier to change them later too.\n\nAnd when running a node comes more expensive, less people will maintain nodes which will lead to less decentralization, which will lead to less security.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9w983i",
                                            "author": "bitcoin_cr",
                                            "score": 1,
                                            "created_utc": 1653451480.0,
                                            "response": "I don't think you should be changing the rules around the btc protocol.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9vd3vg",
                            "author": "generateduser29128",
                            "score": 6,
                            "created_utc": 1653435854.0,
                            "response": "Scaling to worldwide adoption on a decentralized layer 1 fundamentally does not work. You'd end up with multi-Gbit traffic and storage requirements that would require large datacenters to run nodes. At that point you might as well use PayPal.\n\nThe primary problem is storing the history of all transactions, so the obvious solution is to... store less history.\n\nThis can be done via a layer 2 to handle small transactions that occasionally settle in aggregate on layer 1. The lightning network is a decentralized way to do just that.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9w1sz2",
                                    "author": "davidcie",
                                    "score": 5,
                                    "created_utc": 1653447607.0,
                                    "response": "Then again conversation comes back to network becoming centralised again.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9w22v3",
                                            "author": "Alfador8",
                                            "score": 1,
                                            "created_utc": 1653447740.0,
                                            "response": "Care to elaborate?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9w2wh4",
                                                    "author": "Adamsd5",
                                                    "score": 2,
                                                    "created_utc": 1653448154.0,
                                                    "response": "I think the argument is that if everyone is storing less data, only a few centralized nodes store all of the data.  I don't believe it, but that is the argument I have heard.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9wb5oc",
                                                            "author": "Alfador8",
                                                            "score": 1,
                                                            "created_utc": 1653452580.0,
                                                            "response": "That's... Not how any of this works...",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9utv9b",
                            "author": "TheGreatMuffin",
                            "score": 2,
                            "created_utc": 1653427146.0,
                            "response": "> I heard there was a really good argument for why increasing block size does not solve the long term problem with transaction processing speed and that smaller blocks are critical for node operators to maintain the full blockchain.  \n\nhttps://gist.github.com/chris-belcher/a8155df5051bb3e3aa96",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9v1lmq",
                            "author": "bobbytabl3s",
                            "score": 2,
                            "created_utc": 1653430531.0,
                            "response": "It's a tradeoff between decentralization and transaction cost. There is no right or wrong answer to this question. In the absence of a rigorous mathematical answer, status quo wins.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9w3bko",
                    "author": "Jdjdjdbdjdkdkdbjddjb",
                    "score": 2,
                    "created_utc": 1653448365.0,
                    "response": "29k, 31k, 29k, 31k, 29k... 31k?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9vdx6i",
                    "author": "Mean-Improvement-146",
                    "score": 4,
                    "created_utc": 1653436240.0,
                    "response": "If everyone takes there BTC off of exchanges and stores it on cold wallets would the BTC price go up",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9vf1nt",
                            "author": "sciencetaco",
                            "score": 6,
                            "created_utc": 1653436777.0,
                            "response": "If you're just using the exchange to hold then it wouldn't affect the price. But if people take it off exchanges and stop selling it, then the supply dries up then the price would increase.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9w1moo",
                                    "author": "ProfessionalWelcome",
                                    "score": 3,
                                    "created_utc": 1653447519.0,
                                    "response": "I think it would still affect the price. Some of your Bitcoin on an exchange gets loaned and leveraged.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9wh9fg",
                                    "author": "sfewgw",
                                    "score": 2,
                                    "created_utc": 1653456467.0,
                                    "response": "Yeah, need all the people to do the same. One person isn't enough.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9veifz",
                            "author": "HipOut",
                            "score": 2,
                            "created_utc": 1653436522.0,
                            "response": "Yes",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9taf1l",
                    "author": "Starkey18",
                    "score": 3,
                    "created_utc": 1653404000.0,
                    "response": "9 consecutive red weeks.\n\nThis must be a record?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9v7528",
                            "author": "KristianLani",
                            "score": 4,
                            "created_utc": 1653433059.0,
                            "response": "Yeah and this is going for another 10 week red, let's see it's future",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9tnwao",
                            "author": "InFLIRTation",
                            "score": 2,
                            "created_utc": 1653409597.0,
                            "response": "8 was a record already lol",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9vk54b",
                                    "author": "divmonq",
                                    "score": 1,
                                    "created_utc": 1653439230.0,
                                    "response": "That's a record and it was broken, this will also break here",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9t5gr6",
                    "author": "AwaySupermarket3289",
                    "score": 3,
                    "created_utc": 1653401861.0,
                    "response": "Been spending some time in the butters sub and making comments here and there (with the obvious down-votes) and it just amazes me the hatred/ill-will they have towards bitcoiners. I’m open to hearing the opposite position as mine, minus the hatred.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9t8z0b",
                            "author": "spid3rfly",
                            "score": 10,
                            "created_utc": 1653403380.0,
                            "response": "That's part of what is wrong with society in general(at least in America). People have lost the ability to listen to different viewpoints that might add to or change their minds on any subject.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9tp6zb",
                                    "author": "DrAgaricus",
                                    "score": 6,
                                    "created_utc": 1653410119.0,
                                    "response": "People literally get aggressive/hateful towards different viewpoints, while waving the flag of tolerance and inclusivity up high.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9tl95c",
                            "author": "SatoshiBlockamoto",
                            "score": 2,
                            "created_utc": 1653408518.0,
                            "response": "Same thing happens on any mainstream press article.  check out the comments on yesterday's NYTimes story on the btc market dip.  People really don't know what's coming.  We're still so early.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9rzltf",
                    "author": "rartedw",
                    "score": 2,
                    "created_utc": 1653372132.0,
                    "response": "what would credit be like if bitcoin was the only currency?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9s8vjz",
                            "author": "tesseramous",
                            "score": 6,
                            "created_utc": 1653380119.0,
                            "response": "Loans would not cause the creation of new money. It would just cause the redistribution of existing money. Unless people started writing notes like \"I owe you 1 bitcoin\" and using the notes as transferrable currency...",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9vxcmi",
                                    "author": "vitallka",
                                    "score": 1,
                                    "created_utc": 1653445464.0,
                                    "response": "So that basically means that loans would cause btc to go up in price huh?\n\nThat's interesting.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9s4lkj",
                            "author": "LiteratureUsual614",
                            "score": 10,
                            "created_utc": 1653376245.0,
                            "response": "There would be much less credit. Investors would be very involved in the projects they are financing and people would have to save before spending.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9s5wvt",
                                    "author": "rartedw",
                                    "score": -2,
                                    "created_utc": 1653377408.0,
                                    "response": "so there would basically be no future for us? There would be no innovation and society would just stay the same all the time",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9s6gzx",
                                            "author": "LiteratureUsual614",
                                            "score": 12,
                                            "created_utc": 1653377914.0,
                                            "response": "Who is us? You give credit too much credit (wink wink). If you want to innovate, you just have to convince investors that your idea is worth it.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9urlv9",
                                                    "author": "DjAlex8811",
                                                    "score": 3,
                                                    "created_utc": 1653426163.0,
                                                    "response": "I mean I'm sure We'll figure it out if we had that system, We'll be able to figure it out.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i9s758f",
                                                    "author": "GeneralChaos309",
                                                    "score": -2,
                                                    "created_utc": 1653378524.0,
                                                    "response": "I think this is a valid criticism of bitcoin, but no bitcoiner has given me a realistic explanation on why this doesn't raise alarm bells.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9sa2tm",
                                                            "author": "magneticman245",
                                                            "score": 18,
                                                            "created_utc": 1653381252.0,
                                                            "response": "Right now, because of inflation, you're encouraged to make investments with positive nominal returns but negative real returns (if inflation is 7% and you make an investment that returns 4%, you're better off than holding cash). This means our monetary system actively encourages investment in projects that have a net negative return, by definition consuming more than they produce. \n\nUnder a Bitcoin standard, you wouldn't invest in anything with negative real returns because your money holds its value. Any negative real return would also have a negative nominal return and investors would quickly abandon such a project unless it had real potential. Just imagine how much more productive an economy would be (and how much less it would waste) if the only businesses that were invested in were ones that were actually productive.",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "i9s913s",
                                                            "author": "thefullmcnulty",
                                                            "score": 13,
                                                            "created_utc": 1653380263.0,
                                                            "response": "Commenter said explicitly they think capital accumulation (saving) would need to happen before investment and that it would create more calculated investment outcomes. \n\nBitcoin as reserve currency would promote saving, rational consumption and intelligent investment. I think it would be positive for economies to exist within the confines of reality and the finite world we all exist on would benefit immensely.",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "i9s8j79",
                                                            "author": "onlyforthiscreated",
                                                            "score": 4,
                                                            "created_utc": 1653379794.0,
                                                            "response": "You can loan bitcoin if need more. Inflation doesnt eat your savings and savings worth rise overtime. People still buy what they really need and overconsume going lower.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9smlab",
                                            "author": "guryfitze",
                                            "score": 7,
                                            "created_utc": 1653391760.0,
                                            "response": "It would be similar to how credit worked back when we had the gold standard. And that did not hinder innovation and progress. The entire industrial revolution happened during the gold standard. Cars, telephone, electricity too.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9v7ss0",
                                                    "author": "dolfcao",
                                                    "score": 0,
                                                    "created_utc": 1653433361.0,
                                                    "response": "I mean that would mean that We'll go into the 1800 hundreds or what? Well That'll just look like a waste of time to me.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9uhyeg",
                                            "author": "DirectLTC",
                                            "score": 2,
                                            "created_utc": 1653422082.0,
                                            "response": "I mean yeah, the problem with btc is that it'll make people save more than they spend so yeah.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9u15m5",
                                    "author": "loolery",
                                    "score": 1,
                                    "created_utc": 1653415025.0,
                                    "response": "Yeah the credit would be very low if the btc was the only currency of the world. That would be really good tho. It's going to make many people's job really hard tho.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9tlhb7",
                            "author": "lrpedropires",
                            "score": 1,
                            "created_utc": 1653408614.0,
                            "response": "Really interesting thought process, this is really something to think about in my opinion man.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9t9jgv",
                            "author": "SpaceLaserPilot",
                            "score": -1,
                            "created_utc": 1653403625.0,
                            "response": "There are arithmetically not enough Satoshis available to Bitcoin to function as the only currency.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9t5fim",
                    "author": "ryanq99",
                    "score": 2,
                    "created_utc": 1653401846.0,
                    "response": "Wen capitulate",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9tppgf",
                    "author": "Ok-Imagination-7014",
                    "score": 2,
                    "created_utc": 1653410325.0,
                    "response": "So how do you think people in the US will retire in 20+ years? US ss will be drained by 2034. That clearly puts eyes on btc. If btc fails, we are all fucked.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9uf00q",
                            "author": "Think_Operation310",
                            "score": 3,
                            "created_utc": 1653420844.0,
                            "response": "No we're not, the next Bitcoin is Bitcoin.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9ui1nl",
                                    "author": "Ok-Imagination-7014",
                                    "score": 1,
                                    "created_utc": 1653422120.0,
                                    "response": "What do you mean?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9uajju",
                            "author": "c_games_official",
                            "score": 2,
                            "created_utc": 1653418964.0,
                            "response": "A person making 50k (which is more than average) will earn <$1400 per month if they retire today at 62, while a 67 year old person retiring today would earn <$2000. \n\nIt's arguable that without any additional income streams, people in the US cannot retire even today.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9tqplr",
                            "author": "GoElastic",
                            "score": 1,
                            "created_utc": 1653410733.0,
                            "response": "IMHO the only reason BTC can fail is, if AI takes over. When robots can do everything, then there is no labor market. In fact, there would be no need for any market, since all you want can be produced eventually. Hence, no need for any money.\n\nIs this a realistic scenario? Who knows...but I doubt I wanna live in this utopia.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9tsyad",
                                    "author": "johnwick3",
                                    "score": 1,
                                    "created_utc": 1653411650.0,
                                    "response": "That's an interesting scenario for a few reasons.  Who takes responsibility for the robots and to what benefit, if humans are not working?\n\nThe robots are self governing? \n\nLots of interesting questions on this topic from my perspective.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9tvdqy",
                                            "author": "GoElastic",
                                            "score": 1,
                                            "created_utc": 1653412646.0,
                                            "response": "I assume it would be \"controlled\" self governing, since we deal with AI.\n\nI thought about how it would be like, if everyone would get a Lambo if he wants one. Is this desire really about the Lambo itself, or is it about having one while others don't? Is it all about social interaction and not about the Lambo? \n\nImagine a world with only you and your Lambo...I would probably have 5 seconds of fun with my Lambo, if I cannot share this experience with another human being.\n\nTL;DR: weed is good these days",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9tygfq",
                                    "author": "Western_Boris",
                                    "score": 1,
                                    "created_utc": 1653413914.0,
                                    "response": "AI would love Bitcoin. Actually AI would propably become part of an asset like Bitcoin. Because Bitcoin is a network which people voluntarily want to buy energy to keep it online, secure and working 24/7.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9uhwcf",
                                            "author": "Think_Operation310",
                                            "score": 1,
                                            "created_utc": 1653422058.0,
                                            "response": "Energy without an inflational leak. The AI is a different story when we won't over consume in a Bitcoin world.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9tqwoa",
                            "author": "WinAny9651",
                            "score": 1,
                            "created_utc": 1653410814.0,
                            "response": "Retirement is not guaranteed by an accounting method. A good retirement depends on the ratio of young to old. If there are not enough young people to cater to the needs of the old generation, while also taking care of their own well-being, majority of the people will not get a good retirement.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9vtlh3",
                    "author": "CANUHODL",
                    "score": 2,
                    "created_utc": 1653443696.0,
                    "response": "HODL",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9t3z1i",
                    "author": "InFLIRTation",
                    "score": 1,
                    "created_utc": 1653401184.0,
                    "response": "Really lost respect for george on youtube. Keeps denying we in a bear market lol. I believe barmarket will end when stock market bear ends.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9t686u",
                            "author": "coffee_for_dinner",
                            "score": 2,
                            "created_utc": 1653402191.0,
                            "response": "I like him well enough for what he is, the ultimate hopium dealer. 😅 It's nothing to base your investments on.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9t7rfg",
                                    "author": "InFLIRTation",
                                    "score": 1,
                                    "created_utc": 1653402857.0,
                                    "response": "Lmao, i suppose so",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9tayvp",
                            "author": "superbblunder",
                            "score": 2,
                            "created_utc": 1653404234.0,
                            "response": "He's a DCA preacher and tries to keep noobs from selling or using leverage. I'm fine with it. Definitely don't watch him for market analysis.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9ulkb1",
                                    "author": "ankurok",
                                    "score": 5,
                                    "created_utc": 1653423606.0,
                                    "response": "For market analysis we should do our own research that's better than dependence",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9to5f4",
                                    "author": "InFLIRTation",
                                    "score": 2,
                                    "created_utc": 1653409698.0,
                                    "response": "He keeps shilling a particular alt that went to 0 as well lol",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9tpl09",
                                            "author": "superbblunder",
                                            "score": 2,
                                            "created_utc": 1653410275.0,
                                            "response": "True, was pretty hilarious when it crashed and he said he was DCA'ing more.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9tw58i",
                                                    "author": "InFLIRTation",
                                                    "score": 2,
                                                    "created_utc": 1653412960.0,
                                                    "response": "I was think wtf was he thinking lmao. Took him a day to realize it could go lower",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9tjq4z",
                    "author": "StonedOnEdibles",
                    "score": 1,
                    "created_utc": 1653407894.0,
                    "response": "I keep hearing about equities falling , and how “Crypto has never been through an equities bear market, and it will be ugly”\n\nFUD, or a likely scenario ?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9tmrje",
                            "author": "MMinjin",
                            "score": 1,
                            "created_utc": 1653409140.0,
                            "response": "It is true that crypto has pretty much only seen a cheap money, risk on environment. We don't know what will happen. Could be bad. All of the stock investors of the past decade thought that \"stonks only go up\". Nobody knows what will happen.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9tzgv3",
                                    "author": "Western_Boris",
                                    "score": 1,
                                    "created_utc": 1653414330.0,
                                    "response": "One thing we know. If the Bitcoin adoption keeps going forward like it is going at the moment, we know what it will cause for the price. Short term, meaning this year, maybe some following years if/when we will see time of recession because of crazy inflation and interests going up, it might be bad for Bitcoin same as it will bad for every kind of investments, but in the long run the price is going through the roof because the supply is simply hard capped and the demand keeps growing.\n\nSo as always, no one knows what happens SHORT TERM, while long term more and more people learns to appreciate hard money.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9sb1c6",
                    "author": "Less-Yogurtcloset876",
                    "score": -2,
                    "created_utc": 1653382159.0,
                    "response": "Dddddddrop the price",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9t6ykt",
                            "author": "rapcoin",
                            "score": 1,
                            "created_utc": 1653402510.0,
                            "response": "Btc is already doing that, how much lower do you really want that?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9t7ctp",
                                    "author": "Less-Yogurtcloset876",
                                    "score": 1,
                                    "created_utc": 1653402679.0,
                                    "response": "Doesnt matter what i want, just a matter of time until its in twenties",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9t8sqf",
                    "author": "admiralCeres",
                    "score": -7,
                    "created_utc": 1653403306.0,
                    "response": "Bitcoin is dead money until the next halving. Sad.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9tb1qq",
                            "author": "GoElastic",
                            "score": 1,
                            "created_utc": 1653404267.0,
                            "response": "What worries me is not the current price. It is the lack of new demand. Hodlers keep holding, but you can tell by the non existing volume(since last November or so), that there are almost no newcomers into the space.\n\nThis  correlates well with google search trends. People have simply other things in mind rn than magic internet money. Until that changes, BTC price is just a playball of Wallstreet traders.\n\nOn the other hand, it is a great time to accumulate.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9tqa62",
                                    "author": "DiRienzo3410",
                                    "score": 2,
                                    "created_utc": 1653410561.0,
                                    "response": "Most people are more worried about paying their bills than bitcoin right now. Even though they should be stacking as much as possible",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9tj0v0",
                    "author": "bbrout",
                    "score": 1,
                    "created_utc": 1653407605.0,
                    "response": "Silly question: Is there a CME futures gap still around needing to be filled? Asking for a friend.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9tjmm7",
                            "author": "PrognosticalSon",
                            "score": 1,
                            "created_utc": 1653407854.0,
                            "response": "Spikes like that are shorts covering/liquidated.\n\nEdit: Usually followed by immediately opening another short.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9tocwz",
                                    "author": "bbrout",
                                    "score": 1,
                                    "created_utc": 1653409782.0,
                                    "response": "Talking about the overall trend. Is there a gap below this point somewhere? I had thought all the gaps were filled. I could be wrong though. It's happened before.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9tr072",
                                            "author": "NectarineDirect936",
                                            "score": 1,
                                            "created_utc": 1653410853.0,
                                            "response": "At 9k lol",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9tr8d3",
                                                    "author": "bbrout",
                                                    "score": 1,
                                                    "created_utc": 1653410946.0,
                                                    "response": "That's what I thought. I guess that's where we're going.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9tsor5",
                                            "author": "FamousPussyGrabber",
                                            "score": 1,
                                            "created_utc": 1653411544.0,
                                            "response": "I volunteer to fill the gap",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9tswe5",
                                                    "author": "bbrout",
                                                    "score": 1,
                                                    "created_utc": 1653411629.0,
                                                    "response": "Hold door!",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9uaoyi",
                    "author": "Outrageous-Net-7164",
                    "score": 1,
                    "created_utc": 1653419029.0,
                    "response": "At what point is Microstrategy a buy ?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ujvx6",
                            "author": "spid3rfly",
                            "score": 2,
                            "created_utc": 1653422892.0,
                            "response": "Considering it peaked at 1k at the beginning of 2021, I'd guess right now it's a bargain. \n\nI hold a little bit of it but it's as volatile as btc. It tends to move with btc so I'd DCA in if you're new to MSTR. I only hold it in a retirement account... it's a way for me to sell btc peaks without touching any of my actual btc and without having to pay taxes. \n\nI hold more GBTC than MSTR.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9uhvwi",
                            "author": "itsthesecans",
                            "score": 1,
                            "created_utc": 1653422054.0,
                            "response": "A long time ago in my book.  MSTR is priced like bitcoin is already trading below 20k.  When bitcoin recovers MSTR will recover faster IMO.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9w80q0",
                            "author": "viratuso",
                            "score": 1,
                            "created_utc": 1653450809.0,
                            "response": "They are always buying at high and after they buy a dip comes",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9wn1j9",
                            "author": "LuKeNuKuM",
                            "score": 1,
                            "created_utc": 1653460694.0,
                            "response": "I'd go direct and buy BTC instead. Then you'll own property rather than a security.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9uggnf",
                    "author": "BigDeezerrr",
                    "score": 1,
                    "created_utc": 1653421458.0,
                    "response": "Anyone here try using Strike to buy stuff at stores using Lightning Network after Mallet's Bitcoin Conference reveal? Just realized I never followed up on that.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9un1cm",
                            "author": "Western_Boris",
                            "score": 2,
                            "created_utc": 1653424223.0,
                            "response": "I think it was \"work in progress\", not fully launched yet. Someone please correct me if I'm wrong.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9wkxz8",
                                    "author": "voldemar11",
                                    "score": 1,
                                    "created_utc": 1653459080.0,
                                    "response": "Yep, that wasn't final. That was work on progressive.\n\nI hope they improve over it. Once they improve over it I'm sure people will follow up to use it.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9wf6w9",
                            "author": "pipi100981",
                            "score": 1,
                            "created_utc": 1653455091.0,
                            "response": "I don't think so man, people aren't ready for that just yet.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9v2uj8",
                    "author": "OpticallyMosache",
                    "score": 1,
                    "created_utc": 1653431084.0,
                    "response": "Somebody needs to find the answer and show us they have balls that $25k was the bottom. I want to know that $25-30k is max load zone. Where's the billionaire ready to drop $1B into BTC?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9v3jj7",
                            "author": "bobbytabl3s",
                            "score": 5,
                            "created_utc": 1653431399.0,
                            "response": "Just need to call the billionaire hotline.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9v8rs6",
                            "author": "resjohnny",
                            "score": 1,
                            "created_utc": 1653433815.0,
                            "response": "I dont think it is this cycle. We have a long bear market across the board to get through. Probably another year.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}