{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uq3ltx",
            "title": "Be Aware of Bear Whale..!!",
            "url": "https://v.redd.it/69ybj0skemz81",
            "author": "Reahvenz",
            "created_utc": 1652612060.0,
            "score": 115,
            "num_comments": 4,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8ol03f",
                    "author": "shyguy110",
                    "score": 6,
                    "created_utc": 1652612207.0,
                    "response": "HODL that $100 worth of btc till the end!",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uq48w1",
            "title": "WTF.. that spike..!!",
            "url": "https://i.redd.it/ztjn2a5emmz81.jpg",
            "author": "Reahvenz",
            "created_utc": 1652614690.0,
            "score": 17,
            "num_comments": 27,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8ooirw",
                    "author": "nkantzavelos",
                    "score": 7,
                    "created_utc": 1652614875.0,
                    "response": "Spike for ants?!?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8oom49",
                    "author": "p2501c",
                    "score": 21,
                    "created_utc": 1652614940.0,
                    "response": "Imagine how much BTC will fall once all those longs hit a margin call when it goes down…",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8oqktz",
                            "author": "niovyson",
                            "score": 11,
                            "created_utc": 1652616251.0,
                            "response": "Yeah could go the opposite direction and wreck the price. Maybe more discounts incoming…",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "uq2d9n",
            "title": "What happened in Block 736452?",
            "url": "https://i.redd.it/wuv4v6f8ylz81.jpg",
            "author": "Jakeomio",
            "created_utc": 1652606552.0,
            "score": 7,
            "num_comments": 14,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8oinet",
                    "author": "igadjeed",
                    "score": 17,
                    "created_utc": 1652610250.0,
                    "response": "One of the mining pools is too lazy to pre-populate their blocks with transactions. They start empty, and fill after about 50 seconds. If a block follows the previous block by less than about 54 seconds, and if the block is mined by that pool, it will be empty  \n\nhttps://blog.lopp.net/empty-bitcoin-blocks-full-mempool/",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8of53r",
                    "author": "Charming_Sheepherder",
                    "score": 8,
                    "created_utc": 1652607214.0,
                    "response": "It happens once in awhile.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8okxq6",
                    "author": "CarbonCG",
                    "score": 3,
                    "created_utc": 1652612152.0,
                    "response": "Miners can do this, its sorta a trick to speed up block processing. Back in the day some “malicious” mining pools would “only” mining empty blocks as btc fees were high and helped bog down network. \n\nI put them in quotes because it’s not that malicious in hindsight and btc don’t care. And the total empty blocks was like less than 3%",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uq3ip9",
            "title": "Buttcoiners too lazy to do anything.",
            "url": "https://i.redd.it/n1bbhawgdmz81.png",
            "author": "canoli91",
            "created_utc": 1652611676.0,
            "score": 229,
            "num_comments": 170,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8pbz2d",
                    "author": "tedthizzy",
                    "score": 58,
                    "created_utc": 1652627429.0,
                    "response": "Buttcoiners actually are making a valid point!\n\nMany people view Bitcoin as \"risky\" because they do not feel confident in handling the technology. This is an entrepreneurial call-to-action for those who can address this perceived risk without compromising on the objective risk of not holding your own keys. I believe there are some clever solutions people could come up with such as making multi sigs easier to do or more human support with bitcoin transfers for example",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8pt2cy",
                            "author": "video_dhara",
                            "score": 27,
                            "created_utc": 1652634916.0,
                            "response": "Hello rational person. It’s crazy how few people here open their eyes to the real problems that need practical solutions instead of leaping in a libertarian/chart-addict fantasy world.\n\nI had high if somewhat tempered hopes for all of this, but the progression of this sub, and the amount of people with their fingers in their ears up to the knuckles has really had me question things recently. Once NFTs came around I quickly jumped to the sidelines, and given the current price action, I’m sure glad I did.\n\nI’ve always been carefully to try to conceptually track enthusiasm with *actual* progress, and a lot of people here wouldn’t be holding bags if they did the same. \n\nI’ve been around here since 2016, and in the past few years have just been listening and monitoring the subs for the past few, but I’ve been more inclined to actually start calling people out on how ridiculous they are, against my better judgement. My current impression is that the prevalence of posters left here are people losing money and looking for any assurance they can get, reason and real analysis and reflection be damned. Pretty disappointing, and this post is a shining example of some head-in-the-dirt ostrich level shit.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8pc6qj",
                    "author": "PostalEFM",
                    "score": 60,
                    "created_utc": 1652627530.0,
                    "response": "They have a forum for idiots. You found that post there. \n\n&#x200B;\n\nLeave it there.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8pt9if",
                            "author": "satoshishash",
                            "score": 5,
                            "created_utc": 1652635003.0,
                            "response": "Valid point lol.. the buttcoiners even occasionally come over to our forum and troll. It’s almost always best to ignore them.\nDon’t feed trolls.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8prxij",
                            "author": "HappyBear_btc",
                            "score": 5,
                            "created_utc": 1652634419.0,
                            "response": "r/murderedbywords",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8om9vq",
                    "author": "tokyo_aces",
                    "score": 113,
                    "created_utc": 1652613207.0,
                    "response": "The user's misconception is a misunderstanding of the term \"bank\" as it is used in his definition -- an entity that stores your money **and loans out to others, invests that money into various assets, credits people, etc etc** \\- vs how it is used in the \"Be your own bank\" notion - an entity that stores your money.  PERIOD.\n\nI too would not trust myself or most others to be their own *commercial/investment banks*.\n\nI have no problem trusting myself to be my own store of liquid cash.  In the US, you can't do that so easily.  Your options:\n\n1. Hold everything in cash - good luck with e-payments, and get placed on lists when you use the cash for large purchases.\n2. Hold everything in checks - ditto the above, maybe slightly safer than cash to hold in your house\n\nBitcoin lets you participate in electronic banking without the damn bank itself, and the risks associated with cash.\n\nGo to a developing country where the banks aren't so trustworthy and that just sweetens the deal.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8p2ve4",
                            "author": "_Insulin_Junkie",
                            "score": 16,
                            "created_utc": 1652623195.0,
                            "response": "Bitcoin is for the people. The more I learn about it, the more global knowledge I seem to find. Not all countries (or banking systems) are created equal",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8ps8fy",
                            "author": "aed38",
                            "score": 3,
                            "created_utc": 1652634552.0,
                            "response": "Both of your definitions of what a bank does are misconceptions. There’s been a ZERO RESERVE REQUIREMENT since 2020. They literally don’t have to store any of your money! They just take your money and loan it out while you receive nothing in return. You bank balance is just an IOU from the bank.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8p6uv9",
                            "author": "SHA256dynasty",
                            "score": 8,
                            "created_utc": 1652625095.0,
                            "response": "I always thought it meant \"be your own **central** bank\" i.e. validate the genuine issuance of the currency supply and conduct *final settlement* without an intermediary.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8pgrdq",
                    "author": "cryptobog67",
                    "score": 6,
                    "created_utc": 1652629593.0,
                    "response": "Imagine hating on BTC since 2016 and not buying any hahahahahahaha.\nI comment there once in a while, they are all not that critical and smart (BUT there is a thread by a guy trying to counter all arguments speaking for BTC, he somtimes has a point which we have to think about). Same as some people here on our side. But Buttcoin is just DAMN.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8pt94k",
                            "author": "video_dhara",
                            "score": 3,
                            "created_utc": 1652634998.0,
                            "response": "At least your willing to listen to valid arguments. The failure to do so has really affected the quality of this sub.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8oknqc",
                    "author": "Cristek",
                    "score": 86,
                    "created_utc": 1652611919.0,
                    "response": "Buttcoiners are like Barcelona fans that dont go and see any Barcelona games...\n\nInstead, they go and see Real Madrid in hopes of seeing them loose...\n\nLeave them be... They'll have to use BTC sooner or later...",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8pqyoy",
                            "author": "irisuniverse",
                            "score": 5,
                            "created_utc": 1652634005.0,
                            "response": "At its core that’s its main flaw. A sub dedicated to being negative about something. If you have a community who’s sole purpose is to spend time trying to tear something down, it’s a waste of your time. Spend that time building something you do believe in instead.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8okufh",
                            "author": "morbo_2",
                            "score": 16,
                            "created_utc": 1652612074.0,
                            "response": "Hilarious analogy, and quite accurate as well!",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8ovqba",
                            "author": "JahMedicineManZamare",
                            "score": 8,
                            "created_utc": 1652619405.0,
                            "response": "This guy footballs",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8ol9zp",
                    "author": "dlq84",
                    "score": 44,
                    "created_utc": 1652612429.0,
                    "response": "I bet they have never cooked their own food ever, that's what they have the moms for, it's too hard to walk up the stairs from the basement.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8oqtnf",
                            "author": "txhex",
                            "score": 11,
                            "created_utc": 1652616404.0,
                            "response": "::angry buttcoiner noises intensifies::",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8p2bs8",
                            "author": "cfdeveloper",
                            "score": 3,
                            "created_utc": 1652622924.0,
                            "response": "I guarantee you they don't return their shopping carts to the cart corrals: \"they pay people to deal with the carts\"",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8orbu8",
                            "author": "Doge-SAE",
                            "score": 3,
                            "created_utc": 1652616731.0,
                            "response": "Probably one of those people you see with wrinkles.  Never fold or iron and I bet never make their bed either.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8okn73",
                    "author": "canoli91",
                    "score": 37,
                    "created_utc": 1652611906.0,
                    "response": "so clearly the vast majority of that sub has 0 ambition...I am a tradesman. I love to build my own stuff. If I could build my own home it would be a dream. \n\nI tend to gardens every year and want to raise livestock one day. I heat my home with Bitcoin and would like to heat a greenhouse one day to be fully self sustaining. I've been browsing that sub the last few days and holy crap they have to be the most miserable group to exist? At this point we all know Bitcoin at least isn't going anywhere. They are setting themselves up for huge humiliation in another 2-3 years.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8pdb12",
                            "author": "rankinrez",
                            "score": 5,
                            "created_utc": 1652628040.0,
                            "response": "I’m not sure I agree.\n\nYeah doing some stuff off your own back is great.  But some things are simply beyond the ability of a single person or very small group to do. You can take it too far.  Specialisation of  labour has created our modern world.\n\nhttps://www.investopedia.com/ask/answers/040615/what-are-economic-impacts-specialization.asp",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8ov5mf",
                            "author": "Scuttlefuzz",
                            "score": 10,
                            "created_utc": 1652619070.0,
                            "response": "Trust me, they won't be humiliated. They will continue to be in denial. No matter how high it goes and how much the space grows they always continue to stay on the sidelines. Bitcoin could become a global reserve currency and they'd still be in denial because to finally accept it would mean to accept the years of opportunity they squandered. That sub has turned into a human psychology experiment, I actually find it fascinating.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8p279l",
                                    "author": "CryptoBehemoth",
                                    "score": 5,
                                    "created_utc": 1652622861.0,
                                    "response": "That moment when you unconsciously realize that you're in too deep to admit you done fucked up. So instead, you go deeper and hope that realization never surfaces. Unfortunately for these people, *corpses float*.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8pk29r",
                            "author": "Riker1701E",
                            "score": 5,
                            "created_utc": 1652631032.0,
                            "response": "So not wanting to build your own home and grow your own food makes you lazy? I have 0 ambition to build my o2n house or car. I have no desire to grow my own food. I want to make more than enough money to be able to pay someone to do those things for me. That's literally why I went to graduate school and got a high paying job. It certainly isn't for the the job satisfaction, it is so they pay me 6 figures to buy what I want.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8orj7f",
                            "author": "Otowner98",
                            "score": 11,
                            "created_utc": 1652616867.0,
                            "response": "You nailed it!  I love learning new skills, and building my self-reliance.  I want out of the ‘systems’ sooner than later, and Bitcoin, land, and livestock are all part of that.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8ont8l",
                            "author": "NanoPlayz",
                            "score": 3,
                            "created_utc": 1652614370.0,
                            "response": "I think every human love to build/create its own things. Its natural for us, thats why be coming parent is such a Big thing. People who dont wanna create have no purpose in live.\nI can only dream about some land and time to build my own house...",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8pfudo",
                    "author": "Lonehunter19_",
                    "score": 3,
                    "created_utc": 1652629191.0,
                    "response": "Gotta love it when no coiners spout shit like this lmao",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ondt3",
                    "author": "Sufficient_Tooth_949",
                    "score": 11,
                    "created_utc": 1652614052.0,
                    "response": "That's a roundabout way of letting everyone know your a bootlicker and rely on being handfed by someone else rather than finding your own food\n\nIt's like theyre NPC's \"the banks know more than us, the banks can do no wrong\" yeah right",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8onufh",
                            "author": "canoli91",
                            "score": 4,
                            "created_utc": 1652614394.0,
                            "response": "lmao honestly the pure fear of living a life that you have to work for.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8oq5p2",
                    "author": "No-Effort-7730",
                    "score": 6,
                    "created_utc": 1652615980.0,
                    "response": "Imagine actually believing the people running banks currently are doing a good job.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8osx3i",
                    "author": "a_stonk_a_day",
                    "score": 3,
                    "created_utc": 1652617742.0,
                    "response": "That's it, i'm following that sub from now on. can't believe i was missing such quality entertainment shitposting!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8omjug",
                    "author": "lildenselayer",
                    "score": 5,
                    "created_utc": 1652613424.0,
                    "response": "Say it with me:\nBanks. Are. Economic. Parasites. \n\n“Outsourcing” is meant to help you - not steal from you…",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8orpdk",
                    "author": "PoopShootBlood",
                    "score": 3,
                    "created_utc": 1652616978.0,
                    "response": "I kind of agree with him. \nSelf custody is kind of a mother fucker. \nIf there was someone I could trust I would totally let them hold my coin for me.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8owf2p",
                    "author": "Geoknysis",
                    "score": 4,
                    "created_utc": 1652619791.0,
                    "response": "Just for your information:\n\nWhen you see a post like this with excessive amounts of self references like \"I\" and \"mine\" you're dealing with a narcissist. Just look at the absolute conclusions this person draws about all of humanity. \n\nA lot of champagne communists and accompanying extremists are narcissists; this is a prime example.\n\nHow to deal with narcissists? Avoidance is important.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8ptrwt",
                            "author": "video_dhara",
                            "score": 3,
                            "created_utc": 1652635223.0,
                            "response": "Just out of curiosity. How do address the actual issue, and not go straight to armchair analysis.\n\nHow do you protect people’s money in a decentralized system? Where’s a healthy line between stewardship and exploitation. That line’s going to have to be found. \n\nLike many crypto projects, balls-to-the-wall libertarianism just doesn’t scale.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "uq3dni",
            "title": "Bitcoin v0.1 Alpha in Jan 2009 by Satoshi Nakamoto | It was the first wallet application. You can send Bitcoins to others using $BTC address or IP address.",
            "url": "https://i.redd.it/300z5wwzamz81.jpg",
            "author": "Reahvenz",
            "created_utc": 1652611056.0,
            "score": 101,
            "num_comments": 8,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8osyy3",
                    "author": "Realistic_Delivery35",
                    "score": 6,
                    "created_utc": 1652617774.0,
                    "response": "I lost one of this wallet",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8p2phy",
                            "author": "BeefSupreme2",
                            "score": 5,
                            "created_utc": 1652623114.0,
                            "response": "Satoshi? You are alive!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8q53c8",
                    "author": "Financial_Chemist286",
                    "score": 4,
                    "created_utc": 1652640171.0,
                    "response": "I just want to know what kind of shrooms Satoshi was on to think of something so genius as the $BTC network!\n\nWho knows, he probably was just tired of having the little guy be cheated and his creation came out of necessity.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}