{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "utkck6",
            "title": "I have just bought my first 1 Dollar in Bitcoin. Was it a good time or should I have waited?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/utkck6/i_have_just_bought_my_first_1_dollar_in_bitcoin/",
            "author": "Mochi101-Official",
            "created_utc": 1653017381.0,
            "score": 0,
            "num_comments": 5,
            "subreddit": "Bitcoin",
            "selftext": " I am 7 and a half years old and am looking to make money to buy an iPad and fund my lemonade stand startup. I don't have a bank account with money that I could spend on  bitcoin, but I remembered that I have some change from grandma in an old piggy bank of mine, which is now broken because there was no plug for me to empty it out without breaking it.. I have seen Bitcoin at a stable level after its massive drop  so I though now would be the time to buy with knowledge from trading  virtual money on the stock exchange. Was it a good idea in thought it is  my first ever Bitcoin purchase or should I have waited?",
            "stickied": false,
            "comments": [
                {
                    "id": "i9ab10i",
                    "author": "Filthyy22",
                    "score": 1,
                    "created_utc": 1653017665.0,
                    "response": "Keep stacking those nickels buddy. It’s a good time.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ab826",
                            "author": "WritingFun8769",
                            "score": 1,
                            "created_utc": 1653017772.0,
                            "response": "bruh a 7yo is not typing this shit",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9abark",
                                    "author": "Mochi101-Official",
                                    "score": 1,
                                    "created_utc": 1653017815.0,
                                    "response": "7 and a half",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9ab45u",
                    "author": "WritingFun8769",
                    "score": 1,
                    "created_utc": 1653017712.0,
                    "response": "god im so sick of these shitposts",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "utkiha",
            "title": "Binance",
            "url": "https://www.reddit.com/r/Bitcoin/comments/utkiha/binance/",
            "author": "ares_murphy",
            "created_utc": 1653017961.0,
            "score": 0,
            "num_comments": 11,
            "subreddit": "Bitcoin",
            "selftext": "Good Day everyone please be nice, This is gonna be my first time “investing” since I am just bored and saw a friend post about having 0.294 BTC and when I converted, I was shocked how valuable it was. Anyway, I am just gonna go to binance, click BTC, then click buy an amount of $50. Can anyone tell me if I’m doing it right? I’m sure crypto stuffs is very complicated and I’m sure it’s not that easy so I am contemplating if I should do it or not. BTW, I fontina really planning on anything about my $50, I just want it to sit there and maybe grow if it can? Will it? Please enlighten me. Thank You",
            "stickied": false,
            "comments": [
                {
                    "id": "i9aeqxy",
                    "author": "SomeBrokeChump",
                    "score": 6,
                    "created_utc": 1653019835.0,
                    "response": "You should use a better exchange. Binance chooses to charge their customers an absurd fee of 0.0005 BTC per bitcoin withdrawal. And there are many other reasons to avoid using Binance that I wont bother mentioning.\n\nI recommend using [Strike app](https://strike.me/), [Kraken](https://www.kraken.com), [Gemini ActiveTrader](https://www.gemini.com/activetrader), [Coinbase Pro](https://pro.coinbase.com), or [Swan Bitcoin](https://www.swanbitcoin.com/) to buy bitcoin.\n\nKraken chooses to charge their customers 0.00002 BTC per bitcoin withdrawal. Coinbase Pro chooses to charge their customers a very small bitcoin withdrawal fee. Gemini chooses to give every customer 10 free bitcoin withdrawals per month and then charges them 0.001 BTC per bitcoin withdrawal for any more. Strike, Swan Bitcoin, and FTX don't charge their customers anything for bitcoin withdrawals.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9afcsv",
                            "author": "Inevitable-0246",
                            "score": 3,
                            "created_utc": 1653020210.0,
                            "response": "Side note, Kraken reduced it to 0.00001 BTC recently, even better!",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9aflbv",
                            "author": "ares_murphy",
                            "score": 1,
                            "created_utc": 1653020355.0,
                            "response": "Thank You. I will take note of this.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9aurqp",
                                    "author": "dlq84",
                                    "score": 1,
                                    "created_utc": 1653031493.0,
                                    "response": "Also read up on what Bitcoin is, it's not a get rich quick scheme. There are no guarantees.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9b45ik",
                                            "author": "ares_murphy",
                                            "score": 1,
                                            "created_utc": 1653039554.0,
                                            "response": "I’ll take note of that. But I’m not really gonna commit into it. It’s just like, why not try it. If I get extra money then Yay, if not, I guess better luck.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9acbqd",
                    "author": "16vJamie",
                    "score": 2,
                    "created_utc": 1653018400.0,
                    "response": "Yep that’s right, then the next step would be to move it to an offline ledger, but that might not be worth it for only $50 worth.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9adf3h",
                    "author": "redcelica1",
                    "score": 1,
                    "created_utc": 1653019038.0,
                    "response": "If it’s not too expensive to transfer, maybe you could create a paper wallet to move it to.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ae8zo",
                    "author": "Inevitable-0246",
                    "score": 1,
                    "created_utc": 1653019529.0,
                    "response": "Binance is well known for charging very high withdrawal fee (0.0005 BTC, ~= US$15) when you transfer the BTC you purchased to your own non-custodial wallet.  If your intent is to buy and hold under self-custody, there are usually more cost effective exchanges to purchase BTC from depending on your country.\n\nAs an example, personally I use Kraken that charges 0.00001 BTC (~= US$0.3, or 1/50 of what Binance charges) for BTC withdrawal.   There are also exchanges that do not charge withdrawal fee that are accessible in some countries for you to consider.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9b0ncj",
                    "author": "Apprehensive-Page-33",
                    "score": 1,
                    "created_utc": 1653036776.0,
                    "response": "Binance is a bit of a trap. Be careful and read the TOS thoroughly before transfering funds. When it comes to money, you yourself are your only friend. Everyone else is an opportunist. If you can't store your BTC yourself, you must trust a middleman to hold it for you. Not only does Binance charge extortionate fees for transferring out, they have multiple security holes that can leave your vulnerable to hackers. There is no customer service at Binance and no recourse for you as a customer if Binance algorithms detect any unusual activity. When anything \"unusual\" is detected on the account, it is immediately locked. It will be up to you to prove to the Binance AI that you are who you say you are and also to provide proof of income, citizenship etc before regaining access to the funds in your account. As bad as this sounds, it still ignores the reality that if Binance were to go under they would almost certainly take the assets of their customers with them into financial oblivion. Tread at your own risk on Binance (or any CEX). With the high exit fees and low security and non existent customer service there really is no logical reason to use the service at all.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9b4d01",
                            "author": "ares_murphy",
                            "score": 1,
                            "created_utc": 1653039711.0,
                            "response": "That sounds scary 😧 From these replies, I don’t think I should invest.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9bct48",
                                    "author": "Apprehensive-Page-33",
                                    "score": 1,
                                    "created_utc": 1653045816.0,
                                    "response": "Well you must educate yourself first before you start to make investment decisions. There is no rush. Better to miss out entirely than to FOMO in without first DYOR. Also using disposable income (UDI) is a must for investing in volatile and potentially unsustainable investments... America runs on manic depression, hype, fear, FOMO, FUD, lies, disinfo campaigns, propaganda etc... when it comes to finance literally no one is going to tell you the objective reality that you need to know in order to make decisions that align with your interests. DO YOUR OWN RESEARCH DO NOT COME TO CONCLUSIONS BASED ON WHAT SOME OTHER PERSON TELLS YOU.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}