{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uqkloq",
            "title": "Bitcoin Swing/Trend Trading Bot",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uqkloq/bitcoin_swingtrend_trading_bot/",
            "author": "Falcoace",
            "created_utc": 1652664870.0,
            "score": 0,
            "num_comments": 1,
            "subreddit": "Bitcoin",
            "selftext": "I have a proprietary bitcoin swing trading bot that I'm looking to monetize and let a limited number of users have access to. Thought WBS would be a great place to post about it.\n\nPlease do not reply if you aren't a serious, full-time trader. \n\nThe bot is designed to capture the meat of a macro move in the market. As of this post - it's currently short from $43,581.\n\nSome notable trades it took in the last couple of years:\n\nLonged $17,516 to $31,821 \n\nShorted $54,482 to $31,735 \n\nLonged $33,862 to $42,266\n\nShorted $60,242 to $51,1146\n\nAll of these trades are verifiable via my discord, where they're automatically logged.\n\nCan supply direct trading account logs upon request (6 years worth). \n\nDM for more info.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8rnpud",
                    "author": "NiceDoctorBeam",
                    "score": 1,
                    "created_utc": 1652665183.0,
                    "response": "LOL",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uqkk2g",
            "title": "DeFi on Bitcoin. Rootstock RSK sidechain.",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uqkk2g/defi_on_bitcoin_rootstock_rsk_sidechain/",
            "author": "kryptoNoiser",
            "created_utc": 1652664716.0,
            "score": 4,
            "num_comments": 15,
            "subreddit": "Bitcoin",
            "selftext": "We all know Bitcoin with 1Mb blocks can't do much but with layers on top of Bitcoin, many things will be created. Like Lightning Network solves the issue of peer-to-peer transactions that are actually cheap and fast the same way sidechain will allow for DeFi on Bitcoin.\n\nRootstock RSK is the name of the Bitcoin sidechain, and it is EVM compatible which means other existent projects can port to Bitcoin without much effort.\n\nObviously, you will need a decentralized exchange to do DeFi, and that exchange name is Sovryn DEX.\n\nMargin trade, trading on spot prices, trading on limit orders, lend, borrow, stake, that is what DeFi will bring to Bitcoin.\n\nObviously, it will also bring shittokens, but you can ignore those, and just use the decentralized exchange to exchange into fiat value or things that the user may actually like.\n\nI am bullish on the idea of having stablecoins that are actually over collateralized and that use Bitcoin as its peg, something like Dollar on Chain DoC, or Zero USD which is not released yet, and even zero-interest loan putting your Bitcoin as a pristine asset.\n\nI think that Defi on Bitcoin will actually bring what you can do with centralized exchanges but this time using peer-to-peer smart contracts, and the users are always in control of their private keys.\n\nIf you like Lightning Network for fast and cheap transactions, I think you will also like Rootstock as a third solution for DeFi on Bitcoin.\n\n&#x200B;\n\nJust ignore the shittokens and you will be golden.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8rtsye",
                    "author": "uncontrollableop",
                    "score": 3,
                    "created_utc": 1652667986.0,
                    "response": "any post that begins with \"we all know\" has lost me from the start. because there is absolutely nothing you could place after those words that would end in a true statement.\n\nyou can't peg to the dollar with bitcoin.  if they're trying to use some arbitrage scheme to hold the peg, they can easily be attacked like we have see recently.   this can and will happen to them all.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8rwa8p",
                            "author": "kryptoNoiser",
                            "score": 1,
                            "created_utc": 1652669226.0,
                            "response": "Okay, Dollar on Chain is a stable coin, pretty you must over collateralize your loan in order to get the stable coin, or I think you must sell your Bitcoin or something like that. \n\nThe Sovryn team is working on a stable coin too that will start with Z. ZUSD or something like that, you will borrow with your Bitcoin and if the value of Bitcoin goes down you will have to return the ZUSD otherwise your loan gets liquidated, and you lose your Bitcoin.\n\nZero stable coins and the Zero loan interest loans will work differently, but we will have to wait until Sovryn DEX releases it to know exactly how it will work.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8sphac",
                                    "author": "bullett007",
                                    "score": 1,
                                    "created_utc": 1652689463.0,
                                    "response": "Zero is the protocol. zUSD is the stablecoin.\n\nYou'll be able to borrow zUSD using the Zero protocol by locking up rBTC (which is a 1:1 peg of BTC) within the Zero protocol that has a minimum collateral ratio of 110%, **if your collateral value falls below 110%, it will be liquidated.**",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8s2nxp",
                    "author": "Phrygian1221",
                    "score": 3,
                    "created_utc": 1652672728.0,
                    "response": "I'm excited for Zero, and lightning integration. \n\n\nSovryn has yet to impress with all their promises. They said Zero would be available in December. That being said, being able to make a large purchase without selling my Bitcoin really sounds nice.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8rq1bu",
                    "author": "Mobile-Neat-6340",
                    "score": 2,
                    "created_utc": 1652666244.0,
                    "response": "Defichain (DFI) is a maturing Defi project built on Bitcoin rolling out EVM",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8rx6t3",
                            "author": "kryptoNoiser",
                            "score": 3,
                            "created_utc": 1652669693.0,
                            "response": "How the bridge between Bitcoin and Defichain works? use simple terminology, please.\n\nRootstock is pretty much a multisign wallet that is secured by merge mining and security hardware located in secret locations behind Tor to sign the transactions. If that security hardware gets compromised either at the location where the chips sit or when manufacturing them the network can be compromised.\n\nThose security chips obviously have anti-tamper technology built-in, it is like your hardware wallet at home, but those wallets only sign the proof of work that is merged and mined with Bitcoin miners.\n\nWhat about Defichain (DFI). How does their bridge to BTC works?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8sow2h",
                    "author": "bullett007",
                    "score": 2,
                    "created_utc": 1652688926.0,
                    "response": "I'm excited about what's coming down the pipeline for Sovryn also, but OP, your post really does sound like an ad.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8tqoih",
                    "author": "bitusher",
                    "score": 1,
                    "created_utc": 1652712749.0,
                    "response": "The first sentence starts with either a lie or ignorance. Bitcoin removed the 1MB blocksize limit in 2017. \n\nSo why mention 1MB?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8uds0k",
                    "author": "SimplyTrolling2234",
                    "score": 1,
                    "created_utc": 1652722100.0,
                    "response": "Have fun losing all of your money",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8rvbl3",
                    "author": "Mallardshead",
                    "score": 0,
                    "created_utc": 1652668738.0,
                    "response": "Are there any speculative tokens involved? If the answer is yes, it's a scam.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8rwi28",
                            "author": "kryptoNoiser",
                            "score": 1,
                            "created_utc": 1652669335.0,
                            "response": "Yes, trading against stable coins like any other exchange. Fiat is a scam so stable coin is too.\n\nFiat is a scam and yet Bitcoiners love to trade BTC against the scam called Dollar, so everything is a scam, my friend.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8rz9r8",
                                    "author": "Mallardshead",
                                    "score": 2,
                                    "created_utc": 1652670802.0,
                                    "response": "Trading is for newbs and gambling junkies masquerading as investors. Bitcoin isn't the scam, it's any vehicle, charlatan, or product trying to get you trade your bitcoin for it that is.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8sizhu",
                    "author": "sexyama",
                    "score": 0,
                    "created_utc": 1652683852.0,
                    "response": "FYI, this sub has just been created for all Bitcoin DeFi projects /r/BitcoinDeFi",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}