{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uslhvr",
            "title": "I can tell the further",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uslhvr/i_can_tell_the_further/",
            "author": "JimBloc",
            "created_utc": 1652904322.0,
            "score": 2,
            "num_comments": 8,
            "subreddit": "Bitcoin",
            "selftext": "When I look into my crystal ball, I see 2 years of high inflation, until some geniuses tell us they have the solution.. I'm thinking it'll be a government control digital currency that will solve all the issues.. Of course they'll need a carrot, maybe one off payment to switch over. But then it's game over, you'll not be aloud to move money in or out btc.. Any opinions",
            "stickied": false,
            "comments": [
                {
                    "id": "i9481a6",
                    "author": "Nada_Lives",
                    "score": 3,
                    "created_utc": 1652905142.0,
                    "response": "What is your sense of the term \"money\"?\n\nSomehow I think you mean government-controlled privately-owned legacy fiat, which you presently can't use without declaring who you are, where you got it from, and where you want to spend it, IF they allow you, and only IF you pay them an increasing amount of user fees.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i94atmc",
                            "author": "JimBloc",
                            "score": 2,
                            "created_utc": 1652906273.0,
                            "response": "Well yes, but that's bit of mouth full, I'll just call it government Shit Cash from now on.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i946i6f",
                    "author": "SmoothGoing",
                    "score": 2,
                    "created_utc": 1652904510.0,
                    "response": "Money never moves \"in\" or \"out of\" btc.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i946tvj",
                            "author": "JimBloc",
                            "score": 1,
                            "created_utc": 1652904645.0,
                            "response": "That's not what says on my bank statement",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i94e0e3",
                    "author": "marshyr3d1and",
                    "score": 1,
                    "created_utc": 1652907588.0,
                    "response": "For god's sake please edit your title",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i94dg8o",
                    "author": "solomonsatoshi",
                    "score": 1,
                    "created_utc": 1652907352.0,
                    "response": "CBDCs make Bitcoin even more desirable. \n\nChina has tried to ban Bitcoin in order to promote its CBDC but this is simply an admission that Bitcoin is more desirable than the CBDC.\n\nIt will be more difficult for liberal democracies to ban Bitcoin ownership, but they probably will try to capture and control Bitcoin via strategies such as ETFs and banning private custody.\n\nUSD vs DCEP vs BTC\n\nFiat Debt Slavery vs CCP Surveillance State Autocracy vs Freedom Liberty and Equity.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i94f2kz",
                    "author": "code4578i",
                    "score": 1,
                    "created_utc": 1652908027.0,
                    "response": "How money was created? And who accepted them?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i94homr",
                    "author": "bandoonparade",
                    "score": 1,
                    "created_utc": 1652909141.0,
                    "response": "The further is now",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uslpip",
            "title": "Blockchain forensics for thefts/scams",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uslpip/blockchain_forensics_for_theftsscams/",
            "author": "ColdFusion3456",
            "created_utc": 1652904917.0,
            "score": 2,
            "num_comments": 2,
            "subreddit": "Bitcoin",
            "selftext": "Hey I know scams & thefts rose pretty high last year and the beginning of this year. If there is anyone out there that has been victim of a theft or scam I'm willing to assist with tracing funds / identify the culprit for free / pro bono.\n\n&#x200B;\n\nI'm not offering any service or product, not asking for any money. I just happen to have some extra time on my hands these next 6 months. I know in some jurisdictions law enforcement lack adequate tools. Don't expect miracles and if I take your case just please be patient as I only have so much time in the day.",
            "stickied": false,
            "comments": [
                {
                    "id": "i94ak5x",
                    "author": "ETAVEGAMING",
                    "score": 2,
                    "created_utc": 1652906166.0,
                    "response": "Check out 100x coin. Now known as “altbase”. That dude doesn’t seem like he will be held accountable for anything. He made a coin. Then remade a coin. Then remade a coin. I don’t know how many times he made a new coin, but people got rekt every time.\n\nAt the start, this dude appeared to be in some basic apartment. Now he lives in what appears to be a gorgeous house. \n\nIf you’re bored, anyways.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "usleo4",
            "title": "btc narrative",
            "url": "https://www.reddit.com/r/Bitcoin/comments/usleo4/btc_narrative/",
            "author": "baldlilfat2",
            "created_utc": 1652904081.0,
            "score": 0,
            "num_comments": 6,
            "subreddit": "Bitcoin",
            "selftext": "Why are bitcoin talking points, loss, down, and crash instead of wow bitcoin is up 10000% since inception? As a sub we all need to remind everyone else what great power bitcoin has and remind them what a great investment it has been and will continue to be.",
            "stickied": false,
            "comments": [
                {
                    "id": "i947bnq",
                    "author": "SmoothGoing",
                    "score": 3,
                    "created_utc": 1652904849.0,
                    "response": "It has been. That's observable. It will continue to be - no one can predict the future.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i948kv5",
                    "author": "Nada_Lives",
                    "score": 3,
                    "created_utc": 1652905361.0,
                    "response": "You'll have to ask Bitcoin's official talking points department, which is presently unstaffed.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i94br1m",
                            "author": "baldlilfat2",
                            "score": 1,
                            "created_utc": 1652906649.0,
                            "response": "We are them",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i94fais",
                    "author": "RobbyMcRobbertons",
                    "score": 1,
                    "created_utc": 1652908122.0,
                    "response": "Alexa Play: What Have You Done For Me Lately",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i95ss91",
                    "author": "udevil2",
                    "score": 1,
                    "created_utc": 1652931185.0,
                    "response": "You can say that about most investment. Any stock that gets listed probably has a return better than that (since inception) for example.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uslp8z",
            "title": "Number of addresses with over 1 Bitcoin hits new all-time high despite volatility | finbold",
            "url": "https://cos.tv/videos/play/36248842687254528",
            "author": "CEMN0ME",
            "created_utc": 1652904898.0,
            "score": 22,
            "num_comments": 6,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i94r4zj",
                    "author": "debanked",
                    "score": 5,
                    "created_utc": 1652913245.0,
                    "response": "Everytime I buy, I know I'm giving someone money, with the hope that I'll be able to covert my BTC for goods and services\n\nEverytime I work, I get dollars, with the hope I can buy goods and services\n\nI have the hope and trust that both hold value over time before I have a chance to spend my savings\n\nWhat I know is that each week my fiat buys me less and less, because they can print more and more fiat\n\nBTC is hedge and more and more people I know are trying to get a whole coin, and save it like a Picasso, because slowy the trust in BTC is becoming greater than the trust in fiat\n\nBitcoin has no CEO, it has no infinite supply, it creates its own trust.\n\nWhy wouldn't there be more 1 BTC wallets than ever before",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i96a66o",
                            "author": "Keith_Kong",
                            "score": 2,
                            "created_utc": 1652942896.0,
                            "response": "Hell yeah man, I’ve been watching Bitcoin since it came out. Obviously an idiot for not stacking right away, but I’ve been dabbling and waiting for it to reach a moment where it really felt like a political movement–not just a speculative technological experiment.\n\nThat finally clicked for me in the last couple years and my conviction keeps growing stronger. Finally became a whole coiner when that drop perfectly hit my 25.3k limit order. Feels good 🤙🏼",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i96h0bb",
                            "author": "Capable_Low_621",
                            "score": 1,
                            "created_utc": 1652948878.0,
                            "response": "If anything, the more users join and the more adoption grows, you’d expect to see less wallets with more than 1 btc…you’d expect spread.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i96hcp2",
                                    "author": "debanked",
                                    "score": 1,
                                    "created_utc": 1652949187.0,
                                    "response": "Eventually. At this time, many can buy a whole coin, so why wouldn't they?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i94qrad",
                    "author": "konokonohamaru",
                    "score": 2,
                    "created_utc": 1652913072.0,
                    "response": "Weak hands getting shaken loose",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "usll5k",
            "title": "Biden Administration Wants Crypto Exchanges to Separate Customer and Corporate Funds",
            "url": "https://www.coindesk.com/policy/2022/05/18/biden-administration-wants-crypto-exchanges-to-separate-customer-and-corporate-funds/",
            "author": "ShotBot",
            "created_utc": 1652904583.0,
            "score": 37,
            "num_comments": 37,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i959uss",
                    "author": "Harbinger311",
                    "score": 15,
                    "created_utc": 1652922018.0,
                    "response": "This is a good thing.  This sets up exchanges to act more like conventional financial institutions and offers more protections to customer funds in cases of distress (like bankruptcy).\n\n\"Spurred by Coinbase’s (COIN) recent disclosure that customers’ money would be jammed up if the company declared bankruptcy, federal officials intend to push U.S. lawmakers to fix the problem by insisting that a future legal framework require crypto firms keep customer assets walled off. That type of custodial rule is standard for financial firms such as futures platforms, but crypto exchanges routinely mingle their funds with customers’ holdings in the same pot – a situation the administration wants to see ended by legislation. The securities industry commonly commingles funds, but the investments are also more heavily regulated.\"",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i95qk46",
                            "author": "hyperinflationUSA",
                            "score": 0,
                            "created_utc": 1652930012.0,
                            "response": "it can be viewed as a bad too. It enourages people to leave thier coins on exchanges. Im sure that's the government's agenda to pass this.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i95zeer",
                                    "author": "glen_echidna",
                                    "score": 3,
                                    "created_utc": 1652935070.0,
                                    "response": "What was the governments agenda when building the road you drive on and collecting the garbage you leave out on street weekly?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i96425g",
                                            "author": "dktunzldk",
                                            "score": -1,
                                            "created_utc": 1652938230.0,
                                            "response": "To increase the efficiency of their slaves.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i965b6b",
                                                    "author": "glen_echidna",
                                                    "score": 3,
                                                    "created_utc": 1652939109.0,
                                                    "response": "Clearly they failed in your case by not bundling a free tinfoil hat with those services. You get the points for glibness though. Logic be damned\nYou don’t like them, vote for a different one. You don’t like any, say what you can do better and get elected yourself. Whining about the gubmint and ascribing bad intentions without proposing an alternative gets pathetic at some point",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i967ovc",
                                                            "author": "dktunzldk",
                                                            "score": -1,
                                                            "created_utc": 1652940915.0,
                                                            "response": "I wouldn't expect a brainwashed bootlicker to realize that voting for puppets or becoming one is a PR scheme to keep the slaves distracted and content.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9686mn",
                                                                    "author": "glen_echidna",
                                                                    "score": 3,
                                                                    "created_utc": 1652941301.0,
                                                                    "response": "So are they puppets or criminal masterminds?",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i969fyt",
                                                                            "author": "dktunzldk",
                                                                            "score": 0,
                                                                            "created_utc": 1652942310.0,
                                                                            "response": "What they? You vote the puppets. You don't see, know, or vote the puppeteers.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i96mjvp",
                                            "author": "Suspicious_Plan3394",
                                            "score": 1,
                                            "created_utc": 1652953909.0,
                                            "response": "I mean, even when the gov comes up with protections for the average investor people with tin hats always manage to take it as a negative and conspiracy.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i9680s7",
                                            "author": "Asum_chum",
                                            "score": 0,
                                            "created_utc": 1652941178.0,
                                            "response": "What is the government’s agenda in claiming road tax only to not fix or repair the roads?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i968qwj",
                                                    "author": "glen_echidna",
                                                    "score": 2,
                                                    "created_utc": 1652941761.0,
                                                    "response": "Clearly there are higher priorities that are under funded and money flows to those. You don’t like the priorities, vote for better ones. Better yet, convince others to vote for better priorities. At some point the roads will have to be fixed by the government so calling it evil doesn’t solve the problem",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i969qgf",
                                                            "author": "Asum_chum",
                                                            "score": 1,
                                                            "created_utc": 1652942541.0,
                                                            "response": "Other priorities like social care funding at a time when we have the highest number of available jobs vs unemployment since records began? Or maybe it’s giving people some council tax back due to the fact energy prices have soared to 50% higher than last year. Strange that after the government allowed a cap increase of, what was it again? Oh yes, 50%",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i96mnwz",
                            "author": "Gandalftron",
                            "score": 1,
                            "created_utc": 1652954009.0,
                            "response": "Agreed.  Essentially a Glass-Steagall Act for crypto.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i94sn3f",
                    "author": "coinfeeds-bot",
                    "score": 7,
                    "created_utc": 1652913926.0,
                    "response": "tldr; U.S. President Joe Biden’s administration will press Congress to demand cryptocurrency exchanges keep their customers’ money separate from their own corporate funds, according to a person familiar with the plan that could constrain the way the industry does business.\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i94ohce",
                    "author": "NYKNYb",
                    "score": 18,
                    "created_utc": 1652912058.0,
                    "response": "He likes to have his mashed potatoes and his peas on two plates separately and that's how he got the idea.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i94rlf9",
                    "author": "hladinidasi",
                    "score": 7,
                    "created_utc": 1652913452.0,
                    "response": "I don't know what this means and I don't feel like reading the article. Whenever I hear Biden and Bitcoin in the same sentence I know its probably not going to be something good.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i95igeh",
                            "author": "TheMoonMoth",
                            "score": 2,
                            "created_utc": 1652925996.0,
                            "response": "Seems to me like an effort to entrench rehypothecation of BTC in order to suppress price.\n\nBy making exchanges cater to businesses ( which have fiduciary duties that are controllable by the govt. ) they can encourage holding their assets on the exchange.  \n\nUnfortunately, Bitcoins anti fragile properties will spoil this party before long. Since the underlying is easy to verify by anyone, any rehypothecation will never eventually have to verify their holdings.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i95u4c9",
                    "author": "oldskoolr",
                    "score": 1,
                    "created_utc": 1652931913.0,
                    "response": "Must be that industry ending regulation I keep hearing about.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i965f7f",
                    "author": "bluetuxedo22",
                    "score": 1,
                    "created_utc": 1652939190.0,
                    "response": "Let me guess. If anything happens then the corporate funds will be returned and the customer funds will be lost.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i967stl",
                            "author": "Asum_chum",
                            "score": 1,
                            "created_utc": 1652941001.0,
                            "response": "Nearly. The corporate funds will be refunded and the retail funds will also get returned to the corporates.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9663jz",
                    "author": "slvbtc",
                    "score": 1,
                    "created_utc": 1652939694.0,
                    "response": "Because customer funds will be frozen and seized by the state under the guise of economic protection while corporate funds will be allowed to remain untouched to protect the economy.\n\nPlease get your coins off of exchanges now.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i968r8s",
                    "author": "Mektzer",
                    "score": 1,
                    "created_utc": 1652941769.0,
                    "response": "This is great news! They should also be constantly audited by a third party, as crypto holdings are so easy to veriy, and be sanctioned in case their holdings don't match..",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i96c04e",
                            "author": "MaxSan",
                            "score": 1,
                            "created_utc": 1652944416.0,
                            "response": "You dont even need a third party. There are tools which have been built since years to allow exchanges to self audit their holdings. The first company to do this was Coinfloor and now Kraken.\n\nThey should be used.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i96f16j",
                    "author": "besttshirtsever",
                    "score": 1,
                    "created_utc": 1652947082.0,
                    "response": "BRYDEN",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i96mbug",
                    "author": "Batman_6040",
                    "score": 1,
                    "created_utc": 1652953718.0,
                    "response": "it would be nice if they put as much energy into regulating the banks",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i948rzc",
                    "author": "TRAVISeScooterMan123",
                    "score": -2,
                    "created_utc": 1652905441.0,
                    "response": "“Decentralised”",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i950dgi",
                    "author": "infopocalypse",
                    "score": -4,
                    "created_utc": 1652917535.0,
                    "response": "Can't have the plebs getting the same treatment and rules as the elite.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i95p1x0",
                            "author": "glen_echidna",
                            "score": 3,
                            "created_utc": 1652929245.0,
                            "response": "Such a dumb take. The policy is to ensure customer money can be paid back in case the exchange goes bankrupt. Or would you rather have customer funds going to secured creditors instead?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i95uujd",
                                    "author": "infopocalypse",
                                    "score": 0,
                                    "created_utc": 1652932326.0,
                                    "response": "Not your keys not your coins. I don't care. You can think it's all benevolent if you want.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i95xm35",
                                            "author": "glen_echidna",
                                            "score": 2,
                                            "created_utc": 1652933948.0,
                                            "response": "Not your keys not your coins doesn’t make it a bad policy for service providers having to segregate customer funds from own funds. And your initial take was some bs about elites and plebs and not keys/coins",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i95ytba",
                                                    "author": "infopocalypse",
                                                    "score": 0,
                                                    "created_utc": 1652934701.0,
                                                    "response": "If you withdraw your coins, then you don't need an exchange to essentially do the same thing for you.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i95zm9i",
                                                            "author": "glen_echidna",
                                                            "score": 3,
                                                            "created_utc": 1652935211.0,
                                                            "response": "Who is the pleb and elite in your scenario? How is the government harming the retail customer with this policy?",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i95k5gf",
                    "author": "theslapzone",
                    "score": 0,
                    "created_utc": 1652926818.0,
                    "response": "I'm waiting to see what the libertarians say on this one.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9630du",
                            "author": "maxcoiner",
                            "score": 2,
                            "created_utc": 1652937502.0,
                            "response": "Libertarian party members should be OK with it because it protects customer funds. \n\nFully anarchist libertarians like me only want laws to be repealed, never added. Sure, that point of view forgoes investor protection at times like this, but if you repeal enough laws then a parallel economy and framework for investor protection becomes possible. (i.e. assurance agencies)",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "uslru6",
            "title": "What are the biggest obstacles to widespread adoption of Bitcoin? What might solutions to those problems look like, generally?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uslru6/what_are_the_biggest_obstacles_to_widespread/",
            "author": "thats_just_right",
            "created_utc": 1652905101.0,
            "score": 5,
            "num_comments": 28,
            "subreddit": "Bitcoin",
            "selftext": "For example, the Bitcoin Network is limited to a relatively small number of transactions per second and now we have a 2nd layer solution with the Lightning Network. What are other hurdles bitcoin will have to overcome that don't have a practicable solutions? What are the problems to solve?\n\nI think one will be helping people overcome fear of losing their private key. Whether that's through continued teaching of best practices, or some clever solution that doesn't compromise the owner or rely on trust, I'm not sure, but that feels like it'll be a big challenge for a lot of people.\n\n(Also, if this post should have gone in the daily discussion mega thread please let me know. I'm still learning.)",
            "stickied": false,
            "comments": [
                {
                    "id": "i949ei9",
                    "author": "BitcoinWell",
                    "score": 11,
                    "created_utc": 1652905697.0,
                    "response": "The biggest obstacle for a lot of people is the \"why\" of bitcoin. Most people are perfectly fine with using the banking system and don't really understand how badly inflation or government intervention affects their money.  \n\n&#x200B;\n\nThings like teaching people how to use bitcoin or keeping it secure are also new concepts for a lot of people, so making products/software that bridge that knowledge gap would make getting into bitcoin much easier for people.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i94k5od",
                            "author": "lukanmac",
                            "score": 5,
                            "created_utc": 1652910203.0,
                            "response": "“how badly inflation or government intervention affects their money”\n\nYou’re right, I’d rather have my money act like a volatile stock.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i94rjij",
                                    "author": "solomonsatoshi",
                                    "score": 5,
                                    "created_utc": 1652913428.0,
                                    "response": "There has been no better SoV than BTC since it was created. None. \n\nIn fact BTC is the fastest appreciating asset in history bar none...why because it is satisfying a huge supply gap in the market- for sound money!\n\nSoV is the fundamental and essential requirement for any sound form of money.\n\nOver time as BTC network grows volatility (and appreciation rates) will reduce.\n\nAs any stockbroker will advise you- high growth stocks are volatile!",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i96i49d",
                                            "author": "outdatedrhombus",
                                            "score": 1,
                                            "created_utc": 1652949887.0,
                                            "response": "Actually I think Tesla stock has been a better SoV",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i96lmd9",
                                                    "author": "solomonsatoshi",
                                                    "score": 1,
                                                    "created_utc": 1652953103.0,
                                                    "response": "https://www.youtube.com/watch?v=7IuGelaZBJ4",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i96rylm",
                            "author": "fiercygoat",
                            "score": 1,
                            "created_utc": 1652958196.0,
                            "response": "Perfectly fine? Go ask people at a supermarket how \"perfectly fine\" are now.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i974xpw",
                            "author": "Tetons21",
                            "score": 1,
                            "created_utc": 1652965804.0,
                            "response": "In NYC, (some) merchants are charging a 4% fee for all credit card transactions - regardless of price!\n\nI’m hopeful ppl will quickly search for alternatives as these fees get pushed to the consumer. \n\nUnfortunately, I do think BTC is to volatile as a currency, but I think inflation prices and more fees being pushed to the end user will raise awareness on our broken financial system. And the US has the most stable financial system in the world.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i94a0i1",
                    "author": "Orly5757",
                    "score": 6,
                    "created_utc": 1652905947.0,
                    "response": "Bitcoin is intimidating. It takes hours of reading to really understand it. Most people have pre-conceived notions about bitcoin and have no interest in taking the time to truly understand what it is. So I would say “ignorance” is a huge hurdle.\n\nI would also add that people are used to the “safety” of banks. The thought of being hacked or losing their investment with no recourse is frightening. Transferring bitcoin out of exchanges into cold wallets is scary and requires an extent of technical knowledge that most people do not have. Sadly, I think that the solution will ultimately be banks taking custody for their clients. But it’s probably the only way towards adoption for the masses.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i94b3or",
                            "author": "StackerNoob",
                            "score": 2,
                            "created_utc": 1652906389.0,
                            "response": "Yep this was my answer above but you beat me by three minutes! Safety/security is a massive barrier for the average joe",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i95pusi",
                    "author": "nullama",
                    "score": 3,
                    "created_utc": 1652929650.0,
                    "response": "Most people are careless.\n\nWith fiat there's chargebacks, password resets, etc.\n\nWith Bitcoin once the money is sent, it's gone.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i94a1o5",
                    "author": "superboget",
                    "score": 3,
                    "created_utc": 1652905960.0,
                    "response": "Volatility. User-friendliness. Taxes. Ignorance. Lack of necessity.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i94aiey",
                    "author": "StackerNoob",
                    "score": 2,
                    "created_utc": 1652906147.0,
                    "response": "Honestly, I think it’s the idea that people have to take care of there own funds. Having money in the bank feels like safety for most people, there is someone to complain to/ask for help/blame in the event something goes wrong with your account or your funds are stolen. Not so in crypto, security is your problem, and that scares a lot of people.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9759vt",
                            "author": "Tetons21",
                            "score": 1,
                            "created_utc": 1652965971.0,
                            "response": "I’m pro custodial wallet for this reason. Most ppl don’t want complete financial sovereignty, so we’ll need 3rd parties going forward. \n\nI think a lot of ppl are still in the “why do I need this phase.” Similar to what occurred with the internet —— you can survive wo it, but it’s undeniably better than the old system",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i94qlvr",
                    "author": "solomonsatoshi",
                    "score": 2,
                    "created_utc": 1652913004.0,
                    "response": "OBSTRUCTION by the Fiat Debt Slavery Cartel which is composed of most politicians and the bankers.\n\nThey have the most profitable & powerful cartel in human history to protect and preserve ... vs Bitcoin!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i955avr",
                            "author": "Nada_Lives",
                            "score": 1,
                            "created_utc": 1652919876.0,
                            "response": "I'll agree, except that politicians have no power, zip, nada, to obstruct the one thing that Bitcoin does: Transfer value from one location to another. \n\nEverything else is finding a way to obtain Bitcoin, which is not a Bitcoin function, or finding a way to spend it, ditto.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i95g4gi",
                    "author": "Scrapin-Nee",
                    "score": 2,
                    "created_utc": 1652924925.0,
                    "response": "We need better miner decentralization. Hopefully Block comes though with a smaller at home miner that can help decentralize the network, but also not cost the average consumer to run and possibly even be slightly profitable. Just not too profitable where mining companies buy them all up.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i95c658",
                    "author": "PNW4LYFE",
                    "score": 4,
                    "created_utc": 1652923107.0,
                    "response": "I'm starting to see more normies losing the post Silk Road era hyperbole that Bitcoin is for darknet, drug dealers, and money laundering. \n\nWhat has replaced it is fear that either it is a scam itself,  or you can easily be scammed out of your investment. \n\nDoesn't help that each time someone comes to the community with n00b questions like \"how do I buy Bitcoin?\" or \"is Bitcoin a good investment right now?\",\nThe community is like:\n\n\"Buy with an exchange but then get your BTC off the exchange with a cold wallet, Trezor or Ledger, but don't forget to store your multisig mnemonic + passphrase\non steel plates in a safety deposit box/in your ass/tattooed on your foreskin and never answer another dm or tell anyone you have crypto. Also, watch out for sim swaps, $5 wrench attacks, or doxxing yourself on this sub.  By the way, if you can't stomach 80%, then you don't deserve 200% gains\".\n\nThat sounds intimidating to me just writing it.\n\nAs for the hackers and scammers, I do sometimes wonder why they target Crypto because their very act devalues the commodity they make off with, but I don't see any relief in sight.\n\nEdit: corrected a few miss-auto-corrects.  Yes I'm on my phone.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i95ib0a",
                            "author": "thats_just_right",
                            "score": 3,
                            "created_utc": 1652925929.0,
                            "response": "Great point. Also, kudos for how you summed up like half of all comments on r/bitcoin in one post. And just to be clear, tattooing only half of my key on my foreskin, right? The other half on the inside of my ass cheek?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i95j4lp",
                                    "author": "PNW4LYFE",
                                    "score": 3,
                                    "created_utc": 1652926323.0,
                                    "response": "No need to be cheeky /s \n\nYes, to elaborate: Make sure to get the tattoo backward and upside down so it comes out right in the mirror, and never let them know your next move.\n\nSeriously though, I appreciate your kudos friend.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i948bkx",
                    "author": "gotamm",
                    "score": 1,
                    "created_utc": 1652905257.0,
                    "response": "Poor UI/UX",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i951had",
                    "author": "learner77",
                    "score": 1,
                    "created_utc": 1652918065.0,
                    "response": "Acceptance as what?\n\nmoney? People hodling. Solution - stop hodling and use it to actually buy stuff\n\nstore of value? Lack of people that think a string of numbers is worth anything. Solution? Dunno.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i96ay06",
                    "author": "Telechain",
                    "score": 1,
                    "created_utc": 1652943536.0,
                    "response": "Incomm payments scan-to-pay",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i96x5zs",
                    "author": "Playful_Comparison84",
                    "score": 1,
                    "created_utc": 1652961567.0,
                    "response": "Most people don’t understand and see what it’s about, therefore being against it because they see media and public figures or institutions doing so due to their own agenda",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i94dek7",
                    "author": "Hyde_103",
                    "score": 0,
                    "created_utc": 1652907332.0,
                    "response": "The biggest obstacle is politicians!!!  Once the old guard finally dies off, it should be full speed ahead.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uslhru",
            "title": "Russia to legalise cryptocurrency as means of payment 'sooner or later' - minister | Reuters",
            "url": "https://www.reuters.com/business/finance/russia-could-legalise-cryptocurrencies-means-payment-industry-minister-2022-05-18/",
            "author": "simplelifestyle",
            "created_utc": 1652904314.0,
            "score": 31,
            "num_comments": 4,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i94k9xr",
                    "author": "Stimorolgum",
                    "score": 9,
                    "created_utc": 1652910252.0,
                    "response": "Bitcoin is the true competitor to the Petro dollar",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9b6ueg",
                    "author": "Fatbaldmuslim",
                    "score": 1,
                    "created_utc": 1653041712.0,
                    "response": "“Only small countries use it”",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i94sn79",
                    "author": "coinfeeds-bot",
                    "score": 0,
                    "created_utc": 1652913928.0,
                    "response": "tldr; Representations of virtual currency Bitcoin are seen in this picture illustration taken taken March 13, 2020. REUTERS/Dado Ruvic/Illustration May 18 (Reuters) - Russian Industry and Trade Minister Denis Manturov on Wednesday said cryptocurrencies could be legalised as a means of payment in Russia. Our Standards: The Thomson Reuters Trust Principles.\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR.*",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}