{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uz0opu",
            "title": "What stops a government?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uz0opu/what_stops_a_government/",
            "author": "Blmeitonthewether",
            "created_utc": 1653665266.0,
            "score": 5,
            "num_comments": 37,
            "subreddit": "Bitcoin",
            "selftext": "Dumb question…. What stops any government from just printing more money to buy up the total available supply of Bitcoin?",
            "stickied": false,
            "comments": [
                {
                    "id": "ia7d34b",
                    "author": "CombatWombat476",
                    "score": 19,
                    "created_utc": 1653665642.0,
                    "response": "If people know that the government is printing hella money to buy bitcoin, hence destroying their national currency... who in their right mind would trade bitcoin for an imploding national currency??",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia7dkr2",
                            "author": "Jaseur",
                            "score": 6,
                            "created_utc": 1653665843.0,
                            "response": "I actually think the govt could use its Bitcoin to defend its currency.\n\nThey should buy in secret, acquire a decent hoard, then and only then announce plans to support Bitcoin.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia7hp3s",
                                    "author": "CombatWombat476",
                                    "score": 5,
                                    "created_utc": 1653667526.0,
                                    "response": "It would be one thing, maybe, if the government used tax revenue to slowly build up a bitcoin position over time, then peg their currency to bitcoin.\n\nIts another thing entirely if they do it through money printing.\n\nAlthough, I think government as whole (mainly the US government) has totally lost trust at maintaining a reasonable peg between a hard asset and government paper. Between FDRs and Nixons shenanigans, I wouldnt trust government money even if they started fully backing it with gold or btc.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "ia7g57w",
                                    "author": "NiceDoctorBeam",
                                    "score": 3,
                                    "created_utc": 1653666897.0,
                                    "response": "That's what people once thought in Zimbabwe when their new \"Dollar\" was on par with the US Dollar.\n\nNothing says, \"fail\" quite like $100 trillion dollar bills.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia7ct60",
                    "author": "dat9553",
                    "score": 7,
                    "created_utc": 1653665528.0,
                    "response": "It will be their self-destruct move",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia7chm6",
                    "author": "Helen666_Keller",
                    "score": 6,
                    "created_utc": 1653665397.0,
                    "response": "The bitcoin has to be for sale",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia7d9ol",
                    "author": "ndgoLiberty",
                    "score": 3,
                    "created_utc": 1653665717.0,
                    "response": "The people [            ] every last one of the “elected” officials.\n\nie never in human history has a government not debased their currency.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia7gy0h",
                    "author": "dlq84",
                    "score": 3,
                    "created_utc": 1653667224.0,
                    "response": "Ever heard of inflation? Also, as they buy up Bitcoin, there will be less supply on the market, less supply mean price increase, there is no hard limit to how much USD it would take.\n\nIt's like printing money just to buy all the gold in the world, your currency would collapse before you get halfway there.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia7htcl",
                    "author": "Linkaiser",
                    "score": 3,
                    "created_utc": 1653667574.0,
                    "response": "On technical terms, there is nothing stopping them.  \n\n\nOn logical terms, that would destroy their national currency thus it wouldn't have the required value to buy the bitcoin in the first place. Oh the other hand it's not like the vast majority of money in the bank system doesn't actually exist... Plus living out of bitcoin is actually complicated... Look at El Salvador, things are... more problematic than the non coverage of it shows.\n\nOn a personal level, I'd say what stops them is that Bitcoin has value because it is tied to other currencies (even if we don't want that to be the case). As of right now, I'd not say it is a stretch to say Bitcoin is worth a specific (but variable) amount of some other money... You can do more with money than you can do with Bitcoin (there isn't a whole lot we can do with it yet, surprisingly).   \n\n\nImagine this scenario... One million dollars... If you ask people around, do you think they'd rather have it in cash or in bitcoin? If you ask that in here you'll certainly get a lot of people saying they'd rather have the BTC value... But go on the streets, ask 10 people, do the test... I did. I even got answers like ''what is bitcoin''?  \n\n\nI",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia7ivjo",
                    "author": "DashingSir",
                    "score": 3,
                    "created_utc": 1653668008.0,
                    "response": "What stops a government from printing more money to...\n- Import lots of foreign goods?\n- Build tons of infrastructure?\n- Give every poor person a well paid job?\n- ...\n\nPoliticians and central bankers refusing to learn the answer to these questions is the reason we need to trash fiat and live on crypto.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia7yhec",
                    "author": "OldLatinGuy",
                    "score": 2,
                    "created_utc": 1653674477.0,
                    "response": "The total market value of all the BTC in existence right now is around $545B. While that sounds like a lot, on scale of major nation's budgets it's not a lot. Take out the \"lost\" 15% or so and the number is even smaller. \n\nUSA Federal spending for 2022 is estimated at a little over $6T or roughly 12 times the total BTC in existence against income of about ⅔ to ¾  of that amount. Then add in the various state budgets (the top 10 total just under 1.1T - twice the market value of BTC). California alone spends more than half the BTC market cap.\n\nIf some government did decide to corner the market in BTC, the coins would become so il-liquid as to be useless.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia8allk",
                    "author": "slvbtc",
                    "score": 2,
                    "created_utc": 1653679813.0,
                    "response": "The same thing that stops a shitcoin from printing more money to buy all the bitcoin.\n\nThe more its printed the more it collapses in value, for fiat that means the higher inflation will get.\n\nThe only thing that gives anything value is scarcity, even government currency.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia7g9uj",
                    "author": "NiceDoctorBeam",
                    "score": 2,
                    "created_utc": 1653666950.0,
                    "response": "The fact that they would fail probably is what stops them.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia7cgrv",
                    "author": "Mister_VWP",
                    "score": 1,
                    "created_utc": 1653665387.0,
                    "response": "demand and suply.\n\nliquid btc suple is very litle. And agresive buying make the price go higher then they can print.\n\nIts the same for gold",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia7h1g9",
                    "author": "Mallardshead",
                    "score": 1,
                    "created_utc": 1653667262.0,
                    "response": "Supply and demand. You can't create more BTC if there's more demand. So the supply gets constrained. Mooon. Moooooooooon!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia7hdlc",
                    "author": "MrQ01",
                    "score": 1,
                    "created_utc": 1653667398.0,
                    "response": "Printing money involves inflation, and so the money they are printing will lose value. They also need to buy the Bitcoin from those already owning it. Bitcoin is seen as a hedge against inflation and so would be even more incentivised to hold instead of sell. This would raise the price of Bitcoin up and defeat the purpose of printing money to obtain Bitcoin.\n\nAnd to end it all off, if the government were to somehow prise everybody away from their Bitcoin, all their left with is a coin that apparently nobody else wants, and so all they can do with it is sell it at a major discount - in addition to dealing with the economic impact caused by their inflation of money.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia7i3fn",
                    "author": "Halo22B",
                    "score": 1,
                    "created_utc": 1653667688.0,
                    "response": "So they print enough money that the price of a banana is 100$, do you really think BTC will stay at 30k?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia7jm8n",
                    "author": "walloon5",
                    "score": 1,
                    "created_utc": 1653668313.0,
                    "response": "Bitcoins' price will rise until they can't afford it at any price.\n\nThat'd be pretty cool tbh",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia7ju4c",
                    "author": "savinelli_smoker",
                    "score": 1,
                    "created_utc": 1653668401.0,
                    "response": "I’m not selling.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia7kcyn",
                    "author": "bandoonparade",
                    "score": 1,
                    "created_utc": 1653668612.0,
                    "response": "Nothing stops them from doing this. The reason they don't is because they don't believe it's better money. Thankfully.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia7kr4k",
                    "author": "Geoknysis",
                    "score": 1,
                    "created_utc": 1653668771.0,
                    "response": "Violence.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia7lhm5",
                    "author": "BusinessBreakfast3",
                    "score": 1,
                    "created_utc": 1653669069.0,
                    "response": "The price of Bitcoin will reflect the amount of money.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia7ns86",
                    "author": "_RetroDigital_",
                    "score": 1,
                    "created_utc": 1653670011.0,
                    "response": "People would charge more for their BITCOIN, meaning the Fed would never actually be able to buy them all.\n\n5 apples worth five dollars. They’re the only apples in existence so they slowly become worth 1 million dollars. Fed wants to buy them all. They buy 1 apple for 2 million. The other 4 begin to charge 10 trillion. Government prints more money to afford it…the people selling increase the price to 40 trillion.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia7pb3t",
                    "author": "reggie_crypto",
                    "score": 1,
                    "created_utc": 1653670633.0,
                    "response": "This is the endgame for Bitcoin realizing its ultimate value. Countries will compete to acquire reserves.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia7v0ho",
                    "author": "uncontrollableop",
                    "score": 1,
                    "created_utc": 1653673002.0,
                    "response": "it's not for sale. and they would make us all rich if they tried. so go ahead and try.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia7xn67",
                    "author": "biophysicsguy",
                    "score": 1,
                    "created_utc": 1653674117.0,
                    "response": "In order to buy up total supply they have buy at everyone's sell price. My sell price is  $1 billion per BTC (and even then I'll only sell half), good luck getting all my bitcoin.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia7zqvh",
                    "author": "Jealous_Profile7509",
                    "score": 1,
                    "created_utc": 1653675027.0,
                    "response": "Knowing how civil forfeiture laws work in this country they might already have a significant position in Bitcoin from seizing assets from “criminals.”",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia81j90",
                    "author": "Redhead_Empire",
                    "score": 1,
                    "created_utc": 1653675812.0,
                    "response": "Basic economics",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia83h0z",
                    "author": "klauskinski79",
                    "score": 1,
                    "created_utc": 1653676655.0,
                    "response": "People not putting their bitcoin on the exchange?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia8dpe6",
                    "author": "igadjeed",
                    "score": 1,
                    "created_utc": 1653681214.0,
                    "response": "Scrutiny",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia8i1y5",
                    "author": "CatatonicMan",
                    "score": 1,
                    "created_utc": 1653683190.0,
                    "response": "Well, it's hard to buy something if people aren't selling it.\n\nThey could certainly try, and it would probably work for a bit before people caught on, but at the end of the day there are a lot of die-hard hodlers who simply wouldn't trade their coins for fiat.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia8jagb",
                    "author": "dig_bick_super_man",
                    "score": 1,
                    "created_utc": 1653683754.0,
                    "response": "Same thing that stops them from printing a ton of money to pay back the deficit we’re in.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia7frsm",
                    "author": "MiguelLancaster",
                    "score": -2,
                    "created_utc": 1653666745.0,
                    "response": "dumb question, indeed \n\nthere are two ways to get bitcoin: 1) mine it 2) buy it from someone selling it\n\nare you going to sell your bitcoin to the government?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia7gqm1",
                            "author": "MrQ01",
                            "score": 3,
                            "created_utc": 1653667141.0,
                            "response": "No need to be rude - OPs trying to learn.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia7k9d3",
                                    "author": "MiguelLancaster",
                                    "score": -1,
                                    "created_utc": 1653668572.0,
                                    "response": "they opened with \"dumb question\"",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "ia7g72r",
                            "author": "Blmeitonthewether",
                            "score": 2,
                            "created_utc": 1653666918.0,
                            "response": "? Anyone can buy Bitcoin including the gov…. So how would anyone know who they are selling it to lol?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia7kdf1",
                                    "author": "MiguelLancaster",
                                    "score": 0,
                                    "created_utc": 1653668617.0,
                                    "response": "you can't buy what isn't for sale",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}