{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uzz5ld",
            "title": "Why Bitcoin Only - by Arman the Parman",
            "url": "https://bitcoinnews.com/why-bitcoin-only/",
            "author": "RustinSats",
            "created_utc": 1653781717.0,
            "score": 13,
            "num_comments": 2,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "iadwn5r",
                    "author": "TheChoosey1",
                    "score": 2,
                    "created_utc": 1653793125.0,
                    "response": "A must read if you don't want to be scammed.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uzzb7r",
            "title": "Found a great interview from 2013 about Bitcoin.",
            "url": "https://www.cnbc.com/video/2013/04/01/can-bitcoin-make-it.html",
            "author": "imissyourmusk",
            "created_utc": 1653782234.0,
            "score": 23,
            "num_comments": 8,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "iadpyea",
                    "author": "GemStateStacker",
                    "score": 6,
                    "created_utc": 1653789275.0,
                    "response": "This is the exact segment I listened to and started to invest in BTC. Wow, it’s been a long time!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iadeti3",
                    "author": "rocket_beer",
                    "score": 3,
                    "created_utc": 1653783112.0,
                    "response": "Wow, I guarantee these idiots to his left and right now are crypto believers!\n\nIt’s not really their fault I suppose.\n\nBut I wouldn’t post my ignorance of a new concept on national tv, for all to see for eternity lol.\n\nI’d actually be interested in a follow up of them accepting their ignorance and their change of heart with new knowledge.\n\nCool find, OP 🤙🏽",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iadfj47",
                    "author": "zenfulway",
                    "score": 5,
                    "created_utc": 1653783494.0,
                    "response": "lol great find!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iadgxb6",
                            "author": "Wsemenske",
                            "score": 2,
                            "created_utc": 1653784252.0,
                            "response": "It's actually a common repost.\n\nStill good, but not hard to find",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iadierg",
                                    "author": "zenfulway",
                                    "score": 2,
                                    "created_utc": 1653785075.0,
                                    "response": "Ah, I've just never seen it....",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iaet8kh",
                    "author": "Lower-Ad-8002",
                    "score": 1,
                    "created_utc": 1653818408.0,
                    "response": "I guess this is what happens when you try to shun something down without properly knowing it. We’ll never the less I’m 19, I first heard of bitcoin when it was a dollar a coin and saw it as a good way to buy groceries via cashless payments. Thought wow that’s good, couldn’t convince my parents to buy lmao",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uzz78q",
            "title": "Lightning Network Capacity expands to new all-time high at 3,900 BTC",
            "url": "https://bitcoinnews.com/lightning-network-3900-btc/",
            "author": "RustinSats",
            "created_utc": 1653781860.0,
            "score": 194,
            "num_comments": 30,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "iaer6n8",
                    "author": "Talkless",
                    "score": 16,
                    "created_utc": 1653816535.0,
                    "response": "PUBLIC channel capacity\\*",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iag5jys",
                            "author": "apotekhornan",
                            "score": 4,
                            "created_utc": 1653845102.0,
                            "response": "The network is stronger than ever before.Price will follow soon.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iah3elr",
                            "author": "Massive_Norks",
                            "score": 1,
                            "created_utc": 1653861179.0,
                            "response": "Depends how they measured it.\n\nLighting opening transactions are pretty obvious on chain right now, regardless of the channel being announced or not.\n\nThis will change with taproot adoption.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iadmuuy",
                    "author": "Brainsick001",
                    "score": 15,
                    "created_utc": 1653787535.0,
                    "response": "So isn’t this super small compared to the total circulating bitcoin supply? \n\nJust curious not hating.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iadujtn",
                            "author": "DatBuridansAss",
                            "score": 44,
                            "created_utc": 1653791898.0,
                            "response": "Yes, it's small, but it's also vastly larger than it was just a year or two ago, so lightning is growing really quickly. Also, the point of lightning is to facilitate smaller transactions. If I'm moving enough btc that I'm worried about layer 2 liquidity, I'll just use the base chain anyway.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iah4m27",
                                    "author": "jajunk77",
                                    "score": 2,
                                    "created_utc": 1653861782.0,
                                    "response": "Don't hands up on that, that means miners have an harder time to mine.\n\nWhich means more time spent on decrypting transactions, which causes people to go away from the coin and interest to go down.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iahffmr",
                                            "author": "genericQuery",
                                            "score": 1,
                                            "created_utc": 1653867382.0,
                                            "response": "none of that is correct.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "iaeqlk4",
                            "author": "Outaged",
                            "score": 11,
                            "created_utc": 1653816002.0,
                            "response": "Users don't hold large amounts on Lightning Network. It's more like a checking account, rather than a savings account. For that reason it will always be a low percentage of overall bitcoin supply.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iaff7fm",
                                    "author": "zomgitsduke",
                                    "score": 2,
                                    "created_utc": 1653833105.0,
                                    "response": "I like to think of lightning as \"pocket change\".\n\nLike, I may have $150 in cash on my person, but $40 is owed to someone and someone else owes me $75 and someone else owes me $20.\n\nIt's the quick light cash you would use for a coffee or a snack or something. Maybe it covers a meal.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iafqcnu",
                                            "author": "Outaged",
                                            "score": 1,
                                            "created_utc": 1653838317.0,
                                            "response": "Correct. People running routing nodes might choose to keep more than \"pocket change\" but that's a business risk. Depends on preference.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "iadnc0b",
                            "author": "Wsemenske",
                            "score": 6,
                            "created_utc": 1653787803.0,
                            "response": "For now, bitcoin is mostly a community of hodlers",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iaeh979",
                            "author": "CallingVoid",
                            "score": 2,
                            "created_utc": 1653807679.0,
                            "response": "Yeah, it's still very young of course but I don't see that big difference changing tbh. It's for the small transactions after all.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iaffam3",
                                    "author": "zomgitsduke",
                                    "score": 2,
                                    "created_utc": 1653833148.0,
                                    "response": "I'd see it changing when we start moving towards micro payments.\n\nNot exploding to like 4 million btc. But definitely 100k btc.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "iaemwjx",
                            "author": "JCStuff_123",
                            "score": 2,
                            "created_utc": 1653812650.0,
                            "response": "I would say these are circulating quickly as lightning is seamless and instant. So these btc change hands often. While 50% of the supply sits in hands unmoved. Great to see it growing",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iafddtx",
                            "author": "Kangaroo_Low",
                            "score": 2,
                            "created_utc": 1653832201.0,
                            "response": "Yep,  and it's great.  Anything greater,  we can just settle on chain!\n\nLightning eally is the best.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iafex7o",
                            "author": "zomgitsduke",
                            "score": 1,
                            "created_utc": 1653832967.0,
                            "response": "Yeah. Incredibly small.\n\nBut also the network is ideal for smaller transactions (at least for now).\n\nHaving a network size of 390 BILLION Satoshi for transfer is a little more recognizable as \"oh wow that's a decent sized network\" when the transaction size probably sits between 100 and 1,000,000 satoshis per transaction.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iaga0gr",
                    "author": "Ashkon1996",
                    "score": 3,
                    "created_utc": 1653847150.0,
                    "response": "Lightning Network has the capability to do millions of $BTC transactions a sec with near to 0 fees.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iagx4ho",
                            "author": "_devast",
                            "score": 1,
                            "created_utc": 1653858079.0,
                            "response": "No. It *will* have, probably. And i hope the 0 fee part was a joke 😀\n\n-a lightning node operator",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iaei4fb",
                    "author": "homad",
                    "score": -7,
                    "created_utc": 1653808419.0,
                    "response": "There are 274,451 Bitcoin in the Wrapped Bitcoin contract \\[WBTC\\]",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaezv0d",
                            "author": "uszeraj",
                            "score": 6,
                            "created_utc": 1653824021.0,
                            "response": "Lightning is for payments not for shitty ponzinomics. If you think this is important might as well invest in Luna2 or something.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iaf1a7o",
                            "author": "diradder",
                            "score": 6,
                            "created_utc": 1653825055.0,
                            "response": "Let me rephrase this: There are idiots who sold 274,451 bitcoins to BitGo (or their partners) for a centralized and KYC/AML-gatekept shitcoin [WBTC] on Ethereum. \n\nNow they have to spend few dollars worth of ETH each time they want to interact with it (just Ethereum things...), and they must pray a centralized entity will sell them BTC back when they want to \"burn\" their shitcoin to get back (some) BTC.\n\nMeanwhile BTC on Lightning are still bitcoins, not subject to KYC, they backed by Bitcoin's blockchain security, and anyone can close the LN channels they have opened without the permission of any central authority.\n\nNext time try to compare things that are comparable.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iag4b3p",
                                    "author": "frozengrandmatetris",
                                    "score": 3,
                                    "created_utc": 1653844536.0,
                                    "response": "you guys get really mad when people pretend bitcoin layer 2 solutions don't exist and then you go ahead and pretend that bitcoin's biggest competitor has no layer 2 solutions, despite the fact that they not only exist but have higher TVL and daily transaction count. no you do not have to pay a few dollars worth to transact wrapped bitcoins, they are on layer 2 solutions. I also know of an alternative to WBTC that isn't custodial (thanks to hash time locked contracts) and still has more bitcoins held in it than the lightning network. I'm not going to name it here because I don't want to be misconstrued as promoting altcoins. I will never promote altcoins here because it's against the rules. please stop displaying so much open hostility and misinformation when discussing bitcoin's competition. it's not helping your own cause.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iag67ev",
                                            "author": "cpt_charisma",
                                            "score": 3,
                                            "created_utc": 1653845399.0,
                                            "response": "Something like 99.999% of bitcoin's competition is either misleadingly marketed or outright fraud.  It is appropriate to be hostile toward these practices.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iaghcon",
                                                    "author": "frozengrandmatetris",
                                                    "score": 1,
                                                    "created_utc": 1653850570.0,
                                                    "response": "this doesn't change the facts. the fact remains that the lightning network is not the most popular layer 2 solution or even the most popular bitcoin scaling solution. if instead of acknowledging the situation and asking \"what can be changed to better meet the needs of the consumer so they choose our product\" you just eat hot chip and lie, the situation is not likely to change very much. the exact same technology that enables bitcoins to be deposited into the lightning network also enables them to be deposited into other networks and you have to deal with it before it deals with you. stop looking the other way.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "iafonlp",
                                    "author": "dawiepoolman",
                                    "score": 1,
                                    "created_utc": 1653837539.0,
                                    "response": "fucking A",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "iaeqasi",
                            "author": "ForcedLoginIsFacism",
                            "score": 2,
                            "created_utc": 1653815734.0,
                            "response": "What is this about in connection with Lightning",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iaetz8q",
                                    "author": "TheLowestBidder",
                                    "score": 3,
                                    "created_utc": 1653819065.0,
                                    "response": "illustrated with a Venn diagram with wbtc and ln it's the space where they do not overlap at all",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iah3swx",
                    "author": "eqleriq",
                    "score": 1,
                    "created_utc": 1653861377.0,
                    "response": "For reference, this is the equivalent of a single high-end Manhattan condo (not even the most expensive ones).",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uzz7t8",
            "title": "Almost 60% of Bitcoin mining now on sustainable energy: Bitcoin Mining Council",
            "url": "https://bitcoinnews.com/bitcoin-mining-sustainable-energy/",
            "author": "RustinSats",
            "created_utc": 1653781911.0,
            "score": 165,
            "num_comments": 27,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "iadx6qz",
                    "author": "odonnellnoel",
                    "score": 39,
                    "created_utc": 1653793443.0,
                    "response": "Next narrative will be that BTC is wasting renewable energy. Wait and see...",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaeoost",
                            "author": "oldskoolr",
                            "score": 8,
                            "created_utc": 1653814275.0,
                            "response": "Can't be wasted if that energy is negatively priced.\n\nIt's a lazy trope that's easily debunked.\n\nhttps://twitter.com/ShaunEnergy/status/1507862059169419267",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iafdxyg",
                                    "author": "vncentvga",
                                    "score": 2,
                                    "created_utc": 1653832478.0,
                                    "response": "The more Bitcoin goes down, the more bullish I become.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "iaehgs6",
                            "author": "Bitcoin__Hodler",
                            "score": 2,
                            "created_utc": 1653807852.0,
                            "response": "This",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iaegiak",
                            "author": "Jacobgraham1738",
                            "score": -7,
                            "created_utc": 1653807038.0,
                            "response": "Exactly, I'm not sure if this hyper promotion of btc using renewables is a good idea.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iafuwlj",
                            "author": "Pgj88",
                            "score": -4,
                            "created_utc": 1653840348.0,
                            "response": "Just ban POW and use something else which already exists and is already carbon neutral .\n\nthen don't need to do anything.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iadfyki",
                    "author": "yasashi-neko",
                    "score": 12,
                    "created_utc": 1653783725.0,
                    "response": "elon should start trolling himself on this",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iag5du4",
                    "author": "cpt_charisma",
                    "score": 3,
                    "created_utc": 1653845023.0,
                    "response": "While this is somewhat useful in countering the 'bitcoin is bad for the environment' people, it's mostly irrelevant.  The more important number is net new generation devoted to bitcoin.  No one has tried to track it that I'm aware of, but it should be close to zero - maybe around 20% of power used by bitcoin.\n\nThe reason is that bitcoin miners have an incentive to use the cheapest electricity they can.  That usually means buying electricity that is already being generated, but not used.  I forget the exact number, but something like 20% of electricity generated isn't used for anything at all.  It's not really wasted, because you have to have extra capacity for the grid to work properly.  But it is available for use cheaply if you have a load that can immediately shut down when the power is needed elsewhere.  There are also situations where power is produced, but can't be transported for various reasons.  Bitcoin mining is perfect for both of these situations.\n\nBitcoin mining uses a lot less electricity than it appears to because most of it just uses unneeded or unusable electricity.  We need to figure out exactly what the numbers are here and use those if we want to debate environmentalists.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iadjkj5",
                    "author": "SmoothGoing",
                    "score": 9,
                    "created_utc": 1653785718.0,
                    "response": "Self watching self back patting group without accountability or any kind of power can claim whatever looks good for themselves.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iafpr3q",
                            "author": "diradder",
                            "score": 3,
                            "created_utc": 1653838039.0,
                            "response": "> Self watching self back patting group without accountability or any kind of power can claim whatever looks good for themselves.\n\nFunny thing is that this description could apply to the group of *journalists* who keep publishing FUD about Bitcoin when it comes to the environment. This kind of stuff will happen on both sides, it's mostly noise.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iado7np",
                            "author": "itsthesecans",
                            "score": -1,
                            "created_utc": 1653788293.0,
                            "response": "Bitcoiners are a prickly bunch…",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iaedvnh",
                                    "author": "CallingVoid",
                                    "score": 9,
                                    "created_utc": 1653804866.0,
                                    "response": "Bitcoiners are suspicious of 'councils' and 'foundations' for good reason. They rarely have the interests of the protocol at heart, they're usually only interested in enriching themselves. \n\nOne thing is certain though, they are definetly not needed for bitcoin to function.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iafldwb",
                    "author": "yhfgdf",
                    "score": 2,
                    "created_utc": 1653836071.0,
                    "response": "The more bitcoin goes down, the more bullish I become.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iadykn5",
                    "author": "nullama",
                    "score": 2,
                    "created_utc": 1653794278.0,
                    "response": "They didn't ask about how I power my USB miner, so not sure about those numbers....",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iagck9x",
                            "author": "Dont_Say_No_to_Panda",
                            "score": 1,
                            "created_utc": 1653848330.0,
                            "response": "Which one do you use?",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iafdbrk",
                            "author": "lenkaprius",
                            "score": 0,
                            "created_utc": 1653832173.0,
                            "response": "Bitcoin Maximalists have figured it out.Everyone else is just catching up .",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iaeijq1",
                    "author": "sylsau",
                    "score": 2,
                    "created_utc": 1653808792.0,
                    "response": "Bitcoin is ahead of the curve when it comes to using renewable energy. That's a fact.\n\nElon Musk should keep his commitment to support BTC payments by Tesla.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaeqlix",
                            "author": "vengefulspirit99",
                            "score": 2,
                            "created_utc": 1653816001.0,
                            "response": "You seriously think elon gives a shit about btc outside of making money off it?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iai4tm0",
                                    "author": "ahopedog",
                                    "score": 1,
                                    "created_utc": 1653880538.0,
                                    "response": "I think part of the reason I even still have a Mac is because of iMessages",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iaeo0q6",
                    "author": "ElephantsAreHeavy",
                    "score": 0,
                    "created_utc": 1653813664.0,
                    "response": "\"bitcoin mining council\" like we need a centralized entity to pool our miners...",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaftvjy",
                            "author": "RewtDooDoo",
                            "score": 2,
                            "created_utc": 1653839900.0,
                            "response": "It's not really centralized or even a profitable entity, it's simply a coordination of public miners (anyone can join), to share and pursue a more environmentally friendly future for bitcoin mining. There was previously no system in place to measure sustainability so these companies got together to establish one and combat the endless ESG FUD bitcoin endures.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iaesrl7",
                    "author": "Crypto_Babylon",
                    "score": -1,
                    "created_utc": 1653817981.0,
                    "response": "Oh so there is a council now? I thought it's decentralized? I never voted for this, hypocrites.\n\nPlus it should be audited externally by a regulated government entity, not some hobo council members I never heard of...",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaeypt2",
                            "author": "mbrochh",
                            "score": 4,
                            "created_utc": 1653823136.0,
                            "response": "the council has an incentive to make themselves look good.\n\na government entity has an incentive to make bitcoin look bad.\n\nthis can only be done by people publishing papers on the state of bitcoin's energy usage. those papers need to be peer reviewed and discussed. may the truth come to the surface for all to see and verify.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iafa3jl",
                    "author": "Simple_Yam",
                    "score": 1,
                    "created_utc": 1653830499.0,
                    "response": "The mining council represents 50% of the network. So it's 60% of 50% or around 30% in total if everything else is not clean.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iag4wvm",
                    "author": "Lagavulin",
                    "score": 1,
                    "created_utc": 1653844811.0,
                    "response": "Norway legislature is pushing to ban Bitcoin mining because ‘dirty energy’.  Norway uses 100% renewables.\n\nIts not about energy, its about protecting the fiat ponzis.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iahc159",
                    "author": "MrRGnome",
                    "score": 1,
                    "created_utc": 1653865588.0,
                    "response": "Fuck the Bitcoin Mining Council, may they disband and their participants be considered bad actors.\n\nBitcoin was always renewable. They have changed their misinformation PR bullshit now that they control more of the market.\n\nOrganized miner coalitions go against Bitcoin inherently. Reject these people and ignore them. Stop making posts like this. Stop mentioning them. Stop giving them or their participants any attention.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}