{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "sofljl",
            "title": "What after if all countries accept Bitcoin as legal tender?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/sofljl/what_after_if_all_countries_accept_bitcoin_as/",
            "author": "crazyfreaky7",
            "created_utc": 1644418813.0,
            "score": 23,
            "num_comments": 53,
            "subreddit": "BitcoinBeginners",
            "selftext": "Hi All,\nJust curious, even if all countries accept Bitcoin as legal tender how can government see the transaction and tax on the gains?",
            "stickied": false,
            "comments": [
                {
                    "id": "hw9q05o",
                    "author": "selfawarepie",
                    "score": 8,
                    "created_utc": 1644437493.0,
                    "response": "At that point, we just sit back and enjoy our flying unicorns and dicks that suck themselves.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hw8s115",
                    "author": "bitusher",
                    "score": 6,
                    "created_utc": 1644424935.0,
                    "response": "Governments can always collect taxes elsewhere like import tarrifs , sales taxes , and property taxes if collecting income tax and capital gains taxes becomes more difficult",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hw8t51v",
                    "author": "afternooncrypto",
                    "score": 4,
                    "created_utc": 1644425347.0,
                    "response": "Fuck if I’m paying tax on buying something and on profit before that transaction. Where I live VAT is 20% and I think capital gains is 20% as well so it 40% in total for every transaction. I guess this would have to change because that is ridiculous.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hw91jom",
                    "author": "0x1a3c3e7",
                    "score": 3,
                    "created_utc": 1644428407.0,
                    "response": "Because governments have passed laws that require businesses to report transactions to tax authorities.  These laws are known as AML and KYC which stand for Anti-Money Laundering and Know Your Customer.  These laws were necessitated by income tax laws that give governments a license to extort money from us and an excuse to intrude on every aspect of our personal finances.  If we had a consumption tax instead, like the [fair tax](https://www.youtube.com/watch?v=sUxBJ7n0T8U&list=PL6BB749E90D85820B), there would be no extortion racket and no crimes of money laundering or tax evasion.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uinwix",
            "title": "If you own a bitcoin that you bought for $1,000 and can now sell it to pay off $35,000 in debt, should you?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/uinwix/if_you_own_a_bitcoin_that_you_bought_for_1000_and/",
            "author": "Nohoula",
            "created_utc": 1651720220.0,
            "score": 165,
            "num_comments": 322,
            "subreddit": "BitcoinBeginners",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i7dta44",
                    "author": "Frammmis",
                    "score": 274,
                    "created_utc": 1651721805.0,
                    "response": "I would. That's a staggeringly profitable investment you made and paying off your  debt would lock in your gains in a very positive way. And if a 3500%-4000% return isn't good enough for you, then no one can help you.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7e70cq",
                    "author": "EdwardAlphonse31011",
                    "score": 116,
                    "created_utc": 1651730231.0,
                    "response": "This sub will tell you that you should be buried with your btc wallet. #HODLfromthegrave. But if there's ever been a good reason sell btc, climbing your way out of a huge debt has got to be the perfect reason.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7e0u5e",
                    "author": "belizeans",
                    "score": 68,
                    "created_utc": 1651726040.0,
                    "response": "Got to pay capital gain taxes",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7f107w",
                            "author": "Derreus",
                            "score": 34,
                            "created_utc": 1651753407.0,
                            "response": "He's right about this, but if you're not looking to retire any time soon you should use it.\n\nI feel like people are too afraid to use their gains in times of need. I just recently decided to start a business venture, and used my gains to do that, though I probably could've afforded it outright. Now it feels like it was free (minus the cgt).",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7dquy1",
                    "author": "hairyscrotes",
                    "score": 61,
                    "created_utc": 1651720548.0,
                    "response": "What kinda debt? High interest or fixed 5% or under ?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7esyhv",
                            "author": "FinanciallySmarter",
                            "score": 26,
                            "created_utc": 1651748450.0,
                            "response": "This is the question that you need to know before you can really answer your question. If high interest debt (I.e., credit card) then absolutely get rid of that debt ASAP. If fixed, low interest debt, look at whether your able to make more else wise than that 5% or below. As a note, being debt free isn’t always good, BUT from a mental perspective it feels GREAT! Good luck on your journey!!!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7ez72r",
                                    "author": "DigitaleDukaten",
                                    "score": 7,
                                    "created_utc": 1651752388.0,
                                    "response": "I have 40k student dept with no interest rates. I dont fucking care to wait as long as possible, i have 35 years to pay it off (The only issue would be by getting a mortgage, but this ''loan'' is actually by far the least worrying loan someone can have)\n\nmost graduates in my environment strongly hold on to the belief that ''student dept = bad for mental health'', and that you should pay off this dept asap.\n\ni always end up in a discussion with them, telling them how much better it would be to wait as long as possible, only to get the same damn answer: ''but you can never be 100% sure about the future'' (sometimes pointing to the deflationairy period of 1930's for example)\n\n&#x200B;\n\nits stupid. but yeah, atleast WE know.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i7ezxjn",
                                            "author": "FinanciallySmarter",
                                            "score": 9,
                                            "created_utc": 1651752813.0,
                                            "response": "I don’t necessarily think it is stupid one way or another not to pay off your student debt, nor is it a one size fits all world anymore. If your risk tolerance is higher, and you believe you are making more than paying off your student debt right away, then that is a reasonable plan.  My wife carried high credit card debt to pay for her college education as she wasn’t eligible for school loans. Many would have scolded her for what she did, however once she and I had jobs after college, we quickly paid off those debts and don’t regret it one bit today. Everyone’s risk tolerance, as well as mental well-being around those risks are different - therefore, it’s important not be bullish one way vs. another. Look deep at your financial situation, talk it through, and make a decision that is best for YOU, and YOUR financial situation.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i7f1k4c",
                                                    "author": "DigitaleDukaten",
                                                    "score": 6,
                                                    "created_utc": 1651753706.0,
                                                    "response": "\\> My wife carried high credit card debt to pay for her college education as she wasn’t eligible for school loans.\n\nMy god, are you guys american? why the hell couldn't she get a student loan?... Im so sorry to hear this. But, you guys dealt with it like adults fortunately. I think that mitigating credit card dept is incredibly fucked up, and it sometimes seem like people in the states tend to view it as something normal (im from western europe btw, to give you an perspective)\n\n&#x200B;\n\nBut yeah I highly agree with everything you said. OP, we need more info before we can even ask this question.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i7f7tqp",
                                            "author": "justpeace0",
                                            "score": 5,
                                            "created_utc": 1651756835.0,
                                            "response": "How on earth did you score no interest student loans? Are you in USA? My interest rates on US Dept of Ed loans were several points higher than my mortgage.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i7dr1jt",
                    "author": "ndgoLiberty",
                    "score": 30,
                    "created_utc": 1651720643.0,
                    "response": "You could maybe incrementally sell it to pay your monthly payments. But selling that much bitcoin at 40k?\n\nWHY.\n\nEdit: I just realized why. If your debt has interest rates in the double digits… pay off a big chunk when you have the funds.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7dzlxq",
                            "author": "Juice2040",
                            "score": 13,
                            "created_utc": 1651725279.0,
                            "response": "This ⬆️ if you just sell enough bitcoin to make your monthly payments the interest on the loan is significantly less then the yearly increases in the value of bitcoin. So your bitcoin increases in value quicker then the interest on your loan increases and you earn money and pay off your loan with no actual input from your regular salary.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7dv3tz",
                    "author": "Astropin",
                    "score": 4,
                    "created_utc": 1651722766.0,
                    "response": "WAY too many variables to consider...good luck. Personally if I had ANY other means to pay down that debt (even if it took time) I would keep the bitcoin.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7dwe0u",
                    "author": "BTCMachineElf",
                    "score": 13,
                    "created_utc": 1651723456.0,
                    "response": "I would work to pay off the debt. You likely won't ever be able to re-buy that bitcoin.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7drdrr",
                    "author": "ArchiMode25",
                    "score": 6,
                    "created_utc": 1651720818.0,
                    "response": "That should be your decision and anyone else who's involved in the debt. \n\nMy personal opinion is that debt is no fun and can become more costly if interest is due. There are multiple ways to handle debt like that. You should be making regular payments already. There is the possibility of lower interest loans to pay off higher interest loans. You could always sell half of your holdings to pay off half the debt. You could get a 2nd job to pay off the debt also. Many possibilities. \n\nThe price of BTC could sky rocket one day but it could also drop 50% in a few weeks. There is a large possibility that BTC will continue to grow and have these cycles. But debt is stressful and can be very costly.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7dqyr0",
                    "author": "Deep-Jump-803",
                    "score": 5,
                    "created_utc": 1651720603.0,
                    "response": "Do you have to exactly sell everything btc you own? If not only sell what's necessary",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7drn83",
                    "author": "Boutitj",
                    "score": 3,
                    "created_utc": 1651720951.0,
                    "response": "Ride it out until after the 2024 halving and see where it’s at",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uimz6l",
            "title": "Enable whitelist on your exchange as a security precaution. It could protect you from a loss.",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/uimz6l/enable_whitelist_on_your_exchange_as_a_security/",
            "author": "bItCoinerBitch",
            "created_utc": 1651717270.0,
            "score": 3,
            "num_comments": 29,
            "subreddit": "BitcoinBeginners",
            "selftext": "Enabling whitelist feature on exchange is a simple way to protect yourself from a potentially losing your funds do to compromised credentials.  By the time you realize you have been hacked the bitcoin has already been transferred out. Usually within minutes. Even if you don't want to store your BTC with a hardware wallet you should still enable whitelist even if you leave your withdrawal address list blank. This effectively buys you time. Whitelist is basically pre approving addresses you own.\n\nAdditionally you should take the time to setup a hardware wallet and protect your recovery seed. By doing this you can generate a wallet address that you own and store it in your exchange account and then add it to WHITE LISTING(basically a pre approved receiving address). You white list the address so that  in the future if your account gets hacked. The hacker will be unable to add a new receiving address instantly and transfer funds out. It can buy you valuable time to get your account locked down and to get control back of your account.\n\nWhen you enable whitelist on Coinbase it will put a 2 day hold on any new addresses being added to the account. Gemini it buys you a 7 day hold.\n\n[Coinbase whitelist help here](https://help.coinbase.com/en/pro/managing-my-account/other/how-does-whitelisting-in-the-address-book-work)\n\n[Gemini whitelist help here](https://support.gemini.com/hc/en-us/articles/360001411543-What-is-an-Approved-Address-)\n\nIn my opinion you should create a unique email for each exchange you use. So that if the email shows up in a data breach you know it was most likely compromised in a data breach from the exchange. Use 2fa hardware key like YUBIKEY for 2fa. Dont use SMS for 2fa.",
            "stickied": false,
            "comments": []
        }
    ]
}