{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "utl1jt",
            "title": "Trying to start mining bitcoin",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/utl1jt/trying_to_start_mining_bitcoin/",
            "author": "PralineAggressive558",
            "created_utc": 1653019831.0,
            "score": 0,
            "num_comments": 23,
            "subreddit": "BitcoinBeginners",
            "selftext": "How much money do you need to start mining bitcoin . I have 2000$ ready to invest in equipment, is this enough?",
            "stickied": false,
            "comments": [
                {
                    "id": "i9akl8t",
                    "author": "solidepic",
                    "score": 3,
                    "created_utc": 1653023628.0,
                    "response": "I’d say you have a decent amount to get started. Have you started to think about how you will buy power?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9al08f",
                            "author": "PralineAggressive558",
                            "score": 3,
                            "created_utc": 1653023920.0,
                            "response": "Could you maybe elaborate on buying power , I know you have to determine your profitability on how much power you use to how much you’re mining . Is that what you’re saying . Sorry again I’m still learning the terms and everything",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9alqvl",
                                    "author": "solidepic",
                                    "score": 2,
                                    "created_utc": 1653024434.0,
                                    "response": "I’m still learning myself, but you will have to plug your machines into a socket where you want to be based.\nThis makes you tied to your local powersupplier, generally what miners tend to do is invest in power production, and not nececeraly where they live to offset the cost of consumption.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9anhfv",
                                            "author": "PralineAggressive558",
                                            "score": 2,
                                            "created_utc": 1653025699.0,
                                            "response": "I’m thinking of doing a mix of my own household power and solar . I have a family member who’s an electrician , so I’m planning on setting up two solar panels to store and supply most of energy needed for my rig",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9ay86e",
                                                    "author": "jjkoto",
                                                    "score": 3,
                                                    "created_utc": 1653034591.0,
                                                    "response": "Use the $2000 to buy Bitcoin. Sell the power back to the power company. Take the income from the solar panels and… buy Bitcoin. You will be better off than if you try to mine. \n\nYou’re welcome.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9b0sd5",
                                                            "author": "solidepic",
                                                            "score": 1,
                                                            "created_utc": 1653036899.0,
                                                            "response": "This is the Min/Max approach, also building your solars where you can maximize profit. Here we have 4 electrical zones and the cheapest zone is 10-15 times cheaper than the more southern expensive zones.\n\nBut you can just do it for a small profit, or just for fun. It’s not always about minmax",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "i9ee4wy",
                                                            "author": "Special_Carrot_1884",
                                                            "score": 1,
                                                            "created_utc": 1653095739.0,
                                                            "response": "Actually other then bitcoin I think gold is also worth investing as well.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i9b0v7d",
                                                    "author": "solidepic",
                                                    "score": 1,
                                                    "created_utc": 1653036969.0,
                                                    "response": "Sounds like an excellent plan, however owning something that can yield higher returns then the actual solars is more preferable from a maximizing profit perspective.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9atqzf",
                    "author": "cyberplanta",
                    "score": 3,
                    "created_utc": 1653030609.0,
                    "response": "A s9 antminer, is about $400, it consumes 1500w, but you can run it at lower wattage if you use braiins os. I do it as a hobby, to learn and stack some non KYC sats for the future… give it a try!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9c8kj9",
                    "author": "DudeIncogneto",
                    "score": 2,
                    "created_utc": 1653060282.0,
                    "response": "A new Bitmain s19 is around 13,000 dollars. If you want to be somewhat profitable and electricity is not too expensive this is what you would want",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9aeqqg",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653019831.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ata6d",
                    "author": "nullama",
                    "score": 1,
                    "created_utc": 1653030221.0,
                    "response": "What's your end goal?\n\nCan you handle a huge spike in power consumption, extremely loud fans, and huge amounts of heat? You also need to service them and keep cleaning, replacing them, etc.\n\nIf you just want to play around a bit at home, and see how it goes, I would recommend you get an [Apollo BTC](https://shop.futurebit.io/products/pre-order-apollo-btc-a-bitcoin-asic-miner-and-desktop-class-computer-running-a-full-node-and-much-more-batch-1-ships-in-late-april-to-may?variant=33404796928099).\n\nIt's not going to give you amazing returns, but it's quiet, consumes less than 300W of power, and can be run very efficiently. Plus it looks nice.\n\nYou can earn a few thousand sats a week with this, probably slightly more than that electricity costs you to run it.\n\nIt would be a good learning machine, and you'll then be able to decide to go with the big leagues with all the noise and heat and power consumption they need, or not.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ato2t",
                            "author": "PralineAggressive558",
                            "score": 1,
                            "created_utc": 1653030541.0,
                            "response": "The goal is just to create some passive income , I have a basement that’s stays cool through the year and I’ve built computers so maintenance and setting up a cooling system are not an issue . Is ASIC the only profitable form of mining or can GPU mining be more profitable with the flexibility of crypto currency’s that you can mine. I know GPUS are less power efficient but I would be able to get two or three strong GPUS",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9bb9fv",
                                    "author": "MuchTemperature6776",
                                    "score": 1,
                                    "created_utc": 1653044870.0,
                                    "response": "Mining isn’t going to create any income for you unless you’re part of a farm, either with your own farm or as a part of a group of people who mine together and split the profits.\n\nIf you actually just want to earn money from Bitcoin then investing into it is probably better. Just DCA and HODL.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9bn3xg",
                                    "author": "bitusher",
                                    "score": 1,
                                    "created_utc": 1653051239.0,
                                    "response": "GPU mining ended in early 2013 for bitcoin. You should only mine BTC if you do at least 100 hours of research - https://bitcointalk.org/index.php?board=14.0 As mining is very professional\n\nUnderstand difficulty https://en.bitcoin.it/wiki/Difficulty\n\nAvoid cloud mining (Most are ponzis, fractionally reserve mine, or charge too high fees = you will never ROI). In some jurisdictions cloud mining is considered an illegal security as well  \n\nUse an accurate calculator like this and set at least 4% difficulty increment or higher- https://btc.com/tools/mining-calculator\n\nand only use modern ASICs like \n\n- https://canaan.io/store/ \n \nNot following these guidelines means you will almost be guaranteed to lose money\n\n\nhttps://www.econoalchemist.com/post/home-mining-for-non-kyc-bitcoin",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9bjdtz",
                    "author": "igadjeed",
                    "score": 1,
                    "created_utc": 1653049406.0,
                    "response": "Bitcoin mining is not for beginners  \nhttps://www.econoalchemist.com/post/home-mining-for-non-kyc-bitcoin",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9c73g1",
                    "author": "never-give-up-every1",
                    "score": 1,
                    "created_utc": 1653059697.0,
                    "response": "do we earn more at mining rather than Holding?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9bdycm",
                    "author": "jcarbdbb",
                    "score": 0,
                    "created_utc": 1653046495.0,
                    "response": "I don't think it's enough for you to get a reasonable amount of passive income if you factor all the expenses. Best bet is to invest in a mining company, your capital will go farther than starting alone. Good luck.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}