{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "utb4qr",
            "title": "What makes Bitcoin supposedly better than most of the altcoins?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/utb4qr/what_makes_bitcoin_supposedly_better_than_most_of/",
            "author": "SwurveMan",
            "created_utc": 1652988515.0,
            "score": 5,
            "num_comments": 27,
            "subreddit": "BitcoinBeginners",
            "selftext": "First mover advantage maybe? Perhaps PoW?",
            "stickied": false,
            "comments": [
                {
                    "id": "i99akbi",
                    "author": "bitcoin_barry",
                    "score": 9,
                    "created_utc": 1652999321.0,
                    "response": "There are a lot of reasons why Bitcoin is better, but I will just try to show you how to identify what is the best.\n\nThe way I measure success is consensus. The more consensus the technology incorporates, the more confidence I have that it actually represents people, that people are invested in the technology and it has a chance of building a bigger and bigger yet sustainable economy.\n\nMaking changes to Bitcoin is hard, and that is good. It means that there are many chefs in the kitchen and guess what, I'm there too. I run a node. By running a node, I can keep an eye on what features are coming in and I can choose to update or not update to incorporate that feature.\n\nThe funny thing is, I don't really need to read the code, I just listen on reddit, twitter, and read the release notes before I update because if there is anything worth yelling about, there are so many of us, someone will find it before me.\n\nYou'll find with all the other shitcoins, that no one gives a rats ass about running a node, and if they do, they don't mind using AWS or Google Cloud Computing to host their servers online. When features come out, it's usually backed by an official development team and follows a roadmap. The users of the shitcoin don't really get any say in how it works, even if they are super smart. I'm sure shitcoiners will make you feel good about sharing an idea, but they are the gatekeepers, It is a master-client relationship and you are the client.\n\nBitcoin was not the first attempt at e-money, but it was the first to survive. Everytime someone attempted to create a digital cash, governments and regulations took it down. Satoshi identified that the problem was centralisation. If there is someone to target, the government can shut you down using force and the legal system, and the technology cannot continue because it was centralised and relied on you/your company.\n\nBitcoin has survived because there is no one to target. There is no core development team (although there is a core implementation of the software), there is no CEO, and even Satoshi (which was a pseudonym) has disappeared. It doesn't need a central authority because of how it was designed around energy use. It costs time and energy to have a say in how bitcoin should evolve, there is no roadmap, and the only way to make a change is to back it by other people's time and energy -- by forming a consensus with the rest of us.\n\nEurope wants to make Bitcoin use Proof of Stake... let them, they change the code, the rest of us won't change our code, and there will be this other blockchain. That's kind of how BCash came about. The thing is, it won't be EU's bitcoin that becomes popular and gains all the market value, and since the rest of us didn't change our code, Bitcoin never went away.\n\nThat is the power of a decentralised technology. It won't change unless everyone wants it to change in harmony. This is the idea of control. This is the idea that no one controls Bitcoin. Even if you are the most wealthy Bitcoiner, even if you are Satoshi and came back with proof, you have no control over Bitcoin and by now, no one cares what Satoshi would have thought because it is already a cocktail of so many individuals' work.\n\nForking Bitcoin does have negative effects on the price of Bitcoin; for some time, there will be plebs on the fence not knowing which one is the right one. I mean, unless something is an obvious attack, there will be people on either side supporting their idea, but the one that has the most support will win out. While all this is happening, the price and hash rates will fluctuate between the two.\n\n\"First mover advantage\"? No, BCash forked from Bitcoin, it's genesis block is the same as Bitcoin's, they are basically twins but the reason BCash has its birthday later than Bitcoin is because we mark its birth from when Bitcoin forked. BCash could have become Bitcoin, but the market spoke and keeps on speaking even today, BCash has no chance of coming back up and producing more proof of work than Bitcoin even though many would like to believe it will.\n\nEvery other coin that exists, is a rogue trying to re-invent the wheel instead of joining the Bitcoin economy and working within the constraints of consensus. They are anti consensus. They boast that they solved the double spend problem, but they haven't. Just because no one has allowed a double spend, doesn't mean that no one has the power to do so. These other shitcoins have a leader and that leader has power over their users, enough to allow double spends.\n\nETH is a fork of ETC (ironically named \"Etherium Classic\" like \"Bitcoin Cash\" to make it seem like the failed other coin). It is ironic because ETH rolled back the blockchain and used double spending to recover funds stolen in a massive hack caused by buggy code. Someone came in, made a judgement call and played executioner. ETC continued as if the hacker stole those coins fair and square. The hackers followed the rules and effectively took advantage of someone's really bad smart contract design. Before the fork, ETH's motto was \"code is law\".\n\nSomehow, the fork that proved that the double spend problem was not solved was the one that gained all of the market share. If the original fork remained the winner, then bitcoiners might have had more respect for it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i997mw7",
                    "author": "bitusher",
                    "score": 6,
                    "created_utc": 1652997942.0,
                    "response": "Bitcoin is the only Cryptocurrency proven itself to be secure and decentralized\n\n99% of altcoins/ICOs are scams and its difficult to evaluate them unless you know the history of these projects and are a programmer yourself so can evaluate their claims\n\nAltcoins will come and go as we have always seen but bitcoin having a first mover advantage means that it is has the most network effect and best chance of surviving longterm \n\nOne of the primary reasons Bitcoin was created was to have a sound monetary policy and digital scarcity , and being a multicoiner undermines all of this\n\nUsing wallets and software that supports multiple coins is confusing  and can lead to mistakes where you can lose money and makes the software far more insecure with a wider attack surface and potential for bugs and exploits \n\nWhen looking at the long term graphs , most altcoins pump and dump and lose value relative to Bitcoin. \n\nGetting involved with altcoins forces you to spend a ton of extra time learning complex and obscure projects \n\nScammers prefer to target people that use altcoins as we saw with the ICO craze because Bitcoiners tend to have more experience and be more skeptical to evaluate their claims\n\nBeing involved in altcoins usually means you don't have long term time preferences and simply want to speculate short term which many people will consider a character flaw because you are more of a gambler \n\nBitcoin has an uphill battle as is so any distractions weakens the possibility of it becoming a global p2p currency (Bitcoin is the best cryptocurrency that can achieve this with its network effect and roadmap)\n\n\n-------------\n\n100% pure proof of work coins are completely different.\n\n1) They do not legally fit the Howey test as a security. This is not merely an opinion but tested case law in the USA. \n\n2) A similar amount of effort in securing the coin must be invested to be rewarded the coin creating long term incentives in the project and making it very costly to attack it. Miners who have sunk infrastructure costs on mining a particular algo, especially with ASICs\n\n3)  Fair Coin Distribution.  No scammy ICO , premine or instamine is created and miners are forced to sell most of their coins to cover the expense (mainly ASICs + electricity) which allows a fair distribution and competition in the minting process.\n\n4) Since mining BTC is so competitive, profit margins are typically thin and thus new entrants that either use a better tool to mine (ASIC) or find cheaper sources of power(typically green due to the economics) can quickly gain market share making lasting monopolies difficult. Even if a main ASIC manufacturer appears to have a large market share we can see this quickly change due to a single malinvestment or a mistake when developing the newest ASIC. Power is a resource that comes from many sources and allows many locations around the world to remain competitive for unique reasons. \n\n5) Objective Security- Proof of work gives us an objective and measurable degree of security where risk assessments can be made with greater precision that isn't afforded with more subjective forms of security.\n\n5)\tThere is no company that controls a pure PoW coin in many cases thus the project will win or fail on its own merit and doesn't have a long burn rate created by speculators",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ejlal",
                            "author": "BlueberryDefender",
                            "score": 1,
                            "created_utc": 1653098557.0,
                            "response": ">(Bitcoin is the best cryptocurrency that can achieve this with its network effect and roadmap)\n\nWhat do you mean by road map? Do you mean developments such as the lightning network, and other applications that could be potentially programmed in layer 2?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9g8y3k",
                                    "author": "bitusher",
                                    "score": 2,
                                    "created_utc": 1653142042.0,
                                    "response": "Bitcoin was created and maintained by engineers who prioritize security and functionality over marketing and nonsensical features \n\nSmart engineering for security (reducing attack surfaces) and scalability/efficiency isolates the protocol from other layers",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9i0x7r",
                                            "author": "BlueberryDefender",
                                            "score": 1,
                                            "created_utc": 1653172792.0,
                                            "response": "I see. As opposed to alts tampering with the base layer 1, compromising security and ultimately survivability",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9i705t",
                                                    "author": "bitusher",
                                                    "score": 2,
                                                    "created_utc": 1653176019.0,
                                                    "response": "As on example , a certain popular altcoin is designed to run all code on every node , even the ones not participating in the code. \n\nRunning \"turing complete\" code on a base protocol greatly increases the attack surface and scalability problems and is not needed because in a smart contract you can always have a blockchain work with clientside or server side code and isolate the attack surface just to the participants instead of exposing the whole network to it.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9igg60",
                                                            "author": "BlueberryDefender",
                                                            "score": 1,
                                                            "created_utc": 1653181195.0,
                                                            "response": "Sorry I’m misunderstanding. Does all code not run on all bitcoin nodes to maintain the ledger? \n\nDo you just mean keeping future applications/programs off layer 1?",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9ijtf4",
                                                                    "author": "bitusher",
                                                                    "score": 2,
                                                                    "created_utc": 1653182995.0,
                                                                    "response": "No,  bitcoin is scaling in multiple layers. Full nodes just run the consensus code and its not turing complete either",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9iwqae",
                                                                            "author": "BlueberryDefender",
                                                                            "score": 1,
                                                                            "created_utc": 1653190127.0,
                                                                            "response": "Thanks. Will look more into this",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i98ng9g",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1652988516.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i98vp36",
                    "author": "Brandammm",
                    "score": 1,
                    "created_utc": 1652992218.0,
                    "response": "The first is important, but it is also the only one or one of the few large market capitalization blockchains that focuses on security, the trilemma being security, scalability and decentralization, without forgetting the other 2, see how eth the more people who use it the more they pay for the fees.It is also the only one that has no CEO, no offices, you can't complain to anyone, it is totally user-owned (which I love).The amount of suply is ridiculous 21M, while eth is infinite, I'm talking about the ether because the others I don't even mention ><This and other reasons are the ones that have made it always be in the top 1 and in my opinion ( I could be terribly wrong ) it will be at least the next 10,15,20 years.\n\nEdit : if more people use eth and more fees go up it is not scalable (that's what I meant, there is a flaw in the trilemma of the blockchain,) also the core code of eth is the same as bitcoin, although in other layers it is solidity and trufle.  \nIt was also the only one (top 100 for example) that has not been hacked, crashed, attacked with lawsuits etc.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9a0i9v",
                    "author": "Old-Lavishness-9546",
                    "score": 1,
                    "created_utc": 1653012242.0,
                    "response": "The big block chain. Size matters.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9au6v9",
                    "author": "nullama",
                    "score": 1,
                    "created_utc": 1653030992.0,
                    "response": "It's decentralized, for real.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9axf40",
                    "author": "Yyoud0dis",
                    "score": 1,
                    "created_utc": 1653033858.0,
                    "response": "People use it",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9b6ajz",
                    "author": "ApplicationNo5082",
                    "score": 1,
                    "created_utc": 1653041255.0,
                    "response": "Basically it was first and no centralization",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9blnki",
                    "author": "LocksmithMuted4360",
                    "score": 1,
                    "created_utc": 1653050535.0,
                    "response": "Mmmm interesting question. Lets name a couple of altcoin and let you decide, just by their name if you think you can trust that with your life saving: bananacoin, apecoin, marijuanacoin, kodakcoin, potcoin, trumpcoin, putincoin and even.... dogecoin 😆 \n\nIt is like somebody like whoppers and they create a whoppercoin.\n\nAltcoin are also called sh**coin and it is not for nothing lol.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}