{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "usjhg2",
            "title": "How can the Bitcoin Network be attacked?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/usjhg2/how_can_the_bitcoin_network_be_attacked/",
            "author": "SwurveMan",
            "created_utc": 1652898689.0,
            "score": 7,
            "num_comments": 19,
            "subreddit": "BitcoinBeginners",
            "selftext": "51% attack? Race attack? Any more?",
            "stickied": false,
            "comments": [
                {
                    "id": "i93tn1b",
                    "author": "michmich229",
                    "score": 3,
                    "created_utc": 1652899267.0,
                    "response": "https://youtu.be/-ZTGmTjqXEU",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i942qsb",
                    "author": "BlyG",
                    "score": 3,
                    "created_utc": 1652902983.0,
                    "response": "Bitcoin can be temporally brought down in price which hurts its credibility just like in 2017...On Dec 21st 2017 the first futures contract representing 5 bitcoin started trading. Prior top this date btc was pumped to over $19,500. The (big, smarter, coordinated) money bought up btc in a big way to add to the pump and then started dumping it, at the same time the Futures markets were opening up. They were able to short the market with leverage in a regulated way for the first time.  Go look at the charts around Dec 2017. You will see the the dates coincide....Attack on price Yes. Attack on network, No.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i94gw7i",
                            "author": "Cramerleet",
                            "score": 2,
                            "created_utc": 1652908806.0,
                            "response": "What if governments, let's say europe starts then north america, they start banning proof of work like bitcoin. They ask their ISP to block all ip address that the bitcoin network uses.  Regulated exchanges have to follow, unregulated exchanges get ip blocked.   \n\nWouldn't that count as an attack on bitcoin network? It wouldn't be successful as to shut bitcoin down. But it would remove bitcoin network access to 99% of the first world.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i958a6r",
                                    "author": "rmortz",
                                    "score": 2,
                                    "created_utc": 1652921281.0,
                                    "response": "Would be similar to banning tne internet, people would find away or move away. Especially as inflation continues to ramp up.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i94nya6",
                    "author": "TendieTrades",
                    "score": 2,
                    "created_utc": 1652911824.0,
                    "response": "When no one wants it or won’t accept it as a form of payment it’ll be done. I don’t believe that will ever happen personally. Although I do believe the banks would love to crush it, and then control a singular one world digital currency.  Isn’t a one world currency a biblical prophecy?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i95irbo",
                            "author": "Allanon124",
                            "score": 3,
                            "created_utc": 1652926144.0,
                            "response": "It is. I believe Bitcoin is that currency.\n\nHere is why. It’s “immutability” is a characteristic of only one other thing, God. Additionally it’s “miraculous conception” is amazing and eerily related to Biblely stuff. It’s finitude is the only thing like it. There is no other provable thing that is finite. If God is immutable and infinite, we humans have created the immutable finite.\n\nAs it stands now, Bitcoin is for the people, but when the global economy collapses and all assets are moved onto the network, which I believe they will be, there will be the implementation of protocols like bip 119 that turn the entire thing into a monetary trap. Boom bang prophesy in real time.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i93s8tk",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1652898690.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i97j5i9",
                    "author": "Nice-Charity3906",
                    "score": 1,
                    "created_utc": 1652972167.0,
                    "response": "Double spend, or sibling attack",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i981k4e",
                    "author": "OneStepAheadApp",
                    "score": 1,
                    "created_utc": 1652979635.0,
                    "response": "It is very unlikely 51% attack could be carried out successfully. The reason is, because it would be simply too expensive and would require enormous coordination. The only possible threat could come from authoritarian regimes like China who could enforce the attack, however this is also very unlikely. One reason is because China outlawed the mining.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9439rj",
                    "author": "mibjt",
                    "score": -1,
                    "created_utc": 1652903196.0,
                    "response": "Will the esg movement bring the network down?",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}