{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ulqclp",
            "title": "USD to bitcoin",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/ulqclp/usd_to_bitcoin/",
            "author": "neoknife9111",
            "created_utc": 1652100098.0,
            "score": 4,
            "num_comments": 22,
            "subreddit": "BitcoinBeginners",
            "selftext": "Hello,\n\nI'm currently using coinbase to buy and and then transfer bitcoin into my personal wallet.  Coinbase wont let me transfer into my personal wallet for about 5-7 business days.  Is a faster method of buying bitcoin to transfer into my Exodus wallet?",
            "stickied": false,
            "comments": [
                {
                    "id": "i7wvlp0",
                    "author": "bitusher",
                    "score": 7,
                    "created_utc": 1652100292.0,
                    "response": "> Is a faster method of buying bitcoin to transfer\n\nYou can use cash app or strike.me with a debit card and instantly withdraw once you have verified \n\n>transfer into my Exodus wallet?\n\nI would personally avoid using exodus for these reasons \n\n1) large attack surface\n\n2) bad security practices \n\n3) missing important features\n\n4) You should never use a wallet in windows or osx without a hardware wallet and if you have a hardware wallet you should avoid exodus regardless. If you cannot afford a hardware wallet than use a wallet in ios or android \n\n5) closed source and not peer reviewed \n\nThis means that at best you have a wallet that is slightly better than using a custodian because you have access to the private keys that you could restore your coins in a separate wallet if their full nodes that support this light client is offline but there might be privacy leaks or exploits and backdoors that allow them or outsiders to steal your coins.\n\nWhat is the point in using cryptocurrency if you ultimately need to have faith in a single company or developer ? This undermines many of the security assumptions of cryptocurrencies.\n\nFor wallets stick to open source wallets and withdraw your bitcoin to them\n\nhttps://walletscrutiny.com\n\nhttps://docs.google.com/spreadsheets/d/1aZ1zbaUEzCo9NCctN8-eL2VLIiSdY009tTJvRXDUWEw/edit#gid=0\n\nhttps://www.reddit.com/r/BitcoinBeginners/comments/g42ijd/faq_for_beginners/",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}