{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uzp74s",
            "title": "New to Reddit and Bitcoin. Just learning about Bitcoin scam. Is Roistakes.com a scam website. I'm starting to feel I've been scammed.",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/uzp74s/new_to_reddit_and_bitcoin_just_learning_about/",
            "author": "Crafty-Run81",
            "created_utc": 1653750375.0,
            "score": 0,
            "num_comments": 2,
            "subreddit": "BitcoinBeginners",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "iabivmi",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653750375.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iabknr5",
                    "author": "BTCMachineElf",
                    "score": 1,
                    "created_utc": 1653751200.0,
                    "response": "tldr; Yes, that is a scam website.\r  \n\r  \nYou've come to the right place to learn about bitcoin and avoid scams. Just don't respond to anyone sending you private messages (there are scammers here too). Verify everything here in public chat.\r  \n\r  \nBitcoin, of course, is not a scam. It is a transparent, fair, decentralized monetary network with no governing authority.\r  \n\r  \nAs for any website, I find it best to go to www.google.com, and do a google search for the domain name. For example, this site you mention, it's only google results are itself. No reviews, no news articles, no people talking about it on reddit, etc. So YES, it IS a scam.\r  \n\r  \nThere is never any reason to use anything but the most reputable bitcoin exchanges.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}