{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "usce47",
            "title": "Is it often that several more or less empty blocks show up within less than 10min?",
            "url": "https://i.redd.it/pvmx633xf8091.png",
            "author": "ElucTheG33K",
            "created_utc": 1652878924.0,
            "score": 2,
            "num_comments": 19,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i92is5c",
                    "author": "Deacon86",
                    "score": 7,
                    "created_utc": 1652879677.0,
                    "response": "It's quite normal.  To balance it out, you can sometimes go more than an hour between blocks.  10 minutes per block is only an average.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i92j67f",
                    "author": "dlq84",
                    "score": 5,
                    "created_utc": 1652879865.0,
                    "response": "1. 10 minutes between blocks is the average, it could be a lot less and and it could be a lot more, but over time it's about 10m.\n2. If there aren't enough transactions to fill a block, it's not full. Simple as that.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i92idvn",
                    "author": "Geoknysis",
                    "score": 3,
                    "created_utc": 1652879482.0,
                    "response": "Yeah, in slower periods, sure.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i92rx8g",
                    "author": "Amoci",
                    "score": 2,
                    "created_utc": 1652883898.0,
                    "response": "Yes",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i92vlxb",
                    "author": "throwingawayl8r00",
                    "score": 2,
                    "created_utc": 1652885468.0,
                    "response": "Q: if the last block was found 9 minutes ago, in how many minutes can we expect to find the next block?\n\nA: 10 minutes\n\nThis is normal",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i92yu4z",
                            "author": "_-_agenda_-_",
                            "score": 0,
                            "created_utc": 1652886811.0,
                            "response": "Actually depende on what do you mean by \"expect\"",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i93oa3y",
                                    "author": "throwingawayl8r00",
                                    "score": 2,
                                    "created_utc": 1652897089.0,
                                    "response": "Average time remaining to find the next block",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i94nibk",
                                            "author": "_-_agenda_-_",
                                            "score": 1,
                                            "created_utc": 1652911627.0,
                                            "response": "That's actually 1 minute.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i966bue",
                                                    "author": "00iamgru00",
                                                    "score": 1,
                                                    "created_utc": 1652939873.0,
                                                    "response": "Nope, it’s actually 10 minutes believe it or not, since bitcoin mining is memoryless.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i96ucpr",
                                                            "author": "_-_agenda_-_",
                                                            "score": 1,
                                                            "created_utc": 1652959821.0,
                                                            "response": "I know what you guys mean, but you are writing technically wrong.\n\nI know that the chances to mine a block in 10 minutes from start is equal to te chances to mine it in 10 minutes after 9 minutes has past without a block.\n\nBut if you calculate the average remaining time of each point 9 minutes after a blocks, it will just be a little more than 1 minute, because the average is 10 minutes.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i92xe8x",
                    "author": "thondera",
                    "score": 2,
                    "created_utc": 1652886210.0,
                    "response": "always worth checking the mempool chart to see if 14 sat/vB is really justified:\n\nhttps://jochen-hoenicke.de/queue/#BTC,24h,weight",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i94so0m",
                            "author": "ElucTheG33K",
                            "score": 1,
                            "created_utc": 1652913938.0,
                            "response": "I mostly check on my mempool space instance if there are a huge backlog and how many block have accepted 1-2 sat/vB. Still when I see in my screenshot 2 - 365 sat/vB, it means that this block only accepted transaction with at least 2 sat/vB, even if not full? Or even 1 sat/vB are in this block?\n\nWhen the activity looks low and I'm not in a hurry I mostly send my transaction with 1sat/vB and it has always passed so far, even much faster than estimated by the wallet.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i96gwvg",
                                    "author": "thondera",
                                    "score": 2,
                                    "created_utc": 1652948788.0,
                                    "response": "I like Johoe's chart because you can hover over the right-most portion of the chart and see exactly how many megabytes of transactions is queued for the next block in every sat/B bucket. Knowing that each block is 1MB\\~1.5MB, you can make a good guess how much you have to pay so that your transaction is included in the next block (miners trim 1MB\\~1.5MB of the top-fee transactions).\n\nYour 1sat/vB is going through because, as you can see on the cart, the mempool is currently getting cleared to zero at some point every day. But when there was a bull market hype you wouldn't get your 1sat/vB through for weeks or even months because there were 100+ megabytes of transactions constantly in the queue.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i96ua9f",
                                            "author": "ElucTheG33K",
                                            "score": 1,
                                            "created_utc": 1652959776.0,
                                            "response": "Yes it's really interesting, and amazing what happen last week, the mempool was not so much large for a long time apparently.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i93205m",
                    "author": "NYKNYb",
                    "score": 2,
                    "created_utc": 1652888105.0,
                    "response": "If the average block time is lower/higher than the 10 mn target, the difficulty gets increased/decreased at the next difficulty adjustment which is every 2016 blocks.\n\nThis is in my opinion the spark of genius that will make the network go round until the end of times.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i94s518",
                    "author": "ElucTheG33K",
                    "score": 2,
                    "created_utc": 1652913698.0,
                    "response": "Thanks for all comments. I'm using Bitcoin for some time but only experimenting with my own node for a few months and end up looking at the mempool, ending up with question I never ask myself before. It turns out it's just pure mathematics, probability and statistics.\n\nBitcoin is more fascinating everyday I spend learning and using it.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uscrt3",
            "title": "Bitcoin passphrase vs. multisig: Which is right for you?",
            "url": "https://unchained.com/blog/bitcoin-singlesig-passphrase-vs-multisig/",
            "author": "porterhodl",
            "created_utc": 1652879999.0,
            "score": 3,
            "num_comments": 3,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i92la2k",
                    "author": "coinfeeds-bot",
                    "score": 1,
                    "created_utc": 1652880873.0,
                    "response": "tldr; Using a passphrase to secure your bitcoin is a step up from using a seed phrase to create a separate and unique bitcoin wallet. A passphrase can be any word, phrase, or sentence up to 50 characters, but it’s case-sensitive and must be entered precisely. Multisig is a bitcoin custody model where you construct a wallet using multiple bitcoin keys instead of just one.\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9f6ruf",
                    "author": "ILikePracticalGifts",
                    "score": 1,
                    "created_utc": 1653112878.0,
                    "response": "Multisig is unnecessary for 90% of holders, and will probably contribute to more lost coins when used incorrectly.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}