{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ut5gzu",
            "title": "Bitcoin Newbie",
            "url": "https://www.reddit.com/r/Bitcoin/comments/ut5gzu/bitcoin_newbie/",
            "author": "saxa26",
            "created_utc": 1652972780.0,
            "score": 1,
            "num_comments": 11,
            "subreddit": "Bitcoin",
            "selftext": "Relatively new to BTC here. Have been investing little by little for a couple years and was wondering, about how much BTC would people say is worth having that will actually amount to serious cash in the future? (10k, 50k, 100k+) Say 30 years from now.",
            "stickied": false,
            "comments": [
                {
                    "id": "i97kur1",
                    "author": "Trevih",
                    "score": 3,
                    "created_utc": 1652972878.0,
                    "response": "1 BTC is the goal.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i983bze",
                            "author": "dlq84",
                            "score": 1,
                            "created_utc": 1652980351.0,
                            "response": "And then 2",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i97lefo",
                    "author": "FogTub",
                    "score": 3,
                    "created_utc": 1652973106.0,
                    "response": "One can only guess the answer to that question. I'm more inclined to ask what $50K today will be worth in 20-30 years. That's more easy to imagine given how inflation is going, and 1 BTC will still be 1 BTC.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i981rkl",
                    "author": "zsyjxh8q7b8i",
                    "score": 2,
                    "created_utc": 1652979717.0,
                    "response": "That's the wrong question. The real question is how much money is worth saving? Obviously, as much as you can. Collecting BTC to have 1, 2, 10, isn't the goal, it's how much fiat can I exit to a better system and how long can I hold it. 50% of my free cash flow goes into BTC DCAed daily by quarterly total funds available, the other 25% to high yield dividends, and 25% to high conviction catalyst based stocks positions that I sell covered calls against.\n\n&#x200B;\n\nWhen I find a super great real estate property I know to be undervalued, I'll pull from one or all 3 of my savings methods to acquire it. It's an ever flowing / balancing system that keeps me diversified yet laser focused on acquiring wealth. I'm up 600% since 2018, and since 2016 I went from -$200k in bad debt to positive $700k in assets. At one point I was at 20 BTC in 2020, and have fluctuated between 10-13 since. I don't trade any of my assets, I collect them to generate income. BTC is the only asset that doesn't generate income, but it's gains offset that, and convincingly I believe it always will.\n\n&#x200B;\n\nCould I have sold 20 BTC at the $64k initial top, bought back at $29k, sold again at $69k top, and bought back once more at $26k for 100+ BTC for $3m+ in asset? 5 total trades, easy right? Sure... I could have also just as easily shorted BTC with 4x margin cross at $30k on the first $64k run up and lost 100% of it. Hindsight is 2020, but you're never going to kick yourself 10 years later when you've increased your assets by 3000% safely, while being able to sleep peacefully at night. Get rich slowly, build wealth that transcends generations, and produce income that allows you to retire early.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i97mpuq",
                    "author": "NiceDoctorBeam",
                    "score": 2,
                    "created_utc": 1652973657.0,
                    "response": "Nobody gets old and then says, \"I wish I hadn't saved so much for retirement.\"",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i97olt3",
                    "author": "ndgoLiberty",
                    "score": 2,
                    "created_utc": 1652974431.0,
                    "response": "The official stopping point is 6.15 BTC. At that point you should probably start buying other stuff cause your future wealth and access to beautiful people of the opposite gender are secured.\n\n1 BTC will probably be a house in the next 15 years. Right now it’s only a very nice car.\n\nFor broke people a good goal is 0.1 and then 0.2 and then 0.3 and so on",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i99mdee",
                            "author": "Romando1",
                            "score": 1,
                            "created_utc": 1653005230.0,
                            "response": "You bear, you. Growl!!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i97llsi",
                    "author": "5a5g",
                    "score": 1,
                    "created_utc": 1652973192.0,
                    "response": "Try accumulate 1 bitcoin before the next halving.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i982fvx",
                    "author": "Kooky_Organization30",
                    "score": 1,
                    "created_utc": 1652979990.0,
                    "response": "If Bitcoin maxis are correct and Bitcoin is the end all be all coin and currency of the future than having one Bitcoin today would have the same buying power as about $5,000,000 (100T market cap). I personally don’t see it being the end all be all crypto but I still see it being an incredibly important asset, especially as a store of value, and could see 1 Bitcoin eventually having the buying power of about $1,000,000 (21T market cap).",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i98n0di",
                    "author": "Leading_Zeros",
                    "score": 1,
                    "created_utc": 1652988337.0,
                    "response": "Radical innovations tend to obsolete the old tools and eventually completely replace and often expand the market it is disrupting. Bitcoin is going after the market for global money and other stores of value. Currently that market is roughtly $300-$400 trillion in size. Capturing that maket would put a bitcoin price of $15 to $20 million in today's dollars.\n\nAlthough comparing todays world to a world on a bitcoin standard is like comparing apples to oranges. It's equiverlent to estimating in the 90's how much of the Fax Machine market will the internet capture. There's really no upper bound on the bitcoin value appreciation as there's always more demand for money yet an absolute fixed supply of BTC. As humans continually expand the amount of capital goods and productivity that can only be expressed in an increasing purchasing power of a hard money like bitcoin.\n\nAnouther way to estiamte its potential is just by dividing the amount of sats avalible by global population.\n\n[http://bitcoinsperperson.com/](http://bitcoinsperperson.com/)",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}