{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uzksq8",
            "title": "\"Oh no! Bitcoin is falling against stocks\". Yes, right into the launchpad",
            "url": "https://imgur.com/a/sShEvFU",
            "author": "Eksander",
            "created_utc": 1653734776.0,
            "score": 2,
            "num_comments": 1,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "iaasshi",
                    "author": "NormandyLS",
                    "score": 1,
                    "created_utc": 1653734923.0,
                    "response": "So you cherrypicked one of the most bullish looking charts, and what happens if it's a turnaround? Oops? Yesterday was the perfect day for Bitcoin to rise if it was going to, yet it lost 25 billion in market cap. That's incredibly significant. Money from Bitcoin appears to have been shuffled to the stock market. However, you're right in that we may see that change and as Nasdaq continues to tumble on Tuesday , Bitcoin could take the lead and that is surely the confirmation of a bubble bursting.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uzkybj",
            "title": "Building An Escrow Wallet On Bitcoin Core",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uzkybj/building_an_escrow_wallet_on_bitcoin_core/",
            "author": "Snoo-67468",
            "created_utc": 1653735514.0,
            "score": 0,
            "num_comments": 4,
            "subreddit": "Bitcoin",
            "selftext": "Hi,\n\nIs it possible to build an escrow wallet on Bitcoin Core, with my own unique interface on top, allowing buyers and sellers to transact?\n\nWill I also be able to charge a personal fee for the users using my escrow wallet?",
            "stickied": false,
            "comments": [
                {
                    "id": "iaayvlt",
                    "author": "delta1-tari",
                    "score": 2,
                    "created_utc": 1653739430.0,
                    "response": "If you’re asking here then the answer is probably no.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iabbbdn",
                            "author": "Snoo-67468",
                            "score": 1,
                            "created_utc": 1653746663.0,
                            "response": "What I am asking is whether you can program it?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iabtki6",
                    "author": "F3TGM5bpGG0S",
                    "score": 2,
                    "created_utc": 1653755371.0,
                    "response": "If you provide a platform for buyers and sellers to connect p2p then you have no problem. However, if there is an escrow involved, you are immediately a financial services provider. You will either spend 5 years filling out applications for a licence or spend 5 years in jail.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iace58u",
                            "author": "Snoo-67468",
                            "score": 1,
                            "created_utc": 1653765166.0,
                            "response": "Yes, only a platform to connect buyers and sellers via P2P.  Through a multi signature wallet. Just like Localbitcoins. Does that not have a multi signature wallet where the buyers and sellers transact?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}