{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "upc806",
            "title": "When bitcoin reaches 21 million in circulation, what’s the incentive to keep mining?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/upc806/when_bitcoin_reaches_21_million_in_circulation/",
            "author": "throwaway3638363",
            "created_utc": 1652514087.0,
            "score": 11,
            "num_comments": 31,
            "subreddit": "BitcoinBeginners",
            "selftext": "As i understand it, miners are those who solve complex mathematical problems to gain the rights to approve transactions (or something lol) When there is no longer any bitcoin to be mined, how will these transactions continue to occur if there’s no reward?",
            "stickied": false,
            "comments": [
                {
                    "id": "i8jz21g",
                    "author": "swgo1",
                    "score": 19,
                    "created_utc": 1652515386.0,
                    "response": "Transaction fees",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8k3rh5",
                            "author": "ndgoLiberty",
                            "score": 3,
                            "created_utc": 1652519612.0,
                            "response": "We could post the satoshi quote again but this answer is sufficient.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8jzlzw",
                    "author": "nagatoshi01",
                    "score": 7,
                    "created_utc": 1652515869.0,
                    "response": "There will never be 21M BTC. In 2140, when there will be 20,999, 999.9769 BTC, emission of new bitcoins will stop and the only incentive to keep mining will be transaction fees, which will probably be much much higher than nowadays.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8jyxp3",
                    "author": "alexmunteanu95",
                    "score": 4,
                    "created_utc": 1652515281.0,
                    "response": "Im not an expert, im open to corrections. From what I have understood the last btc mined should be around 2140. Once all btc are mined the incentive should be the fees",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "up0u0j",
            "title": "DCA even during crash?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/up0u0j/dca_even_during_crash/",
            "author": "archie37",
            "created_utc": 1652474278.0,
            "score": 29,
            "num_comments": 43,
            "subreddit": "BitcoinBeginners",
            "selftext": "With the recent crash in crypto and \"extreme fear\" as the overall sentiment, is it still smart to dollar cost average or better to wait for some positivity in the market before resuming? I have been trying to allocate a certain percentage of my salary towards crypto each month and DCA regardless of the change in the market, but this recent crash just feels more extreme than we have experienced in the past year, and was wondering what others are doing regarding their monthly DCA plans?",
            "stickied": false,
            "comments": [
                {
                    "id": "i8i0i24",
                    "author": "Sufficient_Tooth_949",
                    "score": 48,
                    "created_utc": 1652475779.0,
                    "response": "Right now is the BEST to DCA, just keep it up and be patient for the next Bitcoin halvening",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8hyfgg",
                    "author": "ashtonlaszlo",
                    "score": 19,
                    "created_utc": 1652474869.0,
                    "response": "That just means you’re getting more bang for your buck right now. \n\nDon’t stop your DCA otherwise you’re not getting the most out of it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8i9urz",
                    "author": "Buy_More_Bitcoin",
                    "score": 13,
                    "created_utc": 1652480007.0,
                    "response": " > Be fearful when other are greedy and greedy when others are fearful\n\n-person who doesn't really like crypto but occasionally has some good advice",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8io5zw",
                    "author": "ZOMBAYyyy",
                    "score": 10,
                    "created_utc": 1652486886.0,
                    "response": "DCA especially during a crash",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ia5he",
                    "author": "MrQ01",
                    "score": 3,
                    "created_utc": 1652480145.0,
                    "response": "DCA is meant to be consistent, regardless of price, as its intention is to average out volatility.\n\nOn a side note - what made you conclude that DCA is more beneficial in an \"extreme greed\" market than an \"extreme fear\" market? What would be the intended financial advantage of waiting for positivity?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8i8913",
                    "author": "ballsonrawls",
                    "score": 7,
                    "created_utc": 1652479277.0,
                    "response": "There is a reason its called dca",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "up2i77",
            "title": "What happens to a coin that goes to zero?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/up2i77/what_happens_to_a_coin_that_goes_to_zero/",
            "author": "lestairwellwit",
            "created_utc": 1652479123.0,
            "score": 8,
            "num_comments": 44,
            "subreddit": "BitcoinBeginners",
            "selftext": "Say you have coin that goes to zero. Does it just evaporate ? Don't you still, basically have the code/ keys for it? If said coin gets resurrected, and goes up, do you now have value in it?\n\nIf I  had 1 BTC and it went to 0.01$ I'd still have the 1 BTC. Does it disappear if it goes to 0.00...?\n\nEdit: 2.7k views... 60% upvote\n\nWhat started as an honest question. Turned into such a mess. \n\nThank you for all the well though out answers...",
            "stickied": false,
            "comments": [
                {
                    "id": "i8i8jkq",
                    "author": "Starbackr",
                    "score": 5,
                    "created_utc": 1652479408.0,
                    "response": "You will always keep the coin. The chain might stop at some point, because there is no incentive to mine it though",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8ig9rk",
                            "author": "IRightReelGud",
                            "score": 13,
                            "created_utc": 1652483020.0,
                            "response": "They just turn it off. \n\nEvery shitcoin is like this. Only buy Bitcoin. I'm warning you.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8i91qr",
                    "author": "MrQ01",
                    "score": 3,
                    "created_utc": 1652479638.0,
                    "response": "The price only relates to the point you exchange it will someone on an exchange. In fact, if you sell on an exchange, nothing happens because it's just numbers on a screen until you decide to transfer it out. And if you do transfer it out into a wallet, 1 BTC is the same whether its selling price was $1million or $0.01.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8i8mg7",
                    "author": "Gwsb1",
                    "score": 4,
                    "created_utc": 1652479444.0,
                    "response": "First thing is to try to get your old job back at the Wendy's drive through.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8ic5kq",
                            "author": "lestairwellwit",
                            "score": 4,
                            "created_utc": 1652481073.0,
                            "response": "Nice",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "uostgp",
            "title": "Can I use an offline phone as cold storage instead of a hardware wallet?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/uostgp/can_i_use_an_offline_phone_as_cold_storage/",
            "author": "Bismarck_s",
            "created_utc": 1652451598.0,
            "score": 20,
            "num_comments": 46,
            "subreddit": "BitcoinBeginners",
            "selftext": "Can I just use a phone that will never connect to the internet to sign transactions offline and broadcast them with another phone? What are the drawbacks of doing that instead of using a hardware wallet?",
            "stickied": false,
            "comments": [
                {
                    "id": "i8gy2kg",
                    "author": "IBuildBusinesses",
                    "score": 6,
                    "created_utc": 1652459848.0,
                    "response": "Phones are not secure. Buy a hardware wallet. There is so much going on in a modern phone that, as others pointed out, the attack surface can be huge. Perhaps the bigger problem is not knowing what you don’t know when it comes to phone security. For instance, this was just published yesterday....\n\nhttps://arxiv.org/abs/2205.06114",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8ipzgf",
                            "author": "shymeeee",
                            "score": 3,
                            "created_utc": 1652487782.0,
                            "response": "Hardware wallets, believe it or not (to us commoners), are hard to use.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8h5eu7",
                    "author": "AirGap_Wallet",
                    "score": 10,
                    "created_utc": 1652462724.0,
                    "response": "Hi, Andy from AirGap here.\n\nI have already posted another comment in this post to introduce our app, AirGap Vault. However, there I didn't go into detail of what the drawbacks (and upsides) are of using a mobile phone as a cold storage solution.\n\nAs always, there are pros and cons to every solution. HW wallets are designed with one specific goal in mind and the teams behind them are usually small. Mobile phones are general purpose devices, so the attack vector can be a lot higher. But there are also many more people and security teams working on making mobile phones more secure (eg. enterprise environments).  \nSo ultimately, it's up to every person to decide what they see as more secure and less risky. I for one think that the security of a properly managed mobile phone (meaning it's factory reset, always offline, not used for any other purpose) is very high. Most of the exploits that affect mobile phones are usually introduced by browsing the web or installing malicious apps. But if your device is offline, it's almost impossibly for malware to enter the mobile phone unless there is a backdoor in the official stock iOS/Android firmware.\n\nAnother advantage of a mobile phone is that it has a big screen. This means that it is much easier to verify transaction details (eg. the amounts and recipients). It is also easier to show warnings and tips to the user. The usability is also much better because all the tutorials and explanations can be done on the device itself, so the UX is generally better in my opinion.\n\nMobile phones also have more computing power and storage, so more data can be stored that make transactions more secure (eg. you could store a blacklist of known scam addresses, or add contract information that allows you to decode contract calls, etc.)\n\nWhen using a mobile phone as a signer, the communication is usually done over QR codes, not over cables. This means that your key is truly air-gapped and is never connected to an online device. (Some HW wallets such as ColdCard can be used in an air-gapped fashion as well).\n\nAnd then a last point is the fact that the device is simply a mobile phone. This means that in case the device breaks, it's easy to get a replacement. There are no supply shortages because you are tied to a specific manufacturer, and you while some countries have restrictions regarding HW wallets, this doesn't happen with mobile phones.  \nThe fact that it's a regular mobile device is also great because it means if you ever travel through customs, or a thief enters your house, they will think that it's simply an old smartphone, they will not immediately think \"cryptocurrency\".\n\nLet me know if you have any more questions!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8hmeqj",
                            "author": "bespectacledbengal",
                            "score": 7,
                            "created_utc": 1652469720.0,
                            "response": "Honest question: why don’t they just make a phone-sized hardware wallet that comes with a larger screen and none of the other drawbacks of a phone?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8hweww",
                                    "author": "jesteraw85",
                                    "score": 3,
                                    "created_utc": 1652473990.0,
                                    "response": "[Ellipal Titan](https://www.ellipal.com/pages/coldwallet) - this is one like that. I’m not recommending because I don’t know much about it. Just that it exists.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8hxxtb",
                                    "author": "garrulous_theory",
                                    "score": 3,
                                    "created_utc": 1652474654.0,
                                    "response": "https://foundationdevices.com/passport/",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8grd5q",
                    "author": "blaze1234",
                    "score": 4,
                    "created_utc": 1652457197.0,
                    "response": "See AirGap Vault\n\nu/AirGap_Wallet",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8gebtt",
                    "author": "bitusher",
                    "score": 3,
                    "created_utc": 1652451926.0,
                    "response": "It would be very inconvenient way to save 60 dollars on a hardware wallet IMHO. What software would you use on that phone to sign the transaction ?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8h2bh5",
                            "author": "AirGap_Wallet",
                            "score": 7,
                            "created_utc": 1652461509.0,
                            "response": "Hi, Andy from AirGap here.\n\nOur project aims to do exactly that. AirGap Vault is a mobile app and is available on iOS and Android. For Bitcoin, we have an option to use the BC-UR standard, so you can use AirGap Vault as a signer with a variety of watch-only wallets, such as BlueWallet, Sparrow or Specter.\n\nAirGap Vault itself never requires any internet connection, just like a HW wallet. The communication with the online device is done over QR codes, which has a couple of advantages compared to cables.\n\nThe project is completely open source and free. Our app is also reproducible, however, due to some recent issues where builds were randomly not reproducible, the status on walletscrutiny is currently \"not reproducible\" (if you read the analysis, it will state that the latest version is in fact reproducible, but until mentioned issue is addressed, it will stay \"not reproducible\"). We're working with walletscrutiny to resolve this and it looks like we have resolved the issue with the latest release, but it will take some time to verify it. (see [https://github.com/airgap-it/airgap-vault/issues/127](https://github.com/airgap-it/airgap-vault/issues/127)).\n\nLet us know if you have any feedback!\n\nEdit: I didn't state this explicitly because the question already contained it, but our solution should only be considered very secure if it is used with a dedicated, factory reset device that will always stay offline.\n\nEdit2: We have a tutorial on how a secure offline device can be set up: https://support.airgap.it/airgap-vault/setup/secure-cold-wallet-airgap-android",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8gro22",
                    "author": "GibbsSamplePlatter",
                    "score": 3,
                    "created_utc": 1652457316.0,
                    "response": "A number of services actually do this, so in principle, yes.\n\nDrawbacks are increased attack surfaces, lack of standards.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uox3xx",
            "title": "Help!",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/uox3xx/help/",
            "author": "A13X666",
            "created_utc": 1652463700.0,
            "score": 7,
            "num_comments": 24,
            "subreddit": "BitcoinBeginners",
            "selftext": "Today I sent BTC from binance to a friend, the first transaction went good (appear as completed and when i check on blockchain explorer appears in my friends wallet), after the first one I sent to the same wallet of my friend a little bit less BTC, this time appears as completed but he didn't recieve nothing, I checked on blockchain explorer and my transaction its not there.\n\nI should worry or I have to give it a little time? Already waited like 5 hours.\n\nEdit: I already contacted binance (really bad support) and they said that the TxID of the transfer is succesful and they cannot help me.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8hdrnx",
                    "author": "iris_cheese",
                    "score": 9,
                    "created_utc": 1652466116.0,
                    "response": "So once I tried to buy $100 of btc on binance and it said transaction failed please try again. And I tried it about 7 times with no luck. I woke up the next day with $700 of btc in my acc and -$600 in my bank acc. I stopped using binance after that.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8hf87k",
                            "author": "A13X666",
                            "score": 3,
                            "created_utc": 1652466719.0,
                            "response": "Dammm i wish that happens to me...",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8hhlcy",
                                    "author": "iris_cheese",
                                    "score": 6,
                                    "created_utc": 1652467702.0,
                                    "response": "It sucked\n\nHow yall down voting me for this binance took $700 out of my acc when they weren’t supposed to 💀",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8hct9l",
                    "author": "bitusher",
                    "score": 3,
                    "created_utc": 1652465727.0,
                    "response": "> and they said that the TxID of the transfer is succesful and they cannot help me.\n\n1) ask them for the tx id \n\n2) Input that tx id in a block explorer \n\n3) See if the tx corresponds to the address you sent the bitcoin to the first time",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8h9fvb",
                    "author": "mar805cus1",
                    "score": 3,
                    "created_utc": 1652464346.0,
                    "response": "Still have problem?",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uoow58",
            "title": "Wallets that support offline transactions?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/uoow58/wallets_that_support_offline_transactions/",
            "author": "EmilyLovs",
            "created_utc": 1652438625.0,
            "score": 9,
            "num_comments": 8,
            "subreddit": "BitcoinBeginners",
            "selftext": "What wallets currently support offline transaction signing?\n\nWhat is generally regarded as the most battle-tested, secure option?",
            "stickied": false,
            "comments": [
                {
                    "id": "i8foyo0",
                    "author": "sciencetaco",
                    "score": 4,
                    "created_utc": 1652438684.0,
                    "response": "Electrum",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uorz5p",
            "title": "Moving off of Coinbase",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/uorz5p/moving_off_of_coinbase/",
            "author": "TheorySerum00",
            "created_utc": 1652449142.0,
            "score": 4,
            "num_comments": 13,
            "subreddit": "BitcoinBeginners",
            "selftext": "So I’ve used Coinbase for the past few years since it was an easy way to get into buying Bitcoin. But lately, ive been looking into trying a different service and get off Coinbase…\n\nIn particular I’ve seen Swan and Cash app as good options, primarily for the DCA. Any input would be great! Thanks",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uo5u8g",
            "title": "If Coinbase says 80% buy rate and 20% sell rate why is the price not going up?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/uo5u8g/if_coinbase_says_80_buy_rate_and_20_sell_rate_why/",
            "author": "DuoMensis",
            "created_utc": 1652375141.0,
            "score": 89,
            "num_comments": 42,
            "subreddit": "BitcoinBeginners",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8ceydn",
                    "author": "ArchiMode25",
                    "score": 99,
                    "created_utc": 1652377140.0,
                    "response": "Because coinbase isn't the only exchange and only represents a small percentage of overall volume.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8cwhxe",
                            "author": "M_Drinks",
                            "score": 24,
                            "created_utc": 1652384083.0,
                            "response": "This. Whales aren’t buying on the Coinbase exchange.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8d2m0g",
                                    "author": "Koda487",
                                    "score": 6,
                                    "created_utc": 1652386432.0,
                                    "response": "How would one buy large amounts of crypto?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8e6qlu",
                                            "author": "Alfador8",
                                            "score": 8,
                                            "created_utc": 1652403949.0,
                                            "response": "OTC (over the counter) generally. Since this is not done through an exchange's marketplace it doesn't impact the supply of coins available on that exchange",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8ebslf",
                                                    "author": "CianuroConLove",
                                                    "score": 5,
                                                    "created_utc": 1652406262.0,
                                                    "response": "How do you buy OTC?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8fg5cx",
                                                            "author": "snowkeld",
                                                            "score": 5,
                                                            "created_utc": 1652431289.0,
                                                            "response": "A top notch example would be kraken. They have an OTC desk that's separate from the exchange. It operates completely differently.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8fgvom",
                                                                    "author": "kraken-orange",
                                                                    "score": 7,
                                                                    "created_utc": 1652431929.0,
                                                                    "response": "Thank you u/snowkeld, we appreciate your mention!\n\nFor clients who wish to conduct large orders and do not want to place them on the public exchange causing price disruption, we offer the Kraken OTC desk that you can directly interact with Kraken Traders and facilitate specific transaction prices and details.\n\nMore info, visit: [Introducing the Kraken OTC Desk](https://support.kraken.com/hc/en-us/articles/360021967711-Introducing-the-Kraken-OTC-Desk)\n\nDon't hesitate to reach out if you have any questions in this regard u/CianuroConLove\n\nHave a nice day ahead everybody!!! 🐙",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "i8eck02",
                                                            "author": "scatterbastard",
                                                            "score": 8,
                                                            "created_utc": 1652406619.0,
                                                            "response": "Depends on the amount. One? Craigslist etc, in person face to face.\n\n1000 btc? Probably a broker of some sorts, or a really shady dark web forum.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8d6bpg",
                            "author": "please_take_one",
                            "score": 3,
                            "created_utc": 1652387890.0,
                            "response": "So the price reported by coinbase or any exchange is not necessarily the “real” price?\n\nI think I’ll remember that every time I want to second guess my decisions when the price plummets.\n\nI feel like we’re learning the same lessons that the WSB/Superstonk guys did. It’s like the equivalent of dark pools. Us plebs are trading in certain venues at certain price points, and have no visibility into what’s going on in the “exclusive” venues.\n\nProbably on their side, (the dark side lel) bitcoin price looks way less volatile. Because retail has 1) a lot of retards trading and 2) is the target of manipulation, trying to milk us if our hodlings.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8dadbk",
                                    "author": "Brettanomyces78",
                                    "score": 7,
                                    "created_utc": 1652389524.0,
                                    "response": "Any exchange's price is as real as any other.  But the larger the real volume, the more influence it has, so to speak.\n\nBut OP wasn't asking about price, but that silly \"# of people buying/selling\" metric, which obviously applies only to the small number of \"regular\" Coinbase activity (i.e., people using Coinbase as a broker, not an exchange).  It's a useless metric.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8djskp",
                                    "author": "Sendmedoge",
                                    "score": 3,
                                    "created_utc": 1652393460.0,
                                    "response": "There are delays between exchanges.\n\nThat's how bot pumps work.\n\nBuy a bunch on a little crappy exchange that would report a massive spike... then sell on same exchange.\n\nIt's supposed to be \"close\" because they all report all the time..  but they can fall out of sync at times.\n\nThey do this because when you buy from an exchange, the coin doesn't actually get \"moved\".   So it wouldn't change the price at all if they didn't report it.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8cas8j",
                    "author": "pengufish",
                    "score": 14,
                    "created_utc": 1652375472.0,
                    "response": "Shorts being made by whales. Regular Coinbase is just for retail traders not the big whales making the market move.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8dsec6",
                            "author": "HersheysCB",
                            "score": 9,
                            "created_utc": 1652397328.0,
                            "response": "where do the whales buy?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8cm4d7",
                    "author": "Brettanomyces78",
                    "score": 8,
                    "created_utc": 1652380006.0,
                    "response": "Because regular Coinbase users aren't moving the market.  It's a tiny percentage of the market, and only very small time, inexperienced participants.\n  \nThat \"buy/sell %\" number is a useless metric.  If anything, I'd just use it as a counter indicator, but not even a strong one at that.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uoodx5",
            "title": "Safe Bitcoin storage without hardware",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/uoodx5/safe_bitcoin_storage_without_hardware/",
            "author": "Madteklynd",
            "created_utc": 1652436457.0,
            "score": 3,
            "num_comments": 9,
            "subreddit": "BitcoinBeginners",
            "selftext": "Recently i've been trying to find a way to store my bitcoin off of exchanges and lending platforms.\n\nI'm looking to keep around 50% of my stash in absolute cold storage for long term (10+ years).\n\nHowever, the inevitable answer you come to is using hardware wallets. This is not possible for me under any circumstance since i travel a lot. I would either have to trust it to a multisig hardware setup with a person, a bank or travel around with it.\n\nObviously all of these scenarios are unaccepable. Even keeping it in a bank vault leaves counterparty risk and the fact that i have to literally fly to a different country to get my keys.\n\nAlso i wont be traveling around Mexico with my hardware wallet any time soon.\n\nWhat i would really like is a sort of online multisig setup. Now im no computer scientist but i envision that you could possibly set up some sort of secure custodial service online with multisig and encryption to keep it safe. I've seen this for large institutional investors but not for retail investors. I'm aware that theres counterparty risk in using and service and software also, but since i cant use hardware i dont see any alternative?\n\nThanks in advance for any help",
            "stickied": false,
            "comments": [
                {
                    "id": "i8fzlgc",
                    "author": "1entreprenewer",
                    "score": 3,
                    "created_utc": 1652445168.0,
                    "response": "Casa might work for you, but I travel with one of my hardware wallets sometimes and it’s fine. Just do MultiSig. Or Casa. I did a video about Casa. But alll their plans use at least one hardware wallet. That’s because you need keys offline. It’s important. \n\nThe World's Most Secure Bitcoin Wallet?\nhttps://youtu.be/FEM3lR7KI7c",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uoksd4",
            "title": "How do you get bitcoins without having to use ID and verification?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/uoksd4/how_do_you_get_bitcoins_without_having_to_use_id/",
            "author": "codeyCode",
            "created_utc": 1652420472.0,
            "score": 3,
            "num_comments": 8,
            "subreddit": "BitcoinBeginners",
            "selftext": "Is there a way to convert cash into bitcoin or just get bitcoin without having to send ID and personal info to a website.\n\nSaw some sites say to use ATMs but those still make you sign up with your ID and phone number. \n\nNew to bitcoin so don't feel comfortable doing this. Is it possible to send money to wallet without having to do all of that?",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uo93t0",
            "title": "if bitcoin the only one currency its fee seems high (need bitcoin expert opinion)",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/uo93t0/if_bitcoin_the_only_one_currency_its_fee_seems/",
            "author": "vitalyevodin",
            "created_utc": 1652384059.0,
            "score": 7,
            "num_comments": 24,
            "subreddit": "BitcoinBeginners",
            "selftext": "So 1 bitcoin is 100m satoshi but you can’t spend less then 0.00010000 in example I want to by a pizza/coffee in world where there is only bitcoin so it must cost at least 0.0001 that seems expensive because average amount of bitcoin is less then 0.0025 so it seems that don’t have enough bitcoin in fair and happy future without all this rally \n\ncould some bitcoin expert help we with this math ?",
            "stickied": false,
            "comments": [
                {
                    "id": "i8cxvyi",
                    "author": "Albo-LuckyBastard",
                    "score": 12,
                    "created_utc": 1652384611.0,
                    "response": "Light network is your Answer !",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8efmtp",
                    "author": "AdS_CFT_",
                    "score": 5,
                    "created_utc": 1652408070.0,
                    "response": "BTC was not meant to buy your daily coffe or stuff like that.\n\nthere are other networks like lightning network which are made for that.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8emnwl",
                            "author": "WinstonJrIII",
                            "score": 3,
                            "created_utc": 1652411436.0,
                            "response": "I mean… in a sense it was. The original Satoshi white paper never said it WASNT intended for everyday transactions..",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "uoaq5a",
            "title": "Keystone Pro: Does it store the passphrases I enter?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/uoaq5a/keystone_pro_does_it_store_the_passphrases_i_enter/",
            "author": "BlockchainIsTheWay",
            "created_utc": 1652388420.0,
            "score": 3,
            "num_comments": 3,
            "subreddit": "BitcoinBeginners",
            "selftext": "Does the Keystone Pro store the passphrases you type into persistently (i.e. on secondary storage)? Reason I ask is because when entering a passphrase, it asks you to enter it twice and it feels like it is going to get saved.. I would feel reluctant to use a passphrase if I felt that a device that could have been tampered in a supply chain attack has stored not only my seed phrase but also its passphrase. How can I be sure, aside from trusting Keystone's marketing team, that I am not giving them the keys to my BTC?",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uo4ouh",
            "title": "Sent small amount to blockstream green to test, fee is higher than sent amount??",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/uo4ouh/sent_small_amount_to_blockstream_green_to_test/",
            "author": "00papaya00",
            "created_utc": 1652372029.0,
            "score": 6,
            "num_comments": 14,
            "subreddit": "BitcoinBeginners",
            "selftext": "So I sent 0.0005 from exchange to my green wallet, after exchange fee it’s 0.000495 which seem to show up on my green wallet. But only 1 verified out of 6 so far, and when I click on transaction it shows a fee of 0.00050935???\n\nDoes this mean transaction will never be fully authenticated and I have lost the above amount?\n\nI did not check this before sending the rest from my exchange (120$) and that is also showing about 15$ in fee. I feel really dumb right now, are fees supposed to be this high? What can I do for next ones?",
            "stickied": false,
            "comments": [
                {
                    "id": "i8cky2l",
                    "author": "00papaya00",
                    "score": 5,
                    "created_utc": 1652379536.0,
                    "response": "Thank you everyone for replies. Both my transactions have been fully verified and indeed I did not have to pay anything further. The only fee was the exchange withdrawal fee which they deducted prior to sending to green wallet. Thank you very much again.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uo8qys",
            "title": "If you lose access to your wallets, but you safely have your 12 word seed phrase (ie in your head), then could you install Mycelium or Electrum in a new device and gain access to your private keys with your 12 words? Can you enter your 12 words generated from Electrum into Mycelium? Or vice versa?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/uo8qys/if_you_lose_access_to_your_wallets_but_you_safely/",
            "author": "nielsenjam",
            "created_utc": 1652383083.0,
            "score": 3,
            "num_comments": 11,
            "subreddit": "BitcoinBeginners",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8d78ci",
                    "author": "IRightReelGud",
                    "score": 3,
                    "created_utc": 1652388250.0,
                    "response": "Yes. I recommend only using a coldcard hardware wallet.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uo1ytd",
            "title": "Exchanges tracing KYC BTC",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/uo1ytd/exchanges_tracing_kyc_btc/",
            "author": "Own_Ad_7321",
            "created_utc": 1652364595.0,
            "score": 7,
            "num_comments": 12,
            "subreddit": "BitcoinBeginners",
            "selftext": "So far all the bitcoin I have are KYC. I got them from an exchange based in my country.\nBut I now self-custody them and keys are in a Ledger.\n\nI am aware that exchanges can pretty much trace where you send the bitcoin you bought from them and eventually connect that to your identity since I provided an id.\n\nSo given that I sent the bitcoin to my Ledger, will the exchange be able to connect my identity to the BTC in the hardware wallet? Even if Ledger itself is not kyc. \n\nI hope I am making sense hehe🥲😅\n\nThank u in advance🙏🏽",
            "stickied": false,
            "comments": [
                {
                    "id": "i8c2k89",
                    "author": "DudeIncogneto",
                    "score": 7,
                    "created_utc": 1652372262.0,
                    "response": "If you withdraw from an exchange that knows your identity they likely will assume the withdraw is going to a address you own. If after that you send that bitcoin somewhere else say to a different address you own, you add plausible deniability as they do not know who owns that address.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8bt197",
                    "author": "Pinky_DLobster",
                    "score": 4,
                    "created_utc": 1652368539.0,
                    "response": "Yes",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "unxmgr",
            "title": "Safe way to store Bitcoin (and crypto in general)",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/unxmgr/safe_way_to_store_bitcoin_and_crypto_in_general/",
            "author": "CanYouSmellTheSmoke",
            "created_utc": 1652349743.0,
            "score": 15,
            "num_comments": 49,
            "subreddit": "BitcoinBeginners",
            "selftext": "Hi everyone! Before you hurl stones my way, yes I'm aware that I'm probably not protecting my bitcoin in the best way, as I am currently using....well....you know...it rhymes with \"Krobinhood\".  \n\n\nAnyway, is it terrible of me to be using robinhood to acquire my bitcoin?  \n\n\nAdvice much needed here.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8asrro",
                    "author": "bitusher",
                    "score": 13,
                    "created_utc": 1652349961.0,
                    "response": "If you don't control the Bitcoin you don't really own it. I would suggest selling those Bitcoin IOUs you have on Robinhood and withdrawing the fiat, sending the fiat to an exchange listed in the FAQ and than buying bitcoin you can actually use , spend, control. \n\nBitcoin is P2P currency. Storing bitcoins on exchanges, banks or web wallets makes you insecure and makes the whole ecosystem insecure indirectly by centralizing bitcoin. \n\nBitcoin is a bearer asset with ~immutable txs unlike fiat. This means that internal or external thieves  prefer to target what they can take and won't be reversed like digital fiat. Having centralized exchanges and banks store BTC makes it a desirable target for these attacks. \n\n\nThere are privacy concerns with storing your bitcoins with third parties\n\nYou are exposed to tax theft, asset forfeiture theft , civil theft \n\nYou are exposed to exit theft \n\nYou are exposed to the exchange refusing to support a split asset where they steal it , throw it away, or delaying a payout causing you to lose opportunity costs and profit\n\nYou place Bitcoin as a whole under more systemic risk by tempting exchanges to use fractional reserve banking and giving them too much influence\n\nYou potentially reduce the probability that your investment will appreciate in value because no exchanges are doing provable audits and they might be fractional. The more Bitcoin you personally control the more likely it will appreciate in value.\n\n**Never store your bitcoins in a web wallet, custodian , or exchange . You own 0 bitcoins if you do not control your private keys.**",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uno9fi",
            "title": "Can a hardwallet (trezor or ledger) restore more than one wallet?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/uno9fi/can_a_hardwallet_trezor_or_ledger_restore_more/",
            "author": "Nose_Grindstoned",
            "created_utc": 1652315578.0,
            "score": 13,
            "num_comments": 13,
            "subreddit": "BitcoinBeginners",
            "selftext": "Let’s say I have 1 BTC in a non custodial wallet, and I have 1 BTC in a second wallet.\n\nCan I use the first wallet’s secret words and restore that 1 BTC to a new hardwallet, and then also restore the second wallet onto the same new hardwallet, leaving me with 2 BTC in my new hardwallet?\n\nOr can I only use the secret words wallet restore once on a hardwallet?  And if I were to restore the second wallet it would erase my first restored BTC?",
            "stickied": false,
            "comments": [
                {
                    "id": "i89aedc",
                    "author": "Brettanomyces78",
                    "score": 4,
                    "created_utc": 1652316019.0,
                    "response": "The way you phrased this is a little confusing, but I'll take a stab.\n\nHardware wallets only work from one BIP39 phrase at once.  Those are the addresses & keys it will sign transactions for successfully.  So only addresses derived from the phrase you currently have loaded can be sent from.\n\nYou can easily restore a device using a second phrase, but then you can only send from addresses associated with that second phrase (until such time as you restore it using the first phrase, for example).\n\nNone of this affects your ability to see balances and get addresses derived from an xpub.  That's done by software and doesn't require your device to sign anything.  Does that help?",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "untt4x",
            "title": "Deciding on a wallet",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/untt4x/deciding_on_a_wallet/",
            "author": "AngryZoomer",
            "created_utc": 1652333525.0,
            "score": 3,
            "num_comments": 15,
            "subreddit": "BitcoinBeginners",
            "selftext": "I’m probably overthinking this but I can’t decide what hardware wallet to get to store BTC.\n\nI know ledger is popular and pretty easy to use, but options like cold card are supposed to be more secure.\n\nWhat should I do?",
            "stickied": false,
            "comments": [
                {
                    "id": "i8avj75",
                    "author": "benma2",
                    "score": 6,
                    "created_utc": 1652352135.0,
                    "response": "Check out the [BitBox02](https://shiftcrypto.ch/). Easy for beginners, packed with expert features to discover. \n\nDisclaimer: I work for Shift, let me know if you have any specific questions.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ahkfz",
                    "author": "blaze1234",
                    "score": 3,
                    "created_utc": 1652340212.0,
                    "response": "Choose the wallet-client software first.\n\nThen choose from its list of compatible HWWs",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8an07x",
                    "author": "bitusher",
                    "score": 3,
                    "created_utc": 1652344950.0,
                    "response": "I own many hardware wallets , including all ledger products and cold card . \n\nI would buy a cold card because it has more security features and the ledger has worse UX IMHO and the way they handled their hack was atrocious.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8aoyyt",
                    "author": "Ltgin",
                    "score": 3,
                    "created_utc": 1652346702.0,
                    "response": "The most security would probably be in ColdCard. If you're looking for a HW for a cold storage, I'd go with Cold Card.\n\nIf you need a HW that you will be using very often Trezor Model T is nice and convenient.\n\n&#x200B;\n\nDon't forget to use passphrase for extra added security. Do some research on best practices on passphrases.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "unf1j3",
            "title": "Best way to move BTC off coinbase?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/unf1j3/best_way_to_move_btc_off_coinbase/",
            "author": "jeepnismo",
            "created_utc": 1652289779.0,
            "score": 20,
            "num_comments": 23,
            "subreddit": "BitcoinBeginners",
            "selftext": "I’ve read the FAQs for wallets. But what’s the best way to move BTC off coinbase? \n\nBest cold wallet? Down side is I do not have a computer. All crypto trading is done via iPhone. \n\nTIA",
            "stickied": false,
            "comments": [
                {
                    "id": "i87mjmv",
                    "author": "bitusher",
                    "score": 8,
                    "created_utc": 1652291022.0,
                    "response": ">Best cold wallet? \n\nIf you have less than 1k usd of bitcoin you can just stick with a wallet in your iphone. IOS and android environments are much more secure than windows or osx \n\nif you want to buy a hardware wallet you will have to get something like a ledger nano x since you only have an iphone \n\nInstall blockstream green \n\nhttps://blockstream.com/green/\n\nhttps://www.youtube.com/watch?v=uO3Zi9D5b0Y\n\nWatch the video to understand how to receive bitcoin",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i87w10m",
                    "author": "MuchTemperature6776",
                    "score": 6,
                    "created_utc": 1652294780.0,
                    "response": "If you only have your phone then Muun but honestly you really need something else to store your recovery kit etc.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i87lyz5",
                    "author": "Brettanomyces78",
                    "score": 4,
                    "created_utc": 1652290802.0,
                    "response": "There's only one way.  You just withdraw it.\n\nThere's no one best hardware wallet, but Ledger, Trezor, and ColdCard are reputable manufacturers.  Can't go wrong with any of their current products.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8evbgc",
                    "author": "azraelle_178",
                    "score": 3,
                    "created_utc": 1652415968.0,
                    "response": "I think it's better to use Netcoins wallet cause it's more convenient compared to coinbase wallet which makes it a bit difficult to move your BTC. The process is kinda heavy unlike netcoins, it's pretty easy.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "unjuyp",
            "title": "Metal Seed Storage",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/unjuyp/metal_seed_storage/",
            "author": "Fed_up_junkie",
            "created_utc": 1652302822.0,
            "score": 6,
            "num_comments": 12,
            "subreddit": "BitcoinBeginners",
            "selftext": "Am I being extra paranoid worrying about having my metal seed storage delivered to my home address? \nShould I get it posted somewhere else?",
            "stickied": false,
            "comments": [
                {
                    "id": "i88jiwq",
                    "author": "bitusher",
                    "score": 7,
                    "created_utc": 1652304003.0,
                    "response": "This is a bit too paranoid IMHO, most metal wallet backups are too obscure for anyone to really know what they are or what they are used for. \n\nIf you prefer you can simply make your own -\n\nUse 1/8 or 4mm at the largest stamp kit\n\nexample \n\nhttps://www.amazon.com/Piece-Letter-Number-Stamping-Set/dp/B006ZB9P4K/ref=sr_1_1?dchild=1&keywords=1%2F8in+Stamping+36-Piece&qid=1588981849&sr=8-1\n\n\nIs not intended to punch steel but brass or copper (do not use aluminum as that will distort and warp in fires). \n\nNow you may be thinking that Its easiest to preset the words before hand and place them in a vice, mold, or tape them together and than use a hammer to smack the whole word at the same time but you would be wrong due to \n\n1) It is much better you hit the stamps with a large amount of force  the first time, and the more your repeat the more chance it will slightly shift leading to double/tipple stamped letters (slightly blurry double vision result ) \n\n2) The letters are tricky to position the right way in a set because they are mirror images of what you intend to stamp and easier to do one at a time . Doing the letters one at a time seems like it would take longer but is quicker in reality\n\n3) The spacing is too much even if you have them side by side unless you do them one at a time \n\nP.S... the 6 and 9 is the same bit in these sets so you just reuse that \n\nP.S.S. technically you only need to stamp out the first 4 letters in BIP 39 backups as those are always unique , but with the 1/8 set you can stamp out the whole word so it looks better with the size of that metal plate above \n\n--------------------------------\n\n\n100mm x 150mm x 0.9 mm copper\n\nhttps://www.amazon.com/0-8mm-100mm-150mm-99-9-Copper/dp/B07GGX3ZSL/ref=sr_1_1?dchild=1&keywords=100mm+x+150mm+plate&qid=1606673306&sr=8-1\n\n\n\n-----------------------\n\nOther tips - \n\n1) Never stamp your passphrase on the same metal plate as the 12 to 24 seed words. When using the passphrase feature found in certain wallets you want the passphrase to be recorded on paper or preferably metal separate than the backup 12/24 words for better security  (you are essentially making something similar to a 2 of 2 multisig)\n\nhttps://wiki.trezor.io/Passphrase\n\nhttps://support.ledger.com/hc/en-us/articles/115005214529-Advanced-passphrase-security\n\nhttps://coldcardwallet.com/docs/passphrase\n\n2) In the extra field stamp the derivation address used in your wallet or at least the wallet name that you used to create the private keys . \n\nHere is an excellent site telling you all the default derivation paths \n\nhttps://walletsrecovery.org\n\n3) Place the brass or copper on some soft wood while stamping it to absorb the impact and allow for better stamps \n\n\nOr \n\nhttps://safu.ninja/\n\nhttps://www.thingiverse.com/thing:4590734\n\nhttps://estudiobitcoin.com/fabrica-tu-billetera-fria-con-arandelas/",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "unai34",
            "title": "Btc Transfer Help Needed!",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/unai34/btc_transfer_help_needed/",
            "author": "broken_chainz",
            "created_utc": 1652277576.0,
            "score": 9,
            "num_comments": 32,
            "subreddit": "BitcoinBeginners",
            "selftext": "So. I’m new to crypto but have been getting down the basics, and recently I’ve decided to accept btc as an option for some goods that I sell. \n\nHere’s the problem:\nSo I decided to open a coinbase account for my crypto needs and use it for my first ever transaction. The account is verified in every way btw. Anyway, I was being sent 1.3k USD worth of BTC (internationally from US to CAD) from my customer through Blockchain, to my coinbase wallet. He is experienced in crypto and has made many purchases using it. \n\nHe sent me the transaction on May 5th, and now today it is may 11th and I have yet to received anything. He said btc transactions are usually “delayed” but I feel 5 days is a little concerning. Should I be concerned? I asked for a receipt from him that says the transaction is pending but he says it “doesn’t update until it’s processed” \n\nWhat do u guys think? \n\nTLDR: first time user of coinbase receiving btc from blockchain wallet international transaction from US to CAD. Been 5 days and no btc seen.",
            "stickied": false,
            "comments": [
                {
                    "id": "i86pwz4",
                    "author": "satstyler",
                    "score": 8,
                    "created_utc": 1652278249.0,
                    "response": "No way it should take 5 days or more ...\n\n&#x200B;\n\nI transferred a small amount of BTC earlier and it only took about 5-10 minutes.\n\nGet the transaction ID and then stick it in here to see whats happening https://mempool.space/",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i86sq63",
                    "author": "bitusher",
                    "score": 6,
                    "created_utc": 1652279398.0,
                    "response": "> He said btc transactions are usually “delayed”\n\nThat is not how Bitcoin works . When someone sends bitcoin , even onchain , you should see the transaction immediately in your wallet and in any block explorer \n\nDid you send the buyer the goods yet?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i86oppz",
                    "author": "subduderecords",
                    "score": 5,
                    "created_utc": 1652277743.0,
                    "response": "he should be able to provide you a transaction ID that can be seen on the bitcoin blockchain. If he's saying he can't do this, then he's either a scammer, or he's lying, or he's just plain dumb.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i86poyo",
                            "author": "broken_chainz",
                            "score": 4,
                            "created_utc": 1652278155.0,
                            "response": "Askin him this as we speak.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i86q3a4",
                                    "author": "subduderecords",
                                    "score": 4,
                                    "created_utc": 1652278324.0,
                                    "response": "Don't be surprised if you've been scammed. Hopefully you haven't been.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i86ozhj",
                    "author": "BTCMachineElf",
                    "score": 3,
                    "created_utc": 1652277856.0,
                    "response": "You need a real wallet. Use a phone wallet like Blockstream Green until you get a hardware wallet. Don't keep your bitcoin on coinbase.\n\nYou should see the bitcoin instantly. It doesn't take days, sometimes hours, and even then he could show you the transaction sitting in the mempool and it should show up in your wallet as unconfirmed right away, until it makes it into a block and becomes confirmed.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i87209b",
                    "author": "TarAldarion",
                    "score": 3,
                    "created_utc": 1652283078.0,
                    "response": "5 days? I transferred 20k in 5 minutes for a euro.\nDon't send goods until you have the money. You can also see that it is due to arrive and needs confirming, and also see the transaction on the blockchain if it was legit.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "un5upo",
            "title": "Do I need to keep my Public key or just the private?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/un5upo/do_i_need_to_keep_my_public_key_or_just_the/",
            "author": "ryan7878",
            "created_utc": 1652261074.0,
            "score": 3,
            "num_comments": 12,
            "subreddit": "BitcoinBeginners",
            "selftext": "Even though I read a lot on bitcoin, I just happened upon only one comment where someone said you need your public key to get your funds.\n\nThat caught me by surprise for a minute.\n\nWhen I made a paper wallet I notice it says private QR for spending. \n\nI have taken a picture of both onto an SD card that will never connect to a computer.\n\nI ciphered the private key part onto paper thinking that's all I need to put into mycelium and withdraw the funds in the future.\n\nI'm just surprised that no-one is saying look after the public key part.\n\nI can now kind of see it after reading about a private key can make many public keys for receiving money so i guess you need to tell the software which public key you want to withdraw from.",
            "stickied": false,
            "comments": [
                {
                    "id": "i85wbss",
                    "author": "bitusher",
                    "score": 8,
                    "created_utc": 1652261325.0,
                    "response": "Sounds like you are making a legacy paper wallet with a bare private key. This is extremely dangerous .\n\nhttps://np.reddit.com/r/Bitcoin/comments/670zhy/summary_pitfalls_of_paper_wallets/\n\nhttps://en.bitcoin.it/wiki/Paper_wallet\n\nhttps://np.reddit.com/r/Bitcoin/comments/6ss91w/seriously_how_are_you_all_generating_your_private/dlf4uhr/\n\nhttps://www.youtube.com/watch?v=TYQ-3VvNCHE&feature=youtu.be&t=3072\n\n\n\n All modern paper wallets should consists of at least 12- 24 seed words and 1 or multiple addresses instead !\n\nIf you already sent bitcoin to that paper wallet you will need to **sweep** not import the funds into a new wallet\n\n\n-----------------\n\nTo answer your question -\n\nMost wallets use hierarchical deterministic (HD) key derivation after bip32.\n\nThis means you have \n\n**Backup Seed words (BIP 39 or other)** consisting of 12-24 words that can than recover \n\n**Master extended private key (xpriv)** Which can generate many private keys \n\n**Master extended public key(xpub)** Which can generate many public keys \n\nAs of which from the public keys many Bitcoin addresses can be derived from. \n\n**This is why if you have a legacy paper wallet you can lose your money . There isn't a single private key but many private keys in a wallet**",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i860snl",
                            "author": "ryan7878",
                            "score": 3,
                            "created_utc": 1652264970.0,
                            "response": "Thank you for the advice, i'll have a look at the links very much appreciated.\n\nI did it recently so i still have the pub keys and did it from bit address using new linux flash usb offline.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "umtiiw",
            "title": "Binance verification SMS but no account",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/umtiiw/binance_verification_sms_but_no_account/",
            "author": "srrt33",
            "created_utc": 1652218761.0,
            "score": 3,
            "num_comments": 19,
            "subreddit": "BitcoinBeginners",
            "selftext": "For the last week or so I've been receiving SMS verification texts that start with \"[Binance US]\" and have a verification code in them. However,I do not and have never had a Binance account. There are no links to press so it doesn't seem like a phishing scam. Does anyone know what's up with this?",
            "stickied": false,
            "comments": []
        },
        {
            "id": "umovy1",
            "title": "What is the best place to purchase a small amount of BTC in Eastern Europe?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/umovy1/what_is_the_best_place_to_purchase_a_small_amount/",
            "author": "[deleted]",
            "created_utc": 1652206115.0,
            "score": 3,
            "num_comments": 25,
            "subreddit": "BitcoinBeginners",
            "selftext": "I am from Ukraine, normally I wouldn’t go around looking for such things, but due to recent events I would like to have a small decentralized backup of my funds, I know that Binance has the official support for people that live in Ukraine, but the opinions that have heard about it weren’t as positive as  expected them to be.",
            "stickied": false,
            "comments": []
        },
        {
            "id": "untfkc",
            "title": "Where can I buy bitcoin without low limits?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/untfkc/where_can_i_buy_bitcoin_without_low_limits/",
            "author": "wilderton7",
            "created_utc": 1652332181.0,
            "score": 3,
            "num_comments": 16,
            "subreddit": "BitcoinBeginners",
            "selftext": "If I understand correctly platforms like Coinbase and binance has a limit of  $400 a week. Any legit platforms that have higher limits? Thanks.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8amuvc",
                    "author": "bitusher",
                    "score": 5,
                    "created_utc": 1652344821.0,
                    "response": "Coinbase has a much higher limit once you verify the account and make an initial purchase . My limit is 35,000 a day as an example (but it takes time to grow that large)\n\nAvoid binance as that is a dangerous exchange with very high fees",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8a83n3",
                    "author": "ArchiMode25",
                    "score": 4,
                    "created_utc": 1652333141.0,
                    "response": "If you are fully verified on Coinbase, Kraken, or Gemini then your limits will be much higher than $400/week.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}