{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uwzk1s",
            "title": "Boycotting central control",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uwzk1s/boycotting_central_control/",
            "author": "Le_German_Face",
            "created_utc": 1653422373.0,
            "score": 8,
            "num_comments": 20,
            "subreddit": "Bitcoin",
            "selftext": "How can Bitcoin avoid the current power grab by western governments?\n\nAs I understand it, they want to go after the exchanges and force them to implement more control but you can always go to Bitcoin holders directly, give them any amount of fiat you want and they can send you Bitcoin directly and if you need to pay rent, you can exchange Bitcoin directly for fiat. I don't understand how it can even be controlled.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9uk1km",
                    "author": "NiceDoctorBeam",
                    "score": 9,
                    "created_utc": 1653422960.0,
                    "response": "Alice has a Bitcoin wallet.  \nBob has a Bitcoin wallet.  \nAlice uses her wallet to generate a receive address.  She gives it to Bob.  \nBob enters Alice's address into his wallet, enters 3.5 BTC, clicks \"send\".  \nAlice soon sees the first confirmation.  \n\nNo government was involved.  No exchanges were involved.  No fiat currency was involved.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ukcvw",
                            "author": "Le_German_Face",
                            "score": -1,
                            "created_utc": 1653423093.0,
                            "response": ">No government was involved. No exchanges were involved. No fiat currency was involved.\n\nBut what did Bob buy from Alice that was worth 3.5 BTC? What did she give him in exchange?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9ul7cs",
                                    "author": "NiceDoctorBeam",
                                    "score": 12,
                                    "created_utc": 1653423454.0,
                                    "response": "> But what did Bob buy from Alice  \n\nThat is none of our business, nor anybody else's; it's just between Alice and Bob.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9vw619",
                                            "author": "Nada_Lives",
                                            "score": 1,
                                            "created_utc": 1653444907.0,
                                            "response": "Improper English! The correct phrase is \"none of your FUCKING business\" with both middle fingers prominently displayed.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9v7wfr",
                                    "author": "TheChoosey1",
                                    "score": 0,
                                    "created_utc": 1653433409.0,
                                    "response": "Sex. Obviously because Bitcoin is only used for illegal stuff. /s",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9ulnvf",
                    "author": "solomonsatoshi",
                    "score": 5,
                    "created_utc": 1653423647.0,
                    "response": "The government may not be able to gain control of ALL Bitcoin but a lot of Bitcoin is held by weak hands who leave it on exchanges and will buy into ETF. All the fiat debt slavery cartel of bankers and government needs to do is lure most Bitcoin onto exchanges and ETF type entities and then they can issue a modern day Order 6102.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9vddk4",
                            "author": "sangderenard",
                            "score": 3,
                            "created_utc": 1653435983.0,
                            "response": "FINE I will begin taking my crypto off of exchanges, I'll have you know you were the last straw.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9velac",
                                    "author": "solomonsatoshi",
                                    "score": 1,
                                    "created_utc": 1653436558.0,
                                    "response": "Good on you but even most crypto can be accessed by governments via their quasi centralised organisational founding structures and securities laws.\n\nOnly Bitcoin is truly decentralised and not deemed a security- Bitcoin in your own custody is most secure from theft-confiscation by governments.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9vevb6",
                                            "author": "sangderenard",
                                            "score": 1,
                                            "created_utc": 1653436692.0,
                                            "response": "Most of what I own is bitcoin, and most of the rest are bitcoin forks that have been around a minute.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9vu9rs",
                            "author": "satscott",
                            "score": 1,
                            "created_utc": 1653444017.0,
                            "response": "Once that happens oh boy. Now the state has all that Bitcoin and the fake iou Bitcoin just gets erased.\nHyperbitcoinization happens.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9uke3d",
                    "author": "DerpDolphin2017",
                    "score": 1,
                    "created_utc": 1653423107.0,
                    "response": "How do you exchange bitcoin directly with fiat?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ukgwf",
                            "author": "Le_German_Face",
                            "score": 3,
                            "created_utc": 1653423140.0,
                            "response": "Bisq",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9vwsk9",
                            "author": "Nada_Lives",
                            "score": 1,
                            "created_utc": 1653445206.0,
                            "response": "By finding someone who wants to trade.\n\nDon't look at me!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9ulyls",
                    "author": "solomonsatoshi",
                    "score": 1,
                    "created_utc": 1653423772.0,
                    "response": "[https://en.wikipedia.org/wiki/Gold\\_Reserve\\_Act](https://en.wikipedia.org/wiki/Gold_Reserve_Act)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9vipe0",
                    "author": "_Royal_Insylum",
                    "score": 1,
                    "created_utc": 1653438542.0,
                    "response": "Happy cake day OP!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9vombu",
                    "author": "Malecite",
                    "score": 1,
                    "created_utc": 1653441352.0,
                    "response": "Easily.\n\nWe already passed a law in Canada forcing exchanges to give up the IDs of their largest clients. So you use an exchange, the government knows your identity.\n\nYou don't want to use an exchange?\n\nThey regulate businesses and prevent them from transacting in bitcoin.\n\nTo fully control it and prevent transactions from ever occurring is implausible, but they don't need to do that. All the gov't needs to is regulate it to the point of being useless for the average person and the value crashes to close to nothing and it goes back to being exclusively used by criminals instead of also being used by criminals.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9vxera",
                            "author": "Nada_Lives",
                            "score": 1,
                            "created_utc": 1653445492.0,
                            "response": "Be specific here. How does any third party \"regulate\" Bitcoin? Inquiring minds want to know.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9vz8q6",
                                    "author": "Malecite",
                                    "score": 1,
                                    "created_utc": 1653446361.0,
                                    "response": "You can't conceive how the SEC and the IRS would impose regulation and enforcement over bitcoin as an asset class like they have with literally everything else?\n\nWatch this: government bans the ability of private digital currencies to be accepted by businesses upon penalty of massive fines and or jail time. Done. \n\nIf the US government actually believed bitcoin was a legitimate threat to its currency that would be the end of bitcoin in the United States.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9w10ks",
                                            "author": "Nada_Lives",
                                            "score": 1,
                                            "created_utc": 1653447217.0,
                                            "response": "They can only regulate their own rotten fiat, and how it can be used.  You can't even report your Bitcoin transactions without expressing it as $$.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9vzn9f",
                    "author": "infopocalypse",
                    "score": 1,
                    "created_utc": 1653446553.0,
                    "response": "IMO peer to peer exchange is SO important even if we want BTC to be a store of value. Because if it is adopted on a large scale it makes on/off ramp control irrelevant. Which is why I will spend btc and store btc. And why 3rd world adoption matters for everyone.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uwzg44",
            "title": "Is my math dumb?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uwzg44/is_my_math_dumb/",
            "author": "AffectionateCanary25",
            "created_utc": 1653422069.0,
            "score": 6,
            "num_comments": 28,
            "subreddit": "Bitcoin",
            "selftext": "Bitcoin's mean annual return is 93.8%\n\nObviously, there's ebbs and flows. Swings between greed and fear. \n\nI do expect the mean return to decline through time. \n\nThe square root of the mean return is roughly 9.5%\n\n(I don't have any good justification for taking the square root of the mean, it just sounds safe for an asset with exponential adoption). \n\nSo my thinking is that you buy $100 of Bitcoin today wait at least 3 years and then sell a max of $9.50 annually.\n\nWouldn't it be almost guaranteed that your Bitcoin appreciated by 9.5% annually? \n\nI got this idea from the Jack Bogel people that use 4% from the stock market yields for retirement. \n\nIf someone bought 100k worth of Bitcoin today, and waited maybe even just a year and withdrew $9,500. \n\nIsn't it probable that their Bitcoin has appreciated more than the $9500 they initially withdrew? \n\nThis year will probably be the worst for Bitcoin but then we can have more data about the mean annual return. \n\nI don't plan on selling my Bitcoin for awhile, but let's say I lose my job. I could feel good selling 9.5% of my holdings and feel secure that the value will be the same within a year of withdrawal. \n\nDoes this make sense? \n\nI also understand the pitfalls of buying at the wrong times but this seems to become easier the more I learn about Bitcoin.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9ulkgg",
                    "author": "DerpDolphin2017",
                    "score": 7,
                    "created_utc": 1653423608.0,
                    "response": "No, your math is not dumb.  Very conservative actually.  Let’s say it drops down to 50% gains over the next cycle, then 33% with the following cycle, then 25% etc.  Until it gets down to just beating inflation + 5%.  With 4 year cycles, you have at least 12 years of incredible gains.  You should be easily able to live off of your profits for the rest of your life if you initially invested 5 x your annual income.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9uz2au",
                    "author": "Vegas_42",
                    "score": 3,
                    "created_utc": 1653429413.0,
                    "response": "this might be a problem with assuming the mean is a good approximation for a retirement plan:\n\n[sequence of returns problem](https://retireone.com/sequence-of-returns-risk/?doing_wp_cron=1653105749.2803969383239746093750#:~:text=Sequence%2Dof%2Dreturns%20risk%2C,and%2For%20early%20in%20retirement.)",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9vem5r",
                            "author": "AffectionateCanary25",
                            "score": 1,
                            "created_utc": 1653436570.0,
                            "response": "This is a good perspective to consider, thank you",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9uv5a2",
                    "author": "igadjeed",
                    "score": 5,
                    "created_utc": 1653427698.0,
                    "response": "> Does this make sense?\n\nNo",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9uvtlt",
                            "author": "AffectionateCanary25",
                            "score": 1,
                            "created_utc": 1653427995.0,
                            "response": "What doesn't make sense?\n\nBitcoin appreciates fast. \n\n1) Buy $100 of Bitcoin today\n2) Wait at least a year\n3) Withdrawal an amount that is less than the appreciation. \n\nI believe that amount is around 9.5%",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9uwr3p",
                                    "author": "igadjeed",
                                    "score": 5,
                                    "created_utc": 1653428404.0,
                                    "response": "> Bitcoin appreciates fast\n\nYou are predicting the future. That's very foolish",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9uyzeq",
                                            "author": "AffectionateCanary25",
                                            "score": 3,
                                            "created_utc": 1653429379.0,
                                            "response": "I took the average return for the last decade and then took the square root of that number. \n\nI think that's pretty conservative. \n\nThere's even estimates that 4% of Bitcoin is lost annually.\n\nWhen you consider the scarce supply, 9.5% sounds ridiculously low in retrospect.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9uzbxh",
                                                    "author": "igadjeed",
                                                    "score": -3,
                                                    "created_utc": 1653429529.0,
                                                    "response": "You're a confirmed member of the \"number go up\" cult. Embrace your delusions",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9v3y5q",
                                                            "author": "AffectionateCanary25",
                                                            "score": 2,
                                                            "created_utc": 1653431585.0,
                                                            "response": "This is the same mentality as real estate, gold, treasury bonds...\n\nEveryone is looking for \"number go up\" assets.\n\nI choose the asset that is the most scarce and most portable. \n\nI already have a home.\n\nRetaining purchasing power is imperative in an inflationary world.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9vjdo1",
                                                                    "author": "thatbritlyfe",
                                                                    "score": 1,
                                                                    "created_utc": 1653438868.0,
                                                                    "response": "I’m with you on this. Yeah it’s hard to put a number on it. \n\nBut do I think over a 30 year time period BTC will outperform mark other assets. For sure. \n\nThis guy is in the wrong sub with his mindset. Why else are you investing in BTC if it’s not to get a return on investment?",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9vj6lw",
                                            "author": "thatbritlyfe",
                                            "score": 1,
                                            "created_utc": 1653438775.0,
                                            "response": "Why do people invest…? Because they predict they’ll get a return.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9uqbdd",
                    "author": "Boe_Ning",
                    "score": 1,
                    "created_utc": 1653425613.0,
                    "response": "Bias in choosing your method of analysis?  At what rate is growth slowing over time?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9usu6w",
                            "author": "AffectionateCanary25",
                            "score": 2,
                            "created_utc": 1653426694.0,
                            "response": "I mean, there could be a hyperadoption cycle that lasts a decade with amazing returns but eventually Bitcoin will have returns that reflect economic output. \n\nMeaning that eventually Bitcoin's value as a store of wealth is fully realized and an equilibrium is reached between buyers for the future and sellers for the present (example: heart medication for when I'm old).",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9vvbic",
                    "author": "Stunning_Novel9398",
                    "score": 1,
                    "created_utc": 1653444500.0,
                    "response": "Even better- lock away 100k for 22 years and you will have twice the current annual GDP of the USA.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9vzyy7",
                            "author": "AffectionateCanary25",
                            "score": 1,
                            "created_utc": 1653446711.0,
                            "response": "Yeah I don't think that will happen unless the dollar goes through hyperinflation. \n\nI don't really believe the dollar will disappear. \n\nI think it's reasonable to assume 9.5% withdrawal rate. \n\n4% is loss of coins/keys.\n2% is the intended rate of inflation for the dollar (which is currently much higher now). \n\nDo I think that 3.5% could be the demand? Yeah, I do.\n\nI think that's more than reasonable. \n\nThere could be a -10% year followed by +19.5% year. \n\nThe point is your taking out less than what it actually appreciates.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9w4n3p",
                                    "author": "Stunning_Novel9398",
                                    "score": 1,
                                    "created_utc": 1653449032.0,
                                    "response": "I’m not sure if you are joking or not.\n\nThere is so much wrong with your maths.\n\nFirstly the square root of 93.8% is not ~9.5%, it’s ~96.8%.\n\nThe 4% rule is based on the trinity study which backtested a portfolio based on many previous 30 year periods in the history of equity markets. They then used this to estimate the risk of portfolio failure over a 30 year period and came up with 4% as a pretty safe number. That said there were still several periods which did result in portfolio failure. \n\nSo firstly, there is absolutely not enough historic data to do anything resembling this with BTC. \n\nSecondly you can’t just approximate a safe withdrawal rate based on the average annual return as this does not account for sequence of return risk.\n\nA -10% year followed by a +19.5% year does not equal +9.5% overall - I’m not sure if you were trying to imply it does… if you are you don’t understand the mathematics of this…\n\nPlease don’t base any serious plans off this",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9ukc7y",
                    "author": "NiceDoctorBeam",
                    "score": 0,
                    "created_utc": 1653423085.0,
                    "response": "Why sell?  For what?  For flimsy, failing fiat currency?  You already have that.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ulxlq",
                            "author": "AffectionateCanary25",
                            "score": 2,
                            "created_utc": 1653423760.0,
                            "response": "Like if you lose your job and want to continue paying your mortgage. \n\nSure everyone should have an emergency fund. \n\nI'm just going through a thought experiment where I would need to purchase 250k Bitcoin in order to guarantee roughly 23k/yr.\n\nI think after 3 years, it's likely to have that perpetual 9.5% annually.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9unmo5",
                                    "author": "NiceDoctorBeam",
                                    "score": 0,
                                    "created_utc": 1653424473.0,
                                    "response": "Everyone should maintain an emergency cash cushion.  I recommend holding enough to pay all your bills for at least one full year (two years, even better).  \n\nWithout an emergency fund, a person has no business \"investing\" -- not even to buy a home.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9uoo29",
                                            "author": "AffectionateCanary25",
                                            "score": 2,
                                            "created_utc": 1653424912.0,
                                            "response": "A years worth is extreme. \n\nThat's a guaranteed loss of 8% (possibly more) \n\nI think 3-month's worth of cash is fine. \n\nIf your equities and crypto are appreciating faster than inflation then it's not a big deal to sell when you need to. \n\nA years worth of cash just seems silly unless you have a very turbulent lifestyle. \n\nSure I could get cancer tomorrow and I would need to liquidate my Bitcoin but it's more likely that I won't get cancer tomorrow. So it's better to beat inflation today.\n\nI think your \"safe\" cash position will actually lose you more money by the time you need to use it.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9urja0",
                                                    "author": "NiceDoctorBeam",
                                                    "score": -2,
                                                    "created_utc": 1653426133.0,
                                                    "response": "One or two years worth is wise.  I'm not like everybody else.  I'm doing way better that average.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9utcys",
                                                            "author": "AffectionateCanary25",
                                                            "score": 3,
                                                            "created_utc": 1653426923.0,
                                                            "response": "If you're doing better than average then you don't really need an emergency fund.\n\nYou can just liquidate assets. \n\nYou would have enough value in equities that even selling at a loss is still better than losing that value via inflation.\n\nEdit: That is how bad inflation has become. \n\nThose 9 additional months-worth of money lost 8% when they could have gained 20% (even with this recent downturn). \n\nTwo years of cash sounds like someone with a cocaine habit.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9uxr98",
                                                                    "author": "TownConscious",
                                                                    "score": 0,
                                                                    "created_utc": 1653428846.0,
                                                                    "response": "When you said, “you can just liquidate assets” is the moment you lost that little back and forth.  Having an emergency fund is the whole point of what doc is saying, so one DOESN’T get liquidated.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9v0jls",
                                                                            "author": "AffectionateCanary25",
                                                                            "score": 1,
                                                                            "created_utc": 1653430059.0,
                                                                            "response": "You can liquidate funds at a loss and then deduct that loss from tax obligations. This is almost always better than a loss via inflation. \n\nAlso... What exactly is the emergency here? Kid needs new glasses? Car dies?\n\nThere's few reasons why you immediately need more than 6 grand. \n\nDo you really need 12 grand tomorrow?\n\nMost things that require large sums of money have a reasonable enough timeline to pay.\n\nDo you need 20 grand in cash for... Like a ransom?",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i9v11w0",
                                                                                    "author": "NiceDoctorBeam",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653430285.0,
                                                                                    "response": "You go ahead and be a fool.  \n\nI've never been forced to sell an investment.  \n\nLiquidating Bitcoin when it's down 50% or more in order to avoid losing 8% to inflation... that's a special category of \"*rocket science*\" LOL",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i9v1z0a",
                                                                                            "author": "AffectionateCanary25",
                                                                                            "score": 1,
                                                                                            "created_utc": 1653430698.0,
                                                                                            "response": "I think something got lost in translation here lol\n\nHow many emergencies do you have a year? Lol\n\nHow many of those emergencies require more than 10 grand immediately?",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "id": "uwzlaq",
            "title": "Best way to set up a recurring buy on Coinbase/Coinbase Pro",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uwzlaq/best_way_to_set_up_a_recurring_buy_on/",
            "author": "FamiliarDuck",
            "created_utc": 1653422454.0,
            "score": 5,
            "num_comments": 15,
            "subreddit": "Bitcoin",
            "selftext": "I’ve been trying to set up a recurring monthly buy on the Coinbase pro app but have been running into some issues, mainly that I can only set it up to convert into USD on the app and would have to manually go in and purchase it every month. Is this feature only available on regular Coinbase, or is there a way to set it up on Pro? I’m not really trying to pay those fees every month for the relatively small amount I’m looking to purchase. Any advice is appreciated!",
            "stickied": false,
            "comments": [
                {
                    "id": "i9uj4ck",
                    "author": "Content-Neck-6155",
                    "score": 2,
                    "created_utc": 1653422567.0,
                    "response": "Coinbase has big fees, I would recommend using the api for coinbase pro and create a recurring buy script.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ukfut",
                            "author": "FamiliarDuck",
                            "score": 1,
                            "created_utc": 1653423128.0,
                            "response": "Yeah the Coinbase fees are crazy. I’ve seen the api option mentioned elsewhere, guess I was just hoping there would be a recurring buy option for dummies on Pro lol",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9ux05z",
                    "author": "CharmandrCHARR",
                    "score": 1,
                    "created_utc": 1653428512.0,
                    "response": "Stop using coinbase",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9v2c44",
                    "author": "deepoak40965",
                    "score": 1,
                    "created_utc": 1653430856.0,
                    "response": "So I got into the game via Coinbase.  Shortly after bought a ledger, which holds my coin.  But I use Coinbase to purchase.  \n\nI just set up a weekly DCA for BTC on Coinbase (regular). \n\nAre fees bad if I switch to pro?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9vhk8a",
                            "author": "senfmeister",
                            "score": 2,
                            "created_utc": 1653437997.0,
                            "response": "Coinbase has recurring buys and high fees, Coinbase Pro has low fees but no recurring buys. You can try Strike for recurring buys and low fees.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9viobe",
                                    "author": "deepoak40965",
                                    "score": 1,
                                    "created_utc": 1653438528.0,
                                    "response": "Thanks!!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9vdti1",
                            "author": "kuzkokronk",
                            "score": 1,
                            "created_utc": 1653436192.0,
                            "response": "The fees on Coinbase Pro are significantly cheaper than on regular Coinbase. The downside is that there's no auto-purchase on Coinbase Pro. But the low fees make up for it, in my opinion.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9vimuw",
                                    "author": "deepoak40965",
                                    "score": 2,
                                    "created_utc": 1653438509.0,
                                    "response": "Thanks!!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9ve4dq",
                    "author": "kuzkokronk",
                    "score": 1,
                    "created_utc": 1653436335.0,
                    "response": "I set up an alarm for every Sunday at noon to log on to the Coinbase Pro app on my phone. I then do a limit buy of $25. Takes me all of 15 seconds, and I'm not paying the ridiculous fees of regular Coinbase.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9vevuc",
                    "author": "comfyggs",
                    "score": 1,
                    "created_utc": 1653436699.0,
                    "response": "make limit orders on Pro. Once a month should be manageable. Once a week or day or hour would call for automation. Other than that there is no recurring buy because it's not really built for it. and yes the fees are much higher on regular coinbase for a reason, you pay a premium to set and forget. Pro is about finding the best price, different ethos.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9vfa94",
                    "author": "PRMan99",
                    "score": 1,
                    "created_utc": 1653436887.0,
                    "response": "Honestly Cash App is easier for this.\n\nhttps://cash.app/help/us/en-us/31091-schedule-automatic-purchases",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9vhe25",
                    "author": "senfmeister",
                    "score": 1,
                    "created_utc": 1653437912.0,
                    "response": "Use Strike instead if it's available in your area.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9wqmnk",
                    "author": "Bitcoin__Hodler",
                    "score": 1,
                    "created_utc": 1653463614.0,
                    "response": "Strike",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9v72m9",
                    "author": "Marcion_Sinope",
                    "score": 0,
                    "created_utc": 1653433026.0,
                    "response": "That's like asking what's the best way to submerge your hand in a vat of sulfuric acid.\n\nThe only 'right way' to deal with Coinbase is to not use them.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uwz7t3",
            "title": "The Evolution Of Bitcoin Pizza Day Celebrations",
            "url": "https://bitcoinmagazine.com/culture/evolution-of-bitcoin-pizza-day",
            "author": "Internet_Finds",
            "created_utc": 1653421435.0,
            "score": 4,
            "num_comments": 3,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9ugl3u",
                    "author": "coinfeeds-bot",
                    "score": 1,
                    "created_utc": 1653421511.0,
                    "response": "tldr; Rick Poach, a Bitcoin enthusiast, poet, author and author, hosted a Bitcoin Pizza Day event in New Haven, Connecticut. Poach's catering service, Make America Great Apizza, made the crust entirely from scratch, and he only used the freshest vegetables and ingredients. Tickets to the event were only available in bitcoin.\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ugto2",
                    "author": "Nada_Lives",
                    "score": 1,
                    "created_utc": 1653421609.0,
                    "response": "Give it a rest until next year, already!",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}