{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "usqlwa",
            "title": "Sometimes I wonder how this guy is doing. 50k to ~13M today, assuming he held onto all his BTC.",
            "url": "https://np.reddit.com/r/Bitcoin/comments/1kpsi5/i_put_all_my_life_savings_into_bitcoins/",
            "author": "NXCW",
            "created_utc": 1652919099.0,
            "score": 56,
            "num_comments": 37,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i95pov7",
                    "author": "Think_Cat7703",
                    "score": 53,
                    "created_utc": 1652929564.0,
                    "response": "Hal Finney responds to him in this thread:  \n\n\n>Having savings of $50000 at 30 means you've got substantial earning potential. Even if Bitcoin is wiped out, you can start over. And there's a chance that you'll get very rich.  \nOne piece of advice. Research has shown that happiness obtained by buying things is fleeting, because you get used to them. Better to invest in experiences and memories, because they'll be with you always.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i96us83",
                            "author": "resjohnny",
                            "score": 4,
                            "created_utc": 1652960103.0,
                            "response": "So two girls at once?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i97ry5q",
                                    "author": "BBQCopter",
                                    "score": 1,
                                    "created_utc": 1652975778.0,
                                    "response": "Why not three?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i95ql9v",
                            "author": "88eth",
                            "score": 8,
                            "created_utc": 1652930029.0,
                            "response": "+tip 1 BTC verify",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i96sr3z",
                            "author": "rtech50",
                            "score": 2,
                            "created_utc": 1652958751.0,
                            "response": "And only gets 228 upvotes. We have come so far.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i96f56a",
                            "author": "gybemeister",
                            "score": -3,
                            "created_utc": 1652947183.0,
                            "response": "I don't quite agree with that research, it reminds me of the \"you will own nothing and will be happy\" mantra. If you buy things (assets) that you can sell later, even at a discount, you will be richer than if you spend it on a trip (unless there is something specially enriching in that trip like learning a skill).",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i96m01j",
                                    "author": "nickname432",
                                    "score": 3,
                                    "created_utc": 1652953429.0,
                                    "response": "lol people downvoting because someone's sharing an opinion",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i96fy68",
                                    "author": "givvy12",
                                    "score": 2,
                                    "created_utc": 1652947911.0,
                                    "response": "But richer does not equal more happiness, which is your unstated assumption. Hal is refering to hapiness, not gaining more wealth. \n\nHere is an article about the research he is mentioning:\n\nhttps://www.theatlantic.com/business/archive/2014/10/buy-experiences/381132/",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i96sm9r",
                                            "author": "NXCW",
                                            "score": 2,
                                            "created_utc": 1652958656.0,
                                            "response": "Hal is only partially correct here. Money does positively affect your wellbeing and overall happiness, but only up to a certain point. I've seen some research from the UK where they saw a very apparent correlation between happiness (overall, so presumably a mix of buying things, experiences and general finanacial security) and income, but only up to about 50-60k pounds per year. After that, additional income did not make much of a difference. I tried looking for the source but just couldn't find it. I'm sure there's more research on the topic available.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i96x9ko",
                                                    "author": "sgt_happy",
                                                    "score": 3,
                                                    "created_utc": 1652961625.0,
                                                    "response": "Basically your happiness derives from being financially independent.\nIf economy does not cause you worry, you will be happier than if economy DOES cause you worry.\nSo someone can be a multi billionaire and still be less happy than a millionaire, as neither have the worry of being able to buy the stuff they need.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i977n29",
                                                            "author": "NXCW",
                                                            "score": 2,
                                                            "created_utc": 1652967103.0,
                                                            "response": "Financial independence is, unfortunately, only a dream for the majority of people, thus it doesn't really align with the findings of that study. I wouldn't say someone earning 60k is financially independent, pretty far from it. \n\nPeople have needs, but people also have desires. At 60k, you're not going to be rich, but you will be able to, within reason, buy everything you want - car, holidays, house mortgage, new iPhone once a year, a night out a few times a month. I think that's mostly what this is all about, being able to get what you want. Earning more (over 60k) will just let you buy nicer stuff, which is not nearly as impactful of a change to your life as fulfilling your needs and wants in the first place was.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i96ykit",
                                            "author": "gybemeister",
                                            "score": 2,
                                            "created_utc": 1652962385.0,
                                            "response": "As said elsewhere there is actually a correlation between money and happiness and I was also aware of the study in the UK..\n\nAs I stated before, I don't agree with the results of that research. It may be correct that the majority of the population feels like that but I don't review myself in it. Unfortunately I cannot find the numbers in the latest study of the article above to see how relevant it actually is.\n\nI have had many experiences and bought many things over the years and I derive much longer happiness from, for example, listening to my CDs over and over again than from the concerts I went to (some of which I have very little memory - I am not that young anymore I guess). I could say the same thing about a bike or a car or even an outfit.\n\nOn a more general note, there is a tremendous pressure to go out there and \"do\" the  Louvre, the Australian outback, Turkey, Bali, etc, etc essentially throwing money out of the window in exchange for a time limited experience. I come to realise that this is a purer form of consumerism than buying assets, enjoy them, and maybe resell when times are tough - I mean, very much in the Bitcoin saving spirit!",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i985ace",
                                                    "author": "OtherDetective",
                                                    "score": 1,
                                                    "created_utc": 1652981130.0,
                                                    "response": "I was one of the people who upvoted your original comment. I completely agree with you. We all derive happiness from different things. Some people will even derive happiness by taking their BTC to the grave. What they forget is that *everything* is an experience. \n\nSomebody is on some far away land experiencing their experience, which they saved up for months.\n\nSomebody else didn’t have that experience, but their energy level is permanently higher because they put their money in investments and have the experience of zero financial worries. \n\nI’d take the latter. \n\nI agree with you. I think the down-voters are delusional and have much to learn.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i98c0n3",
                                                            "author": "gybemeister",
                                                            "score": 1,
                                                            "created_utc": 1652983850.0,
                                                            "response": "\"What they forget is that everything is an experience\"\n\nYou nailed it!\n\nThanks, I am not worried about the downvotes. Some people just react like that instead of engaging with an healthy discussion but I am sure most people appreciate :)",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i98e8px",
                                                                    "author": "OtherDetective",
                                                                    "score": 1,
                                                                    "created_utc": 1652984764.0,
                                                                    "response": "I see some upvotes now. What a time to be alive haha 🤠",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i96hgub",
                                    "author": "BTCstack3r",
                                    "score": 2,
                                    "created_utc": 1652949287.0,
                                    "response": "If you buy a new car/house/laptop/phone whatever, after a few weeks it becomes \"normal\". And at some point buying new things don't make you more happy at all, most often it becomes a drag.\n\nIF you go do something for the first time tho (experience), like snowboarding, hiking in mountains, diving, whatever. It will stay with you forever, for example, remember your childhood where you did things for the first time..\n\nBut again, visiting the 101 country not gonna make you happier than the 100th, so it does count for this as well.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i955szd",
                    "author": "a2468b",
                    "score": 17,
                    "created_utc": 1652920114.0,
                    "response": "Dude commented 4 times in r/Bitcoin and vanished. I hope he's doing well man.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i97s2ri",
                            "author": "BBQCopter",
                            "score": 1,
                            "created_utc": 1652975832.0,
                            "response": "He's having way too much fun right now IRL than to waste time on this subreddit with us plebs. At least I hope.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i95891q",
                    "author": "Days_of_Static",
                    "score": 16,
                    "created_utc": 1652921267.0,
                    "response": "“Shit son, you need to diversify your portfolio”\n\nWell that didn’t age well at all did it?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i97awnf",
                            "author": "Jps300",
                            "score": 2,
                            "created_utc": 1652968609.0,
                            "response": "To be fair, in retrospect telling a mega-millions winner they should stop playing the lottery would have aged poorly, but that doesn’t make it wrong. That being said, I have 95% of my net worth in Bitcoin so I’m on board, but I’m aware that there are much safer ways to invest.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i97f2og",
                                    "author": "Days_of_Static",
                                    "score": 1,
                                    "created_utc": 1652970439.0,
                                    "response": "No doubt. We all make decisions based on the information we have at the time… it’s just funny to read things now in the future with the gift of hindsight.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i958tj9",
                    "author": "snash222",
                    "score": 6,
                    "created_utc": 1652921530.0,
                    "response": "If it was mid/late 2013 the price crashed 90% soon after.\n\nhttps://i.imgur.com/yIpEYg2.jpg",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i95qmbb",
                            "author": "88eth",
                            "score": 1,
                            "created_utc": 1652930044.0,
                            "response": "Hal and him stopped posting on reddit shortly after maybe that was the reason. Everyone in a depression",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i95rgoe",
                                    "author": "snash222",
                                    "score": 2,
                                    "created_utc": 1652930485.0,
                                    "response": "Wow, I hadn’t noticed that Hal had posted there. I’ve only read some of his comments on bitcointalk.org",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i956wl5",
                    "author": "phikapp1932",
                    "score": 10,
                    "created_utc": 1652920631.0,
                    "response": "Found in the comments that OP kept it on an infamous exchange…MtGox. And an ominous reply to OP’s comment about it:\n\n“You have a choice of either betting $50,000 that MtGox won't get shutdown or robbed, or betting $50,000 that you can study enough about encrypted wallets to keep your bitcoins safe from hackers and hardware failures.\n\nNeither option is risk free, and the stakes are high. Make sure you know what excatly you're buying in to!”\n\nI think we know what happened",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i957rcy",
                            "author": "NXCW",
                            "score": 10,
                            "created_utc": 1652921034.0,
                            "response": "But he did also say that he's in the process of figuring out offline wallets and then subsequently commented about having moved his BTC to one. Maybe he's okay.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i959oqd",
                                    "author": "phikapp1932",
                                    "score": 5,
                                    "created_utc": 1652921939.0,
                                    "response": "I hope so, I mean we’re right in the meat of when OP said they were going to hold for\n\nEdit: the MtGox hack happened 6 months after OP posted this. Let’s hope that they got around to it. What a crazy time to be a bitcoin holder. I know if I got in that early, my dumb ass would have left the coins on the exchange.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9738gz",
                    "author": "khufu42",
                    "score": 3,
                    "created_utc": 1652964948.0,
                    "response": "That dude whales.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i962v1i",
                    "author": "handheldbbc",
                    "score": 3,
                    "created_utc": 1652937399.0,
                    "response": "He could buy an entire 3 bd rm house in So Cal with that much if he held",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9544zt",
                    "author": "krlundgren",
                    "score": 2,
                    "created_utc": 1652919328.0,
                    "response": "Wow",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i96sbac",
                    "author": "CryptoCure-ious",
                    "score": 1,
                    "created_utc": 1652958440.0,
                    "response": "He gooood",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i97fbq0",
                    "author": "havoc414",
                    "score": 1,
                    "created_utc": 1652970548.0,
                    "response": "Or i wonder if [this guy](https://www.reddit.com/r/Bitcoin/comments/1bpks7/i_mined_3000_bitcoins_on_a_pentium_3_as_a_lark/?utm_source=share&utm_medium=ios_app&utm_name=iossmf) found his mined bitcoin or just bought a bottle of scotch  ? He seems to be one of the only old /bitcoin member to still be active on reddit. A real og there .",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}