{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "urw99a",
            "title": "Find security, aim to own at least 0.0005 btc",
            "url": "https://www.reddit.com/r/Bitcoin/comments/urw99a/find_security_aim_to_own_at_least_00005_btc/",
            "author": "Karmaa",
            "created_utc": 1652821216.0,
            "score": 2,
            "num_comments": 11,
            "subreddit": "Bitcoin",
            "selftext": "From all indications, a devastating recession hitting in the coming next couple of years is highly probable. \n\nThere are more countries currently who have no choice but to literally start printing money due to the collapse of various revenue streams than ever before.\n\nFait by the nature of it's representation, will be extremely diluted as a consequence. The only safeguard against this, is converting it to Bitcoin.\n\nThe only move right now should be getting ahead of the curve, and diversifying your currency. Don't wait, all the indicators are firing hot.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8zvysa",
                    "author": "Minefrans00",
                    "score": 5,
                    "created_utc": 1652822646.0,
                    "response": "Stating things about to happen in the future is stupid my man. Nobody knows shit, do what you want with your money.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i90m9i0",
                    "author": "Jean_Claude_Van_Darn",
                    "score": 4,
                    "created_utc": 1652834857.0,
                    "response": "I spent more than that on lunch",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i90hwn9",
                    "author": "thats_just_right",
                    "score": 3,
                    "created_utc": 1652832811.0,
                    "response": "Why .0005 BTC specifically?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i90k7wc",
                            "author": "Flimsy_Card8028",
                            "score": 2,
                            "created_utc": 1652833892.0,
                            "response": "Yeah, that's like $15 worth.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i90sum9",
                            "author": "Karmaa",
                            "score": 1,
                            "created_utc": 1652837960.0,
                            "response": "It's a value I think most people can afford. I know \\~$15 doesn't seem like much, but that is roughly the amount of money people can part with without fear.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i903zba",
                    "author": "restore_democracy",
                    "score": 2,
                    "created_utc": 1652826188.0,
                    "response": "Sure, that ought to do it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i90se4c",
                    "author": "horsecyack",
                    "score": 1,
                    "created_utc": 1652837740.0,
                    "response": "Are you asking this to pump your own bags?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8zutpl",
                    "author": "HlIlM",
                    "score": -1,
                    "created_utc": 1652822165.0,
                    "response": "I think you mean gold.  Inflation and higher probability of recession has caused BTC to lose value against the dollar, and the dollar to lose value against gold.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i903vjh",
                            "author": "restore_democracy",
                            "score": 2,
                            "created_utc": 1652826139.0,
                            "response": "So then sell low and buy high?",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i90nnmp",
                            "author": "averagewokehuman",
                            "score": 1,
                            "created_utc": 1652835514.0,
                            "response": "Why? gold is better used for electronics.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i90vkk5",
                                    "author": "HlIlM",
                                    "score": 1,
                                    "created_utc": 1652839238.0,
                                    "response": "Gold and BTC have gone opposite directions the last couple months.  That was one of the reasons BTC was selling off, the correlation with stocks proved too high for the modern portfolio theory guys.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "id": "urw5q0",
            "title": "Bitcoin Full Node - High Upload",
            "url": "https://www.reddit.com/r/Bitcoin/comments/urw5q0/bitcoin_full_node_high_upload/",
            "author": "Marluff",
            "created_utc": 1652820959.0,
            "score": 4,
            "num_comments": 4,
            "subreddit": "Bitcoin",
            "selftext": "Hello everybody!\n\nAlthough I'm in the market for quite a while, I just recently joined the bitcoin network with my own full node (bitcoind, v22.0.0, full sync). I really enjoyed setting it up and the whole process was pretty straight forward. I'm currently not using tor (yet) but I'm committed to improve my setup over time.  \n\n\nRegarding the title.. for the first few days network traffic seemed pretty normal, I had about 1GB down/upload in total which was fine, since all guides talked about traffic of up to 200GB a month (which would still be fine, since I dont have data limits).\n\n  \nFor the last 8h however the upload traffic increased by a huge amount. I looked into my peers and two of them are sitting at 20GB of upload traffic. So I'm wondering what is going on there and if this is normal or a point of concern. Are they just syncing their nodes with the blockchain and drawing data from my node? Or should I be worried about their activity?\n\nSince bitnodes.io  is currently down for me I also can't check if these nodes have been created recently.\n\nIf any seasoned node operators could share their experience with network traffic I would be grateful. Just to be clear, I do not want to complain about the traffic, I just want to make sure this is a normal behaviour.\n\nThank you all!",
            "stickied": false,
            "comments": [
                {
                    "id": "i8zss8b",
                    "author": "SmoothGoing",
                    "score": 2,
                    "created_utc": 1652821298.0,
                    "response": "Why outdated version?\n\nSee maxuploadtarget option in config.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8ztks7",
                            "author": "Marluff",
                            "score": 1,
                            "created_utc": 1652821633.0,
                            "response": "Good question, I know theres a v23 release but bitcoin.org currently lists v22 as latest and I set it up with their guide, I guess they are always trailing a bit till the latest version has proven itself?",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8zubuf",
                            "author": "Marluff",
                            "score": 1,
                            "created_utc": 1652821957.0,
                            "response": "Thanks for the config hint, I guess I could set this option if the traffic gets out of hand.\n\nBut would you say the numbers I stated are in a normal range?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}