{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uvw4l1",
            "title": "under 18 looking for giving $5 nzd for $5 in Bitcoin bc1q9pw9dqlpyps8j79maej2ttf6rc6dm60rfw83rc there's my wallet address",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uvw4l1/under_18_looking_for_giving_5_nzd_for_5_in/",
            "author": "Avatar_aangTLA",
            "created_utc": 1653297199.0,
            "score": 0,
            "num_comments": 1,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9nx5if",
                    "author": "Amoci",
                    "score": 1,
                    "created_utc": 1653297519.0,
                    "response": "no begging",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uvw5zr",
            "title": "I’m looking at getting a trezor one.",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uvw5zr/im_looking_at_getting_a_trezor_one/",
            "author": "mantits-",
            "created_utc": 1653297391.0,
            "score": 3,
            "num_comments": 12,
            "subreddit": "Bitcoin",
            "selftext": "I just can’t figure out how it works before I buy it… does it have its own keys made on it and I just plug it into my pc to access?\n\nHow do I view what I have?\n\nI can’t find any videos explaining what I’m trying to understand I guess.\n\nI have only used hot wallets so far so I apologize for the stupidity.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9nyv1j",
                    "author": "Mallardshead",
                    "score": 5,
                    "created_utc": 1653299116.0,
                    "response": "Your Trezor (like all hard wallets) simply encrypt your private keys. There is no bitcoin in the wallet. Bitcoin never leaves the blockchain. Your private keys are generated once you create a wallet. Your TREZOR will do this the first time you set it up. You will need to write these private keys (24 words) down and keep them in a secure place.\n\nYour hard wallet will require a PIN to open the device and to sign (send) transactions. You will set this PIN when you first set up the wallet.\n\nTrezor has its own site. Here you'll find Trezor Suite, which is a desktop suite that you see your balance and transact from using your connected hard wallet.\n\nYour Trezor wallet will work with any desktop wallet, you don't have to use Trezor Suite.\n\nIf Trezor goes out of business or you break your hard wallet it doesn't matter. The only thing that matters are the private keys you have safely stored. With these, you can recover your bitcoin with any other hardware wallet or from any software wallet in the world.\n\nAfter you are comfortable, find what's called your Trezor wallet's *xpub.* Plenty of tutorials out there for this and it's stupid simple even for those not technically inclined. You can import this xpub into any mobile wallet on your phone and create what's called a *watch-only* wallet. This allows you to see all inbound/outbound transactions, and to generate addresses for receiving bitcoin. No bitcoin can be sent or spent however, making it safe to have on your phone, desktop, etc.\n\nLastly, buy your Trezor direct from manufacturer. No third parties, no used hard wallets.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9obeib",
                            "author": "Llonga",
                            "score": 2,
                            "created_utc": 1653308383.0,
                            "response": "I never knew I could generate a receiving address from a watch only wallet. I use BlueWallet. But there is also a “Send” option. Should I be worried?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9odpqs",
                                    "author": "Mallardshead",
                                    "score": 1,
                                    "created_utc": 1653309723.0,
                                    "response": "You can't actually send without signing the tx with a hard wallet. For BlueWallet which is mobile, you'll need an NFC enabled hard wallet if you want to sign a tx to send it. Most Hard Wallets coming out this year are being updated with NFC capability, so you can just tap your phone. Very convenient.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9oflcz",
                                            "author": "Llonga",
                                            "score": 1,
                                            "created_utc": 1653310755.0,
                                            "response": "Got it, thanks",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9nydax",
                    "author": "Egge_",
                    "score": 2,
                    "created_utc": 1653298665.0,
                    "response": "Yes hardware wallets will generate keys for you. If you don’t want to trust the device, then use some dice to roll your mnemonic and then use the restore function to enter it",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9nywcg",
                    "author": "Manny_4200",
                    "score": 2,
                    "created_utc": 1653299146.0,
                    "response": "I have a Trezor its pretty cool",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9o2h6k",
                    "author": "ariN_CS",
                    "score": 2,
                    "created_utc": 1653302215.0,
                    "response": "Trezor gives you 2 nice little papers on which you can write your seedphrase. You can keep one and lock the other one up",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9nxuzp",
                    "author": "bitcornhodler",
                    "score": 1,
                    "created_utc": 1653298186.0,
                    "response": "As far as I’m aware, it will create a wallet for you. \n\nIf you were to create your own wallet, I think you would select an option such as ‘restore wallet’ where you would use a seed phrase created by you?\n \nThere is a r/Trezor page you can should post in.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9o1dyq",
                    "author": "dlq84",
                    "score": 1,
                    "created_utc": 1653301296.0,
                    "response": "> I just can’t figure out how it works before I buy it… does it have its own keys made on it and I just plug it into my pc to access?\n\nYes, that's what a hardware wallet is, it's storage for you seed -> keys. And for signing transactions before broadcasting to the network.\n\n> How do I view what I have?\n\nWith any compatible application\n\n> I can’t find any videos explaining what I’m trying to understand I guess.\n\nRead their documentation on their website. Also, youtube is full of videos, I don't think you've looked.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}