{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uvgviy",
            "title": "Bitcoin Accounting software?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uvgviy/bitcoin_accounting_software/",
            "author": "VegasJeff",
            "created_utc": 1653243888.0,
            "score": 6,
            "num_comments": 3,
            "subreddit": "Bitcoin",
            "selftext": "If you want to use Bitcoin as your base currency, is there any personal accounting software that can accomodate this? I'm guessing I would have to maintain 2 sets of books (another one in USD for tax purposes)?",
            "stickied": false,
            "comments": [
                {
                    "id": "i9lcmib",
                    "author": "stoic_goat_",
                    "score": 2,
                    "created_utc": 1653244429.0,
                    "response": "I use the Ledger CLI (not associated with the hardware wallet).",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9n64lp",
                            "author": "life762",
                            "score": 2,
                            "created_utc": 1653276729.0,
                            "response": "Ledger CLI is a good one.\n\nI think GNU Cash also supports commodities, if Ledger CLI isn't up your ally. (Bitcoin is typically treated as a commodity rather than a currency.)",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "uvh60h",
            "title": "Bitcoin is sometimes stable, and sometimes like a ship in the sea!! Regardless it's my Iron Token.",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uvh60h/bitcoin_is_sometimes_stable_and_sometimes_like_a/",
            "author": "Leilani7654",
            "created_utc": 1653244717.0,
            "score": 24,
            "num_comments": 2,
            "subreddit": "Bitcoin",
            "selftext": "Stability in the cryptocurrency has come into notice after a long period of time. Due to the 'flash crash', the liquidity in the world of cryptocurrency had declined drastically. \n\nMany cryptocurrency investors and researchers decline to invest in the top cryptocurrency like bitcoin. In the circumstances of 'flash crash', a large number of bitcoin holders have sold their holdings. Buyers do not show any interest even in the crisis of 'flash crash'. This results in the decline of the price of almost every cryptocurrency. \n\nGaining previous position in the market, in such crashes is the great thing in itself. But, owing to the best tokenomics, bitcoin again proved itself as a bull cryptocurrency in the metaverse. All the strategic fundamentals included in the tokenomics of bitcoin are fabricated only for its positive growth. Any investor can run their transactions independently in its network, and that's why it is also called a \"peer-to-peer online currency\". In the beginning phase of 2022, many cryptocurrency analysts alleged that the bitcoin will decrease upto $10,000. \nBut the current situation depicts that bitcoin will rise up to $100,000 in the coming years. \n\nNot only BTC, but almost all the fundamental, incentivising, interesting and amazing tokens and projects like Stellar (For New Crypto Payments Network), Tea (incentives open source softwares and provides resources), and Avalanche (Innovative Blockchain Platform Offering New Use Cases), etc., have helped in pushing the space ahead.\n\nEven amidst so many scenarios, wars, hot-topics and whatnot, BTC has provided proof for its potential over the years. And as it is going, BTC is going to stay there like Gold!!\n\nSource: \n\n  https:   //www.coindesk.com/markets/2022/04/27/market-wrap-bitcoin-stabilizes-as-bearish-sentiment-pauses/",
            "stickied": false,
            "comments": [
                {
                    "id": "i9lhmrf",
                    "author": "Blood_Separate",
                    "score": 1,
                    "created_utc": 1653246690.0,
                    "response": "nexo",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}