{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ur2oxj",
            "title": "Everything is F'd. But i just keep stacking!",
            "url": "https://www.reddit.com/r/Bitcoin/comments/ur2oxj/everything_is_fd_but_i_just_keep_stacking/",
            "author": "pdx1086",
            "created_utc": 1652726022.0,
            "score": 1,
            "num_comments": 5,
            "subreddit": "Bitcoin",
            "selftext": "My back is really f'd up from jiu jitsu, my wife of 10 years is thinking about ending it all and bitcoin is still sucking d for the 8th week in a row....\n\nBut im still stackn boysssss!!! ftw",
            "stickied": false,
            "comments": [
                {
                    "id": "i8uq0ip",
                    "author": "discokitty6627",
                    "score": 1,
                    "created_utc": 1652726968.0,
                    "response": "Oss!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8uqwsl",
                    "author": "Ok-Imagination-7014",
                    "score": 1,
                    "created_utc": 1652727336.0,
                    "response": "Yea my back if fucked as a blue belt lol and still got those stacks.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8urjlq",
                            "author": "pdx1086",
                            "score": 1,
                            "created_utc": 1652727594.0,
                            "response": "Good to hear on the stack. back is the worst. impossible to roll and avoid using your back lol",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8uoi3j",
                    "author": "SlugFunkE",
                    "score": 1,
                    "created_utc": 1652726354.0,
                    "response": "Just your wife know about the bitcoin?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8uow2b",
                            "author": "pdx1086",
                            "score": 1,
                            "created_utc": 1652726508.0,
                            "response": "yeah she does. she has no way to access it tho",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "ur2lx5",
            "title": "Does the Bitcoin halve process for every four years result in an exponential increase in computational cost for bitcoin nodes? if so when does it exceeds global computational power?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/ur2lx5/does_the_bitcoin_halve_process_for_every_four/",
            "author": "RevolutionaryStrider",
            "created_utc": 1652725800.0,
            "score": 2,
            "num_comments": 7,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8uoos2",
                    "author": "DavidKens",
                    "score": 6,
                    "created_utc": 1652726428.0,
                    "response": "No, these things are not connected.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8uq2ts",
                    "author": "johnathondeaux",
                    "score": 3,
                    "created_utc": 1652726993.0,
                    "response": "The halving relates only to the amount of new coins being 'minted' or added to the supply in the block rewards also known as the 'coinbase'.\n\nNodes hold a copy of the entire blockchain and so only need to have more storage space/ power as the blockchain becomes longer/larger.\n\nBlock difficulty makes miners need to be more efficient by increasing as the total network hashrate grows.\n\nAll 3 things are separate and don't necessarily have to be correlated.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8uqchs",
                    "author": "frank01945",
                    "score": 2,
                    "created_utc": 1652727102.0,
                    "response": "The every-4-year halving and the number of nodes have nothing to do with each other.   The block reward is halved every 4 years. The number of mines governs mining difficulty. Adjustments to difficulty occur to maintain 10 minutes between the creation of blocks. When China shut down about 1/2 the world's mines, bitcoin did not care.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8urtul",
                    "author": "NiceDoctorBeam",
                    "score": 2,
                    "created_utc": 1652727707.0,
                    "response": "It depends on the consecument of the lunar waneshaft...",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8v3a06",
                            "author": "throwawaymeyourbtc",
                            "score": 1,
                            "created_utc": 1652732397.0,
                            "response": "Don’t forget to factor in the kahootenvalve.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8utuf2",
                    "author": "Keith_Kong",
                    "score": 2,
                    "created_utc": 1652728545.0,
                    "response": "Bitcoin currently uses \\~0.5% of global energy.\n\nMore than 50% of energy generated ends up being wasted (rejected by the grid due to fluctuations in demand requiring over generation).\n\nBitcoin energy usage is a **rounding error on the amount of wasted energy** caused by how the grid currently functions.\n\nBitcoin miners can be shut off instantly and turned on instantly, meaning that they may be used to act as load balancers for the grid. This may prove to reduce the amount of wasted energy by providing an extra backstop to demand shifts by signing contracts with energy providers to shut off when asked.\n\nBitcoin mining can provide value to newly built clean energy plants who may not be able to immediately connect with the grid. It can then fund that connection to the grid.\n\n**Bitcoin is nothing but a solution to clean energy and broader sustainable energy expansion.**",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8uwltn",
                    "author": "swgo1",
                    "score": 1,
                    "created_utc": 1652729677.0,
                    "response": "At the halving, the cost to mine will stay the same but the revenue for mining will cut in half. This likely will put some of the less efficient miners out of business. The reduction in the number of miners will increase the block time and therefore cause an increase in the block difficulty over time. The increase in difficulty will increase the cost to mine.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ur2p9s",
            "title": "Legitimately free electricity to mine",
            "url": "https://www.reddit.com/r/Bitcoin/comments/ur2p9s/legitimately_free_electricity_to_mine/",
            "author": "Unhappy_Cranberry712",
            "created_utc": 1652726045.0,
            "score": 0,
            "num_comments": 23,
            "subreddit": "Bitcoin",
            "selftext": "Fellows,\n\nI have encountered a legal way to access electricity, I am happy to share how at the right time, however I am curious if anyone is interested in potentially exploring how we may make use of this situation. I expect that the supply will be free for 6 months, best case scenario 12 months. I don't have mining equipment, my exposure to Bitcoin extends as far as purchasing a couple of hundred dollars worth. I am based in western EU, so geography is a consideration.  \nLooking forward to hearing thoughts and potential interest to work together to mine!\n\nEdit; I guess I should have suspected that people would be sceptical, if anyone has ideas as to how I can potentially prove this is legit I’d love to hear it. And no, I’m not looking for any donation for information, this is a credible business opportunity. I’m not starting to think it may actually be a bigger opportunity than I originally thought judging by how sceptical people seem to be to this!",
            "stickied": false,
            "comments": [
                {
                    "id": "i8v1nkv",
                    "author": "RDMvb6",
                    "score": 3,
                    "created_utc": 1652731732.0,
                    "response": "Let me guess, you just need someone to send you 0.1btc to get all the info on where this free electricity to mine so many bitcoins is coming from?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8v2de1",
                            "author": "Unhappy_Cranberry712",
                            "score": 1,
                            "created_utc": 1652732024.0,
                            "response": "What’s with the hyper-scepticism, is it so hard to believe I’m here looking for help, support and ideally someone to partner up with?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8v5iqs",
                                    "author": "RDMvb6",
                                    "score": 2,
                                    "created_utc": 1652733319.0,
                                    "response": "Yes, that is indeed pretty hard to believe. When 99.99% of people posting this kind of thing are scammers...",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8vazwz",
                                            "author": "Unhappy_Cranberry712",
                                            "score": 1,
                                            "created_utc": 1652735553.0,
                                            "response": "Ok, I understand, not the case with me, however. Unsure how I prove otherwise TBH, except I’d like to talk with someone or an organisation who may be interested and they can see for themselves.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i8v94f0",
                                    "author": "matador98",
                                    "score": 1,
                                    "created_utc": 1652734776.0,
                                    "response": "If you are looking to Reddit for a biz partner and are promising too good to be true free electricity, then that’s very very sus, or you just have no clue what you are doing.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8vbbwp",
                                            "author": "Unhappy_Cranberry712",
                                            "score": 1,
                                            "created_utc": 1652735696.0,
                                            "response": "I don’t know what I’m doing, I’ve been a long time user of Reddit and thought I’d throw it out there on this sub. Apparently it isn’t being well received. May I ask how you think I should approach it?\nI promise you this is not too good to be true, I have a successful business career of over 13 years and do not need to scam. My most recent job has me in the energy sector and I stumbled on this opportunity.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8vcpft",
                                                    "author": "Unhappy_Cranberry712",
                                                    "score": 1,
                                                    "created_utc": 1652736283.0,
                                                    "response": "Perhaps I should add that I am open to a call or video call to discuss this opportunity. As this is a legal loophole that exists I don’t need anonymity, I just need to right person(s) to work with on this opportunity.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8unxwh",
                    "author": "jameswilson7208",
                    "score": 3,
                    "created_utc": 1652726126.0,
                    "response": "Someone is paying for it.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8uu768",
                            "author": "Unhappy_Cranberry712",
                            "score": 1,
                            "created_utc": 1652728692.0,
                            "response": "True, Gov funding",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8uxbjy",
                                    "author": "jameswilson7208",
                                    "score": 2,
                                    "created_utc": 1652729968.0,
                                    "response": "So you and fellow citizens are actually paying for it after all. Where does government get it's money?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8v461s",
                                            "author": "Unhappy_Cranberry712",
                                            "score": 1,
                                            "created_utc": 1652732759.0,
                                            "response": "I’m aware of how taxation works, thanks.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8urco0",
                    "author": "NiceDoctorBeam",
                    "score": 2,
                    "created_utc": 1652727516.0,
                    "response": "Stolen electricity.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8uu3ef",
                            "author": "Unhappy_Cranberry712",
                            "score": 0,
                            "created_utc": 1652728648.0,
                            "response": "No, it certainly isn’t",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8v8iz1",
                                    "author": "_-_agenda_-_",
                                    "score": 1,
                                    "created_utc": 1652734536.0,
                                    "response": "Then it's more like Legal free energy, subsidized with money stolen from citizens (aka \"tax\").\n\nAnyway, congratulations.\n\nDo you have an ideia of how many MWh can you get monthly?\n\nYou may make tons of money using it on mining, not only Bitcoin but also some other cryptos...",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8v95yq",
                                            "author": "_-_agenda_-_",
                                            "score": 1,
                                            "created_utc": 1652734794.0,
                                            "response": "Oh, and your geography doesn't matter at all for this kind of operation. It will be relevant only for your internet provider costs if it's not urban location (and of course the transportation of the equipments)",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8vc559",
                                                    "author": "Unhappy_Cranberry712",
                                                    "score": 1,
                                                    "created_utc": 1652736042.0,
                                                    "response": "Right; well 30 mins from a city of 1mil population with decent internet speeds, so I don’t think this will be an issue",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i8vbyi8",
                                            "author": "Unhappy_Cranberry712",
                                            "score": 1,
                                            "created_utc": 1652735964.0,
                                            "response": "Thanks for your reply. I’m aware this is going to stretch your potential scepticism even further, but at present their is no cap on maximum usage technically, however to gain access one needs an account which tally’s total usage; typical usage per account is 200KW’s per week, however the accounts too are free and can be acquired simply. The process to get an account takes about 10 days.\nMy lack of knowledge of the capital equipment and the process of mining is my weakness.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8vdilc",
                    "author": "streeeker",
                    "score": 1,
                    "created_utc": 1652736627.0,
                    "response": "Nice try, FBI.\n\nNot today, ciA",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8vdwv3",
                            "author": "Unhappy_Cranberry712",
                            "score": 1,
                            "created_utc": 1652736801.0,
                            "response": "Lol, but no",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8uszrt",
                    "author": "carb3nn",
                    "score": 0,
                    "created_utc": 1652728189.0,
                    "response": "Abusing free electricity makes the electricity no longer free. If your good with that then send it!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8v8qzu",
                            "author": "_-_agenda_-_",
                            "score": 1,
                            "created_utc": 1652734627.0,
                            "response": "There is no \"free electricity\" to begin with... Someone is already paying for it...",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8uuvlv",
                            "author": "Unhappy_Cranberry712",
                            "score": 0,
                            "created_utc": 1652728965.0,
                            "response": "There is no abuse",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "ur2j6l",
            "title": "New Bitcoin Scam Beware!",
            "url": "https://youtu.be/nUxiku5K0sw",
            "author": "Dry_Career2864",
            "created_utc": 1652725592.0,
            "score": 0,
            "num_comments": 4,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8up9sk",
                    "author": "Dry_Career2864",
                    "score": 1,
                    "created_utc": 1652726664.0,
                    "response": "This is a Elon imposter",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8usor7",
                    "author": "MrQ01",
                    "score": 1,
                    "created_utc": 1652728061.0,
                    "response": "NEW scam? I thought there were a billion of these going around (fake Saylors, Cathie Woods, Elons etc).",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8uur67",
                            "author": "Dry_Career2864",
                            "score": 1,
                            "created_utc": 1652728914.0,
                            "response": "I’m aware. This video is being live-streamed right now, it’s popping up on YouTube recommendations",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8voz86",
                    "author": "Neinfu",
                    "score": 1,
                    "created_utc": 1652741754.0,
                    "response": "I sometimes report several of these scams per day since 1.5 years... But I have the feeling that Youtube doesn't really care...",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ur2t4n",
            "title": "I finally took my coins out of Coinbase",
            "url": "https://www.reddit.com/r/Bitcoin/comments/ur2t4n/i_finally_took_my_coins_out_of_coinbase/",
            "author": "xyzzzzy",
            "created_utc": 1652726342.0,
            "score": 228,
            "num_comments": 129,
            "subreddit": "Bitcoin",
            "selftext": "I have been hodling for several years at this point, and have had \"not your keys, not your coins\" drilled into my head, but have kept my coins on Coinbase the whole time anyway. I even bought a hardware wallet several years ago but was too nervous to actually transfer my coins to it. I figured a big company like Coinbase is probably better at security than I am, so what's the real risk? A post here last week was what finally pushed me over: pointing out that in bankruptcy, Coinbase could (and probably would) liquidate my coins to pay creditors. While I don't think it's likely that my Coinbase vault would get hacked, I do think there is a much bigger chance for Coinbase to do something dumb on the business side and go bankrupt during some particularly bad market volatility. So I bit the bullet and transferred my coins - other than the excruciating 30 seconds between initiating the send at waiting for it to show up on the other side it was very painless. TL;DR I finally pulled my coins off of Coinbase, and you should too",
            "stickied": false,
            "comments": [
                {
                    "id": "i8uozen",
                    "author": "ForbiddenFruit91",
                    "score": 47,
                    "created_utc": 1652726546.0,
                    "response": "I was the same way. Went non kyc about 6 months ago. You get more comfortable with time and experience in a non custodial wallet. I did. Maybe too comfortable sometimes. It's easy. Send money. Receive. Smooth. And I own it. Just always triple check an addy. Takes all of 10 extra seconds. Just always be careful. Good job 👍🚀🚀🚀",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8v6qe0",
                            "author": "MajorWeenis",
                            "score": 11,
                            "created_utc": 1652733811.0,
                            "response": "What method do you use for non-KYC?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8vf5ey",
                                    "author": "OdoIcontradictmyself",
                                    "score": 6,
                                    "created_utc": 1652737331.0,
                                    "response": "Also interested….how do you go non-kyc?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8vu4pd",
                                            "author": "InterPool_sbn",
                                            "score": 4,
                                            "created_utc": 1652744231.0,
                                            "response": "I think that commenter meant non-KYC for the ownership, aka just taking self-custody of the private keys.\n\nThere are also non-KYC exchanges for actually buying your Bitcoin in the first place though!\n\nI haven’t personally used any of them yet myself, but they do exist",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i8w71ae",
                                    "author": "MiguelLancaster",
                                    "score": 3,
                                    "created_utc": 1652750681.0,
                                    "response": "Bisq with a side of NiceHash",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8wdjcf",
                                            "author": "MikeAmorphic",
                                            "score": 2,
                                            "created_utc": 1652753950.0,
                                            "response": "Chicken Noodle soup with a soda on the side.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i8w7hyk",
                                    "author": "thrash242",
                                    "score": 2,
                                    "created_utc": 1652750914.0,
                                    "response": "Not who you’re asking, but I’m also 100% KYC-free and I use Bisq to acquire it.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8wfwos",
                                            "author": "bandido123456789",
                                            "score": 2,
                                            "created_utc": 1652755162.0,
                                            "response": "how does it actually work (Bisq)?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8wi1gc",
                                                    "author": "diydude2",
                                                    "score": 3,
                                                    "created_utc": 1652756294.0,
                                                    "response": "Very well.  It's peer-to-peer like Bitcoin is supposed to be.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i8wmkh8",
                                                    "author": "thrash242",
                                                    "score": 1,
                                                    "created_utc": 1652758819.0,
                                                    "response": "I’d go to the official Bisq wiki and read about it if you want to know how it works, but it’s basically a true decentralized exchange. It’s software that you run on your computer and it matches people who want to buy and people who want to sell. There’s a multisig trade transaction that contains the trade amount and security deposits from both parties that gets unlocked and distributed when the trade is finished.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8wmpoq",
                                                            "author": "bandido123456789",
                                                            "score": 1,
                                                            "created_utc": 1652758903.0,
                                                            "response": "Yeah, I’ve seen it a couple of times but I will download and see what it is all about. What triggers my curiousness is the deposits of money on the buyer side, but I will make sure to check it ou. thanks",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8voy2g",
                            "author": "klinchev",
                            "score": 2,
                            "created_utc": 1652741738.0,
                            "response": "How is it too comfortable ?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8v7jaw",
                    "author": "uclatommy",
                    "score": 31,
                    "created_utc": 1652734137.0,
                    "response": "Always test your addresses by using a small amount first.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8vamng",
                    "author": "Atreyu_n_Falcor_BFF",
                    "score": 17,
                    "created_utc": 1652735398.0,
                    "response": "I wonder how many coins have left exchanges in the last week and a half",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8wpie1",
                            "author": "kytheon",
                            "score": 1,
                            "created_utc": 1652760602.0,
                            "response": "That’s literally something glassnode tracks, no? Iirc outflow from exchanges = hodl season, influx into exchanges = sell pressure.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8urezi",
                    "author": "Hank___Scorpio",
                    "score": 9,
                    "created_utc": 1652727542.0,
                    "response": "Yeah buddy. I imagine you took it all off? Its perfectly fine to go in baby steps and just see how it feels to have it under the blanket of your security.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8v9jt9",
                            "author": "xyzzzzy",
                            "score": 19,
                            "created_utc": 1652734946.0,
                            "response": "I actually took someone's advice and sent a small amount first to make sure I wasn't completely screwing it up. But that made it worse in a way, because my test transfer showed up in \\~10 seconds, and my \"real\" transfer took more like \\~30 seconds. During the last 20 seconds my blood pressure was getting progressively higher.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8vc169",
                                    "author": "OrangeHODLr",
                                    "score": 12,
                                    "created_utc": 1652735996.0,
                                    "response": "You get used to the process after awhile. Just be sure to check and recheck the recipient address on your device and screen and also watch the blockchain.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8vt8hs",
                                    "author": "savinelli_smoker",
                                    "score": 6,
                                    "created_utc": 1652743792.0,
                                    "response": "It can take a while. Don’t be alarmed if it takes even a min or two. The coinbase node needs to broadcast your transaction and your node (or your wallet software’s node) needs to hear it. Which is why Satoshi decided to have a 10min block, so that the whole world, even those with slow internet, will have a chance to hear the transactions.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8wdy73",
                                    "author": "ballsonrawls",
                                    "score": 3,
                                    "created_utc": 1652754155.0,
                                    "response": "Yup, I always send a small amount then a larger amount. Even vitalik does this, for me, thats saying something.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8w34pu",
                                    "author": "Klutzy_Gap_8819",
                                    "score": 1,
                                    "created_utc": 1652748727.0,
                                    "response": "Lol",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8wp258",
                                    "author": "hashgraph9",
                                    "score": 1,
                                    "created_utc": 1652760321.0,
                                    "response": "i hope you tested your 24 words when you first set it up.  because if you didn't check that and your device dies, there's no way to restore it.\n\nif you're not sure if you have your 24 words.  i would move most of your coins back to coinbase temporarily.  leave a small amount on the device.  then wipe it out and restore it using your 24 words.  and try moving it out of your wallet see if it works.\n\ndo not be that guy who sets up device but never checked to make sure they have the 24 words backed up correctly.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8up03a",
                    "author": "twalker14",
                    "score": 8,
                    "created_utc": 1652726554.0,
                    "response": "The biggest thing in this is you took the step, congrats!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8uy8o0",
                    "author": "Sea-Professional5628",
                    "score": 30,
                    "created_utc": 1652730336.0,
                    "response": "Only thing Coinbase has of mine is that damned Eth2.0 that I locked up I don’t know how long ago.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8v0sr8",
                            "author": "cosmoshistorian",
                            "score": 7,
                            "created_utc": 1652731378.0,
                            "response": "same here, when in the hell do I get to send it to my cold storage??",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8v7tai",
                                    "author": "dnoloc",
                                    "score": 11,
                                    "created_utc": 1652734250.0,
                                    "response": "\"Soon\"",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8v4fd6",
                                    "author": "jroosvicee",
                                    "score": 9,
                                    "created_utc": 1652732868.0,
                                    "response": "In 6 years",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8v4pie",
                                            "author": "cosmoshistorian",
                                            "score": 1,
                                            "created_utc": 1652732984.0,
                                            "response": "fucking hell\n\nexciting tho!!",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8v4ua5",
                                                    "author": "jroosvicee",
                                                    "score": 1,
                                                    "created_utc": 1652733038.0,
                                                    "response": "How nice of vitalik",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8ver89",
                            "author": "SpiralBlue2",
                            "score": 2,
                            "created_utc": 1652737164.0,
                            "response": "Same. I don’t think we can move it until it goes mainnet.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8w700r",
                            "author": "coinjaf",
                            "score": 2,
                            "created_utc": 1652750662.0,
                            "response": "\\> ... I put into this ponzi scheme I don't know how long ago.\n\nFTFY",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8us29j",
                    "author": "castorfromtheva",
                    "score": 11,
                    "created_utc": 1652727803.0,
                    "response": "One of your greatest decisions ever!\n\n!Lntip 1000",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8vlj04",
                            "author": "xyzzzzy",
                            "score": 2,
                            "created_utc": 1652740155.0,
                            "response": "Hey thanks! Very cool.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8us3t2",
                            "author": "lntipbot",
                            "score": 1,
                            "created_utc": 1652727821.0,
                            "response": "Hi u/castorfromtheva, thanks for tipping u/xyzzzzy **1000** satoshis!\n***\n*[^(More info)](https://xnf5cwpq73.execute-api.us-west-2.amazonaws.com/prod/info) ^| [^(Balance)](https://www.reddit.com/message/compose/?to=lntipbot&subject=balance&message=!balance) ^| [^(Deposit)](https://www.reddit.com/message/compose/?to=lntipbot&subject=deposit&message=!deposit 10000) ^| [^(Withdraw)](https://www.reddit.com/message/compose/?to=lntipbot&subject=withdraw&message=!withdraw put_invoice_here) ^| ^(Something wrong?  Have a question?) [^(Send me a message)](https://www.reddit.com/message/compose/?to=drmoore718)*",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8us8wz",
                    "author": "Danielj2021",
                    "score": 11,
                    "created_utc": 1652727880.0,
                    "response": "I also finally moved my coins off of Coinbase recently after about 1.5 years on the exchange. I am more nervous about moving my Bitcoin around but it was painless for me too.\n\nGood job! Are you using the hardware wallet? I’ve just been using exodus wallet and have some in Celsius earning interest.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8v59xg",
                            "author": "xyzzzzy",
                            "score": 1,
                            "created_utc": 1652733218.0,
                            "response": "I am using the hardware wallet! It's a Trezor. Now I'm deciding how far I need to go to secure my seed phrase.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8v7t3y",
                                    "author": "mrcluezo",
                                    "score": 8,
                                    "created_utc": 1652734248.0,
                                    "response": "Tattoo on the inside of your buttcheek. Bags secured until you’re old enough for a prostate exam.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8va0wz",
                                            "author": "xyzzzzy",
                                            "score": 4,
                                            "created_utc": 1652735144.0,
                                            "response": "I'm kind of old already so that doesn't work for me. Maybe if I put the last word inside my lower lip, as long as my doctor and dentist never meet.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8va67q",
                                                    "author": "mrcluezo",
                                                    "score": 3,
                                                    "created_utc": 1652735206.0,
                                                    "response": "Me too. I can’t keep killing my tattoo artist and my doctor.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i8veswk",
                                                    "author": "TheArabianNights",
                                                    "score": 3,
                                                    "created_utc": 1652737184.0,
                                                    "response": "Joke apart, this is a very bad idea to slip your seed your way.\nCheck [aantonop video](https://youtu.be/p5nSibpfHYE) about it, very instructive.\nIf you wish to use an advanced way to secure your seed then you should look at Shamir Backup ( only available on Trezor T model ) combined with Crypto Steel Capsule",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i8vp4j8",
                                            "author": "uclatommy",
                                            "score": 1,
                                            "created_utc": 1652741825.0,
                                            "response": "Never tattoo a seed phrase. I don't know why this keeps getting posted.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8vpq9x",
                                                    "author": "mrcluezo",
                                                    "score": 3,
                                                    "created_utc": 1652742104.0,
                                                    "response": "Lol, it’s a joke my dude. Obviously I’m not tattooing a seed phrase on my butthole and killing my tattoo artist.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i8vq02j",
                                                    "author": "mrcluezo",
                                                    "score": 3,
                                                    "created_utc": 1652742232.0,
                                                    "response": "Sarcasm is the language of Reddit. Welcome.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i8vrd1x",
                                            "author": "Fine-Artichoke-7485",
                                            "score": 1,
                                            "created_utc": 1652742884.0,
                                            "response": "Lol 🤣",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8va562",
                    "author": "kbat82",
                    "score": 6,
                    "created_utc": 1652735193.0,
                    "response": "Wasn't it just something Coinbase had to say to meet current regulation guidelines? Seems like the chance of it happening are about the same as bitcoing going to 0. In which case they can keep my coins.\n\n(Mine are in cold storage anyway though. Also, good job moving yours too)",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8vq7f6",
                            "author": "Vaginosis-Psychosis",
                            "score": 3,
                            "created_utc": 1652742327.0,
                            "response": "Yes, because it's true.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8waxii",
                                    "author": "UnconsionableLawyer",
                                    "score": 4,
                                    "created_utc": 1652752642.0,
                                    "response": "It’s really not. Source: I’m a bankruptcy attorney.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8vrav9",
                            "author": "Angustony",
                            "score": 1,
                            "created_utc": 1652742855.0,
                            "response": "Coinbase had to declare their legal position. Their legal position is exactly what they declared. The chances of Coinbase going under are slim, but that is a much, much bigger risk than Bitcoin going to zero. They could also be compelled to freeze balances and to hand over balances, they could be hacked, they could \"lose\" your coins. Unlikely, granted, but that cannot possibly affect you if it does happen if you have them in cold storage.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8vrwlr",
                                    "author": "kbat82",
                                    "score": 1,
                                    "created_utc": 1652743147.0,
                                    "response": "For comparison, what are the odds closer to that it happens? Obviously I was being dramatic saying btc going to 0 but what's a better analogy in your mind?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8wb14g",
                                            "author": "UnconsionableLawyer",
                                            "score": 1,
                                            "created_utc": 1652752692.0,
                                            "response": "Basically zero. And they wouldn’t hand over customer wallets because they would not be considered assets of the estate unless staked.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8vejg1",
                    "author": "Boe_Ning",
                    "score": 3,
                    "created_utc": 1652737070.0,
                    "response": "You didn't bite the bullet, you stepped out of the way.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8was9g",
                    "author": "UnconsionableLawyer",
                    "score": 3,
                    "created_utc": 1652752569.0,
                    "response": "Great for you to take custody. That being said, it is unlikely a bankruptcy would cause Coinbase (really, the bankruptcy trustee) to liquidate customer accounts to pay creditors. Unless the customer accounts are commingled into Coinbases own wallet (eg for assets that the company owns itself), instead of separated into either individual customer wallets. Given the ability to send and receive crypto and have individual wallets on coinbase, the likelihood of commingling is de mini is. The only caveat to this would be if you staked your coins. \n\nSource: I’m a bankruptcy attorney.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8uubyo",
                    "author": "keep_Playing",
                    "score": 2,
                    "created_utc": 1652728746.0,
                    "response": " a bot to track self custody would be cool",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8ux33e",
                            "author": "Calsmokes",
                            "score": 1,
                            "created_utc": 1652729873.0,
                            "response": "I’m sure one of the metrics at glassnode does this",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8vmtv5",
                    "author": "skxch",
                    "score": 2,
                    "created_utc": 1652740755.0,
                    "response": "Congrats!!! If having a single hardware device still makes you nervous, check out Casa multisig. Coinbase uses multisig for their vault, and its better to have redundancy when you're self custodying private keys for large balances.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8w2hz8",
                    "author": "dgpla10",
                    "score": 2,
                    "created_utc": 1652748413.0,
                    "response": "# DO NOT respond to DMs or yOuLl GeT sCaMmEd",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8vfjgc",
                    "author": "VPNApe",
                    "score": 3,
                    "created_utc": 1652737500.0,
                    "response": "Same, I did it last week with trezor. Easiest thing ever, though pretty scary.\n\nI still don't know why the wallet generated new addresses every transfer.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8vp7hz",
                            "author": "Angustony",
                            "score": 6,
                            "created_utc": 1652741864.0,
                            "response": "It's a security feature so that anyone looking on the Blockchain to see where the coins are transferred to doesn't see every transaction you (one address) ever made, and be able to work out your (that one address) balance.  Just means every transfer of coins does not go to one address, even if they actually go to just one recipient.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8vv2q0",
                            "author": "savinelli_smoker",
                            "score": 3,
                            "created_utc": 1652744699.0,
                            "response": "Congrats on the withdrawal! New address is a feature not a bug. Sometimes reusing address is unavoidable but minimising reuse is good for your privacy.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8vwr2z",
                                    "author": "VPNApe",
                                    "score": 0,
                                    "created_utc": 1652745533.0,
                                    "response": "I don't really see the benefit tbh. How does it help privacy",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8vxwxl",
                                            "author": "savinelli_smoker",
                                            "score": 2,
                                            "created_utc": 1652746111.0,
                                            "response": "https://en.bitcoin.it/wiki/Address_reuse\n\nThis might help. Good luck!",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i8w8133",
                                            "author": "thrash242",
                                            "score": 1,
                                            "created_utc": 1652751184.0,
                                            "response": "Assuming A, B, and C are all addresses that go to your wallet:\n“Somebody sent Bitcoin to A, somebody sent Bitcoin to A, somebody sent Bitcoin to A”\nvs\n“Somebody sent bitcoin to A, somebody sent Bitcoin to B, somebody sent Bitcoin to C”\n\nOne is obviously much more private.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8wbqiu",
                                                    "author": "VPNApe",
                                                    "score": 1,
                                                    "created_utc": 1652753043.0,
                                                    "response": "Oh I gotcha. Does this mean I should withdraw large quantities of BTC in separate smaller transactions?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8wjjao",
                                                            "author": "According_Ad5882",
                                                            "score": 2,
                                                            "created_utc": 1652757102.0,
                                                            "response": "It's good practice.",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "i8wmufk",
                                                            "author": "thrash242",
                                                            "score": 1,
                                                            "created_utc": 1652758980.0,
                                                            "response": "Generally, yeah, but if you really want to be privacy-conscious, you should learn about the concept of UTXOs and try to keep your UTXOs separate. Privacy-focused wallets will let you keep track of them.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8v3wrg",
                    "author": "the1blackguyonreddit",
                    "score": 6,
                    "created_utc": 1652732654.0,
                    "response": "That's good for you, however, Coinbase is in great shape financially and there's virtually no risk of bankruptcy, and even a smaller chance they'd ever touch anyone's assets on the platform.  It was just a disclosure they were required to put.  The articles hyping it up are just FUD, honestly.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8v89du",
                            "author": "mrcluezo",
                            "score": -7,
                            "created_utc": 1652734431.0,
                            "response": "How long have you been working for coinbase and how are the working conditions?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8vaxqa",
                                    "author": "LucidiK",
                                    "score": 8,
                                    "created_utc": 1652735528.0,
                                    "response": "You don't need to work for a company to recognize a publicly traded company would not be dumb enough to tie their entire future as a company to the state of the market. Coinbase creates a constant revenue stream whether it's a bull market or a bear market. They would have to be run by imbiciles to have leveraged all that profit into bets on crypto. As much as we all talk about blockchain restructuring how we think about money. Most of these companies (and even more so for public companies) account their success with dollars (or other native currency). \n\nI choose to believe that Coinbase, with its billions to spend, has hired a team of accountants that know how to hedge risks and guarantee cashflows.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8vgc7i",
                                            "author": "PRMan99",
                                            "score": 2,
                                            "created_utc": 1652737849.0,
                                            "response": "> You don't need to work for a company to recognize a publicly traded company would not be dumb enough to tie their entire future as a company to the state of the market.\n\nI worked for a relatively large mortgage company that did EXACTLY that against the advice of their financial advisor.\n\nThey lost everything.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8viaz2",
                                                    "author": "LucidiK",
                                                    "score": 2,
                                                    "created_utc": 1652738709.0,
                                                    "response": "Was it a public company? My main point, is that once you've gone public, you have to make safer plays. I would guess that Coinbase (as the only public american exchange) is making less risky plays than the ones with less accountability.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8vs9br",
                                                            "author": "Angustony",
                                                            "score": 3,
                                                            "created_utc": 1652743317.0,
                                                            "response": "Leyman Brothers, Kodak, Mt Gox....  Jeez, hundreds of upright, respected companies go bust through rogue actions or just poor decisions.\n\nYou have a lot of trust in a largely unregulated arena.  A company lives or dies on its results, and less risky plays deliver lower rewards. A public company in crypto is right up there with the hundreds of public companies that failed spectacularly in the dot com era in terms of risk.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i8vpk70",
                                            "author": "Ralph_Naders_Ghost",
                                            "score": 1,
                                            "created_utc": 1652742028.0,
                                            "response": "MCI WorldCom\nCompaq\nCircuit City\nPets.com\nEnron\nBlockbuster\nPan Am\nWoolworths\nVine\nPier 1 Imports\nBorders\nTheranos\nSolyndra\n\nIn the words of King Mongkut of Siam, \"Etcetera, etcetera, etcetera.\"",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i8vwsrs",
                                            "author": "Archteryx",
                                            "score": 1,
                                            "created_utc": 1652745557.0,
                                            "response": "until they have a stadium named after them and it costs #300million...",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8v1aq5",
                    "author": "frequent_heron_2102",
                    "score": 2,
                    "created_utc": 1652731584.0,
                    "response": "> A post here last week was what finally pushed me over: pointing out that in bankruptcy, Coinbase could (and probably would) liquidate my coins to pay creditors\n\nYou, and many other people, completely misunderstood Coinbase's public filing. They didn't say they would sell your coins to pay creditors. They said that their account holders *are* unsecured creditors. The implication of that is that if they go bankrupt, they owe you the value of your holdings. Of course that might not work out well, just look at how Mt Gox handled it, but they absolutely can't sell your coins to cover debts to other creditors. That would be insane.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8v2jls",
                            "author": "hVMjjxumF45DKy13",
                            "score": 7,
                            "created_utc": 1652732094.0,
                            "response": "Yes, they absolutely can--and indeed might be forced to do so--if those other creditors are more senior.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8wb6n7",
                                    "author": "UnconsionableLawyer",
                                    "score": 1,
                                    "created_utc": 1652752770.0,
                                    "response": "Priority, not seniority.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8wbeb0",
                                            "author": "hVMjjxumF45DKy13",
                                            "score": 1,
                                            "created_utc": 1652752875.0,
                                            "response": "Thanks.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8wbrpe",
                                                    "author": "UnconsionableLawyer",
                                                    "score": 1,
                                                    "created_utc": 1652753059.0,
                                                    "response": "Being a lawyer can make one pedantic. Happy to help!",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8vgfu7",
                            "author": "PRMan99",
                            "score": 3,
                            "created_utc": 1652737895.0,
                            "response": "> but they absolutely can't sell your coins to cover debts to other creditors. That would be insane.\n\nOf course they can.  How else do you think the large investors get paid?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8wbkvh",
                                    "author": "UnconsionableLawyer",
                                    "score": 2,
                                    "created_utc": 1652752967.0,
                                    "response": "By selling coinbase assets. Client wallets are not assets of coinbase they are liabilities.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8wbj3o",
                            "author": "UnconsionableLawyer",
                            "score": 1,
                            "created_utc": 1652752942.0,
                            "response": "A bankruptcy trustee can only sell assets of the estate. CB’s interest in client wallets are liabilities. They can’t be sold to pay other creditors unless they were commingled in a large custodial wallet that also included assets owned by CB (eg if CB separately has its own Bitcoin in a wallet with customers) which is unless given the ability to send and receive on CB. The caveat would be staking. \n\nAlso what CB was saying in their reporting was not that they considered clients unsecured creditors, but that other creditors could try to make that claim. Based on a decade plus of bankruptcy experience, I would disagree with that.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8v4ep2",
                    "author": "gunsoverbutter",
                    "score": 1,
                    "created_utc": 1652732860.0,
                    "response": "Congrats! Which wallet did you decide to go with?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8v9os7",
                            "author": "xyzzzzy",
                            "score": 1,
                            "created_utc": 1652735004.0,
                            "response": "Trezor. It works great. Though I was a little confused about Trezor suite vs the web app.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8v3voc",
                    "author": "dj_destroyer",
                    "score": 1,
                    "created_utc": 1652732642.0,
                    "response": "I've been in since early 2017 and only just now bought my first hardware wallet. Yes, I'm stupid.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8vcccj",
                    "author": "Kamla-hi-Kamla",
                    "score": 1,
                    "created_utc": 1652736126.0,
                    "response": "Does it cost some fee to transfer tokens to a cold wallet ?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8vqh1n",
                            "author": "Angustony",
                            "score": 2,
                            "created_utc": 1652742454.0,
                            "response": "Yes, there's a fee because it's a Blockchain transaction, which is your price of security. You now have irrefutable proof that you own those coins, and they are yours and cannot be taken away from you. Without it the exchange has full control over your coins and you have to trust them to allow withdrawals, transfers etc.\n\nFees vary by exchange, but none are ridiculous. If you are buying small amounts regularly and your exchange charges a set fee, it's usually worth waiting until you have a \"reasonable\" amount to transfer to avoid overpaying. Once a month, or every £500 or whatever you're comfortable with for example.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8vj3hu",
                            "author": "xyzzzzy",
                            "score": 1,
                            "created_utc": 1652739066.0,
                            "response": "I think my fee was like $0.23",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8vkv7s",
                    "author": "Jaqen-Atavuli",
                    "score": 1,
                    "created_utc": 1652739855.0,
                    "response": "Yeah, I had some coin still on CB in case I wanted to do some trading.  I got them off as soon as I read that filing.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8vlcbc",
                    "author": "rodzilla09",
                    "score": 1,
                    "created_utc": 1652740071.0,
                    "response": "How do I do this? Does it cost? Can I still stack at lower rates?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8vp5nn",
                    "author": "ty_rex",
                    "score": 1,
                    "created_utc": 1652741840.0,
                    "response": "Yewwww, just did the same. Went in and off though, just being greedy with the interest earnings. With the market volatility lately though and all the talk of a recession, a friendly reminder of Mt Gox was all I needed to not be able to sleep at night. Quickly moved to hardware wallet over the weekend. Feels great.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8vr4q3",
                    "author": "jschadel",
                    "score": 1,
                    "created_utc": 1652742773.0,
                    "response": "Yep, just ordered a trezor wallet last night to transfer my Bitcoin off Coinbase.  I'm pretty comfortable with the transfer and will do a small transaction first just to make sure.\n\nWhat is an easy/good way to buy more Bitcoin and continue to add it to my wallet?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8vwg17",
                    "author": "Archteryx",
                    "score": 1,
                    "created_utc": 1652745378.0,
                    "response": "me too...bought a ledger for now .. only have fetch.ai left on coinbase .. but the fee to xfr is more than i have ..",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8vyrxi",
                    "author": "agciv24",
                    "score": 1,
                    "created_utc": 1652746549.0,
                    "response": "Hey could you message me? I need help doing that and don’t know how.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8w390d",
                    "author": "skoolbees",
                    "score": 1,
                    "created_utc": 1652748788.0,
                    "response": "F",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8w6zy6",
                    "author": "SnuffCatch",
                    "score": 1,
                    "created_utc": 1652750661.0,
                    "response": "Ive been trying to convince multiple friends/acquaintances to do the same for over 4 years now.  When I said bankruptcy they all immediately did it finally.  \n\nI've done hundreds of btc transactions over the years and never lost a single sat.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8wcc96",
                    "author": "michaelb1",
                    "score": 1,
                    "created_utc": 1652753344.0,
                    "response": "Same. Took my coins off coinbase, Nexo, midas, Ledn.io, holdnaut, and crypto.com. \n\nI’m giving up earning but I don’t like them loaning out my coins to people who crash the market.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8wdhm6",
                    "author": "AdmiralHuddles",
                    "score": 1,
                    "created_utc": 1652753926.0,
                    "response": "I keep 25% of my sats on Coinbase and the rest in cold storage. I just like having that hedge against my own stupidity too…\n\nThe remote bankruptcy possibility is as good a reason as any to move things into your own custody, but I believe I read somewhere that Coinbase has more cash on hand than they do debt, so I don’t think bankruptcy is something to be tooo concerned about just yet.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8wfsvq",
                            "author": "TrianglesTink",
                            "score": 3,
                            "created_utc": 1652755107.0,
                            "response": "Yeah, keeping all your coins on one wallet is stupid imo.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8wfrgq",
                    "author": "Renew11",
                    "score": 1,
                    "created_utc": 1652755086.0,
                    "response": "Is Coinbase Wallet safer?  After last week I move it from CB to CB wallet",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8wg7lj",
                    "author": "leon_reynauld",
                    "score": 1,
                    "created_utc": 1652755315.0,
                    "response": "Im fairly new to this, how do i take money out and put it on my hdd or ssd?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8whpr5",
                    "author": "I-Know-What-To-Do",
                    "score": 1,
                    "created_utc": 1652756120.0,
                    "response": "As long as you do not expose you have hardware wallet to anyone, your chances to get hacked is none. This including never let your seeds to touch 802.11 or CAT.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8wjhjt",
                    "author": "LSTNYER",
                    "score": 1,
                    "created_utc": 1652757074.0,
                    "response": "Same here. I've been slowly acquiring little by little over the years but always had a fear I'd lose mine either by Coinbases' fault or something stupid like I lost my phone. Switched majority over to Ledger and as soon as I reach a point of hodling, I send it over again. I was worried about the transfer, and did it a few times in small increments just in case. But once it was completed I felt much safer keeping them off the exchange",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8wk6m5",
                    "author": "PhoenixCTB",
                    "score": 1,
                    "created_utc": 1652757462.0,
                    "response": "Anyone considered ledger live??",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8wp77p",
                    "author": "TX_Deadhead",
                    "score": 1,
                    "created_utc": 1652760407.0,
                    "response": "Sent my stack to my brand new ledger nano x and it’s pretty badass I must say. I stuck to coinbase because it was easy and intuitive but now I realize I could have more sats from not paying so much in coinbase fees had I just done my DCA’ing on Strike and send to cold storage every 30 days or so. Never touching coinbase again!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8veml3",
                    "author": "SpiralBlue2",
                    "score": -1,
                    "created_utc": 1652737109.0,
                    "response": "I’ve started referring to them as ConBase and went to Binance for Cash Exchange and Ledger for longer holding. I don’t trust them at all.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8w7h8i",
                            "author": "MiguelLancaster",
                            "score": 1,
                            "created_utc": 1652750903.0,
                            "response": "Binance is far less trustworthy than Coinbase",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8w7q4l",
                                    "author": "SpiralBlue2",
                                    "score": 1,
                                    "created_utc": 1652751029.0,
                                    "response": "Explain why you think that?  \nI’m not in favor of having my assets taken if ConBase files bankruptcy. \nBut I’m curious on your position about Binanace since a friend of mine prefers them much more over ConBase.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8wclrh",
                                            "author": "MiguelLancaster",
                                            "score": 1,
                                            "created_utc": 1652753477.0,
                                            "response": "Binance charges withdrawal fees that far exceed on-chain mining fees\n\nBinance.com locked mine and many other accounts with zero advance warning when the switch to Binance.us happened \n\nBinance has its own shitcoin and shitcoins are shit\n\nYour assets are no more/less secure at Binance than at Coinbase, the language in the ToS regarding bankruptcy is not unique to Coinbase",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8wcvtv",
                                                    "author": "SpiralBlue2",
                                                    "score": 1,
                                                    "created_utc": 1652753619.0,
                                                    "response": "That’s the part I still don’t understand. Why are US residents tied to the limited version?  Almost want to just TOR to the .com but I’d need a foreign account then to tie it too.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8v6sb0",
                    "author": "Vinnypaperhands",
                    "score": 0,
                    "created_utc": 1652733832.0,
                    "response": "I usually keep a little on the exchanges but recently took it off. Fuck Coinbase",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8vjews",
                    "author": "Beatnik77",
                    "score": 0,
                    "created_utc": 1652739209.0,
                    "response": "Making a public announcement that you just got a physical device with your coins on it is MUCH more dangerous dans leaving them on coinbase.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8vjj81",
                            "author": "xyzzzzy",
                            "score": 2,
                            "created_utc": 1652739261.0,
                            "response": "How so?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8vkunl",
                                    "author": "Beatnik77",
                                    "score": 0,
                                    "created_utc": 1652739848.0,
                                    "response": "all they have to do is hack your reddit account, which give them access to your email address which could lead to easy fishing since you just bought the device and would expect mail from them. \n\nThousands of person lost their crypto on ledger after their were hacked and the hackers found all the email addresses of clients.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8volr0",
                                            "author": "Angustony",
                                            "score": -1,
                                            "created_utc": 1652741577.0,
                                            "response": "Phishing attacks, only phishing attacks.\n\nLiterally no one, I repeat no one has ever lost their crypto by being hacked when using a cold hardware wallet. You can ONLY lose your crypto by giving out your seed phrase. An email address cannot in any way give a clue to or access to your seed phrase.\n\nYou are completely and 100% wrong. 100%.\n\nBesides  if you are dumb enough to fall for phishing attacks, why would you not be dumb enough to fall for them when your coins are on an exchange?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8vp8og",
                                                    "author": "Beatnik77",
                                                    "score": 1,
                                                    "created_utc": 1652741878.0,
                                                    "response": "You can also lose your crypto if you lose your seed phase and ledger go bankrupt.\n\nYou can also send to the wrong address by accident.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8vspvy",
                                                            "author": "Limebird02",
                                                            "score": 3,
                                                            "created_utc": 1652743541.0,
                                                            "response": "No only if you loose your seed phrase.",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "i8vu7rh",
                                                            "author": "Angustony",
                                                            "score": 1,
                                                            "created_utc": 1652744273.0,
                                                            "response": "Doesn't matter at all if Ledger go bust or if I lose my Ledger. Only the seed phrase matters. Do a bit more reading my friend.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8w7ftj",
                            "author": "MiguelLancaster",
                            "score": 0,
                            "created_utc": 1652750883.0,
                            "response": "no it isn't, that's a very silly thing to say",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "ur2ph0",
            "title": "Bitcoin Addresses Holding 1 or More BTC Hits a New All-time High of 841,224",
            "url": "https://i.redd.it/35gp349ltvz81.jpg",
            "author": "Reahvenz",
            "created_utc": 1652726060.0,
            "score": 195,
            "num_comments": 29,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8v6ija",
                    "author": "SOLDIERSephiroth",
                    "score": 21,
                    "created_utc": 1652733725.0,
                    "response": "This is the opportunity…",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8v8g72",
                    "author": "HellKnightKilla",
                    "score": 19,
                    "created_utc": 1652734505.0,
                    "response": "While people are panicking, whales are like it's free real estate",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8ve9li",
                            "author": "NYKNYb",
                            "score": 18,
                            "created_utc": 1652736953.0,
                            "response": "Not whales frien, just Bitcoin Plebs.\nBitcoin plebs strong together.\nWe never sell for fiat.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8wwari",
                            "author": "Stunning_Novel9398",
                            "score": 2,
                            "created_utc": 1652765143.0,
                            "response": "Actually the opposite- price is going down as big dogs sell out and retail buying in",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8vmtqg",
                    "author": "prodigiousproducer",
                    "score": 9,
                    "created_utc": 1652740753.0,
                    "response": "So this combined with the number of wallets over 0.01is a grand total of 11 million.\n\nWe're still very early then right?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8wkqy4",
                            "author": "According_Ad5882",
                            "score": 3,
                            "created_utc": 1652757775.0,
                            "response": "All 1btc wallets are included in the 10 million over 0.01btc",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8w0uro",
                    "author": "arbalest_22",
                    "score": 4,
                    "created_utc": 1652747594.0,
                    "response": "I’m only .134 away!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8vzr1b",
                    "author": "Tilted_Compass",
                    "score": 13,
                    "created_utc": 1652747037.0,
                    "response": "Honestly surprised there's only 800k of us in the 21M club.  Kinda shocking.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8w5lwg",
                            "author": "SHA256dynasty",
                            "score": 6,
                            "created_utc": 1652749966.0,
                            "response": "That also assumes each of those people only have 1 address.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8wuo63",
                            "author": "CryptoCrumbSniffer",
                            "score": 1,
                            "created_utc": 1652763996.0,
                            "response": "I like to think of it as the population of the most exclusive city in the world.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8voerl",
                    "author": "Dandobob",
                    "score": 2,
                    "created_utc": 1652741486.0,
                    "response": "Does this number reflect when people hold on exchanges?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8vugh9",
                            "author": "c_games_official",
                            "score": 2,
                            "created_utc": 1652744393.0,
                            "response": "No. When you hold on exchanges, you aren't assigned your own bitcoin address, your money just gets lumped in with all the other btc that the exchange controls.\n\nThis can be easily seen when you make a transaction to withdraw or deposit coins to your exchange - just look at the transaction on a block explorer, you will see the funds moving along with dozens of other people's money.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8w3t9m",
                    "author": "k0b13",
                    "score": 2,
                    "created_utc": 1652749071.0,
                    "response": "Dips are for plebs",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8wohzq",
                            "author": "ReedoIncognito",
                            "score": 1,
                            "created_utc": 1652759982.0,
                            "response": "It is known",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8wf66b",
                    "author": "jolly_brewer",
                    "score": 2,
                    "created_utc": 1652754781.0,
                    "response": "Now is the time.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8wlck4",
                    "author": "Plenty_System45",
                    "score": 2,
                    "created_utc": 1652758115.0,
                    "response": "The time to accumulate 1 whole BTC is now!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8vtu4g",
                    "author": "Ok_Aerie3546",
                    "score": 2,
                    "created_utc": 1652744086.0,
                    "response": "According to the graph almost every day since inception was a new all time high. Whats the point here?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8x75dv",
                            "author": "Get_the_nak",
                            "score": 1,
                            "created_utc": 1652774040.0,
                            "response": "Adoption",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8wb3v2",
                    "author": "TommyTornstus",
                    "score": 1,
                    "created_utc": 1652752730.0,
                    "response": "I don't like how the price is on a log scale but the number of addresses isn't",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8woe14",
                    "author": "ReedoIncognito",
                    "score": 1,
                    "created_utc": 1652759915.0,
                    "response": "PLEBS, ARISE!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8wtat4",
                    "author": "ImpressiveAd1276",
                    "score": 1,
                    "created_utc": 1652763070.0,
                    "response": "But what about where many small deposits using different addresses to a wallet that make up 1 BTC? There must be millions of those.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8x79hq",
                            "author": "Get_the_nak",
                            "score": 1,
                            "created_utc": 1652774147.0,
                            "response": "You can say that again!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8wtf2s",
                    "author": "ImpressiveAd1276",
                    "score": 1,
                    "created_utc": 1652763150.0,
                    "response": "But what about where many small deposits using different addresses to a wallet that make up 1 BTC? There must be millions of those.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8wtfym",
                    "author": "ImpressiveAd1276",
                    "score": 1,
                    "created_utc": 1652763167.0,
                    "response": "But what about where many small deposits using different addresses to a wallet that make up 1 BTC? There must be millions of those.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8wu23n",
                    "author": "abhilodha",
                    "score": 1,
                    "created_utc": 1652763586.0,
                    "response": "Distribution\n\n\nU know what happes after that.\n\n\n\n Huge dump plebs left holding bags.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8x4ydu",
                    "author": "FeCard",
                    "score": 1,
                    "created_utc": 1652772070.0,
                    "response": "This isn't a good thing\n\nIt needs to be distributed more so it can be traded ON exchanges so the price can go up",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8x6ek0",
                            "author": "iammasvidal",
                            "score": 1,
                            "created_utc": 1652773360.0,
                            "response": "You are wrong. \n\nMore people holding and less on exchanges makes the price go up.\n\nIts called a supply squeeze.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8x6g7d",
                                    "author": "FeCard",
                                    "score": 1,
                                    "created_utc": 1652773401.0,
                                    "response": "Nah man, what happens when it's all off exchanges?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}