{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uwpfce",
            "title": "I’m 14 with my own hardware wallets and completely understand how Bitcoin works, and I’m going to start stacking for my future.",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uwpfce/im_14_with_my_own_hardware_wallets_and_completely/",
            "author": "PrimeDeep",
            "created_utc": 1653394470.0,
            "score": 358,
            "num_comments": 253,
            "subreddit": "Bitcoin",
            "selftext": "Putting this edit at the top:\nI worded the title badly, I do not “completely understand” how bitcoin works. I’m asking for peoples opinions if it’s a good idea to do what I’m doing. I understand the fundamentals and systems behind Bitcoin, but I’m still learning.\n\n\nThis isn’t probably the type of post you see everyday, but I just wanted to ask others opinions on my idea.\n\nI already know how private/public keys work, (I use SSH and PGP keys) and I know pretty much all about the fundamentals of how bitcoin works. I also have 3 hardware wallets, two ledgers (S plus and X) and a Trezor model T. (Don’t ask why I have so many)\n\nI’ve decided that I’m going to start stacking my coins in BTC, and save them for my future. I’m also wondering what other people’s thoughts are on this, personally I think it’s a great idea.\n\nPS: Scammers, don’t DM me, you just make yourself look like a dumbass and entertain me in the meantime.\n\nEdit 2: Thanks for the awards!",
            "stickied": false,
            "comments": [
                {
                    "id": "i9ssbd7",
                    "author": "ncoffex",
                    "score": 177,
                    "created_utc": 1653395296.0,
                    "response": "At 14 with even basic knowledge and a desire to prepare for your future, you are already ahead of most. My advice would be to seek as much fundamental knowledge as possible then use that to validate your decisions and stick to your goals. Don’t get too caught up in how others feel about something that you believe in.\n\nKeep it up kid, you’re doing great!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9st00h",
                            "author": "PrimeDeep",
                            "score": 43,
                            "created_utc": 1653395690.0,
                            "response": "Thanks! That means a lot more to me than you probably think!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9t4qtp",
                                    "author": "l___-T-___l",
                                    "score": 71,
                                    "created_utc": 1653401540.0,
                                    "response": "Are you open to adoption? I’m 34 and looking for new parents",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9svsl2",
                    "author": "satayasat",
                    "score": 122,
                    "created_utc": 1653397212.0,
                    "response": "Just don’t sell it, not for your girlfriend or buddies or siblings. And don’t talk about it, even when it gets exciting once you’re in the green.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9t05e5",
                            "author": "Gentilegentry",
                            "score": 67,
                            "created_utc": 1653399386.0,
                            "response": "What he said, and also NEVER TALK ABOUT IT. Having it is great and offers peace of mind. If you *tell* people you have it they remember and you become a target of the $5 wrench attack, a whole lot of potential scams, romantic partners who see themselves taking you for everything, etc.  If nobody knows you have it, it can't affect how they treat you.\n\nSecrecy is safety!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9tfynf",
                                    "author": "theh8ed",
                                    "score": 20,
                                    "created_utc": 1653406332.0,
                                    "response": "If anyone found out I have .09 BTC I'd be in trouble. So I'd never say anything, especially online.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9tjf6o",
                                            "author": "Fukdataxcode",
                                            "score": 6,
                                            "created_utc": 1653407767.0,
                                            "response": "Lmao 😂 oh no keep your .005432 bitcoin safe . DO NOT TELL ANYONE YA HEAR",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9tmzyb",
                                                    "author": "Keith_Kong",
                                                    "score": 0,
                                                    "created_utc": 1653409234.0,
                                                    "response": "You guys joke but if Bitcoin reaches $10mil that could get serious.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9touhp",
                                    "author": "Hasslescoff",
                                    "score": 1,
                                    "created_utc": 1653409979.0,
                                    "response": "Romantic partners taking you for everything?\n\n\n\nLmfao.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9tirkt",
                            "author": "2SatoshiJoe",
                            "score": 7,
                            "created_utc": 1653407499.0,
                            "response": "I was going to upvote this and then I saw it had 69 upvotes. Better not touch that.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9tislp",
                                    "author": "nice___bot",
                                    "score": 2,
                                    "created_utc": 1653407511.0,
                                    "response": "Nice!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9syla9",
                            "author": "PrimeDeep",
                            "score": 19,
                            "created_utc": 1653398626.0,
                            "response": "Will do, it’s not like anybody I talk to would understand bitcoin 😂 I’d probably get called delusional saying that decentralized money is the future.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9t54wj",
                                    "author": "throw-money-away",
                                    "score": 17,
                                    "created_utc": 1653401715.0,
                                    "response": "We are in 2022 not 2015. a lot of people generally understand how crypto works and its potential beneftis.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9tg3f6",
                                            "author": "Meowseeks",
                                            "score": 11,
                                            "created_utc": 1653406389.0,
                                            "response": "Have you talked to people outside of the “crypto” community? I have coworkers (software developers) who still think it’s a scam. Some people will *never* understand. It’s beyond frustrating.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9thcbb",
                                                    "author": "throw-money-away",
                                                    "score": 5,
                                                    "created_utc": 1653406907.0,
                                                    "response": "A lot of the crypto space is a scam so I get that sentiment from people. \nIn my experience, most college students, young professionals and also some boomers who have interest in business are very aware of crypto. I am aware it’s still a small % globally but at least in business circles people are aware x Many skeptical but most understand the general concept and implications. \n\nOf course understanding every part of how it works is very hard and most don’t. (Including OP, I find it weird that he claims he completely understands btc, but who knows). Most understand it exists and have a sense of how it works/ what it can do.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9tjs0h",
                                                            "author": "Fukdataxcode",
                                                            "score": 3,
                                                            "created_utc": 1653407914.0,
                                                            "response": "You’re talking about circles that are more sophisticated then the general population. The average person doesn’t even understand the stock market. Much less bitcoin . \nPeople really don’t realize how financially uneducated people are. It’s meant by design though",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9tmx5o",
                                                                    "author": "throw-money-away",
                                                                    "score": 2,
                                                                    "created_utc": 1653409203.0,
                                                                    "response": "Yeah fair. Just saying crypto is not a hidden niche anymore",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9to4md",
                                            "author": "BrofessionalRetard",
                                            "score": 1,
                                            "created_utc": 1653409689.0,
                                            "response": "Lmao",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9tus4s",
                                    "author": "antennawire",
                                    "score": 1,
                                    "created_utc": 1653412398.0,
                                    "response": "People will never give you credit for your vision. They will just be jealous and pretend they know why it will still fail in the future. Make sure you don't run out of 'regular' cash, don't give yourself reasons to spend btc.. Don't get too excited when the price goes up. Don't do drugs.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9tv0oy",
                                    "author": "tercota",
                                    "score": 1,
                                    "created_utc": 1653412496.0,
                                    "response": "Good thing that you are behaving so good with maturity.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9sxtwa",
                    "author": "ashtonlaszlo",
                    "score": 18,
                    "created_utc": 1653398258.0,
                    "response": "I’ve gotta say, I share the same opinion as most others here. It’s an incredibly smart move to start saving at such a young age. \n\nHonestly, the best thing you can do is diversify and compound. \n\nI’m personally way into crypto, both BTC and alts. But to really diversify, you should be investing in other asset classes. Many apps/systems out there to make ease of this. Things such as fractional realty, mutual funds, ETFs, etc. \n\nI have a recommendation that would require your parents’ help, but it’s something I do for both my kids. A UTMA/UGMA account. Do a little reading on those. There is a mobile app/banking/investing platform that offers these and is super easy to use. And they’ll reinvest your earning which really adds value over long time periods by compounding your returns. Its called Acorns and is, unfortunately only available in the US. There are other similar platforms available in other regions, but I’m not recalling their names. \n\nI promise this isn’t a shill. Just a suggestion. \n\nKeep thinking and planning for the long term and your life will be everything you want it to be one day.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9t0h3h",
                            "author": "PrimeDeep",
                            "score": 8,
                            "created_utc": 1653399544.0,
                            "response": "I’ll look into acorns and all of that. My parents support me in almost everything that I pursue so  my parents would definitely help me. \n\nThanks for taking all the time to write that out!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9tj1lw",
                                    "author": "RubiconV",
                                    "score": 2,
                                    "created_utc": 1653407613.0,
                                    "response": "To best secure your future don’t go all in on one asset class.  Like many are saying, get some BTC and crypto, a S&P 500 index fund (Vanguard is good), and eventually some real estate.  So your overall portfolio would be crypto, stocks, and real estate.  You will do well over the long term and it’s a long game.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9tglhk",
                            "author": "stefanica",
                            "score": 1,
                            "created_utc": 1653406597.0,
                            "response": "Came here to say this, especially about the diversifying. Even if you can just put $10 or something a week into your investing, directing some right away into a basic index fund each time will go a long way before you are even an adult. I knew quite a bit about investing at your age, but it was much harder to start out with small increments in the early 90s...commissions and fees were so much more, and the barrier to entry was just so much higher. Like having to put in a few thousand just to open a bare bones brokerage acct with someone like Schwab. So I didn't get started when it would have done the most good.\n\nAnyway, good luck, keep educating yourself, diversify, and don't freak out about the little dips and peaks (good or bad). Keep the big picture in mind, and remember that dips in the market is like your favorite store having a big sale...you get to buy more! As long as you are in more than one asset or class (as in, not just Apple stock or whatever...almost all things come to an end), you'll come out ahead. Dollar cost averaging is everything over time.\n\nAlso use this time to learn about/play with budgeting and what is sometimes called \"paying yourself first.\" Whether at your age and the next few years, you have odd jobs, a steady job, or just random windfalls like holiday $$ gifts...pick a percentage and always put that amount or more right into savings/investment, so you get used to that and don't miss it. :) It makes the mindset so much easier by the time you have to seriously consider things like taxes.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9tyhh1",
                            "author": "jirografia",
                            "score": 1,
                            "created_utc": 1653413926.0,
                            "response": "Damn man, this is a good suggestion and we all love it.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9t19vf",
                    "author": "SpaghettiTime99",
                    "score": 17,
                    "created_utc": 1653399926.0,
                    "response": "Just one thing, only invest the money you are ok to lose. You never know what kind of shit will hit the fan next, but it WILL do that one day.\n\nAlso, do not brag about bitcoins to get a girl. Never.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9tg7um",
                            "author": "Secret_Operative",
                            "score": 4,
                            "created_utc": 1653406441.0,
                            "response": "At 14 that's all money. You can lose it all without consequence.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9t0i0h",
                    "author": "growbot_3000",
                    "score": 9,
                    "created_utc": 1653399557.0,
                    "response": "Don't tell so many people..work in silence.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9t2lgq",
                    "author": "brando2131",
                    "score": 28,
                    "created_utc": 1653400550.0,
                    "response": "Not sure if you \"completely understand\". If not, read Mastering Bitcoin and Mastering Lightning Network by A. Antonopoulos. Go learn how the stack-based Bitcoin scripting language works, write some scripts on testnet. Learn how redeem scripts, witness script, multisig scripts works. Learn not just lightning network works, but how the scripts are written and all their possible spending conditions. Understand all the BIPs, ones that are in Bitcoin and ones that aren't. Learn Segwit, Schnorr, MAST, Taproot, Graftroot, CTV, RGB, Taro, LNURL, channel factories at an in-depth technical level. Learn how to code C++, Go. Read the mailing lists, discussions, and Bitcoin Optech newsletters. Then go start contributing to one of the Bitcoin open source projects like LND.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9t9i51",
                            "author": "jirski",
                            "score": 12,
                            "created_utc": 1653403609.0,
                            "response": "This guy Bitcoins",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9th0kc",
                                    "author": "AdamJensensCoat",
                                    "score": 6,
                                    "created_utc": 1653406772.0,
                                    "response": "This guy studied the blade.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9t97bd",
                            "author": "GorillaP1mp",
                            "score": 3,
                            "created_utc": 1653403481.0,
                            "response": "Two great resources",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9trtnb",
                            "author": "Markenbier",
                            "score": 2,
                            "created_utc": 1653411189.0,
                            "response": "Damn there's a lot in this list I still have to learn. I can code but all the other things you mentioned? Don't even know what they are for some of them. Thanks for the good resources!!",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9txfj0",
                            "author": "DefiantAbalone1",
                            "score": 1,
                            "created_utc": 1653413489.0,
                            "response": "Jimmy Song has entered the chat",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9tk6a9",
                            "author": "Fukdataxcode",
                            "score": 1,
                            "created_utc": 1653408074.0,
                            "response": "This guy fucks 😳",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9tlpqe",
                                    "author": "CoolMomJammy",
                                    "score": 1,
                                    "created_utc": 1653408709.0,
                                    "response": "Damnit I was gonna say that 😳",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9st006",
                    "author": "roboratka",
                    "score": 20,
                    "created_utc": 1653395690.0,
                    "response": "Any experienced investor would recommend diversifying your portfolio. You may know about Bitcoin but there’s always a lot to learn about investing and managing wealth. Bitcoin is only one vehicle which represents the higher risk end of several investment options.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9t6pk6",
                    "author": "VastOlives",
                    "score": 27,
                    "created_utc": 1653402401.0,
                    "response": "r/iamverysmart",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9tqt20",
                            "author": "tkornfeld",
                            "score": 2,
                            "created_utc": 1653410773.0,
                            "response": "Plus the “thanks for the awards edit”. Cringe.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9t83vg",
                            "author": "PrimeDeep",
                            "score": 1,
                            "created_utc": 1653403009.0,
                            "response": "I’m asking for other people’s opinions…",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9tgmqi",
                                    "author": "Secret_Operative",
                                    "score": 6,
                                    "created_utc": 1653406612.0,
                                    "response": "Yeah he's referring to 'I completely understand Bitcoin'. I know 14 year olds tend to think in absolute terms... But I've been in Bitcoin since 2009, mined, traded, hodled, worked for several companies in the space, and I would never claim to fully understand everything.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9tgrk8",
                                            "author": "PrimeDeep",
                                            "score": 1,
                                            "created_utc": 1653406668.0,
                                            "response": "I know, the wording I chose was shit. Check the edit.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9thn0k",
                            "author": "frumpydrangus",
                            "score": 1,
                            "created_utc": 1653407032.0,
                            "response": "OP is Satoshi",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9t2y4g",
                    "author": "JonathanTheZero",
                    "score": 16,
                    "created_utc": 1653400714.0,
                    "response": "> completely understand how Bitcoin works\n\nPretty sure you don't",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9t8xth",
                            "author": "ShareblockHolmes",
                            "score": 10,
                            "created_utc": 1653403366.0,
                            "response": "Noone who completely understands bitcoin would ever say they do. Stay humble buddy",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9teet3",
                                    "author": "PrimeDeep",
                                    "score": 2,
                                    "created_utc": 1653405682.0,
                                    "response": "I worded my title terribly, check my edit",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9srtzj",
                    "author": "myironcity",
                    "score": 7,
                    "created_utc": 1653395014.0,
                    "response": "Your on your way to a bright future. Keep stacking 💪.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9srcc2",
                    "author": "BackInTheDay23",
                    "score": 17,
                    "created_utc": 1653394741.0,
                    "response": "I really doubt you \"completely understand\" how Bitcoin works. But welcome aboard.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ssikz",
                            "author": "PrimeDeep",
                            "score": 8,
                            "created_utc": 1653395412.0,
                            "response": "I understand all the fundamentals from hashes to keys, etc. I understand about it than most adults I talk to, but that makes sense since most people aren't educated on Bitcoin yet.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9sup4m",
                                    "author": "BTCMachineElf",
                                    "score": 14,
                                    "created_utc": 1653396628.0,
                                    "response": "The bitcoin rabbit hole goes deep.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9sz93g",
                                            "author": "kitastrophae",
                                            "score": 2,
                                            "created_utc": 1653398947.0,
                                            "response": "So deep?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9tf9vm",
                                                    "author": "schemingraccoon",
                                                    "score": 1,
                                                    "created_utc": 1653406043.0,
                                                    "response": "Prime deep",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i9ty38q",
                                                    "author": "SnackFactory",
                                                    "score": 1,
                                                    "created_utc": 1653413762.0,
                                                    "response": "So deep, put her a\\*\\* to sleep?",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9t42xc",
                    "author": "basedisciple",
                    "score": 3,
                    "created_utc": 1653401233.0,
                    "response": "I hope you understand how far ahead of the game you are. At 14 I didn't even know what stocks were.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9t5ai0",
                    "author": "solotronics",
                    "score": 3,
                    "created_utc": 1653401784.0,
                    "response": "Practice your recovery method!\n\n If your doing multisig be careful and practice how to recover all your hardware wallets. You don't want to lose a wallet and be locked out of your Bitcoin forever, this is more common than you think and always the result of people not testing their backup/recovery method.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9t5e7q",
                            "author": "PrimeDeep",
                            "score": 3,
                            "created_utc": 1653401830.0,
                            "response": "Already have! I put 10 bucks in, then recovered my seed and it worked.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9t70nj",
                    "author": "mr__0tter",
                    "score": 3,
                    "created_utc": 1653402534.0,
                    "response": "OMG little buddy you are SET FOR LIFE. Keep a level head, just keep stacking, keep learning all about the space. Make as much fiat as you can while you have no overheads and plough it into BTC.\n\nfind a mentor you trust, never tell anyone how much you hold EVER. Just learn from those who inspire you. Pumped for you man! You've got a wonderful life ahead of you",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9tagk5",
                    "author": "Da0ptimist",
                    "score": 3,
                    "created_utc": 1653404018.0,
                    "response": "What do you expect people on this sub to answer?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9t1fjn",
                    "author": "Lewzer33",
                    "score": 5,
                    "created_utc": 1653400003.0,
                    "response": "Wow. Now this is what I like to see. I’m on track to retire by 40 but I think you’ll have me beat by a decade. Stay dedicated!!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9t69lk",
                            "author": "PrimeDeep",
                            "score": 2,
                            "created_utc": 1653402207.0,
                            "response": "Wow, retiring by 40 is insane. Great job!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9th1fs",
                                    "author": "Secret_Operative",
                                    "score": 1,
                                    "created_utc": 1653406783.0,
                                    "response": "r/financialindependence\n\nIt ain't insane. Especially if you start now.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9srt6p",
                    "author": "tehmattrix",
                    "score": 2,
                    "created_utc": 1653395002.0,
                    "response": "I think YAGMI.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9swd25",
                            "author": "Mozaren",
                            "score": 1,
                            "created_utc": 1653397504.0,
                            "response": "I see what you did there",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9st9lc",
                    "author": "bigk1121ws",
                    "score": 2,
                    "created_utc": 1653395840.0,
                    "response": "keep it going but only invest what you are okay to lose, crypto can do anything, could be gone tomorrow, not likely but possible, the regulations get worse by the minute I sware.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9svg65",
                            "author": "PrimeDeep",
                            "score": 2,
                            "created_utc": 1653397030.0,
                            "response": "I feel as if regulations will only strengthen and solidify bitcoin’s purpose",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9stetn",
                    "author": "alien3d",
                    "score": 2,
                    "created_utc": 1653395923.0,
                    "response": "good  but depend on your life target .If you parent support much better.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9suihi",
                            "author": "PrimeDeep",
                            "score": 2,
                            "created_utc": 1653396529.0,
                            "response": "They support me, and I'm very appreciative of them helping me acquire my coins. It damn sucks everything requires KYC nowadays.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9swiop",
                                    "author": "Mozaren",
                                    "score": 2,
                                    "created_utc": 1653397583.0,
                                    "response": "Yeah but it’s a normal thing, kyc is important young padawan",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9t398i",
                                    "author": "alien3d",
                                    "score": 1,
                                    "created_utc": 1653400855.0,
                                    "response": "ya.. i don't like it either . for me , it just service .",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9stu1k",
                    "author": "BTCMachineElf",
                    "score": 2,
                    "created_utc": 1653396155.0,
                    "response": "Sounds like you got it figured out. A kid after my own heart. I also own three hardware wallets; ledger nano, trezor 1, and coldcard mk3. I do recommend coldcard.\n\nIf you can, spin up an Umbrel node, point electrum to it. If you do that before you even create your wallet, you can avoid sharing your public key with anyone, to keep your wallet more private. You can even play with lightning a bit but you likely won't profit from that so keep expectations low. Running a node however is an easy and fun way to contribute to the network and improve your own opsec. And Umbrel has a ton of add-on apps for various features and functionality (like your own personal [mempool.space](https://mempool.space) ).",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9svzw6",
                            "author": "PrimeDeep",
                            "score": 2,
                            "created_utc": 1653397314.0,
                            "response": "I’ve heard many good things about coldcard. I have also used lightning before and I like it because it can help make bitcoin become more adopted by society. Running my own node is a great idea, I have my own linux server so I might try and do that!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9sxba5",
                                    "author": "BTCMachineElf",
                                    "score": 1,
                                    "created_utc": 1653397992.0,
                                    "response": "I'm not sure if umbrel can run on a pre-existing server (perhaps), but you could run bitcoin core and electrum personal server (umbrel is waaay easier to set up). Or scrap the current server os for umbrel if its nonessential.\n\nA 1tb ssd is important. Otherwise it's going to be extremely slow and laggy. If you can score a raspberry pi 4; it's an ideal little setup. If not, make do with what you've got.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9sxpbc",
                                            "author": "PrimeDeep",
                                            "score": 3,
                                            "created_utc": 1653398193.0,
                                            "response": "Nothing is running on it so I can change the OS. I’ll look at some youtube tutorials on how to set it up. I do also have a raspberry pi so I might try using that.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9sui5r",
                    "author": "shymeeee",
                    "score": 2,
                    "created_utc": 1653396524.0,
                    "response": "At 14, how did you learn all of this?  I'm an older guy who's curious.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9swq3c",
                            "author": "PrimeDeep",
                            "score": 5,
                            "created_utc": 1653397691.0,
                            "response": "Videos, boredom, and my own interests in technology. I learned how public and private keys worked, then I found out about crypto and it seemed like a great idea for a currency to be based around the idea of owning your money and being able to do whatever you want with it (money for the people)\n\nMany videos and texts later, a few hardware wallets, and here I am, a young crypto enthusiast.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9sycsx",
                                    "author": "shymeeee",
                                    "score": 2,
                                    "created_utc": 1653398511.0,
                                    "response": "You know how to use, say, a Ledger Nano?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9sz1f5",
                                            "author": "PrimeDeep",
                                            "score": 2,
                                            "created_utc": 1653398845.0,
                                            "response": "Yep, I use them all the time.\n\nRight now, I mainly use a Nano X and Trezor T. Really liking my ledger.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9t4a25",
                                                    "author": "shymeeee",
                                                    "score": 1,
                                                    "created_utc": 1653401325.0,
                                                    "response": "Why aren't you worried about losing those precious seeds and passwords? I mean, one mistake and you can lose a fortune.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9t79gi",
                                                            "author": "PrimeDeep",
                                                            "score": 1,
                                                            "created_utc": 1653402639.0,
                                                            "response": "I keep them in safe places so I don’t really need to be worry about them.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9tohel",
                                                                    "author": "shymeeee",
                                                                    "score": 1,
                                                                    "created_utc": 1653409833.0,
                                                                    "response": "So that's what everyone does? Find a safe secret place, keep them there, and \"hope\" you never get sick and lose your memory. haha... I'm serious.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9sym3r",
                    "author": "FerezLP",
                    "score": 2,
                    "created_utc": 1653398637.0,
                    "response": "Keep yourslef grounded, always research why you main idea *is* wrong, you are young, you might be smarter than the average, but ego is the worst enemy of everyone",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9szev9",
                    "author": "BlueBirdDolphin",
                    "score": 2,
                    "created_utc": 1653399026.0,
                    "response": "Already win",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9szlru",
                    "author": "woodentaint",
                    "score": 2,
                    "created_utc": 1653399120.0,
                    "response": "good for you, ahead of the curve in your age group for sure",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9t2z79",
                    "author": "RedditorYogi",
                    "score": 2,
                    "created_utc": 1653400728.0,
                    "response": "Kid you makin' some real moves! Good job!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9t52g1",
                    "author": "Bitmiliionare24",
                    "score": 2,
                    "created_utc": 1653401684.0,
                    "response": "I saw people who are in the bitcoin rabbit hole for more than 5 years, (and many decades in the financial sector) admitting they are still learning about what bitcoin is. You’re in the right way young Jedi, but admitting you know everything, will make you learn nothing new… keep stacking and good luck internet friend 🙌🏽",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9t7wk2",
                            "author": "PrimeDeep",
                            "score": 2,
                            "created_utc": 1653402920.0,
                            "response": "I did word that pretty badly. I meant that I understand the fundamentals of how it works and the systems behind it, I still have much more to learn.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9tabhb",
                                    "author": "Bitmiliionare24",
                                    "score": 1,
                                    "created_utc": 1653403958.0,
                                    "response": "You rock, wish i had your understanding of my future when i was your age,I’m sure you’ll do more than fine 🙏🏼",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9t63jk",
                    "author": "ChosenRocket93",
                    "score": 2,
                    "created_utc": 1653402134.0,
                    "response": "Started trading/investing in crypto at 14 too. I’m 16 now and my advice would be to keep it to yourself. Talking about crypto to your friends randomly or just bringing it up suddenly will just make it seem like you think you’re “smarter” than others for knowing what bitcoin is.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9t7umz",
                    "author": "azerty543",
                    "score": 2,
                    "created_utc": 1653402896.0,
                    "response": "At your age you will have much better returns investing in skills and education.  College, trade school, certifications ect.  Invest in yourself at this point not bitcoin. Everything is a trade off and you are spending money on digital money that could better be spent giving yourself valueble experiences.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9t8u8e",
                            "author": "GorillaP1mp",
                            "score": 1,
                            "created_utc": 1653403324.0,
                            "response": "I’d say college is about as risky as BTC😂",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9tja7x",
                                    "author": "azerty543",
                                    "score": 1,
                                    "created_utc": 1653407710.0,
                                    "response": "College degrees will still statistically net you $2.8 million dollars more than those without.  Yes if you get a non marketable degree well its going to be harder but if you get anything from healthcare to I.T to even trades like electrician work you will come out ahead easily.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9tjpol",
                                            "author": "GorillaP1mp",
                                            "score": 1,
                                            "created_utc": 1653407889.0,
                                            "response": "Totally agree, it’s definitely valuable depending on your field. There are plenty of fields where you gain value from a degree. There are also a growing number of fields where it’s more cost effective to explore other options. Even electrical I would say should be done through a trade school for better value.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9t833z",
                    "author": "Freddybone32",
                    "score": 2,
                    "created_utc": 1653403000.0,
                    "response": "You're 14.\n\nYou don't completely understand anything.\n\nKeep learning.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9t8ek3",
                            "author": "PrimeDeep",
                            "score": 1,
                            "created_utc": 1653403139.0,
                            "response": "I understand a lot of the fundamentals, but I’m still learning. I worded the title pretty badly…",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9ta04y",
                    "author": "shejek2828",
                    "score": 2,
                    "created_utc": 1653403824.0,
                    "response": "How do you even buy bitcoin? Most exchanges require you to be 18.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9tapk4",
                    "author": "andromaniac_",
                    "score": 2,
                    "created_utc": 1653404124.0,
                    "response": "Hey, 15 here. Same deal! How do you buy bitcoin? I’ve done it though parents crypto accounts but it’s a tax nightmare.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9taxue",
                            "author": "PrimeDeep",
                            "score": 1,
                            "created_utc": 1653404222.0,
                            "response": "I use coinbase, you could also use Binance. Just give the tax forms to your parents, and give them the money you owe. It should be pretty easy, and they should know what to do with it.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9tcw76",
                    "author": "Anon424977",
                    "score": 2,
                    "created_utc": 1653405045.0,
                    "response": "I find it weird and a bit cringe that people would start they’re post with their age.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9te7p7",
                            "author": "PrimeDeep",
                            "score": 1,
                            "created_utc": 1653405601.0,
                            "response": "Didn’t think this post would blow up, I was asking for peoples opinions.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9tenl8",
                    "author": "sossolha9ira",
                    "score": 2,
                    "created_utc": 1653405782.0,
                    "response": "I just come to say hey 👋 to the future billionaire right here!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9tm152",
                    "author": "RandomTask100",
                    "score": 2,
                    "created_utc": 1653408841.0,
                    "response": "Everyone's 14 on crypto subreddits this week......",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9tqmzt",
                    "author": "Tolaria2021",
                    "score": 2,
                    "created_utc": 1653410704.0,
                    "response": "Yeah, a 14 year old wrote this. The karma farming that gets gobbled up by this sub is incredible.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9tszr6",
                    "author": "Flix_redone23",
                    "score": 1,
                    "created_utc": 1653411666.0,
                    "response": "Wait how do you even buy crypto, don’t you have to be 18? I’m 18 and I can’t even buy it. Because I need a proof of address but i still live with my parents",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9twxzq",
                            "author": "tral62",
                            "score": 1,
                            "created_utc": 1653413288.0,
                            "response": "that’s still an address?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9u040i",
                                    "author": "halroth",
                                    "score": 1,
                                    "created_utc": 1653414596.0,
                                    "response": "He said proof of an adress, which is an utility bill in your name at an adress. Some places require that.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9sz45l",
                    "author": "Eyonizback",
                    "score": 7,
                    "created_utc": 1653398881.0,
                    "response": "I doubt at 14 you understand personal finance considering you are not old enough to work and manage income and expenses",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9t1kr7",
                            "author": "herikihfde",
                            "score": -4,
                            "created_utc": 1653400072.0,
                            "response": "Not everyone is like you",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9t2uef",
                    "author": "Alea_Iacta_Est21",
                    "score": 2,
                    "created_utc": 1653400665.0,
                    "response": "This is NOT a 14 y/o parlance. Education industry here.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9stbfy",
                    "author": "Savik519",
                    "score": 2,
                    "created_utc": 1653395869.0,
                    "response": "At 14 I could barely tie my own shoes. OP will rule the world someday",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9syt5s",
                    "author": "Hectic-Mind",
                    "score": 2,
                    "created_utc": 1653398733.0,
                    "response": "You sound like you know what you're talking about. Some real advice, don't listen to most these dumbfucks on Reddit.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9tb3qf",
                    "author": "piotrek211",
                    "score": 0,
                    "created_utc": 1653404291.0,
                    "response": "You're like 5 years too late",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9tb6yj",
                            "author": "PrimeDeep",
                            "score": 1,
                            "created_utc": 1653404329.0,
                            "response": "You won’t be saying that in another 5.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9tbd6v",
                                    "author": "piotrek211",
                                    "score": -2,
                                    "created_utc": 1653404403.0,
                                    "response": "I won't because btc will crash so hard that it'll be good time to buy",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9tmwfv",
                                            "author": "reformed",
                                            "score": 1,
                                            "created_utc": 1653409196.0,
                                            "response": "DCA is the way regardless of whatever wizardry you think you might be able to use to time the market.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9stvvk",
                    "author": "kumuruke",
                    "score": 1,
                    "created_utc": 1653396184.0,
                    "response": "It surely depends on where you live, but considering the direction the world seems to be going it might be a good idea to learn something about cyber security and not leaving any traces on the internet (not on the blockchain either).",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9sutro",
                    "author": "n-Ro",
                    "score": 1,
                    "created_utc": 1653396696.0,
                    "response": "Don't be a dick to people when you're filthy rich pls\n\nEdit: or do whatever the f*ck you wanna do. But don't say shit like have fun being poor. Because it's not fun being poor, so you can't really HAVE fun being poor. \"Anyways, so I started stacking more BTC\"",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9sv86t",
                            "author": "PrimeDeep",
                            "score": 2,
                            "created_utc": 1653396912.0,
                            "response": "I’m not rich at all. Stacking means to just collect your savings and slowly build your wealth. I don’t believe I was being a dick to anybody, but everybody’s entitled to their own opinion.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9svoye",
                                    "author": "n-Ro",
                                    "score": 3,
                                    "created_utc": 1653397160.0,
                                    "response": "Man I don't know why I came at you with this weird attitude honestly. I just woke up and thought what I said would be funny, and now I'm a little more awake and it's totally not funny at all..\n\nI just crossed .25 BTC last week. Huge milestone for me as I've been stacking since $40k when Tesla bought BTC. These next several months I think should be the best time to be stacking. So, good on you for recognizing that fiat dies and that BTC is the hardest currency out there (if you believe in a digital infrastructure future). \n\nYou're the man!",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9sy8w0",
                                            "author": "PrimeDeep",
                                            "score": 2,
                                            "created_utc": 1653398460.0,
                                            "response": "Thanks man, It means a lot! I’m nowhere near what you’re at, but great job on your milestone! I hope to reach that one day, it’ll take a lot of stacking.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9syh74",
                                                    "author": "n-Ro",
                                                    "score": 3,
                                                    "created_utc": 1653398571.0,
                                                    "response": "You got it baby cakes. I'm 27 years old. Normally I would say \"I have 14 years on you\"\n\nBut in this case, since we're talking about Bitcoin, and since time is on our side with Bitcoin, you're the one with 14 years on me!",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9svjlq",
                    "author": "twenster",
                    "score": 1,
                    "created_utc": 1653397081.0,
                    "response": "If you want to go in crypto and invest, you would want to have multiple wallets. The goal is not to have everything in one basket. This is some basic finance best practices. So one wallet for long term investing. One wallet for shorter term, that one you could have you day to day buy/sell/trade.\nSomething good with the long term, as you want to do, is stacking. However, be sure that the stacking keeps your tokens in your wallet, instead of getting counterparts token. Because you don't know in 4 or 5 year what will be the platform you are stacking on. This means also checking regularly that stacking platform.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9sydf1",
                            "author": "PrimeDeep",
                            "score": 1,
                            "created_utc": 1653398520.0,
                            "response": "That’s what I’m starting to do. I’m going to eventually start to diversify my holdings among multiple wallets once I get there, I don’t plan on selling anytime soon.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9syuha",
                    "author": "RealLilacCrayon",
                    "score": 1,
                    "created_utc": 1653398751.0,
                    "response": "At your age, the main issue is capital.  How in the world is a 14 year old going to earn the money needed to stack sats.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9t43nn",
                            "author": "Independent_North_56",
                            "score": 2,
                            "created_utc": 1653401242.0,
                            "response": "Clearly OP won’t be 14 forever. Stacking is naturally a long term practise. \nThey are way ahead of the curve despite how small any initial investment might be.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9t1izn",
                            "author": "herikihfde",
                            "score": 1,
                            "created_utc": 1653400049.0,
                            "response": "Work",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9sz0t5",
                    "author": "Wolfos9",
                    "score": 1,
                    "created_utc": 1653398836.0,
                    "response": "You're gonna make it buddy. It took me 35 years to get to your point.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9sznkq",
                            "author": "PrimeDeep",
                            "score": 3,
                            "created_utc": 1653399146.0,
                            "response": "Hopefully I will!\n\nI’ll keep building up over time, putting money that I would rather spend on useless things into BTC.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9szzoh",
                                    "author": "Wolfos9",
                                    "score": 1,
                                    "created_utc": 1653399310.0,
                                    "response": "Amen to that!",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9tbgsq",
                                    "author": "Leading-Fail-7263",
                                    "score": 1,
                                    "created_utc": 1653404444.0,
                                    "response": "How much have got got man? I’m 17 and in a fairly similar position ...",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9tbnmc",
                                            "author": "PrimeDeep",
                                            "score": 2,
                                            "created_utc": 1653404521.0,
                                            "response": "Not much at all, but I’m going to build up.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9tcbcv",
                                                    "author": "Leading-Fail-7263",
                                                    "score": 1,
                                                    "created_utc": 1653404798.0,
                                                    "response": "Nice one. I’m 17 and have also only got ~$400. In another altcoin too, but that’s it. How much were your cold wallets?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9te2z1",
                                                            "author": "PrimeDeep",
                                                            "score": 2,
                                                            "created_utc": 1653405547.0,
                                                            "response": "Ledger nano X (my favorite) about $150 (was a gift)\n\nLedger nano S plus: $80, same thing as X, but smaller and can’t connect to iPhones as it has no bluetooth or battery. I think it can connect to android though.\n\nTrezor model T i got it for 230, now it’s around 300. (inflation right there) has a very nice touch screen, easy to use and super easy to setup. However, not as secure as ledger.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9t1gs8",
                    "author": "btcoins",
                    "score": 1,
                    "created_utc": 1653400019.0,
                    "response": "You’re smarter than 99% of the population including 99% of the crypto community. If you’re 14 and don’t fall for obvious shitcoin scams I really don’t feel bad for the shitcoin communities that’ll lose all their money in a couple years",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9t9mbt",
                            "author": "GorillaP1mp",
                            "score": 1,
                            "created_utc": 1653403660.0,
                            "response": "But cmon, they print money, and have so many use cases…like creating nothing out of nothing that’s worth nothing!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9t23s9",
                    "author": "apaulogy",
                    "score": 1,
                    "created_utc": 1653400320.0,
                    "response": "I'd just shut down your DMs, bro.\n\nNot that you aren't smart, but you are about to get swarmed by dopes trying to validate your wallet.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9t2fub",
                            "author": "PrimeDeep",
                            "score": 2,
                            "created_utc": 1653400478.0,
                            "response": "Tbh it’s kinda funny to mess with them",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9t3m3t",
                                    "author": "apaulogy",
                                    "score": 1,
                                    "created_utc": 1653401020.0,
                                    "response": "\"Y'all muthafuckas need Jeesuz\"",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9t2ajf",
                    "author": "aleeyam",
                    "score": 1,
                    "created_utc": 1653400409.0,
                    "response": "I'm a 6 month baby already DCA'ing Sats for my future",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9t2gtq",
                    "author": "keto_brain",
                    "score": 1,
                    "created_utc": 1653400492.0,
                    "response": "Personally I'd wait for it to crash more.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9t3llf",
                    "author": "SoupyAT",
                    "score": 1,
                    "created_utc": 1653401014.0,
                    "response": "Honestly, don’t do it. Getting into a good saving routine is best when you are so young and avoid high risk assets. Save for things you need in the longer term, college / university etc. it’s easy to get caught in the crypto spin, wouldn’t like to see you get burnt. \n\nIf you have rich parents who stuff money in your ass, then that’s a different story…. 😂",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9t7peb",
                            "author": "PrimeDeep",
                            "score": 2,
                            "created_utc": 1653402833.0,
                            "response": "It’s money that I would end up spending anyways, so I’m putting it towards something better that I believe in.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9tc1g5",
                                    "author": "SoupyAT",
                                    "score": 1,
                                    "created_utc": 1653404683.0,
                                    "response": "Follow your passion then. Whatever the result, investing is important and the younger the better. Like others have said, diversify outside of crypto also",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9t4828",
                    "author": "pxww",
                    "score": 1,
                    "created_utc": 1653401299.0,
                    "response": "buys 3 hardware wallets to hold 1000$",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9t565s",
                    "author": "Vokoslav",
                    "score": 1,
                    "created_utc": 1653401730.0,
                    "response": "Since you live with your parents and don't have any expenses yet it's possible to have risky assets. That being said, I'm not sure that it's the right time to have risky assets in your portfolio at this time in general, I personally sold all crypto and might buy back in a few months if the space gets rid of most useless projects. If you are interested in the technical aspects there is a lot to get to know, bitcoin is just the beginning, there are much cooler things like zk proofs etc., just don't get lost in it and remember to live your life/have fun with friends along the way)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9t5b2b",
                    "author": "funnybitcreator",
                    "score": 1,
                    "created_utc": 1653401791.0,
                    "response": "You are going to be very successful I can already tell, keep it up",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9t5lnm",
                    "author": "Acceptable-Risks",
                    "score": 1,
                    "created_utc": 1653401922.0,
                    "response": "This kid bitcoins!!!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9t5ubk",
                    "author": "RandomsFandomsYT",
                    "score": 1,
                    "created_utc": 1653402026.0,
                    "response": "I’m also 14, but I prefer to buy 3D printers as my return on investment is much greater with those. I do mine though.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9t68td",
                    "author": "manas_lodha",
                    "score": 1,
                    "created_utc": 1653402198.0,
                    "response": "I'm 15, started a BTC mining group with me and my friends, once we are done we are splitting the earnings. I plan to just hold onto those, I'm glad to see that more people my age are looking into their future",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9t6ay8",
                    "author": "crypt0kiddie",
                    "score": 1,
                    "created_utc": 1653402223.0,
                    "response": "You're using the 25th seed word for his correct?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9t6lg9",
                            "author": "PrimeDeep",
                            "score": 1,
                            "created_utc": 1653402350.0,
                            "response": "Yep. Not using a passphrase is a bad practice of a security, I believe everybody should use one. You already keep a seed phrase safe, what’s one more thing to manage? Not to mention all the benefits to using one.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9t6tn0",
                                    "author": "crypt0kiddie",
                                    "score": 1,
                                    "created_utc": 1653402451.0,
                                    "response": "You would be shocked how many people don't know about the 25th slot.\n\nThe only place my 25th seed word phrase resides is in my head.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9t6yyj",
                                            "author": "PrimeDeep",
                                            "score": 1,
                                            "created_utc": 1653402514.0,
                                            "response": "I’d write it down if I were you, in case something happens like you hit your head and forget it. I always like to take measures to be prepared for the worst.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9t6j0g",
                    "author": "hatetheproject",
                    "score": 1,
                    "created_utc": 1653402321.0,
                    "response": "okay lol",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9t6ykd",
                    "author": "Vegetable_Ad9493",
                    "score": 1,
                    "created_utc": 1653402509.0,
                    "response": "Smart kid. The future is bleak this is one of the best things you can do for yourself at the moment.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9t785i",
                    "author": "steve700",
                    "score": 1,
                    "created_utc": 1653402624.0,
                    "response": "Don’t get arrogant.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9t80d0",
                    "author": "Aragog__",
                    "score": 1,
                    "created_utc": 1653402966.0,
                    "response": "I remember when I was 14 and also had those bizarre ideas, and a thousand more. Keep at it kid but think about the future, chances are you’ll drop this before you even turn 20.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9t8npz",
                    "author": "GorillaP1mp",
                    "score": 1,
                    "created_utc": 1653403248.0,
                    "response": "Early morning stone pimp right here.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9t8pbl",
                    "author": "Change21",
                    "score": 1,
                    "created_utc": 1653403266.0,
                    "response": "At 14 my dude ignore the ups and downs of the market. Ignore the news and the panic. Buy and buy and buy and buy and buy for the next decade or two.\n\nHave fun :)",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9txai6",
                            "author": "kaushikTD",
                            "score": 1,
                            "created_utc": 1653413431.0,
                            "response": "Man we can never even imagine ourselves talking about BTC at 14.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9tygrj",
                                    "author": "Change21",
                                    "score": 1,
                                    "created_utc": 1653413918.0,
                                    "response": "Fuck I wish lol",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9t8z1e",
                    "author": "Al_Zik1",
                    "score": 1,
                    "created_utc": 1653403380.0,
                    "response": "Well done OP.\n\n\nAll I can add to that is consistency and be patient.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9t9ehe",
                    "author": "IIIBryGuyIII",
                    "score": 1,
                    "created_utc": 1653403567.0,
                    "response": "Fuck bitches…acquire bitcoin.\n\nAcquire bitcoin….fuck bitches.\n\nAcquire whole coin….fuck the world!\n\n-somebody probably-",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9taahn",
                    "author": "CytronicsZA",
                    "score": 1,
                    "created_utc": 1653403946.0,
                    "response": "When I was 14 all I thought of was boobs and video games...",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9tac5r",
                    "author": "GodoftheGodcreators",
                    "score": 1,
                    "created_utc": 1653403966.0,
                    "response": "Is this satire? Good shitpost op! Proud of ya mastering complex topics while your peers struggle with basics at the elementary school! Remember to dca that pocket money you got from grandma",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9tamvu",
                    "author": "crinkneck",
                    "score": 1,
                    "created_utc": 1653404093.0,
                    "response": "Well done, young buck.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9tat9b",
                    "author": "Consistent-Tip9396",
                    "score": 1,
                    "created_utc": 1653404167.0,
                    "response": "Reading the bitcoin standard would probably be a good idea. It will teach you bitcoin from an economics perspective rather than purely technical.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9taujg",
                    "author": "OrangeHODLr",
                    "score": 1,
                    "created_utc": 1653404183.0,
                    "response": "Not sure if you’re interested in programming but you could read the current bitcoin source and the original satoshi white paper. Keep stacking.  The nice thing about stacking bitcoin over gold is you can protect the bitcoin with cryptography so it’s less violent.  Don’t ever let anyone know how much bitcoin you hold.  Even your parents. That’s your bitcoin and you get to decide what happens with it.  Learn to HODL, don’t trade and don’t get into defi shit coins.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9tay7l",
                    "author": "Informal_Fishing5729",
                    "score": 1,
                    "created_utc": 1653404226.0,
                    "response": "Ooo so what the future of BTC in next 5 years?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9tazei",
                    "author": "agentw22",
                    "score": 1,
                    "created_utc": 1653404240.0,
                    "response": "What or who convinced you to invest in crypto and to use hardware wallet? Based on your comments it looks like all your friends of your age are not going the same way into the future. So what happend or better what should i do to convince my nephew?\n\nP.s. thx for the detailed reply OP!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9tdmfi",
                            "author": "PrimeDeep",
                            "score": 1,
                            "created_utc": 1653405354.0,
                            "response": "I don’t really know how to convince your nephew, but I’ll provide my story, maybe it’ll help.\n\nSide note: If he already knows about bitcoin and is interested in technology, then it will be a lot easier to convince them.\n\nI started out by wanting to have bitcoin just because it was cool, I bought a little bit when I was about 12 before every exchange required KYC. I quickly spent it and was fascinated by how there was no account needed, just downloading electrum and receiving money just through a bunch of random letters that meant nothing to be at the time. I had no clue how bitcoin worked at all.\n\nFast forward a few months, I couldn’t buy bitcoin anymore, as KYC was required everywhere, and I live in the USA so it’s pretty much impossible without it. It sucked, so I dropped bitcoin for a year.\n\nThen I came back to it, with more knowledge of how it worked, and I asked my parents if they could make a coinbase account for me. They said yes, I was so thrilled. Then I sent some to electrum and I just checked it every now and then, and I think I even bought something with it (can’t remember at the top of my head)\n\nEventually I did more research into how btc worked, and I found out about public and private keys. I had no clue what they were, but after using PGP keys I realized how similar it was to bitcoin, just like signing a message with a private key, except now you’re signing money to be sent with your private key.\n\nI learned how a key is derived from the 12-24 words, and then I learned about how blocks are mined and what they actually mean.\n\nI’m still learning a lot, but my best advice to convince someone to become a bitcoiner is to give them some bitcoin to start out with, and explain to them what it is. Chances are, people are curious and will try and research it on their own, and realize the potential btc has.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9tb927",
                    "author": "gozua",
                    "score": 1,
                    "created_utc": 1653404354.0,
                    "response": "stack sats and ignore graphs. Prepare yourself to have an happy and wealthy life. Help others!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9tcrm4",
                    "author": "jay54291",
                    "score": 1,
                    "created_utc": 1653404993.0,
                    "response": "Don’t tell anyone",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9tcv51",
                    "author": "Yesitisiwhodealtit",
                    "score": 1,
                    "created_utc": 1653405033.0,
                    "response": "That’s cool OP but your better off keeping this on the DL. You’re just inviting scammers into your life with posts like these.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9td6na",
                    "author": "Liquids0ul",
                    "score": 1,
                    "created_utc": 1653405167.0,
                    "response": "You’re doing just great man, keep it up, and HODL 💪",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9tegwg",
                    "author": "Technical_Emu_8567",
                    "score": 1,
                    "created_utc": 1653405705.0,
                    "response": "Never ask a a barber if you need a haircut, cause the answer will always be \"yes.\"\n\nInstead of asking the bitcoin sub, you should probably seek out the most hyperbolic critic of bitcoin and assess his/her argument as to why you *shouldn't* stack bitcoin. Otherwise you're exposing yourself to the effects of the echo chamber.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9tenil",
                            "author": "PrimeDeep",
                            "score": 1,
                            "created_utc": 1653405781.0,
                            "response": "True, I was just asking for general opinions, i didn’t expect this to get so many comments.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9tg801",
                    "author": "Bitcoin__Hodler",
                    "score": 1,
                    "created_utc": 1653406442.0,
                    "response": "Is this you OP ?\n\nhttps://twitter.com/lopp/status/1529069264866578432",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9tgass",
                            "author": "PrimeDeep",
                            "score": 1,
                            "created_utc": 1653406475.0,
                            "response": "Thankfully, no.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9tg9j8",
                    "author": "SgtDickTieso",
                    "score": 1,
                    "created_utc": 1653406461.0,
                    "response": "Very wise for your age. Don't listen to the noise and keep educating yourself just like you did and you'll devour the world.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9tgouc",
                    "author": "knowledgelover94",
                    "score": 1,
                    "created_utc": 1653406635.0,
                    "response": "Have you stayed out of altcoin/shitcoin buying? If you’ve stayed out of that at 14, then I’m impressed.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9th3qm",
                            "author": "PrimeDeep",
                            "score": 2,
                            "created_utc": 1653406809.0,
                            "response": "Yep, I did once with such a small amount but I realized how stupid it was and sold it and put it back in btc.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9tkr60",
                                    "author": "knowledgelover94",
                                    "score": 1,
                                    "created_utc": 1653408313.0,
                                    "response": "Nice! I’m still learning that lesson and making that transition myself. Keep it up!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9tgu88",
                    "author": "Jigglepuff07991",
                    "score": 1,
                    "created_utc": 1653406699.0,
                    "response": "Posts like this put a genuine smile on my face",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9th85x",
                    "author": "Slowpez10",
                    "score": 1,
                    "created_utc": 1653406859.0,
                    "response": "Good start, its a good high risk play. But also diversify to minimize your risk and set up 401k, or roth IRA. S&P index funds are a slow and steady climb to achieving sustainable and comfortable retirement.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9thhh7",
                    "author": "VPNApe",
                    "score": 1,
                    "created_utc": 1653406967.0,
                    "response": "I'm jealous. If I was 14 again I'd learn how to code and basically have a garunteed 200k+ salary by my late twenties.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9thk2h",
                            "author": "PrimeDeep",
                            "score": 1,
                            "created_utc": 1653406998.0,
                            "response": "I should probably learn how to code then",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9tk36t",
                                    "author": "VPNApe",
                                    "score": 1,
                                    "created_utc": 1653408041.0,
                                    "response": "If it's your thing then go for it man. If you start young you can be as competent as a college graduate in your teens.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9thjkl",
                    "author": "FlaminMoe717",
                    "score": 1,
                    "created_utc": 1653406992.0,
                    "response": "You probably understand in depth the mechanics behind Bitcoin mining and the technology that underpins it. But try and educate yourself on the history of money and what gives commodities intrinsic value. You’ll notice that fiat currency’s such as the dollar are dying day by day as their purchasing/power is eroded by government money printing. However, try to ask yourself, what can I physically buy and hold that is my best protection against inflation?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9thqvc",
                            "author": "PrimeDeep",
                            "score": 1,
                            "created_utc": 1653407076.0,
                            "response": "A good example of inflation is a hardware wallet going up $100 in price from since I bought it.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9thxvp",
                    "author": "scoobsquad43",
                    "score": 1,
                    "created_utc": 1653407157.0,
                    "response": "I’m inspired to learn more about crypto once again. Thank you random human, may the your future be prosperous.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9tig2r",
                            "author": "PrimeDeep",
                            "score": 1,
                            "created_utc": 1653407368.0,
                            "response": "You too.\nYou should try to learn about BTC and avoid getting into altcoins. Altcoins have a tendency to crash and then put a bad name on all of crypto. Worst case scenario you just don’t decide to buy. It’s worth taking a look into it though.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9ti0xt",
                    "author": "hateschoolfml",
                    "score": 1,
                    "created_utc": 1653407193.0,
                    "response": "Damn, wouldn’t be surprised if you had financial freedom by 21",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ti5p3",
                    "author": "Leggy77",
                    "score": 1,
                    "created_utc": 1653407249.0,
                    "response": "Now learn how to use lightning.\n!LNTIP 500",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ti6o6",
                            "author": "lntipbot",
                            "score": 1,
                            "created_utc": 1653407260.0,
                            "response": "Hi u/Leggy77, thanks for tipping u/PrimeDeep **500** satoshis!\n***\n*[^(More info)](https://xnf5cwpq73.execute-api.us-west-2.amazonaws.com/prod/info) ^| [^(Balance)](https://www.reddit.com/message/compose/?to=lntipbot&subject=balance&message=!balance) ^| [^(Deposit)](https://www.reddit.com/message/compose/?to=lntipbot&subject=deposit&message=!deposit 10000) ^| [^(Withdraw)](https://www.reddit.com/message/compose/?to=lntipbot&subject=withdraw&message=!withdraw put_invoice_here) ^| ^(Something wrong?  Have a question?) [^(Send me a message)](https://www.reddit.com/message/compose/?to=drmoore718)*",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9tiwun",
                            "author": "PrimeDeep",
                            "score": 1,
                            "created_utc": 1653407560.0,
                            "response": "Thanks man! I really appreciate it!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9u1nsv",
                                    "author": "devaffair",
                                    "score": 1,
                                    "created_utc": 1653415231.0,
                                    "response": "Good luck for the future and keep holding your investments.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9tir7l",
                    "author": "apoletta",
                    "score": 1,
                    "created_utc": 1653407495.0,
                    "response": "I will encourage my kids to save 1/4 any cash they have in BTC and the other 1/4 into dividend stocks in a tax sheltered account. The dividend account would need to be reinvested and never used at all. They other 1/2 they can use. \n\nThen save some of the other cash in the bank for big dips or larger expenses. \n\nThe BTC should be held 20 years +.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9tj0k5",
                    "author": "BigPlayCrypto",
                    "score": 1,
                    "created_utc": 1653407601.0,
                    "response": "Stack em 🆙",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9tjc7g",
                    "author": "8yr0n",
                    "score": 1,
                    "created_utc": 1653407732.0,
                    "response": "When you win…don’t talk about it. This goes for bitcoin and everything else in life. \n\nAt best it makes people that aren’t as successful jealous…\n\nAt worst it makes you a target for all sorts of bad stuff (extortion, lawsuits, kidnappings, etc.)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9tjdq5",
                    "author": "FeelTheFish",
                    "score": 1,
                    "created_utc": 1653407750.0,
                    "response": "Started like that at age 13 and best dumb/geeky decision I've made.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9tjis3",
                    "author": "soggypoopsock",
                    "score": 1,
                    "created_utc": 1653407808.0,
                    "response": "dude, this is awesome. Just take it slow enough that you aren’t constantly thinking about it, and make sure you stay consistent. $10 a month with long term consistency is better than dumping in $100, getting discouraged, and falling off the horse. \n\nThis is the bane of most btc buyers: they put a sizable chunk in during a bull run and then get super discouraged when the price pulled back. Then realize 5 years later “if only I had paced myself and stuck to a consistent DCA strategy I’d be rich”",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9tjl3y",
                    "author": "iterates_",
                    "score": 1,
                    "created_utc": 1653407836.0,
                    "response": "Piece of advice....never give financial advice to friends or family members.....the upside is small while the downside is big....just saying you may want to skip talking about any crypto or financial related stuff to any of your friends and family members.....it could easily come back to haunt you and ruin your friendships....money has a way of doing that....\n\nBest of luck to you!!!!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9tkndf",
                    "author": "SkaTSee",
                    "score": 1,
                    "created_utc": 1653408270.0,
                    "response": "The younger you are, the greater risks you're able to take, because on paper you should have more time to recover if things go bad.  That said, BTC probably isn't bad, but is it the best?  I realize what sub I'm on, and have no qualms with bitcoin, I was early in and early out.  I certainly feel there is still a future in bitcoin, and probably not a bad route, but I wouldnt stop there if I were you",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9tkrq3",
                    "author": "thecoat9",
                    "score": 1,
                    "created_utc": 1653408319.0,
                    "response": "You are on a bitcoin forum, of course the answer is going to be yes, it's a fantastic idea.  That being said, likely one of two things will happen.  Bitcoin will \"fail\" and you won't get much out of it, but you are young and getting started at a good age, losing some money and effort at your age isn't going to be the end of the world.  Alternatively Bitcoin will succeed and who knows how that will pan out for you, part of it may be how long you manage to hold onto it.  It will be tempting if it will pay for college, your first car, your first house, alternatively it could mean early retirement.    \n\n\nYou've taken your first step, now consider how tempting it might be if in a few years your holdings are enough to buy yourself a new car at 16, pay for college after graduation, or later buy your first house.  How long are you going to hold it for?  If you don't make a plan now, you'll likely just buy a really nice vehicle at 16 and later look back wondering why you wasted your stash on such a thing as it would have let you retire early.    Were I you I'd suggest you formulate some plan that allows you to reap some benefit along the way, maybe you don't buy a new 70k muscle car at 16 and just spend a portion on a more sensible vehicle. Maybe you see college as a worthy investment and are willing to spend 75% of your stash toward it.  Plan now, because the day you realize \"I could use all of my stash for X\" it's going to be very tempting.  The longer you hold it the bigger the payout is likely to be.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9tl9v8",
                    "author": "SendMeDistractions",
                    "score": 1,
                    "created_utc": 1653408527.0,
                    "response": "Ignore all the private messages you receive after posting this, you will likely be targeted by scammers when you announce something like that publicly. \n\nAs others have said, as a general rule, it's a good idea to keep your finances to yourself. There's a lot of people out there willing to do anything to get their hands on your money. \n\nBest of luck to you kid, stack em high! I was in a similar situation to you 8-9 years ago and it paid off extremely well for me!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9tm5hb",
                    "author": "Xx------aeon------xX",
                    "score": 1,
                    "created_utc": 1653408892.0,
                    "response": "Stack total market funds instead",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9tmdsm",
                    "author": "NewMathematician92",
                    "score": 1,
                    "created_utc": 1653408986.0,
                    "response": "Dude you are 14 go for it! It's a time to try new things, learn, and break the mold. Many adults will tell you what to do or not to do, our brains are rigid and stubborn. So if you get into a topic like Bitcoin and are interested just get in there, get your hands dirty, explore, read, interact, buy, hold. Got nothing to lose.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9tmfjp",
                    "author": "Mektzer",
                    "score": 1,
                    "created_utc": 1653409007.0,
                    "response": "Dayum son! So happy and proud of you! Always keep learning and stay humble.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9tmhhn",
                    "author": "TiagoTiagoT",
                    "score": 1,
                    "created_utc": 1653409028.0,
                    "response": "[This](https://whitepaper.coinspice.io/) might provide a good relatively easy to understand introduction to the main ideas",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9tn9fp",
                    "author": "ReasonableTman",
                    "score": 1,
                    "created_utc": 1653409340.0,
                    "response": "Selected to survive",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9tnjco",
                    "author": "covfefeer",
                    "score": 1,
                    "created_utc": 1653409451.0,
                    "response": "You are way ahead of most people. Bitcoin is a long term play. There is a lot of noise in the media and from others. Figure out how to filter the noise and trust in yourself. There is a lot to learn in this space and it seems like you are on the right track.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9to0zv",
                    "author": "RALat7",
                    "score": 1,
                    "created_utc": 1653409650.0,
                    "response": "Diversify.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9tonqr",
                    "author": "FamousM1",
                    "score": 1,
                    "created_utc": 1653409903.0,
                    "response": "Have you tried to use BTC yet in transactions?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9tp9md",
                    "author": "jxsl13",
                    "score": 1,
                    "created_utc": 1653410148.0,
                    "response": "Bitcoin does not implement staking, as far as I know. And trusting crypto exchanges that offer \"staking\", meh.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9tpulv",
                    "author": "beanioz",
                    "score": 1,
                    "created_utc": 1653410384.0,
                    "response": "When I was around 14/15, I first found out about this new thing called Bitcoin which allowed you to buy weed from Silk Road to your door. I didn’t take any notice of the guy that told me in a Teamspeak server while we were playing a competitive match of Counter Strike. \n\nThis was around 2010. You’re way ahead of me little dude. \n\nI’d advice that you thoroughly research investing, trading and how markets work. Understanding how Bitcoin works is just one part of the puzzle.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9tqb9j",
                    "author": "norsvast",
                    "score": 1,
                    "created_utc": 1653410573.0,
                    "response": "At 14 understanding that you should buy bitcoin only, storing it in your own wallet and having a low time preference. You got it all right kid, you are lucky.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9tqo9r",
                    "author": "OneMileAway1",
                    "score": 1,
                    "created_utc": 1653410718.0,
                    "response": "Shit if I was that smart at 14 I’d be a billionaire now.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9tr63g",
                    "author": "turbulance4",
                    "score": 1,
                    "created_utc": 1653410920.0,
                    "response": ">I also have 3 hardware wallets, two ledgers (S plus and X) and a Trezor model T.\n\nAny notes on the differences? Which do you like best?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9trfcv",
                    "author": "Scrapin-Nee",
                    "score": 1,
                    "created_utc": 1653411025.0,
                    "response": "This may come as a shocker in a Bitcoin forum, but I’m gonna tell you to ignore all other assets and especially any other cryptos and just DCA Bitcoin. If you want an explanation why there is a recent episode titled “ The cascading of interconnected risk” on Bitcoin Audible that sums it up nicely. Most don’t have a clue what’s happening in the economy right now.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9trkxm",
                    "author": "masonthedood42",
                    "score": 1,
                    "created_utc": 1653411089.0,
                    "response": "Read the Bitcoin Standard for starters. Just keep DCA in as you go. Listen to the Orange Pill podcast with Max Keiser.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ts761",
                    "author": "Markenbier",
                    "score": 1,
                    "created_utc": 1653411344.0,
                    "response": "This is great! Keep it going! \nI learned coding at 15 and it still helps me a lot, I am sure learning about BTC and trading at this age will help you out immensely in the long run.\n\nBesides that, it's not necessarily about the topic itself. Learning something of this complexity at this age all on your own will really train your learning capabilities which will be a big help for your future career!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ts7at",
                    "author": "oopsbilldoggett",
                    "score": 1,
                    "created_utc": 1653411346.0,
                    "response": "DIVERSIFY!!!\n\nYou're on a Bitcoin sub, which probably means we all like Bitcoin, but any asset can rise and fall, be affected by regulation, fall out of favor, etc.\n\nDon't expect all your bets to work out. Just make allt of broad bets. That's why you diversify-- because you know you'll be wrong many times but you don't need to be right all the time if you're right many times.\n\nBTC is great, and in twenty years you may laugh that you'd be 10x richer if you put it all on a single asset, but if you're wrong, you'll regret not spreading out.\n\nIf you start when you're 14, you'll have lots of wins and losses by the time you're 20, and if you diversify, your losses will likely be overshadowed greatly by your wins.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9tsxj7",
                    "author": "justmytwocentss",
                    "score": 1,
                    "created_utc": 1653411642.0,
                    "response": "Stack those coins",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9tt29r",
                    "author": "keep_Playing",
                    "score": 1,
                    "created_utc": 1653411694.0,
                    "response": "You're off to a good start. Way to go.  Being your own bank is difficult for anyone of any age. Comes with increased freedom but also responsibility.  Lots good resources out there.  One you might check out is Casa.  \n\nOn the Casa website, they offer a “Wealth Security Protocol,” consisting of up to 40 pages of in-depth explanations covering how they architected their product using multisig protocols, multiple manufacturers, hardware devices for keys and figuring out how to distribute keys geographically. \n\nMaybe overkill for you right now. But never too early to begin thinking about how to secure your Bitcoin from left, loss, or uhh... boating accidents.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9tt9h4",
                    "author": "tisuy",
                    "score": 1,
                    "created_utc": 1653411775.0,
                    "response": "how much things are changing. At the age of 14, I didn't even think about stacking for the future. you're doing great.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9tumio",
                    "author": "buttsnorkeler",
                    "score": 1,
                    "created_utc": 1653412334.0,
                    "response": "👍🏻",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9tvg0e",
                    "author": "BrownSugar_Ad",
                    "score": 1,
                    "created_utc": 1653412673.0,
                    "response": "When I was 14 I was protesting risking my life instead of chilling at home learning about BTC ahh liferee",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9tvkps",
                    "author": "Cronenburg_jerry",
                    "score": 1,
                    "created_utc": 1653412728.0,
                    "response": "No one gives a shit how old you are",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ty9iq",
                    "author": "SnackFactory",
                    "score": 1,
                    "created_utc": 1653413834.0,
                    "response": "Consolidate your UTXOs! It'll save you transaction fees",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9tzyzq",
                    "author": "FreezaSama",
                    "score": 1,
                    "created_utc": 1653414539.0,
                    "response": "good for yoh but saying \"complete understand\" shows you might are a bit immature/over confident. just be careful with that. I have 2 super confident friends that got wrecked.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9u00dc",
                    "author": "Enki906",
                    "score": 1,
                    "created_utc": 1653414555.0,
                    "response": "Well done for considering your future at 14! There are so many things to consider when saving. What are your goals? What are the risks? How much liquidity do you need in your funds? Also, as you are posting on a Bitcoin forum, do consider that there will be some bias in responses. Try posting in financial forums too!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9u14j7",
                    "author": "fawnside",
                    "score": 1,
                    "created_utc": 1653415013.0,
                    "response": "Go ask the same question on /r/buttcoin\n14 is a great time to to start with your critical thinking skills…",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9susif",
                    "author": "Mallardshead",
                    "score": 0,
                    "created_utc": 1653396678.0,
                    "response": "Are those wallets \"clones\"? meaning do you run the same seed on them or is it a multisig setup? If it's a single seed, then I'd suggest memorizing it as well. It's a once in a lifetime requirement and the coldest act of self-sovereignty there is. Tattoo for the brain. Then if the unthinkable happens (you get the hard wallets stolen and your written backups are taken in a flood, etc) you still have access.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9sy6ax",
                    "author": "shawnewoods",
                    "score": 0,
                    "created_utc": 1653398426.0,
                    "response": "DCA and hodl",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9t30xp",
                    "author": "critical-thoughts",
                    "score": 0,
                    "created_utc": 1653400751.0,
                    "response": "All it takes is for ONE rich bitcoin holder to sell everything to buy a boat and boom, you've got nothing.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uwpclt",
            "title": "If bitcoin is going sideways for the next 2 years, do yourself a favor and take the time to learn about Austrian economics, Libertarianism, free markets, and the broken fiat system with these books",
            "url": "https://www.bitrawr.com/bitcoin/top-10-books-to-learn-about-bitcoin",
            "author": "AlonShvarts",
            "created_utc": 1653394210.0,
            "score": 229,
            "num_comments": 87,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9sxenw",
                    "author": "DadofHome",
                    "score": 24,
                    "created_utc": 1653398041.0,
                    "response": "Also know it’s meant to go sideways while the IMF and others plan for CBDC control.  Don’t let them push us into a corner.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9tivei",
                            "author": "fellowpleb",
                            "score": 6,
                            "created_utc": 1653407543.0,
                            "response": "The battle between Bitcoin and CBDC's is the battle for the freedom of individuals for the next 1,000 years. We *cannot* allow the State to institute CBDC's, and our best weapon is Bitcoin education. It's not out of some selfish desire to see the price raise, so you encourage others to buy Bitcoin... It's about educating others so as to make the population resistant to tyranny.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9ufov1",
                                    "author": "Pochusaurus",
                                    "score": 4,
                                    "created_utc": 1653421135.0,
                                    "response": "I just wish I can live long enough to it happen",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9suw2t",
                    "author": "Gorillasinthefist",
                    "score": 37,
                    "created_utc": 1653396731.0,
                    "response": "Also need to read “the price of tomorrow “",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9t6ccv",
                            "author": "bstardif",
                            "score": 7,
                            "created_utc": 1653402240.0,
                            "response": "I'm about an hour into that one, really good!",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9u072w",
                            "author": "c_games_official",
                            "score": 2,
                            "created_utc": 1653414631.0,
                            "response": "Reading this now, it does a good job putting into words what I've been thinking for a long time",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9un3tk",
                            "author": "knuF",
                            "score": 1,
                            "created_utc": 1653424252.0,
                            "response": "Modern classic.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9su52v",
                    "author": "coinfeeds-bot",
                    "score": 6,
                    "created_utc": 1653396327.0,
                    "response": "tldr; Bitcoin is everywhere. If you don't understand Bitcoin and find the concept of decentralized digital currencies...weird, no problem. I highly encourage everyone to read a book about it. Spending 10 to 15 hours trying to understand the technology and underlying purpose is time well spent in my opinion.\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9tg3yc",
                    "author": "Ima_Wreckyou",
                    "score": 4,
                    "created_utc": 1653406395.0,
                    "response": "I'm trying to do that since I started to fall down the rabbit hole. Austrian economics I have a really hard time, because I just find economics mostly a boring topic. Libertarianism I'm completely on the fence. It makes sense to me as an ideal, but not as catch all solution of how a society can actually work. But I may be wrong, so I'm continuing to listen to those people.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9tttro",
                            "author": "privacyguyincognito",
                            "score": 7,
                            "created_utc": 1653412006.0,
                            "response": "Libertarianism is just survival of the fittest. Only rich people or fools would want to live in such a society.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9ujstj",
                                    "author": "EspHack",
                                    "score": 1,
                                    "created_utc": 1653422855.0,
                                    "response": "btc standard means just that, total economic darwinism",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9tayrb",
                    "author": "DesignerAccount",
                    "score": 40,
                    "created_utc": 1653404232.0,
                    "response": "Please stop bunching together libertarianism/free markets with Bitcoin. There's quite a few openly declared socialists amongst bitcoiners and/or \"statists\", both terrible sins in the minds of libertarians. \n\nTo appreciate bitcoin all you need is to want to retain the money you earned, period. If you are OK with inflation chipping away at your savings, then Bitcoin is not for you. Otherwise stack sats. Libertarianism or being enamored with free markets is absolutely not necessary. Stop putting the two together. Same goes for Austrian economics.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9tfgca",
                            "author": "tastetherainbow_",
                            "score": 12,
                            "created_utc": 1653406117.0,
                            "response": "Bitcoin is for everyone, even socialists and statists. Redistributing wealth can happen without printing money.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9ttxc7",
                            "author": "swfsql",
                            "score": -2,
                            "created_utc": 1653412046.0,
                            "response": "> ..all you need is to want to retain the money you earned..  \n> ..being enamored with free markets..\n\n<they are the same picture",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9tw4b1",
                                    "author": "DesignerAccount",
                                    "score": 2,
                                    "created_utc": 1653412949.0,
                                    "response": "No, donkey. We're talking about inflation, not taxes here. Learn the difference.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9u1mvt",
                                            "author": "swfsql",
                                            "score": 1,
                                            "created_utc": 1653415221.0,
                                            "response": "> ..inflation..  \n> ..taxes..\n\n<they are the same picture",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9udx61",
                                                    "author": "DesignerAccount",
                                                    "score": 1,
                                                    "created_utc": 1653420389.0,
                                                    "response": "No. Inflation happens even in Europe where the single governments don't control money issuance, and there's no tax like federal tax in the US. \n\nInflation was also happening historically when bankers were issuing notes without anything to do with the government.\n\nThis is the problem with libertarians like you, obtusely uneducated, grasping for straws.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9ufp30",
                                                            "author": "Mangalz",
                                                            "score": -2,
                                                            "created_utc": 1653421138.0,
                                                            "response": ">DesignerAccount\n\n\n>obtusely uneducated, grasping for straws.\n\n<they are the same picture.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9ukhiy",
                                                                    "author": "DesignerAccount",
                                                                    "score": 1,
                                                                    "created_utc": 1653423148.0,
                                                                    "response": "As they say, the mother of idiots is always pregnant. Guess she just popped another one, eh?",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9ufe8u",
                            "author": "Mangalz",
                            "score": -1,
                            "created_utc": 1653421010.0,
                            "response": ">Please stop bunching together libertarianism/free markets with Bitcoin. There's quite a few openly declared socialists amongst bitcoiners and/or \"statists\", both terrible sins in the minds of libertarians. \n\nThose dumb fucks need to learn the most of all.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9ump0n",
                                    "author": "DanknugzBlazeit420",
                                    "score": 1,
                                    "created_utc": 1653424080.0,
                                    "response": "Imagine labeling yourself a libertarian unironically.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9ukp59",
                                    "author": "DesignerAccount",
                                    "score": 1,
                                    "created_utc": 1653423238.0,
                                    "response": "Shut up, dumb fuck.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9ume8h",
                                            "author": "Mangalz",
                                            "score": 1,
                                            "created_utc": 1653423953.0,
                                            "response": "Owned",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9uocr8",
                            "author": "Xaqaree",
                            "score": 1,
                            "created_utc": 1653424778.0,
                            "response": "Without state control of money the monstrosity of socialism is simply not possible.  \n\nBitcoin cures socialism",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9t4f97",
                    "author": "Nissimsicari",
                    "score": 15,
                    "created_utc": 1653401391.0,
                    "response": "Just want to say that I’m a leftist and anarchist and I came to the same conclusion ab bitcoin independently",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9tnigm",
                            "author": "Mooscowsky",
                            "score": 6,
                            "created_utc": 1653409442.0,
                            "response": "As someone who's on the opposite spectrum - Anarcho Capitalist, I find it quite enchanting that our sides both can agree on BTC.\n\nBTC fixes the world division.\n\nEdit: Grammar",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9ts8ej",
                                    "author": "PerformanceVarious45",
                                    "score": -8,
                                    "created_utc": 1653411358.0,
                                    "response": "Anarcho capitalism is leftist. You guys realize anything dealing in ethics and natural law is classical liberalism? Anarchism is Anarchism. No need to differentiate it.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9u1va6",
                                            "author": "DiamondDallasHands",
                                            "score": 6,
                                            "created_utc": 1653415315.0,
                                            "response": "> Anarcho capitalism is leftist\n\nLiterally not in the slightest. It is 1000% not a leftist ideology lol.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9u9loq",
                                                    "author": "PerformanceVarious45",
                                                    "score": 1,
                                                    "created_utc": 1653418569.0,
                                                    "response": "You should read john locke and Adam smith and tell me if you still believe that. Classical liberalism  litterally defined freedom for over 500 years. Recent definitions have only changed in the last 30-40 years. Even if you say the word liberal these days it is baseless with no real definition.  Liberalism has always been defined by ethics and the rule of law. (Law in a philosophical sense and natural law being a component of anarchy btw, in contrast to man's law, or legislation)",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9uccuh",
                                                            "author": "LvL98MissingNo",
                                                            "score": 1,
                                                            "created_utc": 1653419736.0,
                                                            "response": "The most reductionary difference between the left and right is support for change on the left and status quo on the right. As those on the left are successful at implementing policy, the status quo changes and ultimately those who previously found themselves on the left, find themselves defending the policies they successfully implemented and the new status quo in turn, which results in them ideologically shifting to the right. [This ](https://youtu.be/FYbtHGt2Zco) video describes that effect if you're interested. \n\nFor this reason, what the left and right were 500 years ago is not as relavent today because the left-right line has been redrawn countless times since then.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9uheb7",
                                                                    "author": "PerformanceVarious45",
                                                                    "score": 1,
                                                                    "created_utc": 1653421847.0,
                                                                    "response": "I'm speaking in a philosophical sense, not a political sense. I understand that video and it is mostly confusing to the ideology of freedom. Defining anarchy or liberty being left or right is a disservice in understanding its entire works. Classical liberalism is the belief in natural law, which is anarchy, or call it freedom if you will. You can't take the entire body of liberal works and turn it into what you will just because it makes more sense in a left vs right mantra.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9u2x7d",
                                            "author": "BuyRackTurk",
                                            "score": 1,
                                            "created_utc": 1653415757.0,
                                            "response": "> Anarcho capitalism is leftist. \n\nMaybe 100 to 150 years ago when \"right wing\" meant \"pro monarchist\", classic liberals were lumped in with the \"left\"\n\nThere was a transition where \"left wing\" stopped meaning \"anarchist/individualist\" and starting meaning \"collectivist/socialist\", in the later 1800s to early 1900s.\n\nSo, like it or not, anarchists are lumped in with the \"right wing\" these days, fwiw. \n\nI guess people like dumping everything into a right/left dichotomy.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9u9u76",
                                                    "author": "PerformanceVarious45",
                                                    "score": 1,
                                                    "created_utc": 1653418669.0,
                                                    "response": "More recent than that. Mostly since the 80s. Classical liberalism defined freedom and liberty since the 1500s. John Locke made it popular first. Before that those ideas were only discussed by Moses and Plato.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9szo11",
                    "author": "Wolfos9",
                    "score": 12,
                    "created_utc": 1653399152.0,
                    "response": "Half way through the Bitcoin standard right now... I'll add those to the list.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9tbwv0",
                            "author": "Beitelensteijn",
                            "score": 12,
                            "created_utc": 1653404630.0,
                            "response": "The first half I found a bit to lengthy. He just kept going on and on how everything good was due to the gold standard and everything bad is because of stopping the gold standard. Even modern art and music is worse than classical art and music supposedly because of this. And Keynes was a pedo apparently. \n\nJust made me take everything else with a bit more grain of salt. The second half of the book is actually on Bitcoin and I really liked that.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9tdz4j",
                                    "author": "Wolfos9",
                                    "score": 5,
                                    "created_utc": 1653405502.0,
                                    "response": "Ahh funny you say that because the reviews shed the first half in a positive light do to his facts and research but then say he sounds like he's just shilling bitcoin in the second half with less hard referenced facts.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9tk0oo",
                                            "author": "fellowpleb",
                                            "score": 3,
                                            "created_utc": 1653408013.0,
                                            "response": "I feel exactly the same as the guy above you does about it. I think modern art is more of a reaction to realism being pointless because we have photography now. There's no point in being a fantastically masterful landscape or portrait painter because we have cameras... Additionally, the point doesn't even hold up, because we have a veritable explosion of some of the best artists our civilization has ever seen, right now. So much so that these gifted artists are practically unknown. So much so that you and I take it for granted. There are stunning works of art not just an par with the \"old master's\" of the Renaissance, but literally *surpassing* them. Add onto that the collaborative art we see in movie production and other media and it's just night and day that Saifedean is just downright wrong on that point, and he comes across as extremely egotistical in doing so.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9um9bp",
                                                    "author": "Dont_Say_No_to_Panda",
                                                    "score": 1,
                                                    "created_utc": 1653423897.0,
                                                    "response": "I also agree 100% with your comment and the OP re: the first half of the Bitcoin Standard vs the 2nd. \n\nThe text is dripping with Saifedean’s personal ideology and I consider much of it irrelevant to the overall point he was making. The segments about modern art were perhaps where the connection was most contrived. \n\nEspecially when you consider the 2013 film “Tim’s Vermeer” where the subject demonstrated with technology theoretically available to artists in the 17th century you could replicate these results of the “classical” artists.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i9trdxt",
                                                    "author": "fifaloko",
                                                    "score": 1,
                                                    "created_utc": 1653411009.0,
                                                    "response": "Not related to the book, but my personal perspective is that the arts ie art and music peaked with the internet back in the early 1990’s.  It seems like people were still being creative from their own point of view then and sharing, but that has morphed overtime and has been has corporatized  to have the widest appeal to the masses",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9ts1km",
                                                            "author": "SannySen",
                                                            "score": 1,
                                                            "created_utc": 1653411279.0,
                                                            "response": "I feel the same way, but everyone has felt the same way going all the way back to cavemen banging on rocks.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9umvtz",
                                    "author": "irgeorge",
                                    "score": 1,
                                    "created_utc": 1653424159.0,
                                    "response": "Yeah those ideas are just completely unreconstructed from: https://en.m.wikipedia.org/wiki/Degenerate_art\n\nThe book is absolute trash and whenever I see someone say it blew their mind, I just see another person who has zero liberal arts education or knowledge of political history — so completely unfamiliar with the ideas he’s reheating.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9szqx2",
                    "author": "X-Files22",
                    "score": 9,
                    "created_utc": 1653399192.0,
                    "response": "Read about Marxism too.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9txm5e",
                            "author": "verbesserung",
                            "score": 6,
                            "created_utc": 1653413565.0,
                            "response": "Read the Gulag Archipelago",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9tns6r",
                            "author": "AngryZoomer",
                            "score": 6,
                            "created_utc": 1653409550.0,
                            "response": "And how to avoid it",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9togfi",
                                    "author": "X-Files22",
                                    "score": 2,
                                    "created_utc": 1653409822.0,
                                    "response": "Exactly",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9tcpcs",
                    "author": "joecool42069",
                    "score": 8,
                    "created_utc": 1653404965.0,
                    "response": "Or skip the libertarianism.  Libertarian society is as big of a pipe dream as pure socialism.  No functional society can be built around libertarianism.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9th9zi",
                            "author": "BigBadAl",
                            "score": 3,
                            "created_utc": 1653406881.0,
                            "response": "Agreed. [It's been tried and it failed spectacularly](https://www.vox.com/policy-and-politics/21534416/free-state-project-new-hampshire-libertarians-matthew-hongoltz-hetling).\n\nStrangely enough society is the way it is because it works for most people. Otherwise it wouldn't exist.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9tj48f",
                                    "author": "joecool42069",
                                    "score": 8,
                                    "created_utc": 1653407642.0,
                                    "response": "It’s an adolescent world view imho.  Sounds great on the surface level, everyone takes care of themselves.  Sure.. ok.   But roads need to get built, fires need to be put out, businesses need to be kept in line or they have free range to poison the environment, builders need codes to build by or we have proven they cut corners and people die, etc…\n\nWe live in a society, we have to have ideologies that support the society in mass, BUT also protect individual freedoms, Imho.  Or else what are we doing here.  Just go live in the woods if you don’t want to be part of society.\n\nIf we all lived independently with no interdependencies, sure.. libertarianism.  But that is not the reality we live in.\n\nBitcoin != libertarian",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9tjfsn",
                                    "author": "GodLibertyGunsGold",
                                    "score": -6,
                                    "created_utc": 1653407774.0,
                                    "response": "Early America was pretty libertarian. I would say that went pretty well.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9tp9ew",
                                            "author": "metamaoz",
                                            "score": 2,
                                            "created_utc": 1653410146.0,
                                            "response": "There was gun control in the wild west",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i9tlb60",
                                            "author": "BigBadAl",
                                            "score": 0,
                                            "created_utc": 1653408542.0,
                                            "response": "But it wasn't. Everywhere people went they formed towns. Once those towns were founded then they started to have mayors, sheriffs, shopkeepers, etc. They had rules and regulations, and people contributed money to make these things work.\n\nI'd also say America didn't turn out very well. [53 people are killed every day by guns](https://www.bbc.co.uk/news/world-us-canada-41488081), add that to the [even larger amount of Americans who die every year due to the cost of healthcare](https://www.theguardian.com/us-news/2020/jan/07/americans-healthcare-medical-costs) and the USA is comfortably top of preventable deaths. And the cause of these is the unwillingness of Americans to legislate for guns to be controlled or for healthcare to be state funded or at least cost capped. Only Americans think America turned out well.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9ufazy",
                                                    "author": "GodLibertyGunsGold",
                                                    "score": 0,
                                                    "created_utc": 1653420972.0,
                                                    "response": "I'm not claiming it was an anarcho capitalist utopia but the limited government led to enormous economic growth, immigration, and innovation in a relatively short period of time. It wasn't perfect and still isn't but it is still a place that people come to from all over the world for a better life.\n\nIf you prefer government intervention, why not stick to fiat or CBDC? Government can do it better right?",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9u8bpq",
                                            "author": "Altruistic_Spite9188",
                                            "score": 1,
                                            "created_utc": 1653418033.0,
                                            "response": "I wouldn't call slavery and patent medicine \"pretty well\"",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9umdbp",
                                                    "author": "GodLibertyGunsGold",
                                                    "score": 1,
                                                    "created_utc": 1653423943.0,
                                                    "response": "Slavery was obviously terrible. I was referring to how the limited government led to significant economic growth, innovation, and opportunity.\n\nIDK exactly what you mean by patent medicine or if that existed in early America. If you're referring to the high cost of modern pharmaceuticals in America, that's largely due to government regulations that forbid us from importing medicine. A lot of drugs are developed here (with the help of taxpayer money), sold cheaper internationally, and sold for more here bc they can and don't have to compete with their own international prices. The USA basically subsidizes drugs for the rest of the world. Medicine in America is far from a free market, if that's what you're getting after. I would also argue that patents are a somewhat debated topic in libertarianism.\n\nEdit: formatting",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9um33d",
                                            "author": "DesignerAccount",
                                            "score": 1,
                                            "created_utc": 1653423825.0,
                                            "response": "I think this is a great point you make. Not being sarcastic.\n\nSo what's the problem? Look at the **evolution**! What started as pretty libertarian became a pretty old-fashioned state. (Oh, and don't forget the massively different scales involved, that is the population differences. What works for a small group will not work for a large one.)\n\nPoint being, have libertarianism today and, given the pace of change today, get a state in ~20yrs? If that.\n\nPut differently, libertarianism is unstable, it will inevitably fall into something else.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9unkld",
                                                    "author": "GodLibertyGunsGold",
                                                    "score": 1,
                                                    "created_utc": 1653424448.0,
                                                    "response": "Thanks for your thoughtful input.\n\nI think you also make a good point. Will all governments regardless of size or intent end in socialism or perhaps even more extreme communism or totalitarianism?\n\nInterestingly enough, this is an argument that a lot of anarcho capitalists make. Basically that the state should never exist in the first place bc it always ends the same (totalitarianism). I'm not saying I totally agree but I find it to be an interesting argument.\n\nEdit: wording",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9tnos2",
                            "author": "Mooscowsky",
                            "score": 0,
                            "created_utc": 1653409512.0,
                            "response": "Great argument! Got any actual arguments or just mud slinging? \n\nI THINK YOU'RE SILLY, THEREFORE IT'S TRUE!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9tphg8",
                                    "author": "joecool42069",
                                    "score": 1,
                                    "created_utc": 1653410236.0,
                                    "response": "It’s an adolescent world view to hold.  Debating it is like trying to explain to a child why society works the way it does today.  Why we require a government to keep order.\n\nAlso, Reddit is a shit platform for debate.  Sorry you have a shitty ideology.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9tcecw",
                    "author": "s3xstar",
                    "score": 1,
                    "created_utc": 1653404833.0,
                    "response": "Just avoid the two books by saifedean and you are good.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9tgvfg",
                            "author": "knowledgelover94",
                            "score": 2,
                            "created_utc": 1653406713.0,
                            "response": "Heh? Why? I just read them and they’re great!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9tl1f8",
                                    "author": "s3xstar",
                                    "score": 0,
                                    "created_utc": 1653408429.0,
                                    "response": "His books are about his worldview and very little about Bitcoin. Avoid people projecting their ideologies into money... its also historically inaccurate. I can go on but please DYOR.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9trg86",
                                            "author": "knowledgelover94",
                                            "score": 2,
                                            "created_utc": 1653411035.0,
                                            "response": "Uhh yea you’ll have to give some more specific criticism since it definitely does talk a lot about bitcoin and of course every author’s writing reflects their worldview.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9u3mzt",
                                                    "author": "BuyRackTurk",
                                                    "score": 1,
                                                    "created_utc": 1653416061.0,
                                                    "response": "He gets the role of silver wrong, imo. \n\nSure, silver was defeated, but silver itself was preferable to the gold standard.\n\nThe Moghul empire and Qing Dynasty were defeated not by silver as a less-sound money, but by effective centralized government and technological stagnation. \n\nIn fact, silver was working better for them than anything else could at the time; So they failed despite using silver, not because of it.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9u4kfq",
                                                            "author": "knowledgelover94",
                                                            "score": 1,
                                                            "created_utc": 1653416450.0,
                                                            "response": "Interesting. Is silver not more easily mined (less scarce) than gold? Does that not make gold superior?",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9u9lki",
                                                                    "author": "BuyRackTurk",
                                                                    "score": 2,
                                                                    "created_utc": 1653418568.0,
                                                                    "response": "> Interesting. Is silver not more easily mined (less scarce) than gold? Does that not make gold superior?\n\nThe problem is that gold is in simply too short supply to use for everyday trades. People must then resort to representative money, such as paper currency. \n\nThe very reason that the precursor to the modern banking cartels pushed a gold standard was precisely to demonetize silver via government; because silver was a competitor they could not defeat in market competition. And once silver was removed, and gold never actually used, they could freely counterfeit.\n\nIn theory, nations who's people used a silver standard, (philipines, qing, moghul) were on a strong sound money foundation. Sadly, sound money alone was not enough to defeat the other weaknesses of those empires; leaving them with an insufficient technological and economic base to compete. \n\nIn particular, the Qing empire was based on slavery and wealth was directly proportional to position in government, leading to government attempting to control all aspects of life. Much like modern china, this causes government to attempt to snuff out any disruptions, such as new technology. Much like modern china mostly killing off its nascent tech sector, the Qing empire quashed science, international trade, and did not allow the working capitalist class to retain enough of their wealth to incentivize innovation. \n\nIts likely that the banking cartel empires will follow this same trajectory when their captialist momentum runs low... unless bitcoin is able to disrupt legacy banking.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9ue267",
                                                                            "author": "knowledgelover94",
                                                                            "score": 1,
                                                                            "created_utc": 1653420448.0,
                                                                            "response": "Wow very interesting! Basically you’re saying the gold standard sometimes made it so that people had to use fiat which was exploited. Silver was able to be used as a hard money but governments and bad folks suppressed it. \n\nWhat do you mean in the last phrase? You mean banks will try to suppress bitcoin?",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i9uk7aj",
                                                                                    "author": "AvisPhlox",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653423027.0,
                                                                                    "response": ">You mean banks will try to suppress bitcoin?\n\nI thought they're been doing that for some time thru legacy media. [They're still doing that right now.](https://www.youtube.com/watch?v=SUwnjWgQRTQ) The trick here is that this old broad might be bad mouthing banks but she backs up the banks behind the scenes.",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9t97ma",
                    "author": "aliensmadeus",
                    "score": 1,
                    "created_utc": 1653403485.0,
                    "response": "great list",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9tut4x",
                    "author": "swfsql",
                    "score": 1,
                    "created_utc": 1653412410.0,
                    "response": "I first read Human Action from von Mises before getting into Bitcoin.  \nSince it's a book written in the ~50's ofc there won't be any direct reference to Bitcoin itself, but it has so so many insights on various economical topics that if you keep working it out you'll get why Bitcoin is so good. \n\nAnd also why it will be good when Bitcoin forces all central banks and governments to go bankrupt.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9sx3is",
                    "author": "chucktheschmuck",
                    "score": -12,
                    "created_utc": 1653397881.0,
                    "response": "This could be a tough sell these days.  Socialists, communists and radical leftists are pretty entrenched in this community now.  Annoying, but we would have needed them eventually.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9t2i8n",
                    "author": "mr_crackboy",
                    "score": 1,
                    "created_utc": 1653400510.0,
                    "response": "add \"the fiat standard\" & \"Argentarius\"",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9tnyyc",
                    "author": "samlawsteadicam",
                    "score": 1,
                    "created_utc": 1653409627.0,
                    "response": "I’d recommend also reading John Maynard Keynes so you understand how fucked up the counter argument to bitcoin is. \nAlso I still have a few of those to listen to but the bitcoin standard and bitcoin hard money you can’t fuck with have been the two most influential for me. They definitely sent me down the Austrian economics rabbit hole",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9tscut",
                    "author": "ArcticxDust",
                    "score": 1,
                    "created_utc": 1653411409.0,
                    "response": "Remember, when you’re reading this people will be biased. Go in neutral, like Bitcoin.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9u1lyi",
                    "author": "c_games_official",
                    "score": 1,
                    "created_utc": 1653415210.0,
                    "response": "Has anyone read the Fiat Standard? I'm thinking of picking it up. Feeling conflicted since I am a big fan of the Bitcoin Standard and agree with the author about time preference, Austrian economics etc but I don't like the author as a person",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9u3zcy",
                    "author": "MichaelAischmann",
                    "score": 1,
                    "created_utc": 1653416207.0,
                    "response": "Do yourself a favor and do that even if the bitcoin is going up or down or does loops on the chart. Post again without all that BS before the first comma.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9u64i9",
                    "author": "F0rtysxity",
                    "score": 1,
                    "created_utc": 1653417103.0,
                    "response": "Should we invest our money elsewhere for the next two years then? And reinvest before it goes up?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9u64t1",
                    "author": "AssumptionKey1842",
                    "score": 1,
                    "created_utc": 1653417107.0,
                    "response": "7th Property is pretty good too.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9u7cab",
                    "author": "Kingtots10",
                    "score": 1,
                    "created_utc": 1653417618.0,
                    "response": "Listen to Lex Fridman’s podcast with Saidedean Ammous. Its really enlightening.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9uahpp",
                    "author": "ivgur",
                    "score": 1,
                    "created_utc": 1653418942.0,
                    "response": "Any more on Austrian economics and libertarianism beside these?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ubdd4",
                    "author": "randompittuser",
                    "score": 1,
                    "created_utc": 1653419318.0,
                    "response": "True libertarianism doesn’t exist.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9uho8r",
                    "author": "Hefty_Jicama",
                    "score": 1,
                    "created_utc": 1653421964.0,
                    "response": "So no more adoption for two years. Wtf",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9tjdco",
                    "author": "WiseNyoung",
                    "score": -2,
                    "created_utc": 1653407746.0,
                    "response": "Waste of time when price action does not align. Bitcoin the psyop. If you got in below 1k or 10k great it was a thing. Now your clowned by the 3 letter agency that made it and own nothing of real value. When you get hit with a blackout or power outage your broke as they get and swallowed up by this system. Truth isn't supposed to sit well with you its supposed to change you.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9uixgq",
                            "author": "AvisPhlox",
                            "score": 1,
                            "created_utc": 1653422485.0,
                            "response": "Who hurt you?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9tjko0",
                    "author": "Veritas_The_Priest",
                    "score": -1,
                    "created_utc": 1653407831.0,
                    "response": "Giving you a virtual kiss on the cheek, sir! This is a great list! Thank you! 👍",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9tgbzh",
                    "author": "slvbtc",
                    "score": 0,
                    "created_utc": 1653406488.0,
                    "response": "Head to youtube and search for Mike Maloneys series \"hidden secrets of money\". An easier more visual way to learn.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}