{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uw1649",
            "title": "“Bitcoin and crypto worth nothing” “A digital euro would be “vastly different” from private cryptocurrencies, Lagarde said.",
            "url": "https://www.cnbc.com/2022/05/23/ecb-chief-christine-lagarde-crypto-is-worth-nothing.html",
            "author": "Financial_Chemist286",
            "created_utc": 1653315251.0,
            "score": 1,
            "num_comments": 2,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9oot7x",
                    "author": "coinfeeds-bot",
                    "score": 1,
                    "created_utc": 1653315302.0,
                    "response": "tldr; Lagarde said she thinks crypto should be regulated to protect inexperienced investors.\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR.*",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uw1679",
            "title": "in 2024 we will have the Halvening & this guy wil be back pushing for lower interest rates. If you can hold until 2024 you are gonna make it",
            "url": "https://i.redd.it/ppfqewrjh8191.jpg",
            "author": "hyperinflationUSA",
            "created_utc": 1653315258.0,
            "score": 0,
            "num_comments": 73,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9or0md",
                    "author": "Moonconsort",
                    "score": 12,
                    "created_utc": 1653316306.0,
                    "response": "Lolololololololol",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9oudmw",
                            "author": "yasashi-neko",
                            "score": 4,
                            "created_utc": 1653317791.0,
                            "response": "geriatric election battle lool",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9p2vn2",
                            "author": "lib3rty47",
                            "score": 4,
                            "created_utc": 1653321440.0,
                            "response": "i dont know why you are laughing. this is horrifying and could destroy alot of lives if he is allowed to do this.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9owwwm",
                    "author": "slo1111",
                    "score": 10,
                    "created_utc": 1653318909.0,
                    "response": "LMAO. He was for higher interest rates (see 2016 tweet when accused Yellen and Obama for \"artificially\" lowered rates.  He gets in office with a lower yield on the 10 year and then is immediately for lower interest rates.\n\nThen comes Johnny here stating he wants more quanative easing to lower interest rates when inflation is sky high.\n\nThis Trump experience is a joke that never fucking ends.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9oowy7",
                    "author": "Perfect_Ability_1190",
                    "score": 20,
                    "created_utc": 1653315351.0,
                    "response": "Says the bankrupt orange",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ozogv",
                            "author": "QAnonRetard",
                            "score": -7,
                            "created_utc": 1653320090.0,
                            "response": "bankrupt orange still way better than demented brandon :-)",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9p20q7",
                                    "author": "wkw3",
                                    "score": 14,
                                    "created_utc": 1653321079.0,
                                    "response": "Username checks out.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9p30i4",
                                            "author": "QAnonRetard",
                                            "score": -9,
                                            "created_utc": 1653321497.0,
                                            "response": "great argument! ;-)",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9p3fkc",
                                                    "author": "wkw3",
                                                    "score": 8,
                                                    "created_utc": 1653321672.0,
                                                    "response": "That was a diss, not an argument. But I don't expect his fan base to be able to tell the difference. ;-)",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9p4bma",
                                                            "author": "QAnonRetard",
                                                            "score": -9,
                                                            "created_utc": 1653322049.0,
                                                            "response": "nah, that was an argument.  which is the exact type of argument i expect from brandon's fan base ;-)",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9p5ixr",
                                                                    "author": "wkw3",
                                                                    "score": 6,
                                                                    "created_utc": 1653322555.0,
                                                                    "response": "[Oh you wanted an argument? I'm sorry, this is abuse.](https://youtu.be/xpAvcGcEc0k)",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9p9z9p",
                            "author": "Independent-Raisin70",
                            "score": -1,
                            "created_utc": 1653324404.0,
                            "response": "I'd trade orange man and mean tweets for this sharp American decline any day. Our foreign policy and leadership is orchestrated decline.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9pcmm7",
                                    "author": "CryptoKeeper808",
                                    "score": 3,
                                    "created_utc": 1653325508.0,
                                    "response": "The talking orange at it again.  The shitshow this \"president\" started back in 2018 was pathetic to witness.  Last I checked he is completely anti crypto so I'm not sure why anyone who is a crypto fan supports the talking orange.  If any politician, not that Dump Trump really falls into that category, ever goes against crypto I will not be voting for them.  You all crypto fans that support politicians who are anti crypto need to check yourself.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9phfyd",
                                            "author": "Independent-Raisin70",
                                            "score": -2,
                                            "created_utc": 1653327539.0,
                                            "response": "Orange man never affected crypto. No ban. Nothing. He talked shit about it, definitely. This admin and Yellen actively speak about actual regulation.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9qj2h2",
                                                    "author": "Master-Ad-1982",
                                                    "score": 1,
                                                    "created_utc": 1653343948.0,
                                                    "response": "Worse, the orange idiot made the pandemic much worse, ruining economy for years to come. We are still paying for his nonsense. Then again maybe if we all drank bleach, the economy would be hUuuge.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9ooyua",
                    "author": "motaconan",
                    "score": 20,
                    "created_utc": 1653315375.0,
                    "response": "You actually think that guy will be president again? lol no",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9opvof",
                            "author": "Professional_Welder",
                            "score": 4,
                            "created_utc": 1653315790.0,
                            "response": "I think he has a very, very good shot for better or worse. A significant portion of the country still thinks the election was rigged and I've yet to hear a Democrat actually tell me they were excited to vote for the Crip keeper.\n\nPerhaps the anti-trump could motivate Dems again.\n\nRegardless, buy Bitcoin so you can redeem your ticket to the citadel when it all goes south.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9p2d7q",
                                    "author": "wkw3",
                                    "score": 7,
                                    "created_utc": 1653321224.0,
                                    "response": "Almost nobody voted for Biden. The majority voted for anybody but Trump.\n\nBiden has been weak, uninspiring, and ineffective, and it's still an improvement.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9p6s9r",
                                            "author": "Professional_Welder",
                                            "score": 3,
                                            "created_utc": 1653323077.0,
                                            "response": "Right, but Trump has a strong base. An argument could be made that he is losing some of his momentum from being out of office, but I think he poses a serious comeback if he were to run again. It's just reality, the margin was pretty close in the election.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9q2s6x",
                                                    "author": "Potato_Donkey_1",
                                                    "score": 3,
                                                    "created_utc": 1653336647.0,
                                                    "response": "I agree that Trump would be a strong candidate. I don't like him or his simplistic approaches to complex realities. He's not smart about policies or governance, but he does have a variety of emotional intelligence that reflects back the emotions of an angry electorate. If nominated, he might win again given that any incumbent would have a tough time with reelection and that the electoral college is tilted in favor of the GOP.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i9p8akm",
                                                    "author": "Nichoros_Strategy",
                                                    "score": 2,
                                                    "created_utc": 1653323707.0,
                                                    "response": "I doubt his base is enough, he will need the sort of votes from when it was him vs hilary, and he won’t be getting them this time around. Let’s see if the republican party even wants to risk it in the first place.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9p9334",
                                                            "author": "Professional_Welder",
                                                            "score": 2,
                                                            "created_utc": 1653324037.0,
                                                            "response": "I think the GOP may be at a disadvantage if they ran him again, but they also risk losing the Trump base if he lost in the primary. Many of the people he turned out weren't voting at all prior to Trump. He pulled lots of people back into the system that felt disenchanted with the process.\n\nIt's really going to depend on what Dems do, in my view. They will probably run Biden again which albeit won't ignite the same level disgust people had for Clinton, but it certainly isn't motivating any Dems to Pokemon Go to the Polls.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9pbgv3",
                                                                    "author": "Nichoros_Strategy",
                                                                    "score": 1,
                                                                    "created_utc": 1653325023.0,
                                                                    "response": "Yeah, well if they need Trump to keep their voters together, then they are in a far worse position than ppl realize, and I’m not a fan of the democrats either.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9pbxq9",
                                                                            "author": "Professional_Welder",
                                                                            "score": 1,
                                                                            "created_utc": 1653325220.0,
                                                                            "response": "I think most people realize it. Democrats eventually are going to start giving way to their populist candidates too.\n\nThis is America's transition into a low-trust society made up of weakening institutions.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i9pcyqs",
                                                                                    "author": "CryptoKeeper808",
                                                                                    "score": 0,
                                                                                    "created_utc": 1653325649.0,
                                                                                    "response": "I truly hope the talking orange runs again so he can lose twice 🤡🤡🤡.  Doubt he will be eligible to run after being convicted of several felonies though...",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i9pdtq7",
                                                                                            "author": "Professional_Welder",
                                                                                            "score": 1,
                                                                                            "created_utc": 1653326017.0,
                                                                                            "response": "Dude is not getting convicted of anything bro. Idk where you're at. The elite play by a different game.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i9p7z38",
                                                    "author": "wkw3",
                                                    "score": 2,
                                                    "created_utc": 1653323574.0,
                                                    "response": "Out of the last 10 elections, 2020 was only the 5th closest.\n\nI'm more concerned with the right's attempts to restrict voting.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9p8ds5",
                                                            "author": "Professional_Welder",
                                                            "score": 2,
                                                            "created_utc": 1653323743.0,
                                                            "response": "I mean I wasn't coming at this from a slant, you clearly have. He's a strong candidate, you just don't want him to be.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9pa97w",
                                                                    "author": "wkw3",
                                                                    "score": 3,
                                                                    "created_utc": 1653324518.0,
                                                                    "response": "I didn't say he wasn't a strong candidate. He's the best chance the Republicans have, and that's a shame.  He is a threat to the nation.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9q3dbv",
                                                                            "author": "Potato_Donkey_1",
                                                                            "score": 2,
                                                                            "created_utc": 1653336901.0,
                                                                            "response": "He might not be the best chance the Republicans have. If Trump would be a strong candidate, then DeSantis might be better as a Trump-like figure without Trump's particular baggage. But the strongest GOP candidate might be one who isn't explicitly a Trumpist but who hasn't openly dissed Trump, someone who could attract independent votes without alienating Trump's fans.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9pnnah",
                                            "author": "EthereumBullrun",
                                            "score": 0,
                                            "created_utc": 1653330164.0,
                                            "response": "“It’s still an improvement”\n\nNo, that’s completely untrue, you know it and everyone knows it. You’re lying to yourself if you say that Biden is in any way close to the president that Trump is. I’m not even a Trump fan boy, but were certainly much worse off now than we were.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9q0y2b",
                                                    "author": "wkw3",
                                                    "score": 3,
                                                    "created_utc": 1653335858.0,
                                                    "response": "You're telling me that I know that Trump was a better president than Biden is. You're only fooling yourself. Trump is the first president in history to oppose the peaceful transfer of power after an election, inciting a riot from his gullible base to do so. The only thing that he was good at was drawing attention away from the machinations of the Republican legislature, the ones who were actually effective at gutting this country.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9p9o2b",
                            "author": "Independent-Raisin70",
                            "score": 3,
                            "created_utc": 1653324273.0,
                            "response": "Sounds like what the mainstream said in 2016. There is still a massive dedicated base. Myself included.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9qetj9",
                                    "author": "RocketMoonShot",
                                    "score": 1,
                                    "created_utc": 1653341972.0,
                                    "response": "Why would you dedicated to Trump?  Isn't he also too old for the job?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9oq46u",
                            "author": "hyperinflationUSA",
                            "score": -5,
                            "created_utc": 1653315898.0,
                            "response": "doesn't matter if he wins. He be back on the news circuit pushing for lower interest rates",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9ou461",
                    "author": "ManyArtichoke",
                    "score": 9,
                    "created_utc": 1653317674.0,
                    "response": "You want interest rates at 0 while inflation is at 8%...? Good luck with that. \n\nWe don't need to see this authoritarian clown on a Bitcoin sub.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9opju5",
                    "author": "superwalrus80",
                    "score": 6,
                    "created_utc": 1653315642.0,
                    "response": "An interest rate below 0...lol clown show",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9oq0fn",
                    "author": "-_-Stinky-_-",
                    "score": 6,
                    "created_utc": 1653315851.0,
                    "response": "Sigh, why does Bitcoin have to be orange?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9oyxsl",
                    "author": "Amoci",
                    "score": 2,
                    "created_utc": 1653319776.0,
                    "response": "FWIW **Halving**",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9osxhe",
                    "author": "MrDopple68",
                    "score": 4,
                    "created_utc": 1653317156.0,
                    "response": "Another thing...and I hate to get political..but for years Russia has tried to help the republicans win elections...and there is obviously something personal between Putin and the Bidens due to their involvement in Ukraine.\n\nI do think part of what Putin is doing now is in response to the Democrats winning the last election.\n\nSo I wouldn't be surprised to see the Ukraine war go on until the next election.\n\nAnd in the mean time Putin is helping to tank the world economy with supply chain issues and food storages and helping to tank stock markets.\n\nThe American public will blame the Democrats for all of this, which will help the Republicans back in power and an uneasy truce with Russia will be done. \n\nThe Republicans seem to be more pro bitcoin as well.\n\nSo add all that to the halving and ongoing adoption and I think end of 2024 and 25 will be boon years.\n\nJust my theory.\nI'm not American so I don't have a horse in the race politically speaking.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ovg0t",
                            "author": "BSN_tg_bgg",
                            "score": 5,
                            "created_utc": 1653318262.0,
                            "response": "Not an American. Actually thinks that the Russian collusion was real. Doesn’t know about Burisma Energy scandal.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9p8jhi",
                                    "author": "Graythesway",
                                    "score": 2,
                                    "created_utc": 1653323809.0,
                                    "response": "The fact we still have Russia collusion believer out there still, after a 2 year investigation and now the Durham investigation which is uncovering all the lies of the Clinton champaign shocks me.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9p8twq",
                                            "author": "BSN_tg_bgg",
                                            "score": 1,
                                            "created_utc": 1653323932.0,
                                            "response": "Remember what people said about Bitcoin back in 2011-2014. People are slow. They really want to believe that the best rise up to the top.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9pb1ng",
                            "author": "Independent-Raisin70",
                            "score": 1,
                            "created_utc": 1653324846.0,
                            "response": "Random rant: Biolabs in Ukraine. Hunter Biden and Polosi connections in big oil in Ukraine. Breeding ground for democrat corruption and money laundering. Major (and I mean major) supply of crude oil comes from Russia. Biden places sanctions on Russian crude oil (unnecessary but has to not to protect NATO but to protect their corrupt state). Crude oil needed for diesel. Diesel goes up. Trucking companies have transportation cost double. Cost passed along to all suppliers, who pass increased cost to you and me for everything we buy.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9pnzai",
                                    "author": "EthereumBullrun",
                                    "score": 0,
                                    "created_utc": 1653330306.0,
                                    "response": "But, but…. Orange man bad!!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9pezg0",
                    "author": "wesblog",
                    "score": 3,
                    "created_utc": 1653326501.0,
                    "response": "If Trump is back in 2024 we have bigger problems than high interest rates.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9qk0yg",
                            "author": "DarkChild22",
                            "score": 1,
                            "created_utc": 1653344403.0,
                            "response": "Lmao as opposed to Biden?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9orgjy",
                    "author": "solomonsatoshi",
                    "score": 4,
                    "created_utc": 1653316505.0,
                    "response": "This guy is Putins buddy and a property speculator with a LOT of debt.\n\nIf you want USD inflation at 20%+ and the USD to lose global reserve status then this guy is your hero and you are a fool.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9op3gw",
                    "author": "RocketMoonShot",
                    "score": 2,
                    "created_utc": 1653315435.0,
                    "response": "He will def call for stimulus payments too.  Every time he told congress to make the package bigger.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9opycu",
                    "author": "sgreene1021",
                    "score": 1,
                    "created_utc": 1653315824.0,
                    "response": "Fuc$ him and his POS family and you!!!  For posting garbage",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9oqaa9",
                            "author": "StannisBaratheon6969",
                            "score": 6,
                            "created_utc": 1653315974.0,
                            "response": "Neither kind nor interesting; you can do better.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9oz6wn",
                                    "author": "sgreene1021",
                                    "score": -2,
                                    "created_utc": 1653319883.0,
                                    "response": "Wasn't trying to be kind",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9ouy71",
                            "author": "Acrobatic_Soft_7120",
                            "score": 2,
                            "created_utc": 1653318043.0,
                            "response": "I'm surprised you're able to see the benefits of BTC considering your ignorant comment. I bet you think you're a good person don't you?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9oztd4",
                                    "author": "sgreene1021",
                                    "score": -5,
                                    "created_utc": 1653320147.0,
                                    "response": "If it's jot good enough for Gates it's not good enough for me. Enjoy losing your money",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9p1vmk",
                    "author": "NastyDwarf74",
                    "score": 1,
                    "created_utc": 1653321019.0,
                    "response": "I'll take mean tweets over this current walking corpse any day.  Most of the people who didnt like him was because he reminded them of a tough parent (from back in the day) and most people now cant stand being told the hard truth.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9opcvl",
                    "author": "DowvoteMeThenBitch",
                    "score": 1,
                    "created_utc": 1653315553.0,
                    "response": "Lower than zero!? I would love a loan with a negative interest rate! Make this man president!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9oqqbb",
                            "author": "dlq84",
                            "score": 3,
                            "created_utc": 1653316176.0,
                            "response": "My country had negative interest rates for a while, doesn't mean the bank sector is doing the same.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9pafhi",
                                    "author": "resjohnny",
                                    "score": 1,
                                    "created_utc": 1653324589.0,
                                    "response": "So did the US (artificially through fees), just means banks charge you to hold your money.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9os7zf",
                    "author": "stryker7314",
                    "score": 1,
                    "created_utc": 1653316840.0,
                    "response": "Ez downvote",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9pn5ol",
                    "author": "EthereumBullrun",
                    "score": 1,
                    "created_utc": 1653329960.0,
                    "response": "I certainly do miss him. He warned everyone what would happen if Biden were to get in office and they didn’t listen.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9otjbz",
                    "author": "Nada_Lives",
                    "score": -4,
                    "created_utc": 1653317422.0,
                    "response": "Anyone notice the Trump detractors don't seem to be able to voice a specific objection to the man? Just that he is literally Hitler (in a symbolic sort of way)?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9oukc5",
                            "author": "SPOKTALK",
                            "score": 5,
                            "created_utc": 1653317875.0,
                            "response": "- Syria false flag first move as president war crime\n- Solimani assassination war crime\n- biological warfare against Iran/China war crime\n- armed Saudis to genocide Yemen war crime\n- Free speech violating executive order to silence university BDS students exposing Israel on campuses\n- Operation Warpspeed covert genocide against his own people\n- stolen trillions for staged pandemic\n- continues to push clot shots even when booed by his own supporters, responsible for the deaths of his own supporters especially in the south\n- tried establishing a national police force like his Bolshevik handlers did in Russia\n- incomplete incoherent sentence structure\n- uses Christians to further promote Zionism and the rebuilding of their blood sacrifice temple\n- appointed neocon psychos to run foreign policy (Pompeo & Bolton)\n- presided over Ukraine being brought in as a de facto NATO member, setting the stage for war\n- appointed world's leading advocate of biological warfare as biowar czar (Robert Kadlec)\n- TRUMP administration launched series of biowar attacks on China, Iran\n\nTrump loaded the gun, aimed, fired and then handed it to biden while the barrel was still smoking",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9oxaou",
                                    "author": "humansubjects",
                                    "score": 1,
                                    "created_utc": 1653319077.0,
                                    "response": "Yep, not a single objection...",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9p1qzd",
                                    "author": "Nada_Lives",
                                    "score": 1,
                                    "created_utc": 1653320965.0,
                                    "response": "You are the one in a million, and I appreciate this! Now let's get this out onto neutral ground and see what sticks.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9p939x",
                                    "author": "Graythesway",
                                    "score": -1,
                                    "created_utc": 1653324039.0,
                                    "response": "Most of these points predate Trump and were actually Obama policies. Higlighting incomplete, incoherent sentence structure is the Ironic post of the Decade.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9oydw7",
                    "author": "ETAVEGAMING",
                    "score": 1,
                    "created_utc": 1653319540.0,
                    "response": "Politicans are wolves in sheep’s clothing and sheep is what’s for dinner.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9p5gxz",
                    "author": "Sharing-my-bad-ideas",
                    "score": 1,
                    "created_utc": 1653322531.0,
                    "response": "Wait….this is not what I thought you all meant when you referred to “Orange Pilling” people.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9pzdab",
                    "author": "cpt_charisma",
                    "score": 1,
                    "created_utc": 1653335187.0,
                    "response": "Just because he's orange doesn't automatically mean he's related to Bitcoin.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uw19a3",
            "title": "U.S dollar",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uw19a3/us_dollar/",
            "author": "Emanuelsil",
            "created_utc": 1653315492.0,
            "score": 20,
            "num_comments": 58,
            "subreddit": "Bitcoin",
            "selftext": "Can any one explain to me how does the U.S dollar burning mechanism works?",
            "stickied": false,
            "comments": [
                {
                    "id": "i9oubhv",
                    "author": "D-6Hunter",
                    "score": 43,
                    "created_utc": 1653317764.0,
                    "response": "It works like this:\n\nSomeone asks for a credit with the bank, the bank creates the money out of thin air.\nYou pay back the loan + the interest rates. When you’re done paying it back, the bank erases the money from their balance sheet. \nSo the money comes out of thin air and vanishes into thin air. Money Supply before and after the loan are identical.\n\nThis would be totally fine, but taking out a loan gives you an advantage over your competition, forcing them to take out loans themselves. \nThis leads to excessive loans which widens the total money supply.\nEvery future loan getting even bigger because the money loses its value. \nIt’s like a death cycle that will collapse sooner or later.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9p0np4",
                            "author": "Inviz57",
                            "score": 5,
                            "created_utc": 1653320502.0,
                            "response": "Sorry if I'm missing something simple here, trying to understand.\n\nIf:\n\n>Money Supply before and after the loan are identical.\n\nthen how?\n\n>This leads to excessive loans which widens the total money supply.\n\nAlso, considering the bank erases the money loaned after loan + interest is paid, then interest is deducted from the money supply which should add value to money? What am I missing?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9p2a96",
                                    "author": "D-6Hunter",
                                    "score": 8,
                                    "created_utc": 1653321189.0,
                                    "response": "The interest isn’t deducted from the money supply, only the loaned amount gets erased. The interest goes to the bank, the bank pays their staff and the interest is still part of the total money supply.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9pto09",
                                            "author": "lsmod1",
                                            "score": 1,
                                            "created_utc": 1653332753.0,
                                            "response": "That's what I thought",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9p1szv",
                                    "author": "D-6Hunter",
                                    "score": 15,
                                    "created_utc": 1653320989.0,
                                    "response": "The money supply before and after the loan is the same. But while the loan is taken out, the money supply has temporarily grown, this lasts until the loan is paid in full.\n\nMost of these loans are very long term like 10-30 years to pay back the full amount. Often those loan payments are even payed back with money from new loans. \n\nTheoretically the money supply should come back to what it was before. But practically the size of the the loans constantly increase. And with this debt increasing, the money supply is increasing as well. \nIn theory it’s just temporarily and if you just look at every loan individual this seems fine. But the combination of all those loans is what builds up this huge house of cards.\n\nJust google some figures of debt for the US, companies or private individuals. It’s constantly increasing over time. \n\nIn 2008 we saw a dip because nobody wanted to lend money to anyone but otherwise it’s increasing exponentially. Hope that clears things up for you.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9p28ph",
                                            "author": "Inviz57",
                                            "score": 9,
                                            "created_utc": 1653321172.0,
                                            "response": "Got it! I was missing that it's temporary in theory, but keeps growing in practice.\n\nThank you for the explanation",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9p2d40",
                                                    "author": "D-6Hunter",
                                                    "score": 3,
                                                    "created_utc": 1653321223.0,
                                                    "response": "You’re welcome",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9qfi4a",
                                    "author": "jdoingj",
                                    "score": 1,
                                    "created_utc": 1653342284.0,
                                    "response": "Think of it like a bathtub with an open drain and a faucet running. The open drain is money being payed back on loans and the faucet is new money being created. Eventually an equilibrium will be reached assuming all loans are paid back but this is an aggregate so roughly equal. The water in the tub is the increased money supply over time this can grow or shrink.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9qfjb4",
                                            "author": "Paid-Not-Payed-Bot",
                                            "score": 1,
                                            "created_utc": 1653342299.0,
                                            "response": "> money being *paid* back on\n\nFTFY.\n\nAlthough *payed* exists (the reason why autocorrection didn't help you), it is only correct in:\n\n * Nautical context, when it means to paint a surface, or to cover with something like tar or resin in order to make it waterproof or corrosion-resistant. *The deck is yet to be payed.*\n\n * *Payed out* when letting strings, cables or ropes out, by slacking them. *The rope is payed out! You can pull now.*\n\nUnfortunately, I was unable to find nautical or rope-related words in your comment.\n\n*Beep, boop, I'm a bot*",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i9qfrsa",
                                            "author": "jdoingj",
                                            "score": 1,
                                            "created_utc": 1653342408.0,
                                            "response": "Actually instead of a faucet think of the bank as dumping a huge bucket of water in the tub as you slowly pay it back ie open drain. Quickly the tub would be full and that would be the increased supply",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9q479s",
                            "author": "cubeeless",
                            "score": 2,
                            "created_utc": 1653337260.0,
                            "response": "So what you are saying is buy BTC?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9qbv1l",
                                    "author": "D-6Hunter",
                                    "score": 1,
                                    "created_utc": 1653340632.0,
                                    "response": "Im not telling anyone to buy btc, but i think bitcoin is our best shot to get out of this mess. It might get ugly before it gets better though.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9oukuo",
                            "author": "Al_Zik1",
                            "score": 3,
                            "created_utc": 1653317881.0,
                            "response": "Well said",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9pfl57",
                            "author": "Boondocker66",
                            "score": 2,
                            "created_utc": 1653326754.0,
                            "response": "This guy's onto something...🤔",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9ovv2w",
                            "author": "couscous_",
                            "score": 0,
                            "created_utc": 1653318446.0,
                            "response": "Which is why interest is evil as it is what starts this cycle in the first place.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9owubu",
                                    "author": "D-6Hunter",
                                    "score": 13,
                                    "created_utc": 1653318877.0,
                                    "response": "I wouldn’t say interest is evil. In the case of a loan that is actually backed by usd, interest makes total sense, why else would you invest/lend your money if you won’t get a return? I would say an interest rate of close to zero is evil, because it incentivizes people, companies and even countries to take out loans they couldn’t really afford otherwise.\nThis is why we as a society are falling for making poor financial decisions. It’s like taking out a loan for a car or a new tv you can’t really afford.\n\nThe better scenario for society and the environment would be having a monetary system that incentivized saving over consuming.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9pz0v9",
                                            "author": "couscous_",
                                            "score": 1,
                                            "created_utc": 1653335040.0,
                                            "response": ">  why else would you invest/lend your money if you won’t get a return\n\nThat's the whole point, you wouldn't. You'd invest instead (shared risk). Lending money would be relegated to acts of charity.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9qk6kq",
                                                    "author": "RufusROFLpunch",
                                                    "score": 1,
                                                    "created_utc": 1653344474.0,
                                                    "response": "Credit isn’t going to go away just because we are on a Bitcoin standard. It will be reduced significantly, and at higher interest rates for sure, but it’s definitely not going away.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9qn4zd",
                                                            "author": "D-6Hunter",
                                                            "score": 1,
                                                            "created_utc": 1653345889.0,
                                                            "response": "Credit isn’t bad if the money or underlying asset actually exists as a security. But loans and investments will stop going everywhere and will be more dedicated to real needs of society. Creating value would be the new focus.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9oy6hf",
                                    "author": "Correct-Log5525",
                                    "score": 6,
                                    "created_utc": 1653319452.0,
                                    "response": "If interest didn't exist nobody would loan money to anyone..",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9pkneo",
                                            "author": "JaundiceJack",
                                            "score": 1,
                                            "created_utc": 1653328885.0,
                                            "response": "Good.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9pp7j7",
                                                    "author": "Correct-Log5525",
                                                    "score": 3,
                                                    "created_utc": 1653330837.0,
                                                    "response": "You gonna buy your house in cash?  Is everyone gonna be able to buy their house in cash?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9q1iiv",
                                                            "author": "JaundiceJack",
                                                            "score": 1,
                                                            "created_utc": 1653336101.0,
                                                            "response": "That's the point. With no one able to take out mortgages, the market adjusts 80% down to meet buyers.\n\nYes, people that treated housing as an investment get torched, but they're a sacrifice I'm willing to make.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9qaapc",
                                                                    "author": "Correct-Log5525",
                                                                    "score": 1,
                                                                    "created_utc": 1653339919.0,
                                                                    "response": "> Yes, people that treated housing as an investment get torched\n\nNo, any current homeowner gets torched as they have loans that will be underwater and foreclosures will skyrocket.\n\n>they're a sacrifice I'm willing to make.\n\nYou're talking about cratering the US housing market.  It would be worse than '08, much worse.  This is a terrible take.  It would be political suicide to push for this and thus will never happen. You, selfishly, may be willing to sacrifice the core investment of 150 million Americans but no homeowner would ever agree with this",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9pyykd",
                                            "author": "couscous_",
                                            "score": 1,
                                            "created_utc": 1653335012.0,
                                            "response": "Which is a good thing (not building an economy on debt).",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9pz45g",
                                                    "author": "Correct-Log5525",
                                                    "score": 1,
                                                    "created_utc": 1653335079.0,
                                                    "response": "That may be fair but how many people in the US could buy a house in cash right now?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9q1rwy",
                                                            "author": "couscous_",
                                                            "score": 1,
                                                            "created_utc": 1653336211.0,
                                                            "response": "I agree it's a big problem, and we got into this mess because of interest bearing loans. If we're serious about solving this problem, we should take a step back and think things from the ground up.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9q5gaj",
                                                                    "author": "fifaloko",
                                                                    "score": 1,
                                                                    "created_utc": 1653337806.0,
                                                                    "response": "Also worth noting the “affordable housing” and building regulations in many areas has greatly dis-incentived builders to actually build new housing and skyrocketed the prices for existing housing which has lead to this problem. Thomas Sowell talked about this a lot",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9qh88e",
                            "author": "SubstantialNinja",
                            "score": 0,
                            "created_utc": 1653343083.0,
                            "response": "Banks don't create money out of thin air. I know you probably watched the same youtube video I did and then never actually thought it through. The bank takes deposits and lends them out at higher interest than they pay to depositors. When you take out a loan they are giving the aforementioned depositor's money to the person who sold you the house or car and then you have to create the new money to satisfy the principal + interest. If all the depositors requested their deposits back at the same time the bank would not be able to create money out of thin air to avoid a run on the bank.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9qiu8i",
                                    "author": "D-6Hunter",
                                    "score": 1,
                                    "created_utc": 1653343838.0,
                                    "response": "Im sorry but this is total bs 😅 just google it, it takes like 20 seconds to see you’re dead wrong. The bank doesn’t need any money from deposits to create a loan.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9qj1sq",
                                            "author": "SubstantialNinja",
                                            "score": 1,
                                            "created_utc": 1653343939.0,
                                            "response": "If the seller of the house or car will take a bank IOU and become a depositor themselves perhaps not, but if they want the cash the bank doesn't just get to create it.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9qjv62",
                                                    "author": "D-6Hunter",
                                                    "score": 1,
                                                    "created_utc": 1653344328.0,
                                                    "response": "The money created in case of a loan is just a number on the balance sheet. It’s all digital. There is way more digital USD EUR and every other currency than actual money printed on paper. This money is not backed by anything, trust and governments forcing people to use it is the only thing that holds it together.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9qkae4",
                                                            "author": "SubstantialNinja",
                                                            "score": 1,
                                                            "created_utc": 1653344523.0,
                                                            "response": "That may be true and it certainly is true that there is more total dollars in accounts than in actual bills and coins but you are grossly misrepresenting the situation and terribly confused about the abilities of typical banking institutions to create money.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9oqk3y",
                    "author": "Nuclearstarfishicide",
                    "score": 13,
                    "created_utc": 1653316098.0,
                    "response": "US dollar decided to not have a burn function. It was replaced by the function print() in patch nixion.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9pfdef",
                            "author": "CapivaraMan",
                            "score": 1,
                            "created_utc": 1653326664.0,
                            "response": "this is the answer.\n\n   They're trying to remove liquidity now, let's see how it works. It will not, they'll probably print even more",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9oue99",
                    "author": "ykliu",
                    "score": 3,
                    "created_utc": 1653317799.0,
                    "response": "By setting notes on fire…\n\nOn a more serious note, one way the government ‘prints’ money is by buying up debt and issuing IOUs in return (like bonds). So I guess the government paying back it debt is the equivalent of ‘burning’. \n\nThis mechanism likely exists in some algorithmic stablecoin designs.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9p7j42",
                    "author": "Fayder00",
                    "score": 2,
                    "created_utc": 1653323387.0,
                    "response": "Get your money out of the banks…….",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9oqla3",
                    "author": "vitalyevodin",
                    "score": 1,
                    "created_utc": 1653316112.0,
                    "response": "they literally burn old cash\nin example they just take from market old dollar from 10/20/30/40 years old \none by one from banks",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9or65v",
                    "author": "Swimming_Ad2716",
                    "score": 1,
                    "created_utc": 1653316376.0,
                    "response": "You can imagine taxation as basically burning USD. Same result.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9osism",
                            "author": "Nada_Lives",
                            "score": 3,
                            "created_utc": 1653316973.0,
                            "response": "Not many are aware that the U.S. tax code (26 U.S.C.) is how they drain excess USD from the economy so that it will not inflate uncontrollably. The Federal Reserve is a private entity, the USD has no definition, anywhere, and the tax code has never been adopted into positive law. It's a private contract. So, of course I'm nuts for bringing this all up.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9pj996",
                                    "author": "towerninja",
                                    "score": 1,
                                    "created_utc": 1653328298.0,
                                    "response": "Lawful money vs legal tender",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9pm7ng",
                                            "author": "Nada_Lives",
                                            "score": 1,
                                            "created_utc": 1653329553.0,
                                            "response": "\"Legal tender\" and \"backed by the full faith and credit of the American Taxpayer\" are the two greatest advertising slogans in the history of the world.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9pori2",
                                                    "author": "towerninja",
                                                    "score": 1,
                                                    "created_utc": 1653330645.0,
                                                    "response": "Yeah my point is income tax is legal because we no longer have or use lawful money. The tax liability comes from acting as a bank and facilitating private credit. By using the legal tender therefore entering a private contract",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9pr5om",
                                                            "author": "Nada_Lives",
                                                            "score": 1,
                                                            "created_utc": 1653331679.0,
                                                            "response": "Not lawful, but legal because the Fed monetary system is contractual. The U.S. lawfully enforces contracts, and there ya go!\n\nNow two of us are nutzo.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9prg7z",
                                                                    "author": "towerninja",
                                                                    "score": 1,
                                                                    "created_utc": 1653331804.0,
                                                                    "response": "The Treasury use to issue Treasury notes. They were lawful money",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9prjtn",
                                                                            "author": "towerninja",
                                                                            "score": 1,
                                                                            "created_utc": 1653331847.0,
                                                                            "response": "Treasury notes also had a capped supply",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9oymko",
                    "author": "cryptolulz",
                    "score": 1,
                    "created_utc": 1653319643.0,
                    "response": "Simple, it goes to one of two burner addresses - Elon or Jeff's accounts.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9p1uyl",
                    "author": "wkw3",
                    "score": 1,
                    "created_utc": 1653321011.0,
                    "response": "Well, we've buried a few trillion dollars in the sand over the last decade for one.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9pthky",
                            "author": "lsmod1",
                            "score": 1,
                            "created_utc": 1653332677.0,
                            "response": "Escobar is that you?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9p6kdj",
                    "author": "Faustboar",
                    "score": 1,
                    "created_utc": 1653322985.0,
                    "response": "I'm no expert here, but my understanding is like this.\n\nTo increase money supply: The federal reserve prints USD, and uses that to buy debt (e.g. T-bills) from the US market. This increases the money supply, because that printed USD is now in circulation. \n\nTo decrease the money supply: The federal reserve sells debt back to the US market, taking the USD proceeds out of supply.\n\nQuantitative easing (QE) refers to increasing the money supply through the behavior described above--this method was the status quo until recently. Quantitative tightening (QT) is the reverse process, the selling of the debt instruments by the Fed in exchange for USD, which is no longer in supply.\n\nThere is also the matter of the Fed interest rates, which has a bearing on the value of these debt instruments, and the cost banks must pay to borrow money from each other. I believe that by increasing these interest rates, it makes it more expensive for banks to borrow money, and this means they are less likely to do so for investment purposes, thus siphoning liquidity from between banks.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9p7e97",
                    "author": "kevinono",
                    "score": 1,
                    "created_utc": 1653323331.0,
                    "response": "[https://www.investopedia.com/terms/o/openmarketoperations.asp#:\\~:text=Open%20market%20operations%20(OMO)%20refers%20to%20a%20central%20bank%20buying,to%20influence%20the%20money%20supply](https://www.investopedia.com/terms/o/openmarketoperations.asp#:~:text=Open%20market%20operations%20(OMO)%20refers%20to%20a%20central%20bank%20buying,to%20influence%20the%20money%20supply).\n\n\"Selling securities from the central bank's balance sheet removes money from the system\"",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9pi012",
                    "author": "BuyRackTurk",
                    "score": 1,
                    "created_utc": 1653327771.0,
                    "response": "> Can any one explain to me how does the U.S dollar burning mechanism works?\n\nAnytime someone repays a debt, the repaid money is defacto burnt and deleted.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9poi1l",
                    "author": "BigPlayCrypto",
                    "score": 1,
                    "created_utc": 1653330531.0,
                    "response": "🆙",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9pvbox",
                    "author": "Be_Free_For_All",
                    "score": 1,
                    "created_utc": 1653333470.0,
                    "response": "Also keep in mind the U.S dollar is a debt instrument, and NOT a store of value.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}