{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uz3p8i",
            "title": "If Bitcoin is a hedge against inflation, then why isn't Bitcoin's value going up right now? One of the main selling points of Bitcoin is that it supposedly protects against inflation of fiat money.",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uz3p8i/if_bitcoin_is_a_hedge_against_inflation_then_why/",
            "author": "Extremely-Bad-Idea",
            "created_utc": 1653673667.0,
            "score": 0,
            "num_comments": 124,
            "subreddit": "Bitcoin",
            "selftext": "I am confused, so can someone please explain this?  Speak slowly as if you were talking to a small child or golden retriever.  If Bitcoin is supposed to protect against inflation, then why isn't Bitcoin going up during our current bout with inflation?  In fact, most cryptos are down substantially (50% - 90%) over the last year.",
            "stickied": false,
            "comments": [
                {
                    "id": "ia81j3b",
                    "author": "MadMaxwell92",
                    "score": 15,
                    "created_utc": 1653675810.0,
                    "response": "Bitcoin was drastically over sold for the last couple years as shitcoin developers scammed billions of dollars from people new to this emerging world of consensus based digital currencies. \n\nWhen bitcoin was young and a millionaire bought or sold btc it made the price jump up or down. Now as the market has grown millionaires don’t make price jumps but billionaires and institutions do. Eventually as the market gets bigger even billionaires and institutions won’t be able to budge the price and only central banks and governments will. It’s all relative to market size and size of market participants",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia8nenb",
                            "author": "Spl00ky",
                            "score": 0,
                            "created_utc": 1653685682.0,
                            "response": "I think you mean overbought",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia98ui4",
                                    "author": "iTz_Swine",
                                    "score": 2,
                                    "created_utc": 1653696302.0,
                                    "response": "Bitcoin can’t be overbought!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia7xeqk",
                    "author": "Think_Cattle3004",
                    "score": 32,
                    "created_utc": 1653674017.0,
                    "response": "Bitcoin is a commodity that does hedge against inflation over the long run but like stocks has pullbacks, corrections, and bear markets that bring the value down. Additionally, we are potentially entering into the crypto winter phase which typically occurs 2 years before the next halving cycle, and during this time it’s more of a game of accumulation during value declines that will ultimately act as a hedge against inflation when Bitcoin rallies next halving cycle (in 2024).\n\nBuy and HODL, this is the way.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia7yps7",
                            "author": "WritingFun8769",
                            "score": 6,
                            "created_utc": 1653674577.0,
                            "response": "this is the way",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia8161g",
                                    "author": "Viziyzak",
                                    "score": 7,
                                    "created_utc": 1653675651.0,
                                    "response": "It sure is the way",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia7wyiq",
                    "author": "freddiemack1",
                    "score": 9,
                    "created_utc": 1653673823.0,
                    "response": "The whole market is ass right now. Everything is down.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia876ai",
                    "author": "Nohoula",
                    "score": 10,
                    "created_utc": 1653678287.0,
                    "response": "Two years ago bitcoin was 10k, now it’s 28k.\nSo inflation is between 10%-15% and bitcoin is up over 280%\nSeems like a great hedge against inflation.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia8d4y8",
                            "author": "ApprehensiveSorbet76",
                            "score": -1,
                            "created_utc": 1653680958.0,
                            "response": "Shouldn't it have gone up 20-30% over those same two years?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia8t22z",
                                    "author": "88eth",
                                    "score": 1,
                                    "created_utc": 1653688394.0,
                                    "response": "Bitcoin is a free market. Gold isnt. So gold has been touted as a inflation hedge but if you look back over the last 10 years it did not really work. Now if you look at Bitcoin for 10 years what do you see?\n  \nMaybe some day Bitcoin would gain the moment the USD inflates more, and be like a 1:1 hedge by the second on inflation. But thats kinda the point. Bitcoin can be so many things in the future thats why its a highly speculative asset as of now, and just because the market does something does not mean its smart or saying much. Just as if you buy gold, you probably dont care where its in a month you care that it goes up long term right?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia8vehg",
                                            "author": "ApprehensiveSorbet76",
                                            "score": -1,
                                            "created_utc": 1653689529.0,
                                            "response": "When I look at bitcoin over the past 10 years I see a speculative bubble.  I don’t understand why bitcoin should be an inflation hedge even in theory.  Is it just because of the software enforced 21 million cap?  There seem to be too many weaknesses in this cap for it to be the basis of a strong argument.  Why do people think it’s an inflation hedge?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia8xxzm",
                                                    "author": "ikkatop",
                                                    "score": 1,
                                                    "created_utc": 1653690775.0,
                                                    "response": "It's taking back control, away from governments who have shown they're not really too bothered how their monetary policy affects you negatively.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "ia8yzky",
                                                            "author": "ApprehensiveSorbet76",
                                                            "score": 1,
                                                            "created_utc": 1653691289.0,
                                                            "response": "Isn’t it just giving control to the Bitcoin Network?",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "ia9iats",
                                                                    "author": "ikkatop",
                                                                    "score": 1,
                                                                    "created_utc": 1653701322.0,
                                                                    "response": "The Bitcoin network it's controlled by everyone collectively rather than a handful of officials.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "ia9mldx",
                                                                            "author": "ApprehensiveSorbet76",
                                                                            "score": 1,
                                                                            "created_utc": 1653703585.0,
                                                                            "response": "Ok, so you give control to the group of strangers who make up this network.  It’s still giving up control.  It could be the government, bitcoin network, private individuals, banks, I’d rather use a money that doesn’t require giving up control to anyone.  I want to be the one who sets the fee, and I want to be able to set it to zero and determine the exact time of a transaction based on my decisions, not some third party network or organization.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "ia91hrm",
                                                    "author": "Vinnypaperhands",
                                                    "score": 0,
                                                    "created_utc": 1653692533.0,
                                                    "response": "When I look at Bitcoin the past ten years I see an amazing new emerging form of currency the world has never seen before. It has gained an incredible amount of adoption since its inception and can only grow from here. It is a new form of decentralized immutable global and secure money. The fact that it has been around for this long and is still the biggest and strongest network globally.... I'd say there are very very very few weaknesses considering ya know... It's still here and working with no central control... But I guess that's just me. Bitcoin has risen millions of percentages since its inception, seems like a pretty good hedge to me.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "ia98uh8",
                                                    "author": "ProfessionalPizza463",
                                                    "score": 0,
                                                    "created_utc": 1653696301.0,
                                                    "response": "You just don't understand the technology.  That's all.  When paper money was first introduced lots of people didn't understand that either.  They preferred riding around with extras horses and donkeys to carry all their gold.  Lol. There's always going to be advancements in technology.  There's people who take the time and learn to adapt and there's people who rebel and try to suppress.  In the end technology always wins, it's just a matter of time.  It's very simple",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "ia9934z",
                                                            "author": "ApprehensiveSorbet76",
                                                            "score": 1,
                                                            "created_utc": 1653696428.0,
                                                            "response": "Few understand",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "ia8tq3i",
                                    "author": "Nohoula",
                                    "score": 1,
                                    "created_utc": 1653688717.0,
                                    "response": "Bitcoin will turn inflationary once mainstream, but it will be a very low inflation rate.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia8w47e",
                                            "author": "ApprehensiveSorbet76",
                                            "score": 1,
                                            "created_utc": 1653689876.0,
                                            "response": "I think so too.  The current inflation is what pays the miners.  If inflation drops too low then miners will experience a pay cut and lose interest.  This will jeopardize the security of the entire system and put pressure on the protocol to raise the block reward.  Miners have an important role in the network and cutting their pay in half every 4 years is only OK as long as token price grows faster.  Eventually these cuts will sting and create a lot of infighting and tension.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia999uh",
                                                    "author": "Nohoula",
                                                    "score": 1,
                                                    "created_utc": 1653696527.0,
                                                    "response": "The mining difficulty adjusts too.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "ia99k5f",
                                                    "author": "ProfessionalPizza463",
                                                    "score": 1,
                                                    "created_utc": 1653696677.0,
                                                    "response": "This is backwards.  The miners rewards/ halving every 4 years is what creates the bull and bear markets.  Not the other way around.  Electricity costs are the biggest concern for miners. Not price of the coin.  You lack the understanding of mining because you have never done it.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "ia9a3d3",
                                                            "author": "ApprehensiveSorbet76",
                                                            "score": 1,
                                                            "created_utc": 1653696957.0,
                                                            "response": "Electricity costs are not a concern if the price of the coin always rises.  Even if I mine at a loss now, if price goes up I can just hang on to those coins and sell later.  Besides, what pays for electricity?  Mining reward.  Mining reward is based on price.  Based on your mining experience how does price not affect your profitability?  I don’t understand what you mean by that.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "ia9bfqp",
                                                                    "author": "ProfessionalPizza463",
                                                                    "score": 1,
                                                                    "created_utc": 1653697668.0,
                                                                    "response": "This is what I'm talking about.  Your clueless. Don't be a know it all at something you've never done.  You don't get paid in cash to mine bitcoin.  Your electricity bill needs to be paid immediately or they will simply shut the power off. Only morons mine bitcoin and immediately sell their reward to pay for their electricity costs and pay capital gains tax.  All mined bitcoin is an immediate taxable event.  Like I said before electricity is the biggest concern when mining.  Go buy some ASIC machines and try it.  When your elec. Bill goes up over $500 or $600 in one month you'll understand what I'm saying.  Stop pretending like you have ever mined anything.  Go try it in real life.  I can't explain everything but there's so much more",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "ia9d51n",
                                                                            "author": "ApprehensiveSorbet76",
                                                                            "score": 1,
                                                                            "created_utc": 1653698574.0,
                                                                            "response": "If you don’t sell your mining proceeds to pay for electricity, then how do you do it?  You said if you don’t pay the 600 bill then the power gets shut off.  But you also save all the coins you get?  Do you take out loans or something to pay the bills?  And if the price of BTC drops, the value of your savings drops too and the immediate cash value of your earnings fall too.  So if you earn 800/mo using 600 in elec when price is 69k, when price drops to 30k don’t your earnings drop to 400/mo?  Price has a direct impact on your profitability and whether mining is worth it at all.  You are going to have a real struggle during the next bear market if you don’t understand the importance of price on mining profitability.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "ia9eilc",
                                                                                    "author": "ProfessionalPizza463",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653699309.0,
                                                                                    "response": "Wrong.  Your earnings have not risen or dropped at all because you have not sold.  You still have the same amount of BTC if it's worth a dollar or a million dollars.  You lack the understanding of any of this.  Miners are not concerned with current market prices.  It's irrelevant.  Miners are only concerned with electricity costs and the current mining difficulty hash rate. You are not a miner.  You are a consumer.  This is why you are only concerned/ focused in buying and selling prices during a bear market.  The only advice I have for you is buy the bear and sell the bull.  Not the other way around.  Miners continue mining no matter what.  Bears and bulls are irrelevant.  This is all old news.  Your just new to crypto that's all.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "ia9fdxf",
                                                                                            "author": "ApprehensiveSorbet76",
                                                                                            "score": 1,
                                                                                            "created_utc": 1653699772.0,
                                                                                            "response": "Where do miners get the cash to pay their bills?  You still haven’t explained that.  Marathon mined a bunch of BTC when price was 69k and they didn’t sell.  Now price is way down and they are way underwater and their stock is tanking.  I don’t understand why you think this is ideal.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "ia9a67e",
                                                            "author": "ApprehensiveSorbet76",
                                                            "score": 1,
                                                            "created_utc": 1653696996.0,
                                                            "response": "Buying and selling create the bull and bear markets.  This is how all markets work.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "ia9bte4",
                                                                    "author": "ProfessionalPizza463",
                                                                    "score": 1,
                                                                    "created_utc": 1653697872.0,
                                                                    "response": "Not when there's a limited supply.  Supply and demand will always win.  Look at the current housing market.  It's at an all time high during a major recession. There's a shortage of houses for sale.  Supply and demand bud.  Learn about it!",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "ia9dnhq",
                                                                            "author": "ApprehensiveSorbet76",
                                                                            "score": 1,
                                                                            "created_utc": 1653698850.0,
                                                                            "response": "Yes, it’s supply AND demand.  Bitcoin price is falling and it’s not a sudden increase in supply.  It’s a sudden drop in demand.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "ia9ewtt",
                                                                                    "author": "ProfessionalPizza463",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653699522.0,
                                                                                    "response": "This is incorrect.  Look at the amount in circulation and every second it gets closer to its hard cap of 21 million.  You won't even be able to buy it anywhere very soon.  The demand gets stronger everyday.  The amount available for purchases shrinks.  Your confused between price and demand.  These are two different things.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "ia9fmix",
                                                                                            "author": "ApprehensiveSorbet76",
                                                                                            "score": 1,
                                                                                            "created_utc": 1653699897.0,
                                                                                            "response": "Lol",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "ia994rs",
                                            "author": "ProfessionalPizza463",
                                            "score": 1,
                                            "created_utc": 1653696452.0,
                                            "response": "You mean deflationary. Learn supply and demand good sir",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia7y12f",
                    "author": "AshNjohn2019",
                    "score": 9,
                    "created_utc": 1653674284.0,
                    "response": "People are selling it as they need the fiat to cover the inflation proces around them",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia81jqu",
                            "author": "NJ0000",
                            "score": -3,
                            "created_utc": 1653675818.0,
                            "response": "And let’s be honest it’s not a hedge against inflation atm",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia85x4g",
                                    "author": "NiceDoctorBeam",
                                    "score": 7,
                                    "created_utc": 1653677725.0,
                                    "response": "Let's be honest: You apply short term thinking to **long term** things.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia7xbb0",
                    "author": "0delta",
                    "score": 33,
                    "created_utc": 1653673975.0,
                    "response": "It was $1000 five years ago and inflation was already a thing",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia83mp6",
                            "author": "llewsor",
                            "score": 14,
                            "created_utc": 1653676724.0,
                            "response": "same i’m pretty happy hodling since 2016",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia8fcjh",
                                    "author": "SickBoyNoFuture",
                                    "score": 5,
                                    "created_utc": 1653681956.0,
                                    "response": "Damn, you are smart guy",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia7xeaj",
                    "author": "509BandwidthLimit",
                    "score": 15,
                    "created_utc": 1653674012.0,
                    "response": "Woof ....woof,woof,  rggg, woof. ( for the golden retriever)",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia8a57u",
                            "author": "ICUpikachu",
                            "score": 12,
                            "created_utc": 1653679608.0,
                            "response": "I respect your opinion, but I don’t think getting your belly rubbed is relevant",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia7xy7a",
                    "author": "ReedB04",
                    "score": 5,
                    "created_utc": 1653674249.0,
                    "response": "Also, I think you should be dollar cost averaging into BTC at the same rate of inflation. Currently about 8% of your income or investable capital. At that rate you are “hedging”.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia80me9",
                    "author": "BusinessBreakfast3",
                    "score": 5,
                    "created_utc": 1653675415.0,
                    "response": "It does. \n\nLook at the 2 year chart. Or any other than the one you're looking at.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia7xm1l",
                    "author": "ReedB04",
                    "score": 11,
                    "created_utc": 1653674104.0,
                    "response": "You need to pull your chart back a little. BTC is up several hundred percent from the Covid low. It’s up several thousand percent over the last five years. Meanwhile the dollar or fiat is deflating at a rate of 7-8 percent per year in the same time frame. That is the definition of an inflation hedge. Also BTC is outperforming all stock indices.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia8nn2e",
                            "author": "Spl00ky",
                            "score": 0,
                            "created_utc": 1653685792.0,
                            "response": "YTD, bitcoin is down 39% while the S&P is down 13%. Inflation is at its highest in 40 years, why is bitcoin dropping on the news?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia8s5rd",
                                    "author": "Loafmanuk",
                                    "score": 3,
                                    "created_utc": 1653687962.0,
                                    "response": "Short term yes. Zoom out 12 years and let me know what you see.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia8xa88",
                                            "author": "Spl00ky",
                                            "score": 0,
                                            "created_utc": 1653690448.0,
                                            "response": "Nearly every asset is up significantly in the past 12 years. Moreover, inflation was nearly non-existent in the past 12 years.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia9a7du",
                                                    "author": "ProfessionalPizza463",
                                                    "score": 0,
                                                    "created_utc": 1653697013.0,
                                                    "response": "This is absolutley wrong.  Inflation has always existed.  Haven't you ever heard of the great depression? We've had a million recessions since fiat currency was introduced. WTH are you smoking bud? Crawl out from under your rock and learn some history please.  WTH have they been teaching you kids in school these days?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "ia9azcg",
                                                            "author": "Spl00ky",
                                                            "score": 2,
                                                            "created_utc": 1653697428.0,
                                                            "response": "[https://www.multpl.com/inflation](https://www.multpl.com/inflation)\n\nSee that? Even after massive QE in 2008, inflation never went above 3% The last time inflation was at 8% was 1982. Million recessions? More like 19--in the USA at least. And you know what? The economy has bounced back every time.",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "ia9bckz",
                                                            "author": "bensonchambers",
                                                            "score": 1,
                                                            "created_utc": 1653697623.0,
                                                            "response": "Fiat was first used by the Chinese in the 11th century.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "ia9f4un",
                                                                    "author": "ProfessionalPizza463",
                                                                    "score": 1,
                                                                    "created_utc": 1653699640.0,
                                                                    "response": "Very good research! Yes the Chinese created paper money.  Do you think now they created digital money also? AND BTC?",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "ia9hsqe",
                                                                            "author": "bensonchambers",
                                                                            "score": 1,
                                                                            "created_utc": 1653701053.0,
                                                                            "response": "Also, this comment of yours aged like milk.\n\n“And why not? Do you really believe it won't double, triple, or go to $500,000? I think if anyone buys bitcoin today at $50,000 and waits they could easily see a million ROI. it's basic economics supply and demand.  Hint: supply is running out y'all. Just nobody talks about it”",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "ia9ntra",
                                                                                    "author": "ProfessionalPizza463",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653704248.0,
                                                                                    "response": "Yes I strongly agree.",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "id": "ia9hc2v",
                                                                            "author": "bensonchambers",
                                                                            "score": 1,
                                                                            "created_utc": 1653700807.0,
                                                                            "response": "Not sure where you get “millions” of recessions from.\n\nThere were 12 in the 20th century, Great Depression happened when we were on the gold standard.\n\nFiat has 900 year history, Bitcoin has 13 year history.  Let’s tap the brakes.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "ia9mqjl",
                                                                                    "author": "ProfessionalPizza463",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653703662.0,
                                                                                    "response": "This is incorrect.  We were on the gold standard in the great depression (1929-1939) and Nixon took us off the gold standard in 1971 and the world followed three US dollar under the Bretton Woods agreement.  Only then after 1971 was fiat implemented.  Not 900 years. Lol. Your statement contradicts itself.  What's next you'll try to compare us to the Roman empire? Banks have failed a lot more than 12 times.  This is complete FUD. Go research run on banks,  when and why there federal reserve was created and who actually owns them.  The fiat system is beyond primitive and so isn't burning oil. Pumping brakes only leads to stagnation and death.  We must accelerate and evolve because change is the only constant",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "ia8yqui",
                                    "author": "ikkatop",
                                    "score": 1,
                                    "created_utc": 1653691170.0,
                                    "response": "You're being very selective to make your point. \nJust zoom out.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia96uyv",
                                            "author": "Spl00ky",
                                            "score": 2,
                                            "created_utc": 1653695270.0,
                                            "response": "You do realize that inflation was at its lowest levels while bitcoin was taking off right? Now inflation is at 40 year highs and bitcoin is dumping on the news.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia9em1b",
                                                    "author": "feyyd",
                                                    "score": 2,
                                                    "created_utc": 1653699362.0,
                                                    "response": "You are making a bunch of terrible assumptions, main one being that current pricec of BTC is market value.\n\nSpeculation is the dominating short term force for BTC.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "ia9ev2b",
                                                            "author": "Spl00ky",
                                                            "score": 0,
                                                            "created_utc": 1653699496.0,
                                                            "response": "I would imagine it would be safe to assume that bitcoin would go up on the news of 8% inflation",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "ia9fk24",
                                                                    "author": "feyyd",
                                                                    "score": 2,
                                                                    "created_utc": 1653699861.0,
                                                                    "response": "Markets and economics don't work overnight.  You have a fundamental lack of knowledge of market forces.\n\nYou are hyper-focused on short term news and thinking it will affect price.  Right now all markets just crashed.  BTC is considered a risk asset.  Because all markets crashed, everything else is cheap, people sell risk assets and invest in cheap non-risk assets or hold cash.\n\nThe most recent price action is related to the ending of quantitative easing and perhaps starting quantitative tightening.\n\nThe people who properly hedged, hedged into BTC in 2020-2021, and dumped near the ATH all the way to now.  What you are experiencing is the people who hedged correctly, selling to the dummies that think inflation hedge is guaranteed money when inflation is high.\n\n&#x200B;\n\nSame people will accumulate under 30k (as an inflation hedge yes!) and they will sell off at the next ATH when inflation has pumped the markets to excess again.\n\nCurrently, the bears are trying to predict the bottoms and get better DCA than 29k BTC.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "ia9g996",
                                                                            "author": "Spl00ky",
                                                                            "score": 1,
                                                                            "created_utc": 1653700229.0,
                                                                            "response": "I think you have misread my comment as *me* thinking bitcoin is an inflation hedge. I'm pointing out exactly what you have stated. I also believe bitcoin is a risk-on asset.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "ia9ae8w",
                                            "author": "ProfessionalPizza463",
                                            "score": 1,
                                            "created_utc": 1653697115.0,
                                            "response": "Bitcoin was down 40% yesterday.  Hedge funds were up 2% yesterday.  I'll make my life long investing decisions based upon that window.  Thank you sir",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia88yhx",
                    "author": "dancrypted",
                    "score": 3,
                    "created_utc": 1653679084.0,
                    "response": "If you bought when they actually inflated the monetary supply (beginning 2020), you would be well in profit.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia8bs52",
                    "author": "Brettanomyces78",
                    "score": 3,
                    "created_utc": 1653680348.0,
                    "response": "Everyone is so damned focused on the day to day, short term.  Don't look at anything lower timeframe than monthly candles.  Quarterly is even better.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia81x61",
                    "author": "AskALettuce",
                    "score": 2,
                    "created_utc": 1653675980.0,
                    "response": "Bitcoin is clearly not an inflation hedge over the short-term. Maybe over the long-term it will do better, like gold.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia842mc",
                    "author": "llewsor",
                    "score": 2,
                    "created_utc": 1653676917.0,
                    "response": "you can’t control people that trade stocks from trading in crypto too. \n\nbitcoin is a hedge but it’s overwhelmed with degenerate gamblers that have no idea the value of what they are trading for worthless fiat money.  \n\nmore long term investors are taking positions (nations, high net worth individuals, corporations) and the short term traders are getting rekt and either leaving or becoming long term hodlers. the price volatility will stabilize over the next 10 years as the market matures.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia864k3",
                    "author": "Fine-Artichoke-7485",
                    "score": 2,
                    "created_utc": 1653677819.0,
                    "response": "Bitcoin hodlrs asking 'wtf with this post?'",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia881zk",
                    "author": "dig_bick_super_man",
                    "score": 2,
                    "created_utc": 1653678679.0,
                    "response": "Why doesn’t it just always go up? If you look ay the last 3 mins it’s UP, the last 3 months, it’s DOWN, the last 3 years it’s UP, the last 5 years, it’s UP, the last 8 years, is UP, the last 11 years, it’s UP… so compare that to the dollar in the same time frames and you’ll find that it very much is a hedge.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia89o03",
                    "author": "ThotDoge69",
                    "score": 2,
                    "created_utc": 1653679396.0,
                    "response": "Ahhh yes, the day to day specialist.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia8bqqj",
                    "author": "TenshiS",
                    "score": 2,
                    "created_utc": 1653680330.0,
                    "response": "What time frame are you considering when talking about inflation?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia8czs4",
                    "author": "Ok_Aerie3546",
                    "score": 2,
                    "created_utc": 1653680893.0,
                    "response": "It is a good hedge. But the people who buy it when the cpi has already reached the top are making investment decisions too late. \n\nThe people who front ran the cpi. That is bought bitcoin in 2020, seeing the government spending and expecting inflation are the ones that got rewarded.\n\nPeople who bought in nov 2021 when cpi hit 8.5 were too late to make a decision.\n\nBitcoin is not some cpi etf that it moves exactly along the cpi. Some investors front run others and some just buy after looking at the news headlines.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia8eipw",
                    "author": "JSammut29",
                    "score": 2,
                    "created_utc": 1653681588.0,
                    "response": "We already ran when they unleashed the money printer. Inflation might be hot right now, but markets discount the future, so that was already priced in. If anything, due to fed tightening, usd is getting stronger (google dxy) so makes sense that we'd see the rally before, and the pullback now. If you believe fed tightening will successfully stop inflation whilst upholding us economy, don't buy bitcoin now.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia8i25j",
                    "author": "Advanced_Shoulder_56",
                    "score": 2,
                    "created_utc": 1653683193.0,
                    "response": "Zoom out bro :)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia8laxl",
                    "author": "uncontrollableop",
                    "score": 2,
                    "created_utc": 1653684691.0,
                    "response": "markets can stay irrational longer than you can stay solvent.  prices of all things are ultimately unpredictable because they are based on the actions and choices of human beings.  anyone who claims to be able to predict prices is lying or retarded. \n\nhowever if you zoom out beyond the 1 minute charts, you'll see obviously bitcoin isn't losing purchasing power at all, and in fact is on an epic decade long rally, averaging returns higher than available literally anywhere else in the world.  \n\nand the fundamental mechanics in terms of supply, as well as the ethics of equal access to bitcoin obviously make it superior to holding fiat, which is quite literally blood money.   that doesn't mean the prices people offer will meet your expectations, but where on earth do prices do that?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia8lk11",
                    "author": "MichaelAischmann",
                    "score": 2,
                    "created_utc": 1653684811.0,
                    "response": "MARKETS TRADE FUTURE, not the present. The markets believe we've seen the highest rates of inflation (in the western world) for now. Central banks are raising interest rates. The markets are expecting lower demand for an inflation hedge.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia8qpru",
                    "author": "ABBDRUMS",
                    "score": 2,
                    "created_utc": 1653687266.0,
                    "response": "No asset just always goes up forever. On longer timeframes, Bitcoin has always gone up so far but on lower timeframes, it is a rollercoaster of ups and downs. The reason it is considered a hedge against fiat inflation is because it is hard coded to issue new coins at a very specific rate, with a very specific cap at 21m. All fiat currencies can be printed at the flip of a switch by the decisions of just a few people. Bitcoin is the only money you cannot make more of out of thin air whenever you want to.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia90ofm",
                    "author": "Vinnypaperhands",
                    "score": 2,
                    "created_utc": 1653692124.0,
                    "response": "Here lemme help. Bitcoin is a new global decentralized borderless immutable form of money. People are very dumb and it takes awhile for the masses to wake the fuck up. The internet didn't become popular overnight, it took a while. This too will take some time. So be happy the price is stupid under valued and your future self will be happy",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia85qsv",
                    "author": "NiceDoctorBeam",
                    "score": 2,
                    "created_utc": 1653677647.0,
                    "response": "Bitcoin and inflation are both **long term** things, to which you are applying short term thinking.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia8o3uc",
                            "author": "Spl00ky",
                            "score": 0,
                            "created_utc": 1653686017.0,
                            "response": "If you bought bitcoin around $69k, I doubt you'll see a return that outpaces inflation",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia8p4m5",
                                    "author": "NiceDoctorBeam",
                                    "score": 2,
                                    "created_utc": 1653686505.0,
                                    "response": "See?  More short term thinking.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia8xfwb",
                                            "author": "Spl00ky",
                                            "score": 1,
                                            "created_utc": 1653690525.0,
                                            "response": "Long term guarantees nothing. The concept of long term investing applies to investing in a broad index fund where surviorship bias allows the index to trend up over time. Moreover, if the fund pays a dividend, that can be reinvest for compound growth over time.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia91qml",
                                                    "author": "NiceDoctorBeam",
                                                    "score": 1,
                                                    "created_utc": 1653692658.0,
                                                    "response": "The phrase \"long term\" applies to many things, not just index funds.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "ia96qzv",
                                                            "author": "Spl00ky",
                                                            "score": 1,
                                                            "created_utc": 1653695214.0,
                                                            "response": "Would going long on Enron, [pets.com](https://pets.com), tulips, or some shitcoin like terraluna help?",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "ia970w2",
                                                                    "author": "NiceDoctorBeam",
                                                                    "score": 1,
                                                                    "created_utc": 1653695356.0,
                                                                    "response": "> The phrase \"long term\" applies to many things, not just index funds.\n\nFor example, \"**long term** health consequences.\"",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "ia97jcu",
                                                                            "author": "Spl00ky",
                                                                            "score": 1,
                                                                            "created_utc": 1653695621.0,
                                                                            "response": "It's a common fallacy to assume going long on any singular asset will generate a return or prevent you from losing money. Bitcoin is no different given that it is a singular asset exposed to various idiosyncratic risk factors. As I pointed out, going long on Enron would not have given you a return.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia7wxqp",
                    "author": "SmoothGoing",
                    "score": 2,
                    "created_utc": 1653673815.0,
                    "response": "Do not fall for random narratives about what bitcoin is or should be.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia7yd06",
                    "author": "ReedB04",
                    "score": 2,
                    "created_utc": 1653674425.0,
                    "response": "Currently the reason BTC is going down in the short term is that investors are worried and are taking risk off or taking profits.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia8586s",
                    "author": "Keith_Kong",
                    "score": 2,
                    "created_utc": 1653677419.0,
                    "response": "Bitcoin is a ***trade*** against inflation. When people see inflation coming, they buy Bitcoin. Those who realize inflation is always happening are always buying Bitcoin.\n\nThese two parties combine to create the price of Bitcoin at any given time. For those looking to hedge against spikes with inflation (like we see now) they are predicting that it will come by looking at the fact that the fed is buying shit tons of bonds, lowering interest rates, and flushing money into the system. So they front run the trade.\n\nBy the time inflation actually starts showing up in prices, the trade has already been made. Now that inflation is here, they take their profits to secure their trade against rising inflation.\n\nTLDR: Bitcoin is a liquid asset subject to volatility. It will never directly respond to inflation readings but will ultimately protect you over longer periods.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia7xm6e",
                    "author": "txiao007",
                    "score": 1,
                    "created_utc": 1653674105.0,
                    "response": "It is just another traceable equity.  Money is moving out of BTC apparently",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia7yvfh",
                    "author": "Haut-Brion",
                    "score": 1,
                    "created_utc": 1653674646.0,
                    "response": "Why isn’t Bitcoin going up? Dude it’s at $30k. Think about that for a second. While then dollar continues to devalue a Bitcoin is worth what a brand new car is worth. The relationship between bitcoins value v. The dollars value doesn’t have to be one where if the dollar depreciates then Bitcoin has to appreciate. We’re witnessing how a simple retention of value in a market where other currencies depreciate is enough to signal it superiority.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia7x6wn",
                    "author": "BTC-maxi",
                    "score": 0,
                    "created_utc": 1653673923.0,
                    "response": "A small number of people know what Bitcoin is and a large number of people don't. It will change with time and regulatory clarity.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia7xsap",
                            "author": "LuKeNuKuM",
                            "score": 2,
                            "created_utc": 1653674179.0,
                            "response": "This. IMO It's going to take a lot time (many many years) if it's to become stable and a true hedge against inflation. Only when enough people are saving into it and not seeing it as an investment vehicle for fiat might this happen.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "ia81ko6",
                            "author": "Trivin0_Trevin0",
                            "score": 1,
                            "created_utc": 1653675829.0,
                            "response": "I'm not entirely sure that's the case anymore. It's been more and more \"mainstream\", especially since the last all time high. I guess \"a large number of people don't\" fully understand what it is, but one can even imagine regulatory clarity in some key countries in the near future.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia7xkl9",
                    "author": "Nada_Lives",
                    "score": 1,
                    "created_utc": 1653674087.0,
                    "response": "Selling points? Who, but the fiat banking cartel \"sells\" Bitcoin?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia7zxyd",
                    "author": "Linkaiser",
                    "score": 1,
                    "created_utc": 1653675115.0,
                    "response": "Even if we assume that Bitcoin's core value is being a hedge against inflation, that still doesn't mean that Bitcoin will always be a highly valuable asset. There is way more than goes into price than inflation.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia80ehc",
                    "author": "wesblog",
                    "score": 1,
                    "created_utc": 1653675317.0,
                    "response": "The market is irrational.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia80mx7",
                    "author": "HiBoobear",
                    "score": 1,
                    "created_utc": 1653675422.0,
                    "response": "Because inflation is decreasing. Or at least the governments are actively trying to decrease it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia86erp",
                    "author": "Vast_Square_1824",
                    "score": 1,
                    "created_utc": 1653677948.0,
                    "response": "Wahhhhhh wahhhhhh why is Bitcoin going down? Wahhhhh eahhhh cash out and go to your girlfriends house spread her wings and smash you nose in it and breath in long and hard…",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia8cagg",
                    "author": "ma0za",
                    "score": 1,
                    "created_utc": 1653680576.0,
                    "response": "Where does it say a Inflation Hedge can never Go down in value? Zoom out buddy",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia8cib9",
                    "author": "igadjeed",
                    "score": 1,
                    "created_utc": 1653680674.0,
                    "response": "> If Bitcoin is a hedge against inflation\n\nBitcoin is not a hedge against inflation  \nFiat inflation is not relevant to Bitcoin",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia8gxnt",
                    "author": "Fancy_Dragonfruit696",
                    "score": 1,
                    "created_utc": 1653682680.0,
                    "response": "You have to be stupid to think $BTC is an inflation hedge.  If you're in reality and can see it, you'd know this.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia8kwcu",
                    "author": "hsmst4",
                    "score": 1,
                    "created_utc": 1653684502.0,
                    "response": "Most major portfolios are strictly governed by precise percentage allocations for each segment.  So if stocks/equities fall, then other sectors also get sold off to maintain those pre-defined percentages.\n\nThat's why all markets are correlated even if the underlying assets have nothing to do with each other.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia8rm0f",
                    "author": "Salt-Traffic59",
                    "score": 1,
                    "created_utc": 1653687695.0,
                    "response": "Anything scarce is good for inflation",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia8vqyh",
                    "author": "baboon2moon",
                    "score": 1,
                    "created_utc": 1653689698.0,
                    "response": "Wooof Woof wooof wof wof woff.. 🦮",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia8wv72",
                    "author": "ikkatop",
                    "score": 1,
                    "created_utc": 1653690240.0,
                    "response": "I'm going to say it's protection against your ( or any ) government suddenly deciding that their fiat currency is now  worthless. They're setting its purchasing power ( almost always to the downside ), so stepping outside of the fiat system and into BTC gives you the control, not them.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia97lwn",
                    "author": "Averybry",
                    "score": 1,
                    "created_utc": 1653695658.0,
                    "response": "The world is a little more complicated than “inflation is X%, inflation hedge go up X%+.” Particularly when looking at shorter time frames when other factors such as a hawkish Fed can impact the short term outlook of a “risky” asset like bitcoin. \n\nOver a long time horizon, I see bitcoin as a hedge against central banking policies, whether it’s flooding the system with cash or reigning it in when they get too carried away. We’re seeing the latter right now, but over a long time horizon the fiat money printer is too enticing for them to resist. On a long enough timeline, infinite fiat will exist, of which an infinite amount is yet to be printed, diluting it’s purchasing power in perpetuity. 21 million bitcoin will exist, of which 19 million are already in circulation, and the supply of new coins will be cut in half in 2024, again in 2028, and so on. Next time they crank up the money printer, and they will, bitcoin and its <21 million coins will be there to absorb that freshly printed fiat.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia9eu8a",
                    "author": "feyyd",
                    "score": 1,
                    "created_utc": 1653699483.0,
                    "response": "Translation: I went all-in at the top of a speculative market instead of entering slowly over time when prices were reasonable.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia9ivtr",
                    "author": "life762",
                    "score": 1,
                    "created_utc": 1653701629.0,
                    "response": "There is no such thing as a hedge against inflation that never loses value against an inflating currency. That's not a thing.\n\nYour expectation for what constitutes a hedge against inflation is so unrealistic that nothing meets your definition.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia7ww8z",
                    "author": "MrOptiX",
                    "score": -7,
                    "created_utc": 1653673796.0,
                    "response": "It’s never really recovered after that shit stain musk fucked with it.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia7x1eg",
                            "author": "MakeU4fit",
                            "score": 2,
                            "created_utc": 1653673858.0,
                            "response": "I am glad. Giving me a opportunity to load up my bags. 👌🎇🎆",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "ia7yu6u",
                            "author": "ReedB04",
                            "score": 2,
                            "created_utc": 1653674630.0,
                            "response": "What do you mean?  It doubled in a few months after he announced Tesla bought BTC. It is currently back to roughly even from where he got in.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "ia805s5",
                            "author": "easyEggplant",
                            "score": 2,
                            "created_utc": 1653675211.0,
                            "response": "> It’s never really recovered\n\nDisagree, it's right back into the expected linear regression models (albeit on the low side).  70K currently was waaay to high.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia7z9zb",
                    "author": "bandoonparade",
                    "score": 0,
                    "created_utc": 1653674821.0,
                    "response": "That's because people think fiat debasement = inflation. It doesn't. Bitcoin protects against the former, not the latter. Nothing protects against the latter.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia83aak",
                            "author": "AskALettuce",
                            "score": 0,
                            "created_utc": 1653676574.0,
                            "response": "Did bitcoin protect against fiat debasement over the last six months? \n\nBTC has gone from $65,000 to $29,000, whilst $ printing continued as fast as ever.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia94g0s",
                    "author": "CHA05-R31GN5",
                    "score": 0,
                    "created_utc": 1653694034.0,
                    "response": "Bitcoin isn’t a hedge but was promoted by multiple people as one. There’s the problem. BTC is just another speculative asset based upon future demand, limited supply, and supposed increased utility in exchange.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}