{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uyzbe6",
            "title": "Can we keep posts on topic instead of letting this sub slide into a Conspiracy Machine?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uyzbe6/can_we_keep_posts_on_topic_instead_of_letting/",
            "author": "Awkward_and_Itchy",
            "created_utc": 1653661352.0,
            "score": 0,
            "num_comments": 7,
            "subreddit": "Bitcoin",
            "selftext": "It feels like every single day, this sub gets further and further from discussing Bitcoin and instead is being leveraged to shill WEF conspiracy bullshit.  There are subs where people can go to post that shit if they want it, but its not this one.",
            "stickied": false,
            "comments": [
                {
                    "id": "ia74j6f",
                    "author": "Nada_Lives",
                    "score": 1,
                    "created_utc": 1653662091.0,
                    "response": "The WEF? You will never find a more wretched hive of scum and villainy.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia767hh",
                    "author": "metal_bassoonist",
                    "score": 1,
                    "created_utc": 1653662798.0,
                    "response": "Those posts are very apropos. Are you saying the wef _isn't_ conspiring to do what those posts say? That's bold.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia76lso",
                            "author": "Awkward_and_Itchy",
                            "score": 1,
                            "created_utc": 1653662966.0,
                            "response": "Yes, I am saying the WEF has no plans to tattoo fucking barcodes onto our foreheads. \n\n\nI'm not here arguing if the WEF is bad or good or in the common man's best interest. \n\nI'm here asking that we keep the discussion on Bitcoin.  If you want to talk and read and conspire about the WEF, I'm sure there are a hundred subs, satire or not, where the discussion would be more relevant.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia76zbm",
                                    "author": "metal_bassoonist",
                                    "score": 1,
                                    "created_utc": 1653663121.0,
                                    "response": "Yea you're right. I'm sure they've never even heard of btc...\n\nDude, calm down. Let people talk. You can ignore it if you want to.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia74cbn",
                    "author": "NiceDoctorBeam",
                    "score": 1,
                    "created_utc": 1653662010.0,
                    "response": "WEF?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia74mf1",
                            "author": "Awkward_and_Itchy",
                            "score": 1,
                            "created_utc": 1653662128.0,
                            "response": "World Economic Forum.  It's just an example.\n\n\nI'm not trying to defend the WEG but the narrative that they want to microchip us and shit is getting more prevalent on this sub.   \n\n\nI get that BTC comes with some levels of anti-government sentiment but I'm seeing mass upticks in people spouting literal insane theories like the great reset.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}