{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ux08kf",
            "title": "Having a hard time DCAing with Strike, as you have to make a deposit every time you buy. Am I missing something here, or is Strike really not as convenient at DCAing as apps like Coinbase, Etc.?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/ux08kf/having_a_hard_time_dcaing_with_strike_as_you_have/",
            "author": "WanderingMako",
            "created_utc": 1653424157.0,
            "score": 1,
            "num_comments": 15,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9un3re",
                    "author": "Albo-LuckyBastard",
                    "score": 1,
                    "created_utc": 1653424251.0,
                    "response": "I use Binance, deposit via Sepa, and Auto Invest Option the best and cheapest way to DCA 👍🔥",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9un6yv",
                            "author": "WanderingMako",
                            "score": 1,
                            "created_utc": 1653424289.0,
                            "response": "I'll check that out. Thanks!",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9vamro",
                            "author": "coconutforall",
                            "score": 1,
                            "created_utc": 1653434694.0,
                            "response": "How do you then withdraw to a cold wallet? Is there an automated way? \nAlso, youdt pay withdrawal fees at every purchase?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9vhas3",
                                    "author": "Albo-LuckyBastard",
                                    "score": 1,
                                    "created_utc": 1653437867.0,
                                    "response": "Deposit fee wirh SEPA is 1€ and no fees for Auto Invest!\nWithdraw to cold wallet is as usual from Spot wallet!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9uuq21",
                    "author": "Amoci",
                    "score": 1,
                    "created_utc": 1653427513.0,
                    "response": "In Strike, at the bottom, tap the Bitcoin symbol.\n\nUnder the chart, tap the Buy button.\n\nChange the setting from One-time Purchase to your choice, hourly, daily, weekly, monthly.\n\nChange the amount to what you want to choose to DCA at the interval selected.\n\nYou must have funds available to fulfill buy orders just like 'Coinbaise, Etc.'",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9uv7g1",
                            "author": "Amoci",
                            "score": 1,
                            "created_utc": 1653427724.0,
                            "response": "Alternatively, you can tap the Profile symbol in the bottom right corner and select Direct Deposit.\n\nYou will be given a Routing Number and Account Number you can provide to your employer and have that portion received split into BTC or USD however you choose.\n\nYou can inform your employer that you want to add another bank account (Strike) and send 5% of your paycheck to this new account. Then, within Strike, you can designate the direct deposits received to be 100% in BTC. You are now DCA-ing 5% of your pay every payday.\n\nYou can play with the settings for different results.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9uvjoz",
                                    "author": "Amoci",
                                    "score": 1,
                                    "created_utc": 1653427875.0,
                                    "response": "OR!\n\nWith the 5% you now have direct deposited to Strike, you can do split, where 6.15% of whatever is direct deposited into your account is in Bitcoin, and the remainder is in dollars within the Strike App. Then you can take those dollars and send them straight to your lightning wallet and DCA on lightning.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9uvyes",
                                            "author": "Amoci",
                                            "score": 1,
                                            "created_utc": 1653428054.0,
                                            "response": "Then send those lightning sats to Muun lightning wallet then using Muun back to legacy.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9uwsj5",
                                                    "author": "WanderingMako",
                                                    "score": 1,
                                                    "created_utc": 1653428421.0,
                                                    "response": "Really appreciate the feedback Amoci!",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9uwmk1",
                            "author": "WanderingMako",
                            "score": 1,
                            "created_utc": 1653428348.0,
                            "response": "I don't recall having to go through so many steps when I was DCAing with Coinbase. Pretty sure I just made one \"weekly purchase\" and forgot about it. It took care of the rest. Like I was buying BTC with my bank account vs. having to transfer funds before purchase.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9uvfh9",
                    "author": "laziruss",
                    "score": 1,
                    "created_utc": 1653427823.0,
                    "response": "Are you actively employed or receive an income via direct deposit? They offer account numbers for direct deposit, I use it and it works great!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ux5k9",
                            "author": "WanderingMako",
                            "score": 2,
                            "created_utc": 1653428578.0,
                            "response": "Currently self employed. So maybe I'd just be best leaving it all to Coinbase like I have in the past. Less steps and I can just let it DCA until my busy season slows down.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9uyij0",
                                    "author": "laziruss",
                                    "score": 1,
                                    "created_utc": 1653429176.0,
                                    "response": "Might be best case. I did hear that Strike is working on automatic buys that do not require you to already have money deposited. Not sure why that isn’t easy for them to do lol. Maybe too many uncleared deposits for their liking",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9v0v6u",
                                            "author": "WanderingMako",
                                            "score": 1,
                                            "created_utc": 1653430202.0,
                                            "response": "That's awesome. Can't wait, as I love the simplicity of the app.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9viblh",
                    "author": "Vaginosis-Psychosis",
                    "score": 1,
                    "created_utc": 1653438358.0,
                    "response": "I just use Coinbase. I deposit a certain amount at the beginning of the month and then set it for a daily DCAmof $25.   \n\n\nI don't like having it come directly from my bank account because I get paid irregularly and so it might overdraw me if I'm not paying attention.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ux07rh",
            "title": "As Bitfinex invests in El Zonte Capital and El Salvador forges ahead with bitcoin inclusive monetary policy, U.S. Congress introduced S.3666 (ACES) Act as a dinosaur move against countries moving to include bitcoin. The U.S. gov should learn from Wyoming & El Salvador, to become bitcoin-inclusive.",
            "url": "https://bitcoinnews.com/president-of-el-salvador-bitcoin-is-fu-money/",
            "author": "pcvcolin",
            "created_utc": 1653424098.0,
            "score": 61,
            "num_comments": 10,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9whil4",
                    "author": "torontowatch",
                    "score": 3,
                    "created_utc": 1653456643.0,
                    "response": "American establishment hates freedom.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9wugch",
                            "author": "pcvcolin",
                            "score": 1,
                            "created_utc": 1653467013.0,
                            "response": "I feel like what we call \"America\" or \"American establishment\" is an overbroad term.  \n\nBut if you're referring to the current folks in the U.S. White House or in (most of) U.S. Congress, and the Canadian PM, Parliament, and Canadian courts as the \"American establishment,\" then yes, I'd agree.  Let's be sure to leave out Central and South American countries out of that broad brush \"American establishment\" term though, because there are certainly various Central and South American countries that (while they haven't always been fond of freedom throughout history), are nonetheless approaching the issue with a more open mind these days.  \n\nI'm not sure if this helps as an objective measure but, the Human Freedom Index is available here:\n\n[https://worldpopulationreview.com/country-rankings/freedom-index-by-country](https://worldpopulationreview.com/country-rankings/freedom-index-by-country)\n\nI think there may be problems with the Human Freedom Index.  For example, look at how high Australia is ranked.  Yet anyone who is tracking what's going in in Australia knows that there is a severe decay in freedom in Australia and it's been that way for some time.\n\nAnd Canada shows as having a higher freedom level than Finland or Australia, but that doesn't make any sense given that Canada has basically become a dictatorship.  \n\nSo, maybe the Human Freedom Index really isn't that great a measure.  But it's interesting to look at.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9uyrvm",
                    "author": "BitcoinUser263895",
                    "score": -2,
                    "created_utc": 1653429288.0,
                    "response": "This article is mostly Bukele tweets or people tweeting about Bukele tweets. \n\nMaybe because he's the only press allowed in El Salvador.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9vl4od",
                            "author": "Class_war_soldier69",
                            "score": 7,
                            "created_utc": 1653439695.0,
                            "response": "So the US dont care about tyrants until they allow bitcoin in their country?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9vn4hx",
                                    "author": "BitcoinUser263895",
                                    "score": 0,
                                    "created_utc": 1653440638.0,
                                    "response": "The US has a long history of messing with El Salvador don't you worry. \n\nBukele's new oligarchy is a symptom of the previous oligarchy.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9voawu",
                                            "author": "Class_war_soldier69",
                                            "score": 5,
                                            "created_utc": 1653441200.0,
                                            "response": "US has a long history of messing with a lot of countries",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9w0lmu",
                                                    "author": "BitcoinUser263895",
                                                    "score": -1,
                                                    "created_utc": 1653447014.0,
                                                    "response": "Which has a long history of resulting in rulers like Bukele.\n\nWhich has a long history of turning bad.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9wxf6v",
                            "author": "pcvcolin",
                            "score": 1,
                            "created_utc": 1653469738.0,
                            "response": "What you're saying is not correct, because of the fact that information is available from all of the world, 24 / 7 in real time, over a thing called the internet, and there are plenty of journalists in El Salvador.   Whether you are a journalist in El Salvador hunting for various stories of personal interest or a digital content media producer developing crypto stories who lives there or anywhere else in the world, you're not cut off from the world and you are not alone.  (And the story I used as a link in my post is not merely \"Bukele tweets.\")\n\nBut it is correct that publication of stories about past events, such as the El Mozote massacre, [has come with a high price for journalists that are trying to continue to tell the truth years later](https://www.propublica.org/article/the-high-price-of-doing-journalism-in-el-salvador).  There has also been significant debate and concern (as there should be) about the difficulty of being able to report on gang issues in El Salvador since a law was passed that states “radio, television, written or digital media”  can get 15 years in jail for “the reproduction or transmission to the general population of messages or statements originating or presumably originating from said criminal groups, that could generate anxiety and panic in the population.” The measure also establishes prison sentences of 10 to 15 years for painting the sort of graffiti commonly used to mark gang territory in neighborhoods across El Salvador.\n\nThis is neither here nor there but it may help people who have not lived in El Salvador (I did, for several years) understand its complexity and the change it is going through.  El Salvador came out of a civil war in January 1992.  One of the things that, I think, helped combatants resolve their differences was the Salvadoran General Amnesty, but unfortunately, [that Amnesty was later declared unconstitutional in 2016](https://www.elsalvadorperspectives.com/2016/07/post-war-1993-amnesty-law-declared.html).  Before this happened, and indeed in anticipation of it, various people who had been combatants in El Salvador's civil war (who had committed no crime other than having been ordinary participants in that war), left the country rather than be potentially be prosecuted.  The El Salvador Peace Accords are now a bit over 30 years old.  President Bukele has openly criticized the Peace Accords (there are various Salvadorans who also criticize both the Peace Accords as well as anything related to the war itself, even those who were heavily invested in leadership roles during the war, and also there are various Salvadorans who appreciate that the Peace Accords accomplished something, so it's a mixed bag; there also are quite a few people who you could talk to who felt that the level of violence was worse initially following the conclusion of the war (because of the transition of then-unemployed soldiers into gangs) than it had been in their experience during the last part of the war, so again, trying to interpret what this means to anyone is difficult and complex.)  There isn't a simple way to analyze it, it may help simply to live it.  And if you've lived in the country for a few years then you know what it is like and you have a better appreciation for its complexity.  If you're staring from the outside in and trying to understand why President Bukele (or someone else) does what they do, it's much harder.  There is no easy answer.\n\nIn El Salvador, nothing is as simple as it seems. It's always better to listen and learn and wait for the back story to reveal itself. \n\nThink back to the history of the United States in the [30 to 40 year period after the conclusion](https://www.timetoast.com/timelines/american-civil-rights-timeline-1865-1895) of the [American Civil War](https://en.wikipedia.org/wiki/American_Civil_War).  There was nothing simple or straightforward about that.  In December 1865, the 13th Amendment was adopted, outlawing slavery or involuntary servitude except as punishment for a crime.  After the Compromise of 1877 led to the withdrawal of federal troops from the South, Democrats consolidated control of state legislatures throughout the region, effectively marking the end of Reconstruction, leading to a long period of horrible times that lasted almost to this day.  Indeed, just after 30 years following the conclusion of the American Civil War, on May 18, 1896, the Supreme Court delivered its verdict in Plessy v. Ferguson. In declaring separate-but-equal facilities constitutional on intrastate railroads, the Court ruled that the protections of 14th Amendment applied only to political and civil rights (like voting and jury service), not “social rights” (sitting in the railroad car of your choice).  Sadly, the Plessy v. Ferguson verdict enshrined the doctrine of “separate but equal” as a constitutional justification for segregation, ensuring the survival of the Democrats' Jim Crow South for the next half-century.  It would not be until the landmark case Brown v. Board of Education in 1954, at the dawn of the civil rights movement, that the majority of the Supreme Court would essentially concur with Harlan’s opinion in Plessy v. Ferguson. Writing the majority opinion in that 1954 case, Chief Justice Earl Warren wrote that “the doctrine of ‘separate but equal’ has no place” in public education, calling segregated schools “inherently unequal,” and declaring that the plaintiffs in the Brown case were being “deprived of the equal protection of the laws guaranteed by the 14th Amendment.”\n\nI imagine that it may take a while for the people of El Salvador to calibrate and change following the events of its particular civil war just as it took some time for the people of the United States to get to where we are now.\n\nWith that said, the United States has much to learn from El Salvador, specifically its monetary policy and also how the people there value family and work.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}