{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "us7p0d",
            "title": "The Bitcoin Standard instead of Gold Standard",
            "url": "https://www.reddit.com/r/Bitcoin/comments/us7p0d/the_bitcoin_standard_instead_of_gold_standard/",
            "author": "raVenwomBat",
            "created_utc": 1652860383.0,
            "score": 2,
            "num_comments": 3,
            "subreddit": "Bitcoin",
            "selftext": "Really compelled by Ammous‘ arguments for the inevitable backing of currencies by Bitcoin. \n\nI still have one big question however:\n\nWhy using Bitcoin over Gold? I‘m not really asking in terms of what would be better for the human race but more in terms of likelihood. \nWhy wouldn’t governments and central banks if pressured enough just go back to a gold standard? Because if they did, i fear for the future of Bitcoin. \n\nI for one am all on the idea of a bitcoin backed economy. This could be the end of so much war and suffering in the world. Such a grand idea…\n\nAnyways, give me your best takes!",
            "stickied": false,
            "comments": [
                {
                    "id": "i91sedc",
                    "author": "organizedRhyme",
                    "score": 1,
                    "created_utc": 1652860470.0,
                    "response": "i just really feel for people living in this paradigm",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i91ta1g",
                    "author": "GoingDeezNuts",
                    "score": 1,
                    "created_utc": 1652861284.0,
                    "response": "Bitcoin makes a lot more sense.   Gold is very heavy and expensive to store/protect/transfer across countries.  \n\nGold is Analog in a Digital World.  And I'm a Digital Girl.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i91v8rg",
                    "author": "vitalyevodin",
                    "score": 1,
                    "created_utc": 1652863124.0,
                    "response": "because they can’t cheat on bitcoin as they did every time on gold\n\nidea with gold was good and was working perfectly until they always ended up in create more gold from nothing, decreasing gold backup or make new coins from old coins with less gold\n\nso bitcoin/gold need for simple people to forget about all this financial lie and stuff and focus on what people want to do by selling their specialization for money that won’t break in few years and listen to their heart instead of fighting with inflation and all hidden cut-off your saving \n\nBitcoin is a protocol that provides fair rule of a game where there are no beneficiaries of cheating",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}