{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "urpgr7",
            "title": "How to decouple Bitcoin and USD?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/urpgr7/how_to_decouple_bitcoin_and_usd/",
            "author": "saintknicks405",
            "created_utc": 1652802666.0,
            "score": 7,
            "num_comments": 28,
            "subreddit": "Bitcoin",
            "selftext": "Pretty basic question that I haven't been able to find a satisfying answer to: given that the value of Bitcoin is usually expressed in terms of USD (at least here in the US, please excuse my ignorance if this is not the case where you are), how do you actually decouple the two? Remove the dollar, how much Bitcoin is an apple worth? A banana? Who makes that decision? It's unclear to me how to define it's value without relating it to some other already existing standard. \n\nNote: I have no fuckin idea what I'm talking about and this is probably a stupid question. I'm just curious to see how people that are passionate about crypto might explain this. \n\nThanks :)",
            "stickied": false,
            "comments": [
                {
                    "id": "i8ykhbx",
                    "author": "garrulous_theory",
                    "score": 7,
                    "created_utc": 1652803214.0,
                    "response": "Bitcoin is denominated in whatever the user is used to using in their own context. \n\nIn Europe, you don’t think in USD, you use EUR. \n\nMaybe someday bitcoin will be a global reserve currency and replace the petrodollar but most sovereign countries will still have their own currency.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8yma8j",
                            "author": "saintknicks405",
                            "score": 2,
                            "created_utc": 1652803968.0,
                            "response": "This makes sense. I was thinking more \"one world, one currency\", but that's probably too idealistic on my part. Thanks dude",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8yn5nq",
                                    "author": "Halo22B",
                                    "score": 3,
                                    "created_utc": 1652804331.0,
                                    "response": "That won't happen overnight....give it some time",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8z1i74",
                                    "author": "h0twired",
                                    "score": 1,
                                    "created_utc": 1652810079.0,
                                    "response": ">\"one world, one currency\"\n\nNot at 3-7 transactions per second",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8z6toq",
                                            "author": "Socialists-Suck",
                                            "score": 1,
                                            "created_utc": 1652812248.0,
                                            "response": "Oh ye of little faith. For truly, I say to you, if you have faith like a grain of mustard seed, you will say to this mountain, 'Move from here to there,' and it will move, and nothing will be impossible for you.\"",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8ysbk4",
                    "author": "FerrisMichaels",
                    "score": 6,
                    "created_utc": 1652806403.0,
                    "response": "Same thing that determines how many USD an apple is worth: the market.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8yw0vo",
                            "author": "saintknicks405",
                            "score": -2,
                            "created_utc": 1652807897.0,
                            "response": "Sure, but the market has already determined that BTC is worth ~$30k (today anyways), so if the dollar were to go away, would you expect that 1 BTC would still get you $30k worth of stuff (a new car maybe), or would you expect a whole new phase of price discovery? Say people have a general idea of what 1 unit of their currency will get them, and they know how many units of their currency they need to buy 1 BTC today. If you take away the underlying currency, I find it hard to believe that the resultant, market determined value of BTC wouldn't be at all influenced by what the value had been as expressed in fiat. Which is why I say they are coupled",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8yyiqv",
                                    "author": "Peter4real",
                                    "score": 6,
                                    "created_utc": 1652808894.0,
                                    "response": "I’m sorry to say that Americans are most often confused by the fact that just because something is priced/denominated in USD does not mean you can’t price it in apples, clam shells, euros, yen or whatever. \n\nBTC is not reliant on the USD, it’s just easier to estimate what it is worth, by using a unit of account such as a fiat currency.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8z7cv5",
                                            "author": "h0twired",
                                            "score": 1,
                                            "created_utc": 1652812465.0,
                                            "response": ">BTC is not reliant on the USD, it’s just easier to estimate what it is worth, by using a unit of account such as a fiat currency.\n\nThat is due to the fact that 99.999% of BTC that people buy is purchased on an exchange using FIAT currency.  Miners being the exception.  \n\nHowever even when you buy a mining rig ALL of the companies out there will tell you how long it will take for you to break even on the price you paid for it.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8yn7hf",
                    "author": "ergeha",
                    "score": 2,
                    "created_utc": 1652804351.0,
                    "response": "I'm not sure, but bitcoin is not coupled to the USD or any FIAT currency. The price of BTC is not determined by the price of a FIAT currency. You just pay for it in FIAT (if you buy it on a CEX, for example) \n\nIn a world without FIAT, the potential \"buying-power\" is determined by the market itself. If I'm selling apples for 1 BTC, as long as I'm not the only one selling apples, chances are someone will offer apples for 0.9 BTC. And so on and on until the price for apples, people are willing to pay/sell finds a \"balance\". \n\nI guess you don't even need the \"World without FIAT\" scenario for that to work. \nFIAT is just another number (or system) that represent the \"balanced\" market value for something. If you change the number, you don't automatically chance the value of something. Think of it as units: imperial and metric units are different, but the time needed for light to travel a distance of 2.54 cm or 1 inch is the same.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8yksl5",
                    "author": "VariousTransition795",
                    "score": 1,
                    "created_utc": 1652803342.0,
                    "response": "Simply look around...\n\nLet's take your banana example;  \nEuropean Union countries: EUR/Banana  \nCanada: CAD/Banana  \nRussia: RUB/Banana   \nEl Salvador: USD/Banana & Sats/Banana  \n\n\nOr if you prefer;  \nUSD pairing, outside of US is mostly for some sort of convenience when both parties don't want to deal with the other party currency.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8yn348",
                    "author": "vitalyevodin",
                    "score": 1,
                    "created_utc": 1652804302.0,
                    "response": "the problem that network where you can spend bitcoin for goods in still low\nin example I can set fixed price for BTC/banana let’s say just 100sats but the problem that if price BTC/USD goes down somebody may exploit my btc-banana price and buy more bananas for the same price in BTC but less price in USD and it was not a problem if it was my own banana tree but the problem\nif I need to restock bananas and be sure that banana stock point is accept BTC without bonding to BTC/USD exchange price \n\ni think that future btc grows and more btc users will accept btc as payment and will create opportunities to switch this behavior and make prices just simple in BTC(sats) without intermediate conversion to USD but this also means that you don’t need USD anymore if a lot of people accept bitcoin and happy with it",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ynbpy",
                    "author": "nullama",
                    "score": 1,
                    "created_utc": 1652804399.0,
                    "response": "The concept you're looking for is called [unit of account](https://en.wikipedia.org/wiki/Unit_of_account).\n\n> Money is generally never perfectly stable in real value which is the fundamental problem with traditional historical cost accounting which is based on the stable measuring unit assumption.\n> \n> The unit of account in economics suffers from the pitfall of not being stable in real value over time because money is generally not perfectly stable in real value during inflation and deflation. Inflation destroys the assumption that the real value of the unit of account is stable which is the basis of classic accountancy. In such circumstances, historical values registered in accountancy books become heterogeneous amounts measured in different units. The use of such data under traditional accounting methods without previous correction can lead to confusing -- (or even meaningless) -- results.\n\nThere's no perfect way of doing it. Countries usually tend to just use their own currency so the number of the money remains the same, but the price of the products change over time. \n\nWhenever you feel like your cost of living has increased while you acquiring the same stuff as before, you're experiencing this issue. Inflation.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ynrvz",
                    "author": "OrangeHODLr",
                    "score": 1,
                    "created_utc": 1652804580.0,
                    "response": "Before the dollar people traded in gold and silver and never thought about the price in currency because it was the currency.  Instead they knew how many ounces of a metal they could trade to get what they wanted and this could change over time.  If we just actually start pricing our goods and services in bitcoin rather than dollars people could trade directly in bitcoin without being concerned about what the dollar was doing.  Eventually this would cause it to decouple.  No one seems to want to actually this however and just treat bitcoin like a speculative asset class they hold in their portfolio instead.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8yvvph",
                    "author": "LucSr",
                    "score": 1,
                    "created_utc": 1652807838.0,
                    "response": "Just estimate how much joules per coin and think of what that amount of joules means to you after recalling some middle school physics.  Note that the moon in term of joules is real even when the fiat is dying and you see the moon in term of fiat.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8yzo2f",
                    "author": "donaudelta",
                    "score": 1,
                    "created_utc": 1652809352.0,
                    "response": "Maybe think of 10oz/BTC. An oz for a month of work. Something like that.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8z0kuw",
                    "author": "bittenbycoin",
                    "score": 1,
                    "created_utc": 1652809707.0,
                    "response": "Saying one bitcoin is trading for around 16.5 ounces of Schiff is useful to me.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8yoojl",
                    "author": "Nada_Lives",
                    "score": 0,
                    "created_utc": 1652804943.0,
                    "response": "From someone who is passionate about ~~crypto~~ Bitcoin, it's a very good question! Hundreds of thousands of people use the improper terminology of calling Bitcoin as Dollars, which causes millions of people to subsequently call Bitcoin Dollars too. Call them out on it and they'll say \"well you know what I mean!\"\n\nNo. Most people have no idea that Bitcoin is NOT Dollars, and that you cannot put Dollars into the Bitcoin chain. Bitcoin doesn't give a damn about how much Bitcoin \"costs\" in Dollars.\n\nOne Bitcoin equals one Bitcoin. When someone says otherwise, they are being FUD-spreading assholes. Edit: Tone it down, Nada! They are spreading FUD.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8z23ip",
                            "author": "h0twired",
                            "score": 1,
                            "created_utc": 1652810320.0,
                            "response": ">Bitcoin doesn't give a damn about how much Bitcoin \"costs\" in Dollars.\n\nAn apple doesn't care how much an apple costs either.\n\nHowever if you want an apple (or BTC) you still need to give someone cash to get some.\n\nSo until people start getting paid in BTC for the work they do at their job and that company gets paid by their customers in BTC, it will continue to be valued directly against a FIAT currency.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8z4pms",
                                    "author": "Nada_Lives",
                                    "score": 1,
                                    "created_utc": 1652811386.0,
                                    "response": "Until it isn't.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8ytiv9",
                            "author": "saintknicks405",
                            "score": 1,
                            "created_utc": 1652806882.0,
                            "response": "Sure, I get that conceptually. But, for example, take an online retailer that accepts payment in Bitcoin (which is happening right now). Presumably, they accept that payment because they can exchange the BTC they receive for whatever currency is actually broadly relevant and usable for them and their business. So the value of that Bitcoin relative to the underlying currency would matter in this case, wouldn't it? Practically speaking, the value of that BTC is defined wholly in the exchange rate between BTC and whatever their native currency is. \n\nIf the world were to switch to BTC as the global currency tomorrow and currencies like the dollar and euro just didn't matter anymore, would 1 BTC still buy you $30K worth of stuff, or would the market have to enter an entirely new phase of price discovery? These exchange rates already exist, so it's difficult for me to imagine that they wouldn't have ANY influence on the new accepted value of BTC if the world were to transition away from fiat. Hence me saying I feel they are coupled. \n\nNot a realistic scenario, obviously. Just something I was thinking about",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8yxziv",
                                    "author": "joesus-christ",
                                    "score": 1,
                                    "created_utc": 1652808674.0,
                                    "response": "This is the area that will blow adoption wide open but I cannot see how the move happens, either.\n\nLet's say I sell $20 t-shirts. I could accept 3k Satoshi, but regular people would rather pay using fiat.\n\nSo I could make it more tempting to customers and price the t-shirt as 2k Satoshi - with my absolute confidence that bitcoin is the future and I am going to be very wealthy by stacking sats...\n\n...but why would I accept 2k Satoshi when I could take $20 and buy 3k Satoshi with it?\n\nThere's a moment that needs to happen and my puny brain cannot understand how it will come about. Greed/logic is a very real hurdle.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8z478k",
                                            "author": "h0twired",
                                            "score": 1,
                                            "created_utc": 1652811179.0,
                                            "response": "Wide scale adoption on a retail level would require people having more BTC in their wallets than any FIAT currency.\n\nFor now BTC is a speculative commodity play which is held and valued against FIAT currencies like USD and EUR.\n\nSo when someone wants to buy a t-shirt they will pay BTC that is equivalent to the FIAT currency they are familiar with and what they are using for all of their other financial transactions.\n\nBut for now, given the volatility across all cryptocurrencies, it makes no sense to buy a t-shirt or pizza with BTC.  Until there is stability in the value of BTC and ease/efficiency of small transactions it will never see adoption on that level.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8z5r66",
                                                    "author": "joesus-christ",
                                                    "score": 1,
                                                    "created_utc": 1652811813.0,
                                                    "response": "Yeah this is the hurdle; when/how does that detachment occur 🤔\n\nAtm I buy things with bitcoin whenever I possibly can (eg LN with Muun to buy items from FB marketplace) and just restock whatever I spend... but that's not the way things should work, of course!",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i8yuv88",
                                    "author": "Nada_Lives",
                                    "score": 0,
                                    "created_utc": 1652807426.0,
                                    "response": "You are not alone in thinking this, but how about simplifying your question: Is the trade acceptable to you?  If so, do it. If not, don't. The price in shekels, or any other currency, is irrelevant.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "id": "urpesg",
            "title": "$3 Billion in Bitcoin Was Sold To Save the Ust Stablecoin From Collapsing",
            "url": "https://slashdotted.medium.com/3-billion-in-bitcoin-was-sold-to-save-the-ust-stablecoin-from-collapsing-7afa45ad21f6?sk=02b8e16b4124e9a85a61676d87bfb6d1",
            "author": "seomelet",
            "created_utc": 1652802520.0,
            "score": 32,
            "num_comments": 30,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8ykfh9",
                    "author": "SirSkittles111",
                    "score": 23,
                    "created_utc": 1652803194.0,
                    "response": "Its a 'mystery' how they ended up only getting 1.8 billion Ust, they should have far more in ust than they did in btc value. Something doesnt add up\n\nEither way, these algorithmic stablecoins have historically failed, every. single. time.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8ynbur",
                            "author": "RedditTooAddictive",
                            "score": 12,
                            "created_utc": 1652804400.0,
                            "response": "I'm sure they really tried, then they bailed and kept the rest, now they say let's put a system where we make a new coin so they will get their share too and can rug pull there also lmao",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8ynvzl",
                                    "author": "SirSkittles111",
                                    "score": 8,
                                    "created_utc": 1652804626.0,
                                    "response": "> now they say let's put a system where we make a new coin so they will get their share too and can rug pull there also \n\nIts easier to scam a man than to convince them that they've been scammed. \n\nPeople who lost to luna will lose again to Luna V2 or whatever the new plan is.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8zim47",
                                            "author": "RedditTooAddictive",
                                            "score": 1,
                                            "created_utc": 1652817072.0,
                                            "response": "Most likely, unfortunately",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8zhqi2",
                            "author": "OfficialMarsCurrency",
                            "score": 1,
                            "created_utc": 1652816711.0,
                            "response": "Yeah, $3B sold, $1.8B bought, wheres the other $1.2B?!?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8zhwf1",
                                    "author": "SirSkittles111",
                                    "score": 1,
                                    "created_utc": 1652816778.0,
                                    "response": "> $1.8B bought\n\n\nThats ***if*** ust was still pegged to the dollar but it wasnt, they were buying ust when it was sub 1 dollar. So its much less than 1.8B$ worth",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8zihat",
                                            "author": "OfficialMarsCurrency",
                                            "score": 1,
                                            "created_utc": 1652817018.0,
                                            "response": "This is true",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8z0cr4",
                            "author": "slyrip32",
                            "score": 2,
                            "created_utc": 1652809619.0,
                            "response": "Strange",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8zgnad",
                            "author": "cfdeveloper",
                            "score": 1,
                            "created_utc": 1652816262.0,
                            "response": "those slippage fees will kill ya!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8yv67v",
                    "author": "mrmishmashmix",
                    "score": 10,
                    "created_utc": 1652807551.0,
                    "response": "Misleading title. $3 Billion in Bitcoin was sold to save UST stablecoin whales from losing their shirt.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8yu9f4",
                    "author": "kuzkokronk",
                    "score": 6,
                    "created_utc": 1652807179.0,
                    "response": "Thanks for the cheap sats, UST!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8yj7mo",
                    "author": "CBScott7",
                    "score": 11,
                    "created_utc": 1652802692.0,
                    "response": "So it still collapsed",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8yqd60",
                    "author": "Nada_Lives",
                    "score": 11,
                    "created_utc": 1652805617.0,
                    "response": "Challenge: Name one currency \"backed\" by whatever, that hasn't failed. Failed to actually be backed.\n\nLooking at you, Mr. Dollar!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8yiz3x",
                    "author": "NiceDoctorBeam",
                    "score": 8,
                    "created_utc": 1652802596.0,
                    "response": "lol @ shitcoin owners",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8z6h4v",
                            "author": "coinjaf",
                            "score": 5,
                            "created_utc": 1652812108.0,
                            "response": "\"owners\" ??",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8zczub",
                                    "author": "DXBflyer",
                                    "score": 1,
                                    "created_utc": 1652814770.0,
                                    "response": "😂👆",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8yp7k8",
                            "author": "fawnside",
                            "score": 2,
                            "created_utc": 1652805154.0,
                            "response": "Harsh but true",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8yprnv",
                    "author": "MarkEMarkEMarkE",
                    "score": 3,
                    "created_utc": 1652805377.0,
                    "response": "Is anyone to explain unbiasedly what the point of stable coins are? Why not use actual USD? I don't get it and they now seem to be damaging reputation of bitcoin.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8z0eiu",
                            "author": "humansubjects",
                            "score": 4,
                            "created_utc": 1652809638.0,
                            "response": "It's like when you go to the casino and they give you chips instead of using cash. Except that casinos are required to actually have cash on hand for all the chips they issue out.\n\nAs far as damaging the reputation of bitcoin, it's all part of the learning curve. Stable coins, tokens, frameworks, nfts, and cryptocurrencies all get lumped together as crypto. Most people just really don't understand the difference and there's going to be a lot of really expensive lessons for people to learn in the next decade or so.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8yvnuj",
                            "author": "Bitcoin_Lurker",
                            "score": 3,
                            "created_utc": 1652807750.0,
                            "response": "I think because of the fact that you can’t use dollars in DEFI. They have to be in a stablecoin to be able to use them in different protocols. \n\nIt’s the only possibility why I would so it. \nMaybe somebody with more knowledge will help",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8yw3po",
                            "author": "Asum_chum",
                            "score": 6,
                            "created_utc": 1652807927.0,
                            "response": "I’ve heard people claim transferring between usd and crypto can take ages due to the dinosaur banking rails. Stablecoins offer an instant transfer. \n\nI don’t give a shit though because I’d not trading my bitcoin for any shitcoin",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8z12x8",
                                    "author": "NXCW",
                                    "score": 6,
                                    "created_utc": 1652809905.0,
                                    "response": "Where I live, we don’t have to report any crypto-to-crypto transactions to the tax people but we do have to keep track of those where fiat is involved, and then pay tax on any non-crypto profit made.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8yw7s4",
                            "author": "gandrewstone",
                            "score": 2,
                            "created_utc": 1652807972.0,
                            "response": "It is completely unknown how much actual USD is backing a coin like tether (USDT).  By backing wirh crypto, the idea is that anyone can look at the blockchain and see the backing.  Of course, that advantage bevomes a liability when everyone can see that a coin does not have enough value backing it.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8z3ymf",
                                    "author": "nyaaaa",
                                    "score": 0,
                                    "created_utc": 1652811081.0,
                                    "response": "> By backing wirh crypto, the idea is that anyone can look at the blockchain and see the backing.\n\nThere is no backing with crypto. Its just a shitty algo.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8yvjq9",
                    "author": "COgrown",
                    "score": 3,
                    "created_utc": 1652807704.0,
                    "response": "The most shilled pile of shit in recent memory.  Whodathunkit.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8yos4x",
                    "author": "Verallendingen",
                    "score": 2,
                    "created_utc": 1652804983.0,
                    "response": "helped...not.lmao shitcoiners 🤣",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8z9wrl",
                    "author": "wattumofficial",
                    "score": 2,
                    "created_utc": 1652813508.0,
                    "response": "Yet, UST still died and BTC is still alive.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8yjntk",
                    "author": "ShabbaLaFlare",
                    "score": 1,
                    "created_utc": 1652802874.0,
                    "response": "Still failed...",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8zi2jj",
                    "author": "Fit-Boomer",
                    "score": 1,
                    "created_utc": 1652816850.0,
                    "response": "Did it work?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8zinna",
                    "author": "hcollector",
                    "score": 1,
                    "created_utc": 1652817089.0,
                    "response": "Save?",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "urp9lv",
            "title": "First investment in Bitcoin",
            "url": "https://www.reddit.com/r/Bitcoin/comments/urp9lv/first_investment_in_bitcoin/",
            "author": "Ok-Seat3125",
            "created_utc": 1652802121.0,
            "score": 10,
            "num_comments": 20,
            "subreddit": "Bitcoin",
            "selftext": "I am 18 years old and I would like to make my first investment in bitcoin. I have been interested in bitcoin for a very long time now even long before I turned 18. Even though I am now legally allowed to invest whatever kind of money into whatever I want, I feel like investing a big amount of money into bitcoin is something I should discuss with my parents first. I have not yet spoken to them about it but I predict they will think of it as sketchy. My question is: How to best bring it up and convince my parents to approve me investing in bitcoin?",
            "stickied": false,
            "comments": [
                {
                    "id": "i8yieau",
                    "author": "03Oliver",
                    "score": 14,
                    "created_utc": 1652802359.0,
                    "response": "Don’t tell them. More trouble than it’s worth. They won’t be interested now but they would be in 10 years. Keep it to yourself",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8yisl4",
                    "author": "metalUFO",
                    "score": 6,
                    "created_utc": 1652802521.0,
                    "response": "If it’s your money do as you please with it. I’d personally make smaller purchases over time. No need to go all in. Especially if you’re holding for years to come. As with any investment be mentally prepared to lose it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8yknvu",
                    "author": "wanderingvpsaint",
                    "score": 6,
                    "created_utc": 1652803288.0,
                    "response": "Do not reply to anyone in DM. All of them are spammers. \n\nI would suggest to educate yourself as much as you can. \n\nPlay around with hot wallets and once you are confident buy cold wallet and store. \n\nAre your parents tech savvy? Will they understand? If yes, then tell them otherwise keep your long time savings in Bitcoin and expenses in fiat. \n\nLearn as much as you can. That’s the key. Don’t buy any other coins. Everything else going to zero eventually.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8z0jlq",
                    "author": "ShinySpines",
                    "score": 6,
                    "created_utc": 1652809694.0,
                    "response": "You’re 18, you don’t need anyone’s permission, unless you’re spending their money and they are expecting you to use it on something else.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8z142r",
                    "author": "TopEstablishment265",
                    "score": 4,
                    "created_utc": 1652809918.0,
                    "response": "Don't tell people.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i902rm9",
                            "author": "Woodpecker3453",
                            "score": 1,
                            "created_utc": 1652825634.0,
                            "response": "This is incredibly important.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8yqocd",
                    "author": "Nada_Lives",
                    "score": 4,
                    "created_utc": 1652805741.0,
                    "response": "Learn about the (any) subject first. Why do you call Bitcoin an investment, versus just a better currency?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8z47qz",
                            "author": "Ok-Seat3125",
                            "score": 1,
                            "created_utc": 1652811184.0,
                            "response": "That is actually a really interesting question. I do see the benefits of bitcoin as a currency. By transferring money from fiat to bitcoin now instead of in 10 years I expect/hope that the value of the money has increased compared to if I had kept the money as fiat. I think from that point of view I see it as an investment as it is saving over time to gain “interest”. (I know it is not what interest is but I hope you get what I mean)",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8z585l",
                                    "author": "Nada_Lives",
                                    "score": 1,
                                    "created_utc": 1652811601.0,
                                    "response": "I think that this is the healthy way to look at Bitcoin as an investment, its value as a currency.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8yl7gm",
                    "author": "The_cheesy_wiggle",
                    "score": 2,
                    "created_utc": 1652803515.0,
                    "response": "I had the same situation and my parents are skeptical of the markets in general. But i explained to my parents how bitcoin works (and just demostrated my understanding of bitcoin and crypto) and agreed i would invest ~£30 to test the waters. I did this because i personally was abit scared as it was my first investment but also to ease them into the thought of buying crypto. Then slowly i continued increasing the amount i invested as i learnt more about the space. Eventually they came to me asking if i could help them put some money in. It would be nice to get their approval but if you are 18, you should invest in what you believe in.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8z35b5",
                            "author": "Ok-Seat3125",
                            "score": 2,
                            "created_utc": 1652810740.0,
                            "response": "That is so cool that your parents are now asking you for advice haha. Thanks!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8yumxt",
                    "author": "hi3r0fant",
                    "score": 2,
                    "created_utc": 1652807332.0,
                    "response": "If it s your money buy and say it to no one.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8yzaqn",
                    "author": "misterjoego",
                    "score": 2,
                    "created_utc": 1652809207.0,
                    "response": "Don't invest more than you're comfortable losing. There's no guarantee with bitcoin or any cryptocurrency (though I feel pretty confident that BTC will continue to increase in value over time - but no one knows for sure). \n\nEither put in a lump sum that you can let sit for years, or DCA smaller amounts every week (or month, or whatever works for you).\n\nAs to your question about convincing your parents, the answer is: you don't actually need their approval. Congrats! You've reached adulthood and you are entitled to make your own decisions now!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8z6fsn",
                    "author": "ndgoLiberty",
                    "score": -1,
                    "created_utc": 1652812092.0,
                    "response": "If you live at their house and they pay your bills, or they pay for your college. If you’re buying bitcoin with that money instead of paying them for your shit then you’re indirectly stealing from them and putting it in bitcoin.\n\nIf you live on your own, then it’s your money use it when you need it.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8zdger",
                            "author": "03Oliver",
                            "score": 1,
                            "created_utc": 1652814958.0,
                            "response": "This is dumb, in my opinion.  \nHis parents chose to procreate. They are indebted to him, not the other way around.\n\nThere is no rule that says you have to GTFO when you are 18. Living with your parents is a good way to generate wealth without overheads before you go on to study or work whatnot.  \n\n\n'Indirectly Stealing' is laughable. Use protection if you don't want to pay for your offspring.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8zkv00",
                                    "author": "iammasvidal",
                                    "score": 1,
                                    "created_utc": 1652818001.0,
                                    "response": "Completely agree.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8zq3ma",
                            "author": "Itchy_Project5926",
                            "score": 1,
                            "created_utc": 1652820185.0,
                            "response": "What kind of backwords thinking is this.. it’s not 1979 anymore lol",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8zfaqr",
                    "author": "Lazy-Substance-5161",
                    "score": 1,
                    "created_utc": 1652815709.0,
                    "response": "You are old enough, decide for yourself. I wouldn't throw everything at once into btc though. Make a savings plan, some small amount you're comfortable  with every week. This way you buy the average price and you can buy some more if the price drops.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}