{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "usdurf",
            "title": "Anyone here remember this guy?",
            "url": "https://i.redd.it/awdvahois8091.jpg",
            "author": "Sirius-AB",
            "created_utc": 1652883108.0,
            "score": 5,
            "num_comments": 19,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i92qbuf",
                    "author": "vgrp1",
                    "score": 4,
                    "created_utc": 1652883192.0,
                    "response": "Open mouth, looks like they pooped their pants, crypto shiller on YouTube probably",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i92s58o",
                            "author": "Sirius-AB",
                            "score": 2,
                            "created_utc": 1652883994.0,
                            "response": "lol, I guess he was one of the first \"crypto youtubers\" in a sense, definitely not in the way you're probably thinking though.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i937jt7",
                    "author": "nullc",
                    "score": 4,
                    "created_utc": 1652890376.0,
                    "response": "He was still around as of two years ago, he partnered up with the infamous scammer and faketoshi Craig Wright: https://bitcointalk.org/index.php?topic=5147410.msg51224404#msg51224404\n\nBut then after BSV tanked he started hurling insults at Wright: https://bitcointalk.org/index.php?topic=5246331.msg54393395#msg54393395",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i93el8z",
                            "author": "Sirius-AB",
                            "score": 1,
                            "created_utc": 1652893197.0,
                            "response": "holy shit hahahaha this is comedy gold. aw fuck, my sides. thanks for posting this, I had no idea he even posted on Bitcointalk.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i93f3ly",
                                    "author": "nullc",
                                    "score": 2,
                                    "created_utc": 1652893398.0,
                                    "response": "I had no idea he was known anywhere except Bitcointalk!",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i93grpr",
                                            "author": "Sirius-AB",
                                            "score": 1,
                                            "created_utc": 1652894073.0,
                                            "response": "lol he used to make Youtube videos. Going from his profile date he joined Bitcointalk after getting attention on Youtube.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i93jydn",
                                                    "author": "nullc",
                                                    "score": 1,
                                                    "created_utc": 1652895361.0,
                                                    "response": "Anyone save any of his videos?  I'd kinda like to see one-- he was *super* obnoxious on bitcointalk and certainly contributed to me using it less.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i945enf",
                                                            "author": "mrchaddavis",
                                                            "score": 1,
                                                            "created_utc": 1652904060.0,
                                                            "response": "Someone reposted a couple.\n\nhttps://www.youtube.com/watch?v=6qSj24\\_E\\_lU\n\nhttps://www.youtube.com/watch?v=S3xhyj-e0Kk",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9476jp",
                                                                    "author": "nullc",
                                                                    "score": 1,
                                                                    "created_utc": 1652904790.0,
                                                                    "response": "LOL!  If I'd known about this I would have just responded to his posts with nothing but a link to the video.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i92wn8t",
                    "author": "pakna",
                    "score": 3,
                    "created_utc": 1652885900.0,
                    "response": "Rawdog, I remember him, he was bitcoin hater around 2011, poor guy",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i93441s",
                            "author": "Sirius-AB",
                            "score": 2,
                            "created_utc": 1652888967.0,
                            "response": "ah someone remembers. Yeah, I mean this guy must have regret everyday now. Was trying to find his old videos cause they were so funny, but can't find them anywhere.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i92wna9",
                    "author": "Frosty-Panic",
                    "score": 2,
                    "created_utc": 1652885900.0,
                    "response": "Who is he, an OG? Looks like he's posting from his parents bedroom.  HOpefully this guy bought a lot of BTC a long time ago...",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i933ryr",
                            "author": "Sirius-AB",
                            "score": 2,
                            "created_utc": 1652888829.0,
                            "response": "an OG hater that loved calling Bitcoin holders retards.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i93298c",
                    "author": "NibelheimIncident",
                    "score": 2,
                    "created_utc": 1652888209.0,
                    "response": "Bill Goldberg?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i933okr",
                            "author": "Sirius-AB",
                            "score": 2,
                            "created_utc": 1652888790.0,
                            "response": "lol he does kinda look like him.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i92u5zc",
                    "author": "Cointikka",
                    "score": 1,
                    "created_utc": 1652884860.0,
                    "response": "I have no idea, who this guy is or was?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i934mq6",
                            "author": "LockedOutBoy",
                            "score": 1,
                            "created_utc": 1652889180.0,
                            "response": "Posterchild for the Satoshi one liner. \n\n\"If you don't believe it or don't get it, I don't have the time to try to convince you, sorry\"  \n\nHe didn't get it nor believed.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i93agjg",
                    "author": "BashCo",
                    "score": 1,
                    "created_utc": 1652891552.0,
                    "response": "I ripped one of his videos from YouTube and still have it somewhere. Guy was a hilarious moron. Just an ignorant buffoon in every respect. I should see if his videos are still online so I can rip the rest of them just to demonstrate how idiotic some of these critics are.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i93e98s",
                            "author": "Sirius-AB",
                            "score": 1,
                            "created_utc": 1652893063.0,
                            "response": "if you have any of his video please upload them to Bitchute or something. 🙏 he deleted his channel multiple times I think.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "usdvi0",
            "title": "Ultimate Bitcoin Analysis - Prelude to the 3rd Crisis - Deep TA and Fundamental Research (videos & whitepaper)",
            "url": "https://rexdogtrading.com/ultimate-bitcoin-analysis/",
            "author": "xkavalis",
            "created_utc": 1652883166.0,
            "score": 0,
            "num_comments": 4,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i92zahx",
                    "author": "Nouranium",
                    "score": 1,
                    "created_utc": 1652887002.0,
                    "response": "Bit big-headed to call something the ultimate imo. TA is make-believe anyway.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i93d5oj",
                            "author": "xkavalis",
                            "score": 0,
                            "created_utc": 1652892626.0,
                            "response": "Big headed, nah, just having fun with it. Ultimate (half baked)... yeah that's completely big headed and super serious. Good info in there and I bet you made this comment before you even checked it out.\n\nTA is so make believe I'm able to consistently pull capital out of the markets each and every day. I prove it daily live just trading charts.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i92qktg",
                    "author": "coinfeeds-bot",
                    "score": 0,
                    "created_utc": 1652883305.0,
                    "response": "tldr; Welcome to the Ultimate (half baked) Bitcoin Analysis. Everything shared on this page is the results of my work on creating a deep statistical and technical analysis on Bitcoin. This series has the following elements: Ultimate Bitcoin Analysis Document Introduction Video Prelude to Crisis 1 & 2 Successful 3 Crisis Example Video\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR.*",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "usdx43",
            "title": "My Fellow Canadian Bitcoiners",
            "url": "https://www.reddit.com/r/Bitcoin/comments/usdx43/my_fellow_canadian_bitcoiners/",
            "author": "Just1_More",
            "created_utc": 1652883292.0,
            "score": 29,
            "num_comments": 43,
            "subreddit": "Bitcoin",
            "selftext": "I am very saddened by the Bitcoin conversations taking place on the Canada subreddit. The hate towards Bitcoin, the ignorance that I am witnessing there pains me.\n\nI want to help my Canadians understand money. I want them to understand how Fiat money works and why we are operating in a system which by design will always fail. I want to teach them how the fight is not Left vs Right, but Top vs Bottom. Teach them how if we can fix the money, we can fix the world. But I am overwhelmed by ignorance, people who think Bitcoin is an investment and do not understand how we are progressing through the evolution of what money is:\n\n1. Collectable\n2. Store of value\n3. Medium of      exchange\n4. Unit of account\n\nI am trying my best to help my Countrymates, but the FUD is strong, and the media has clearly done an excellent job at pushing false narratives. I hope we can help teach, use resources such as [endthefud.org](https://endthefud.org) to help.\n\nI want a better Canada, I want a better world, I want to take the money away from the governments.  Liberty for all.",
            "stickied": false,
            "comments": [
                {
                    "id": "i92vsbe",
                    "author": "bittercoin99",
                    "score": 10,
                    "created_utc": 1652885542.0,
                    "response": "The number of folks I come across who seem to believe they know what they're talking about, even though it's a total word-salad that almost immediately betrays their complete ignorance, is really disheartening.\n\nIt's one thing to be uninformed, but these folks have been conditioned to believe absolute nonsense about Bitcoin and the wider crypto space. And then they reinforce and defend this ignorance.  It really reeks of having been spoofed a narrative.\n\nYour site seems like it would be useful in those situations... If you want to link to some info that challenges their incorrect conclusions and subsequently collect a bunch of downvotes that is.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i92xdlt",
                            "author": "Just1_More",
                            "score": 1,
                            "created_utc": 1652886203.0,
                            "response": "Haha. That was me that sent you that link on the Canada sub. I posted it on my post here to. Good on you mate! it's not an easy path and we're getting a lot of shit thrown at us on the way.  But it is the way.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i92yewf",
                                    "author": "bittercoin99",
                                    "score": 1,
                                    "created_utc": 1652886632.0,
                                    "response": "I've had a bookmark folder full of links and such like that, but that page is so well organized... Great resource, thanks a bundle!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i93vmyx",
                    "author": "Hank___Scorpio",
                    "score": 4,
                    "created_utc": 1652900085.0,
                    "response": "I have no love for PP but watching all his opponents know nothing more than number go up number go down is pretty ridiculous.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i94qfhn",
                    "author": "BtcKing1111",
                    "score": 3,
                    "created_utc": 1652912922.0,
                    "response": "The Canada subreddit is run by bots. Just like Canada itself. Nothing to do but stack sats and watch it burn.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i95yz5b",
                    "author": "x2c3v4b5",
                    "score": 2,
                    "created_utc": 1652934803.0,
                    "response": "I don’t even try much anymore on the Personal Finance Canada or the Canadian Investor subreddit.\n\nI used to post on PFC quite often and try to educate; however, the sentiment is that I’m stupid and Bitcoin is a scam. \n\nI don’t care anymore. People will pay the price that they deserve when they finally realize what this stuff is about and try to buy some. Focus on you and keep on stacking sats. \n\nLet the people believe what they want and let them stay ignorant.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93dfu5",
                    "author": "Wolfos9",
                    "score": 4,
                    "created_utc": 1652892739.0,
                    "response": "I've tried speaking over there once or twice, as well as the Ontario sub... \n\nYou just get ganged up on and mocked until you stop talking.\n\nI can only imagine the pressure the pro Bitcoin politician is facing during this election season. \n\n(His Name escapes me right now.)\n\nIt seems over here Furries are more widely accepted than Bitcoiners.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i92ylej",
                    "author": "BitcoinWell",
                    "score": 3,
                    "created_utc": 1652886709.0,
                    "response": "Fully agree! Also thanks for the link, that's an awesome source of information.\n\nIts a new technology relative to anything else and is rather disruptive so it takes time but more and more people are realizing the power that bitcoin has for the future, its just a matter of time!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i94dar9",
                    "author": "PeterSchiffindisguse",
                    "score": 3,
                    "created_utc": 1652907289.0,
                    "response": "Canadian redditors are mostly bots and woke city dwellers that eat, sleep, and breath whatever CP24 and CBC tells them, so the real question is, why are you surprised? They have zero foresight or skepticism of the current narrative, and just parrot each other. Everyone buys Bitcoin at the price they deserve, so just ignore it, and know that the views they express on that sub are actually the minority.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i94j5im",
                            "author": "Just1_More",
                            "score": 2,
                            "created_utc": 1652909780.0,
                            "response": "To be fair I stopped frequenting that sub years ago. I was there today and saw a Bitcoin topic near the top... Entered and was very saddened to see what I saw in there.\n\nI'll never give up",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i95oab3",
                    "author": "SonicPearl1974",
                    "score": 2,
                    "created_utc": 1652928860.0,
                    "response": "I continue to do my part by shaking everyday with ShakePay.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i96lwve",
                            "author": "Just1_More",
                            "score": 1,
                            "created_utc": 1652953353.0,
                            "response": "328 day steak here. DCA stacking sats everyday",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i96mbgd",
                            "author": "Wolfos9",
                            "score": 1,
                            "created_utc": 1652953708.0,
                            "response": "Shaking every day? I haven't heard of that app, do you actually have to shake it or am I reading that way too literally.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i932dzc",
                    "author": "lgieg",
                    "score": 0,
                    "created_utc": 1652888263.0,
                    "response": "Your going to exhaust yourself. Canada is far too liberal and the liberal masses FUD btc constantly. Also Since the libs run Wall Street Canadians will never accept btc. Sounds terrible I know but the sooner realized you can then put your energy into more constructive avenues",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9400jk",
                            "author": "Succeeded-At-Failing",
                            "score": 3,
                            "created_utc": 1652901873.0,
                            "response": "The pure irony is liberal ideology is meant to be open to new ideas... I would say I’m slightly left of centre politically but I feel so lost now with the immediate hate and fear the left has shown towards bitcoin. Makes me sad, really.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i932pa2",
                            "author": "Just1_More",
                            "score": 1,
                            "created_utc": 1652888393.0,
                            "response": "As true as what you said may be... I will always view put some of my energy into promoting education.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i932zn3",
                                    "author": "lgieg",
                                    "score": 1,
                                    "created_utc": 1652888508.0,
                                    "response": "Good choice friend",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i933mje",
                            "author": "KirkwallRS",
                            "score": -1,
                            "created_utc": 1652888767.0,
                            "response": "Real and true. Source: I'm also Canadian",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i92rg2z",
                    "author": "EggandSpoon42",
                    "score": 1,
                    "created_utc": 1652883689.0,
                    "response": "I think the best way, if you’re a writer, is to write articles with how to use and the benefits while ignoring the fudsters. Even if you are speaking in contradictions to what that fud is. Nobody likes to hear that their thoughts are wrong.\n\nBut also, as an investor since 2012, I encourage you to ignore the fud yourself mentally and emotionally. \n\nThe way I see it, haters are gonna hate and the people who understand and participate are what makes the system stronger. \n\nAnd most importantly, the best thing you can do is vote vote vote. Look out for candidates who are against bitcoin and vote against them. Support candidates that are for what you believe in. (I don’t mean that carte blanche though, our stupid senator is all Yeehaw about bitcoin but destroying our state with his stupid religious antidotes, he can get bent.)",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i92ssrh",
                            "author": "Just1_More",
                            "score": 1,
                            "created_utc": 1652884277.0,
                            "response": "I agree with this, and I do exactly what you've outlined, (except I'm not much of a writer).  I let the FUD get me in 2013.... Took several years before I came back.  It only saddens me now, but does not influence me.\n\nI wish I could do more.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i92zgud",
                                    "author": "bittercoin99",
                                    "score": 2,
                                    "created_utc": 1652887075.0,
                                    "response": "I don't know if I could bring myself to vote for Poilievre, but I'm really hoping his points on Bitcoin and especially CBDC's lead to people demanding that the left start taking this seriously too.\n\nI really don't like the crickets from the Liberals and NDP on this topic. The boat is leaving, and we ain't on it.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9374yj",
                                            "author": "undercover_life",
                                            "score": 4,
                                            "created_utc": 1652890205.0,
                                            "response": "But our fearless leader says the buget will balance itself. No need for btc.\n\n  If we all put on a spiffy costume and say nice words the worlds problems will fix itself",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9454y4",
                    "author": "LordPrettyMax",
                    "score": 1,
                    "created_utc": 1652903952.0,
                    "response": "Your first point should be fungible instead of collectable. Collectable implies non fungible meaning they have value based on non fungibility. On a different note, you’re fighting a losing battle because I can promise you most of the people don’t understand how finance or banking works either. So you want people to learn about finance and banking and macro economics and then understand the problems with the traditional banking system and then learn how Bitcoin fixes those problems. Big lols dude that’s not gonna happen ever",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i947hoi",
                            "author": "Just1_More",
                            "score": 0,
                            "created_utc": 1652904918.0,
                            "response": "*Collectable - In the very first stage of its evolution, money will be demanded solely based on its peculiar properties, usually becoming a whimsy of its possessor. Shells, beads, and gold were all collectibles before later transitioning to the more familiar roles of money.*\n\n*Fungible - (an attribute) - one specimen of the good should be interchangeable with another of equal quantity. Without fungibility, the coincidence of wants problem remains unsolved. Thus gold is better than diamonds, which are irregular in shape and quality.*\n\nUnfortunately, you're right about the masses, most would rather blame the left or the right for their problems rather than step back and realize, both sides suffer... Maybe there is a different problem that needs to be solved?\n\nI'm going to keep trying, regardless of how much shit gets thrown at me.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i949x7g",
                                    "author": "LordPrettyMax",
                                    "score": 1,
                                    "created_utc": 1652905910.0,
                                    "response": "Hmmmm I guess you are right about collectibility but in reality neither Bitcoin, fiat or gold are collectable and they are all fungible. Very interesting",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i94b816",
                                            "author": "Just1_More",
                                            "score": 1,
                                            "created_utc": 1652906436.0,
                                            "response": "I'll be honest, I just went and took those quotes from the writing in, *the bullish case for Bitcoin.*",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i94itu1",
                    "author": "alxjnssn",
                    "score": 1,
                    "created_utc": 1652909638.0,
                    "response": "too much of a heavy lift to inform the ignorant. i checked some of the comments it’s not worth it. they’ll get it when it’s too late. spend time informing those who want to listen.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i94jkmq",
                    "author": "heysoundude",
                    "score": 1,
                    "created_utc": 1652909957.0,
                    "response": "I’m right there with you, my brother/sister/human!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i959flg",
                    "author": "Comfortable_Dress_21",
                    "score": 1,
                    "created_utc": 1652921820.0,
                    "response": "You can lead a horse to water but if it's not thirsty?\nFuck em\n\nIf people want to be poor/ignorant there is nothing. You can do.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i95lgvr",
                    "author": "thefullmcnulty",
                    "score": 1,
                    "created_utc": 1652927457.0,
                    "response": "It is Reddit though. There are a lot of agenda-shills here and also a disproportionate amount of people who are extremely biased toward whatever their propaganda outlets program them with. They will tow the line for party narratives without ever looking into the subject beyond what was shouted on the television or in articles.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i92yz89",
                    "author": "Nada_Lives",
                    "score": 0,
                    "created_utc": 1652886871.0,
                    "response": "Simply USE Bitcoin as a currency with the others that do get it, then smile like a Salvadoran when they wonder why you're doing so well.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i92zd8t",
                            "author": "Just1_More",
                            "score": 1,
                            "created_utc": 1652887034.0,
                            "response": "Yes I agree, but the part of me that wants to see the world improve wants to do more.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9390zq",
                                    "author": "Nada_Lives",
                                    "score": 1,
                                    "created_utc": 1652890975.0,
                                    "response": "I just watched this from another thread. [https://www.youtube.com/embed/Jx-QWOHuug0](https://www.youtube.com/embed/Jx-QWOHuug0)\n\nThis is how we improve. Peacefully. Lawfully.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i94j7g8",
                            "author": "alxjnssn",
                            "score": 1,
                            "created_utc": 1652909803.0,
                            "response": "in canada barter transactions require capital gains calculations. cra is throttling adoption. no one in canada will use it to transact with if they have to pay 25-27% tax on any gains occured and then report all your transactions come tax season.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9520n0",
                                    "author": "Nada_Lives",
                                    "score": 0,
                                    "created_utc": 1652918321.0,
                                    "response": "Bitcoin knows nothing of any of this. It doesn't even know that Canada exists.\n\nYou might say that Bitcoin doesn't care.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i93zd4z",
                    "author": "dupleVe",
                    "score": 0,
                    "created_utc": 1652901612.0,
                    "response": "don't try and convince people ... everyone buys in at the price they deserve. Canadians will only realize the value of a decentralized finite asset once they look at their grocery bills.. or once trudeau freezes their bank accounts",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i940hz2",
                    "author": "Dramatic-Cat4842",
                    "score": -1,
                    "created_utc": 1652902069.0,
                    "response": "Fidel Castro's son is the Prime Minister of Canada.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i94p56g",
                    "author": "NYKNYb",
                    "score": 0,
                    "created_utc": 1652912350.0,
                    "response": "I wouldn't blame the media too much mean people are clueless fucking idiots, what makes you think they're gonna understand bitcoin ?\n\nThey'll learn the hard way, when their joke of a financial system fails and rugpulls them.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i960izt",
                    "author": "Organic-Deer919",
                    "score": 0,
                    "created_utc": 1652935802.0,
                    "response": "Everyday I turn Canadian Dollars into Bitcoin is the next best day of my life. This country is going down the drain.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "usdtsf",
            "title": "Why is it only after people's alts get wrecked against Bitcoin that people realize they should be Bitcoin only?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/usdtsf/why_is_it_only_after_peoples_alts_get_wrecked/",
            "author": "massagingyou",
            "created_utc": 1652883026.0,
            "score": 137,
            "num_comments": 115,
            "subreddit": "Bitcoin",
            "selftext": "Some people have to learn the hard way that only Bitcoin is the way to go.  Everything else is gambling.  There is such a high chance the others won't be around in 5 years.\n\nPeople used to post those images of \"Wow it just keeps going up! LOL!\" and you warn them it won't always be like that and you get downvoted into oblivion.  Now you visit the same sections and it's depressing.",
            "stickied": false,
            "comments": [
                {
                    "id": "i92r2yt",
                    "author": "Rannasha",
                    "score": 85,
                    "created_utc": 1652883531.0,
                    "response": "Alts are more exciting for newcomers. People have heard the stories of early Bitcoin users becoming very wealthy and they want that as well. By getting in on the ground floor on the next big thing, not by hopping along for the ride for something already in motion.\n\nAlts also have much more marketing. Altcoin developers frequently actively search out media for coverage. Premined coins have a \"development fund\" that can be used to buy \"partnerships\". If you're crypto-curious, looking for profit and you see articles with titles like \"New altcoin XYZ now partnered with SomeCompany. Could it be the next big thing?\", then that's appealing. \n\nBitcoin, by comparison, is boring. In a good way, but still. It chugs along at a rate of 6 blocks per hour. It's reliable, but not flashy. There's plenty of development going on, but very little marketing.\n\nWhen everyone has their eyes on the moon, the flashy new altcoins look very good. But when things come crashing down, boring and reliable beats flashy every day of the week.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i93a3xz",
                            "author": "SailsAk",
                            "score": 19,
                            "created_utc": 1652891411.0,
                            "response": "TBF Alts can give much better returns in the short term. Of course then they get into timing the market and we’ve seen how that goes. I mine bitcoin, I’ve been buying bitcoin since 2016, I still place a few side bets on some Alts.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i93w8lz",
                                    "author": "whitslack",
                                    "score": 14,
                                    "created_utc": 1652900330.0,
                                    "response": "Ponzi schemes can give much better returns in the short term too. In my opinion, anyone playing with shitcoins should be treating them as Ponzis.\n\n(Note: I'm not equating shitcoins to Ponzi schemes, although some of them, such as Terra, are indeed structured as such and may even be tried as such in court.)",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i96jsxq",
                                    "author": "hotasanicecube",
                                    "score": 1,
                                    "created_utc": 1652951442.0,
                                    "response": "My buddy chased that dragon for the last couple years. Hit a lick now and then. Always calling asking what I thought about X. 💩. Have not heard from him in a while.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i94skx3",
                            "author": "Unusual_Exercise5219",
                            "score": 4,
                            "created_utc": 1652913899.0,
                            "response": "A good trick for newbies to know is this: any altcoin project that mentions having any \"partnership\" - it is susceptible to central points of failure.  This is because partnerships are for centralized entities.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i94nkt3",
                            "author": "Possible-Ad-7058",
                            "score": 2,
                            "created_utc": 1652911658.0,
                            "response": "People want to own a whole of something as well",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i96svkr",
                            "author": "Bitcoin__Hodler",
                            "score": 1,
                            "created_utc": 1652958837.0,
                            "response": ">  6 blocks per hour.\n\n*on average :)",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i96uxmu",
                                    "author": "Rannasha",
                                    "score": 1,
                                    "created_utc": 1652960193.0,
                                    "response": "Not even that. Since the network hashrate has been almost constantly increasing from day 1, the average time between blocks never settled on the 10 minute target value. Over the entire lifespan of Bitcoin, it's been more like 9.5 minutes between blocks on average. Or about 6.3 blocks per hour.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i92uond",
                    "author": "Thirdlegproduction",
                    "score": 29,
                    "created_utc": 1652885081.0,
                    "response": "Those people feel like they have missed out and their only shot at financial freedom is a lottery ticket in the form of an altcoin that goes up by 500x.\n\nUp until a year ago Bitcoin provided an average return of 200% a year since inception which i nice if you're already wealthy and you can 3x your $100k or $500k investment in a year on average but if you only have $1K at most which is actually too generous then you'd rather put it in some shitcoin as 3x $1K isn't going to change your life in any way.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i92vmoo",
                            "author": "fiercygoat",
                            "score": 16,
                            "created_utc": 1652885477.0,
                            "response": "$1k can still make a huge difference investing in Bitcoin if you have a long term mindset and knowing how powerful compound interest is",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i933p2e",
                                    "author": "Thirdlegproduction",
                                    "score": 18,
                                    "created_utc": 1652888796.0,
                                    "response": "Yes I made minimum wage and had 3 jobs to acquire $10K in a short amount of time which turned almost into $110K at its height last year by diversifying into altcoins.   \nRight now I'm back at square 1 or maybe 2 having lost 70% since ath.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i96sp9v",
                                            "author": "scabbymonkey",
                                            "score": 1,
                                            "created_utc": 1652958716.0,
                                            "response": "I am down 70% also. sold my alts in January at a 50% loss when  i decided to go with bitcoin. glad i did as all of those alts are down 70-90% now.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i96uf5a",
                                                    "author": "Thirdlegproduction",
                                                    "score": 1,
                                                    "created_utc": 1652959867.0,
                                                    "response": "It's all relative, we lost maybe $100K in unrealized gains while CZBinance lost 5 billion in unrealized gains and Do Kwan lost everything. I'm sure the market will bounce back up after the next halvening. I don't think I have a crypto problem though, just a cashflow problem so I'm back to grinding on my 3 jobs and putting everything in btc until the next halvening but if anyone is feeling generous, a little kindness from whales is always appreciated.\n\n3CpEh5z1dNR7cZTXVQPq49k8Fvvkac1MKK",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i94waw5",
                                    "author": "Pray4Buzz",
                                    "score": 3,
                                    "created_utc": 1652915624.0,
                                    "response": "No.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i93jxyq",
                            "author": "BuyRackTurk",
                            "score": 2,
                            "created_utc": 1652895356.0,
                            "response": "> Up until a year ago Bitcoin provided an average return of 200% a year since inception\n\nLol, no. Bitcoin languished for 3 long years after that boom in 2013. The winter of bitcoin dragged on for ages\n\nThen again after the 2017 boom, another even longer bitcoin winter came. \n\nIt was certainly not 200% a year for people who got in during either boom... which, by definition, is when most people got it.\n\nMost people have to have a horizon of at least 4 years to see it turn at least back to neutral, and longer to beat dollar inflation.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i94fji7",
                                    "author": "hob_goblin8",
                                    "score": 6,
                                    "created_utc": 1652908228.0,
                                    "response": "it’s an average.  it takes those down years and averages it against the big up years and you get the 200% figure",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i94mccf",
                                            "author": "BuyRackTurk",
                                            "score": 1,
                                            "created_utc": 1652911133.0,
                                            "response": "I agree... but you only get to see that glorious average in hindsight. So the people living though it dont get that luxury, unless they are patient.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i963dcw",
                                    "author": "ElephantsAreHeavy",
                                    "score": 1,
                                    "created_utc": 1652937742.0,
                                    "response": "Do the math. It is close to 200%.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i95st6r",
                            "author": "mgeyser",
                            "score": 1,
                            "created_utc": 1652931199.0,
                            "response": "That’s just because it had a ton of growth in the years after inception, which means nothing to people investing today. \n\nThe return in the last three years is far less than 200%. Probably something like 53%. \n\nMeanwhile people minted monkey pictures for $300 a little over a year ago and now have half a million.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i95z4eh",
                                    "author": "Thirdlegproduction",
                                    "score": 1,
                                    "created_utc": 1652934892.0,
                                    "response": "When I started accumulating bitcoin almost 5 years ago the price of 1 bitcoin was at $3000 and now it is at $30.000, that's almost a 10x or 1000% actually 900% / 5 = 180% yearly return on average. Still not bad. IF you started accumulating at $20K then yes it's more like 50%.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i92t2id",
                    "author": "dlq84",
                    "score": 17,
                    "created_utc": 1652884395.0,
                    "response": "Most people don't learn from other peoples' mistakes, they need to learn from their own.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i94t9ke",
                            "author": "Jtrosh",
                            "score": 4,
                            "created_utc": 1652914210.0,
                            "response": "They need to touch the stove to believe it is hot",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i92y9sm",
                    "author": "sykal",
                    "score": 23,
                    "created_utc": 1652886573.0,
                    "response": "it's a very similar process for pretty much anyone getting into crypto\n\n&#x200B;\n\n\\-want to get into market but fear they're too late for bitcoin\n\n\\-buy shitcoins\n\n\\-shitcoins fall\n\n\\-hate the crypto market for a bit\n\n\\-get back but bitcoin the primary holding by a large margin\n\n&#x200B;\n\neveryone is at some point in this process once they get into crypto",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i94c5vm",
                            "author": "esotericunicornz",
                            "score": 1,
                            "created_utc": 1652906820.0,
                            "response": "Bingo",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i93mvkj",
                    "author": "Vegas_42",
                    "score": 7,
                    "created_utc": 1652896525.0,
                    "response": "Only a fool doubts that BTC is king.\nEvery serious crypto portfolio should be based on BTC.\nBut some carefully chosen alts are a win and could be a booster for such portfolio.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i943p5y",
                    "author": "Alea_Iacta_Est21",
                    "score": 4,
                    "created_utc": 1652903366.0,
                    "response": "I’m learning the hard way, can confirm.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i943o33",
                    "author": "theSeanage",
                    "score": 3,
                    "created_utc": 1652903354.0,
                    "response": "Can’t speak for the late adopters to Bitcoin. But I still believe some projects to be better long term, I’m still holding. Could I be wrong? Sure. But I’m investing in what I feel comfortable losing so there’s that.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i96tpb5",
                            "author": "St3vion",
                            "score": 1,
                            "created_utc": 1652959390.0,
                            "response": "Yes. Yahoo was the shit until Google exploded. Nokia was king until the iPhone. Bitcoin is the king now but it certainly has its flaws I wouldn't be the least bit surprised if it got dethroned one day.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i93dwwb",
                    "author": "IntelligentBaseball6",
                    "score": 5,
                    "created_utc": 1652892927.0,
                    "response": "Lmao. I traded all of my alts to btc a few month ago and never look back.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i930egq",
                    "author": "Jezzes",
                    "score": 4,
                    "created_utc": 1652887453.0,
                    "response": "It's like the dotcom bubble. Tons of morons bought up domain names when they should have bought the companies supporting the underlying technology",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i95fh4u",
                            "author": "rudebwoy100",
                            "score": 1,
                            "created_utc": 1652924624.0,
                            "response": "So don't buy BTC and buy Coinbase instead?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i93f9s8",
                    "author": "Environmental_Ring93",
                    "score": 2,
                    "created_utc": 1652893466.0,
                    "response": "What would you say is the EASY way to learn this?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93si46",
                    "author": "Lewzer33",
                    "score": 2,
                    "created_utc": 1652898794.0,
                    "response": "We all gotta grow up eventually.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9481r6",
                    "author": "5liveR",
                    "score": 2,
                    "created_utc": 1652905148.0,
                    "response": "bc of **greed** ... the pain of a loss its a journey everyone has to go through on its own",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i937669",
                    "author": "RecommendationUsed31",
                    "score": 6,
                    "created_utc": 1652890219.0,
                    "response": "Its not the problem of buying alt coins. It the idea it will keep going up.  My plan for altcoins. If it goes up to say 5x. I sell half.  It goes to 10x I sell more.  20x. More.  Etc. I do not keep coins in the hope if 100x. The best I've ever done was right around 150x. I sold 50% at 150x. The token has now dropped back to the original price.  Any I had left got sold on the way down.  Im not afraid to sell.  That is why people get wrecked. They only think moon or more when the atmosphere is good enough.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i95utek",
                            "author": "Lagavulin",
                            "score": 1,
                            "created_utc": 1652932308.0,
                            "response": "How’s that working for you?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i92w68g",
                    "author": "Kooky_Organization30",
                    "score": 4,
                    "created_utc": 1652885703.0,
                    "response": "I mean I made 100x more off altcoins than Bitcoin and have invested a tenth of the amount but saying that Bitcoin is the future. Altcoins are just a lottery ticket.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93mhx9",
                    "author": "Desperate-Army3618",
                    "score": 2,
                    "created_utc": 1652896375.0,
                    "response": "Alts give the most potential for profit, bitcoin wont do a 100x any time soon.\n\n1k is only 9 doubles away from a 1m, btc wont do that.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i92tnws",
                    "author": "myironcity",
                    "score": 2,
                    "created_utc": 1652884645.0,
                    "response": "Just wait until they all figure out that if Bitcoin doesn’t go up their alts don’t go up duh 🙄 Why do you think crypto.com has a Bitcoin chart, because Bitcoin is the market leader, and everything follows it. I have alts but the majority of my money is going to Bitcoin with the economy turndown. Economy goes up I’ll put a little more in alts.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i92qsn6",
                    "author": "HlIlM",
                    "score": -6,
                    "created_utc": 1652883404.0,
                    "response": "If there really is a decentralized future, it will be built on a coin other than bitcoin.  BTC may hold value or appreciate, but if we are discussing new money serving as primary denomination for daily transactions, BTC is technically incapable of that role.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i93n0io",
                            "author": "cpt_charisma",
                            "score": 4,
                            "created_utc": 1652896580.0,
                            "response": "There is a lot of this sort of thinking.  It's usually based on some FUD someone heard about why Bitcoin can't work.  They don't bother to look into it further and just assume it's true.\n\nThe fact is that Bitcoin doesn't have any major technical barriers to overcome anymore.  There is still quite a bit of work to do to make it easier.  This is just a matter of time.\n\nBitcoin has a massive lead in number of holders, people who accept it and companies and individuals working to build on and improve it.  Overtaking it would require something 10x better at this point.  Oh, and Bitcoin is open source, so if you have a 10x advantage, we can steal it :D",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i93y6tl",
                                    "author": "HlIlM",
                                    "score": -1,
                                    "created_utc": 1652901128.0,
                                    "response": "The most obvious insurmountable flaw is the fixed supply.  Exactly what would deliver the 100x moonshot if BTC replaced the dollar, euro, yuan, yen and pound collectively.  At a very early point in that process, a decentralized economy built on bitcoin would collapse in deflation.\n\nThe economic disaster of the great depression was caused by ~7% deflation per year for 3 years.  That occurs at about at about 0.23% of the distance to the moonshot of 100x.  No matter how great a financial attempt is made to absorb that pressure, the journey is too long and the leverage necessary too high.  The more the value of BTC climbed, the more it would be hoarded and the greater the crisis would become.  \n\nAt best bitcoin will remain a store of value, but can never be a functional wide spread currency.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i947rai",
                                            "author": "Edvardoh",
                                            "score": 3,
                                            "created_utc": 1652905028.0,
                                            "response": "That is Keynesian brainwashing, that money needs to be inflationary to support the economy. It’s in fact the opposite, we got off the gold standard 2 decades before the Great Depression in order to finance WW1. Bad monetary policy is what led to the depression, and then Keynesian clown economics was pushed as a justification of endless money printing to finance war at the expense of common people’s savings purchasing power.\n\nPeople have plenty of reasons to spend money whether they expect the purchasing power to go up or down, doesn’t change their wants or needs. It just simplifies how they save their money in a sound money system instead of having to become an expert on financial and commodities markets, you just save hard money and spend it when you want/need to.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i94f2wo",
                                                    "author": "HlIlM",
                                                    "score": 0,
                                                    "created_utc": 1652908031.0,
                                                    "response": "Of course people want their salaries and savings to buy more.  The spiral destroys businesses and jobs.\n\nContracts are written, salaries are negotiated and capital is financed at a given price level.  When that price level deflates, the profitability of business goes with it.  Jobs go, money becomes tighter and the spiral continues killing more businesses as prices fall further.\n\nWhen you are talking about the type of deflationary velocity that comes with a 100x, no one is going to be able to consistently predict price levels accurately.  Even if they do, competing producers who underestimate deflation will attract workers and capital.  It is damned if you do and damned if you don't, and as we learned from the depression it is workers who bear the burden.  They are the ones leveraged by the starvation of their families.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i946d4p",
                                            "author": "Vipu2",
                                            "score": 2,
                                            "created_utc": 1652904452.0,
                                            "response": "Umm so deflation just appeared from nowhere and caused the great depression?\n\nI have heard a bit different story what caused it.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i94fgkz",
                                                    "author": "HlIlM",
                                                    "score": 1,
                                                    "created_utc": 1652908194.0,
                                                    "response": "A collapse in financial conditions caused deflation.  Deflation caused the depression.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i95v6d3",
                                            "author": "Lagavulin",
                                            "score": 1,
                                            "created_utc": 1652932515.0,
                                            "response": "No. Dead wrong. Keep learning.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i95uxwi",
                            "author": "Lagavulin",
                            "score": 1,
                            "created_utc": 1652932380.0,
                            "response": "You’re dead wrong.  Explore why you’re dead wrong.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i93bl69",
                    "author": "Valkner_",
                    "score": 1,
                    "created_utc": 1652892007.0,
                    "response": "Crypto, especially alts, appeal to people that have gambling addictions. The idea they could 10-1000x their money relatively quickly makes them lose all rational thought. Bitcoin isn't seen as a gamble anymore. Only after people lose everything on shitcoins do they realize the value in bitcoin. Sadly some people never realize this and continue to gamble away life savings on pump and dump schemes.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i95cels",
                    "author": "singh853",
                    "score": 1,
                    "created_utc": 1652923216.0,
                    "response": "I find It funny that Bitcoin is being praised as some sort of stable coin, when it it also got destroyed in recent weeks. Nothing wrong with diversifying your crypto portfolio, and profiting here and there.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i92rap7",
                    "author": "Rockclimber88",
                    "score": -9,
                    "created_utc": 1652883623.0,
                    "response": "What makes bitcoin different except of being the first? BTC Maximalism is a futile attempt to prop up the myth of crypto scarcity while there are better blockchains out there.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i92t9jq",
                            "author": "dlq84",
                            "score": 16,
                            "created_utc": 1652884477.0,
                            "response": "Most decentralized\n\nHighest market cap\n\nMost users\n\nNot pre-mined\n\nNot inflationary\n\nHighest cost to do 51% attack\n\nLightning network\n\nNot controlled by a single (VC backed) company\n\nLegal currency in two countries (more to come)\n\nThe list goes on...",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i92wdii",
                                    "author": "Rockclimber88",
                                    "score": -1,
                                    "created_utc": 1652885788.0,
                                    "response": "A long list but mostly mostly derived from one argument - being the first, and that's not a time-proof state. All the others are also present in many other blockchains.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i93p1ip",
                                            "author": "cpt_charisma",
                                            "score": 2,
                                            "created_utc": 1652897393.0,
                                            "response": "> Most decentralized\n> Not pre-mined\n> Not inflationary\n> Lightning network\n> Not controlled by a single (VC backed) company\n\nThese are some of the most important characteristics of Bitcoin.  I would add immutability and proof of work.  They are not based on time (although they are *proven* over time),  they are intrinsic characteristics of the network.\n\nIn theory, it is possible to build something that is equal to Bitcoin in all of these categories.  The question is, why would everyone that has already invested in building software, infrastructure and savings in Bitcoin spend the huge amount of time and money required to switch?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i93uct4",
                                                    "author": "Rockclimber88",
                                                    "score": 0,
                                                    "created_utc": 1652899560.0,
                                                    "response": "In theory? It has already been built with all possible flavours. Vested interest is another time based argument. Where's the effort required to switch?\n\nHolding - easy on any exchange\n\nMining - easy to switch mining algorithms(even dedicated hardware becomes obsolete very quickly every few years)\n\nTaking payments - most gateways support multiple protocols already",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i93pdtg",
                                            "author": "dlq84",
                                            "score": 1,
                                            "created_utc": 1652897530.0,
                                            "response": ">All the others are also present in many other blockchains\n\nYes, **a strict subset** of what makes Bitcoin the most popular exists in shitcoins. That's why they aren't Bitcoin.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i930ki2",
                            "author": "bitusher",
                            "score": 4,
                            "created_utc": 1652887520.0,
                            "response": "Some misconceptions people have about maximalists-\n\n1) maximalists do not suggest altcoins will cease to exist. Scams, fads, and pump and dumps will come and go.\n\n2) many maximalists are perfectly happy to leave Bitcoin if it fails and support another chain if they have a good reason, as evident in the UASF movement. They just tend to prefer to focus on a single currency.\n\n3) few maximalists suggest that fiat currencies or competing currencies will cease to exist, at least anytime soon\n\n4) maximalists do not suggest that it is inevitable that Bitcoin will become the dominant currency , simply that it is the most likely project at this time to fulfill this role (just like USD is at this time). Bitcoin can indeed fail and is indeed an experiment.\n\n5) Maximalism is simply an underlying understanding in the recognition that there will be one dominant currency (just like we have now with USD). Maximalism is simply an understanding of economics regardless the benefits or tradeoffs. It is simply more secure and more efficient to deal in one currency than barter between many currencies.\n\n6) Maximalists prefer to spend their efforts on one project because they have a greater understanding of the stakes and risks and rather insure one sovereign and secure currency succeeds rather than diluting ones efforts in many insecure and incomplete efforts which all fail",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i95v9pl",
                            "author": "Lagavulin",
                            "score": 1,
                            "created_utc": 1652932567.0,
                            "response": "wow….its shocking the lack of education on this Bitcoin thread.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i96uey6",
                                    "author": "Rockclimber88",
                                    "score": 1,
                                    "created_utc": 1652959863.0,
                                    "response": "wow...it's shocking, the lack of arguments in your comment.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i92vx8m",
                    "author": "GannicusXIII",
                    "score": 1,
                    "created_utc": 1652885599.0,
                    "response": "Greed and envy",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93bl6c",
                    "author": "hyperinflationUSA",
                    "score": 1,
                    "created_utc": 1652892008.0,
                    "response": "leaning the hard way",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93d4q7",
                    "author": "learntofoo",
                    "score": 1,
                    "created_utc": 1652892615.0,
                    "response": "Greed and regret.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93e4cd",
                    "author": "heyhihowyahdurn",
                    "score": 1,
                    "created_utc": 1652893009.0,
                    "response": "Everyones chasing 20x gains",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93fjdt",
                    "author": "Liquids0ul",
                    "score": 1,
                    "created_utc": 1652893573.0,
                    "response": "That’s what happens when you get too greedy 🥺",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93h6ig",
                    "author": "jcash2142",
                    "score": 1,
                    "created_utc": 1652894240.0,
                    "response": "Greed",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93k84s",
                    "author": "AskALettuce",
                    "score": 1,
                    "created_utc": 1652895472.0,
                    "response": "Experience keeps a dear school, but fools will learn in no other.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93rup9",
                    "author": "oystermonkeys",
                    "score": 1,
                    "created_utc": 1652898531.0,
                    "response": "Pain is the best teacher. Not many people actually take the time to study and learn the pre-requisite knowledge. Not many are able to think for themselves, most of them just regurgitate shitcoiner talking points without doing proper investigation.\n\nSo for most people, getting wrecked in the alt coin market is going to be the best teacher.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93x9nf",
                    "author": "superavg",
                    "score": 1,
                    "created_utc": 1652900749.0,
                    "response": "I have a friend who’s always talking about ten x’ing this or that shitcoin.\n\nWhich, answers your post. \n\nPeople want to win the fucking lottery and that’s how they see all of this. \n\nI want to win the lottery too but I’m trusting to do that over a longer period of time with Bitcoin rather than in 3 months with some shit coin that’s apparently going to solve world hunger.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9429sn",
                    "author": "bri8985",
                    "score": 1,
                    "created_utc": 1652902795.0,
                    "response": "It’s all risky. There is risk in index funds as well even though people call them safe. \n\nThat being said holding USD is a safe bet to slowly lose value.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i94a8y4",
                    "author": "delgrey",
                    "score": 2,
                    "created_utc": 1652906043.0,
                    "response": "When times are good almost anything can make you money. When times are bad only the real stuff sticks around. Everything else dies off. Bitcoin is a survivor.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i94ds4j",
                    "author": "eight-none-one",
                    "score": 1,
                    "created_utc": 1652907491.0,
                    "response": "If everyone had this attitude the industry would be stagnant with no innovation.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i94hwaa",
                    "author": "Tozu1",
                    "score": 1,
                    "created_utc": 1652909235.0,
                    "response": "No one knows wtf they’re holding, not even bitcoiners",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i94iwh4",
                    "author": "sQtWLgK",
                    "score": 1,
                    "created_utc": 1652909670.0,
                    "response": "Some of it is from a defence mechanism. Many people did hear about Bitcoin/cryptocurrency years ago, but didn't choose to buy until more recently. They feel they missed the boat, but that they can still compensate that by starting with some \"underdog\" coin that can outperform Bitcoin. The selection bias of speculators that had succeeded at that kind of trade act as a powerful magnet for mind tricks like this.\n\nThat said, most of the time the primary driver isn't that, it's that shitcoin got big VC support, and the team is spending millions on all sorts of astroturfing campaigns. This works until the VC start dumping on retail as their \"exit liquidity\".",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i94k317",
                    "author": "JeremyLinForever",
                    "score": 1,
                    "created_utc": 1652910172.0,
                    "response": "And another apt season comes and they throw their money into Alts again. Some people never learn their lesson, some people get it right after the first time.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i94q4p8",
                    "author": "NoShip7475",
                    "score": 1,
                    "created_utc": 1652912786.0,
                    "response": "I take profits into BTC",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i95686y",
                    "author": "jaysolution",
                    "score": 1,
                    "created_utc": 1652920314.0,
                    "response": "The risk level on all investing is similar to gambling. It’s just that BTC is propping up and at times holding back alt-coins.\n\nI think most people forget that you don’t have to buy this shirt. You can mine it. Who’d thought.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i95b6sb",
                    "author": "Cats_n_Porn",
                    "score": 1,
                    "created_utc": 1652922640.0,
                    "response": "I switched from shitcoiner to BTC maxi in August of last year, so not everyone needs to get rekt to learn. I actually made some profit on many of my shitcoins when I sold.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i95q4si",
                    "author": "VisionGuard",
                    "score": 1,
                    "created_utc": 1652929795.0,
                    "response": "Pretty girl (guy) = altcoin\n\nLoving though sometimes volatile wife (husband) = bitty",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i96b56h",
                    "author": "extrastone",
                    "score": 1,
                    "created_utc": 1652943696.0,
                    "response": "Bitcoin is really small compared to the world economy.  It is only worth about 1% of global GDP.  As new people come in they continue to make the same terrible mistakes that the old people made before them.  It's not that the idiots don't learn, they just get replaced.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i96ixqn",
                    "author": "alexmios30",
                    "score": 1,
                    "created_utc": 1652950649.0,
                    "response": "We always know bitcoin is the only one\n\nAt least for me\n\nI gamble with alts to get more bitcoin 😬",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i96jxp9",
                    "author": "MrMediaShill",
                    "score": 1,
                    "created_utc": 1652951566.0,
                    "response": "ISO20022",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i96u5vd",
                    "author": "St3vion",
                    "score": 1,
                    "created_utc": 1652959694.0,
                    "response": "Why would you go bitcoin only? Compared to some alts Bitcoin is really slow and inefficient... As the crypto world continues to grow it seems increasingly likely it will be dethroned by something else that's just all around better.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i92qj52",
                    "author": "Crucial-X1",
                    "score": -5,
                    "created_utc": 1652883284.0,
                    "response": "Trading only Bitcoin is the same as someone who only trades the spy... Ya you will make a little money, but you are not going to get rich, only trading the spy..",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i92u8um",
                            "author": "Nichoros_Strategy",
                            "score": 6,
                            "created_utc": 1652884893.0,
                            "response": "The majority of traders only lose money the longer they try it, or they end up with far less than they would have just holding and adding onto the position over time (assuming that position is in an investment with high likelihood of surviving many years into the future, like Bitcoin)",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i947051",
                            "author": "Vipu2",
                            "score": 1,
                            "created_utc": 1652904718.0,
                            "response": "Then dont trade, just buy for long term.\n\nI know few traders who make a lot more money than me from their regular job and they still barely keep up with me who just passively dca:s into things.  \nThey think they are winning big time but they also have made big losses and missed gains by doing trades, if they just dca:d that money instead they would have been much better off and saved a ton of time.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i94rhg7",
                            "author": "bbasara007",
                            "score": 1,
                            "created_utc": 1652913402.0,
                            "response": "Bro I make a killing day trading the SPY every day. The spy also out performed many individual stocks over the year as a long term investment.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i92vxhi",
                    "author": "Doppelex",
                    "score": -1,
                    "created_utc": 1652885602.0,
                    "response": "No",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9310mx",
                    "author": "JJGdesign",
                    "score": -1,
                    "created_utc": 1652887699.0,
                    "response": "I prefer buying BTC out of my Alts profits rather than buying it straight up. Maybe I’m too old to know not to put all my eggs in one basket.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i94t6fq",
                            "author": "JimBloc",
                            "score": 1,
                            "created_utc": 1652914171.0,
                            "response": "\nYou can't talk to them, after all they are now all experts after being in it for 2 months. \n3 people this year I told to get out Alts, before they collapsed. \nSame people say things like I can't afford to buy a bitcoin. The fact you said that means you shouldn't be in this game, or allowed out house alone and maybe not allowed sharp things,,",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i94j1qi",
                    "author": "lilroadsta",
                    "score": -1,
                    "created_utc": 1652909734.0,
                    "response": "Maybe because they were trying to acquire more bitcoin through alts, dumbass.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}