{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uv5gq0",
            "title": "If someone loses their Bitcoin due to fraud, why can’t the network simply say they don’t treat that transaction as valid?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/uv5gq0/if_someone_loses_their_bitcoin_due_to_fraud_why/",
            "author": "Legitimate_Bison3756",
            "created_utc": 1653202290.0,
            "score": 3,
            "num_comments": 38,
            "subreddit": "BitcoinBeginners",
            "selftext": "If someone loses their Bitcoin due to fraud, why can’t the network simply say they don’t treat that transaction as valid?\n\nWhy is it that if some hacker orders a company or government to pay millions of dollars in bitcoin due to ransomware, they can get away with it?\n\nWhy can’t the company just tell the world they were defrauded, this is their wallet ID and the bad guy’s Bitcoin wallet ID, please do not agree to the following transaction to their wallet to the bad guy’s wallet and do not validate that blockchain?",
            "stickied": false,
            "comments": [
                {
                    "id": "i9jkcvp",
                    "author": "BTCMachineElf",
                    "score": 17,
                    "created_utc": 1653208534.0,
                    "response": "Censoring transactions isn't feasible. You can't get 100% of miners to agree to censorship. hell, good luck getting 10%. one mining pool tried that and they got hit by a ton of backlash.\n\nAnd if it *were* , that would open our finances to being controlled by the government. They could just censor all our transactions on a whim. That is exactly what bitcoin seeks to avoid.\n\nBitcoin is uncensorable for a reason.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9mwswp",
                            "author": "Legitimate_Bison3756",
                            "score": 1,
                            "created_utc": 1653271799.0,
                            "response": "Why not create an immutable ID for every single Bitcoin (down to some finite percent of a Bitcoin) so that it can always be tracked? And render a Bitcoin invalid from any future use if it was involved with fraud or ransomware?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9ndhmt",
                                    "author": "theospatial",
                                    "score": 1,
                                    "created_utc": 1653281268.0,
                                    "response": "Your proposal doesn't seem to solve the previous post's issue. If this were the case, governments or captured miners could declare any utxo as \"fraud\" and negate their future use. Whomever defines fraud or crime gets to dictate who gets to spend. Bitcoin is uncensorable.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9nf1cq",
                                    "author": "BTCMachineElf",
                                    "score": 1,
                                    "created_utc": 1653282313.0,
                                    "response": "There is no such thing as a 'single bitcoin'.\n\nLets say a bitcoin transaction has two inputs and three outputs. You cannot say which output came from which input. There is no difference. (this is how coin mixers work)\n\nBitcoins don't really exist beyond their amount, recorded on a ledger. When you have 0.232 bitcoin, you really just have a utxo with the number 0.232.\n\nThere are blockchain analytics firms that follow chains of transactions and they have managed to catch some criminals and recover some bitcoin that way.\n\nAnd regulated exchanges would certainly turn identifiably stolen funds over.\n\nBut you can't censor bitcoin. A smart thief will take it to coin mixers or unregulated exchanges.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9oa2uk",
                                    "author": "igadjeed",
                                    "score": 1,
                                    "created_utc": 1653307558.0,
                                    "response": "Every Bitcoin coin does have an immutable ID, which is used to ensure that it is only spent once. It's not possible to ban a coin because it has a short history - created, and then spent. It has no history prior to creation, so it has no qualities which would define it as fraudulent. There's no value in banning a spent coin because it can not be spent more than once",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9jhsfl",
                    "author": "parchence",
                    "score": 8,
                    "created_utc": 1653206186.0,
                    "response": "Let me ask you a question. How are you gonna prove that it is fraudulent transaction and to whom? What differentiates you from the person who initialized the transaction? If there was a good solution for that, it would be implemented long ago.. so if you got some mechanism that would be efficient you can always propose a change",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9jsha7",
                    "author": "igadjeed",
                    "score": 3,
                    "created_utc": 1653215934.0,
                    "response": "You're proposing to impose chargebacks on Bitcoin  \nThat will never happen  \n\nMany of the \"someone stole my bit coins\" posts on /r/Bitcoin are written by people who lost their coins gambling, and are constructing a plausible story to avoid admitting the truth to family  \n\nOne Bitcoin origins rumor is that an on-line casino was being defrauded by its American customers who would deposit $400 from a credit card, lose $400 and then claim a chargeback from their bank, on the grounds that on-line casinos are banned from serving Americans  \n\nBitcoin fixes this \"legal\" fraud  \n\nIn 2021, an infamous Bitcoin fraudster filed a lawsuit asking a British court to order the Bitcoin developers to reinstate the coins which he lost when his safe was robbed. That is, someone stole the keys from the safe, but didn't spend the coins. The applicant wanted the coins sent to an address in his new wallet  \n\nThis is the type of scam your suggestion encourages",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9jzh9j",
                    "author": "putyograsseson",
                    "score": 3,
                    "created_utc": 1653221306.0,
                    "response": "If I trick you out of your 5 bucks lemonade money in cash, then it’s gone.\n\nThe same applies to bitcoin, it’s electronic cash as stated in satoshi's whitepaper.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9mwo5k",
                    "author": "d3vrandom",
                    "score": 2,
                    "created_utc": 1653271732.0,
                    "response": "there's no one in charge on the network. it's decentralized. no one to turn to for justice.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9jdcv7",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653202290.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9lg0zg",
                    "author": "bitusher",
                    "score": 1,
                    "created_utc": 1653245973.0,
                    "response": "Bitcoin is a bear asset with secure transaction finality thus you can build \"chargebacks\" ontop of bitcoin, these exist as escrow services now. Usually , without escrow you would need the merchant to voluntarily refund the transaction.\n\nFiat (digitally) is \"registered value\" thus lacks transaction finality and is more insecure. You cannot create transaction finality and for all the benefits of chargeback protection you get the drawbacks of having your money taken or seized by the government , bank , or another individual with a civil suite",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ltzfo",
                    "author": "sos755",
                    "score": 1,
                    "created_utc": 1653252361.0,
                    "response": "Once you find out that the money is gone, the transaction is already in a block and it can not be reversed.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9mn2ua",
                    "author": "Squirrel_Unfair",
                    "score": 1,
                    "created_utc": 1653266902.0,
                    "response": "Who would decide its fraud or not? A central authority? No thanks.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9mwkjz",
                    "author": "nullama",
                    "score": 1,
                    "created_utc": 1653271683.0,
                    "response": "Think of it like cash.\n\nIf someone grabs your $100 bill you had in your hand and runs away, there's no way to get that back. That \"transaction\" is final, same with Bitcoin.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9nmg92",
                    "author": "ApplicationNo5082",
                    "score": 1,
                    "created_utc": 1653287867.0,
                    "response": "Cause it do not work like that",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}