{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "u4oekm",
            "title": "How should I explain to my friends when they say bitcoin consumes lots of energy and produce nothing.",
            "url": "https://www.reddit.com/r/Bitcoin/comments/u4oekm/how_should_i_explain_to_my_friends_when_they_say/",
            "author": "Foreign_Ad_6052",
            "created_utc": 1650077875.0,
            "score": 87,
            "num_comments": 307,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i4z9di1",
                    "author": "Fiach_Dubh",
                    "score": 1,
                    "created_utc": 1650129406.0,
                    "response": "[endthefud.org](https://endthefud.org)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4x7yc4",
                    "author": "hashuan",
                    "score": 226,
                    "created_utc": 1650084333.0,
                    "response": "Wow you guys are right, Bitcoin sucks. \n\n*continue stacking*",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i4xux7s",
                            "author": "DigitaleDukaten",
                            "score": 67,
                            "created_utc": 1650102280.0,
                            "response": "Problem is that banks like jpmorgan, wells fargo, blackrock, goldman sachs etc. are all stacking AT THE MOMENT meanwhile bitcoin is meant for us, the people.\n\nIf the people weren't so FUCKING dumb. Jesus christ. The stupidity and willingness to disregard before researching bitcoin is actually fucking bitcoins main purpose up.\n\nEveryone is crying about the wealth gap but NO ONE is actually doing anything about it. \n\nFucking sheep ass people man. What the fuck do we do to reverse this negative perspective on bitcoin?! Even the fools at fucking r/technology dont understand it. \n\nAs someone from the Netherlands, it baffles me to see that the average intelligence of the whole world is so fucking low.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i4y8f27",
                                    "author": "DisorientedPanda",
                                    "score": 13,
                                    "created_utc": 1650112479.0,
                                    "response": "I think it’s a matter of ignorance rather than stupidity (granted some are also stupid!). I suppose it’s more of a nurture problem through school and onwards; we aren’t made to question and explore as much rather learn to recite facts in exams. There’s probably a ton of other social and human nature factors at play too. A lot of cognitive dissonance.\n\nCuriosity doesn’t kill the cat.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i516ut7",
                                            "author": "GodOfOdium",
                                            "score": 1,
                                            "created_utc": 1650161133.0,
                                            "response": ">Curiosity doesn’t kill the cat.\n\nStupidity does.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i4zh0mv",
                                    "author": "ColdSnickersBar",
                                    "score": 8,
                                    "created_utc": 1650132713.0,
                                    "response": "Dude I have never ever felt the need to convince anyone to adopt bitcoin I seriously don’t give a single shit if anyone I know likes bitcoin. Why care if some dude you work with likes bitcoin?",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i4y1cvw",
                                    "author": "AriSteele87",
                                    "score": 23,
                                    "created_utc": 1650107653.0,
                                    "response": "It doesn't matter, no one will be too late for Bitcoin. Even if you're on the tail end of adoption you'll still benefit greatly from having a vessel to store your value as liquid as Bitcoin.\n\nBitcoin is for everyone and will be eventually.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i4y2ywo",
                                            "author": "DigitaleDukaten",
                                            "score": 3,
                                            "created_utc": 1650108871.0,
                                            "response": "Yeah.. I guess you're right",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i4ye19b",
                                    "author": "Schwanzerfaust",
                                    "score": 23,
                                    "created_utc": 1650115626.0,
                                    "response": "Everyone gets the price they deserve. If stupidity impedes their proper judgement, they will just pay a higher price.\n\nBitcoin is fair as it's also an IQ test. Of course, people will moan later that its unfair, but that's how people are.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i4yxi0f",
                                            "author": "JLockrin",
                                            "score": 13,
                                            "created_utc": 1650124423.0,
                                            "response": "This is kind of true about life in general. The majority complain about fairness and focus on external (which they cannot control) and give themselves excuses. The top performers focus on what they can control - their actions and give themselves no excuses and achieve much more of their potential. I wish more understood this. Oh well.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i520hj9",
                                            "author": "Steve_at_Reddit",
                                            "score": 1,
                                            "created_utc": 1650179154.0,
                                            "response": "It is best for moat to discover it for themselves. Does anyone here feel the need to convince anyone of the power and functionality of the internet?!\nNo need to herd the un-herdable. Just calmly educate. But to push too hard will push ppl away. Patience. They will come.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i4yltvf",
                                    "author": "HODL_monk",
                                    "score": 7,
                                    "created_utc": 1650119470.0,
                                    "response": "People are naturally drawn to the shiny thing, to panic about its unique effects, and can't relate it to what already exists in the real world. The exact same thing happened with the AIDS epidemic. After its outbreak in the early 80's, a huge amount of research was put into finding a cure for it, at the detriment of many current disease killers of people, because people had become used to the idea that cancer and heart disease just 'naturally' killed people, as if AIDS was some bioterror weapon that was completely different from the natural processes that already killed most people. It turned out we wasted a decade researching a very small killer, while just ignoring what actually killed the majority of people. Only once the panic subsided did we realize that AIDS, while a persistent problem, was never going to be a mass killer, and only then did research priorities return to the most probable threats to human life.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i4ynh65",
                                            "author": "DigitaleDukaten",
                                            "score": -2,
                                            "created_utc": 1650120207.0,
                                            "response": "its happening right now aswel. I am by no means a climate change denier, but the sheer amount of effort (and costly dept...) put into the idea of avoiding a couple degrees of global heating actually worsened the problem in the first place.\n\nI personally strongly believe that we should cut down on spending so much damn money on wind energy, and start investing in nuclear energy and nuclear waste storage facilities. Once we normalize the investment in nuclear energy, we're able to speed up the industrial phase in continents like Africa or Asia through reduction in overal price needed for setting up a nuclear power plant.\n\nLets just start by providing 100% access to contraception to these continents first.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i4yt3un",
                                                    "author": "FalcoonnnnPUNCH",
                                                    "score": 4,
                                                    "created_utc": 1650122604.0,
                                                    "response": "In no way is this true. All the \"effort\" put in thus far has not been enough as we are not on track to stay below even the stretch goal of 2⁰C. It has however made wind and solar the cheapest forms of energy available by a significant margin and while wind may be closer to leveling off it is still SIGNIFICANTLY cheaper to install and operate than nuclear energy.\n\nFor the record im pro nuclear and believe we.should.continue to operate the current fleet as long as possible, but new.construction for nuclear is not cost comparative with solar/wind. Yes solar and wind are intermittent but that can be assessed with building surplus,  still at a lower cost than comparable nuclear systems.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i5czay4",
                                                    "author": "HODL_monk",
                                                    "score": 1,
                                                    "created_utc": 1650385287.0,
                                                    "response": "It seems like the subsidies for wind power are fairly small, which eases my concerns. [https://www.factcheck.org/2019/07/does-wind-work-without-subsidies/#:\\~:text=There%20are%20other%20federal%20subsidies%20that%20go%20to,federal%20investment%20in%20wind%20stems%20from%20the%20PTC](https://www.factcheck.org/2019/07/does-wind-work-without-subsidies/#:~:text=There%20are%20other%20federal%20subsidies%20that%20go%20to,federal%20investment%20in%20wind%20stems%20from%20the%20PTC).\n\nAs a Libertarian, I support the free market building whatever types of power they want, even if they do it for 'woke' financing reasons (Blackrock ESG), and not reason and logic. It ain't my money, and maybe this stuff will turn out to actually be decent, even though on the surface it seems lame.\n\nAs an off and on nuclear supporter, I do have concerns with nuclear power in the long term. Its actually not unlike fiat money, in that there always seems to be another catastrophic nuclear accident that was 'totally unexpected' every 10 years or so, and maybe we just can't handle power types that are susceptible to 'black swans', in the same way that fiat money can't be handled prudently, because there is always an unexpected event that requires huge money printing that seems OK to 51 % of the population at that moment, and then we have to deal with rampant inflation for the next 10 years... The fact that a random earthquake wave somehow created a meltdown that can't be permanently dealt with for 300 years just makes me think that we are just not ready for power generation that is this finicky.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i4ysi5w",
                                    "author": "ChrimsonChin988",
                                    "score": 5,
                                    "created_utc": 1650122359.0,
                                    "response": "Bitcoin is not meant for anyone specifically.\n\nBitcoin is not meant to reduce the wealth gap.\n\nBitcoin is Bitcoin.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i4xyrdh",
                                    "author": "officialM3DL3Y",
                                    "score": 9,
                                    "created_utc": 1650105547.0,
                                    "response": "If I as a working class wage slave stoner can understand it anyone can. You gotta do your own research and put the time in. Simple as that.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i4y0g30",
                                            "author": "DigitaleDukaten",
                                            "score": 5,
                                            "created_utc": 1650106934.0,
                                            "response": "Yup. Well, atleast youre good man. Bitcoin is our money saver, atleast the fed made it easy for us to choose where we should put our money into",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i4zf3cd",
                                    "author": "walloon5",
                                    "score": 2,
                                    "created_utc": 1650131866.0,
                                    "response": ">r/technology\n\nGenuinely the worst takes, and the biggest misunderstandings",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i4yppph",
                                    "author": "Distinct-Vanilla-788",
                                    "score": 1,
                                    "created_utc": 1650121183.0,
                                    "response": "Agree",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i4ys3sj",
                                    "author": "SuspiciousSquid94",
                                    "score": 1,
                                    "created_utc": 1650122198.0,
                                    "response": "So you have a deep understanding of elliptic curve cryptography and the SHA-256 hash function?",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i4zrv0o",
                                    "author": "BeefSupreme2",
                                    "score": 1,
                                    "created_utc": 1650137589.0,
                                    "response": "What does being from the Netherlands have to do with world intelligence?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i4zupdx",
                                            "author": "DigitaleDukaten",
                                            "score": 1,
                                            "created_utc": 1650138893.0,
                                            "response": "Because apparently the average human in my environment seems to be smarter than the average human in the world",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i516dsh",
                                                    "author": "BeefSupreme2",
                                                    "score": 1,
                                                    "created_utc": 1650160891.0,
                                                    "response": "Maybe you should get out more.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i50hkvy",
                                    "author": "PixelJunkie365",
                                    "score": 1,
                                    "created_utc": 1650149144.0,
                                    "response": "I may have a different take on things. While I agree that it's frustrating some people just don't get Crypto at all, like my Dad lol. Got those of us who do and have been early adopters this is a benefit to us. As the later arrivals buy in our valuation increases. Todd happens in any and all investments that grow beyond startups. Crypto is easy beyond a startup so we early adopters should be thanking those who are late arrivals. They are the ones pushing our early investments to multiply. So.... From me to the late bloomers.. thank you!!",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i50j8w0",
                                    "author": "spati16",
                                    "score": 1,
                                    "created_utc": 1650149901.0,
                                    "response": "Well said (with a good healthy dose of appropriate vitriol)\n\nIt's been a sad realization that people aren't as intrepid, intelligent, or curious as I thought they were",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i50wdol",
                                    "author": "Weekly-Lime-8484",
                                    "score": 1,
                                    "created_utc": 1650156000.0,
                                    "response": "What is so \"smart\" about a speculative assets like Bitcoin? How does this solve the wealth gap exactly? I can pretty much guarantee you that these investment banks you just mentioned are NOT buying Bitcoin with their clients billions upon billions of dollars.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i50z7d9",
                                            "author": "DigitaleDukaten",
                                            "score": 1,
                                            "created_utc": 1650157349.0,
                                            "response": "Well, you can see how the adoption of bitcoin is growing in the world if you look at its price history and other statistical data. Most people hold bitcoin for long term, you can clearly see it. Look up: chainanalysis.\n\nI highly believe in the idea that this technology will continue to manifest itself in our world. It is kind of an unstoppable force, peter thiel mentioned this himself in 1997.\n\nOh, and those banks I mentioned, they're all hiring traders right now. Im assuming they do this so that they can trade bitcoin in the most efficient way possible just to obtain them.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i510fqr",
                                    "author": "Complex_Ad998",
                                    "score": 1,
                                    "created_utc": 1650157958.0,
                                    "response": "Bitcoin is meant for the people but with its value now, the people can’t benefit from it though it’s meant for them.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i518t1z",
                                            "author": "DigitaleDukaten",
                                            "score": 1,
                                            "created_utc": 1650162132.0,
                                            "response": "People cant benefit from it?!\n\nBitcoin will 10-30x in 10-20years. Wtf do u mean?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i5zgk68",
                                                    "author": "Complex_Ad998",
                                                    "score": 1,
                                                    "created_utc": 1650795270.0,
                                                    "response": "The average person will never be able to afford a single coin. Not now, not in 10-20 years it costs too much",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i5zhc6u",
                                                            "author": "DigitaleDukaten",
                                                            "score": 1,
                                                            "created_utc": 1650795930.0,
                                                            "response": "If a single coin gets up to lets say 4 million in 30 years or so, then you went 100x with your money if you invested right now. \n\nWhat the hell are you saying? It doesnt matter that we cant own a single bitcoin, i own like 0.05 lol. If it goes up then your money goes up. As simple as that",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i516377",
                                    "author": "hyrootpharms",
                                    "score": 1,
                                    "created_utc": 1650160742.0,
                                    "response": "Intelligence is low because all the public schools switched to common core in 2010. In the 90's we had government and economics classes in high school  Some schools called it civics. Schools don't have that anymore. In the 80's and 90's we also had to take state tests every year.  The classes studied for them for weeks. They don't do it like that anymore.\n\nDon't get me started on how college curriculums have changed.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i4yq8lr",
                                    "author": "UnusualPass",
                                    "score": 0,
                                    "created_utc": 1650121408.0,
                                    "response": "Or maybe we're wrong",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i4yqvx2",
                                            "author": "DigitaleDukaten",
                                            "score": 2,
                                            "created_utc": 1650121684.0,
                                            "response": "In what way would we be wrong? Bitcoins slow (or rapid) organic progression in world wide adoption is very clear at this point.\n\nThe only 2 big questions about the succes of bitcoin are about the potential influence of governance, and how a recession would look like.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i4yr933",
                                                    "author": "UnusualPass",
                                                    "score": 3,
                                                    "created_utc": 1650121840.0,
                                                    "response": "All I'm saying is nothing is certain.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i4ywj7d",
                                                            "author": "DigitaleDukaten",
                                                            "score": 2,
                                                            "created_utc": 1650124023.0,
                                                            "response": "You're right if you specify it like that.\n\nAlthough I would say that one is not wrong/right as there is no single model/set of models that can predict the future. The only thing you can do, is to research the concept through a stoic approach, by allowing yourself to discover all the negatives and positives, just to make a well educated decision for yourself.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i4yr8am",
                            "author": "PutoPozo",
                            "score": 1,
                            "created_utc": 1650121830.0,
                            "response": "Exactly this 😂",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i4zad0v",
                            "author": "rofnacla",
                            "score": 1,
                            "created_utc": 1650129821.0,
                            "response": "Either that or get new, more intelligent friends",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i53cau5",
                            "author": "kingmessi30",
                            "score": 1,
                            "created_utc": 1650209931.0,
                            "response": "Show them how to stack Satoshi.  Then tell them in a couple of years you will thank me and buy me dinner. \nYour welcome my friend.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i4xckng",
                    "author": "johnson5067",
                    "score": 14,
                    "created_utc": 1650087293.0,
                    "response": "Saw this posted a few days ago. Skimmed it and it looks like a great resource to share with others. [https://electricmoney.org/](https://electricmoney.org/)\n\nIf you want a longer, more detailed answer, I like Lyn Alden's piece: [https://www.lynalden.com/bitcoin-energy/](https://www.lynalden.com/bitcoin-energy/)",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i4xx9uk",
                            "author": "Flexo82",
                            "score": 6,
                            "created_utc": 1650104299.0,
                            "response": ">If you want a longer, more detailed answer, I like Lyn Alden's piece: https://www.lynalden.com/bitcoin-energy/\n\nThanks for this. Lyn is great and I have not read this piece yet",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i4zh15j",
                                    "author": "lordsamadhi",
                                    "score": 5,
                                    "created_utc": 1650132720.0,
                                    "response": "Read her piece on the difference between PoW and PoS.  It's absolutely amazing and needs to be read by everyone.  \n\nhttps://www.lynalden.com/proof-of-stake/",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i4y1hiz",
                    "author": "hsmst4",
                    "score": 33,
                    "created_utc": 1650107754.0,
                    "response": "\"Consumes lots of energy and produce nothing.\"\n\nSounds like my kids...",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i4y6y6l",
                            "author": "Amoci",
                            "score": 10,
                            "created_utc": 1650111572.0,
                            "response": "sounds like OP's friends",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i4xh7eh",
                    "author": "Dependent-Army4891",
                    "score": 65,
                    "created_utc": 1650090691.0,
                    "response": "I explain it as follows:\n\nThe very valuable \"thing\" that is produced by all that energy usage is ***trust*** in the network.\n\n(This is achieved by removing the need for trust, but don't say that yet - you'll lose 90% of them & be deemed insane lol. Explain proof-of-work first.)\n\nTrust in the network cannot be achieved any other way than by proof-of-work.\n\nProof-of-work allows for anyone to plug in a machine to help process transactions for the network & be rewarded for it. Naturally, high processing power (which requires high energy usage) will increase the machine's usefulness to the network & will therefore increase the rewards paid.\n\nJust as naturally, cheap or free electricity will be sought to increase profitability. Since the machines produce heat, anywhere that heat is required, the machines can literally run for free - e.g. Vancouver, Canada, soon to be the first city in the world to be heated by Bitcoin.\n\n(Let that sink in. ASICs convert 100% of the energy they use into heat. Even if BTC's value became zero in the future, Vancouver's BTC mining infrastructure would continue to provide heat at near 100% energy efficiency. For comparison, natural gas heating provides 92% energy efficiency.)\n\nThe alternative to proof-of-work is proof-of-stake. Proof-of-stake removes the incentive for the public to process transactions for profit by instead giving this opportunity only to the currency's top stakeholders. Only they may apply to be chosen at random & given set contracts to fulfill. Since the amount of work they're permitted to do is limited, their profit does not increase in relation to their processing power (ability to process transactions faster), as it does with proof-of-work currencies.\n\nThe problem with proof-of-stake is clear: the security of the network relies on an elite group of entities with high stakes in the currency. Everyone is forced to trust this group. And, historically & economically, what tends to happen when you remove competition? Corruption, greed & waste.\n\nProof-of-stake requires trust in an elite group to secure the network.\n\nProof-of-work does not, and is therefore the most secure & trustworthy type of network that can exist.\n\nIn summary, Bitcoin's energy usage produces trust (by removing the need for trust) and at the same time, produces heat that can be utilized.\n\n**Edit:** [Those who oppose Bitcoin](https://antibitcoiners.com) after processing the above information may be inherently opposed to (or uncomfortable with) freedom in general or free markets for important things, or they may simply be resistant to change. The first subset may be not be convincable. The second: ask them what the general public likely thought when the first paper money was invented. \"You're telling me this piece of paper is worth a cart of copper coins? I reject the notion!\" <- some guy in the first century, probably.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i4ybg79",
                            "author": "bigdaddyjeff69",
                            "score": 6,
                            "created_utc": 1650114247.0,
                            "response": "Im just gonna nitpick hear. ASIC lose some energy through sound. Not 100% goes to heat. Idk what the number is but yea",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i4zmvuh",
                                    "author": "Dependent-Army4891",
                                    "score": 3,
                                    "created_utc": 1650135310.0,
                                    "response": "r/UnintentionalPuns",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i4znyxd",
                                            "author": "bigdaddyjeff69",
                                            "score": 2,
                                            "created_utc": 1650135804.0,
                                            "response": "Wait what pun did I make?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i4zo1hn",
                                                    "author": "Dependent-Army4891",
                                                    "score": 2,
                                                    "created_utc": 1650135836.0,
                                                    "response": "\"Hear\" :D",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i4zp55o",
                                                            "author": "bigdaddyjeff69",
                                                            "score": 2,
                                                            "created_utc": 1650136344.0,
                                                            "response": "Lmao whoops. That’s just me being a silly goose. I guess that one flew right past my ‘ears’",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i4yj4w6",
                            "author": "iiJokerzace",
                            "score": 8,
                            "created_utc": 1650118187.0,
                            "response": "One thing I would like to make more clear since miners are also elites getting the rewards. This most likely will lead (if it hasn't already) to the more elite to mine as normal people just can't compete with companies mining. \n\nHowever,  the reasons we don't really have to worry about them getting all the rewards  on PoW are pretty smart:\n\n1. The more difficult to mine PoW, the more expensive it is. For PoS, their expenses are virtually non-existant and can compound their stake easily,  while PoW has major expenses forcing them to always be selling some btc and not just riding it out. \n\n2. Which leads to my second point. For PoW,  the coins have no impact on security. So even if miners got tons of coins, it's irrelevant to the security. However for PoS, the coins *are* the security, so the distribution of these coins are **extremely** important for security and decentralisation. What's funny is a very popular PoS coin added a burning mechanism, for users,  which only speeds up the real problem of coin hoarding  and was only done as hopes to raise the price. Not a good look.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i4xxbtr",
                            "author": "d_101",
                            "score": 6,
                            "created_utc": 1650104344.0,
                            "response": "Comparing burning gas and resistive heating is wrong, because you dont take in account where electricity comes from. In most places it comes from burning the same gas or coal, which are 40-60% efficient at best. And if your city doesnt have central heating, this energy is basically wasted.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i4z432x",
                                    "author": "Dependent-Army4891",
                                    "score": 3,
                                    "created_utc": 1650127159.0,
                                    "response": "https://www.naturalgasintel.com/canadas-north-vancouver-launching-bitcoin-heating-pilot-with-mintgreen-in-2022/\n\n>**More than 97% of BC Hydro’s energy mix is hydroelectric**",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i502iyh",
                                            "author": "d_101",
                                            "score": 1,
                                            "created_utc": 1650142386.0,
                                            "response": "Ok, but you cant generalize it and say that bitcoin heat is more  efficient then burning gas. Even then, heat pumps are better then resistive heating (like mining) in most cases.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i50fm6t",
                                                    "author": "Dependent-Army4891",
                                                    "score": 4,
                                                    "created_utc": 1650148266.0,
                                                    "response": "I said that Bitcoin heating is more *energy* efficient than burning gas for heat. That's not a generalization; it's a fact.\n\nAs far as which methods are \"better\", that depends on what the goal is.\n\nThis post asked how to address questions about Bitcoin's energy consumption & what that energy is producing. When questions like these are being asked, the concern is wastefulness.\n\nFor those who do not see the value in the truly decentralized & trustless network that Bitcoin's energy consumption allows for, learning that the heat produced can be fully utilized with zero waste can help to alleviate these concerns.\n\nPeople concerned about wasted energy are concerned for the environment.\n\nVancouver’s electric \"digital boilers\" (see link I shared above) are expected to prevent the release of 20,000 metric tons of greenhouse gases per megawatt-hour when compared to natural gas. This is due to energy not being lost/wasted in the form of emissions & heat loss to expel those emissions.\n\nMany people consider the potentially higher costs of implementing systems like this to be worth it for the positive environmental impact. Multi-billion-dollar fossil-fuel-burning projects have been axed at near- or full-completion with environmental concerns being considered \"worth\" the financial sacrifice.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i4y236i",
                                    "author": "123Delbe",
                                    "score": 3,
                                    "created_utc": 1650108210.0,
                                    "response": "Yeah don't forget all those goody two shoes who separate all their recycling only for it to be taken away and burnt!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i4ye14p",
                            "author": "CallingVoid",
                            "score": 2,
                            "created_utc": 1650115625.0,
                            "response": "Great post.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i4z45mu",
                                    "author": "Dependent-Army4891",
                                    "score": 1,
                                    "created_utc": 1650127189.0,
                                    "response": "Thank you!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i4y1fn7",
                            "author": "BahamanLlama",
                            "score": 3,
                            "created_utc": 1650107713.0,
                            "response": ">Since the machines produce heat, anywhere that heat is required, the machines can literally run for free - e.g. Vancouver, Canada, soon to be the first city in the world to be heated by Bitcoin.\n\nI'm completely new to this, how is the heat generated from the process able to be moved from the ASICs to where it's needed?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i4ykiec",
                                    "author": "ardevd",
                                    "score": 1,
                                    "created_utc": 1650118843.0,
                                    "response": "Same as every other source of heating? \n\nEnergy cannot be created or destroyed, so in case of Bitcoin mining where does it go? Where it always goes with earth’s physics: heat.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i4ysglc",
                                            "author": "BahamanLlama",
                                            "score": 3,
                                            "created_utc": 1650122341.0,
                                            "response": "Yes, heat is generated in the ASICs from the mining process, but how do you transfer this heat from the ASICs to where you would need it, like another room in the building or another part of the city entirely?\n\nOtherwise, how are you supposed to heat an entire city with the heat from ASICs if you can't distribute it across the city? Yes there might be enough total heat, but transferring it across an entire city isn't more trouble than it's worth?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i4z2e5t",
                                                    "author": "Dependent-Army4891",
                                                    "score": 2,
                                                    "created_utc": 1650126437.0,
                                                    "response": "https://www.naturalgasintel.com/canadas-north-vancouver-launching-bitcoin-heating-pilot-with-mintgreen-in-2022/\n\n>**Digital boilers**",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i4z2xfi",
                                                            "author": "BahamanLlama",
                                                            "score": 2,
                                                            "created_utc": 1650126664.0,
                                                            "response": "Thank you.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i4z00vo",
                                                    "author": "I_Has_A_Hat",
                                                    "score": 0,
                                                    "created_utc": 1650125457.0,
                                                    "response": "The same way you do any heat source, moving air.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i4z2q03",
                                                            "author": "BahamanLlama",
                                                            "score": 2,
                                                            "created_utc": 1650126574.0,
                                                            "response": "But how do you transfer heat across an entire city from moving air? Any heat that gets transferred outside would just dissipate immediately, how do you get the heat from the ASICs in one building to every other building in the city, given that the buildings are separated by the outside environment which in a cold climate, would just be dissipated? I hope I'm not overthinking this. \n\nI just don't see how you can efficiently transfer the heat to other buildings in a 115km\\^2 area, cold vicinity without some kind of heat transfer system.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i4z3kr2",
                                                                    "author": "I_Has_A_Hat",
                                                                    "score": 1,
                                                                    "created_utc": 1650126938.0,
                                                                    "response": "https://en.m.wikipedia.org/wiki/District_heating",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i4z5387",
                                            "author": "Dependent-Army4891",
                                            "score": 1,
                                            "created_utc": 1650127583.0,
                                            "response": "Well I mean, a field of beans produces heat, but it also produces beans. ASICs, like all electric heaters, don't produce any mass as a by-product (e.g. CO2, water vapor) and don't need to waste any heat shooting that mass out of a chimney.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i4z7ukm",
                            "author": "unduly-noted",
                            "score": 1,
                            "created_utc": 1650128750.0,
                            "response": "You’re forgetting about:\n\nStaking pools with PoS. Anybody can participate in a staking pool. You don’t need to be elite to participate under a PoS consensus mechanism.\n\nIs something like a mining pool possible with Bitcoin? Not sure how you could have a trustworthy mining pool without smart contracts. And if that’s the case only the elite end up participating in PoW given the cost.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i4zel2q",
                                    "author": "Dependent-Army4891",
                                    "score": 1,
                                    "created_utc": 1650131644.0,
                                    "response": "Staking pools in a PoS system allow those who do not possess the stake amount required for participation to pool together to come up with this amount & thus become a part of the elite. \n\nThey are pooling their stake first (to be allowed to participate), their computing power second.\n\n>*Is something like a mining pool possible with Bitcoin? ...if that's the case only the elite end up participating...*\n\nBitcoin mining pools have existed since 2010 and help the *less* \"elite\" (those with less processing power - stake is not a factor) to participate by pooling their computing power/resources. My S9's are participating in one as we speak.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i4xqs5b",
                            "author": "DanceAlien",
                            "score": -17,
                            "created_utc": 1650098630.0,
                            "response": ">trust\n\n\n>millions of people get scammed in BTC \n\nVery valuable indeed",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i4xs31w",
                                    "author": "Cristek",
                                    "score": 13,
                                    "created_utc": 1650099780.0,
                                    "response": "That has nothing to do with Bitcoin or it's network...\n\nThe problem there is that most people barely know how to use a computer...\n\nThere is always going to be the next scam. You just need computer literacy, that's all. Also, the tecnilogy needs to keep evolving to make things easy and safer for the common user!!",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i4y0c41",
                                    "author": "JFlynny",
                                    "score": 3,
                                    "created_utc": 1650106845.0,
                                    "response": "Fuck off to r/buttcoin, gimp",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i50i81y",
                                    "author": "parkranger2000",
                                    "score": 2,
                                    "created_utc": 1650149435.0,
                                    "response": "If you were intellectually curious instead of smugly dismissive I’d encourage you to try to better understand what trust means in this context. The bitcoin network is a trustless system because you don't have to trust a third party: a bank, a person, or any intermediary that could operate between you and your transactions or holdings. No one on the network needs to “trust” anyone else in order to make for secure transactions and holdings. This is entirely separate from being scammed, which occurs in all currencies and assets, and basically comes down to the problem of putting your “trust” in a person or entity that you shouldn’t have",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i4xkmb9",
                    "author": "cryptening",
                    "score": 18,
                    "created_utc": 1650093397.0,
                    "response": "Tell your friends it's not about the amount of energy but the type of energy.\r  \n\r  \nBitcoin is the only viable flexible base load energy consumer. Brian Brooks explains it really well in this video. https://twitter.com/KarlssonAlex1/status/1484237667781038088\r  \n\r  \nRemember when all those Texans froze to death during that cold snap? That's because they built capacity for the good times. Now they are building capacity for the bad times and it is bitcoin miners who consume all the energy in the 99% of times they don't need max capacity. Without bitcoin miners they could not have financed it.\r  \n\r  \nPOW will be vital for the green energy transition because you need flexible baseload consumers to make it economically feasible. None of the 'Bitcoin is bad because of muh energy' crowd even knows what a flexible base load consumer is, let alone that they can come up with an alternative to bitcoin mining. They come up with things like hydrogen production. You can't just shut down a hydrogen plant within 7 seconds as bitcoin miners are required to do in texas.\r  \n\r  \nThen there is methane gas flaring and venting. It is responsible for ca. 2% of global warming. The potential electricity generation of (just the reported) flare gas is 6x what bitcoin currently consumes. Within 5 years every single oil company on the planet will be mining Bitcoin to meet their climate goals;) For small and/or remote drilling sites Bitcoin mining is pretty much T.I.N.A. It will turn Bitcoin into a net negative emission industry. The only net negative industry on this planet.https://www.cnbc.com/2022/03/26/exxon-mining-bitcoin-with-crusoe-energy-in-north-dakota-bakken-region.html\r  \n\r  \nhttps://blog.upstreamdata.ca/\r  \n\r  \nhttps://www.crusoeenergy.com/blog/5t1IxNQ1ZxTDc2OvaBEERn/green-bitcoin-mining-the-big-profits-in-clean-crypto\r  \n\r  \nStill, ignorance can win. Greenpeace demonized nuclear energy and all we got in exchange for it was more coal. So Bitcoin could meet the same faith as nuclear. We should try and prevent that by educating people on the type of energy instead of the amount of energy.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i4xr08m",
                            "author": "Ultimate_Pickle",
                            "score": 3,
                            "created_utc": 1650098830.0,
                            "response": "This is awesome, and I definitely agree with the sentiment over nuclear. If the fossil fuel industry hadn’t used “environmental concerns” to kill nuclear, we would have plentiful cheap power and none of this would even be a discussion.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i4ygiph",
                            "author": "erefernow",
                            "score": 2,
                            "created_utc": 1650116902.0,
                            "response": "What a great answer. Tucked the info away.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i4xq76l",
                    "author": "Schapsouille",
                    "score": 7,
                    "created_utc": 1650098120.0,
                    "response": "\"Compared to what?\"",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4wzhsv",
                    "author": "falcofox64",
                    "score": 5,
                    "created_utc": 1650079500.0,
                    "response": "What kind of energy is bitcoin consuming? How much is renewable? How much is from energy that's already going to waste ( flare gas, hydro etc )? \n\nWhat is Bitcoin? A ledger on a blockchain and Bitcoin is the native currency that allows someone to make an entry on that ledger.\n\nWhat are the qualities of the ledger? Decentralized, peer to peer, trustless and so on.\n\nI would explore the topic a little more and dig deeper with your friends. \"Bitcoin consumes lots of energy and produces nothing\" is a rather shallow criticism and shows ignorance of Bitcoin .",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4xkmf0",
                    "author": "Amber_Sam",
                    "score": 3,
                    "created_utc": 1650093399.0,
                    "response": "So does the TV or playing games.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4xpo3p",
                    "author": "GameChng",
                    "score": 4,
                    "created_utc": 1650097651.0,
                    "response": "A website was recently created to answer this quickly, and go into more depth if the person is curious: \n\n&#x200B;\n\nhttps://twitter.com/PLK5280/status/1513858227515052041?s=20&t=FkKEYG7Ngou0CBKEbgqtKQ",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4y1jx0",
                    "author": "comfyggs",
                    "score": 5,
                    "created_utc": 1650107807.0,
                    "response": "The text below is not mine and unfortunately i cannot remember the attribution (if it is yours please post)\n\n“Bitcoin mining potentially solves the duck curve problem that renewable energy has without the need of expensive storage solutions.\n\nYou could theoretically solve the problem by massively overbuilding your renewable energy generation such that the minimum it ever generates is always greater than the maximum people need to consume. But then you have a problem that you've got a TON of valuable, energy producing capital that mostly goes underutilized. But stick a bitcoin mine on top of that which absorbs any and all excess energy, but can easily be spun down if the local human needs demand electricity, and you alleviate the problem.\n\nYou could do the same thing to move nuclear from just a baseload electricity provider to the only provider, and kill the residual fossil fuel plants that support it and make a locale dependent on external fuel sources. Right now, we need to keep our nuclear production capped at the minimum load consumers demand it. That's because it takes a lot of time to spin nuclear energy generation up and down, on the order of hours, so it can't respond to rapid changes in demand. So, we use fossil fuel plants, mostly natural gas, that can rapidly spin production up and down to respond to changes in the demand curve. But with bitcoin miners, we could over produce nuclear at a steady rate, and the miners would just consume any and all excess.\n\nBitcoin miners WILL be another tool in the electricity management toolbox alongside industrial scale batteries (not just chemical, but various gravity batteries) and grid based energy markets.\n\n\n——\n\n\"An invention has to make sense in the world it finishes in, not in the world it started.\"\n\nThis is an issue with the fossil fuel industry pursuing profit at any cost which needs to be addressed by government, NGOs and the industry itself.\n\nUltimately, bitcoin incentivizes green energy production since the cheaper the energy the higher the profits.  With the added bonus that energy is now digital (and therefore easily transferrable without the burden of wires and transportation infrastructure).\n\nAre there going to be speed bumps along the way?  For sure... NONE of us can hold our hands up and say we are living a 100% sustainable lifestyle as yet.  Indeed, there was an environmental cost when you opted to purchase that device you just made that Reddit comment on.\n\nOn a final note, a subtle nod to bitcoin was recently featured in the incredible Earthshot documentary series featuring David Attenborough - a series about how technology can help transform and heal the planet, which was vetted by multiple climate and technology experts.\n\nNeedless to say, if those experts had deemed bitcoin a threat to the environment it would be the very last thing they'd want to associate with a documentary about healing the planet.\n\nTL;DR: Poorly researched fear and panic inducing articles generate far more clicks than well researched scientific journals that paint a much more complex truth...  Understanding where all this leads requires extending our mental map of the world beyond the status quo and looking 10 years into the future if we are to fully grasp how all this will evolve into a positive outcome for people and planet.”",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4y8no0",
                    "author": "Mark_Weston",
                    "score": 4,
                    "created_utc": 1650112623.0,
                    "response": "It doesn’t have to “produce” anything. If offers function and utility, same as your house.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4x0j4m",
                    "author": "ssee22z",
                    "score": 9,
                    "created_utc": 1650080062.0,
                    "response": "Banks consume a lot of energy and produce inequality. U.S spent trillions in millitary to protect $ and attacked other countries that are oppose to that idea.(Petrodollar wars)  Thats a lot of energy and facilitated wars, hate and inequality.  dont you think? Bitcoin doesnt care where you are from, who you are, and most importantly is not controlled by powerful individuals.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i4zp1b5",
                            "author": "Dangerous-Analyst-17",
                            "score": 1,
                            "created_utc": 1650136294.0,
                            "response": "This. The energy consumption by brick and mortar banks and the financials CBDs of London and Frankfurt etc.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i4xorjk",
                    "author": "Argyrus777",
                    "score": 9,
                    "created_utc": 1650096873.0,
                    "response": "Video record them and have them repeat everything loud and clear and send it to them in the future until they admit their wrong.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i4xsax9",
                            "author": "vztempest",
                            "score": 3,
                            "created_utc": 1650099963.0,
                            "response": "I support this lol. I'd stop arguing and keep on stacking and HODLing.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i4x0ic5",
                    "author": "JosephMeach",
                    "score": 24,
                    "created_utc": 1650080050.0,
                    "response": "The government also consumes a lot of energy and produces very little. Also dollars.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i4yecen",
                            "author": "Schwanzerfaust",
                            "score": 1,
                            "created_utc": 1650115787.0,
                            "response": "Change the government, not the climate.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i4xsdea",
                    "author": "bittenbycoin",
                    "score": 8,
                    "created_utc": 1650100024.0,
                    "response": "Here's an analogy. Ask them why there are so many refrigerators around the world consuming electricity 24/7/365 just to make air a few degrees colder. It's just air!  If you need it cooler, move closer to the North or South Pole, why do you need to waste so much electricity on billions of refrigerators around the world?!\n\nSo it turns out cooler air can do something awesome, like preserve food for longer than room temperature (most places). Apparently the world thinks that this feature is worth the gigantic amount of electricity consumed.\n\nSimilarly, a ledger (blockchain) protected by lots of electricity has a \"cool\" property. It makes it so that the ledger can't be altered or changed, thus making it excellent for use as immutable (unchangeable), non-inflatable money (details as to why requires many hours of study). The world is in the early process of deciding how much this feature is worth.\n\ntl;dr Neither a refrigerator or the bitcoin blockchain produce anything directly useful with the electricity they use, rather they produce a condition where something useful can occur (e.g. extended shelf life for food in fridge, and information that is extremely difficult and expensive to alter in bitcoin blockchain)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4x0d4b",
                    "author": "wolfofone",
                    "score": 11,
                    "created_utc": 1650079973.0,
                    "response": "The energy use is a feature not a waste. The energy usage secures the network.\n\nThe traditional financial system uses a lot of energy and has an environmental impact as well and their energy use is more for maintaining power and control of the people in power than it is for securing the system from bad actors. I'd say some energy use and environmental impact is worth keeping every participant on a level and secure playing field especially considering the btc network properly rewards and incentivizes/motivates both power generation and energy use efficiencies exploring both improved and cleaner electricity generation and more power efficient miners.\n\nI'd say the only bad side to PoW is all the wasted ASIC silicon that can't be repurposed or easily/efficiently recycled. The asic ewaste, use of limited natural resources, and manufacturing emissions aren't great but it's also not a problem exclusive to btc (look at the smartphone and computing industry and forced obsolesence etc) and at least to the first point the miners having a secondary usefulness would deteriorate the security aspects of mining as the miners should have a sole function and usefulness and the work the miners do should not have other applications (there's a good thread on here somewhere about why the work btc miners do isn't and should not be used for FAH or other distributed computing projects/research).",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i4xqq2i",
                            "author": "DanceAlien",
                            "score": 0,
                            "created_utc": 1650098578.0,
                            "response": "Ah yes, whataboutism, the best form of argument",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i4y4zjq",
                                    "author": "klopptimus-prime",
                                    "score": 3,
                                    "created_utc": 1650110294.0,
                                    "response": "It's not whataboutism, it's simply pointing out that if you think a service, system or commodity has a valuable use case, then energy usage used in the securing or maintenance of that isn't a \"waste\". The fiat system is used as a comparator not to say \"what about this\" but because everyone uses it, understands its value, and its energy usage isn't even talked about because it's no-brainer that energy used to secure it is worth it. Using this argument is simply pointing out that if you actually understand Bitcoin, its use case and potential, the energy usage is just part and parcel of securing that system. Of course, when using this argument, you have to be talking to someone who already has a reasonable grasp of what Bitcoin is and does. So generally it'd have to made to someone who has already taken a few steps down that road, or as part of a larger explanation of the benefits Bitcoin can bring to the table.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i4xmjxr",
                            "author": "Yonngablut",
                            "score": -12,
                            "created_utc": 1650094990.0,
                            "response": "That’s not really a defense if the “network“ isn’t providing a benefit to humanity that mitigates the environmental destruction it causes. Bitcoin has arrived too late in history to justify its preposterous carbon footprint.\n\nYou cannot hold the present banking system responsible for irresponsible energy consumption in this way because it serves the entire globe, facilitates the spending of actual money, and cannot conceivably be phased out by Bitcoin. The entire economy consumes energy… you cannot simply wish it away.  The question is if we can afford to indulge Bitcoin while it tries to find a niche. Since bitcoin’s power consumption can only continue to explode, the answer is “no”.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i4xpc8p",
                                    "author": "Western_Boris",
                                    "score": 4,
                                    "created_utc": 1650097364.0,
                                    "response": "You think Bitcoin is not serving the whole planet and needs to find  a \"niche\"? Or did I understand you incorrectly? And that it is not providing any benefit to humanity???",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i4ybmt4",
                                            "author": "Yonngablut",
                                            "score": -2,
                                            "created_utc": 1650114347.0,
                                            "response": "Correct. Bitcoin’s promise was that it would BE money, not that it would be some sort of abstract commodity that a money’s value could be pegged to. All Bitcoin has turned out to be is an energy wasting delusion.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i4yc5dp",
                                                    "author": "Western_Boris",
                                                    "score": 1,
                                                    "created_utc": 1650114630.0,
                                                    "response": "LOL. DeLuSiOn... wAsTe... You sir do not have brain to understand Bitcoin. Yet. Maybe grow a little and educate yourself. Future you would appreciate it.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i4yemm7",
                                                            "author": "Yonngablut",
                                                            "score": -2,
                                                            "created_utc": 1650115937.0,
                                                            "response": "Well, I know it isn’t money, and that that was its justifying USP. I know that its advocates are looking for any credible narrative to sustain interest in Bitcoin that does not require that Bitcoin BE money. I know that Bitcoin’s radical price fluctuations prevent its mass adoption even as a security. Am I leaving anything out?",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i4zapjv",
                                                                    "author": "Western_Boris",
                                                                    "score": 1,
                                                                    "created_utc": 1650129973.0,
                                                                    "response": "It is literally national currency in one country already and several others are thinking of giving it that status too. \"ItS nOt MoNeY\" :D\n\nThere is no need to do anything for Bitcoin to be interesting option for billions of people. It's rules do the talking. Everyone who learns how it is better and more fair than fiat will stay orange pilled forever. So I don't know what you think you can accomplish by coming to Bitcoin reddit to talk shit like \"it is not money.... delusion.... waste...\"\n\nEvery new asset class is volatile when it's young. Bitcoin too. It is called Price discovery phase. Volatility will get smaller when the asset grows and matures. Maybe this is all new stuff for you. I feel that you are not the kind of person that wants to learn. Just talking BS with the very limited knowledge you got from somewhere and now you think you have figured worlds fastest growing asset out. :D",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i4zhbxm",
                                                                            "author": "Yonngablut",
                                                                            "score": 0,
                                                                            "created_utc": 1650132852.0,
                                                                            "response": ">It is literally national currency in one country already and several others are thinking of giving it that status too. \"ItS nOt MoNeY\" :D\n\nIf you are talking about the Banana Republic of El Salvador, big win. Also: it is not \"national currency\" in the way you are suggesting. It is simply allowed to be used as legal tender, which is not the same thing. And, of course, almost no vendor accepts it. It's too slow, and it's value can shift drastically just in the time it takes to transact with it. Money you can't spend ain't money.\n\n&#x200B;\n\n>There is no need to do anything for Bitcoin to be interesting option for billions of people. It's rules do the talking. Everyone who learns how it is better and more fair than fiat will stay orange pilled forever.\n\nAgain: where can you spend it? Where can you pay your taxes in it? Or your rent? Nowhere. That is because BTC has no natural value because it is only a speculative asset. And since there is nothing at all to ground its value--the radical fluctuations are baked in--it can never achieve mass adoption.\n\n>Every new asset class is volatile when it's young. Bitcoin too. It is called Price discovery phase. Volatility will get smaller when the asset grows and matures. \n\nI will be happy to listen to your examples of the \"price discovery\" phase of an asset similar to BTC--how long it lasted and how it finally resolved-- if you think you can prove that you know what **you're** talking about. Otherwise, I think you are just trying to dazzle me with some jargon. Why should I assume that Bitcoin isn't already as \"mature\" as it will get? How can Bitcoin's price settle when the only thing people do is horgul it? (Hoogul? What's that cutsey bullshit term again?)",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i5076j6",
                                                                                    "author": "Western_Boris",
                                                                                    "score": 1,
                                                                                    "created_utc": 1650144499.0,
                                                                                    "response": "Yeah dude, sure. Im gonna spend soooooo much time with your \"iT iS NoT eVeN mOnEy\" claims. :D",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i50ijdt",
                                                                                            "author": "Yonngablut",
                                                                                            "score": 0,
                                                                                            "created_utc": 1650149578.0,
                                                                                            "response": "You're right. You should invest that time in learning how to work your caps key.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i4xrizl",
                                    "author": "BigTimeButNotReally",
                                    "score": 1,
                                    "created_utc": 1650099286.0,
                                    "response": "Everyone buys BTC at the price they deserve.  Fools like you are going to spend a lot buying your first Sats.  Your salty tears that day will be delicious.  \n\nBut good news, the world will still be fine when you do.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i4ybyno",
                                            "author": "Yonngablut",
                                            "score": 0,
                                            "created_utc": 1650114527.0,
                                            "response": "Your answer, of course, ignores all my points. But that is fine, because we have all heard the “when Bitcoin finally gets here you’re gonna wish you’d bought some” line before. This is “Waiting for Godot” logic.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i4ylgzw",
                                                    "author": "BigTimeButNotReally",
                                                    "score": 1,
                                                    "created_utc": 1650119302.0,
                                                    "response": "LOL you act like its historical trend line isn't up.  That's fine.  You can continue to broadcast your ignorance.  I enjoy the comic relief.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i4ypdor",
                                                            "author": "Yonngablut",
                                                            "score": 0,
                                                            "created_utc": 1650121035.0,
                                                            "response": "Its “trend line” is irrelevant (though it has been plummeting over the past 6 mos, sorry). Bitcoin’s fundamentals are what will make or break it. Right now it’s price is based on pure speculation. No one can find anything to do with Bitcoin because Bitcoin is a cul de sac when it comes to generating wealth.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i4yqbv2",
                                                                    "author": "BigTimeButNotReally",
                                                                    "score": 1,
                                                                    "created_utc": 1650121446.0,
                                                                    "response": "I get it.  You don't like it.  You see what you believe.\n\nBitcoin is the only asset in the world that has a fixed supply.  The only monetary asset that no government controls.  That is what it does.\n\nMy guess is that you turned your nose up at it earlier and your pride won't let you change your mind.  Gonna be an expensive mistake friend.  \n\nYour salty tears are delicious.  Gonna be even better year after year.  Will you make a YT channel soo we can watch your continued squealing?",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i4y1fy3",
                                    "author": "cryptening",
                                    "score": 1,
                                    "created_utc": 1650107720.0,
                                    "response": ">The question is if we can afford to indulge Bitcoin while it tries to find a niche. Since bitcoin’s power consumption can only continue to explode, the answer is “no”.\n\nWhat we shouldn't indulge is people with opinions about things they clearly don't understand. You clearly don't understand energy markets.\n\nBitcoin already found a niche as an energy sink. It is the only global, mobile modular and flexible base load consumer on this planet. It's a huge environment saving USP.\n\nMaybe I am wrong and you do understand how energy works. In that case please inform us of your realistic and profitable way to eliminate methane venting.\n\nMethane gas flaring and venting is responsible for ca. 2% of global warming. The potential electricity generation of (just the reported) flare gas is 6x what bitcoin currently consumes. Within 5 years every single oil company on the planet will be mining Bitcoin to meet their climate goals;) For small and/or remote drilling sites Bitcoin mining is pretty much T.I.N.A. It will turn Bitcoin into a net negative emission industry. The only net negative industry on this planet. [https://www.cnbc.com/2022/03/26/exxon-mining-bitcoin-with-crusoe-energy-in-north-dakota-bakken-region.html](https://www.cnbc.com/2022/03/26/exxon-mining-bitcoin-with-crusoe-energy-in-north-dakota-bakken-region.html)\n\n[https://blog.upstreamdata.ca/](https://blog.upstreamdata.ca/)\n\n[https://www.crusoeenergy.com/blog/5t1IxNQ1ZxTDc2OvaBEERn/green-bitcoin-mining-the-big-profits-in-clean-crypto](https://www.crusoeenergy.com/blog/5t1IxNQ1ZxTDc2OvaBEERn/green-bitcoin-mining-the-big-profits-in-clean-crypto)\n\nIf you can't come up with an alternative to Bitcoin mining then you should be quiet and let us solve one of the biggest environmental problems out there.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i4ye22j",
                                            "author": "Yonngablut",
                                            "score": 1,
                                            "created_utc": 1650115638.0,
                                            "response": "As a Green, I appreciate your desire to “solve one of the biggest environmental problems out there”, but I think I may understand Bitcoin better than you understand energy, because at least I know that Bitcoin does not exist to solve global warming.\n\nBitcoin consumes energy. It is as simple as that. And if Bitcoin is responsible for producing more carbon than it consumes (say, through eating flare gas), and if it is predictable that the effort to acquire the last few yoshis in existence will require the consumption of an ever escalating amount of energy that will not come from windmills and the wagging of puppy dog tails, then Bitcoin must at last be seen as a net negative for humanity in any scenario where reducing the global temperature is critical.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i4yfbow",
                                                    "author": "cryptening",
                                                    "score": 1,
                                                    "created_utc": 1650116293.0,
                                                    "response": ">Bitcoin does not exist to solve global warming.\n\nBitcoin exists and people use it as they see fit. If you think anyone gets to decide what Bitcoin should or shouldn't exist for then you are the one who lacks understanding.\n\nYou didn't give an alternative for the methane flaring issue. Or is 'degrowth' your strategy? \n\nHere is another energy issue where 'degrowth' is just a solution if all one cares about is virtue signalling.\n\nRemember when all those Texans froze to death during that cold snap? That's because they built capacity for the good times. Now they are building renewable capacity for the bad times and it is bitcoin miners who consume all the energy in the 99% of times they don't need max capacity. Without bitcoin miners they could not have financed it.\r  \n\r  \nPOW will be vital for the green energy transition because you need flexible baseload consumers to make it economically feasible. None of the 'Bitcoin is bad because of muh energy' crowd even knows what a flexible base load consumer is, let alone that they can come up with an alternative to bitcoin mining. They come up with things like hydrogen production. You can't just shut down a hydrogen plant within seconds as bitcoin miners are required to do in texas.\n\nSurely you have a better solution.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i4ykpou",
                                                            "author": "Yonngablut",
                                                            "score": 1,
                                                            "created_utc": 1650118940.0,
                                                            "response": "I have now heard Bitcoin used as the cure for everything short of herpes. “It will end government”, “it will end war”,  “it will end climate change“, “it will usher in the Aeon”. Now we can add “it will save frozen Texans” to the list. You sure are asking a lot from your little digital innovation.\n\nYou should at least be honest and fess up to what all this excuse-making is pointing towards. How on earth did Bitcoin go from being a digital currency to something that has to prove it can consume pollution and forge a new destiny for the energy sector? It is because it can do none of these things.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i4z1g46",
                                                                    "author": "cryptening",
                                                                    "score": 1,
                                                                    "created_utc": 1650126041.0,
                                                                    "response": ">It is because it can do none of these things.\n\n[Exxon](https://www.cnbc.com/2022/03/26/exxon-mining-bitcoin-with-crusoe-energy-in-north-dakota-bakken-region.html), [Gazprom](https://jpt.spe.org/gazprom-neft-mines-bitcoin-as-an-alternative-to-flaring-unwanted-gas), [Equinor](https://www.research.arcane.no/news/equinor-partners-with-bitcoin-mining-company) and many more are mining bitcoin right now to cut their methane emissions. These companies are among the largest energy producers in the world. What do you suggest they do with their methane emissions.\n\n[The Texas experiment](https://www.cnbc.com/2021/12/04/bitcoin-miners-say-theyre-fixing-texas-electric-grid-ted-cruz-agrees.html) needs time. We will see in a couple of years.\n\nIt's fine for you to not like Bitcoin. You can also stay ignorant if it makes you feel better. Just don't pretend you are hating on bitcoin for the greater good of the environment. Bitcoin mining is providing practical solutions already running in production. you have provided no solutions.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i4zeva5",
                                                                            "author": "Yonngablut",
                                                                            "score": 1,
                                                                            "created_utc": 1650131767.0,
                                                                            "response": ">Exxon, Gazprom, Equinor and many more are mining bitcoin right now to cut their methane emissions. These companies are among the largest energy producers in the world. What do you suggest they do with their methane emissions.\n\nWhy on earth wouldn't Big Fossil be 100% behind Bitcoin? The mere existence of BTC increases the demand for their products immensely, and also makes meeting Climate Change goals all but impossible, preventing the phase-out of fossil. It's win/win. Do you doubt that Satoshi is the code name for a think tank cooked up by BP?\n\nAs for mining Bitcoin to burn off their methane? All the better! It increases the price, and therefor the demand, of Bitcoin, multiplying the energy consumption.\n\n&#x200B;\n\n>It's fine for you to not like Bitcoin. You can also stay ignorant if it makes you feel better. Just don't pretend you are hating on bitcoin for the greater good of the environment. Bitcoin mining is providing practical solutions already running in production. you have provided no solutions.\n\nWhat ignorance do you think I am demonstrating about Bitcoin? It began by promising it would be money, fell on its face, and is now trying to rebrand. In the meantime, no one can explain what a person can do with the Bitcoin they own except hoodle it and then try to unload it during one of its price peaks. Bitcoin quite literally serves no other function than as an amusement park for speculative cash.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i4x039n",
                    "author": "FerrisMichaels",
                    "score": 20,
                    "created_utc": 1650079824.0,
                    "response": "Light bulbs are a waste of electricity if you’re blind. Your friends are likely part of the 11% of the humans on earth who are able to participate in the “global” financial system and are blind to the realities of the rest of the world.\n\nI recommend the book “Check your Financial Privilege” by Alex Gladstein.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i4xpklk",
                            "author": "Western_Boris",
                            "score": 6,
                            "created_utc": 1650097566.0,
                            "response": "There is good video about this too: https://youtu.be/qvwqoYSani0",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i4y5ajj",
                            "author": "squireofrnew",
                            "score": 3,
                            "created_utc": 1650110499.0,
                            "response": "Same energy output as christmas lights? I never saw a source but that was my favourite response last time this thread popped up.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i4xiojb",
                    "author": "azoundria2",
                    "score": 7,
                    "created_utc": 1650091834.0,
                    "response": ">If you don't believe me or don't get it, I don't have time to try to convince you, sorry.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4xrrud",
                    "author": "Bitcoin__Hodler",
                    "score": 3,
                    "created_utc": 1650099503.0,
                    "response": "start with \"why bitcoin\". \n\nwhen someone has no answer to that question, every amount of engery that bitcoin is using is a waste",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4xx95g",
                    "author": "sebikun",
                    "score": 3,
                    "created_utc": 1650104283.0,
                    "response": "Fastest way. \n\nLet them explain you what Bitcoin is 🤣\n\nSecond. \nDon't explain them to much and let them answer it by themselves. Ask more then explaining. \nHow much energy does it consume? How much percentage is it compared to the rest of the world?\nWhat consumes the most energy, is it necessary? \nWhat do you mean by nothing, why is BTC nothing for you?\n\nSo if I got you, you don't like: a peer-to-peer digital currency that has solved the double-spend problem using a distributed ledger and proof-of-work. consensus protocol without the need for a trusted third party?\n\nAlright as you are the guy that trusts more then verify, Trust me dude Bitcoin is nice. Just trust me 😂\n\nBy asking them smart, funny, let them know they don't know shit and they're just talking what they see on the media without any research.\n\nThat's the way dude. Better you ask and don't proof your point, if they are interested explain. Most times they just want to shit their unknownledge on you and that's a waste of your time.\n\nBe smart, cool and laugh while they find out, step by step they don't know shit 😉\n\n\nEdit: You could also add something like, do you think the monetary system will save us, survive? QE is this really the way? Stopping people to withdraw money like in Cyprus, Greece 2008, today Canada and Russia?\nI'm not and I try to find out what could work out in the future when the monetary bubble we are in, will pop again, after I spend 100, 1000 of hours to study Bitcoin and Blockchain.\n\n**Dude but the last one definitely only if there's some interest from them, 99% have no clue what you would be talking about and that's a waaaaaste of time. You can't communicate well with people they know shit about a topic**",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i515w2b",
                            "author": "Purple_Obvious",
                            "score": 2,
                            "created_utc": 1650160640.0,
                            "response": "This was actually one of the best responses I’ve seen so far. You ask some of these questions and 99% of people will just show ignorance from the start. This is the right way to deal with the question imo",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i519si0",
                                    "author": "sebikun",
                                    "score": 1,
                                    "created_utc": 1650162645.0,
                                    "response": "Thank you very much sir.\nAfter talking a lot with people about this topic I found out, you have to differentiate between shittalkers and people they just don't get it 👍",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i4y02wr",
                    "author": "roeJimmy_roe",
                    "score": 3,
                    "created_utc": 1650106637.0,
                    "response": "“Then short it”",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4y1mj3",
                    "author": "cody_comaboy",
                    "score": 3,
                    "created_utc": 1650107862.0,
                    "response": "it lets people flee from warzones without losing their savings, it allows people who are banned from the financial systems to still transact with others, it frees the oppressed from retaliation and confiscation. it might not add value to **you**, but it doesn't mean it has no utility in the world. the altruistic case for bitcoin is very real.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4y3we0",
                    "author": "no-vaseline",
                    "score": 3,
                    "created_utc": 1650109543.0,
                    "response": "Use UNO reverse card in them. Ask them why are they consuming a lot of food and O2 without producing anything...",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i508rli",
                            "author": "Vipu2",
                            "score": 1,
                            "created_utc": 1650145208.0,
                            "response": "Was gonna say something similar to this but this is better than the thing I had in my mind",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i4zzb2e",
                    "author": "esotericunicornz",
                    "score": 3,
                    "created_utc": 1650140972.0,
                    "response": "All the wasted flared natural gas in US natural gas fields could power the ENTIRE bitcoin network seven times over.\n\nInstead of being vented to the atmosphere it is being used to power miners instead, reducing pollution. \n\nBitcoin seeks WASTE and CHEAP energy which is usually not fossil fuels, and in the long run is less and less fossil fuels.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4wwhxo",
                    "author": "rokman",
                    "score": 7,
                    "created_utc": 1650077900.0,
                    "response": "Don’t tell them about toilet paper",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i4x8feo",
                            "author": "turbulance4",
                            "score": 1,
                            "created_utc": 1650084624.0,
                            "response": "Bidet gang rise up!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i4xn9q6",
                                    "author": "Trifusi0n",
                                    "score": 6,
                                    "created_utc": 1650095594.0,
                                    "response": "What a waste of water, CoNsIdEr ThE eNvIrOnMeNt",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i4yeisz",
                                            "author": "Schwanzerfaust",
                                            "score": 2,
                                            "created_utc": 1650115882.0,
                                            "response": "You can use rain water for it. Just remove the pine needles from your anus afterwards.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i4x1w8i",
                    "author": "eat-sleep-rave",
                    "score": 4,
                    "created_utc": 1650080816.0,
                    "response": "Ask them if they're gamers :-)",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i4xliqs",
                            "author": "Walmart_Warrior_420",
                            "score": 0,
                            "created_utc": 1650094134.0,
                            "response": "or pr0n watchers    ( ͡° ͜ʖ ͡°)",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i4xdbk9",
                    "author": "bigldk10",
                    "score": 5,
                    "created_utc": 1650087813.0,
                    "response": "Ignore them, walk away, and then after you get rich, send them a post card from the island you bought.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i4yem5e",
                            "author": "Schwanzerfaust",
                            "score": 1,
                            "created_utc": 1650115930.0,
                            "response": "So I need to build a post office on my island for them? Nah.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i4xxal1",
                    "author": "meadowpoe",
                    "score": 4,
                    "created_utc": 1650104315.0,
                    "response": "I always ask them about lights of their xmas trees or their fancy city lights… \n\nEnergy is there to be consumed and its actually fair to use it as long as you pay the price for it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4xjl3l",
                    "author": "utookthegoodnames",
                    "score": 2,
                    "created_utc": 1650092557.0,
                    "response": "You don’t need to convince your peers that bitcoin is great. \n\nJust stack your sats. :)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4xwzwy",
                    "author": "BigPlayCrypto",
                    "score": 2,
                    "created_utc": 1650104066.0,
                    "response": "Respond like this 😑",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4xxqjy",
                    "author": "mathaiser",
                    "score": 2,
                    "created_utc": 1650104692.0,
                    "response": "Don’t.  It’s not your place to convince them.  Let them feel the pain of their ignorance.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4xzjbh",
                    "author": "IncognitoJohnson",
                    "score": 2,
                    "created_utc": 1650106180.0,
                    "response": "1. Very amenable to renewables\n2. Possibly/probably uses less than fiat\n3. Incentivizes responsible spending, reduction of corruption, and better usage of the energy not used for Bitcoin mining",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4xzny4",
                    "author": "Exterminate_The_Mods",
                    "score": 2,
                    "created_utc": 1650106288.0,
                    "response": "Dump friends.\n\nPump Bitcoin.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4y2wjg",
                    "author": "Jag_C",
                    "score": 2,
                    "created_utc": 1650108824.0,
                    "response": "Tell them it can help:\n\nFunding green energy projects.\n\nMining energy that would otherwise be wasted\n(You can even turn poop into bitcoin lol).\n\nMining energy source in remote location (cost on transportation of electricity is high). \n\nBitcoin consume less than soon to become useless banks overall.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4y35i1",
                    "author": "FieserKiller",
                    "score": 2,
                    "created_utc": 1650109008.0,
                    "response": "you could answer with a classic Satoshi Nakamoto quote: \"If you don't believe me or don't get it, I don't have time to try to convince you, sorry.\"",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4y60wb",
                    "author": "ProfessorPurrrrfect",
                    "score": 2,
                    "created_utc": 1650110982.0,
                    "response": "Just let them go thru their “laugh at crypto” phase. Soon they will become curious enough to buy",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4y67ne",
                    "author": "MrMediaShill",
                    "score": 2,
                    "created_utc": 1650111104.0,
                    "response": "You shouldn’t",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4zky6j",
                    "author": "Miffers",
                    "score": 2,
                    "created_utc": 1650134450.0,
                    "response": "Say \"My golly, you're right!\"",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4wy0pq",
                    "author": "dadlif3",
                    "score": 7,
                    "created_utc": 1650078709.0,
                    "response": "Sounds like the thousands of hours and electricity that people waste playing video games that produce nothing.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i4xuuis",
                            "author": "lessioa",
                            "score": 3,
                            "created_utc": 1650102214.0,
                            "response": "It does produce something. It’s called happiness.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i4wyjob",
                            "author": "TheVoidKilledMe",
                            "score": 4,
                            "created_utc": 1650078990.0,
                            "response": "I fell offended i am going to cry",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i4wwwnx",
                    "author": "192838475647382910",
                    "score": 2,
                    "created_utc": 1650078115.0,
                    "response": "Explain what the problem is, tell them about the solution, let them figure out the rest.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i4xllb1",
                            "author": "Walmart_Warrior_420",
                            "score": 0,
                            "created_utc": 1650094194.0,
                            "response": "The problem is I want to work the same amount, but have more chicken tendies and honey mustard dip in the future.   Bitcoin.    ( ͡° ͜ʖ ͡°)",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i4wy8q2",
                    "author": "ctamayos",
                    "score": 2,
                    "created_utc": 1650078828.0,
                    "response": "Yes!\n\nDoes this sound familiar with any other transformation process?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i4xncsx",
                            "author": "Trifusi0n",
                            "score": 2,
                            "created_utc": 1650095668.0,
                            "response": "The internet is a waste of resources and doesn’t have any real world application",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i4xlne1",
                            "author": "Walmart_Warrior_420",
                            "score": 1,
                            "created_utc": 1650094242.0,
                            "response": "I would also like electric cars to be weightless   ( ͡° ͜ʖ ͡°)",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i4wz5b8",
                    "author": "SHA256dynasty",
                    "score": 2,
                    "created_utc": 1650079315.0,
                    "response": "the people who spend their time and money mining bitcoin don't think it's a waste. if it is truly a waste, it should die out sooner or later, right?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4x1io5",
                    "author": "caballo880",
                    "score": 2,
                    "created_utc": 1650080609.0,
                    "response": "Sounds like the fiat system which requires a lot of energy such as banks and money printers and admin and processing and all the paper shuffling garbage and bureaucracy that goes with it. Only that fiat currency is not only worth nothing but it is a debt and perpetuating debt slavery that has to be repaid with the sweat, tears and labor of future generations but can never ever be repaid because there is never enough fiat in the system to even repay that outstanding debt.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4wzcz4",
                    "author": "hiro5id",
                    "score": 1,
                    "created_utc": 1650079429.0,
                    "response": "Resources go into producing regular cash too.  They are little pieces of paper.  Why are they even worth anything?  Absolutely no reason other than that people agreed to give it value.  It’s all in our imagination.  If aliens came they would be scratching their heads why we are so obsessed with collecting these little green pieces of paper with pictures on them.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i4yk9mk",
                            "author": "erefernow",
                            "score": 3,
                            "created_utc": 1650118729.0,
                            "response": "Cotton seed harvesting, cleaning and storage. Cotton planting, fertilization, irrigation, pest control. Fiber harvesting, cleaning processing distribution. Ditto for flax. Cotton/flax blending and production of mint sheets. (Not going to discuss inks). Running sheets through the printer (can go off on a documentary on energy associated costs of printing press manufacturing and operation). Cutting larger printed sheets into small bills, stacking and banding. Distribution of printed bills to banks and ATMs (can go off on a documentary of energy associated costs of construction of physical banks and ATMs). Air conditioning and lights used in physical banks. Electricity used to run ATMs. Electricity used to run security systems.\n\nThe energy costs are endless.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i4xx5bk",
                    "author": "Crypto_bro999",
                    "score": 1,
                    "created_utc": 1650104196.0,
                    "response": "Just argue with them. Stupid people will be stupid.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4xluxo",
                    "author": "Yonngablut",
                    "score": -1,
                    "created_utc": 1650094412.0,
                    "response": "You should admit that they are right.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4wzpj1",
                    "author": "no1cares842157903",
                    "score": 1,
                    "created_utc": 1650079614.0,
                    "response": "Look at that one messari chart. Bitcoin is literally NOTHING compared to the others",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4x6uzg",
                    "author": "jjkoto",
                    "score": 1,
                    "created_utc": 1650083671.0,
                    "response": "I wonder how much energy is consumed by using debit cards by over 2 billion people? Think about all of the servers…. POS machines, computers at checkout, Entire headquarters for Visa? Shouldn’t they just use cash? What does that system actually “produce?”",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4x7xli",
                    "author": "donaudelta",
                    "score": 1,
                    "created_utc": 1650084320.0,
                    "response": "computer gaming consumes a lot of energy and time and apparently doesn't produce anything, which isn't true.  \nnot an explanantion but kinda.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4x8o4h",
                    "author": "Vizjereion",
                    "score": 1,
                    "created_utc": 1650084775.0,
                    "response": "Listen to WBD podcasts with Troy Cross",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4x9m0u",
                    "author": "Low-Cup-1757",
                    "score": 1,
                    "created_utc": 1650085344.0,
                    "response": "That’s the point, the energy used to secure the network is the value. It’s more secure than anything else and allows real decentralization. It’s has potential to do good for the environment bc it offers financial incentive for green energy technologies and streamlining the traditional financial system which is also energy intensive.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4xat4s",
                    "author": "Massakahorscht",
                    "score": 1,
                    "created_utc": 1650086108.0,
                    "response": "Securing the network of a decentral money System for the whole World? If they dont See value in it than ok. Consuming energy for most people is ok when they think its normal and make something practical. For example all the laundry dryer in the United States consumes as much energy a day as the bitcoin network a day. Nobody questions the drying but bitcoin...it is Hard to understand for people without doing a deep dive. I mean they hear it in the media and everywhere, could also be pos and we already habe a nice money System etc. Its always Just politics.  Nobody asks to stop Selling or produce Tesla even if most energy isnt green at the moment. But that isnt a Problem of Tesla. The energy Provider have to be pushed,  not bitcoin, to give more green energy. And if nicely done bitcoin could safe all the overproduced energy of for example Wind parks during nights when there is lot less energy need. It would be cheaper and more effective but the people on the top have to See it",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4xm81y",
                    "author": "dlq84",
                    "score": 1,
                    "created_utc": 1650094712.0,
                    "response": "Cool, we have a name for \"nothing\" now :)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4xqzrp",
                    "author": "Public-Gap4804",
                    "score": 1,
                    "created_utc": 1650098818.0,
                    "response": "why do you even care? when we do that, it makes us look like those religion weirdos who tell everyone why their god is better than your god. Let fools be fools, use the fact people don't know  shit and buy with lower prices.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4xtyb0",
                    "author": "Kaiisim",
                    "score": 1,
                    "created_utc": 1650101429.0,
                    "response": "TVs being left on standby in the US use more energy. \n\nThe energy issues bitcoin has is because of dependence on fossil fuels and low energy costs from those fossil fuels in some parts of the world. \n\n\"Bitcoin uses more electricity than Argentina\" true but Argentina is a small country that doesn't have a significant manufacturing industry. Compare it to the big polluting countries with massive manfuacturing infrastructure and it becomes a tiny fraction. \n\n\"Oh but traditional finance uses a fraction of the energy\". Yes the actual physical computer system that finance uses is a tiny amount of energy. But what about the people? Those computer systems dont run themselves. Its a completely unfair comparison. 1.94 million people work for FDIC insured banks in the US. Thats 1.94 million to make the banking sector work - just in the United States. How much energy, pollution and waste that many people going to work costs? \n\nAsk them to describe what happens when they use their visa card for example. Do they know how many people are involved in that transaction? \n\nIts just a logical fallacy ultimately. Bitcoin is better than the current system, it doesnt need to be perfect.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4xwkle",
                    "author": "alifkhalil469",
                    "score": 1,
                    "created_utc": 1650103693.0,
                    "response": "Everything consumes energy. Your mobile device and laptop consume energy, your light bulbs consume energy as well. But mining BTC and maintaining the blockchain, consume way too excessive enormous energy, especially when you’re mining in bulk or maintaining a huge blockchain.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4xwtyk",
                    "author": "butch_cassidy88",
                    "score": 1,
                    "created_utc": 1650103919.0,
                    "response": "Ask them why they don’t short it",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4xwy92",
                    "author": "KMan471",
                    "score": 1,
                    "created_utc": 1650104023.0,
                    "response": "Tell them to shut off the television, and start thinking for themselves. For fucks sake. People are so damn stupid.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4xyr51",
                    "author": "TheChildOfChange",
                    "score": 1,
                    "created_utc": 1650105541.0,
                    "response": "Have Fun Staying Poor",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4xz7t8",
                    "author": "Bruru",
                    "score": 1,
                    "created_utc": 1650105922.0,
                    "response": "I does not consumes lots of energy, it only consumes the same like a small country.  And the energy it consumes is mostly \"garbage\", so in a way it's recycling energy. Bitcoin \"produces\" a platform, on this platform people build stuff, this is know as economic activity, it's creates trade, jobs, ... not sure how your friend does not see this :-)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4y0ebr",
                    "author": "omya123",
                    "score": 1,
                    "created_utc": 1650106893.0,
                    "response": "buy btc >> hold btc >> show your friends Lamborghini in 4+ years >> ????? >> Profit",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4y27f6",
                    "author": "Put-Alert",
                    "score": 1,
                    "created_utc": 1650108299.0,
                    "response": "We shouldn't ignore yhe energy consumption, despite it being much lower than the banking industry.  We should admit it's an issue and it should be addressed.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4y7kek",
                    "author": "TheGoldenFade",
                    "score": 1,
                    "created_utc": 1650111957.0,
                    "response": "Just don't.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4y8hn8",
                    "author": "DisorientedPanda",
                    "score": 1,
                    "created_utc": 1650112522.0,
                    "response": "I always laugh at people that care so much about the environment but won’t stop harming animals and become vegan which is the single biggest impact a single person can make on emissions.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4y9108",
                    "author": "x1289",
                    "score": 1,
                    "created_utc": 1650112848.0,
                    "response": "[this](https://www.danheld.com/blog/2019/1/5/pow-is-efficent)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4y98fe",
                    "author": "infinite_dendrite",
                    "score": 1,
                    "created_utc": 1650112973.0,
                    "response": "It produces monetary security for every single person on earth.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4ybfnw",
                    "author": "hashe121",
                    "score": 1,
                    "created_utc": 1650114239.0,
                    "response": "Just like money were backed up on the gold standard, BTC is on the \"energy standard\". This is an ideea that Henry Ford had, show them this:\n\nhttps://bitcopy.co.uk/wp-content/uploads/2020/08/henryfordenergycurrency.png",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4ycz5z",
                    "author": "FrostyMug21",
                    "score": 1,
                    "created_utc": 1650115080.0,
                    "response": "Get new friends.  Yours seem stupid.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4yd4nr",
                    "author": "Ziggy_Moneymaker",
                    "score": 1,
                    "created_utc": 1650115158.0,
                    "response": "I bet your friends consume lots of energy and produce nothing as well. So why don’t we ban your friends?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4ye3pw",
                    "author": "atxnfo",
                    "score": 1,
                    "created_utc": 1650115661.0,
                    "response": "Neither does their house- so what?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4ye6h5",
                    "author": "LemonKnuckles",
                    "score": 1,
                    "created_utc": 1650115702.0,
                    "response": "Tell them it produces the possibility of an alternate monetary system from within which solving the climate crisis is actually possible.  Our current monetary system is fundamentally broken and will forever delay the possibility of a true climate solution.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4yerb0",
                    "author": "jimbowymbo",
                    "score": 1,
                    "created_utc": 1650116003.0,
                    "response": "Why do you want to explain? If they haven't got it yet, they will never get it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4yf1yp",
                    "author": "FunkyGrass",
                    "score": 1,
                    "created_utc": 1650116152.0,
                    "response": "How should I explain you that you’re stupid and you should just STFU? 🤣",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4yf2ga",
                    "author": "FixedGearJunkie",
                    "score": 1,
                    "created_utc": 1650116160.0,
                    "response": "The energy consumed by Bitcoin is used to produce the most powerful, most secure, hardest money the world has ever known. That's hardly \"nothing\". If your friends can't understand it, stop trying to convince them. They'll buy Bitcoin at the price they deserve just like everyone else.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4yf3z9",
                    "author": "FunkyGrass",
                    "score": 1,
                    "created_utc": 1650116181.0,
                    "response": "How should I explain you that you’re stupid and you should STFU?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4yfoss",
                    "author": "jbelshaw55",
                    "score": 1,
                    "created_utc": 1650116479.0,
                    "response": "Ask them what does a bank produce? And how much energy does a network of physical buildings use with thousands of employees?  Compared like that it's not such an obvious answer.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4ygnv6",
                    "author": "Revolutionary-Row479",
                    "score": 1,
                    "created_utc": 1650116973.0,
                    "response": "Let them know they are ngmi",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4yh6cn",
                    "author": "jimmajamma4",
                    "score": 1,
                    "created_utc": 1650117226.0,
                    "response": "You:. You're right this Bitcoin thing is useless.\nContinues to stack sats\n5 years later\n\nFriends:. Wtf!?  Why didn't you tell us about Bitcoin it's so amazing!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4yiwmh",
                    "author": "ranamok",
                    "score": 1,
                    "created_utc": 1650118077.0,
                    "response": " Just tell them they might be right, close the Lambo door and drive away. :)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4yj6d5",
                    "author": "skapaneas",
                    "score": 1,
                    "created_utc": 1650118207.0,
                    "response": "dont bother with plebs.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4yjxsa",
                    "author": "Hank___Scorpio",
                    "score": 1,
                    "created_utc": 1650118573.0,
                    "response": "Thank them for helping keep the price low. \n\n\"Tell me everything you know about monetary history and US monetary policy. Go.\"\n\nA lot of peoples opinions are formed on emotion. People missed getting rich on bitcoin and they're afraid to jump in now. Pretending like bitcoin is useless frees them of the anxiety to have to make moves. They will cling to any statement that puts bitcoin in a bad light so they can feel like they are making the correct choice for staying out of bitcoin.\n\nYou can not fight emotion with logic. You have to play their game and fight with emotionally coercive tactics if you are bent on changing their minds. You an only show people the door, its up to them to take the step.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4ykk5i",
                    "author": "assclown356",
                    "score": 1,
                    "created_utc": 1650118866.0,
                    "response": "Find new friends",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4ykwir",
                    "author": "Thanis_in_Eve",
                    "score": 1,
                    "created_utc": 1650119031.0,
                    "response": "Tell them about clothes dryers.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4ylm3f",
                    "author": "Raine386",
                    "score": 1,
                    "created_utc": 1650119369.0,
                    "response": "“Liberals are rotting your brain.”",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4ylwrp",
                    "author": "BeemanIT",
                    "score": 1,
                    "created_utc": 1650119507.0,
                    "response": "Who turns out the lights in big skyscrapers banks own?  They typically stay on all the time.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4ymehm",
                    "author": "XXsforEyes",
                    "score": 1,
                    "created_utc": 1650119727.0,
                    "response": "So does refrigeration but no one is arguing the usefulness of that.\n\n“Oh but it keeps my food from spoiling so it’s saving me money!”\n\nMeanwhile, mining Bitcoin is only securing a revolutionary trillion dollar worldwide financial system.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4ymmmz",
                    "author": "HODL_monk",
                    "score": 1,
                    "created_utc": 1650119829.0,
                    "response": "Almost every current use of energy consumes lots of energy and produces nothing. Tell me, what does Candy Crush do ? Does it consume a lot of energy and produce nothing ? Yes it does. How about Christmas lights, Drag racing, undercarriage lighting, gold mining ? You may think that gold mining produces gold, but how is that any different than Bitcoin mining producing Bitcoin ? Its not. People just get excited about the shiny thing, and look at it in a vacuum, and conveniently ignore everything else in our economy that functions basically the same energy wise. I'm not excusing the energy usage or productivity of Bitcoin mining, which are real issues, only saying that they are normal issues that most energy uses in the US have, so picking out Bitcoin for extra scrutiny is not justified, just because its not grandfathered in.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4ynrin",
                    "author": "hopelesslyhip",
                    "score": 1,
                    "created_utc": 1650120337.0,
                    "response": "Have them explain the productivity of banks to you.\n\nBTC is 100x? 1000x?  more efficient in exchange of value. It will allow society to focus on actual productive pursuits",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4ynvwx",
                    "author": "Timcrypto1308",
                    "score": 1,
                    "created_utc": 1650120390.0,
                    "response": "Who the hell cares",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4yok41",
                    "author": "kriheli",
                    "score": 1,
                    "created_utc": 1650120674.0,
                    "response": "“so does this argument.”",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4yp8fz",
                    "author": "garrulous_theory",
                    "score": 1,
                    "created_utc": 1650120970.0,
                    "response": "Thismachinegreens.com",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4ypp7q",
                    "author": "Distinct-Vanilla-788",
                    "score": 1,
                    "created_utc": 1650121178.0,
                    "response": "Agree.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4yptg7",
                    "author": "_befree_",
                    "score": 1,
                    "created_utc": 1650121227.0,
                    "response": "Bitcoin mining not only only stabilizes grids by running around the clock, but it incentives the development and production of more efficient computers. \n\nThere is even an oil drilling company that is using their   natural gas flair to to power a generator to mine bitcoin. This is a closed circuit not connected to the grid. So it’s because of bitcoin miners they aren’t just burning this gas off into the atmosphere at a loss. There are companies using the heat from miners to cut down on heating costs. \n\nYour friend is parroting what the news is telling him without even considering the potential energy savings. He has almost no foresight for the ingenuity of man.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4ypulp",
                    "author": "Hqjjciy6sJr",
                    "score": 1,
                    "created_utc": 1650121241.0,
                    "response": "It produces a secure network that can be used as a fair store of value. Unlike cash that is unfair, because it is printed by central banks whenever they like. and in case of USD, its hegemony is secured by bombing any country that decides to use some other currency. military consumes infinitely more energy than bitcoin and bombing is kinda bad for the environment.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4ypur2",
                    "author": "Distinct-Vanilla-788",
                    "score": 1,
                    "created_utc": 1650121243.0,
                    "response": "People live in a fear based state of mind.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4yq6l4",
                    "author": "edwilli222",
                    "score": 1,
                    "created_utc": 1650121385.0,
                    "response": "If you don’t value a thing, the expense of energy to produce that thing will seem pointless. They will always be critical of expending energy on bitcoin if they don’t value bitcoin.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4yqomp",
                    "author": "One_Psychology_6500",
                    "score": 1,
                    "created_utc": 1650121598.0,
                    "response": "It produces personal property rights for all humanity for the first time in history.\n\nAnd a future with less energy use by humanity is a dystopia.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4yrcq6",
                    "author": "smhanna",
                    "score": 1,
                    "created_utc": 1650121883.0,
                    "response": "Everyone seems to forget that the banking system contains thousands of electricity-sucking brick and mortar locations, vast data storage networks, and can take our money and use it however they want.   Bitcoin isnt worse on the electricity front, and definitely better on the trust and security front.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4yrkmc",
                    "author": "KirbySmartGuy",
                    "score": 1,
                    "created_utc": 1650121977.0,
                    "response": "Tell them everything uses energy and that Bitcoin is more renewable and or wasted energy (flared nat gas). \n\nI just think that is the argument of the uninformed, and it’s incredibly lazy.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4yt9gr",
                    "author": "Tvmouth",
                    "score": 1,
                    "created_utc": 1650122671.0,
                    "response": "Produce nothing from the conversation. Don't' burn calories to educate this person, because the data serves no purpose. Don't' burn calories to BUILD TRUST with a person that expects the outcome to be producing nothing. Don't' waste your time investing your hard earned food supply into mouth noises, because it has no value to you. It produces nothing.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4ytve0",
                    "author": "ChrimsonChin988",
                    "score": 1,
                    "created_utc": 1650122923.0,
                    "response": "Break it down into smaller pieces.\n\nFirst they must understand how bitcoin works and what it aims to do.\n\nNext, you address the energy consumption and how it is related to making the network secure and reliable.\n\nThe reason there are so many dummies like your friends who will parrot this dumb narrative of 'bitcoin does not produce anything, yet consumes a lot of energy' is because they don't even understand how bitcoin works in the first place.\n\nUnless someone is very perceptive and has an inclination for engineering/economics, you cannot get them to wrap their heads around why it's stupid what they're saying in the slightest unless you explain for hours on end. Which, again, is why many people believe this stupid shit. Because they're dumb and/or haven't put in the study time and this is not intuitive to understand for most people.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4yud0g",
                    "author": "ZenBacle",
                    "score": 1,
                    "created_utc": 1650123126.0,
                    "response": "Maybe admit to yourself that it might be true? The value of Bitcoin is purely speculative right now. And there is a tremendous amount of energy being wasted on solving cryptographic problems that yield no value beyond \"I exist\".",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4ywsq3",
                    "author": "dig_bick_super_man",
                    "score": 1,
                    "created_utc": 1650124132.0,
                    "response": "Innovation doesn’t wait for the approval of the masses. Is a refrigerator not a waste of energy? Is ac not a waste of money? What makes these things worth the expense? The only way to criticize these things is to consider the alternative. In this case, the dollar losing value and the cost of running banks and financial institutions. \n\nPeople said cars were simply a novelty, and most of the population in the early 20th century thought they’d be riding horses for the rest of their lives. 60 years later something like 80% of the population owned a car. Some people knew cars would be the future of transportation, but the vast Majority couldn’t understand how this was possible.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4yxrlq",
                    "author": "nqvst",
                    "score": 1,
                    "created_utc": 1650124534.0,
                    "response": "Youtube consumes nearly double the amount of electricity of what bitcoin uses.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4z2yki",
                    "author": "fannybagz2000",
                    "score": 1,
                    "created_utc": 1650126678.0,
                    "response": "Just let them live in ignorance",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4z305m",
                    "author": "Adamsd5",
                    "score": 1,
                    "created_utc": 1650126697.0,
                    "response": "https://ourworldindata.org/energy-mix\n\nAt the total level, from 2009 to 2019, energy consumption went from 145,881 TWH to 173,340 TWH.  An increase of 27,459 TWH.  188 of that was bitcoin mining. \n\nBitcoin mining is currently around 0.1% of consumption, and accounts for about 0.6% of the energy consumption increase in the past 10 years.\n\nIs Bitcoin really the energy problem we should be fighting?  (This argument continues to hold for 2020 and 2021 data, with slightly different numbers).",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4z31wu",
                    "author": "Digital-Shredda",
                    "score": 1,
                    "created_utc": 1650126718.0,
                    "response": "Don’t explain shit……simply use their toilet without flushing.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4z4d2s",
                    "author": "I_Plumber",
                    "score": 1,
                    "created_utc": 1650127276.0,
                    "response": "Any current issue with bitcoin is a fiat issue. \n\nTake the issues people bring up against btc, and it all stems back to a fiat economy. Greed, manipulation, (not) federal reserve (no reserves) leading the charge.\n\nOther than that just ignore it, and buy more sats.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4z4nyp",
                    "author": "MNM2884",
                    "score": 1,
                    "created_utc": 1650127401.0,
                    "response": "Tell them the moment you convert 1 Bitcoin to USD you automatically get more than what they make per year. Idk man",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4z5kfj",
                    "author": "Particular-Edge-7666",
                    "score": 1,
                    "created_utc": 1650127787.0,
                    "response": "Stop trying to explain anything. Focus that energy on accumulating more. Then I'm ten years ask them all how much energy they are using to pay bills and day to day living.. Then explain how you get to do whatever you want with YOUR energy. And point out how much ENERGY they use everyday that they don't get any say so in. \nEnergy... Depend on how you look at it I guess..",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4z7mzl",
                    "author": "btc_has_no_king",
                    "score": 1,
                    "created_utc": 1650128661.0,
                    "response": "Just produces the most secure computer network in history.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4z7s1n",
                    "author": "WallStLegends",
                    "score": 1,
                    "created_utc": 1650128720.0,
                    "response": "Give up. Pursue your dreams alone. And when you're successful that will speak more than you ever could.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4z7th7",
                    "author": "gibsondog9",
                    "score": 1,
                    "created_utc": 1650128737.0,
                    "response": "So does printing money",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4z800r",
                    "author": "Boosehead",
                    "score": 1,
                    "created_utc": 1650128816.0,
                    "response": "Ask them what they produce..",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4z8jqx",
                    "author": "fplfreakaaro",
                    "score": 1,
                    "created_utc": 1650129052.0,
                    "response": "1> You cannot have a money without a production cost. Otherwise it’s just same as printing money out of thin air.\n\n2> proof of stake requires trust in humans which is exactly the reason proof of work invented. There is no alternative to pow.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4z8vjx",
                    "author": "saucedonkey",
                    "score": 1,
                    "created_utc": 1650129191.0,
                    "response": "Ask what exactly is nothing when we live in the internet age.  Is it nothing because it’s intangible?  The argument that Bitcoin produces nothing is not based in the reality of the time we live in.  Of course Bitcoin is something.  It’s the Bitcoin Network!  It’s value is derived from scarcity, security, and the added value of moving money without a middle man.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4z90e5",
                    "author": "kilowattkill3r",
                    "score": 1,
                    "created_utc": 1650129248.0,
                    "response": "\"Consumes a lot of energy and produces nothing\"\n\nSounds a lot like the NYSE",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4z92yb",
                    "author": "BoostProfit",
                    "score": 1,
                    "created_utc": 1650129278.0,
                    "response": "TELL THEM THEY DO THE SAME!!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4zayku",
                    "author": "oyxyjuon",
                    "score": 1,
                    "created_utc": 1650130082.0,
                    "response": "it doesnt produce nothing.\n\nit permanently confirms transactions onto the most secure ledger in the world, with a reward of 6.25 bitcoin per block.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4zcf5p",
                    "author": "Elum224",
                    "score": 1,
                    "created_utc": 1650130711.0,
                    "response": "Bitcoin mining isn't actually mining, it's security for $745 billion dollars of assets.\n\nAsk them if they know how much energy it costs to secure the same value of gold, homes cars etc. \n\nBitcoin is very efficient on a per $ basis in terms of energy usage.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4zeswd",
                    "author": "fleeingtoupe",
                    "score": 1,
                    "created_utc": 1650131739.0,
                    "response": "What does streaming do? What about Amazon, everyone can go to the store themselves without Amazon? Is there any other technology enabling 3 minute global transfers?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4zf0nj",
                    "author": "walloon5",
                    "score": 1,
                    "created_utc": 1650131833.0,
                    "response": "It uses a lot of energy and produces something they dont value - yet",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4zfanl",
                    "author": "Overwatch_1ightning",
                    "score": 1,
                    "created_utc": 1650131955.0,
                    "response": "Tell them that brick and mortar financial institutions consume a hell of a lot more.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4zh0tn",
                    "author": "Mysterious-Emu-4503",
                    "score": 1,
                    "created_utc": 1650132716.0,
                    "response": "Tell them it produces a defense system agaisnt theft. Compare it to our militaries use of energy to protect property. Then send them this\n\nhttps://youtu.be/fy41AxFdx0Y",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4zi87e",
                    "author": "BDM-Archer",
                    "score": 1,
                    "created_utc": 1650133245.0,
                    "response": "Good point.  Just market sold. Thanks OP!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4ziyzh",
                    "author": "Fine-Artichoke-7485",
                    "score": 1,
                    "created_utc": 1650133570.0,
                    "response": "Say nothing. Remain anonymous.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4zjbgm",
                    "author": "dfunkmedia",
                    "score": 1,
                    "created_utc": 1650133725.0,
                    "response": "If they think keeping Bitcoin going takes a lot of fossil fuels and energy, wait until they hear about this currency called _fiat_",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4zmi9t",
                    "author": "JorgenOtis",
                    "score": 1,
                    "created_utc": 1650135141.0,
                    "response": "Slap their face and storm off.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4zpwlp",
                    "author": "S3XY_Matt",
                    "score": 1,
                    "created_utc": 1650136694.0,
                    "response": "ask them to mine gold without using gasoline and walk  it 1000 miles away",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4zr41a",
                    "author": "immutable_truth",
                    "score": 1,
                    "created_utc": 1650137251.0,
                    "response": "It depends if they want to listen or not. If they are open minded, explain why you see bitcoin as a valuable asset/network. No point though if they don’t want to listen.\n\nThe energy argument can’t really be refuted - it does use a lot of energy, but whether that energy use is warranted or not depends entirely on finding value in btc. For instance, streaming video leaves a larger carbon footprint than btc. It’s a good way to shame people who are anti-bitcoin due to energy concerns. Bc streaming video is a luxury that almost everyone enjoys, whereas btc is actually bringing value to underserved populations of the world.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4zraj2",
                    "author": "Howudoin20",
                    "score": 1,
                    "created_utc": 1650137332.0,
                    "response": "True or not, the whole process of producing gold also has a significant impact.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4zvit0",
                    "author": "cracky_Jack",
                    "score": 1,
                    "created_utc": 1650139267.0,
                    "response": "Just remind them that so does their mom.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4zvkv1",
                    "author": "ShadowFire139",
                    "score": 1,
                    "created_utc": 1650139292.0,
                    "response": "Do you have to explain something?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4zvz67",
                    "author": "drawdz",
                    "score": 1,
                    "created_utc": 1650139470.0,
                    "response": "Bankers consume a lot of energy, and do nothing.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4zwmrm",
                    "author": "LongDongAutisimo",
                    "score": 1,
                    "created_utc": 1650139769.0,
                    "response": "Sounds like a Lot of people I know. They use a lot of Energy and Produce nothing :)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4zwuvg",
                    "author": "Quagdarr",
                    "score": 1,
                    "created_utc": 1650139871.0,
                    "response": "Ask them if they enjoy their money owned/controlled by banks and governments. Ask them if they’d be OK with the government mandating their banks be locked down because they dared have an opinion.\n\nIf yes, then tell them they will love CBDCs and simply wait for that.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4zy3t5",
                    "author": "hypocalypse",
                    "score": 1,
                    "created_utc": 1650140429.0,
                    "response": "Bitcoin uses less energy than the tumble dry industry.  Let's line dry those clothes, people",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4zyxm8",
                    "author": "Gudtymez_only",
                    "score": 1,
                    "created_utc": 1650140803.0,
                    "response": "“You eat alot of food, and pollute the planet with your fart too”",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i503v9a",
                    "author": "Oskiii23",
                    "score": 1,
                    "created_utc": 1650142985.0,
                    "response": "https://www.reddit.com/r/Bitcoin/comments/u0ihip/question_whats_your_favorite_comeback_when/?utm_source=share&utm_medium=ios_app&utm_name=iossmf",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i506gpc",
                    "author": "HumanJenoM",
                    "score": 1,
                    "created_utc": 1650144172.0,
                    "response": "Tell your friends to think about how much more energy is required to run the global fiat banking system.\n\nHow many corporate headquarters with all their equipment?\nHow many bank branches with all their equipment?\nHow many atm machines that need to be filled and collected?\nHow many trucks carrying money back and forth?\nHow many cash registers to handle paper money?\nHow many employees of banks driving to and from work everyday?\n\nThe energy consumption of crypto is the second biggest lie in human history. From an energy standpoint crypto is more efficient than any other currency management system in the world today.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i5075xo",
                    "author": "daddydcfool",
                    "score": 1,
                    "created_utc": 1650144492.0,
                    "response": "Lights in Vegas waste electricy too.\nYou don't turn your wifi router off when you go to sleep do you?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i507goq",
                    "author": "snegleregn",
                    "score": 1,
                    "created_utc": 1650144628.0,
                    "response": "Well, they are not wrong technically",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i508k2c",
                    "author": "BastiatF",
                    "score": 1,
                    "created_utc": 1650145115.0,
                    "response": "Bitcoin consumes less energy than tumble dryers. You don't need tumble dryers to dry your clothes yet no one questions the associated energy usage.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i50a244",
                    "author": "awildzebrahappears",
                    "score": 1,
                    "created_utc": 1650145784.0,
                    "response": "[https://braiins.com/blog/bitcoin-mining-the-grid-generators](https://braiins.com/blog/bitcoin-mining-the-grid-generators)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i50bca9",
                    "author": "Delicious-Airline627",
                    "score": 1,
                    "created_utc": 1650146363.0,
                    "response": "Everbody sell me your bitcoin for half price it is today",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i50cu6v",
                    "author": "3catparty",
                    "score": 1,
                    "created_utc": 1650147034.0,
                    "response": "Ask them how much energy all the banks and financiers are using, (who really produce nothing) with all their buildings and infrastructure.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i50d2vy",
                    "author": "Magikalmonkey",
                    "score": 1,
                    "created_utc": 1650147141.0,
                    "response": "1. They don’t understand what bitcoin is so not sure how they can claim bitcoin “produce nothing”\n\n2. Ask them if they know how much energy YouTube consumes? Answer: more than the UK. \n\n3. Streaming an hour of Netflix (.08 kwh) is equivalent to about a quarter of the energy that it takes for the average electric vehicle to drive 1 mile (.34kwh). I wonder what streaming an hour of Netflix produced? You can either watch 4 hours of Netflix or you can use the energy to power an electric vehicle for a mile",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i50d67e",
                    "author": "Gregory_Graffin",
                    "score": 1,
                    "created_utc": 1650147182.0,
                    "response": "Sounds like a bunch of nonsense to me.  Ask your friends to look up the annual energy usage of a laundry dryer..I doubt they will start hang drying their clothes…doesn’t even compare.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i50do9u",
                    "author": "CryproCoinsYT",
                    "score": 1,
                    "created_utc": 1650147403.0,
                    "response": "1. All human endeavours consume a lot of energy. That's not really the issue. The issue is how clean and sustainable is the energy consumed? As society changes, so will Bitcoin. \n2. It produces a network where anyone can transact for a fraction of the cost of conventional banking. It also theoretically acts as a store of value due to its limited supply.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i50eb3i",
                    "author": "darcodragozov",
                    "score": 1,
                    "created_utc": 1650147681.0,
                    "response": "Get rid of those friends. They’re morons.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i50gixn",
                    "author": "Main_Sergeant_40",
                    "score": 1,
                    "created_utc": 1650148671.0,
                    "response": "Just get some news friends",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i50gwol",
                    "author": "sbellistri",
                    "score": 1,
                    "created_utc": 1650148842.0,
                    "response": "that's just something rich people say to try and get rid of something.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i50h44m",
                    "author": "MurderGooseOnDatPack",
                    "score": 1,
                    "created_utc": 1650148935.0,
                    "response": "Tell them to go plant trees and stop using everything in their house if they're so worried about it. Or just ignore and stack while they hate.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i50jtd1",
                    "author": "UPkuma",
                    "score": 1,
                    "created_utc": 1650150158.0,
                    "response": "“That’s literally capitalism”",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i50lk64",
                    "author": "Raphae1",
                    "score": 1,
                    "created_utc": 1650150949.0,
                    "response": "Nothing? They produced every single of those 19 million bitcoins, which are worth about $ 770 billion.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i50mrxp",
                    "author": "scottmsul",
                    "score": 1,
                    "created_utc": 1650151507.0,
                    "response": "1. Using energy isn't a bad thing in and of itself. It's because of energy that we have an advanced technology civilization.\n2. Bitcoin mining doesn't produce nothing, it secures a trillion dollar market of perfectly sound money. I personally get more value out of holding Bitcoin than I do from drying clothes or my gaming PC.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i50shjo",
                    "author": "SnooCats2586",
                    "score": 1,
                    "created_utc": 1650154179.0,
                    "response": "That’s because Bitcoin is saving us from the Ice Age.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i50t95r",
                    "author": "Competitive-Donut-22",
                    "score": 1,
                    "created_utc": 1650154537.0,
                    "response": "You could make the same point about the Stock Exchanges. How many megawatts are being consumed daily to power that financial system and it’s server farms.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i50w2b9",
                    "author": "Weekly-Lime-8484",
                    "score": 1,
                    "created_utc": 1650155849.0,
                    "response": "How should you explain what? Your question seems incomplete.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i50wyv4",
                    "author": "bitcoin_islander",
                    "score": 1,
                    "created_utc": 1650156280.0,
                    "response": "Get smarter friends",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i50yslx",
                    "author": "teerakzz",
                    "score": 1,
                    "created_utc": 1650157149.0,
                    "response": "You don’t. Who fucking cares anymore. If they don’t like it then that’s their problem",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i515mpj",
                    "author": "hyrootpharms",
                    "score": 1,
                    "created_utc": 1650160509.0,
                    "response": "Bitcoin is digital property akin to owning real estate 100 years ago. \n\nAll the atm's in the U.S. draw more power than all the mining farms in the world.  Most large mining farms use renewable energy and the unused energy that otherwise would be dissipated as heat. \n\nThey would probably need to read up on thermodynamics to understand how energy is used efficiently and converted when not being used efficiently",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i51a7uf",
                    "author": "sadpolar7",
                    "score": 1,
                    "created_utc": 1650162860.0,
                    "response": "We use more electricity for christmas lights in America alone than bitcoin does. Same with clothes dryers. And the american banking system also uses more than bitcoin.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i51uxmd",
                    "author": "Gerardo6Gonzalez",
                    "score": 1,
                    "created_utc": 1650174926.0,
                    "response": "From personal experience I will advice , don’t try to enligh anyone’s , it back fires , just every bull run share how happy you are with your earnings , eventually maybe they will want to get some too , regardless the FUD around cash talks Bullshit walks",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i55zxmt",
                    "author": "EternalSighss",
                    "score": 1,
                    "created_utc": 1650252313.0,
                    "response": "[https://www.swanbitcoin.com/canon/why-and-how-bitcoin-consumes-energy/](https://www.swanbitcoin.com/canon/why-and-how-bitcoin-consumes-energy/)\n\n[https://www.swanbitcoin.com/canon/the-best-of-nic-carter/](https://www.swanbitcoin.com/canon/the-best-of-nic-carter/)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4wx4hu",
                    "author": "goon_c137",
                    "score": -5,
                    "created_utc": 1650078230.0,
                    "response": "So do Republicans",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i4wy2za",
                            "author": "coelectric",
                            "score": 2,
                            "created_utc": 1650078743.0,
                            "response": "Republicans, Democrats don't think for 1 second these bumbling fools pull the strings.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i4x7r1y",
                    "author": "ndgoLiberty",
                    "score": 0,
                    "created_utc": 1650084211.0,
                    "response": "It produces money that cannot be inflated into worthlessness. At the cost of exactly as much energy that it needs to protect itself.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i4xwvmv",
                            "author": "rwdrift",
                            "score": 1,
                            "created_utc": 1650103961.0,
                            "response": "I'm with you for the first sentence, but how do you get to the second? \"Exactly as much energy\" - how does this happen?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i4xlu97",
                    "author": "tesseramous",
                    "score": 0,
                    "created_utc": 1650094397.0,
                    "response": "Bitcoin definitely does something by allowing trustless online payments. As far as energy, bitcoin is software and can change. I like to think PoW is temporary and it will updated in the future when its ready.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4xm9sz",
                    "author": "989x4000",
                    "score": 0,
                    "created_utc": 1650094753.0,
                    "response": "The energy used is for protecting the rules that keep bitcoins limited supply and transactions from being reversed.\n\nIf it was easy for someone to create the same amount of energy that’s already being used they could 51% attack the network and have all the rules changed causing the value of bitcoin to drop to nothing.\n\nThe energy used for keeping bitcoin secure is far less energy than what all the banks are using to keep their money secure.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i4xv526",
                            "author": "pink_raya",
                            "score": 0,
                            "created_utc": 1650102469.0,
                            "response": "miners cannot change the rules.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i4yqk1i",
                                    "author": "989x4000",
                                    "score": 0,
                                    "created_utc": 1650121544.0,
                                    "response": "Anyone with 51% or greater of the entire hash power can change the rules.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i4ysfcp",
                                            "author": "pink_raya",
                                            "score": 0,
                                            "created_utc": 1650122327.0,
                                            "response": "no",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i4yt84x",
                                                    "author": "989x4000",
                                                    "score": 1,
                                                    "created_utc": 1650122656.0,
                                                    "response": "We can agree to disagree",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i4yy58l",
                                                            "author": "pink_raya",
                                                            "score": 1,
                                                            "created_utc": 1650124685.0,
                                                            "response": "not about the fact. miners do not enforce the rules, nodes do. they learned this in 2017.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i4yyeqx",
                                                                    "author": "989x4000",
                                                                    "score": 1,
                                                                    "created_utc": 1650124793.0,
                                                                    "response": "Validating nodes do not mine new blocks.\n\nYou can’t do a 51% attack with validating nodes.\n\nIt’s done with hash power.\n\n2017 was a hash power split. It could not be done with validating nodes only.\n\n2017 did not rewrite the original Blockchain. It’s split off into a separate Blockchain.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i4yz00a",
                                                                            "author": "pink_raya",
                                                                            "score": 1,
                                                                            "created_utc": 1650125031.0,
                                                                            "response": "and? we are talking about changing consensus rules.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i4yz4fs",
                                                                                    "author": "989x4000",
                                                                                    "score": 1,
                                                                                    "created_utc": 1650125081.0,
                                                                                    "response": "Can’t do that with validating nodes only\n\nIt requires 51% or greater hash power\n\nYes we are talking about consensus rules.\n\nAnyone can fork off into a different blockchain with very little hash power. \n\nMight have to wait two weeks for the difficulty to adjust though.",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "id": "uy4vls",
            "title": "Billionaire Bill Miller: \"I consider Bitcoin an insurance policy against financial catastrophe.\"",
            "url": "https://twitter.com/BitcoinMagazine/status/1529661358970634242",
            "author": "_CypherIO",
            "created_utc": 1653562335.0,
            "score": 128,
            "num_comments": 23,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "ia1vhss",
                    "author": "EnergySilly3061",
                    "score": 12,
                    "created_utc": 1653563817.0,
                    "response": "Well he isn’t wrong, I can’t think of a better base layer to a new financial system",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia28jjx",
                            "author": "Steven81",
                            "score": 2,
                            "created_utc": 1653571179.0,
                            "response": "When things go wrong ever since WW II, I.e. during America's world reign, people return to the dollar, it is the only that strengthens. Not stocks, not even gold.\n\nIn good times the USD gets devalued against everything else, in bad times, everything else gets devalued against the dollar. Even energy and commodities by the end of it.\n\nBitcoin followed the same pattern in all its existence. You can speculate that things would change course, eventually, but that's just that, speculation.\n\nOnly thing that makes sense for me to hold when the markets dump is USD, not because I particularly dig the fundamentals, but because that is what the markets and almost 80 years of history are telling me to do.\n\nTrust the markets, individual opinions would burn you. I learnt that the hard way.\n\nEver since the FED told us that they would induce hard times by raising interest rates and shrinking their balance sheet, I have started holding USD or equivalents. And guess what, I can now buy almost twice bitcoin with the same amount. The USD overperformed all assets, including bitcoin.\n\nNever fight the FED. Hold USD in bad times, assets in better times (and bitcoin is one of the better performing ones, admitably)...",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia2f865",
                                    "author": "_CypherIO",
                                    "score": 4,
                                    "created_utc": 1653574169.0,
                                    "response": ">  **assets** in better times.\n\nBitcoin is much more than a asset. It's also a censorship resistant and neutral global financial network among many things.\n\nIn some part of the world, it is a life boat for people dealing with war, deeply corrupted government officials, dictators and hyperinflation.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia2yqrk",
                                            "author": "Steven81",
                                            "score": 1,
                                            "created_utc": 1653582105.0,
                                            "response": "Yes, if you have no access to other forms, BTC makes sense. If you do have access, you better not hold much during QT times. Though it is very possible that we are reaching a point where loading up again makes sense...",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia3hlgi",
                                                    "author": "_CypherIO",
                                                    "score": 1,
                                                    "created_utc": 1653589605.0,
                                                    "response": "> if you have no access **to other forms**,\n\nOnly a handful of fiat currencies are reliable enough to be hold in the short or medium term. I think we need to keep in mind that 2.5 billion adults in the world are still unbanked today and some others only have access to a unreliable local currency like in Venezuela.\n\nLet's just say that Bitcoin makes sense for a lot of people.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "ia3kzqv",
                                                            "author": "Steven81",
                                                            "score": 1,
                                                            "created_utc": 1653590997.0,
                                                            "response": "There are countries where Bitcoin most of always gains value against most things.\n\nIn a long term inflationary or hyper inflationary environment it makes sense. My post's point was to signify a sort of seasonality that exists between owning bitcoin vs owning other assets, particularly national currencies.\n\nIt holds true for quite many economies, but obviously not all of them and especially not ones where you cannot buy loads of your country's national currency and/or in general have fewer options.\n\nStill, even there, I would advice against holding Bitcoin during QT (or similar) periods if you can alternatively hold some form of a reliable stablecoin (collaterized or over collaterized ones).\n\nRetention of capital requires knowing how cyclical markets can be. There is time for BTC and then there is time for Fiat, or rather USD in particular, no need to hold any other if you can help it.\n\nAgain, it is possible that we are entering a time where holding BTC makes more and more sense, btw. IMO the time to get out was late last last year, early this one.\n\nThe trend would probably reverse soon, if it hasn't already happened. Such subcycles do not last **too** long.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "ia2oodz",
                                    "author": "_CypherIO",
                                    "score": 1,
                                    "created_utc": 1653578095.0,
                                    "response": "> Hold USD in bad times\n\nPutting all your eggs in the same basket is not a great idea. \n\nYes, holding some fiat currency is probably a good thing for most people in the short term. However, putting all your trust in the FED and the USD is not the best idea from my point of view. Especially with the massive QE (aka money printing) that has been going on in recent years and the laughable interest rates hikes to fight the inflation we just have seen from them until now. \n\nHolding also a part of your saving in Bitcoin is a good idea imo.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia2pspn",
                                            "author": "Steven81",
                                            "score": 1,
                                            "created_utc": 1653578543.0,
                                            "response": "First I never said that I did such thing.\n\nI said that the only thing that survives in bad times is USD. Yes, they are mostly short lived, however what you learn (the hard way), retention of capital is the most important thing in this \"game\". If you have a way to do so, then you actually load up even harder on BTC (if that's your shctick).\n\nPoint is, it's better to follow what the markets are telling you than whatever some ideology or another tells you how things are/can/should be.\n\nAnd yes, obviously, during QE you get rid of cash. Right now we are in QT though, so USD actually does have value (they are basically burning loads of it by June 1st).",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia2vtpj",
                                                    "author": "_CypherIO",
                                                    "score": 1,
                                                    "created_utc": 1653580958.0,
                                                    "response": "> the only thing that survives in bad times is USD.\n\nOnly USD? So everything else is doomed according to you?\n\n> Right now we are in QT though, so USD actually does have value (they are basically burning loads of it by June 1st).\n\nSource?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "ia2yd21",
                                                            "author": "Universal_Contrarian",
                                                            "score": 1,
                                                            "created_utc": 1653581958.0,
                                                            "response": "https://www.reuters.com/business/feds-qt-plan-then-now-2022-04-06/",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "ia31hv4",
                                                            "author": "Steven81",
                                                            "score": 1,
                                                            "created_utc": 1653583181.0,
                                                            "response": "https://www.livemint.com/news/world/fed-plans-to-reduce-its-balance-sheet-starting-1-june-to-curb-inflation-11651689565811.html\n\n> Only USD? So everything else is doomed according to you?\n\nI am describing what happens in different parts of the market cycle. I do not have an opinion on the matter.\n\nLike I said, I follow what the markets do, any other way was making me poorer for decades.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "ia3kayu",
                                                                    "author": "_CypherIO",
                                                                    "score": 1,
                                                                    "created_utc": 1653590716.0,
                                                                    "response": "If you trust the financial elite to do what they said and save us in western countries from even worse inflation, sure, only holding USD could makes sense for people with your mindset. \n\nPersonally, I wouldn't bet the farm on that.\n\nI think holding a mix of one of the most reliable fiat, some essential commodities and Bitcoin are the best and safest bets at the present time.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "ia3merk",
                                                                            "author": "Steven81",
                                                                            "score": 1,
                                                                            "created_utc": 1653591579.0,
                                                                            "response": "I think you misunderstood the point of my posts.\n\nI do not trust Noone in particular. Humans are (extremely) fallible, I trust the markets , I.e. the algorithmic process that is smarter, more far seeing and way more impartial than any ideology, or any human, or any reason. The markets are above reasons in fact, they just do, and what they do, *is*.\n\nA bit of how nature is different than our models. Whatever nature does , *is* even if our physical models disagree (in which case we should change our models)...",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "ia1wm3n",
                            "author": "RocketMoonShot",
                            "score": 1,
                            "created_utc": 1653564557.0,
                            "response": "That's because you haven't yet been exposed to the Feds digital dollar.  /s",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "ia3lzrz",
                            "author": "NJJBlankenstein",
                            "score": 1,
                            "created_utc": 1653591406.0,
                            "response": "Does bitcoin replace the need for currency diversification?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia3cbu8",
                    "author": "cryptonatix",
                    "score": 2,
                    "created_utc": 1653587465.0,
                    "response": "The same! Easy and cheap insurance.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia25huq",
                    "author": "YoMammaSoThin",
                    "score": 3,
                    "created_utc": 1653569682.0,
                    "response": "He left out \"the inevitable\" between \"against\" and \"financial\".",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia21uke",
                    "author": "savinelli_smoker",
                    "score": 1,
                    "created_utc": 1653567735.0,
                    "response": "More than an insurance I’d say! would anyone spend 40% of their net worth (esp if they are billionaires, not a broke college student) to buy an insurance policy… it’s more than an insurance. Pay attention to what they do, not necessarily what they say lol. I just smashed buy after listening to the podcast today!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia32l2p",
                    "author": "h2exch",
                    "score": 1,
                    "created_utc": 1653583603.0,
                    "response": "WE LOVE TO SEE IT! The more whales, the merrier!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia38rzy",
                    "author": "MMinjin",
                    "score": 1,
                    "created_utc": 1653586041.0,
                    "response": "These guys don't honestly think Bitcoin is the answer. They just don't want to be left behind if it turns out it was. Kind of like buying into the lottery pool at work. Who wants to be the person who didn't buy into it and the pool hits? For them, the bet is just as small and inconsequential.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia3h7do",
                    "author": "ilya1klas",
                    "score": 1,
                    "created_utc": 1653589447.0,
                    "response": "Bill Miller, the old man, later fades away with knowing what bitcoin really is.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia3l5a0",
                    "author": "dantebayer",
                    "score": 1,
                    "created_utc": 1653591060.0,
                    "response": "It depends how big the catastrophe is because our economy is very much like a fly wheel. It has taken decades to get to where we are today and a disruption could cause a collapse and that will not be able to recover from. What im saying is that once the power goes out, and the longer its out, the harder it is to get back. Its very possible we are going to see widespread blackouts in the near future, its the culmination of terrible financial and economy policy + more.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia3pojq",
                    "author": "AviationFlyer",
                    "score": 1,
                    "created_utc": 1653592930.0,
                    "response": "That's the whole reason I bought it. And every time I see a terrible news headline I dump a bit more in.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uy4q02",
            "title": "Bitrefill appreciation post!",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uy4q02/bitrefill_appreciation_post/",
            "author": "Previous-Pea6642",
            "created_utc": 1653561693.0,
            "score": 47,
            "num_comments": 14,
            "subreddit": "Bitcoin",
            "selftext": "For those who somehow don't know yet, you can buy tons of gift cards on [Bitrefill](https://bitrefill.com) using Bitcoin, with lightning support. You even get 1% sats back! Most gift cards (at least the ones I use) come with 0 fees attached, so it's an actual money saver! I get to pay with Bitcoin not just on Amazon, but also when I order takeout! Been using them for years now, and it's great. I'm pretty sure essentially everyone who's been in Bitcoin for a year+ already knows about them, but if you're a newbie and you haven't heard of Bitrefill, make sure to check them out!\n\nNot a paid shill, I just genuinely love their service!",
            "stickied": false,
            "comments": [
                {
                    "id": "ia2ujs3",
                    "author": "bitusher",
                    "score": 9,
                    "created_utc": 1653580450.0,
                    "response": "Other ways you can use bitcoin to save money :\n\nhttp://ln.pizza  - save 6 % off dominoes Pizza in the USA with lightning wallet\n\nhttps://purse.io  Save 10-20% off amazon \n\nhttps://foldapp.com - save up to 20%  Starbucks, Uber, Target , whole foods , Dunkin \n\nhttps://www.lolli.com – save up to 30% by spending BTC anywhere but primarily USA stores\n\nhttps://stekking.com - save up to 20% by spending BTC anywhere but primarily Europe stores",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia2file",
                    "author": "ZZ3xhZz",
                    "score": 4,
                    "created_utc": 1653574293.0,
                    "response": "Yeah I love it. Thanks bitrefill.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia2f5v7",
                    "author": "SeniorManager8141",
                    "score": 3,
                    "created_utc": 1653574141.0,
                    "response": "If you want some cash back, pay for the GCs from Strike via Lightning.  \n\nThere is also PayWithMoon that let's you buy prepaid Visa cards via LN.  Strike also gives cash back for them too.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia2j2da",
                            "author": "Previous-Pea6642",
                            "score": 4,
                            "created_utc": 1653575784.0,
                            "response": "I'd definitely be using both Strike and Moon if I was in the US",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia31xuk",
                    "author": "PRMan99",
                    "score": 3,
                    "created_utc": 1653583353.0,
                    "response": "We went to Home Depot the other day, rang ourselves up on the self-checkout, bought a gift card for that exact amount using the Phoenix and Bitrefill apps...\n\n...and then waited for a clerk because there was no way to enter in the gift card number  at self-checkout.\n\nThen we had to return stuff and now we have a Home Depot gift card that we finally used.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia5amth",
                            "author": "Previous-Pea6642",
                            "score": 1,
                            "created_utc": 1653619130.0,
                            "response": "Ah, sorry to hear that it was a bumpy ride! Bitrefill is definitely the best band-aid solution while stores don't accept Bitcoin directly, but it's still a band-aid!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia1w327",
                    "author": "plug_and_pray",
                    "score": 4,
                    "created_utc": 1653564207.0,
                    "response": "Yes, it's great especially when you want to spend your crypto anonymously.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia1zsu3",
                    "author": "TheChoosey1",
                    "score": 4,
                    "created_utc": 1653566549.0,
                    "response": "If you want to save on Amazon and pay with Bitcoin, you do better using https://purse.io\n\nThey let you set your own discount from 15-30%.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia2duot",
                            "author": "Previous-Pea6642",
                            "score": 2,
                            "created_utc": 1653573579.0,
                            "response": "What are the [purse.io](https://purse.io) privacy implications?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia2jxpn",
                                    "author": "TheChoosey1",
                                    "score": 3,
                                    "created_utc": 1653576145.0,
                                    "response": "You can use it anonymously. If you're worried, go rent a private mail box from a business under a fake name. \n\nDon't use your real name. Solved.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "ia2hxya",
                                    "author": "futuretothemoon",
                                    "score": 1,
                                    "created_utc": 1653575313.0,
                                    "response": "The worse thing despite privacy is when you need to claim a warranty..",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia2jpo6",
                                            "author": "TheChoosey1",
                                            "score": 3,
                                            "created_utc": 1653576053.0,
                                            "response": "Returns are just as easy as dealing directly with Amazon. I've done it. It's easy.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia47o9s",
                    "author": "thrash242",
                    "score": 1,
                    "created_utc": 1653600554.0,
                    "response": "To confirm, there’s no KYC right? From what I understand you don’t need an account?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia5az6i",
                            "author": "Previous-Pea6642",
                            "score": 1,
                            "created_utc": 1653619304.0,
                            "response": "Yes! You *can* make an account for two purposes though:\n\n1. To get satsback (this requires only an email address)\n2. To lift your account \"limits\" (this requires ID verification)\n\nI put \"limits\" in quotes, because they are [unfathomably high](https://i.imgur.com/7A6oLU4.png)!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}