{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ux7ylu",
            "title": "Bitfinex \"making a big investment\" into El Zonte Capital",
            "url": "https://bitcoinnews.com/bitfinex-el-zonte-capital/",
            "author": "RustinSats",
            "created_utc": 1653447932.0,
            "score": 9,
            "num_comments": 2,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9x0tkf",
                    "author": "Mallardshead",
                    "score": 1,
                    "created_utc": 1653472750.0,
                    "response": "Translation: another vector for Tether to go bust in the event of a sovereign default or major political problem.\n\nBitfinex is acting a lot like a sovereign nation, except they don't have a military or populace to rob and tax. I'm certain they're an arm of a statecraft outfit, I just can't figure out if that's the US or China. If they're not, then I should imagine this will be one of the last years they're operational in the West. US gov't can freeze their treasuries, designate their Tether a security, compel nations to aid in arresting their brass, or have every exchange delist them. \n\nI can't fo the life of me understand the Tether apologists. Stablecoins are counterfeit versions of inflationary fiat. They must be a scam because fiat itself is a scam. They act as drag on bitcoin's escape velocity by providing extraordinary leverage (levels that would be illegal in traditional equities), and they dollarize nations where bitcoin would otherwise be taking hold, especially when their native fiat is more volatile than BTC",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ux7zyn",
            "title": "Billionaires want you to believe that Bitcoin doesn’t produce anything. But what’s more important than Bitcoin as trustless money?",
            "url": "https://thehificrypto.substack.com/p/the-bitcoin-network-is-highly-productive",
            "author": "jguest1105",
            "created_utc": 1653448060.0,
            "score": 113,
            "num_comments": 55,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9w5bd1",
                    "author": "Holyballs92",
                    "score": 35,
                    "created_utc": 1653449366.0,
                    "response": "I feel like they are shitting on crypto so the normal man will stay away from it and they can all hop on the train while it's cheap \n\nNever trust billionaires who give advice on Financials they all have their own agenda",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9wy01m",
                            "author": "rhelwig7",
                            "score": 3,
                            "created_utc": 1653470269.0,
                            "response": "Trust what they DO, not what they SAY. There's a lot you can learn from billionaires, but you have to figure out what to take from their lessons.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9x5svd",
                                    "author": "Jub-n-Jub",
                                    "score": 1,
                                    "created_utc": 1653476634.0,
                                    "response": "\n>Trust what they DO, not what they SAY.\n\nThat's the first lesson.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9x9u0n",
                            "author": "woaidc",
                            "score": 1,
                            "created_utc": 1653479250.0,
                            "response": "People at this point of time and the generation knows what crypto is indeed all about!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9w90j0",
                    "author": "DoYouEvenMonad",
                    "score": 10,
                    "created_utc": 1653451362.0,
                    "response": "Generally speaking, money doesn't produce anything, it wouldn't be money if it did.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9wgx3e",
                    "author": "torontowatch",
                    "score": 5,
                    "created_utc": 1653456234.0,
                    "response": "they don’t want you to buy bitcoin before they stack enough themselves.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9wrto9",
                    "author": "love2readafraid2post",
                    "score": 3,
                    "created_utc": 1653464658.0,
                    "response": "You could argue that one of Bitcoin's value-adds is the reduction in the number and amount of economic rents for all non cash transactions. If that is 1% of GDP and can be accomplished with 0.1% GDP of energy, that's 10x value-add. \n\nExpanding further into the future, smart contracts could potentially eliminate many middlemen in many areas of the economy. \nAnother 10% in Global GDP? Possibly.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9xc3dp",
                            "author": "jguest1105",
                            "score": 1,
                            "created_utc": 1653480578.0,
                            "response": "The middleman of a smart contract is the developer who wrote it. Smart contracts don’t write themselves, nor are they costless.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9w58ky",
                    "author": "cutoffs89",
                    "score": 15,
                    "created_utc": 1653449327.0,
                    "response": "Billionaires don't produce shit. Their companies and employees do.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9war9a",
                            "author": "Belmont_the_IV",
                            "score": 4,
                            "created_utc": 1653452351.0,
                            "response": "But they do bring profit sharing of the underlying production\n.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9x8twc",
                                    "author": "joeloa366",
                                    "score": 1,
                                    "created_utc": 1653478637.0,
                                    "response": "Absolutely true though like a clap can't be done using one hand the fact that it needs the other too,\n\nSame goes for production too productions too acquire man power and that's when things get perfect enough.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9xcv5a",
                                            "author": "imissyourmusk",
                                            "score": 1,
                                            "created_utc": 1653481019.0,
                                            "response": "https://youtu.be/b6YSfEKMeC8",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9wfi3y",
                            "author": "ControversialTomato",
                            "score": 0,
                            "created_utc": 1653455296.0,
                            "response": "Without billionaires those companies wouldn’t exist.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9wyaol",
                                    "author": "Loafmanuk",
                                    "score": 2,
                                    "created_utc": 1653470528.0,
                                    "response": "I would argue that without billionaires, those companies wouldn't be owned by billionaires.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9x00xq",
                                            "author": "ControversialTomato",
                                            "score": 2,
                                            "created_utc": 1653472061.0,
                                            "response": "They don’t start out as billionaires… They grow the company and enrich investors and themselves in the process, and add value to society in general. Risk/reward. Or do you think we should socialize their shares in the company?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9x901o",
                                                    "author": "hivoltage815",
                                                    "score": 1,
                                                    "created_utc": 1653478745.0,
                                                    "response": "If we are getting into the nuances of it all, I think when Jeff Bezos launches a company that’s entire business model relies on the Internet, a publicly funded utility, and the post office, a public good, employing people educated in public schools in a country made stable by a publicly-funded military and infrastructure, that it shouldn’t be controversial to expect a nice chunk of that wealth generated to be returned to the people for all of our investments.\n\nIn short: the taxes for the billionaire class are way too low and it’s shocking to me how defensive many people get about keeping it that way given these facts.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9x6fly",
                                            "author": "Jub-n-Jub",
                                            "score": 1,
                                            "created_utc": 1653477071.0,
                                            "response": "Because they wouldn't exist?",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9w7a2m",
                    "author": "nullama",
                    "score": 5,
                    "created_utc": 1653450398.0,
                    "response": "Well, rich people still need working class people to make their meals, care for their families, build their things, etc.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9wdy2o",
                    "author": "ScamJustice",
                    "score": 5,
                    "created_utc": 1653454293.0,
                    "response": "Bitcoin doesn't need to produce anything. It has value because it's the best form of money ever invented. It can be used to account for all the world's value. And your share of the Bitcoin network can never be diluted",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9wrrws",
                            "author": "MichaelAischmann",
                            "score": 1,
                            "created_utc": 1653464614.0,
                            "response": "Differentiate between Bitcoin the network and bitcoin the asset. The asset share one entity owns can not be diluted, the network share one entity powers can and usually will get diluted.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9wnhgg",
                            "author": "Flashy_Attitude_1703",
                            "score": -1,
                            "created_utc": 1653461038.0,
                            "response": "Except Bitcoin is down 50% from a year ago.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9wo5u9",
                                    "author": "magneticman245",
                                    "score": 4,
                                    "created_utc": 1653461583.0,
                                    "response": "And it's 3x the price from 2 years ago.\n\nThe price of a bitcoin in dollar terms doesn't change what proportion of the total supply you own.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9x19fc",
                                            "author": "ivanbeld",
                                            "score": 1,
                                            "created_utc": 1653473112.0,
                                            "response": "So the fact that if we intend to hold and the price goes we would see a gain in that scenario?",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i9wq7nm",
                                            "author": "Flashy_Attitude_1703",
                                            "score": -1,
                                            "created_utc": 1653463260.0,
                                            "response": "Well, if you bought it two years ago your doing well. If you bought it six months not good. Bitcoin is a very volatile asset. Over a year ago people said Bitcoin would be worth 500K, hasn’t happened. Bitcoin doesn’t make anything unlike buying a stock of a company that makes something that people want. Bitcoin’s value is what people think it is worth to other people who will pay more for it, the bigger fool theory. It looks like the supply of bigger fools is running out however. I think it’s possible Bitcoin will be an alternate form of currency but I also think the days of huge price swings for Bitcoin making holders a lot of money are over.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9x7j71",
                                                    "author": "St3vion",
                                                    "score": 1,
                                                    "created_utc": 1653477801.0,
                                                    "response": "Ah like they said every time bitcoin had a big crash! Perhaps this time is different though huh :P?",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i9x82e1",
                                                    "author": "Danjodylo",
                                                    "score": 1,
                                                    "created_utc": 1653478149.0,
                                                    "response": "The plight of everyone who bought during a huge spike...just be patient.  Bitcoin is still in its younger years and 3 years from now even $60k will seem low.  $30k is an absolute blessing and opportunity for the wise.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9w444r",
                    "author": "m0loch",
                    "score": 5,
                    "created_utc": 1653448772.0,
                    "response": "Fiat produces debt slaves and conflict. I'll take nothing over that any day. Sounds like peace.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9w47au",
                            "author": "jguest1105",
                            "score": 8,
                            "created_utc": 1653448816.0,
                            "response": "Yea, people don’t understand the real costs of fiat money",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9x72pu",
                                    "author": "ellttpool",
                                    "score": 1,
                                    "created_utc": 1653477505.0,
                                    "response": "Because all this debt, slavery and conflict is making people hard enough to understand the real cost!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9wqs92",
                            "author": "ZeFGooFy",
                            "score": 1,
                            "created_utc": 1653463746.0,
                            "response": "Anything valuable produces conflict between those who have it and those who don’t… boobs have the same effect, why Bitcoin wouldn’t?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9x78pg",
                                    "author": "Jub-n-Jub",
                                    "score": 1,
                                    "created_utc": 1653477613.0,
                                    "response": "Wars used to be shorter because money was backed by something or it actually was/was made of something of something with value. Once it became fiat wars could go beyond budgets and only end due to enough lives being lost or a nations fiat going into hyperinflation. When there's no money printer there's less conflict and conflicts are shorter in duration and lives lost.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9w3l7q",
                    "author": "coinfeeds-bot",
                    "score": 2,
                    "created_utc": 1653448504.0,
                    "response": "tldr; Billionaire investor Warren Buffett recently said that Bitcoin doesn’t produce anything. He and others like him have completely misunderstood the productive capacity of Bitcoin. The value of crypto is just what some other person decides someone else will pay for it, so not adding to society like other investments.\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR.*",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9w49cx",
                            "author": "jguest1105",
                            "score": 2,
                            "created_utc": 1653448842.0,
                            "response": "Bad bot. Terrible summary.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9wvkgb",
                                    "author": "dima054",
                                    "score": 1,
                                    "created_utc": 1653468034.0,
                                    "response": "haha buttcoin approves",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9waqmz",
                    "author": "witnessgreatness101",
                    "score": 1,
                    "created_utc": 1653452341.0,
                    "response": "They’re looking at Bitcoin not as a currency but as a company. Willful ignorance or are we just still early? Who knows.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9w47el",
                    "author": "Percyheckendorf",
                    "score": -1,
                    "created_utc": 1653448817.0,
                    "response": "money is a useless commodity by design and it always has been",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9w4g2l",
                            "author": "jguest1105",
                            "score": 6,
                            "created_utc": 1653448934.0,
                            "response": "Money for money’s sake is just a tool to allow people to more easily transact across time, space, and goods.\n\nMoney isn’t the problem, it’s the forms of money we’ve had for the last several decades that are the problem.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9x3jx4",
                                    "author": "ghosn2013",
                                    "score": 1,
                                    "created_utc": 1653474965.0,
                                    "response": "But that is indeed what each and every indivual  look for though because that is well enough known!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9wm9j2",
                    "author": "DogeDan89",
                    "score": 1,
                    "created_utc": 1653460087.0,
                    "response": "BTC produce wealth it’s enough",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9wqj25",
                    "author": "Uberspelaren",
                    "score": 1,
                    "created_utc": 1653463527.0,
                    "response": "I never understood this... a building, a piece of land and so on does not produce anything but helps humans achive ends. Land to farm on, buildings to live in and bitcoin to money with.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9xc4ge",
                            "author": "jguest1105",
                            "score": 1,
                            "created_utc": 1653480595.0,
                            "response": "Well said",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9wrz0e",
                    "author": "Witty_Specific_764",
                    "score": 1,
                    "created_utc": 1653464789.0,
                    "response": "BTC produces flowers",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9wtypi",
                    "author": "bobbytabl3s",
                    "score": 1,
                    "created_utc": 1653466585.0,
                    "response": "Neither does USD. I don't know why they keep comparing BTC to stocks, etc.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9xbuym",
                            "author": "jguest1105",
                            "score": 1,
                            "created_utc": 1653480443.0,
                            "response": "Because they intentionally want people to think of it as an investment rather than as money.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9wuvbx",
                    "author": "fainje",
                    "score": 1,
                    "created_utc": 1653467398.0,
                    "response": "What do they mean Bitcoin is producing nothing?\n\nBitcoin is the top producer in hopium.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9wxqh3",
                    "author": "OtherDetective",
                    "score": 1,
                    "created_utc": 1653470026.0,
                    "response": "Bitcoin does EVERYTHING. The realizations keep on blowing up in my mind.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9xb08k",
                            "author": "t6ssitujurikkuja",
                            "score": 1,
                            "created_utc": 1653479952.0,
                            "response": "True though slowly and gradually the things seems to be going on escalating pretty quick though!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9x28a4",
                    "author": "cflynnus",
                    "score": 1,
                    "created_utc": 1653473922.0,
                    "response": "Just because it is all about long term money it doesn't mean that we would looks things lightly.\n\nThe long term holding has it's own principle and thus people make some good gains from that.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9x45xr",
                    "author": "RevolutionaryEgg4589",
                    "score": 1,
                    "created_utc": 1653475430.0,
                    "response": "Do you follow DEFI Decentralized Finance?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9x48et",
                    "author": "RevolutionaryEgg4589",
                    "score": 1,
                    "created_utc": 1653475481.0,
                    "response": "Do you follow DEFI Decentralized Finance?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9x4ank",
                    "author": "RevolutionaryEgg4589",
                    "score": 1,
                    "created_utc": 1653475530.0,
                    "response": "I am a big believer in decentralized finance",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9xa6hi",
                    "author": "hi_Joe_joe_mama",
                    "score": 1,
                    "created_utc": 1653479455.0,
                    "response": "Btc is not hear to produce a product btc is hear to solve 5000 years old currency problem",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9xbq91",
                            "author": "jguest1105",
                            "score": 1,
                            "created_utc": 1653480368.0,
                            "response": "Exactly. Trustless money is the innovation",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9xb4by",
                    "author": "Johndrc",
                    "score": 1,
                    "created_utc": 1653480020.0,
                    "response": "Dont give them the prosperity again of a lifetime.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ux7xzy",
            "title": "Dubai-based luxury real estate company DAMAC to accept Bitcoin.",
            "url": "https://bitcoinnews.com/dubai-real-estate-ompany-damac-to-accept-bitcoin/",
            "author": "RustinSats",
            "created_utc": 1653447878.0,
            "score": 48,
            "num_comments": 4,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9wjh0o",
                    "author": "Upset-Ad-4053",
                    "score": 7,
                    "created_utc": 1653457993.0,
                    "response": "Probably so Russian Oligarchs can still buy real estate overseas.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9xhrix",
                    "author": "No_Release6675",
                    "score": 1,
                    "created_utc": 1653483616.0,
                    "response": "I live in dubai, and almost all real estate companies and agencies accept Bitcoin for the purchase of property. It's just a no brainer here since 90% of the population is foreigners and nobody wants to deal with wire transfers and huge delays from their foreign banks. If you are in  the real estate business and you don't accept crypto you are literally left behind.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}