{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uqcsca",
            "title": "The problem is clear: lack of values",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uqcsca/the_problem_is_clear_lack_of_values/",
            "author": "2xfun",
            "created_utc": 1652640912.0,
            "score": 13,
            "num_comments": 18,
            "subreddit": "Bitcoin",
            "selftext": "I'm sad about society in general. Sometimes I feel like we are going backwards in time. The majority of society is chasing instant gratification and ignoring what really matters: fundamentals. And it's getting worse and worse.\nSince 1913 we destroyed the fundamental property of fiat (scarcity) the consequence of that was taxes and slavery ( debt ) all over the world. Now we have an option to get out of that mindset but all i see is people talking about fiat, doing everything to get more fiat, even though fiat is a bucket full of holes ( losing 20% a year in value ). \nI blame out education system and social media. We need to start teaching our kids critical thinking again. Enough rambling: 1btc = 1btc.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8q9gdg",
                    "author": "Deathstaroperatorguy",
                    "score": 3,
                    "created_utc": 1652642113.0,
                    "response": "How people are not freaking out how high gas has become is blowing me away. Mess with me, but don’t mess with my money. Why are there not riots in the streets over this?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8q96vd",
                    "author": "myironcity",
                    "score": 6,
                    "created_utc": 1652641993.0,
                    "response": "“Hard times create strong men. Strong men create good times. Good times create weak men. And, weak men create hard times.”\nG. Michael Hopf",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}