{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uws7vy",
            "title": "What do you guys think about the fact we are printing a 9th red weekly candle in a row?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uws7vy/what_do_you_guys_think_about_the_fact_we_are/",
            "author": "eatmyplis",
            "created_utc": 1653402786.0,
            "score": 1,
            "num_comments": 30,
            "subreddit": "Bitcoin",
            "selftext": "I watch a lot of ben cohen and he brought this up a few weeks ago when we were still pushing 6 or something. In history, we have never printed more than 6 back to back red weekly candles.\n\nDo you think this has any significance at all? I don't think it seems to have too much considering we already know it's a clear bear market, but I'm just curious what other people think. That happened in 2014 if you wanted to check btw, at a time when it actually had a relief rally shortly after the 6 but then continued to keep making lower lows.\n\nA lot of people think we are also due for a relief rally (relief because there's basically no chance it would hold in a bear market.) What do y'all think? Do you see the similarities here too or is this a whole new thing to try to fathom? Interested to hear your opinions!",
            "stickied": false,
            "comments": [
                {
                    "id": "i9t8ovs",
                    "author": "Sufficient_Tooth_949",
                    "score": 6,
                    "created_utc": 1653403261.0,
                    "response": "Just your average Joe here, and I think it's just because of the uncertainty in the world right now in general the stock market is looking pretty bearish as well\n\nAs long as nobody starts yeeting nukes eventually we'll see more optimistic days, but I wouldn't be surprised if we stay red for months upon months with current world concerns",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9t948e",
                            "author": "eatmyplis",
                            "score": 1,
                            "created_utc": 1653403444.0,
                            "response": "Haha of course, I don't think there's -much- farther down to still go vs how long we might actually stay low, think that could be a while for sure like you said. \n\n&#x200B;\n\nAlso Joe, average is perfect and so are you! -From, Anne",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9t8t7a",
                    "author": "feyyd",
                    "score": 6,
                    "created_utc": 1653403312.0,
                    "response": "Cheaper bitcoin for longer periods of time is better for BTC long term imo.  Hoping we stay above 20k but don't rip past ATH for another 2 years minimum.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9t9cen",
                            "author": "eatmyplis",
                            "score": 2,
                            "created_utc": 1653403542.0,
                            "response": "Yeah staying above 20k, and for some time with chances to keep accumulating, is seriously a blessing in disguise right now. I just still wonder if this is gonna hold any significance in the short term, to see the typical relief rally or to just go for the 9th red candle and maybe even a 10th. lol I also wonder if this adds any credibility to extended cycles cause this sure starting to feel like it could be a long bear market :P",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9ta323",
                    "author": "bitsteiner",
                    "score": 3,
                    "created_utc": 1653403858.0,
                    "response": "BTC went down 85% from top in the past. 10k is certainly possible.  But I don't trade, I hodl, because no one can predict the right timing. Don't let someone talk you into trading, you might lose more than you gain.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9taxx7",
                            "author": "eatmyplis",
                            "score": 2,
                            "created_utc": 1653404223.0,
                            "response": "Yeah stocks are not immune to these kinds of corrections either, I think we can't possibly see a 10k btc unless stocks plunge all the same. Which seems more and more likely as time goes on this year.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9tbt6o",
                                    "author": "bitsteiner",
                                    "score": 2,
                                    "created_utc": 1653404587.0,
                                    "response": "At the moment there seems a strong correlation, but I would not rely on that.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9tc5om",
                                            "author": "eatmyplis",
                                            "score": 1,
                                            "created_utc": 1653404732.0,
                                            "response": "btc has a stronger correlation with usd as well, whenever usd uptrends btc downtrends. and usd is slightly correcting atm after reaching highest point it has in over 2 decades. some food for thought! if that dollar bull run resumes, yeah could be nasty.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9t9yti",
                    "author": "Linkaiser",
                    "score": 2,
                    "created_utc": 1653403808.0,
                    "response": "My experience with crypto is that anything anyone says is just a wild guess that has a polar opposite being said by someone else.  \n\n\nIf we could actually predict those things... We'd not be debating about them.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9tahzc",
                            "author": "eatmyplis",
                            "score": -2,
                            "created_utc": 1653404034.0,
                            "response": "Oh hunny, absolutely not true. You need to watch some of the guy I mentioned in my post. There are many ways to have very solid and accurate predictions. Do not kid yourself. I'm just curious what most people think, rather than always him. I've been more than prepared for this current cycle thanks to him.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9tcw3l",
                                    "author": "Linkaiser",
                                    "score": 1,
                                    "created_utc": 1653405044.0,
                                    "response": "You can say that, but then you can google bitcoin predictions and see how many are wrong.   \n\n\nedit: you could also be more than prepared for this current cycle thanks to a hundred other people -- and not prepared at all thanks to a hundred other people.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9tjlf6",
                                            "author": "eatmyplis",
                                            "score": -1,
                                            "created_utc": 1653407839.0,
                                            "response": "because they just throw predictions out there they don't actually analyze valid data xD a quote he loves to say is \"Even a broken clock is right twice a day\" and by that he is always implying people who make the same prediction literally every day are eventually going to be right one day. That's not predicting anything, that's just talking out your ass.\n\n&#x200B;\n\nIf you wanna see for yourself just go back a few months or weeks and see how accurate and insightful his talks are. You'll thank me later.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9tg07p",
                    "author": "igadjeed",
                    "score": 2,
                    "created_utc": 1653406350.0,
                    "response": "The price of Bitcoin is discussed in the daily discussion thread. It is not important enough for you to create a new thread here  \n\nThe rest of us want to talk about Bitcoin, not your red candle fantasies",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9tjpki",
                            "author": "eatmyplis",
                            "score": 0,
                            "created_utc": 1653407887.0,
                            "response": "lol, what a weird comment",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9th0gx",
                    "author": "SamWizza",
                    "score": 1,
                    "created_utc": 1653406771.0,
                    "response": "I think comparing BTC’s price action to the times when its MC was no way near the current reading is not the way. \n\nAs MC grows, we assume the bid/ask stack grows thicker, which means that bulk orders that would increase/decrease price spread have less of that effect. \n\nThe fact that BTC is painting its 9th weekly candle is more related to the risk-off sentiment sweeping through the markets, as BTC is evidently a risk-on asset. \n\nSince the creation of BTC, I do not think we had such a horrible macro situation in the overall markets. \n\nMy two cents. \n\nThanks for reading.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9tjwl5",
                            "author": "eatmyplis",
                            "score": 1,
                            "created_utc": 1653407966.0,
                            "response": "Well thank you for sharing! The exact kinds of comments I'm looking to hear the opinions of. It sounds like according to you, you'd say btc is holding very well with all odds against it rn.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9tr0u9",
                            "author": "Creepy_Pin6386",
                            "score": 1,
                            "created_utc": 1653410860.0,
                            "response": "I agree and just posted something similar before seeing this.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9tkakv",
                    "author": "Sealobo",
                    "score": 1,
                    "created_utc": 1653408123.0,
                    "response": "What’s the longest 1-hour red candle-streak? \n\nSeriously just zoom out.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9tkm19",
                            "author": "eatmyplis",
                            "score": 1,
                            "created_utc": 1653408254.0,
                            "response": "Obviously I'm zoomed out as far as can be if I'm on a weekly candle view. I love comments like this that have literally no idea what they're talking about. If you don't understand what you're looking at, that's on you.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9tqoii",
                    "author": "Creepy_Pin6386",
                    "score": 1,
                    "created_utc": 1653410721.0,
                    "response": "If it is winter, it will be shorter lived than before assuming we don't go into a deep recession. I don't see it taking 2-3yrs to find summer again like it used to. In my opinion, the long winters are over as we are tied more closely to the broader stock market than ever before due to crypto ETFs, more options to purchase in 401ks, IRAs, more institutional investors and more institutions buying overall.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9twakc",
                            "author": "eatmyplis",
                            "score": 1,
                            "created_utc": 1653413021.0,
                            "response": "Yeah great take! So you basically reckon it's just getting the bear market over with?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9tz8qw",
                                    "author": "Creepy_Pin6386",
                                    "score": 1,
                                    "created_utc": 1653414237.0,
                                    "response": "Definitely not sure, I think we see the broader market sell off through the summer. I'm looking to see SPY around 340-350 by the end of summer or before. I do think it's highly possible BTC dumps back down to around 22k, but again, I don't think we are going to have to wait until 2024-2025 for a recovery. I've also set buy orders under the 25k range in addition to an altcoin im heavily invested in. I think we get good recovery by 2023 assuming we don't fall into that huge multi year recession.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9u08jy",
                                    "author": "Creepy_Pin6386",
                                    "score": 1,
                                    "created_utc": 1653414648.0,
                                    "response": "Also keep in mind a bunch of countries are now adopting bitcoin as their currency. Thats big.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9u6022",
                                            "author": "eatmyplis",
                                            "score": 1,
                                            "created_utc": 1653417051.0,
                                            "response": "Oh yeah, but personally I've believed in the short term that's good reason for more selling action. Big money is always trying to shake out new investors, and the more new ones there are the more they'd want to I feel like.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9u719v",
                                                    "author": "Creepy_Pin6386",
                                                    "score": 1,
                                                    "created_utc": 1653417488.0,
                                                    "response": "Definitely, personally I'd love a quick wick down under 25k then continue the bullrun this year. That's would be my idea situation. Either way, I don't feel like we will be in a long winter even if we are. So much has changed in the last 5yrs with crypto, I just dont see long winters happening anymore.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9u7hu4",
                                                            "author": "eatmyplis",
                                                            "score": 1,
                                                            "created_utc": 1653417681.0,
                                                            "response": "I would very much love to stay down here as long as possible to accumulate. ;(",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9tsfs9",
                    "author": "Inconel209",
                    "score": 1,
                    "created_utc": 1653411442.0,
                    "response": "👍🏻",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9u22iq",
                    "author": "johnson5067",
                    "score": 1,
                    "created_utc": 1653415398.0,
                    "response": "Some of those red candles were pretty small (the candle bodies). One or more of them could have easily been green with essentially the same overall price action, and no one would be talking about the streak. I think the streak is interesting but I don't put any significance into it.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uwsd8z",
            "title": "question about ftx exchange? US",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uwsd8z/question_about_ftx_exchange_us/",
            "author": "ForbiddenFruit91",
            "created_utc": 1653403201.0,
            "score": 3,
            "num_comments": 8,
            "subreddit": "Bitcoin",
            "selftext": "Recently started using ftx exchange. Mainly use the app. Went to login to the website and when i did, login asked me for verification again. Also none of my assests show or history on the site. My linked bank and card don't show. Could someone please explain this. Kind of in a panic? New to ftx. Also this would be for US....",
            "stickied": false,
            "comments": [
                {
                    "id": "i9t9awk",
                    "author": "phikapp1932",
                    "score": 2,
                    "created_utc": 1653403524.0,
                    "response": "Are you sure you’re using FTX.US? Also, are you sure you’re not on the FTX Derivatives exchange? The two exchanges are currently merging, but for right now you can have two different accounts because of this.\n\nWithout more information, this is the best I can do.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9taxdo",
                            "author": "ForbiddenFruit91",
                            "score": 1,
                            "created_utc": 1653404217.0,
                            "response": "Im looking into it but idk. Does the ftx us pro app have to be used for usa? Im using ftx. Kind of confused at this point. Just downloaded ftx us pro to try and login but it doesnt even have a google login?",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9tbf6q",
                            "author": "ForbiddenFruit91",
                            "score": 1,
                            "created_utc": 1653404425.0,
                            "response": "https://www.reddit.com/r/FTXOfficial/comments/p20pb4/i_created_an_ftx_account_via_the_ftx_app_it_says/?utm_medium=android_app&utm_source=share\n\nThis seems to be my issue. Didn't see an answer",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9tboij",
                            "author": "ForbiddenFruit91",
                            "score": 1,
                            "created_utc": 1653404531.0,
                            "response": "Sry to spam you but the last response in that thread had the verdict. Apparently the app and desktop are 2 separate things. In that case, might want to reconsider getting into ftx in the first place. Seems like a very idiotic flaw to say the least",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9uoouu",
                                    "author": "phikapp1932",
                                    "score": 2,
                                    "created_utc": 1653424921.0,
                                    "response": "I use FTX every day and I’m satisfied. Like I said, they are merging their platforms so it’ll be fine soon. FTX is actually a pretty innovative platform. You can trade crypto, NFTs, and US stocks, as well as crypto derivatives, all on one platform. Name another platform that does that!",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9utnw7",
                                            "author": "ForbiddenFruit91",
                                            "score": 2,
                                            "created_utc": 1653427056.0,
                                            "response": "Yea i spoke to support. Their devs are working on integration. I'm going to give it a shot! 👍",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9v2atb",
                                                    "author": "phikapp1932",
                                                    "score": 1,
                                                    "created_utc": 1653430842.0,
                                                    "response": "Best of luck to you!",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9tag2u",
                            "author": "ForbiddenFruit91",
                            "score": 0,
                            "created_utc": 1653404012.0,
                            "response": "Im sure. I set up my account on the ftx app. Did the google account sign up. When i went to the ftx us site, i logged in via google account. Then on the home it was requesting verification. Then checked history and wallets and nothing there",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}