{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uz6bl4",
            "title": "FTX verification. IS THERE ONE SINGLE TRUSTWORTHY EXCHANGE?!",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/uz6bl4/ftx_verification_is_there_one_single_trustworthy/",
            "author": "TendieTrades",
            "created_utc": 1653681205.0,
            "score": 15,
            "num_comments": 37,
            "subreddit": "BitcoinBeginners",
            "selftext": "Does Kraken have phone support?\n\nCoinbase I hear and see very bad things\n\nFTX.US I’ve submitted my ID for verification for level 2 through the app, through the claims support ticket and website over 7-8X. STILL NOT VERIFIED!!!\n\nIt takes just 5 minutes it says!\n\nEmail response “Verification pending we’ll contact you if there are any issues.” (THIS GOES BACK TO MAY 20th)\n\nFTX is REALLY pissing me off. I can’t find one damn crypto exchange I can put any trust into.  NOT ONE.\n\nCoinbase verified my ID in NO TIME AT ALL!",
            "stickied": false,
            "comments": [
                {
                    "id": "ia8jiy5",
                    "author": "Brettanomyces78",
                    "score": 8,
                    "created_utc": 1653683864.0,
                    "response": "Phone support is rare.\n\nGemini, Coinbase, Kraken, and FTX are all very good.  I'd guess you're basing your dislike of Coinbase off of hearsay and bad info, but you haven't actually said why you dislike it.  Have you tried a support ticket with FTX?  I've found them quite responsive.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia8or4q",
                            "author": "TendieTrades",
                            "score": 2,
                            "created_utc": 1653686329.0,
                            "response": "Many support tickets. I’ve submitted my drivers license which is a real ID with facial recognition tech. 3 selfies. Done it through the app, done it through the computer on their website and submitted it to them at least 10X.\n\nOn coinbase. Their statement in their 10K filing about if they declare bankruptcy. If I purchase any crypto assets they are to be moved to cold storage immediately. I will not trust an exchange to hold my crypto.\n\nI’ve yet to do any actual business with any exchange for these reasons. If I buy it and I want to move it, I should be able to move it to cold storage in a reasonable amount of time, if not the same day.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia8p068",
                                    "author": "Brettanomyces78",
                                    "score": 3,
                                    "created_utc": 1653686447.0,
                                    "response": "Oof.  That's frustrating.  Hope they resolve this quickly.\n\nSometimes, multiple tickets just create problems.  See one through to the end, and good luck.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia8q8j5",
                                            "author": "TendieTrades",
                                            "score": 2,
                                            "created_utc": 1653687037.0,
                                            "response": "Doesn’t help when it says can’t submit or something along those lines. But if I go to settings and about verification it says verification pending. Yet it only takes 5 minutes!",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia8v4vu",
                                                    "author": "the_mr_walrus",
                                                    "score": 3,
                                                    "created_utc": 1653689398.0,
                                                    "response": "The coinbase statement doesn’t matter and they aren’t anywhere close to bankrupt. They actually just got added to the Fortune 500 list with how successful they are.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "ia901i8",
                                                            "author": "Brettanomyces78",
                                                            "score": 3,
                                                            "created_utc": 1653691811.0,
                                                            "response": "It's also true for every exchange.  Coinbase just has to be more transparent because it's publicly traded.\n\nPeople are freaking out about a nonevent.",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "ia95a2c",
                                                            "author": "TendieTrades",
                                                            "score": 1,
                                                            "created_utc": 1653694459.0,
                                                            "response": "Anything can happen to any company at any time. Like I said in this thread I jokingly told my brokerage to short coinbase on May 5th as I was opening my coinbase account. I should’ve taken my own advice as it would’ve printed me some nice gains.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "iactxe2",
                                    "author": "NoLifeguard5122",
                                    "score": 2,
                                    "created_utc": 1653772720.0,
                                    "response": "Cold storage",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iad5r33",
                                            "author": "TendieTrades",
                                            "score": 1,
                                            "created_utc": 1653778341.0,
                                            "response": "Yes cold storage 100%",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia8yn1x",
                    "author": "SnackPliskin77",
                    "score": 4,
                    "created_utc": 1653691118.0,
                    "response": "I've been using Coinbase for about 2 years and it's been great. Customer service has been prompt in my experience.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia9coop",
                    "author": "MissNewbieDollar",
                    "score": 4,
                    "created_utc": 1653698335.0,
                    "response": "Kraken is the best for customer service.. fuck Coinbase.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia9esrl",
                            "author": "TendieTrades",
                            "score": 1,
                            "created_utc": 1653699461.0,
                            "response": "Customer service is incredibly important to me. Thanks for the reply.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia9jk3u",
                                    "author": "MissNewbieDollar",
                                    "score": 3,
                                    "created_utc": 1653701977.0,
                                    "response": "Me too. I've had to call in them a couple of times and they were amazing.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia93vr4",
                    "author": "Sino13",
                    "score": 3,
                    "created_utc": 1653693745.0,
                    "response": "Just use Coinbase Pro and move off exchange. I’ve had zero issues. Kraken is shilled pretty hard here so I’m tempted towards giving them a go but I’m happy with any exchange that actually lets me remove my assets into self custody. It does take a few days with CB depending on how you on ramp fiat though. \n\nSupport sucks for all of them (and essentially any other tech related company), but Kraken appears to the the best from a support standpoint if that’s your primary concern",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia9525m",
                            "author": "TendieTrades",
                            "score": 0,
                            "created_utc": 1653694347.0,
                            "response": "Can you explain the quickest way to off-ramp to self custody? I don’t trust any exchange to hold crypto assets. If my coinbase account is funded by my bank account directly to purchase BTC…how long would I be FORCED to hold it on the coinbase exchange?  That part makes me sick. If my fiat bought my BTC it’s mine to do what I want with it and park it wherever I want which is self custody cold storage.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia9cjkw",
                                    "author": "Chipp66606",
                                    "score": 3,
                                    "created_utc": 1653698257.0,
                                    "response": "you can just immediately send your crypto to another wallet off coinbase",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia9eq90",
                                            "author": "TendieTrades",
                                            "score": -2,
                                            "created_utc": 1653699425.0,
                                            "response": "Thank you. Hope that’s true.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "iadkrah",
                                    "author": "Sino13",
                                    "score": 1,
                                    "created_utc": 1653786376.0,
                                    "response": "Not entirely sure why you’re getting downvoted…Generally there is a couple day waiting period. I’ve consistently been able to withdraw my BTC 3-4 days after purchase when I load fiat via ACH transfer and purchase immediately. \n\nYou can trade coins immediately upon purchase but it takes a few days for everything to clear so you can withdraw.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia9gi4x",
                    "author": "mistakenforhuman",
                    "score": 3,
                    "created_utc": 1653700361.0,
                    "response": "Coinbase, well, not had any problems myself though that's because I haven't used it much. I did notice that service was unavailable at certain times when shit was going down with the market. \n\nAs to Kraken I've had no issues at all and remember the CEO tweeting about how govts could and would force them to limit transactions and to beware (this was at during the controversy about crypto being availble to Russian citizens). Which is either very good PR or just integrity given that you would expect such an admission could hurt his business. I think I trust Kraken.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia8dor0",
                    "author": "AutoModerator",
                    "score": 2,
                    "created_utc": 1653681206.0,
                    "response": "For trading related topics, there is also /r/bitcointrading\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia9jaw6",
                    "author": "FunkySamuraii",
                    "score": 2,
                    "created_utc": 1653701847.0,
                    "response": "I like Gemini",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia8dopd",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653681205.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iab1naq",
                    "author": "Maca_Najeznica",
                    "score": -1,
                    "created_utc": 1653741217.0,
                    "response": "I have no problem with Binance.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaans1z",
                    "author": "intercop",
                    "score": 0,
                    "created_utc": 1653730466.0,
                    "response": "Hitbtc. This is a trustworthy exchange for me for a long time.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}