{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uy9drv",
            "title": "Crypto Wallet",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/uy9drv/crypto_wallet/",
            "author": "Worried_Hippo_7746",
            "created_utc": 1653576738.0,
            "score": 3,
            "num_comments": 23,
            "subreddit": "BitcoinBeginners",
            "selftext": "\n\nI’m very new to the world of Crypto currency. I’m been thinking about making a few investments into Bitcoin. I’ve been told once I’ve aquired Bitcoin through and app such as Shakepay. I need to move it into a wallet. Can someone give me a dumbed down version of what wallet to use, why it’s important and how it all works.",
            "stickied": false,
            "comments": [
                {
                    "id": "ia48u2z",
                    "author": "BlocksDAO",
                    "score": 2,
                    "created_utc": 1653601072.0,
                    "response": "There is a saying “not your keys, not your coins” so if you don’t have a private key (seed phrase to a wallet) you don’t actually own your crypto. This is more responsibility on the individual to keep their keys hidden and safe, but gives the individual the rights to their crypto regardless of where it was purchased.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia4u8nm",
                    "author": "ApricotAcrobatic7761",
                    "score": 2,
                    "created_utc": 1653611115.0,
                    "response": "I'd suggest Guarda. It's a non-custodial wallet (you own your private keys therefore your Bitcoin and other assets are completely yours and not controlled by anyone else) and you can buy and exchange Bitcoin right there in the wallet. For purchases you can use credit or debit card, as well as SEPA transfer. The wallet prompts you to save a backup file every time you create or delete a wallet so that adds a security layer for restoring your wallet in a new device if needed. You can save individual private keys and protect your wallet with your unique password. It's a user-friendly crypto storage, with some cool features, and imho, it's suitable for beginners and experts. \nSurf their website to discover more details. \n\nhttps://guarda.com",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia2ldjt",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653576738.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia2mej0",
                    "author": "PorkAmbassador",
                    "score": 1,
                    "created_utc": 1653577163.0,
                    "response": "Search the sub reddit and you will find lots of post already discussing this.  It gets asked everyday.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia2o92c",
                    "author": "bitusher",
                    "score": 1,
                    "created_utc": 1653577922.0,
                    "response": "watch this video \n\nhttps://blockstream.com/green/\n\nhttps://www.youtube.com/watch?v=uO3Zi9D5b0Y",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia2t12x",
                    "author": "BitcoinWell",
                    "score": 1,
                    "created_utc": 1653579846.0,
                    "response": "Other people have linked to resources to find the wallets. The reason that its important to have the bitcoin in your own wallet is that if you have coins on an exchange and that exchange ceases to exist then any coins that you had on there will also go away as we've seen with exchanges like Mt Gox or more recently Quadriga where they shut down and took people's coins with them. So having your own wallet and taking your coins off exchanges ensures that any bitcoin you have purchased is held by you and no one else.\n\n&#x200B;\n\nGood suggestions for wallets are sparrow, samourai or if you want to ensure your coins are even more secure you can get a hardware wallet such as a ledger or trezor.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia34kgh",
                    "author": "BTCMachineElf",
                    "score": 1,
                    "created_utc": 1653584376.0,
                    "response": "For smaller amounts, an open source bitcoin-only phone wallet is fine (blockstream green, bluewallet).\n\nFor larger amounts, get a hardware wallet (coldcard or trezor). \n\nIn either case, when you generate the wallet you will be given seed words, a 'wallet backup'. Keeping those words private is 99% of bitcoin security. It's your primary concern. For an added level of security (and more wallets with the same seed), use wallet passphrases, store them separately.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia5j0gr",
                    "author": "bdjilka",
                    "score": 1,
                    "created_utc": 1653623477.0,
                    "response": "I now use simplehold wallet because it is convenient for me because it supports many networks (multiply store not only bitcoin, but also other cryptocurrencies). I trust it because this is a product of the simlpeswap exchange, which I have been successfully using for more than a year.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia7jask",
                    "author": "aktiveradio",
                    "score": 1,
                    "created_utc": 1653668182.0,
                    "response": "Look at Coin Wallet its non-custodial",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}