{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "us5khk",
            "title": "An interesting take on Bitcoin from professor Capelis. What was misrepresented?",
            "url": "https://m.youtube.com/watch?v=J9nv0Ol-R5Q&t=30s",
            "author": "Dormage",
            "created_utc": 1652851318.0,
            "score": 1,
            "num_comments": 8,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i91nnpp",
                    "author": "johnson5067",
                    "score": 3,
                    "created_utc": 1652856335.0,
                    "response": "Disclaimer: It's late and I skipped around a bit because I need to get to bed. I tried to at least read every slide. There are so many specific things to respond to so I'll just give my general thoughts.\n\nHe gets many of the technical details right, but it seems to me that the main reason he views Bitcoin as just another poisonous, useless crypto is because he doesn't have the same macroeconomic view as Satoshi. Satoshi was clearly motivated to create Bitcoin to address the problem of fiat currencies being perpetually debased by central banks and the risks of fractional reserve banking. Satoshi wanted a transparent, auditable monetary supply that anyone could transact in without a trusted third party. Many today believe in Bitcoin's store of value proposition because of the same macroeconomic view and belief that Satoshi succeeded---Bitcoin is a way to opt out of fiat. The closest the presentation got to recognizing this macroeconomic context was understanding that a major motivation for decentralized money is censorship resistance. But he dismisses that motivation by assuming that its only for illicit uses like drugs or scamming people.\n\nMuch of this talk is just \"we already had that!\" with respect to concepts in computer science, cryptography, and economics/finance. But he doesn't appreciate the brilliant, unstoppable combination of those concepts and technologies into a decentralized, stateless, peer-to-peer digital form of money with a finite supply (predictably issued) because he doesn't think fiat currency is a problem. He is unimpressed with many of the network's technical properties because he doesn't recognize that Bitcoin was designed to maximize decentralization, tamper-resistance (an untamperable supply), and censorship-resistance. Of course central databases are more efficient!\n\nWhat specifically did you find interesting?\n\nI didn't know that Vitalik was motivated by being nerfed in WoW, haha.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i91i3in",
                    "author": "Only_An_Ass_Assumes",
                    "score": 2,
                    "created_utc": 1652851995.0,
                    "response": "He’s an actual expert.\nSorry. But how¿",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i91kbfy",
                    "author": "Nada_Lives",
                    "score": 2,
                    "created_utc": 1652853663.0,
                    "response": "What was misrepresented? Let's start with his claim that he's an expert.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i91kom1",
                    "author": "nullama",
                    "score": 2,
                    "created_utc": 1652853939.0,
                    "response": "He's basically ranting for an hour.\n\nThere's also a big mix of concepts from all the other altcoins as well.\n\nIn short, there's nothing wrong about Bitcoin. It just takes more effort to use it properly.\n\nI think the main point is in this slide:\n\n\"The True Value of Cryptocurrencies: Censorship Resistance\"\n\nThat's one of the keys to Bitcoin. But of course this professor just went on with \"it's for drug dealers\"...\n\nAny other use of a blockchain can be done better in a centralized way. That's true. So all the blockchain solutions that you see these days for NFTs, or whatever, are just not great projects. Only when you care about censorship resistance, that's when it matters. And Bitcoin is a great example of that.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i91jolu",
                    "author": "E-renter",
                    "score": 1,
                    "created_utc": 1652853172.0,
                    "response": "> Throughout the history of Bitcoin there have been bubbles driven by fake money.\n\nYou mean like the fact that the US dollar has done a 5x in the last 2 years type of fake money? You mean bubbles like the stock market and real estate market driven by the exponential expansion of fiat currencies under fancy names like quantitative easing type of fake money? You mean bubbles in things like food and gasoline caused by unprecedented inflation in Western fiat currencies type of fake money?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i928apa",
                    "author": "igadjeed",
                    "score": 1,
                    "created_utc": 1652873837.0,
                    "response": "It's a one-hour monologue. If you want feedback, don't expect anybody to waste an hour listening to it. Provide a text transcript",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93g5zp",
                    "author": "Independent-Snow-129",
                    "score": 1,
                    "created_utc": 1652893826.0,
                    "response": "He is using an education strategy which let most individuals who only understand words for words in a neutral position while giving enough informations for someone to debate his position which didn't happen .    Brilliant, great share !",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}