{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "1vtzfa",
            "title": "linking bank account to coinbase",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/1vtzfa/linking_bank_account_to_coinbase/",
            "author": "ryknight",
            "created_utc": 1390371015.0,
            "score": 3,
            "num_comments": 15,
            "subreddit": "BitcoinBeginners",
            "selftext": "I just had a few questions about the safety of linking a bank account to coinbase to purchase bitcoins. It seems like this would take away some of the anonymity that bitcoin is based on, is this true? Where is my bank account information stored, and how safe is it? Should I just try to buy btc in cash with localbitcoins instead?",
            "stickied": false,
            "comments": [
                {
                    "id": "cevrs6z",
                    "author": "BobAlison",
                    "score": 5,
                    "created_utc": 1390371313.0,
                    "response": "> Should I just try to buy btc in cash with localbitcoins instead?\n\n If you can, then do. The \"cash deposit\" option lets you pay at a bank branch with no prior relationship and no questions asked.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "cevsnmp",
                            "author": "ryknight",
                            "score": 2,
                            "created_utc": 1390374444.0,
                            "response": "awesome thanks! That did seem like the best way to go, I'd just read so much about coinbase before seeing it\n\nEdit: Also have you bought some on localbitcoins? If so, did it go well?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "cevs702",
                    "author": "brickfrog2",
                    "score": 3,
                    "created_utc": 1390372695.0,
                    "response": ">  It seems like this would take away some of the anonymity that bitcoin is based on, is this true?\n\nWell, yeah.  You'll get ACH deposits/withdrawals on your bank account with \"Coinbase\" on them, that's not particularly anonymous.  If you care about anonymity you'll need to stick w/ cash transactions through Localbitcoins or bitquick.co.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "cevspjk",
                            "author": "ryknight",
                            "score": 1,
                            "created_utc": 1390374660.0,
                            "response": "Ok I wasnt too sure, but thats true. Just curious tho, if anonymity is not too important is coinbase safe to have linked to a bank account? It seems a lot of people have theirs linked.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "cevvx8c",
                                    "author": "brickfrog2",
                                    "score": 2,
                                    "created_utc": 1390393830.0,
                                    "response": "> is coinbase safe to have linked to a bank account\n\nSure, most people don't have issues (I haven't).  That said, if you want to be safe then open up a separate checking account that you just use for Coinbase & other websites.  That way, even in the situation you're somehow hacked you can only lose whatever $ is in the spare checking account.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "cewec7a",
                                            "author": "ryknight",
                                            "score": 1,
                                            "created_utc": 1390436626.0,
                                            "response": "That's kind of what I was thinking, I'll have to do that before trying coinbase out. Thanks",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "cevts2s",
                    "author": "GenConfusion",
                    "score": 3,
                    "created_utc": 1390379828.0,
                    "response": "I have my bank account linked to Coinbase, and other than the annoying 4 day wait to get my bitcoins I have not had issues, with deposits or withdrawals.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ceweerc",
                            "author": "ryknight",
                            "score": 1,
                            "created_utc": 1390436782.0,
                            "response": "Is it linked to your normal bank account? Or did you open a new one just for coinbase as someone else suggested?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "cewjdtw",
                                    "author": "GenConfusion",
                                    "score": 3,
                                    "created_utc": 1390447412.0,
                                    "response": "I just used my regular one.  To be honest I wasn't very savvy about it, just wanted to get into cryptos.  Anyway I'm OK with using it with my regular account for now.  No issues, but if you can, then sure, go ahead and get a separate account for it to be safe.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "cexezrq",
                                            "author": "ryknight",
                                            "score": 1,
                                            "created_utc": 1390533064.0,
                                            "response": "So you haven't had any issues? I'm reluctant to buy of coinbase just because of the linking to my bank account but I want to get into cryptos, so about the same place you were. But you would recommend trying coinbase out?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "cexgis8",
                                                    "author": "GenConfusion",
                                                    "score": 1,
                                                    "created_utc": 1390536542.0,
                                                    "response": "My personal experience has been good man.  It's annoying waiting ~4 days to get your BTC when you buy, or deposits to your bank account on sales, but that aside I've been happy.  You could try opening a capital one online checking or something since those are free and use that as your linked account to be safe.\n\nThe other option I've come across is vault of Satoshi in Canada but they ask for photo ID and address verification so it's not like you're anonymous or anything.  I'm not sure if you need to link your bank account with them or if you can just make deposits without linking, but they do let you trade fiat/coins directly so it might be an option worth looking into to get BTC.\n",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "cevt32e",
                    "author": "kongkong84",
                    "score": 2,
                    "created_utc": 1390376273.0,
                    "response": "I linked my bank account to Coinbase a few months ago. After doing so, very late that same night (or early next morning) around 4 a.m. I got an email saying my online banking had been shut down do to someone trying to login to my account with the wrong password 4 times. It kind of freaked me out.\n\nI called the bank and fixed it, set up a generated encrypted password and I haven't had any issues since then. \n\nI still don't know if the attempted hack had anything to do with me setting up my bank account with coinbase but you have to admit that would be an odd coincidence.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "cexf2g6",
                            "author": "ryknight",
                            "score": 1,
                            "created_utc": 1390533229.0,
                            "response": "Yea that seems like a pretty big coincidence, and that is exactly what is keeping me from joining coinbase. Would to recommend I still link my account, just set set up an encrypted password? ",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "cf2cx9d",
                                    "author": "kongkong84",
                                    "score": 1,
                                    "created_utc": 1391049119.0,
                                    "response": "Yeah I mean I haven't had any problems since. And I have used it to purchase BTC so I would say go for it. ",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}