{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uwshen",
            "title": "Russia may be mining crypto in a prison from the 18th century",
            "url": "https://interestingengineering.com/russia-mining-crypto-prison-18th-century",
            "author": "metatheoretical",
            "created_utc": 1653403534.0,
            "score": 2,
            "num_comments": 4,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9tbdlb",
                    "author": "bitsteiner",
                    "score": 1,
                    "created_utc": 1653404408.0,
                    "response": "Energy consumption can't be cheated. That's why PoW is the only completely trustless method to maintain a permissionless ledger. There will never be more energy efficient cryptocurrencies with comparable security.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9tabqu",
                    "author": "Nada_Lives",
                    "score": 1,
                    "created_utc": 1653403961.0,
                    "response": "Its name is \"Russia\".",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9tdi9i",
                    "author": "coinfeeds-bot",
                    "score": 1,
                    "created_utc": 1653405305.0,
                    "response": "tldr; The deputy warden at Russia's Butyrskaya prison in central Moscow has been accused of setting up a crypto mining farm on the prison premises. The mining operation was allegedly run in the psychiatric clinic set up by the Federal Penitentiary Service in the country. The operation did not run for very long or consume too much power, according to reports.\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9tec01",
                    "author": "Bitcoin__Hodler",
                    "score": 1,
                    "created_utc": 1653405650.0,
                    "response": "Guess Bitcoin fans are everywhere!",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uwsq1p",
            "title": "Just turning 16, any exchanges allow my age to trade?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uwsq1p/just_turning_16_any_exchanges_allow_my_age_to/",
            "author": "andromaniac_",
            "created_utc": 1653404214.0,
            "score": 3,
            "num_comments": 11,
            "subreddit": "Bitcoin",
            "selftext": "My goal is to put 10-20% of my paychecks into bitcoin but it’s been hard to do so far. I’ve used my parents crypto accounts, but it’s difficult to deal with the taxes, and I don’t understand taxes enough to make it work. Are there any other options I have to purchase at 16?",
            "stickied": false,
            "comments": [
                {
                    "id": "i9tcne0",
                    "author": "Bog-EA",
                    "score": 1,
                    "created_utc": 1653404942.0,
                    "response": "I'm not sure but my thought would be to use your parent's account to purchase a stablecoin which you could send to a decentralized exchange to trade for whatever you wish.  Since the stable coin is always worth a dollar (unless your UST) there should be no tax implication.  Parents could claim they were gifts to you.  Even if IRS was to determine that it was your money running through their is still no tax implication.  You took a dollar sold it for something worth a dollar, moved to a dex exchange and traded for a $1 worth of something else.  The tax implications would start as you traded the stable coins BTC.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9td582",
                    "author": "Caveatcat",
                    "score": 1,
                    "created_utc": 1653405151.0,
                    "response": "Consult with your accountant regarding the taxes. You will have to report profits over 500.\n\nYou can’t trade or use exchanges until you’re 18 btw..this is not allowed and is quite risky if you get found out. \n\nI believe you’re using your parents identities but tell them so they can report taxes.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9tfk28",
                    "author": "igadjeed",
                    "score": 1,
                    "created_utc": 1653406161.0,
                    "response": "If you have your own bank account, there are other ways to buy Bitcoin",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9tly2b",
                            "author": "andromaniac_",
                            "score": 1,
                            "created_utc": 1653408806.0,
                            "response": "Like?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9tr28i",
                                    "author": "MyNamesTerrpzz",
                                    "score": 1,
                                    "created_utc": 1653410876.0,
                                    "response": "Create wallet on non kyc and meet someone u know with cash or bank transfer for crypto, just take a friend with you and do in public always. I shouldn’t be suggesting this probably but it is what it is",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9tstkd",
                                    "author": "MCHappster1",
                                    "score": 1,
                                    "created_utc": 1653411599.0,
                                    "response": "Yeah just google bitcoin for cash",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9ti026",
                    "author": "never-give-up-every1",
                    "score": 1,
                    "created_utc": 1653407182.0,
                    "response": "I think there is not, all trading platform to bitcoin has a recommendation of being an 18+ and you're required to pass requirements to have proof that you're 18+ but somehow you can advise your parents to make them use their ID I think you can do it. If somehow you're in Canada you can use Netcoins to Bitcoin. But my advice is to wait for you 18 years of age and learn more about it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9tn1g9",
                    "author": "Nada_Lives",
                    "score": 1,
                    "created_utc": 1653409250.0,
                    "response": "Exchanges are fiat. They play by fiat rules. The only time you actually have Bitcoin is when you have the keys in your own wallet.\n\nPlan accordingly.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9tf2n7",
                    "author": "BitcoinMoonLanding",
                    "score": 0,
                    "created_utc": 1653405957.0,
                    "response": "No taxes to pay if you just buy and hodl.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9tnp2i",
                            "author": "ApplicationAny1434",
                            "score": 1,
                            "created_utc": 1653409516.0,
                            "response": "Depends on country. Some want unrealized gains tax.\n\nIf people scream around to tax the rich. We all some day pay unrealized gains taxes. 1btc is not 1btc if that happens\n\n1btc is 0.75btc at year end and so on, the more they print the more they take your btc away",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9tigzn",
                    "author": "HomessteadRevival",
                    "score": 0,
                    "created_utc": 1653407379.0,
                    "response": "Localcryptos.com",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uwsel9",
            "title": "Wallet or Exchange without KYC?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uwsel9/wallet_or_exchange_without_kyc/",
            "author": "oooouuuua",
            "created_utc": 1653403306.0,
            "score": 3,
            "num_comments": 8,
            "subreddit": "Bitcoin",
            "selftext": "I need a good wallet or exchange where I can buy crypto with my debit card without KYC and where the minimum deposit isn't over 30€.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9ta4s4",
                    "author": "Yzaamb",
                    "score": 8,
                    "created_utc": 1653403879.0,
                    "response": "Dude - debit card without KYC is an oxymoron. And for 30€ a pop why do you care?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ta2ue",
                    "author": "DudeIncogneto",
                    "score": 4,
                    "created_utc": 1653403855.0,
                    "response": "Any good wallet doesn't have kyc. If you want to buy bitcoin without identifying yourself look at bisq network, hodlhodl, azteco bitcoin vouchers or a bitcoin atm.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9tapkd",
                    "author": "Nada_Lives",
                    "score": 3,
                    "created_utc": 1653404124.0,
                    "response": "Bitcoin has no function to convert to and from fiat. You're at the mercy of whatever the fiat system allows.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9tmuuo",
                            "author": "1quickmr",
                            "score": 1,
                            "created_utc": 1653409177.0,
                            "response": "What?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9tq0s7",
                                    "author": "Nada_Lives",
                                    "score": 1,
                                    "created_utc": 1653410452.0,
                                    "response": "I can repeat, if you like.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9tyvxk",
                                            "author": "1quickmr",
                                            "score": 1,
                                            "created_utc": 1653414090.0,
                                            "response": "How about peer to peer",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9u2ina",
                                                    "author": "Nada_Lives",
                                                    "score": 1,
                                                    "created_utc": 1653415587.0,
                                                    "response": "Bitcoin IS peer to peer. Wallet to wallet.\n\nYou are trying to involve a third party, *which Bitcoin does not allow in its protocol.*\n\nGood luck buying your \"crypto\" with a debit card. *This is not a Bitcoin function,* though there are many commercial fiat exchanges offer it. *They are ruled by fiat, not Bitcoin.*\n\nFor more guidance, look at the \"Resources\" column to the right, under \"Getting Started\". -->",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9tqtxi",
                    "author": "Unikum92",
                    "score": 1,
                    "created_utc": 1653410783.0,
                    "response": "Sovryn has no KYC and is a Bitcoin DEX.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uwsqze",
            "title": "BANGUI, May 24 (Reuters) - Central African Republic will launch the continent’s first legal cryptocurrency investment hub, the presidency said, extending the impoverished country’s embrace of digital finance despite words of caution from the International Monetary Fund.",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uwsqze/bangui_may_24_reuters_central_african_republic/",
            "author": "simplelifestyle",
            "created_utc": 1653404285.0,
            "score": 5,
            "num_comments": 1,
            "subreddit": "Bitcoin",
            "selftext": "> Marred by decades of conflict, Central African Republic last month became the first country in Africa and only the second in the world to adopt bitcoin as an official currency.\n> \n> The government has so far provided little detail on the logistics of its bitcoin vision.\n> \n> The soon-to-be-launched “SANGO” crypto initiative has a website on which interested investors can sign up to a waiting list.\n> \n> “The formal economy is no longer an option,” President Faustin-Archange Touadera said in a statement on Monday.\n> \n> “An impenetrable bureaucracy is keeping us stuck in systems that do not give a chance to be competitive.”\n> \n> There was no indication when the investment hub would be open or how it would operate.\n> \n> The move to adopt bitcoin in a country where internet use is low and electricity unreliable raised eyebrows among crypto experts, puzzled lawmakers and residents of the gold and diamond-producing country, and drew words of caution from the International Monetary Fund.\n> \n> Central Africa’s regional banking regulator for the six-nation Economic and Monetary Community of Central Africa also sent out a reminder about its ban on cryptocurrencies, stating the prohibition was meant to ensure financial stability.\n> \n> Many crypto assets have plunged in value in recent months, with bitcoin down 39% in eight weeks and losing more than half of its value since a Nov. 10 peak of $69,000. (Reporting by Judicael Yongo Writing by Sofia Christensen Editing by Mark Potter)\n\nhttps://www.reuters.com/article/idUSL5N2XG2OM",
            "stickied": false,
            "comments": []
        }
    ]
}