{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uxz7ga",
            "title": "If you've ever wondered what Miners deployed inside a power plant looks like; the screen you see is part of a monitoring program and shows temperature reading at different points around the rack.",
            "url": "https://i.redd.it/l40k5n5lwq191.jpg",
            "author": "BitcoinFan1239",
            "created_utc": 1653538235.0,
            "score": 277,
            "num_comments": 67,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "ia1ka5t",
                    "author": "nullama",
                    "score": 20,
                    "created_utc": 1653554640.0,
                    "response": "And yet [one of these little guys](https://i.imgur.com/bneJwyZ.jpg) found a block earlier this year...",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia1s9b2",
                            "author": "Sartheris",
                            "score": 8,
                            "created_utc": 1653561483.0,
                            "response": "Mad lads! The chance for this is almost zero",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia22emc",
                                    "author": "nullama",
                                    "score": 3,
                                    "created_utc": 1653568042.0,
                                    "response": "If you have a group of them like the photo, then the chances are about one in a million every day you keep mining.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia2bd66",
                                            "author": "DePraelen",
                                            "score": 1,
                                            "created_utc": 1653572485.0,
                                            "response": "So essentially a better odds than a lottery ticket. But significantly worse cost vs. reward ratio.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia2j5vv",
                                                    "author": "arianjalali",
                                                    "score": 1,
                                                    "created_utc": 1653575825.0,
                                                    "response": "I love the smell of probabilities in the morning.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia1ey4c",
                    "author": "ZZ3xhZz",
                    "score": 6,
                    "created_utc": 1653549872.0,
                    "response": "This one is very organised, I've seen photos of some really sketchy miners before.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia1ta7h",
                            "author": "LuKeNuKuM",
                            "score": 2,
                            "created_utc": 1653562248.0,
                            "response": "Yeah, they often look like an I.T. server room from 1998.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia16kd8",
                    "author": "New_Dawn",
                    "score": 41,
                    "created_utc": 1653543232.0,
                    "response": "Looks more secure and more fair to me than some unelected central banker wiping away your earnings everytime they punch in numbers on a terminal somewhere.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia299ey",
                            "author": "Memo_Ry",
                            "score": 3,
                            "created_utc": 1653571517.0,
                            "response": "Annnnd it's gone.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "ia1ryoo",
                            "author": "goahnary",
                            "score": -5,
                            "created_utc": 1653561256.0,
                            "response": "You know what… you’re actually right! Excess production directly enfranchises everyone.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia190cb",
                    "author": "ASZ12159",
                    "score": 25,
                    "created_utc": 1653545067.0,
                    "response": "This is good for mother nature",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia1rib7",
                            "author": "JSammut29",
                            "score": 8,
                            "created_utc": 1653560900.0,
                            "response": "sustainability will never be prioritized with soft money\n\n**hard money is key**",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia2i7l6",
                                    "author": "DoYouEvenBTC",
                                    "score": 1,
                                    "created_utc": 1653575427.0,
                                    "response": "This. If inflation is 10%+ I might as well buy a lot of new shit than watch the money evaporate.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "ia1qajc",
                            "author": "Aerith_Gainsborough_",
                            "score": 6,
                            "created_utc": 1653559917.0,
                            "response": "You mean the entire universe?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia177ey",
                    "author": "Saamar_Gathrakos",
                    "score": 7,
                    "created_utc": 1653543693.0,
                    "response": "Where is this?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia1pkjj",
                    "author": "nopy4",
                    "score": 10,
                    "created_utc": 1653559324.0,
                    "response": "Looks decentralized",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia11wcx",
                    "author": "PaymentNo7878",
                    "score": 6,
                    "created_utc": 1653540004.0,
                    "response": "Awesome to see this! I’m curious to see how mining will evolve in the future",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia1u4yd",
                    "author": "Tarnamanakan",
                    "score": 4,
                    "created_utc": 1653562869.0,
                    "response": "Could someone educate me on how this is decentralization again since we have only a handful of people with giant mining farms ? How does the system is ensured that these people will behave for the sake of the crypto world over their personal gains at all times? (Please ignore if these questions have been responded countless times. I’ll just look somewhere else then)",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia1ylzn",
                            "author": "NanosGoodman",
                            "score": 4,
                            "created_utc": 1653565816.0,
                            "response": "There aren't many, but its one of the few things that's still a question in Bitcoin going forward. Sure nodes are important for changes to the protocol, but Bitcoin still relies on miners (and pools!) to secure the network and keep it honest.\n\nCentralization due to economies of scale.\n\nWhoever has these giant mining farms, or pools, will earn more bitcoin than smaller miners which will allow them to expand their operation, taking even more bitcoin... and so on. Centralizing the wealth and the hash.\n\nThe usual response is that with more entities entering the space, decentralization will only grow. Or that the incentive is to be honest. We'll have to find out I guess.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "ia1uoxj",
                            "author": "TandemRigs",
                            "score": 5,
                            "created_utc": 1653563262.0,
                            "response": "Because of the nodes.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia1vnwd",
                                    "author": "Tarnamanakan",
                                    "score": 2,
                                    "created_utc": 1653563932.0,
                                    "response": "Thanks I know that though it is very effective against hacking or manipulation but my question was more towards supply demand relationship. For instance what if they just shut down the bitcoin miners or computers.? Because people on quora was suggesting that “shit would hit the fan”. And again how are those giant miners ensuring the crypto world that they will never ever do such a thing ?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia1w66a",
                                            "author": "CallingVoid",
                                            "score": 4,
                                            "created_utc": 1653564266.0,
                                            "response": "What is the incentive to do so? Their hardware has a limited shelf life and a massive outlay. Every second they aren't running they are losing potential bitcoin and potentially making a loss.\n\nA global, coordinated ban takes time. As miners switch off the difficulty will drop, if it drops far enough then GPU mining becomes viable again, you can't really ban that.\n\nI'm not saying it's good but it's not \"shit hits the fan\" bad. Miners are just paid security actors, they are useful tools for bitcoin, not essential to its running.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia1wmha",
                                                    "author": "Tarnamanakan",
                                                    "score": 1,
                                                    "created_utc": 1653564564.0,
                                                    "response": "Thank you for your response it was very informative. The incentive could be if the political power doesn’t want them to operate because their established financial systems are not profitable anymore and they are simply threatening them with oppression and these guy are already wealthy enough to not clash with anybody and they just quit the system. I know I’m reaching a little bit but after seeing how irrational political leaders are, they can easily use them scapegoats for their shortcomings",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "ia1xkcz",
                                                            "author": "CallingVoid",
                                                            "score": 3,
                                                            "created_utc": 1653565170.0,
                                                            "response": "Thing is, they all have to agree and enforce it at once for it to be a real problem, so you need to know where all the miners are and shut them down simultaneously around the world. Can you see irrational leaders coming to a concensus on this?\n\nBut even if they could, would it be enough? We can see how badly that went in China. Despite their outright ban they still contribute a large amount to the global hashrate.\n\nAnd, for the sake of arguement, if they do manage to do it, then under these exceptional circumstances concensus can be achieved about an alternative means of mining (like alter the pow algo to go back to GPU friendly means of mining, so that bitcoin can weather the storm, though this would be extremely drastic and I cannot stress enough how ugly that fight would be).",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "ia1y0v6",
                                                                    "author": "Tarnamanakan",
                                                                    "score": 1,
                                                                    "created_utc": 1653565451.0,
                                                                    "response": "Yeah, hope it never gets to that.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "ia1wyas",
                                                            "author": "TandemRigs",
                                                            "score": 1,
                                                            "created_utc": 1653564778.0,
                                                            "response": "The more irrational political leaders act then the less credibility they have.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "ia27ndq",
                                            "author": "rickiye",
                                            "score": 1,
                                            "created_utc": 1653570748.0,
                                            "response": "If all miners in the world would shut down, you  could turn on your pc and put it mining with your simple cpu. Btc algo would adjust difficulty to match your processing power, and you'd be the only miner and the blockchain would keep unscathed. And if you wouldn't do, someone else would. So, not a problem.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "ia24e0f",
                                            "author": "UExis",
                                            "score": 0,
                                            "created_utc": 1653569106.0,
                                            "response": "If the big miners shut off their mining computers, all the other miners are still mining. So… that’s not a problem.\n\nIn the weird parallel world where everyone stops mining… what’s the problem there? I’m sure there will still be exchanges that exchange existing Bitcoin.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "ia26i6w",
                            "author": "robotsdev",
                            "score": 1,
                            "created_utc": 1653570191.0,
                            "response": "Like the other guy said, because of the nodes, but that's a bit oversimplified.  \nIn any case, we don't know who is paying for this mine. Is it one guy?  \nMany mining farms just sell you mining time and reward the investors with the BTC.  \nAnd then of course, this is not the only place mining bitcoin. And even most pools are composed of many many different miners. And! I think soon, not sure on this, there's an update that will let individual miners vote on whatever they want instead of the pool voting unanimously. Which will decrease centralization in mining too.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "ia2j51a",
                            "author": "DoYouEvenBTC",
                            "score": 1,
                            "created_utc": 1653575815.0,
                            "response": "Every pool is thousands of actual owners (SlushPool has around 16.k users operating 190k workers). There are services that can help put your mining rig into such farm (Compass for example).  \nI think the operational cost will always keep the monopoly in check, but who knows.\n\nWith that said a business which is able to buy asics by the thousands and access cheap electricity because of it will always have an edge.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia17qx5",
                    "author": "TurbulentYak7554",
                    "score": 1,
                    "created_utc": 1653544102.0,
                    "response": "Describe monopoly",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia1o3ke",
                    "author": "Gandalftron",
                    "score": -4,
                    "created_utc": 1653558050.0,
                    "response": "How much fucking energy does this consume.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia1s0qb",
                            "author": "ihateduckface",
                            "score": 9,
                            "created_utc": 1653561300.0,
                            "response": "Less than mining for gold.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "ia27rkj",
                            "author": "Trenchapo",
                            "score": 2,
                            "created_utc": 1653570806.0,
                            "response": "Don’t care, we already been asked to give up our v8 engines now people really bitching about mining. World will consume energy regardless, I’m not gonna be left behind just cuz hippies get butt hurt",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "ia1s32y",
                            "author": "goahnary",
                            "score": 5,
                            "created_utc": 1653561349.0,
                            "response": "They use it to gobble up what the power company would normally waste actually and it’s utilizing that power rather than throwing away the excess power needed on standby for unexpected surges in usage.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia2213l",
                                    "author": "Gandalftron",
                                    "score": -4,
                                    "created_utc": 1653567834.0,
                                    "response": "Source on this claim?  Seems far fetched and not true.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia27wq4",
                                            "author": "Trenchapo",
                                            "score": 2,
                                            "created_utc": 1653570875.0,
                                            "response": "Do you have a source on that?\n\nSource?\n\nA source. I need a source.\n\nSorry, I mean I need a source that explicitly states your argument. This is just tangential to the discussion.\n\nNo, you can't make inferences and observations from the sources you've gathered. Any additional comments from you MUST be a subset of the information from the sources you've gathered.\n\nYou can't make normative statements from empirical evidence.\n\nDo you have a degree in that field?\n\nA college degree? In that field?\n\nThen your arguments are invalid.\n\nNo, it doesn't matter how close those data points are correlated. Correlation does not equal causation.\n\nCorrelation does not equal causation.\n\nCORRELATION. DOES. NOT. EQUAL. CAUSATION.\n\nYou still haven't provided me a valid source yet.\n\nNope, still haven't.\n\nI just looked through all 308 pages of your user history, figures I'm debating a glormpf supporter. A moron.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia29hg2",
                                                    "author": "goahnary",
                                                    "score": 1,
                                                    "created_utc": 1653571622.0,
                                                    "response": "Gonna copy this as a canned response to source requests, thanks.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "ia2drzx",
                                                    "author": "Gandalftron",
                                                    "score": 1,
                                                    "created_utc": 1653573547.0,
                                                    "response": "You aren't actually debating anything. You are just spouting nonsense.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "ia25h0m",
                                            "author": "Kahoobbb",
                                            "score": 1,
                                            "created_utc": 1653569669.0,
                                            "response": "Not far fetched at all. Have you been brainwashed by the government? Go watch the documentary \"this machine greens\". It talks about how bitcoin mining is good for the enviroment and how it doesn't negatively impact it at all.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "ia1w0gm",
                            "author": "jdoingj",
                            "score": 1,
                            "created_utc": 1653564162.0,
                            "response": "In this picture alone, probably about 1.5-2 megawatts.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "ia1xtrh",
                            "author": "BlankEris",
                            "score": 1,
                            "created_utc": 1653565329.0,
                            "response": "Not enough",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "ia1zigh",
                            "author": "NanosGoodman",
                            "score": 1,
                            "created_utc": 1653566378.0,
                            "response": "World Energy Production: 175,000 TWh\n\nBitcoin Energy Usage: 200 TWh",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "ia1s9y2",
                            "author": "Sartheris",
                            "score": 0,
                            "created_utc": 1653561497.0,
                            "response": "All of it",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia280g6",
                    "author": "combocookie",
                    "score": 1,
                    "created_utc": 1653570925.0,
                    "response": "Very decentralized indeed.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia1k30w",
                    "author": "hexagon-sun",
                    "score": 1,
                    "created_utc": 1653554461.0,
                    "response": "Those are some thicc power lines",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia1kwu2",
                    "author": "portrav2",
                    "score": 1,
                    "created_utc": 1653555212.0,
                    "response": "what’s the purpose of mining?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia1lqep",
                            "author": "LayPessimist",
                            "score": 4,
                            "created_utc": 1653555950.0,
                            "response": "Securing the blockchain.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia1mrer",
                                    "author": "portrav2",
                                    "score": 2,
                                    "created_utc": 1653556870.0,
                                    "response": "can you explain like I’m 5 lol",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia1wxo0",
                                            "author": "CallingVoid",
                                            "score": 1,
                                            "created_utc": 1653564767.0,
                                            "response": "Proof of work requires miners to solve a maths problem, if they solve it then they get a block, which comes with some bitcoin and space to put transactions in (for a fee).\n\n\n The longest chain is the bitcoin blockchain. If someone wants to be cheeky and allow a double spend, they've got to produce the longest blockchain instead. \n\nThe more energy this takes, the more difficult it is to do so, as you complete with all other miners to make the longest chain, and if you are a minority hash rate miner (which all are) then you are trying to compete with people that make blocks faster than you.\n\nThis is a great way to lose money as energy and equipment is expensive. It makes more sense to play along and compete with everyone else.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "ia1nvt1",
                                            "author": "feyyd",
                                            "score": -1,
                                            "created_utc": 1653557859.0,
                                            "response": "these machines basically keep \"all transactions ever\" for BTC huge redundant computer network that is cryptographically secure.  You can access funds now via a 24 word pneumonic password from anywhere on the planet with access to the network.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "ia1mw55",
                                    "author": "watermelonloo",
                                    "score": 1,
                                    "created_utc": 1653556989.0,
                                    "response": "Me too pls",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "ia1th6q",
                            "author": "LuKeNuKuM",
                            "score": 2,
                            "created_utc": 1653562391.0,
                            "response": "Look up 'proof of work'. Better still, get a copy of The Bitcoin Standard, it'll change your life!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia1miws",
                    "author": "lordinov",
                    "score": 1,
                    "created_utc": 1653556664.0,
                    "response": "Is this marathon digital",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia1qzis",
                    "author": "AndreBonini_",
                    "score": 1,
                    "created_utc": 1653560484.0,
                    "response": "Exxon 30% revenue is from there",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia1sise",
                    "author": "PM_ME_UR_PSA10_LUGIA",
                    "score": 1,
                    "created_utc": 1653561682.0,
                    "response": "What effect does this have on the decentralisation of the network?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia1slnt",
                    "author": "Gadopsis",
                    "score": 1,
                    "created_utc": 1653561743.0,
                    "response": "Bitcoin fixes this problem",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia1xpka",
                    "author": "BlankEris",
                    "score": 1,
                    "created_utc": 1653565257.0,
                    "response": "Beautiful",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia1xqu4",
                    "author": "Thom5001",
                    "score": 1,
                    "created_utc": 1653565278.0,
                    "response": "What kind of capital investment was required for that place?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia272gx",
                            "author": "PM_me_song_mashups",
                            "score": 2,
                            "created_utc": 1653570467.0,
                            "response": "Those a Bitmain Antminer S19’s. Probably S19j Pro’s. They retail for around $10,000 each, probably less if purchased in bulk or if they were used. The picture we see is easily a couple million USD and this is probably a very small section of their operation.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia2if68",
                                    "author": "Thom5001",
                                    "score": 1,
                                    "created_utc": 1653575515.0,
                                    "response": "How much does a mining outfit this size net?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia1z3y6",
                    "author": "Dolphin_Dinomite",
                    "score": 1,
                    "created_utc": 1653566125.0,
                    "response": "The end result of the human hive collective, endless rows of single purpose computers, converting the energy of the atom into money.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia22p3k",
                    "author": "aj989510",
                    "score": 1,
                    "created_utc": 1653568202.0,
                    "response": "This is something unreal. It always caused me a lot of emotions. For me, this is the other side of the crypto sphere.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia2d62u",
                    "author": "Life_Airline_6767",
                    "score": 1,
                    "created_utc": 1653573281.0,
                    "response": "Who cares honestly",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia2ivtt",
                    "author": "hotsprings1234",
                    "score": 1,
                    "created_utc": 1653575707.0,
                    "response": "I didn't think minors were allowed to work?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia1mboy",
                    "author": "blackem",
                    "score": 0,
                    "created_utc": 1653556483.0,
                    "response": "What kind of powerplant is it? Is it mining witch excess power?",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}