{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uwl0ct",
            "title": "China's resurgence in Bitcoin mining means country's hashrate still second only to US - Blockbulletin",
            "url": "https://blockbulletin.com/news/bitcoin/chinas-resurgence-in-bitcoin-mining-means-countrys-hashrate-still-second-only-to-us/",
            "author": "sebo28091995",
            "created_utc": 1653376240.0,
            "score": 1,
            "num_comments": 0,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uwl2kf",
            "title": "If you're truly long term, bear markets are your friend",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uwl2kf/if_youre_truly_long_term_bear_markets_are_your/",
            "author": "Madteklynd",
            "created_utc": 1653376526.0,
            "score": 213,
            "num_comments": 88,
            "subreddit": "Bitcoin",
            "selftext": "I have been doing a lot of reflection about my stance towards the bitcoin price. I realised that me cheering for the price to go up is actually counterproductive to my goals.\n\nOnce you have been sufficiently orange pilled and put in your 100+ hours, you realise it's not about short term gains, but stacking as many sats as humanly possible.\n\nOnce all of this comes together your time horizon switches from months to years to decades.\n\nSo if your plan is to accumulate as much BTC as possible, isn't short term growth in the price a bad thing? While it's a good thing for the network and adoption, it's counterproductive to you stacking sats.\n\nThe one thing keeping me up at night is knowing I can't buy more BTC at a low price. I pray for a 1-2 year bear market where I can silently build up my stack. I'd rather DCA at 15-30k than at 60-100k.\n\nI know a lot of people have already figured this out, but I think maybe some haven't, given the obsession over the day to day price on reddit and news articles.\n\nConclusion: If you're truly long term on the Bitcoin technology and macroeconomic potential, a long drawn out bear market is a gift.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9s5ggs",
                    "author": "baotsnheos",
                    "score": 49,
                    "created_utc": 1653376998.0,
                    "response": "I've  been waiting for crypto winter since 69k! I don't think we're quite there yet but a year of dcaing around 30k will be delightful",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9s5n5f",
                            "author": "Madteklynd",
                            "score": 13,
                            "created_utc": 1653377161.0,
                            "response": "Exactly my thoughts. Let the mob fight trying to pump it while we patiently DCA at reasonable prices",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9uyvcx",
                                    "author": "FailedApocalypse",
                                    "score": 2,
                                    "created_utc": 1653429330.0,
                                    "response": "Patience is important to market and crypto should be kept alone",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9sbvnc",
                            "author": "coffee_for_dinner",
                            "score": 3,
                            "created_utc": 1653382967.0,
                            "response": "For real, a bear market means I'm not going to FOMO my dumb ass at some new ATH and actually have a chance of DCAing into some kind of good average.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9v0ygy",
                                    "author": "bitchipmeister",
                                    "score": 1,
                                    "created_utc": 1653430243.0,
                                    "response": "Yeah FOMO is Common in bear market, specially with new coin",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9wsuby",
                                            "author": "stongamuse",
                                            "score": 1,
                                            "created_utc": 1653465572.0,
                                            "response": "I stop paying too much attention to those FOMO, doing my own things.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9tl4ut",
                            "author": "h0twired",
                            "score": 1,
                            "created_utc": 1653408469.0,
                            "response": "Followed by another year of DCAing at $15k",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9u91dv",
                                    "author": "motaconan",
                                    "score": 1,
                                    "created_utc": 1653418332.0,
                                    "response": "A whole year of DCAing at $15k? That would be a miracle!",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9uz9x9",
                                    "author": "Dry_Advice_4963",
                                    "score": 1,
                                    "created_utc": 1653429506.0,
                                    "response": "I'm ok with that",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9wla2a",
                                    "author": "lrpedropires",
                                    "score": 1,
                                    "created_utc": 1653459336.0,
                                    "response": "There is no issue in DCAing at any price because you know the future",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9wdb1d",
                            "author": "jessie268",
                            "score": 1,
                            "created_utc": 1653453894.0,
                            "response": "Up to now it's down 50%",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9wmze5",
                                    "author": "baotsnheos",
                                    "score": 1,
                                    "created_utc": 1653460649.0,
                                    "response": "This is merely a flesh wound. Post 2018 it went from from 18k ath to 3k for a fairly long period",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9wr8fk",
                            "author": "markapapa",
                            "score": 1,
                            "created_utc": 1653464133.0,
                            "response": "Buying in dip is always helpful you got so many things to do",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9se4pa",
                    "author": "FutureNotBleak",
                    "score": 8,
                    "created_utc": 1653385038.0,
                    "response": "I approve this message.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9w98xl",
                            "author": "willesscp",
                            "score": 3,
                            "created_utc": 1653451493.0,
                            "response": "We all can agree at this point, we should just enjoy this time",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9tu1ze",
                    "author": "Kreygasmlord",
                    "score": 3,
                    "created_utc": 1653412100.0,
                    "response": "\"If you have money\" bear market is your friend.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9vz0v2",
                            "author": "jasonpushee1979",
                            "score": 1,
                            "created_utc": 1653446254.0,
                            "response": "That's true and if you have money you keep buying dips",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9tkwx9",
                    "author": "DudeWhatThe",
                    "score": 3,
                    "created_utc": 1653408378.0,
                    "response": "My average buy price is wayyyyyy too high and I probably put in more than I should have. However, the lower the price, the more I see it as a chance to DCA and meaningfully reduce my average. So, yes a gift indeed.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9s79me",
                    "author": "shadowbastrd",
                    "score": 11,
                    "created_utc": 1653378635.0,
                    "response": "Can’t wait for it to get to a dollar..  then a can get a whole bunch!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9s8l85",
                            "author": "Tomimosa",
                            "score": -6,
                            "created_utc": 1653379846.0,
                            "response": "And an average sized house costs $0.2 and you get paid annually $0.000000000000001. 😘",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9s5h2z",
                    "author": "Master-Development47",
                    "score": 5,
                    "created_utc": 1653377013.0,
                    "response": "good read. the most i ever bought was like $500s worth and this is the longest i’ve held on. it being like 4 months which is a really really short time huh? I think my main thing was constantly looking at the price…every day. thinking i would make profit over night.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9s5qoo",
                            "author": "Madteklynd",
                            "score": 12,
                            "created_utc": 1653377251.0,
                            "response": "I think we've all been there my friend. You need to separate Bitcoin from cryptocurrencies. If you want quick hyper growth you need to find a shitcoin and pray to your lucky stars. If you want to be wealthy long term you need to put in your 100+ hours in bitcoin and just stack it. Then don't look at the price at all. As Michael Saylor says your time horizon needs to be at least 4 years.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9wgxtp",
                                    "author": "siouxpersniper",
                                    "score": 1,
                                    "created_utc": 1653456248.0,
                                    "response": "People come here and thinks bitcoin is a magic coin that will make the money in over night.\n\nBut this is not the case you need to find some low cap or the shit coins for that think to happen.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9sczfm",
                            "author": "coffee_for_dinner",
                            "score": 7,
                            "created_utc": 1653383989.0,
                            "response": "That was me a year ago as well when I came here. For the record, I've now held and DCA'd for 13 months and I'm about 20% down still. Not saying your journey will be similar, but if a crystal ball had told me this last year I would've paced myself with the buys a lot more. I think patience is key, and over time you will stop caring about the prices so much and just focus on the size of your BTC stack. In another 12 months my stack will likely be even or in profit which is still more interesting than the interest my bank's saving's account would give for this money.\n\nThis is tongue in cheek but I think of stacking BTC like grinding in an MMO for a special unique currency that will get you an exclusive legendary item eventually that unlocks some quality of life feature on your character (like not having to upgrade your armor ever again). Of course there are no guarantees in how this will play out, but what is life if not a boring grindy ass MMO? They invalidate your hard work every expansion by making your gear obsolete and inflating the in-game gold, tell you it's gonna be awesome next time to keep you playing and giving them your money... We just got bunch of money hungry cunts as a development team for this particular system.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9sgexa",
                                    "author": "Madteklynd",
                                    "score": 4,
                                    "created_utc": 1653387086.0,
                                    "response": "Haha I love your analogies. To your first comment, if you've been doing DCA for 13 months, it doesn't matter if you're doing 20% now or 80%. Bitcoin goes up consistently as the world adopts it, so in years time you won't care what your balance is today. All that matters is how many sats you have.\n\nIn regards to the MMO analogy I think it's very astute. At this point in time as well as the previous 13 years, Bitcoin is more like an insider thing, almost an easter egg based on intelligence and luck. If you managed to find out about it, and you're intelligent enough to truly understand computer science and economics, you would know to buy it.\n\nThese players will then be greatly rewarded before it's in the official patch notes from the devs (think US government endorsing it or something similar), in which all the plebs will buy into it at much higher rates.\n\nIt will unlock quality of life features. The feature will be a life of great quality. You've managed to accumulate wealth in the greatest asset humanity has ever created, and you'll be able to rent it out to other people, and live comfortably at even single digit interest.\n\nAs a true player you also realise that not only are the devs in on it to enrich themselves, but they're actively stealing from the player base through expansionary monetary policy which drives monetary inflation. Everything gets cheaper and faster to produce, but gets more expensive, and your money becomes worth less. The ultimate benefactor here is the devs themselves, since it becomes cheaper and cheaper to pay back it's own loans. The biggest obstacle here is getting the devs to change something which would be bad for themselves. It's obvious to see why no change happens.\n\nLife is one grindy ass MMO. But it's a rewarding one, especially for people that understand it. Get a descent job, start your own business, put away 10-20% of you income and invest it into Bitcoin. Stay strong and HODL.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9su2m7",
                                            "author": "coffee_for_dinner",
                                            "score": 2,
                                            "created_utc": 1653396289.0,
                                            "response": "Haha thank you! I enjoy going down the MMO analogy hole when it comes to our modern life. MMOs offer a sense of belonging, community and a feeling of success or meaning in your \"work\" for many who do not get those things in their real jobs and social relationships. It sometimes does feel like we're all just living in someone else's simulation and discovering bitcoin felt like seeing behind the curtain.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9snnxd",
                    "author": "nullama",
                    "score": 4,
                    "created_utc": 1653392476.0,
                    "response": "3 years, 4 months, and 4 days. That's [the hodl line](https://hodl.camp/).\n\nIt doesn't matter when you bought or how much Bitcoin you bought, if you've hodled at least that amount of time for every time you bought, your Bitcoins now have more purchasing power than the fiat you exchanged it for.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9sefvn",
                    "author": "MichaelAischmann",
                    "score": 2,
                    "created_utc": 1653385320.0,
                    "response": "If you are truly long term, your better friend still remains the bull market.\n\nYou flirt with the bear? Don't be surprised if the bull is never coming back!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9sgja7",
                            "author": "Madteklynd",
                            "score": 2,
                            "created_utc": 1653387186.0,
                            "response": "Fair point, but im bullish enough on the underlying technology of bitcoin to believe it will be adopted by the whole world. If you don't share this sentiment then obviously this message isn't for you.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9t9mks",
                                    "author": "Random_Ad",
                                    "score": 0,
                                    "created_utc": 1653403663.0,
                                    "response": "Believing in the technology that made BTC possible doesn’t means that BTC will be the one to get worldwide adoption. Being first doesn’t mean being the most successful. Often time the first is just a prototype.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9tkgkh",
                                            "author": "Technical_Emu_8567",
                                            "score": 1,
                                            "created_utc": 1653408192.0,
                                            "response": "Generally, yes. \n\nIn this case, however, the first will be the last standing. It's been almost 15 years, multiple cycles, where are the other players at? Not even close. Sooner or later, they'll all follow the footsteps of the feathercoins, ripples, and the terras.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9wjsa6",
                                                    "author": "Karapatian",
                                                    "score": 1,
                                                    "created_utc": 1653458223.0,
                                                    "response": "Don't worry mate they will all follow the same step, sooner or later.\n\nI am just happy that i made myself early from the many people and gonna enjoy that in the future.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9wkrga",
                            "author": "yusupan777",
                            "score": 1,
                            "created_utc": 1653458944.0,
                            "response": "In long term bulls are going to come back again, it's all about timing",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9wrfoy",
                                    "author": "MichaelAischmann",
                                    "score": 1,
                                    "created_utc": 1653464311.0,
                                    "response": "It's about conviction and persistence. I also believe the bulls come back btw. F@ck the bear.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9sbtjv",
                    "author": "Hughski",
                    "score": 1,
                    "created_utc": 1653382910.0,
                    "response": "I hope it goes down to sub-$10k but that may be too low for some people. Would suit me just fine though",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9snl0l",
                            "author": "Marmaluke420",
                            "score": 1,
                            "created_utc": 1653392425.0,
                            "response": "It would take Tesla and micro strategy to sell huge chunks to go to 10k.... That won't happen .. let alone the big banks who all bought around 26k... It hits their buy in price they will double up",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9um7bw",
                                    "author": "Hughski",
                                    "score": 1,
                                    "created_utc": 1653423874.0,
                                    "response": "Ah yes the good old fashioned ‘it hit when I bought in so now I’ll double up with no further analysis’ buy-in strategy. Did you refine this strategy during your time with Goldman or JP Morgan?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9umw8w",
                                            "author": "Marmaluke420",
                                            "score": 2,
                                            "created_utc": 1653424164.0,
                                            "response": "What on Earth are you? Babbling",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9un856",
                                                    "author": "Hughski",
                                                    "score": 1,
                                                    "created_utc": 1653424303.0,
                                                    "response": "Idk but I spent time in Goldman and I don’t recall ever having a strategy of ‘oh it hit the price when we bought in, so let’s double up’. You seem to think this is a current strategy so was wondering where you learnt about it from and could you teach me your secrets lmfao",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9uom67",
                                                            "author": "Marmaluke420",
                                                            "score": 2,
                                                            "created_utc": 1653424889.0,
                                                            "response": "No, you would probably wait for it to bleed around 20-30% from your buy in ..  then start buying up if you believed in the product you were investing in also this is all just a bear market that we will be talking about next year like a thing of the past. So if you aren't planning a strategy to deepen your Position now instead of just selling off... Why are you investing in the product to begin with.. you would have sold at the ATH...",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9upggz",
                                                                    "author": "Hughski",
                                                                    "score": 1,
                                                                    "created_utc": 1653425249.0,
                                                                    "response": "In my view the banks have done exactly what I have done which is hedge their bets - they’ve put a very, very small % into BTC to hedge against it taking off. \n\nIf you’re banking on them doubling up when it goes down to their buy-in value then I’m sorry to say you’ll likely to be mistaken.\n\nThe only reason that banks would be routinely buying in and selling off is to scalp off retail investors. \n\nLiterally nobody with any say at a bulge bracket bank said ‘I think BitCoin is really valuable let’s invest’. Nobody says that and nobody in any investment circles think that - they just want to ride the waves and scalp off retail scum",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9uqcmd",
                                                                            "author": "Marmaluke420",
                                                                            "score": 2,
                                                                            "created_utc": 1653425627.0,
                                                                            "response": "Old thinking is becoming outdated everyday and at a very alarming rate.. If you don't think they aren't gonna buy a dip I get that but I believe banks, and large corps will continue to add BTC to their ledgers when the time is right,\n\n BTC mining operations will continue to grow again filling in the need for 550 million daily to sustain the ATH. This is currently a much more manageable level. Holders will grow, ledgers will grow, adoption will grow, and the mining operations will grow. This is crypto..not stocks...",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i9use1y",
                                                                                    "author": "Hughski",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653426498.0,
                                                                                    "response": "No doubt they will add BTC to their ledgers over time if it proves to be resilient. But don’t think that banks will ‘double up’ during bear markets as that’s simply foolish. \n\nMuch of BTC’s strengths are being capsized by institutions and large investors such as myself hedging. People here are like it’s gonna be a ‘great equaliser’ but banks are already owning more and more of it with just tiny % of their investments.\n\nHell, I own a couple of coins myself and think that a lot of what I read on this sub is total bs. In the unlikely event, BTC becomes all it’s claimed to be, it won’t liberate the poor because people like me and banks will own most of it lol \n\nI get that’s it’s kind of a no-win situation but basically wealthy people are hedged - you can’t win anymore. Like, I own more BTC coinage than most people on this sub but idc about it and it’s purely a hedge. Same for the banks unless they want to manipulate the market. \n\nIt’s really no big deal if it goes up or down anymore - we’re hedged and priced in lol",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                },
                                                                                {
                                                                                    "id": "i9v3tq2",
                                                                                    "author": "Hughski",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653431528.0,
                                                                                    "response": "I asked the question but I guess you can’t answer it so I will ask the question to the whole sub: How can BitCoin be for everyone when the majority of it is concentrated in the hands of the wealthy already. I hope you Moonboys are right - that’s why I bought my 3 BTC lmfao",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i9wh6n1",
                                                                                            "author": "driscollpoly",
                                                                                            "score": 3,
                                                                                            "created_utc": 1653456413.0,
                                                                                            "response": "This is not a good sign when someone hold the majority of a single thing.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "i9woh58",
                                                            "author": "vorksholk1",
                                                            "score": 1,
                                                            "created_utc": 1653461834.0,
                                                            "response": "I never heard that kind of the strategy in the first place ever.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9wlzmw",
                                            "author": "cerphyda",
                                            "score": 1,
                                            "created_utc": 1653459878.0,
                                            "response": "I am trying to save my cash for that kind of the big dip.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9wsuew",
                            "author": "jioniukas",
                            "score": 1,
                            "created_utc": 1653465574.0,
                            "response": "Any low price for me is good for bitcoin, as it will gives me the chances to achieve my target for the bitcoin.\n\nBut yes the FUD at that time in the market will be so unreal, and i don't know how many will survive that.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9so9qw",
                    "author": "Axumata",
                    "score": 1,
                    "created_utc": 1653392862.0,
                    "response": "The problem is that there’s war raging around, and it may make me tap into my coins in the future. Which isn’t a good idea in a bear market.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9wmtrq",
                            "author": "tranhao699",
                            "score": 1,
                            "created_utc": 1653460524.0,
                            "response": "I think we need to stay in the bear market for the long time.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9se1tg",
                    "author": "Belmont_the_IV",
                    "score": -4,
                    "created_utc": 1653384966.0,
                    "response": "Yea, my plan isn't decades...",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9sghc3",
                            "author": "Madteklynd",
                            "score": 3,
                            "created_utc": 1653387141.0,
                            "response": "Then you're in the wrong game my friend. Generational wealth takes time to build up.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9sjc6l",
                                    "author": "kellnoidiii",
                                    "score": 6,
                                    "created_utc": 1653389440.0,
                                    "response": "The guy with IV in his name isn't into generational thinking. He wants it now!! Haha.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9slp7c",
                                    "author": "Belmont_the_IV",
                                    "score": 0,
                                    "created_utc": 1653391160.0,
                                    "response": "That's why I also invest in the whole stock market. That's the long game. It has the historical reference.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9szolk",
                                            "author": "supersb360",
                                            "score": -1,
                                            "created_utc": 1653399160.0,
                                            "response": "How’s that working out for you?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9t9clm",
                                                    "author": "Belmont_the_IV",
                                                    "score": 1,
                                                    "created_utc": 1653403544.0,
                                                    "response": "Where are you going with this???  Because over the last 30 years I'm up  significantly. So I'd say it's working out fine. \n\nHow's your 30 years reference on BTC look?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9tel1d",
                                                            "author": "JeremyLinForever",
                                                            "score": 3,
                                                            "created_utc": 1653405753.0,
                                                            "response": "The problem is that the stock market is only as strong as the dollar. If the dollar devalues, it doesn’t matter how significantly “up” you are. Given that although the dollar is the strongest compared to other countries, it’s still massively weak when it comes to real commodities like real estate, oil, Bitcoin, gold, silver, nickel, fertilizer, wheat, farmland, crops, you name it.\n\nOnce you figure this out, then you’ll understand that wealth is not measured in dollars. It’s measured by how long you can live without having to work, or how you can survive without reliance on any counter-party (including the government).",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9tf5dn",
                                                                    "author": "Belmont_the_IV",
                                                                    "score": 1,
                                                                    "created_utc": 1653405989.0,
                                                                    "response": "Which is exactly why I buy BTC...but everyone should still hedge.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9wkb20",
                                    "author": "didichello07",
                                    "score": 1,
                                    "created_utc": 1653458608.0,
                                    "response": "True, bitcoin is not like a shit coin that will make the money over night.\n\nIt's a very stable coin in terms of the crypto market and will show growth with the time.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9tevtv",
                            "author": "JeremyLinForever",
                            "score": 1,
                            "created_utc": 1653405877.0,
                            "response": "To this point, if your plan isn’t decades and you’ve already been significantly up in the stock market over the past 30 years and you have some spare money to throw around trying to hit a home run, maybe try some other altcoins like UST promising 15% APY? 🤷‍♂️/s",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9wrt3b",
                                    "author": "aaronwebberbc",
                                    "score": 1,
                                    "created_utc": 1653464643.0,
                                    "response": "It's not about the decades you will make the money in the halving cycle to halving cycle that means after 3-4 years.\n\nBut you will not get something called life changing money in that small period time.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9sxev1",
                    "author": "AvisPhlox",
                    "score": 1,
                    "created_utc": 1653398044.0,
                    "response": "I may be new to crypto but I've been hodling stonks for a few years. I understand watching those green numbers makes one _feel_ like they're gaining wealth, but I've always seen it as a time when I'm not buying. Stonks may be the only thing I might treat as the cookie jar, maybe also the precious metals I have, but with BTC I've already decided to stack till I can't stacks no more. I just hope I'm not wrong, and I hope I don't lose my keys.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9we4ku",
                            "author": "mrYT3OwlZQacHHF",
                            "score": 1,
                            "created_utc": 1653454410.0,
                            "response": "Watching profit is the most important thing in crypto, which is not available now",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9t1dt7",
                    "author": "bri8985",
                    "score": 1,
                    "created_utc": 1653399979.0,
                    "response": "Only if you keep your income at the same level during a bear market…",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9t2o46",
                    "author": "LoneWolfSpartan",
                    "score": 1,
                    "created_utc": 1653400585.0,
                    "response": "Damn you can't sleep either. Being broke suvks",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9wcr8h",
                            "author": "chungenhung",
                            "score": 1,
                            "created_utc": 1653453558.0,
                            "response": "No one can sleep in bear market, we all are watching charts",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9tbdlg",
                    "author": "1561KWP",
                    "score": 1,
                    "created_utc": 1653404408.0,
                    "response": "concur!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9u09ut",
                    "author": "Impressive-Handle-69",
                    "score": 1,
                    "created_utc": 1653414663.0,
                    "response": "BTC and STX are the only things I DCA now.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9uxix2",
                            "author": "14bVuKAdhBfHHE86",
                            "score": 1,
                            "created_utc": 1653428743.0,
                            "response": "That's great, if you have BTC in portfolio with 60% share it's good",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9u6n7f",
                    "author": "thebradybox",
                    "score": 1,
                    "created_utc": 1653417322.0,
                    "response": "You'll soon realized most people aren't here for the long term they'll say they are they'll say they truly believe it they'll say this is the way. But their profit whores at the end of the day. The day I realized that was the day I stopped caring what people said.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9wqyv4",
                            "author": "viratuso",
                            "score": 1,
                            "created_utc": 1653463904.0,
                            "response": "They know that long term is not for them because they don't have patience",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9u8zo0",
                    "author": "darkmage1001",
                    "score": 1,
                    "created_utc": 1653418312.0,
                    "response": "If we get regulation before the end of the bear market this rally will go to the moon. If not we might dip like this one more time.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9voxs3",
                            "author": "ristobus58",
                            "score": 1,
                            "created_utc": 1653441504.0,
                            "response": "We need some positive news in market then only we can see pump",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9uhde2",
                    "author": "VPNApe",
                    "score": 1,
                    "created_utc": 1653421837.0,
                    "response": "I don't mind the bear market, I just wish it would hurry up and crash. Gimme $15k Bitcoin already",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9wmr4q",
                            "author": "RightRecycle83",
                            "score": 1,
                            "created_utc": 1653460468.0,
                            "response": "That is a sign of a guy, who did his study well here before investing in the market.\n\nOnce you did that then bear market will feels like an opportunity to you make for make a good profit.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9uryxw",
                    "author": "pierreman",
                    "score": 1,
                    "created_utc": 1653426317.0,
                    "response": "Depends on how long you intend to live or cash in. It's all relative. You are right if you're a teenager.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ut3s0",
                    "author": "pierreman",
                    "score": 1,
                    "created_utc": 1653426810.0,
                    "response": "The momentum is tied to the NASDAQ. The more ETFs come the more we trade like the market. Miss the old days.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9vlp8a",
                    "author": "sdfgvwrz",
                    "score": 1,
                    "created_utc": 1653439968.0,
                    "response": "Bear market can give stress to traders but still we should only watch for market pump",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9vrabj",
                    "author": "Ok-Cauliflower-5335",
                    "score": 1,
                    "created_utc": 1653442616.0,
                    "response": "how about BTC situation these days? Should I long it now?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9w8q4o",
                    "author": "Any-Nefariousness773",
                    "score": 1,
                    "created_utc": 1653451209.0,
                    "response": "I'm feeling fomo about the future dips",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}