{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "utrezm",
            "title": "Wallets for beginners",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/utrezm/wallets_for_beginners/",
            "author": "ScrewTheBanker",
            "created_utc": 1653043598.0,
            "score": 34,
            "num_comments": 49,
            "subreddit": "BitcoinBeginners",
            "selftext": "1 year into my BTC journey and I'm starting to think about self custody. But I'm terrified of trying to take my holdings off the exchanges. \nI like the idea of a hard wallet but which ones are bomb proof and idiot proof? I need simplicity and something that has a history of lasting forever.\nI understand that I should keep my seed phrase in multiple places separate from my wallet and I like the idea of a stamped metal card incase of fire or water damage. I also understand I should buy direct from the company producing the wallet.\nI think I just need some advice and reassurance.\nAlso what sort of charge/fee will I incur from the exchanges for transferring off the exchange? Coinbase & CryptoCom\nShould I leave my other cryptos on the exchange and just worry about self custody of my btc?",
            "stickied": false,
            "comments": [
                {
                    "id": "i9bnttu",
                    "author": "BTCMachineElf",
                    "score": 12,
                    "created_utc": 1653051587.0,
                    "response": "Trezor is a solid choice. I recommend avoiding Ledger. They're cheaply made and the led is small and hard to read.\n\nStart by sending a small amount to the wallet. Wipe and restore the wallet using the seed and you will gain a lot of confidence in the setup.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9cv7wi",
                            "author": "peeledbananna",
                            "score": 2,
                            "created_utc": 1653069332.0,
                            "response": "Ledger has made the font easier to read now even with my bad eyesight.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9basqm",
                    "author": "Desperate-Barnacle-4",
                    "score": 6,
                    "created_utc": 1653044574.0,
                    "response": "Read the pinned beginner FAQ it may address some of your fears.\n\nYou can't really go wrong with a ledger nano s or trezor one. I believe both manufacturers sell a bundle/option for steel seed backup. And they both provide an easy to use app to interface with the hardware wallet.\n\nBitbox02 hardware wallet is a more premium option and they also offer an intro' call to setup the wallet. And they have backup options like steel and tamper evident bags etc. They have focused on making the user experience very smooth. It is worth a look. [https://shiftcrypto.shop/en/#products](https://shiftcrypto.shop/en/#products) (I have a Bitbox02 bitcoin only.)\n\nExchanges may charge like 0.0005 Bitcoin to withdraw to your own wallet. Nothing to worry about.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9bpznq",
                    "author": "GibbsSamplePlatter",
                    "score": 5,
                    "created_utc": 1653052578.0,
                    "response": "If you don't have an insane amount it's also ok to just use a reputable wallet on your phone for example. I use Green for that.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9brky5",
                            "author": "DigitallyInclined",
                            "score": 5,
                            "created_utc": 1653053285.0,
                            "response": "Same here. Blockstream Green Wallet on my iPhone is perfect for me.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9bwuf3",
                                    "author": "GibbsSamplePlatter",
                                    "score": 3,
                                    "created_utc": 1653055549.0,
                                    "response": "Disclaimer I used to be a dev for the wallet but I'm also a customer since 2014. No problems in a number of years now.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9c8txp",
                                    "author": "Rolledupsockguy",
                                    "score": 2,
                                    "created_utc": 1653060388.0,
                                    "response": ">. Blockstream Green Wallet\n\nThanks. I'll read more about this, as I would like an option to keep on my phone if ever needed. I have coinbase wallet, but only used it once to try it out",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9cf6bu",
                    "author": "Apebot",
                    "score": 3,
                    "created_utc": 1653062890.0,
                    "response": "At first try with a small amount to get comfortable. \n\nPeople will correct me if I'm wrong, but a mobile phone wallet is surprisingly safe. Use a well-established one though, like Exodus perhaps.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9b9j7h",
                    "author": "509BandwidthLimit",
                    "score": 9,
                    "created_utc": 1653043790.0,
                    "response": "Not shilling for Ledger, but it is easy. Check out The Crypto Dad on YT, he shows you exactly how to setup and use with different exchanges.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9c512m",
                            "author": "CSDude01",
                            "score": 3,
                            "created_utc": 1653058869.0,
                            "response": "Yeah I like my Ledger too. The only issue is that their support is basically non existant and they have regular cases of broken devices being delivered (for example the battery issues or just not working at all). Otherwise I like their product a lot.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9c4ffw",
                    "author": "Unclestanky",
                    "score": 3,
                    "created_utc": 1653058627.0,
                    "response": "Trezor guy here. If you’re nervous, send a few hundred Sats first, then pull them off, you’ll feel better about transferring the rest once you know it works. Self custody is the way to go for hundreds of reasons I won’t get into here, but you’ll enjoy it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9cniv1",
                    "author": "franh9",
                    "score": 3,
                    "created_utc": 1653066163.0,
                    "response": "Hey Noob Question, but would happen if X wallet would go under like stop receveing support or something, how would i access to my bitcoin?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9de2pj",
                            "author": "kilingangel",
                            "score": 3,
                            "created_utc": 1653077972.0,
                            "response": "The misconception is your wallet holds your btc but it’s not. Your wallet acts as a key to open the safe to your btc in the blockchain. As long as you have your seed phrase and passphrase (If you created one during setup), then you can recover your funds with no issues.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9hho1o",
                                    "author": "franh9",
                                    "score": 1,
                                    "created_utc": 1653163007.0,
                                    "response": "ohh so if X wallet goes under i could use Y wallet ?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9j67zk",
                                            "author": "TalesFromTheCryptoz",
                                            "score": 2,
                                            "created_utc": 1653196516.0,
                                            "response": "Yes, as long as you have safely saved your recovery seed (and passphrase, if applicable) somewhere else. It could get a bit more complex depending on how you setup your wallet. Check out https://walletsrecovery.org/",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9d34ba",
                    "author": "Ok_Philosopher_3497",
                    "score": 3,
                    "created_utc": 1653072989.0,
                    "response": "This sounds like me hehehe....",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9bvska",
                    "author": "bitusher",
                    "score": 6,
                    "created_utc": 1653055105.0,
                    "response": "You should focus on open source non custodial wallets. Once you have over 1k usd of bitcoin you should seriously consider getting a hardware wallet . Do not using wallets in windows or osx without a hardware wallet. If you can't afford a hardware wallet use a wallet in ios or android. \n\nsome wallets \n\nhttps://walletscrutiny.com\n\nhttps://docs.google.com/spreadsheets/d/1aZ1zbaUEzCo9NCctN8-eL2VLIiSdY009tTJvRXDUWEw/edit#gid=0\n\nhttps://www.reddit.com/r/BitcoinBeginners/comments/g42ijd/faq_for_beginners/",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9b99y9",
                    "author": "AutoModerator",
                    "score": 2,
                    "created_utc": 1653043599.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9cdfex",
                    "author": "ScrewTheBanker",
                    "score": 2,
                    "created_utc": 1653062203.0,
                    "response": "Thankyou. I'm sure its been asked a thousand times and these answers were probably just a search box away but in all honesty I'm less confident with navigating reddit than I am a crypto wallet 😅",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9d9eav",
                    "author": "ActionParticular7697",
                    "score": 2,
                    "created_utc": 1653075874.0,
                    "response": "Hardware wallets don't store the crypto inside, they just store the keys. There's not enough memory to store actual Bitcoin inside a hardware wallet.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9dq23a",
                            "author": "ScrewTheBanker",
                            "score": 1,
                            "created_utc": 1653083471.0,
                            "response": "No I understand that it cannot be taken off the blockchain. We only hold the access to it.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9dds9x",
                    "author": "kilingangel",
                    "score": 2,
                    "created_utc": 1653077839.0,
                    "response": "I’m using this, I like the idea of air gapped operation so my device is never connected to the internet. \n\nhttps://coldcard.com/",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9iz32o",
                            "author": "Superuzer",
                            "score": 1,
                            "created_utc": 1653191587.0,
                            "response": "Coldcard seems mad complicated.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9d76k0",
                    "author": "jenn400",
                    "score": 1,
                    "created_utc": 1653074888.0,
                    "response": "Safepal is great too. Import your whole wallet 👌🏽",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9e2y14",
                    "author": "upfaii",
                    "score": 1,
                    "created_utc": 1653089796.0,
                    "response": "I was nervous about this as well. Wife got me a ledger nano s for Christmas and I procrastinated setting it up for a few weeks..but once I realized how user-friendly it was my worries went away. There is a desktop and mobile app that walk you through the setup and I would definitely recommend it. Super simple. Send a test transaction first!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9eid10",
                    "author": "ApricotAcrobatic7761",
                    "score": 1,
                    "created_utc": 1653097926.0,
                    "response": "Guarda wallet is a good choice for beginners and experts imho. Available on all platforms and you simply need to keep your password, private keys and backup file away from scammers and never share them with ANYONE and you'll be fine. You can buy and exchange BTC and/or other assets, stake, get crypto loans in stablecoins using your crypto as collateral and more. Have a look at their website and check their Academy for tutorials and articles. \n\nhttps://guarda.com/buy-bitcoin/\n\nhttps://guarda.com/academy/",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9en96v",
                    "author": "McCOY_123",
                    "score": 1,
                    "created_utc": 1653100541.0,
                    "response": "I’m in a similar nervous state of mind. I’ve been exploring Electrum hot wallet over the past month has it has been super helpful to better understand the concepts of a wallet, BIP39, BIP32, derivation path, seed phrase, private keys, addresses, etc. Would recommend starting with very small amounts until you get comfortable. From there, the next step would be to go cold wallet. Electrum interfaces with most hard wallets.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9fa1wx",
                    "author": "Madteklynd",
                    "score": 1,
                    "created_utc": 1653115608.0,
                    "response": "I was in the same boat recently, I decided on Casa and perhaps in the future unchained capital. The offer multi sig setup with 1 hardware 1 phone and 1 they store. It's really genius easy and foolproof",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9fks38",
                    "author": "bdjilka",
                    "score": 1,
                    "created_utc": 1653125313.0,
                    "response": " Best choice for storing your crypto safely – cold wallet like Trezor or Ledger.\n\nBut if you use crypto everyday I would recommend simplehold wallet. It’s easy to use, convenient and simple for beginners.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9jt64k",
                    "author": "InternalCheetah2672",
                    "score": 1,
                    "created_utc": 1653216520.0,
                    "response": "When it comes to physical attacks, Ledger is safer since its devices use double chip bases. The second chip in Ledger is the Secure Element (SE). However, Trezor does not have a Secure Element since its devices are built with a single chip base. Ledger has an open-source framework",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9jt9s7",
                    "author": "BusyAdhesiveness6342",
                    "score": 1,
                    "created_utc": 1653216604.0,
                    "response": "SafePal is among the best crypto wallets for both newbie and professional investors and traders, including crypto enthusiasts. It is reasonably priced and an excellent option for investors looking for an affordable and safe storage option",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}