{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uxf0gx",
            "title": "Bear Market Trading Strategy: 5 Tips to Survive Bear Market",
            "url": "https://tradermake.money/blog/bear-market-trading-strategy/",
            "author": "Lera_tradermakemoney",
            "created_utc": 1653477182.0,
            "score": 1,
            "num_comments": 1,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9x6st6",
                    "author": "castorfromtheva",
                    "score": 1,
                    "created_utc": 1653477320.0,
                    "response": "Let's optimize and reduce it to just one:\n\n*Hodl.*  \n\n\nAnd to all of those nocoiners:\n\n*Start accumulating, goddamnit.*",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uxez1j",
            "title": "Bitcoin gets recognition as a mode of payment in Russia by a city court",
            "url": "https://news.todayq.com/news/bitcoin-gets-recognition-as-a-mode-of-payment-in-russia-by-a-city-court/",
            "author": "rollingincrypto",
            "created_utc": 1653477024.0,
            "score": 4,
            "num_comments": 1,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9xcrdw",
                    "author": "coinfeeds-bot",
                    "score": 1,
                    "created_utc": 1653480960.0,
                    "response": "tldr; The St Petersburg City Court has recognized cryptocurrency as a means of payment in a case where two Russian citizens extorted over $1 million in digital assets and $90,000 in cash from a man. Pyotr Piron and Yevgeny Prigozhin threatened the victim by claiming he could face legal problems ahead if he didn't pay up. This comes after a district court allowed enforcement officers to seize stolen cryptocurrency in another criminal case.\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR.*",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uxeujd",
            "title": "Bitcoin needs to increase transaction throughput",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uxeujd/bitcoin_needs_to_increase_transaction_throughput/",
            "author": "snorketre",
            "created_utc": 1653476534.0,
            "score": 0,
            "num_comments": 81,
            "subreddit": "Bitcoin",
            "selftext": "Bitcoin needs to increase transaction throughput to stay relevant and to stay the dominant crypto currency for the future, and for today.This needs to happen either on the main net, or on a secondary layer that does not require you to lock your coins. Your coins have to be able to be spent freely whenever you want, Cheaply, and fast. Without compromising on safety.Is this possible?Should we increase the block size to do it on the main net? What block size would we need for bitcoin to run with a average transaction cost under 1 cent. I think 1 cent is a good transaction roof if you want to be able to use bitcoin for everything and anything. How much could we raise the block size without compromising safety or peoples ability to run their own full node?\n\nOr what could be done (maybe with a second layer) to be able to spend your coins freely, fast and cheaply without locking them up in for example a lightening network channel?\n\nFull disclaimer, i know about the block war, i know about the lightening network. This post is made because people are not using bitcoin, and i want to find the problem that causes it, and i want to find the solution to solve it. I think i know some of the problems, but i want to find the solutions, and maybe more of the problems (if there are any more).  \nAllso, this is not a big block post.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9x6if1",
                    "author": "castorfromtheva",
                    "score": 21,
                    "created_utc": 1653477123.0,
                    "response": "*I'm new to bitcoin and I'm here to fix it.*",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9x6znh",
                            "author": "snorketre",
                            "score": -9,
                            "created_utc": 1653477448.0,
                            "response": "I have been into bitcoin since 2016, but yeah, i want to make it better",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9x75n1",
                                    "author": "castorfromtheva",
                                    "score": 9,
                                    "created_utc": 1653477558.0,
                                    "response": "Damn. That's f%ckn long time to not get it.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9x7ksy",
                                            "author": "snorketre",
                                            "score": -2,
                                            "created_utc": 1653477830.0,
                                            "response": "Haha ok, what did i not get?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9x86e7",
                                                    "author": "castorfromtheva",
                                                    "score": 7,
                                                    "created_utc": 1653478223.0,
                                                    "response": "One of bitcoin's main sources of strength lies in the slowness and steadiness of layer one.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9x8e47",
                                                            "author": "snorketre",
                                                            "score": -2,
                                                            "created_utc": 1653478363.0,
                                                            "response": "You dont want a slow layer one, but yeah, you want a steady one. That is why im saying \"without compromising on safety\"",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9x94hw",
                                                                    "author": "castorfromtheva",
                                                                    "score": 2,
                                                                    "created_utc": 1653478821.0,
                                                                    "response": "> That is why im saying \"without compromising on safety\"\n\nRight. I forgot you're here to fix it. /s",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9x9gf0",
                                                                            "author": "snorketre",
                                                                            "score": -1,
                                                                            "created_utc": 1653479022.0,
                                                                            "response": "Is there anything wrong in that?",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i9xbkn3",
                                                                                    "author": "castorfromtheva",
                                                                                    "score": 5,
                                                                                    "created_utc": 1653480280.0,
                                                                                    "response": "Nothing, really. Quite likely you're the first one thinking it this way.",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9x5pv5",
                    "author": "DAGCRO",
                    "score": 12,
                    "created_utc": 1653476574.0,
                    "response": "Nope, no changes necessary. Let Bitcoin be.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9x6neb",
                    "author": "dat9553",
                    "score": 9,
                    "created_utc": 1653477218.0,
                    "response": "we get it, you're new to BTC",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9x66a5",
                    "author": "guryfitze",
                    "score": 18,
                    "created_utc": 1653476894.0,
                    "response": "Lightning network",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9x68di",
                            "author": "snorketre",
                            "score": -3,
                            "created_utc": 1653476934.0,
                            "response": "But there your coins are locked in place, right?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9x8f94",
                                    "author": "nullama",
                                    "score": 3,
                                    "created_utc": 1653478383.0,
                                    "response": "You can transfer them back on-chain.\n\nCheck out [Muun](https://muun.com), you can receive lightning, then send on-chain for example.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9x8q6e",
                                            "author": "snorketre",
                                            "score": 1,
                                            "created_utc": 1653478571.0,
                                            "response": "This seems interesing, il research the topic.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9yf6vf",
                                                    "author": "Keith_Kong",
                                                    "score": 1,
                                                    "created_utc": 1653497581.0,
                                                    "response": "Yeah you are most likely referring to running a merchant node which, if you want to run your own, requires adding some liquidity to your node in order to receive sats.\n\nThis is not a huge issue except that it makes the process a bit complex to understand. That said, companies are working on ways to automate setting all of this up.\n\nBut using lightning as a consumer, either custodial or self-custodial, is fairly straight forward. I personally think custody solutions will be most widely used but will be treated more like a physical wallet where you put very small amounts into it at any given time. Getting hacked becomes the same as losing your wallet, sucks but no big deal.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9x72kx",
                                    "author": "Otowner98",
                                    "score": 2,
                                    "created_utc": 1653477503.0,
                                    "response": "I think you are refering to what happens - in part - if you set up a lightning node.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9x7eks",
                                            "author": "snorketre",
                                            "score": 1,
                                            "created_utc": 1653477716.0,
                                            "response": "Dont you lock you coins in place when you open a channel?",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9x7m0u",
                                    "author": "cooltexture",
                                    "score": 2,
                                    "created_utc": 1653477852.0,
                                    "response": "depends on what you consider locked, you need one on-chain transaction to get them into a channel and one on-chain transaction to get them out.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9x7qan",
                                            "author": "snorketre",
                                            "score": 1,
                                            "created_utc": 1653477929.0,
                                            "response": "Yeah, and when they are in the channel you cant use them on the main net without closing the channel right?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9xgj3b",
                                                    "author": "cooltexture",
                                                    "score": 2,
                                                    "created_utc": 1653482989.0,
                                                    "response": "There is the possibility of using submarine swaps. which provide a way of paying lightning invoices with on-chain funds and the other way around. These are pretty new and also complicated, which means that we need wallet software which abstracts this complexity away so regular users dont have to worry about it. Someone here already mentioned Muun, which i havent researched but i think it utilizes submarine swaps in some way. \n\nSo for your original Post, i think the technology to make Bitcoin usable already exitsts, we dont need to increase throuput. We need more software to utilize the Technology and spread awareness on this.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i9xbdri",
                                                    "author": "orbag",
                                                    "score": 1,
                                                    "created_utc": 1653480171.0,
                                                    "response": "If you could, you would be able to double spend on main net and lightning network.\n\nAnd what are you complaining about? Right now, you can send transactions for around 10 cents",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9xcp79",
                                                            "author": "snorketre",
                                                            "score": 1,
                                                            "created_utc": 1653480925.0,
                                                            "response": "Are you talking about on the lightening network? If so then great. But why is it that people are not using bitcoin then? My guess is the fact you have to tie up your money. (when talking about the lightening network)",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9xinxp",
                                                                    "author": "dat9553",
                                                                    "score": 2,
                                                                    "created_utc": 1653484057.0,
                                                                    "response": "actually, with Lightning Network, transfer fee can be as low as 1 satoshi\\~$0.0002911",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9xnono",
                                                                            "author": "snorketre",
                                                                            "score": 1,
                                                                            "created_utc": 1653486421.0,
                                                                            "response": "But atm they are around 4 cents? Atleast that is what i have found trying to google it.  \n4 cents is pretty good, but could be better.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i9xp6om",
                                                                                    "author": "dat9553",
                                                                                    "score": 2,
                                                                                    "created_utc": 1653487100.0,
                                                                                    "response": "you're saying about mainnet fee? [This is my transfer the other day.](https://imgur.com/a/FSxU7Vv) As you can see, zero fee.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i9xplbg",
                                                                                            "author": "snorketre",
                                                                                            "score": 1,
                                                                                            "created_utc": 1653487280.0,
                                                                                            "response": "Ooo nice. But is that a private channel or a channel with a company with many channels where you can pay the whole world?",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i9y5r86",
                                                    "author": "hans7070",
                                                    "score": 1,
                                                    "created_utc": 1653493908.0,
                                                    "response": "Right, but with \"splicing\" you can send funds on the main net, without closing the channel or disrupting it. It's not widely used yet, but coming soon in a big way.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i9x88zc",
                                                    "author": "snorketre",
                                                    "score": 0,
                                                    "created_utc": 1653478270.0,
                                                    "response": "Im thinking there must be a reason why not everyone is using bitcoin yet, and im thinking the reason is high transaction cost on mainnet, and confusing or limiting factors in the secondary layer (lightening network)",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9x8k75",
                                                            "author": "Aggravated-Bread489",
                                                            "score": 2,
                                                            "created_utc": 1653478469.0,
                                                            "response": "This has already been decided. You should google the block size wars.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9x92o1",
                                                                    "author": "snorketre",
                                                                    "score": 1,
                                                                    "created_utc": 1653478790.0,
                                                                    "response": "I know there was a war, but there must be a way to make bitcoin more usable. Im thinking maybe (MAYBE) they where wrong in their decision. Im mean, why did Satoshi write about block sizing if he did not want it implemented?",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                },
                                                                {
                                                                    "id": "i9x97gn",
                                                                    "author": "snorketre",
                                                                    "score": 0,
                                                                    "created_utc": 1653478870.0,
                                                                    "response": "Im not thinking big blocks are the answer, but im thinking there must be a way to make bitcoin mainnet usable. Or if not then a way to make a secondary layer that people actually use.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "i9yfwsa",
                                                            "author": "igadjeed",
                                                            "score": 2,
                                                            "created_utc": 1653497859.0,
                                                            "response": "> high transaction cost on mainnet\n\nYou big blockers always make this claim. Bitcoin transactions fees are low. You've exposed that you never make Bitcoin transactions. When you do, see that the fee is low. Meanwhile, stop spouting lies",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9yssmf",
                                                                    "author": "snorketre",
                                                                    "score": 1,
                                                                    "created_utc": 1653502892.0,
                                                                    "response": "Bru i keep my bitcoin stored, because when i see the fees (i google the average fees) they are too damn high ( ATM 2 usd). How can you claim that transaction fees ar low when the site: [https://ycharts.com/indicators/bitcoin\\_average\\_transaction\\_fee](https://ycharts.com/indicators/bitcoin_average_transaction_fee)  \nsays 2 dollars?  And no, i am not a big blocker, i am open to all ideas, allso lightening or other layer 2 networks.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9ysutu",
                                                                            "author": "snorketre",
                                                                            "score": 1,
                                                                            "created_utc": 1653502916.0,
                                                                            "response": "Am i missing something, is the ycharts site not providing the right information?",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        },
                                                                        {
                                                                            "id": "i9yu16s",
                                                                            "author": "igadjeed",
                                                                            "score": 1,
                                                                            "created_utc": 1653503375.0,
                                                                            "response": "> i google the average fees\n\nTypical big blocker, making up \"i google\" lies  \nSend Bitcoin, pay very low fee. You can not. You have no Bitcoin. You have never had Bitcoin. Nothing more than a troll",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9xerpr",
                                            "author": "snorketre",
                                            "score": 1,
                                            "created_utc": 1653482067.0,
                                            "response": "When i say locked, i mean you cant use them on the main net.\n\nIs the future off chain only? I could see a future where we didn't touch the main net, but i guess that is already here for some people?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9xj4ve",
                                                    "author": "dat9553",
                                                    "score": 3,
                                                    "created_utc": 1653484288.0,
                                                    "response": "lightning network is not off-chain, it's on top of BTC network. Yes, you need to lock up your BTC in a LN channel, but you can unlock it whenever you want",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9yvhmy",
                                                            "author": "snorketre",
                                                            "score": 1,
                                                            "created_utc": 1653503943.0,
                                                            "response": "Yeah sorry, i didn't mean off chain, i mean on second layer.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i9xf3p4",
                                                    "author": "snorketre",
                                                    "score": 1,
                                                    "created_utc": 1653482247.0,
                                                    "response": "But if so, then what would be the consequences of not touching the main net?",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i9yabq2",
                                                    "author": "hans7070",
                                                    "score": 1,
                                                    "created_utc": 1653495696.0,
                                                    "response": "Very big payments will be cheaper on chain. On lightning you pay a percentage.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9ytofl",
                                                            "author": "snorketre",
                                                            "score": 1,
                                                            "created_utc": 1653503234.0,
                                                            "response": "Ok, thank you for the information.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9xlqqz",
                            "author": "Euphoric-Surprise293",
                            "score": -2,
                            "created_utc": 1653485523.0,
                            "response": "Lightning is not Bitcoin. It is controlled by A crazy ass MF called Jack Mallers. We can’t depend on this man.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9xnhxy",
                                    "author": "guryfitze",
                                    "score": 4,
                                    "created_utc": 1653486337.0,
                                    "response": "Mallers is level 3, built on top of lightning. Anyone can build a service on top of lightning.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9xore3",
                                    "author": "horsecyack",
                                    "score": 3,
                                    "created_utc": 1653486907.0,
                                    "response": "You are wrong",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9xyodp",
                                    "author": "DudeIncogneto",
                                    "score": 2,
                                    "created_utc": 1653491079.0,
                                    "response": "This is a pretty stupid statement",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9xtbym",
                    "author": "Sealobo",
                    "score": 3,
                    "created_utc": 1653488883.0,
                    "response": "lol.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9xysuq",
                    "author": "Possible-Ad-7058",
                    "score": 3,
                    "created_utc": 1653491130.0,
                    "response": "Shit post.Nothing to see here",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9x8mzn",
                    "author": "snorketre",
                    "score": 2,
                    "created_utc": 1653478517.0,
                    "response": "What is up with the downvotes, are we not allowed to discuss ideas here?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9x8xj5",
                            "author": "dat9553",
                            "score": 6,
                            "created_utc": 1653478701.0,
                            "response": "people just get annoyed because you didn't do your research enough to know about Lightning Network, and the history of Block size War, the birth of Bitcoin Cash",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9x9o1n",
                                    "author": "snorketre",
                                    "score": 0,
                                    "created_utc": 1653479151.0,
                                    "response": "I know about Lightening network, the block size war and bitcoin cash. Im just wondering why people are not using bitcoin day to day yet. My guess is that on chain transaction cost is too high, and lightening network binds your coins so you cant withdraw them if you need to.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9xyqr4",
                                            "author": "Grdosjek",
                                            "score": 3,
                                            "created_utc": 1653491107.0,
                                            "response": "You maybe know block war exist, but you clearly do not understand why we choose to stay as we did, nor do you understand what negative impact would large blocks have, which is disappointing for someone that is in Bitcoin as long as you say you are.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i9ykm6k",
                                            "author": "Puzzled_Bread_6412",
                                            "score": 1,
                                            "created_utc": 1653499683.0,
                                            "response": "I’m not using it day to day because of taxes.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9x9tdo",
                                    "author": "snorketre",
                                    "score": 0,
                                    "created_utc": 1653479240.0,
                                    "response": "And i was thinking maybe their reasoning for not going with bigger blocks was not the best.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9xbfwt",
                                            "author": "snorketre",
                                            "score": 1,
                                            "created_utc": 1653480206.0,
                                            "response": "But i know using bigger blocks forever might not be a feasible solution.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9xbqz3",
                                                    "author": "dat9553",
                                                    "score": 4,
                                                    "created_utc": 1653480379.0,
                                                    "response": "they did give bigger block size a chance, but BCH and BSV cannot beat BTC. The market had decided the winner",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9xd7lc",
                                                            "author": "snorketre",
                                                            "score": 0,
                                                            "created_utc": 1653481213.0,
                                                            "response": "Making a new bitcoin did not work out for bitcoin cash. Im talking about if most of the bitcoin blockchain agreed on upping the block size. And the official bitcoin had a bigger block size. Yeah, the market decided not to do it, but the reasoning behind the decision im not sure if i agree with.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i9xljqf",
                                                    "author": "dat9553",
                                                    "score": 4,
                                                    "created_utc": 1653485430.0,
                                                    "response": "and LN is not controlled by anyone or any companies. It's an open-sourced protocol, anyone can open a LN channel with anyone, hosted by their own hardware, and close their channels whenever they want, as long as BTC mainnet is still running",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9xaj1p",
                            "author": "DAGCRO",
                            "score": 5,
                            "created_utc": 1653479663.0,
                            "response": "Who's stopping you from discussing new ideas? We've all seen your ideas, we just don't think they're good ones.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9xbb6z",
                                    "author": "snorketre",
                                    "score": 1,
                                    "created_utc": 1653480128.0,
                                    "response": "Im looking for the ideas, i have presented the problems. If you are talking about me asking about block sizes, its just a question. And its because that is the logical and easies place to start.   \nThe fact i want transaction costs under 1 cent is for every mode of transferring bitcoin, be it on main chain or secondary layer. Im not saying improving the main layer is the only place to be, its just my fast guess on a maximun average transaction cost for any network to be used as a day to day means of payment.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9xbl20",
                                    "author": "snorketre",
                                    "score": 1,
                                    "created_utc": 1653480287.0,
                                    "response": "And whats up with the hostility, is everyone in a bad mood because bitcoin price is going down?   \nNot from you specifically, but maybe the first 4-5 comments i got.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9xfka1",
                                    "author": "snorketre",
                                    "score": 0,
                                    "created_utc": 1653482489.0,
                                    "response": "What i mean by stopping is that if i get downvoted enough i cant post in this subreddit anymore.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9xgire",
                                            "author": "DAGCRO",
                                            "score": 3,
                                            "created_utc": 1653482984.0,
                                            "response": "Then consider not responding to litteraly every comment in the thread and minimize those downvotes.\n\nYou've said your piece. It wasn't well received. Try a different sub or let it go.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9xh2hm",
                                                    "author": "snorketre",
                                                    "score": 1,
                                                    "created_utc": 1653483261.0,
                                                    "response": "Ok, i just wanted good discussion and content to read. But i might try to follow your advice.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9x9fnp",
                    "author": "mredda",
                    "score": 2,
                    "created_utc": 1653479009.0,
                    "response": "Yes, second layer solutions (exchanges, crypto banks, lightning, etc) should carry more and more transactions, leaving for the main chain big transactions with expensive fees.\n\nThe future of bitcoin is delegated custody or die.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9xajax",
                            "author": "snorketre",
                            "score": 1,
                            "created_utc": 1653479667.0,
                            "response": "There is no way to improve the main chain to the point of carrying the whole worlds transactions?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9xg4h2",
                                    "author": "BTC_Deepfuckvalue",
                                    "score": 6,
                                    "created_utc": 1653482783.0,
                                    "response": "Dude....\n\nit's like your banging a square peg over and over again into a round hole and we're all here watching you like WTF can you not see it's square?\n\nWe don't need Bitcoin main net to scale all of the worlds transactions. \n\nYou need to do more research on how a modern money system works. I would recommend you\nread the book Layered Money by Nick Bhatia. \n\nIn order to scale all the worlds transactions you need layers. You want the base layer to be the most secure, transparent, and easily verifiable (i.e. Bitcoin main net) other layers of credit and settlement are then constructed on top to scale (i.e. lightning or Visa or something we haven't even conceived of yet).\n\nHumanity has not had a sound base layer of money since the gold standard WW1. We have been carrying out all economic calculation on a shitty elastic quicksand like base of paper promises....\n\nYou don't change Bitcoin, Bitcoin changes ( or in this case educates) you.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9ye3yn",
                                    "author": "hans7070",
                                    "score": 2,
                                    "created_utc": 1653497164.0,
                                    "response": "Why try? Let's say you make a payment of $0.02 to visit a web page behind a pay wall. You want that payment to be stored forever on thousands of computers? What about privacy too?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9ytkhd",
                                            "author": "snorketre",
                                            "score": 1,
                                            "created_utc": 1653503191.0,
                                            "response": "I was just wondering.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9xjcjc",
                                    "author": "mredda",
                                    "score": 1,
                                    "created_utc": 1653484392.0,
                                    "response": "No, there is no way because the payoff of descentralization is limited throughput. The small payments need to be performed on second layers.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9yflhw",
                    "author": "igadjeed",
                    "score": 2,
                    "created_utc": 1653497739.0,
                    "response": "The Bitcoin maximum block size is too big. There's a proposal to reduce it to 300kvbytes. This will happen\n\n> i know about the lightening network\n\nIf you can't spell lightning, you know nothing\n\n> How much could we raise the block size  \n> this is not a big block post\n\nLiar\n\n> peoples ability to run their own full node\n\nIncluding you? When are you setting up your node?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ytab7",
                            "author": "snorketre",
                            "score": 1,
                            "created_utc": 1653503082.0,
                            "response": "I have my full node running in my room on a old laptop i bought for that purpose (and running a server).  \nIm literally saying im open to layer 2 solutions. Isn't that like the opposite of the big blockers?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9xip0o",
                    "author": "Ok_Aerie3546",
                    "score": 1,
                    "created_utc": 1653484071.0,
                    "response": "Bitcoin might never be used for day to day transactions, credit cards are easier and better and using those makes taxes easier and removes any concerns of volatility.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9xo284",
                            "author": "snorketre",
                            "score": 1,
                            "created_utc": 1653486594.0,
                            "response": "Taxes is actually a good point.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9xrc08",
                                    "author": "Ok_Aerie3546",
                                    "score": 1,
                                    "created_utc": 1653488038.0,
                                    "response": "Volatility too. If you know you are going to spend 1500 dollars each month on stuff, why not just keep that part of your salary in dollars and use it to pay for things. The rest you can convert to bitcoin.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9xxbtz",
                                    "author": "BTC_Deepfuckvalue",
                                    "score": 1,
                                    "created_utc": 1653490532.0,
                                    "response": "Tax law is temporary and ever changing. Some sovereign nations are declaring Bitcoin legal tender. It will take time for tax laws to catch up to technology advancements",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9xrirk",
                    "author": "hans7070",
                    "score": 1,
                    "created_utc": 1653488120.0,
                    "response": "\"without locking them up in for example a lightening network channel\"\n\nWith channel splicing you will be able to splice out onto chain, reducing your channel's local balance. In practice it won't feel different than a regular on chain payment. Same with splicing \"in\".",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9yu86s",
                            "author": "snorketre",
                            "score": 1,
                            "created_utc": 1653503451.0,
                            "response": "Ok cool, il check it out!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}