{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "v08r0e",
            "title": "Looking for contra opinion.",
            "url": "https://www.reddit.com/r/Bitcoin/comments/v08r0e/looking_for_contra_opinion/",
            "author": "Pokermoniac",
            "created_utc": 1653821777.0,
            "score": 2,
            "num_comments": 21,
            "subreddit": "Bitcoin",
            "selftext": "Hey fellow bitcoiners.\n\nSo I spent my 100+ hours with bitcoin podcasts, Michael Saylor interviews and books like ,,Bitcoin standard\\`\\`. I also got my first thousands of euros into Crypto.   \nNow  I thought that it would be useful to listen to anti-bitcoiners, because all of the arguments of pro-crypto ant pro-bitcoin I know already.\n\nWhat are some of the articulate anti-crypto or anti-bitcoin ,,evangelists\" podcasts, books etc.? I'd love tol hear what they have to say to see how would I react to that, as currently I am pretty sure that cryptoeceonomy is something, which I hope will flourish in the future.",
            "stickied": false,
            "comments": [
                {
                    "id": "iaf1oth",
                    "author": "pink_raya",
                    "score": 4,
                    "created_utc": 1653825352.0,
                    "response": "articulate arguments against bitcoin ended in 2018.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iafawj0",
                    "author": "g3Mo",
                    "score": 2,
                    "created_utc": 1653830918.0,
                    "response": "Nice effort OP! 👍🏻\n\nI tried the same thing 6 months back. The comments and replies were rather interesting\n\n1. Here's the [post](https://www.reddit.com/r/Bitcoin/comments/r2hfen/why_bitcoin_will_fail/) on r/bitcoin\n2. Here's [another](https://www.reddit.com/r/slatestarcodex/comments/r2o1cb/why_bitcoin_will_fail/) on r/slatestarcodex\n3. I particularly enjoyed this [reply](https://www.reddit.com/r/BitcoinBeginners/comments/r2njox/why_bitcoin_will_fail/hm5k6w1/?context=3) I received from u/bitusher on r/BitcoinBeginners\n\nHave fun! 💥",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaex91n",
                    "author": "nicky_papagiorgio",
                    "score": 2,
                    "created_utc": 1653821937.0,
                    "response": "check out r/Buttcoin. lots of objective, very refined anti-btc posts there",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaf8ohd",
                            "author": "Lazy-Substance-5161",
                            "score": 3,
                            "created_utc": 1653829732.0,
                            "response": "I can't tell if this sub is either joking or completely primitive?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iaf9cfm",
                                    "author": "nicky_papagiorgio",
                                    "score": 2,
                                    "created_utc": 1653830094.0,
                                    "response": "the latter",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "iaeydbg",
                            "author": "Pokermoniac",
                            "score": 1,
                            "created_utc": 1653822855.0,
                            "response": "Checked it. Pretty much just memes :/ not really what I'm looking for but thanks!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iaeyym2",
                                    "author": "torba",
                                    "score": 3,
                                    "created_utc": 1653823327.0,
                                    "response": "you can go pick a fight with people on r/technology or r/Futurology, they seem to have a bone to pick with it. r/europe as well. Often-times argument is about waste of electricity. good luck educating people about wasted energy in generation and balancing grids in a forum where they don't wanna learn about it ;)",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "iaezi1d",
                                    "author": "Salti21",
                                    "score": 2,
                                    "created_utc": 1653823747.0,
                                    "response": "Just realize most of the anti btc  arguments are false.  Why would anyone convert money to anything other than btc?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iaf0ndu",
                                            "author": "Turpis89",
                                            "score": 3,
                                            "created_utc": 1653824599.0,
                                            "response": "Because I can also convert money into food and beer?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iaf1v0o",
                                                    "author": "Salti21",
                                                    "score": 1,
                                                    "created_utc": 1653825475.0,
                                                    "response": "You sure can but we should stick to the topic here which is shitcoins and bitcoins, not food and beer.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iaf47kf",
                                                            "author": "Turpis89",
                                                            "score": 2,
                                                            "created_utc": 1653827079.0,
                                                            "response": "Yeah, I was trying to be funny. Anyway, for the OP: \n\nI am a fence sitter with investments alltogether, but am considering getting into stocks and/or crypto instead of spending all my money on the house. I did some browsing in r/buttcoin and I found arguments against bitcoin that sounded reasonable to me (a know-nothing idiot).\n\nShort summary:\n\nA currency that rewards hoarding over spending is no good for the general economy.\n\nA currency that is voltile in the short term is unpractical because you'd like to know in advance that the money you saved up for 6 months of rent will actually be able to pay 6 months of rent.\n\nSome inflation is good for people with debt, because your salary will increase over time while your debt will not (interest rates aside).\n\nBeing able to print money is useful because it allows you to stimulate the economy when it's needed. Hoarding digital gold does the opposite. We went off the gold standard because it stopped being useful.\n\nAnd to the people who are like \"Dude, nobody thinks you should put money you need for rent into crypto!\" - Then stop saying bitcoin is a currency, and not an investment.\n\nAs a final note I will just add that the carbon footprint of Bitcoin is very problematic to me from a moral standpoint.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "iaf71f1",
                                                                    "author": "hsmst4",
                                                                    "score": 1,
                                                                    "created_utc": 1653828822.0,
                                                                    "response": "Thank you so much for this.  Is probably thee best summary of anti-BTC I've also been searching for.\n\nThe hoarding point during emergencies is also where I get stuck.  I'm thinking of wars, natural disasters, etc...  It would be dangerous to strictly rely on donations for situations like that.\n\nAlso economy stimulation.  Even though it can be abused as seen lately.  It's hard to deny that a credit/debt structure is what drove the evolution of so many technologies we enjoy today.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "iaf7ekx",
                                                                            "author": "Turpis89",
                                                                            "score": 1,
                                                                            "created_utc": 1653829040.0,
                                                                            "response": "I am sure you will soon hear the counter arguments from someone :)\n\nAnd by all means, you may still be able to make a lot of money investing in Bitcoin. I won't pretend to know where the price goes from here.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "iaf7i6n",
                                                                    "author": "ProfeshPress",
                                                                    "score": 1,
                                                                    "created_utc": 1653829100.0,
                                                                    "response": "I'd debunk all of the above glorified talking-points, but Saifedean Ammous already [saved me the trouble](https://www.youtube.com/watch?v=gp4U5aH_T6A).\n\nSuffice it to say that 'stimulating the economy' via inflation is an utter canard. Indeed, having scoured high and low for authentic, good-faith critiques of bitcoin's viability as an asset; the only ones that seem at all persuasive have to do with systematic repression or seizure by state actors in collusion with centralised exchanges, which unfortunately still host the lion's share of BTC in circulation, or else the plausible likelihood that Tether may go the way of UST.\n\nEven then, I'd argue that the 'genie is out of the bottle' where bitcoin is concerned (if not necessarily for cryptocurrency as a whole), and that providing the fundamental value-proposition—i.e. immutability—remains intact, both of these scenarios would only serve as further testament to the *need* for hard-money: thus, bitcoin.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iaf1z1e",
                    "author": "Dormage",
                    "score": 2,
                    "created_utc": 1653825555.0,
                    "response": "Theres a very strong anti crypto propaganda in r/technology r/programming and other technology based subs.\n\nBitcoin is just a linked list. Its just a super ineficient database. Actually we had bitcoin for years, its git. Git is better then blockchain but somehow cant do what Bitcoin does.\n\nBitcoin touches a lot of fields, from computer science, mathematics and cryptography, to economy, finance, phylosophy, geopolitics etc.\n\nI think most counter arguments spring up because they analyse Bitcoin from single perspective and not take a holistic apporach at understanding it.\n\nThe linked list argument is a clear example of how from a computer science perspective, blockchain forms a linked list data structure which we've known from the 50's. \nBut Bitcoin is much more then that, and failing to ackowledge that is ignorance.\n\nIts like charry picking when arguing with someone.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iafg80l",
                    "author": "AlternativeYou8664",
                    "score": 2,
                    "created_utc": 1653833589.0,
                    "response": "Yea it was an ok shooter for its time, I preferred metal slug though.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iafw4nk",
                            "author": "Slapshot382",
                            "score": 1,
                            "created_utc": 1653840876.0,
                            "response": "Contra > metal slug.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iafdfsy",
                    "author": "KonStrugar",
                    "score": 1,
                    "created_utc": 1653832228.0,
                    "response": "Do you know Peter Schiff ?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iafyv93",
                    "author": "AllfatherAngron",
                    "score": 1,
                    "created_utc": 1653842086.0,
                    "response": "r/Buttcoin \\- anti-bitcoiners over there.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaflq1r",
                    "author": "Rude_Advance3747",
                    "score": 0,
                    "created_utc": 1653836224.0,
                    "response": "Basically the strongest counter arguments in my opinion are these:\n\n1: Deflationary currency is not a good thing. Why would people use bitcoin as a currency if its deflationary? Why wouldn’t they just hoard it, hoping it will increase in value.\n\n2: Inflexibility. So I see a lot (not all!) of Bitcoiners as conspiracy theorists who say that the government prints money to make themselves rich and everyone else poor. Truth is, the government prints money (or more accurately, hands them to banks) as a way to ensure they keep lending to companies who then use the money to keep employing people, therefore avoiding an economic meltdown. Bitcoin doesnt offer such flexibility. I fear if there is a recession with bitcoin, it would be a huge one lasting decades instead of like 3 years. Those who say there is no recession under bitcoin are talking out of their asses because lets face it: how would they be able to say what an economy would look like with full Bitcoin adoption when we dont even understand the economy without it. In the realm of economic theory, if someone is too confident, be suspicious that they are confident only because they are ignorant.\n\n3: People don’t crave decentralised things. Simple as that. Most are happy with how the state is operating in the money realm. If you get scammed, banks give you your money back and people like that. Bitcoiners say all these people are stupid sheep. Oh well.\n\n+1: The bitcoin standard is not a good book from an academic standpoint. It only has a handful of references for each chapter and they seem to reference other bitcoiners a lot. Also, it relies on Austrian economics which is promising but underdeveloped as hell. Also, check out the author. He is not an acclaimed economist at all (but certainly a smart person) and if you look at his website, you can see he is reeeaaally cashing in on the success of the book. Like offering courses and audiobooks and all sorts of bullshit for money. And of course he wrote another book called “the fiat standard”. Like wtf is even that, I thought the Bitcoin standard would be THE book. So there’s another one? Why? Is there more we should know? Has he just remembered them now? Also his website looks like one of those old eBook places where you pay 10 dollars for “3 secrets that will make you rich”. Not credible at all.\n\nSorry for the long one but the top comment here currently is “articulate arguments against bitcoin ended in 2018” and that is not true.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "v08s1e",
            "title": "is there any self custodian way to get loans on my Bitcoin?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/v08s1e/is_there_any_self_custodian_way_to_get_loans_on/",
            "author": "alexmios30",
            "created_utc": 1653821914.0,
            "score": 0,
            "num_comments": 50,
            "subreddit": "Bitcoin",
            "selftext": "I won't use any CEX\n\nJust need like 30% of my Bitcoin to start a business",
            "stickied": false,
            "comments": [
                {
                    "id": "iaey290",
                    "author": "4nln415",
                    "score": 5,
                    "created_utc": 1653822606.0,
                    "response": "I will tell you it’s safer to just hodl\n\nIf these companies goes tits up you will be left with nothing",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaezrm2",
                            "author": "alexmios30",
                            "score": 2,
                            "created_utc": 1653823949.0,
                            "response": "Yeah that's my only fear",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iafpihi",
                            "author": "RottenBlueCheese",
                            "score": 0,
                            "created_utc": 1653837929.0,
                            "response": "That’s not how a loan works..",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iaezrb3",
                    "author": "dima054",
                    "score": 4,
                    "created_utc": 1653823943.0,
                    "response": "unchained do multisig loans",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaezz9b",
                            "author": "alexmios30",
                            "score": 1,
                            "created_utc": 1653824109.0,
                            "response": "May I ask what's unchained? Any links?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iaf0kwx",
                                    "author": "dima054",
                                    "score": 2,
                                    "created_utc": 1653824549.0,
                                    "response": "https://unchained.com/",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "iafdvq7",
                            "author": "Jezzes",
                            "score": 1,
                            "created_utc": 1653832447.0,
                            "response": "Yeah it would have to be a multisig agreement and the borrower and lender should be P2P without a third party",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iaf0s2o",
                    "author": "Halo22B",
                    "score": 5,
                    "created_utc": 1653824695.0,
                    "response": "HODL HODL....not a full self custody but a multisig setup so you, the arbitrator and the loan originator can all see that the BtC isn't being messed with.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaf2bk0",
                            "author": "alexmios30",
                            "score": 1,
                            "created_utc": 1653825799.0,
                            "response": "Found it in Google too\n\nIs that trustable?\n\nThat sounds like what I need",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iagql2y",
                                    "author": "riclas",
                                    "score": 2,
                                    "created_utc": 1653854897.0,
                                    "response": "you have to trust hodlhodl not to collude with the loan originator, but it's the best non custodial option imho",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "iafrbds",
                                    "author": "Halo22B",
                                    "score": 1,
                                    "created_utc": 1653838751.0,
                                    "response": "Unchained Capital does the same thing. Both have been around for a long time.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iaexuhy",
                    "author": "DatBuridansAss",
                    "score": 3,
                    "created_utc": 1653822429.0,
                    "response": "Not that I'm aware of. Would be amazing.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaezxqh",
                            "author": "alexmios30",
                            "score": 2,
                            "created_utc": 1653824077.0,
                            "response": "Googling lead me to Hodl Hodl but couldn't understand their system so I thought I start researching before",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iafdeg0",
                            "author": "Jezzes",
                            "score": 0,
                            "created_utc": 1653832210.0,
                            "response": "Too good to be true, sounds like you would need an algorithmic stable coin mechanism and we should all know how that ends.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iag56c8",
                                    "author": "bullett007",
                                    "score": 2,
                                    "created_utc": 1653844928.0,
                                    "response": "Well, not really. You’re borrowing against yourself or against your own bitcoin backed collateral.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iafcmlh",
                    "author": "Jezzes",
                    "score": 3,
                    "created_utc": 1653831817.0,
                    "response": "That literally makes no sense. Loan means you let someone else hold your assets in exchange for money. If you still have control of your Bitcoin why would they give you money, what value would you be offering? What's in it for them?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iafh7ok",
                            "author": "alexmios30",
                            "score": 2,
                            "created_utc": 1653834088.0,
                            "response": "I didn't explain myself well\n\nI want a multi sig trust less platform rather than trusting the third person",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iaj4arq",
                                    "author": "Less_Mention9063",
                                    "score": 1,
                                    "created_utc": 1653907343.0,
                                    "response": "What’s makes a platform favorable for you ? Or what would you want to see in such platform, if it was created?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iaey897",
                    "author": "user_name_checks_out",
                    "score": 3,
                    "created_utc": 1653822742.0,
                    "response": "With a DEX such as sovryn there is no central custodian although you still have to cede control of your private keys to the network. Last time I checked they had low liquidity and were not ready for prime time.\n\nAny business you start is unlikely to outperform bitcoin, I'd just hodl.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaf19ew",
                            "author": "DatBuridansAss",
                            "score": 1,
                            "created_utc": 1653825039.0,
                            "response": "Cash flow is the only issue.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iaf28jd",
                    "author": "Troy_Ounces",
                    "score": 2,
                    "created_utc": 1653825739.0,
                    "response": "Unchained capital, never used em just heard their ads on podcasts",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaf7ekp",
                    "author": "Fine-Artichoke-7485",
                    "score": 2,
                    "created_utc": 1653829040.0,
                    "response": "I could never do it. I once was scammed out on a Bitcoin mining contract in 2015. Since then I just buy and hold. Borrowing money? What about a home equity loan?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaf7zc1",
                            "author": "alexmios30",
                            "score": 0,
                            "created_utc": 1653829373.0,
                            "response": "Yeah couldn't find any useful ones and got my DMs full xd \n\nI guess I sell some of my Bitcoin and buy back",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iag4w3n",
                    "author": "bullett007",
                    "score": 2,
                    "created_utc": 1653844802.0,
                    "response": "Check out the Zero protocol on Sovryn. \n\nBorrow at 0%, 110% collat ratio, in final stages of launching.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iagwcwd",
                    "author": "Zoren-Tradico",
                    "score": 2,
                    "created_utc": 1653857709.0,
                    "response": "You could just sign a contract and physically give away the wallet containing the bitcoins.\nOf course you won't be able to take that back wherever you want, and if the other guy loses it all, there might be no way for him to feasibly pay you back. But hey, you are \"free\" from exchanges....",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iagxslv",
                            "author": "alexmios30",
                            "score": 1,
                            "created_utc": 1653858406.0,
                            "response": "I would prefer this rather than exchanges\n\nBut sadly finding the guy for it is kinda impossible",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iaf2j5c",
                    "author": "Stardust8356",
                    "score": 3,
                    "created_utc": 1653825940.0,
                    "response": "ppl who are saying it's not worth it to start a business and it's more profitable to hodl, just confirm everything noncoiners say about disinflationary currencies and how ppl would just hold their money if they knew it'd appreciate in value tomorrow. don't do that.\n\nbitcoin is only a means to end which is financial freedom, starting a business is also just as a good means. don't marry your coins, that's not how any of that works.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaf39je",
                            "author": "alexmios30",
                            "score": 3,
                            "created_utc": 1653826447.0,
                            "response": "Yeah exactly, bitcoin is saving and asset\n\nWithout an stable income there will be no more position increase chance",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iaexi1h",
                    "author": "The-Francois8",
                    "score": 1,
                    "created_utc": 1653822143.0,
                    "response": "How exactly would you envision this working?\n\nI lend you money, you fail to pay it back… I then attempt to take your collateral in compensation (your bitcoin), but you still have custody of the bitcoin and you tell me to “go fuck myself” or “pound sand” and I’m out the money to start your business.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaexzrt",
                            "author": "DatBuridansAss",
                            "score": 3,
                            "created_utc": 1653822550.0,
                            "response": "Could be some sort of multisig setup or a smart contract of some kind. Not sure how exactly it could work, but if someone were to figure it out they would make a lot of money.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iaey53j",
                                    "author": "The-Francois8",
                                    "score": 2,
                                    "created_utc": 1653822671.0,
                                    "response": "As long as the borrower has one of the required signatures, they haven’t actually put up any collateral…\n\nNo one will give a loan without an ability to collect, via court action or other direct action.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iaeyj2n",
                                            "author": "DatBuridansAss",
                                            "score": 3,
                                            "created_utc": 1653822984.0,
                                            "response": "Yes that's the challenge.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "iaezigw",
                                    "author": "dima054",
                                    "score": 2,
                                    "created_utc": 1653823755.0,
                                    "response": "unchained capital does multisig loans",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "iaez3ky",
                            "author": "alexmios30",
                            "score": 2,
                            "created_utc": 1653823437.0,
                            "response": "I didn't explain myself clearly\n\nI want a multisig/smart contract rather than using cexs",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iaf0fmr",
                                    "author": "Crypto_Gui",
                                    "score": 3,
                                    "created_utc": 1653824443.0,
                                    "response": "By the way, there are smart contract risks that should not be underestimated if you plan to lend or borrow significant amounts.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iaf0ma2",
                                            "author": "alexmios30",
                                            "score": 0,
                                            "created_utc": 1653824576.0,
                                            "response": "Yeah, there are so many risk factors that I'm feeling overwhelmed\n\nI may reconsider and just Hodl\n\nDelays me 2 months but better late than sorry",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iafc2hm",
                                                    "author": "Crypto_Gui",
                                                    "score": 2,
                                                    "created_utc": 1653831527.0,
                                                    "response": "It really depends on what kind of business we are talking, but 2 months doesn’t seem like a huge delay. I am sure that there are tasks that you can do during this time that are not capital intensive… good luck",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iafhe5z",
                                                            "author": "alexmios30",
                                                            "score": 1,
                                                            "created_utc": 1653834178.0,
                                                            "response": "Thank you\n\nYeah but 2 months will slow me down in my plans\n\nI guess eat the frog and wait",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "iafrkps",
                                                                    "author": "Crypto_Gui",
                                                                    "score": 1,
                                                                    "created_utc": 1653838865.0,
                                                                    "response": "If two months are really as important go for the loan, or sell now and buy back later… do some ROI analysis and ponder pros and cons….",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "iafmow3",
                                                    "author": "codingwithcoffee",
                                                    "score": 2,
                                                    "created_utc": 1653836656.0,
                                                    "response": "I don’t know if there’s a lender who does this - wanted to share a cautionary tale… \n\nI had a business partner who got into bitcoin early. A few years ago we started this software business together. He used a fair chunk of his bitcoin as seed capital to invest in the business - he put in over 50 BTC back when BTC was around $4K (we both put in $100K to start and then another $150K over about a year to cover operating cash flow (salaries). This was after we landed a contract with a big customer that had huge upside potential for us and we needed to hire more people. Things were looking great!\n\nWe got out over our skis with this big customer -  they ended up screwing us - I don’t think intentionally but the end result is all that matters.\n\nOur business collapsed soon after - all said and done we walked away with about $20K each.\n\nOf course while all this was happening, the value of bitcoin had shot up by a factor of more than 10. \n\nIf my friend had just held his bitcoin - even at todays prices - it would be worth best part of $2M. Even on our most optimistic projections his share of our business would not have been worth this much today - though it would be throwing off enough cash to stack a decent amount of sats each month. But it isn’t and it’s not … a painful lesson in why we HODL.\n\nEvery time I look in the mirror he reminds me what an idiot I am!\n\nI don’t say this to discourage you from starting your business. Go for it - just be careful in managing your risks. Especially with volatile assets like Bitcoin. I imagine a loan contract with Bitcoin as collateral would have provisions for margin calls if Bitcoin drops in value - you don’t want to be forced to tip in more Bitcoin or sell if the market goes south. \n\nI don’t know what the value of bitcoin will be tomorrow. I do know the feeling of watching the value rocket up while your capital is tied up in another venture. And I know the feeling of watching wealth evaporate when a business implodes - and having to start over and rebuild. \n\nIt sounds like you are being sensible with limiting to only using 30% of your bitcoin to start the business, and looking to do it in a way that lets you keep control of the bitcoins by only using it as collateral. Smarter than selling. \n\nIf you do find a lender who will do this and go ahead with your plan - I would be trying to set aside enough capital so you can replace the bitcoin collateral and/or repay the loan so you avoid any margin call or forced sale. \n\nBest of luck internet stranger!",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iag2emj",
                    "author": "pfefpfef",
                    "score": 1,
                    "created_utc": 1653843679.0,
                    "response": "Defichain, you need to get your bitcoin through cake cause they hold them custodial for you to get them into the chain. But then you can take loans on them",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iai104u",
                    "author": "TakeCareOfYourM0ther",
                    "score": 1,
                    "created_utc": 1653878606.0,
                    "response": "Swap to wbtc, use Oasis on maker to get a DAI loan.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}