{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uq1zo1",
            "title": "Why are there empty blocks in in the blockchain?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uq1zo1/why_are_there_empty_blocks_in_in_the_blockchain/",
            "author": "mredda",
            "created_utc": 1652604904.0,
            "score": 5,
            "num_comments": 12,
            "subreddit": "Bitcoin",
            "selftext": "It is not unusual to see empty blocks (with 0, 1 or very few transactions) in the block chain.\n\nHere is a very recent example.\n\nhttps://www.blockchain.com/es/btc/block/00000000000000000003ca025b0f616f3c78635f3b8f7f45f791b308661ee0a9\n\nWhat its the explanation of this? Why are miners generating empty blocks and renouncing to transaction fees?\n\nThanks!",
            "stickied": false,
            "comments": [
                {
                    "id": "i8oj20p",
                    "author": "igadjeed",
                    "score": 4,
                    "created_utc": 1652610595.0,
                    "response": "One of the mining pools is too lazy to pre-populate their blocks with transactions. They start empty, and fill after about 50 seconds. If a block follows the previous block by less than about 54 seconds, and if the block is mined by that pool, it will be empty  \n\nhttps://blog.lopp.net/empty-bitcoin-blocks-full-mempool/",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "upz31g",
            "title": "What does the community on r/bitcoin think of the sovryn dex and RSK sidechain?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/upz31g/what_does_the_community_on_rbitcoin_think_of_the/",
            "author": "kryptoNoiser",
            "created_utc": 1652592330.0,
            "score": 6,
            "num_comments": 6,
            "subreddit": "Bitcoin",
            "selftext": "What does the community on [r/bitcoin](https://www.reddit.com/r/bitcoin/) think of the sovryn dex and RSK sidechain?\n\n&#x200B;\n\nBy to way, Rootstock RSK and Liquid are both Bitcoin sidechains.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8nyxdh",
                    "author": "caploves1019",
                    "score": 3,
                    "created_utc": 1652593757.0,
                    "response": "Following for research.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ouenv",
                    "author": "xboox",
                    "score": 2,
                    "created_utc": 1652618636.0,
                    "response": "**SHITCOINS**   \naffinity scams  \none shitcoin wasn't enough so the greedy bastards created two",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uq2ibe",
            "title": "This chart speaks everything. DCA is the smartest and the most effective way of beating the market",
            "url": "https://i.redd.it/0uh41fc30mz81.png",
            "author": "Reahvenz",
            "created_utc": 1652607217.0,
            "score": 83,
            "num_comments": 30,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8om3d1",
                    "author": "davidcwilliams",
                    "score": 15,
                    "created_utc": 1652613063.0,
                    "response": "Can we see a lump sum side-by-side comparison?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8pcequ",
                            "author": "_Filip_",
                            "score": 1,
                            "created_utc": 1652627632.0,
                            "response": "I have one at https://shitcoin.ninja/post/2021/03/dca-vs-lump-sum-2022-03-edition/\n\nTLDR from article - Conclusion\nIf you decide to invest in BTC, Lump Sum yields statistically superior results. Past performance shows, that Lump Sum wins in 70.62% of cases, and when it wins, it performs 13.54 times better.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8pshsw",
                                    "author": "BuyRackTurk",
                                    "score": 6,
                                    "created_utc": 1652634667.0,
                                    "response": "> TLDR from article - Conclusion If you decide to invest in BTC, Lump Sum yields statistically superior results. Past performance shows, that Lump Sum wins in 70.62% of cases, and when it wins, it performs 13.54 times better.\n\nWhat this chart under-represents is how often \"lump sum\" loses for an individual. People dont start buying evenly at all times. Most people who FOMO in tend to buy in the short bull season, and very few people buy in the long bear season. The reason you can tell that is inherently true is that if lots of people were buying it wouldnt be a bear cycle in the first place, and if noone was buying it wouldnt be a bull season.\n\nSo Lump Sum wins by **Calendar Time** but loses badly by **Mental Time**\n\nIOW: for you as an individual, you are much more likely to feel FOMO (a time when DCA wins) and you are less likely to feel a strong desire to get in when btc is down (a time when Lump wins). \n\nIf  you suddenly come into a bunch of dirty fiat, and you want to dump it efficiently:\n\n* If you feel a strong urge to buy in, and bitcoin has been going up, and all sentiment is full-bull, giddy positive memes are flowing, it is probably close to the top. So temper your enthusiasm and DCA over time, because you are likely in a bull time cycle (about 30% of the time) and sentiment will probably drop soon.\n* If market sentiment is shot, everyone is in the doldrums, mass media is saying \"bitcoin is dead\", and there was a big USD price drop recently, then you are probably in a bear cycle (about 70% of the time). It can end at any moment, with a green candle so tall you will never get a second chance at it. So go all in to satoshis ASAP.\n* If you dont know which state things are in, then its probably better to DCA. The reason is that odds are good you are being subconsciously biased, and in investing, herd instincts almost always lead you off a cliff. And we know thats true, because thats why we have silly bull and bear cycles anyway. If everone was rational, they would all be racing to lump sum into BTC asap, and the dollar would drop to zero in a week.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8px6hp",
                                            "author": "_Filip_",
                                            "score": 2,
                                            "created_utc": 1652636687.0,
                                            "response": "It is true that with DCA you are buying mental happiness of sort which does have some benefits, and I do agree with your general strategy, it is a nice TLDR for new investor.\n\nBut these benefits come at a price of lost profit. While I personally do not have problem with DCA by itself, I see that new investors and especially \"cryptobros\" overestimate what DCA can do (We can just read the title of this thread .. \"smartest\", \"most effective\" ... it is neither by a long shot), and at the same time they heavily underestimate actual cost of exercising this strategy (they think they lose out a few % while in reality they divide the yield by 3-12, depeding on the period).  Ad this point, the narative is more of a cult supported by memes rather than informed decision about a way to invest.  \n\nAlso (I've written it to other poster as well), especially redditors around here who claim they live by dca don’t even do it 99% of time - they buy regularly from paychecks and never have the lump sum to begin with. This changes the narrative a lot. Stacking sats is a great way to get in the market, but there is no decision of what to do with your lump sum, and be concerned about cost of keeping it etc.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8q85uc",
                                                    "author": "BuyRackTurk",
                                                    "score": 0,
                                                    "created_utc": 1652641532.0,
                                                    "response": "> Ad this point, the narative is more of a cult supported by memes rather than informed decision about a way to invest. \n\nAbsolutely. Advice is generally geared for the fomo crowd. If we were only talking to steel minded hardened investors with ice in their veins, they wouldnt need advice anyway. They would have already heard of the general superiority of lump sum investing, for decades likely.\n\nDCA is a great strategy for someone who came into cash, is emotional about it, reacts to perceived loss with panic sells, and has no idea what bear/bull markets are. A model that shows the \"lump sum\" investor dumping everything each time he is down 10% or more then rebuying the next time at 50% higher would be a better model for a typical retail investor. \n\nI know at least a handful of people irl who lumped in on the tail end of a bull run and sold somewhere from half to all the way to the bottom. What DCA would have brought to them is a reduction in their emotional roller coaster. DCA moderates them. As a strategy it has a significant cost, but it buys not only reduced risk, but training on how to hold wealth and not make the kinds of moves that destroy it.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i8ppizj",
                                    "author": "Schwickity",
                                    "score": 1,
                                    "created_utc": 1652633379.0,
                                    "response": "What if you put the lump sum in at $64k. Not doing so hot if you did that. I didn’t.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8pskv3",
                                            "author": "_Filip_",
                                            "score": 1,
                                            "created_utc": 1652634704.0,
                                            "response": "Picking an arbitrary point in time is not a good way to look at any strategy, because you are effectively justifying your timing of the market. You can pick ATH, i can pick a drop and now what? That is why you need to evaluate any strategy long term, and with DCA it is just not a good performer - it jhelps you 30% of time but you lose a lot more than 30% of potetntial return. btw, if you do the same on SPY for its entirity you sill get similar result, which is quite interesting in itself. The idea for that comparison was not that original. \n\nDca is popular mostly with inexperienced investors be it in crypto or on stock markets. Also, redditors around here who claim they live by dca don’t even do it 99% of time - they buy regularly from paychecks and never have the lump sum to begin with, which changes the narrative a lot.  Stacking sats is a great way to get in the market, but there is no decision of what to do with a stash of money - the exercise I linked don’t even consider your opportunity costs, inflation eating the money just sitting there etc, which would favor lump sum even further.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8oj4i8",
                    "author": "MrQ01",
                    "score": 7,
                    "created_utc": 1652610653.0,
                    "response": "Interesting that those who started to DCA at the 2018 ATH now have a lower cost average than those starting at the 2019 floor. I'm sure not many people know this, and this should probably be said more often in order to emphasis the importance of time in the market. Imagine if those who FOMO'd into the 2018 \"bubble\" decided to just keep on DCA instead of tapping out.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8pim1m",
                            "author": "Bedroom-Eastern",
                            "score": 3,
                            "created_utc": 1652630409.0,
                            "response": "Thats why dca is better then try to beat market. Unless you like to sweat and waste time watching charts.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8oggun",
                    "author": "PerformanceVarious45",
                    "score": 2,
                    "created_utc": 1652608368.0,
                    "response": "Definitely good over the long term.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8p6bhg",
                            "author": "pedrillop",
                            "score": 1,
                            "created_utc": 1652624842.0,
                            "response": "Long term plans need some patience which is lacking in current investors they want early and hugh returns and they out their life savings in that coin which puts them in loss, better way is to just keep your funds in wallet and forget them",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8pvgt2",
                    "author": "EDWARD_SN0WDEN",
                    "score": 0,
                    "created_utc": 1652635951.0,
                    "response": "dca minimizes gains",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8sdza2",
                            "author": "AlexWasTakenWasTaken",
                            "score": 0,
                            "created_utc": 1652679997.0,
                            "response": "You're right. And moonstrategy.io maximizes gains.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8ti0au",
                                    "author": "EDWARD_SN0WDEN",
                                    "score": 1,
                                    "created_utc": 1652708917.0,
                                    "response": "Lump sum on capitulation does",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8tqui2",
                                            "author": "AlexWasTakenWasTaken",
                                            "score": 1,
                                            "created_utc": 1652712819.0,
                                            "response": "How do you know the capitulation is taking place and there isn't another leg down?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8uhq6n",
                                                    "author": "EDWARD_SN0WDEN",
                                                    "score": 1,
                                                    "created_utc": 1652723657.0,
                                                    "response": "you dont, but it beats DCA'ing during peaks for sure. even if you missed the bottom and got low averages during capitulation candles you'd be wayyyy further ahead. You gotta use sentiment and make a guess",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8ov8e3",
                    "author": "richie138",
                    "score": 1,
                    "created_utc": 1652619115.0,
                    "response": "What about if it was Tuesday or Friday?  The title of the graph sounds kinda cherry picked",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8oxlpx",
                    "author": "maximumcoin",
                    "score": 1,
                    "created_utc": 1652620449.0,
                    "response": "Yeah having a continuous investment with some Recurring deposit plan, is always better you can beat the market volatility by DCA and your assets will still increase, this is the best and effective way to make profit in long term",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8p2d4u",
                    "author": "wobble_87",
                    "score": 1,
                    "created_utc": 1652622944.0,
                    "response": "The wording on this is wrong or the graph is wrong.\n\n\nFor example when they say DCA starting in 2012 they have to mean starting on the first Monday in 2012 and ENDING on the last Monday is 2012.\n\n\n\nOtherwise it is impossible to have an average cost of 67$.\n\n\nSame goes for all the other years.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8polc6",
                    "author": "Big_Party_4731",
                    "score": 1,
                    "created_utc": 1652632973.0,
                    "response": "Lump is better in btc because btc is not sp500 that is supposed to continuously go up so time in the market means more than catching the dip. Btc is cycles so most money is made in specific time frame, entering at the right dip matters",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8poyje",
                    "author": "NearbyTurnover",
                    "score": 1,
                    "created_utc": 1652633133.0,
                    "response": "Lump sum > dca\n\nhttps://stats.buybitcoinworldwide.com/mayermultiple/\n\nThis is even better",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8sdwgs",
                            "author": "AlexWasTakenWasTaken",
                            "score": -1,
                            "created_utc": 1652679938.0,
                            "response": "Moonstrategy.io is even better ;)",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8pusk0",
                    "author": "i_heart_dial-up",
                    "score": 1,
                    "created_utc": 1652635660.0,
                    "response": "I DCA weekly and lump sum (when the money is available).",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8qoaqi",
                    "author": "ForcedLoginIsFacism",
                    "score": 1,
                    "created_utc": 1652648634.0,
                    "response": "Redraw that picture from local highs of booms - This will be even more impressive",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8qzmhi",
                    "author": "Crypto_Moon_Cuck",
                    "score": 1,
                    "created_utc": 1652653638.0,
                    "response": "That’s A LOT of orange!!!!\n\nBullish????",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uq28v2",
            "title": "Do you think is time to buy the deep",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uq28v2/do_you_think_is_time_to_buy_the_deep/",
            "author": "ErosTHE",
            "created_utc": 1652606007.0,
            "score": 0,
            "num_comments": 56,
            "subreddit": "Bitcoin",
            "selftext": "Hello to all traders.\n\nDo you think is time to buy the deep ? It is time to opening our longs ?",
            "stickied": false,
            "comments": [
                {
                    "id": "i8ooove",
                    "author": "Moopstah",
                    "score": 14,
                    "created_utc": 1652614995.0,
                    "response": "15k is my buy in metric for this bear market. Or when people start saying that crypto is dead and gone. Not my first rodeo.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8ps61r",
                            "author": "Dazzling_Marzipan474",
                            "score": 7,
                            "created_utc": 1652634523.0,
                            "response": "A lot of talk of 15k almost as much as there was about 100k",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8qmnjw",
                                    "author": "Moopstah",
                                    "score": 1,
                                    "created_utc": 1652647923.0,
                                    "response": "That’s fair. I time my trades more about the mentality of the market as a whole instead of numerical values.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8pc04z",
                            "author": "26oclock",
                            "score": 2,
                            "created_utc": 1652627443.0,
                            "response": "Same area I‘m looking at. Maybe a bit shakey due to overall global market situation. First time BTC will have to face a greater recession.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8pq9hm",
                            "author": "ILikePracticalGifts",
                            "score": 1,
                            "created_utc": 1652633703.0,
                            "response": "I thought that generally, the last bull runs high will be the bottom of the new bear market?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8oewg2",
                    "author": "midastouch900",
                    "score": 7,
                    "created_utc": 1652607005.0,
                    "response": "The quantitive tightening period in the US is likely to start June 1st. The fed will start to unload their assets & the markets won't like that so good chance prices will probably go down further... plus there's like another 5 fed meetings this year, some of which will surely include more interest rate hikes, so lot's more downside could be to come.... with that said, we're still pretty low right now, so with a long term horizon it can't be a bad idea to start nibbling your way in at these prices. Maybe just don't unload a long all at once, average it in throughout the rest of the year.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8ofrib",
                            "author": "ErosTHE",
                            "score": 2,
                            "created_utc": 1652607751.0,
                            "response": "Yes but there are limitations. FED is continuously increasing rates, then housing bubble is at the door. Their hawkish statements, as always, cannot stop the housing risks. And now they all might find a safe heaven in banks due to rates, but when inflation start to hit, another headging than gold might rise. And Crypto will be there. Well again these are personal opinion guys. But thank you 😊",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8p96o2",
                                    "author": "Aresomethingelse",
                                    "score": 2,
                                    "created_utc": 1652626166.0,
                                    "response": "I'm not sure on this but I have been hearing that the expected housing bubble may not explode 2008 style bc much of the current housing supply has been accumulated by corporations and financial institutions with deep pockets and access to cheap credit. If this is the case, I'm not sure how it unwinds but could likely play out quite different this go around.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8p9cz5",
                                            "author": "ErosTHE",
                                            "score": 1,
                                            "created_utc": 1652626245.0,
                                            "response": "For sure is something they must keep in mind. I agree yes",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i8ptkkp",
                                            "author": "polloponzi",
                                            "score": 1,
                                            "created_utc": 1652635138.0,
                                            "response": "> and access to cheap credit.\n\nAnd that is what is going to change",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8olgii",
                            "author": "frunf1",
                            "score": 2,
                            "created_utc": 1652612570.0,
                            "response": "Did you ever check how the markets performed during the 90ies? There the interest rate was around 4% and the s&p performed plus 10% and more per year. So this  interest rate stuff is at least some FUD.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8pahiu",
                                    "author": "Libertarian_Florida",
                                    "score": 1,
                                    "created_utc": 1652626760.0,
                                    "response": "Our debt to GDP ratio was tiny back then compared to now.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8oext2",
                    "author": "GannicusXIII",
                    "score": 10,
                    "created_utc": 1652607038.0,
                    "response": "I dont know, he is a bit of a loser as super heroes go 😂",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8p0aeb",
                    "author": "AdS_CFT_",
                    "score": 2,
                    "created_utc": 1652621891.0,
                    "response": "Dont trade in futures market if you have to ask on forums to strangers.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8p11u6",
                            "author": "ErosTHE",
                            "score": -1,
                            "created_utc": 1652622286.0,
                            "response": "We are not strangers I guess. At least we have one thing in common... we are trading :)",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8p4p5c",
                    "author": "userxtrustno1",
                    "score": 2,
                    "created_utc": 1652624077.0,
                    "response": "Yes. It can dip further, but it would be a blitz crash followed by a squeeze short. At those prices, I bet even JP Morgan is buying.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8p873y",
                            "author": "ErosTHE",
                            "score": 0,
                            "created_utc": 1652625718.0,
                            "response": "But I don't know if you remember what they said about bitcoin?  \nIt was trash and the value would go to 0... A couple of weeks ago they announced that the 'FAIR VALUE' is 37.8 K. Like they measure how much electric energy was consumed for production... They missed the big move and that hurt their feelings:)))))))",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8pg2k2",
                    "author": "VPNApe",
                    "score": 2,
                    "created_utc": 1652629288.0,
                    "response": "Sure, but little by little and only when the price drops significantly. The recession hasn't even started yet.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8odtm4",
                    "author": "LaserCondiment",
                    "score": 4,
                    "created_utc": 1652606068.0,
                    "response": "It's not deep enough yet",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8ofju6",
                            "author": "Adventurous_Garlic58",
                            "score": 2,
                            "created_utc": 1652607570.0,
                            "response": "That’s wat she said",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8om26q",
                                    "author": "TopIndependence5807",
                                    "score": 1,
                                    "created_utc": 1652613038.0,
                                    "response": "How deep is it?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8qdn4v",
                                            "author": "Beautiful-Relief-268",
                                            "score": 1,
                                            "created_utc": 1652643983.0,
                                            "response": "4 inches on a good day",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8oe04a",
                            "author": "ErosTHE",
                            "score": 1,
                            "created_utc": 1652606229.0,
                            "response": "Hm, i see,  \nSo your speculation is that prices will go lower? You are referring to all Crypto? I mean Bitcoin is the leading Crypto so I guess you are talking in general.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8ovjvd",
                                    "author": "user_name_checks_out",
                                    "score": 5,
                                    "created_utc": 1652619302.0,
                                    "response": "No, he is making fun of the fact that you say \"deep\" when you mean \"dip\".\n\nAlso: There is no crypto. Only bitcoin.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8oe05j",
                    "author": "Longjumping-Low3164",
                    "score": 0,
                    "created_utc": 1652606230.0,
                    "response": "Waiting for 80% drop from all time high.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8oe5sp",
                            "author": "ErosTHE",
                            "score": 1,
                            "created_utc": 1652606365.0,
                            "response": "The standard retracement, as all commercials(traders), are waiting?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8oe84i",
                                    "author": "Longjumping-Low3164",
                                    "score": 4,
                                    "created_utc": 1652606419.0,
                                    "response": "Historical data. Waiting for more than 80% is not rational.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8oel39",
                                            "author": "ErosTHE",
                                            "score": 1,
                                            "created_utc": 1652606731.0,
                                            "response": "Practically you are talking at around 13.7 K, or something close to 10 let's say.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8oeyqb",
                                                    "author": "Longjumping-Low3164",
                                                    "score": 3,
                                                    "created_utc": 1652607060.0,
                                                    "response": "Yes. Somewhere around 15k area. But obviously it could never go there...",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8ofd1k",
                                                            "author": "ErosTHE",
                                                            "score": 1,
                                                            "created_utc": 1652607403.0,
                                                            "response": "Yes sure we are speculators. Noone can guarantee the prices :)",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "i8ofhzk",
                                                            "author": "Adventurous_Garlic58",
                                                            "score": 1,
                                                            "created_utc": 1652607525.0,
                                                            "response": "Says who",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8otbuj",
                            "author": "Gughy14",
                            "score": 1,
                            "created_utc": 1652617993.0,
                            "response": "Drop was common because we touched ATH last year and after that bear market was always on cards, so we were ready for this dip, whenever there is bull Run it is followed by bear market and again vice versa",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8oflr7",
                    "author": "No-Market-2238",
                    "score": 1,
                    "created_utc": 1652607615.0,
                    "response": "Have a look at the chart and tell me?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8oxn4r",
                            "author": "333646",
                            "score": 1,
                            "created_utc": 1652620471.0,
                            "response": "I think you should not watch the charts in bear market and don't look at portfolio as well it will be horrible experience I just saw my portfolio it is bleeding and it is down by 79% even after buying the continuous dip",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8ohfbc",
                    "author": "Jezzes",
                    "score": 1,
                    "created_utc": 1652609192.0,
                    "response": "Always",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ovt8g",
                    "author": "Marsi30og",
                    "score": 1,
                    "created_utc": 1652619452.0,
                    "response": "I just bought some crypto like a fool",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8oxae1",
                            "author": "ErosTHE",
                            "score": 2,
                            "created_utc": 1652620273.0,
                            "response": "And why you think you are fool? I mean when you bought them what was your target or you loss excpectations? I mean you bought an X amount and you were planing to keep them until ? What was your initial target before entering the market.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8p5seh",
                    "author": "meat-head",
                    "score": 1,
                    "created_utc": 1652624594.0,
                    "response": "I DCA weekly. But I’m waiting for 19999 to go nuts",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8pbjaj",
                    "author": "mikelthepina",
                    "score": 1,
                    "created_utc": 1652627227.0,
                    "response": "Johnny Depp",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8px440",
                    "author": "Hank___Scorpio",
                    "score": 1,
                    "created_utc": 1652636658.0,
                    "response": "Green candle? Red candle? Who gives a shit.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8py6di",
                            "author": "ErosTHE",
                            "score": 1,
                            "created_utc": 1652637126.0,
                            "response": "Those who work in church I guess....",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8pya7t",
                                    "author": "Hank___Scorpio",
                                    "score": 1,
                                    "created_utc": 1652637172.0,
                                    "response": "Happy! The green candles yours. Bears are gonna choke!!",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8pyfmo",
                                            "author": "ErosTHE",
                                            "score": 1,
                                            "created_utc": 1652637238.0,
                                            "response": "I hope so,  need my longs to be triggered :)",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8pykmf",
                                                    "author": "Hank___Scorpio",
                                                    "score": 1,
                                                    "created_utc": 1652637299.0,
                                                    "response": "Um excuse me sir that's not the next line.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8oesda",
                    "author": "BobBreak",
                    "score": -1,
                    "created_utc": 1652606907.0,
                    "response": "Will it ever come up again?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8ofswu",
                            "author": "ErosTHE",
                            "score": 1,
                            "created_utc": 1652607784.0,
                            "response": "We don't know, we are speculators.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8w1h1c",
                                    "author": "tunahantek",
                                    "score": 1,
                                    "created_utc": 1652747902.0,
                                    "response": "We are just watching charts, this game is played by whales there dominance has also increased when compared to retail investors, whales are in the ratio of 7:3",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8w1kvh",
                            "author": "doodfarning600",
                            "score": 1,
                            "created_utc": 1652747955.0,
                            "response": "Yeah when we will see bull Run next time we will see bear market like this and it will be them time when millionaires are made because they don't miss the opportunity to buy the dip which is sale in reality",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8oflk3",
                            "author": "Adventurous_Garlic58",
                            "score": 0,
                            "created_utc": 1652607611.0,
                            "response": "Yes",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8ozgqa",
                    "author": "Sad-Mango-3508",
                    "score": 0,
                    "created_utc": 1652621458.0,
                    "response": "NO I'm waiting this has the potential to drop to 16k or 19k",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8p2yin",
                            "author": "ErosTHE",
                            "score": 1,
                            "created_utc": 1652623235.0,
                            "response": "I see.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}