{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uvqor6",
            "title": "Buy the dip and hold on",
            "url": "https://i.redd.it/rgf9q7u955191.jpg",
            "author": "Mediocre_Suspect_203",
            "created_utc": 1653274798.0,
            "score": 516,
            "num_comments": 107,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9n34ol",
                    "author": "nullama",
                    "score": 46,
                    "created_utc": 1653275098.0,
                    "response": "If you keep your bitcoin in your own cold storage and you're not concerned about the short term price, hodl looks like the first picture.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9nyxl5",
                            "author": "ElephantsAreHeavy",
                            "score": 6,
                            "created_utc": 1653299174.0,
                            "response": "This is the only correct answer. Invest money you do not need, do not leave it on the exchange. No news made me worried, I lost (on paper) the equivalent of multiple years of income. I am happy to have the bitcoin.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9owftv",
                                    "author": "im_noman",
                                    "score": 3,
                                    "created_utc": 1653318700.0,
                                    "response": "Good to hear that from the people who has been holding this long.\n\nMake it last long because none knows what the future would bring. A good positive trend is what we look for!",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9przk0",
                                            "author": "grthryjrgwe",
                                            "score": 1,
                                            "created_utc": 1653332039.0,
                                            "response": "Yeah man it's really good, it's giving a lot of motivation.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i9oxn8c",
                                            "author": "ElephantsAreHeavy",
                                            "score": 0,
                                            "created_utc": 1653319227.0,
                                            "response": "When in doubt, zoom out. I was negative for quite a bit during the 2018 bear market. I kept buying. I regret nothing. \n\nI keep bitcoin as a part of a diversified portfolio. Many people would say that I keep too large a % in bitcoin, I disagree. The % of bitcoin in my investment portfolio is well under 50%. Yes, I am privileged.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9rt455",
                                                    "author": "geelucke",
                                                    "score": 1,
                                                    "created_utc": 1653367438.0,
                                                    "response": "That's what I do when I feel like selling, it's time to hold.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9ocf3s",
                                    "author": "4reddityo",
                                    "score": 2,
                                    "created_utc": 1653308980.0,
                                    "response": "Why not on exchange?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9odwni",
                                            "author": "ElephantsAreHeavy",
                                            "score": 3,
                                            "created_utc": 1653309831.0,
                                            "response": "Essentially: Counterparty risk. \n\n&#x200B;\n\n1) With bitcoin, there is no need to use a third party to store your coins, so why would you?\n\n2) Exchanges are unregulated, as far as their crypto side is concerned, in contrast to banks where you keep your fiat that are very regulated. \n\n3) In case of an adverse event with an exchange, such as a lack of liquidity or straightup bankruptcy, your money will be used as a bail-in, with little chances of getting it back. \n\n4) In case you happen to log in from an IP address from a location that is not liked by the country in which the exchange is registered, or a geopolitical situation changes, the exchange can seize your money without due process. Just ask russian users of mainstream exchanges. \n\n5) In case your name occurs on a list of individuals not liked by the country in which the exchange is registered, or someone, somewhere made an administrative error, your funds will no longer be accessible to you. \n\n&#x200B;\n\nThe added risk of doing self custody is that you are responsible for your security, and you need to know what you are doing.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9refjt",
                                                    "author": "noxGOX_45",
                                                    "score": 1,
                                                    "created_utc": 1653359180.0,
                                                    "response": "Thanks for mentioning these important points mate, I was thinking to get a hardware one and you have made that shit pretty clear now, really appreciate this brother.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9odnak",
                                            "author": "LKZToroH",
                                            "score": 2,
                                            "created_utc": 1653309684.0,
                                            "response": "Not your keys, not your wallet. Let's pretend something bad happen with the exchange, then they block everyone money because they actually don't keep your money there, they reinvest it to get more money for themselves. This means you lost access to your money unless you hire a lawyer.  \nAnother situation is that they can block you on \"suspicion\" of someone trying to steal your money.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9qguqw",
                                                    "author": "carluspocus",
                                                    "score": 3,
                                                    "created_utc": 1653342908.0,
                                                    "response": "Indeed a better and wise option though just look forward for holding your coins and not keeping them in an exchange!",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i9p5447",
                                                    "author": "ianyboo",
                                                    "score": 3,
                                                    "created_utc": 1653322380.0,
                                                    "response": "There are daily threads here from people who gave their genuine best effort to take self custody and lost everything due to a mistake. Often something ***very*** hard to anticipate. One guy a few weeks ago had their computer pick up a nasty malware that looked specifically for crypto keys and would change them to a new address without any visual sign that the text has been altered. He lost everything.\n\n\"Everyone get your coins off the exchanges\" fails to take into account the actual reality of what happens. Some people actually ***are*** better off with their coins held securely on an exchange. It's actually pretty rare these days to see people using a major exchange come here and say \"help! I lost everything!\" Especially with the daily onslaught of folks doing self custody losing everything.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9ridty",
                                                            "author": "BennyBvB",
                                                            "score": 4,
                                                            "created_utc": 1653361181.0,
                                                            "response": "Damn man, you have written it in a pretty lengthy way.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9rnwbt",
                                                                    "author": "ianyboo",
                                                                    "score": 1,
                                                                    "created_utc": 1653364214.0,
                                                                    "response": "My wife is currently laughing at your comment: \"Try living with him for a few years... he never shuts up...\" apparently you speak the truth lol",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "i9puoeh",
                                                            "author": "aspecro",
                                                            "score": 1,
                                                            "created_utc": 1653333191.0,
                                                            "response": "I'm worried something like that will happen to me, that's kinda what's been keeping me from buying a Ledger Nano X. I'm not technologically impaired or anything, I just know a simple misstep could cause me to lose all my sats. But again, keeping them on Coinbase could cause me to also lose all my sats if shit were to go down.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9pvlcx",
                                                                    "author": "ianyboo",
                                                                    "score": 4,
                                                                    "created_utc": 1653333582.0,
                                                                    "response": "Judging purely based on the horror/sob stories I've read here over the past few years it seems to be wildly more likely that a person will lose their coins in an attempt to take self-custody over keeping them on a major exchange. \n\nThe way I look at it, The major exchanges are making tons and tons of money and it's in their best interest to hire people who are vastly more competent than I am when it comes to digital security and all the ins and outs of the current state of the art. I can spend the next 1000 hours learning everything I can about digital crypto security And probably do a pretty good job of self custody... But then what? What about 6 months from now when everything is changing? I just don't have the time or energy to keep up to date. \n\nI will let the experts handle it Thank you very much :)",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i9ogph3",
                                                    "author": "4reddityo",
                                                    "score": 1,
                                                    "created_utc": 1653311337.0,
                                                    "response": "Holy Shit!! Ummm so I’m on coinbase and robinhood. How do I change?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9ojhb8",
                                                            "author": "wutopp",
                                                            "score": 1,
                                                            "created_utc": 1653312748.0,
                                                            "response": "Get a trezor or similar hardware wallet",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "i9otprf",
                                                            "author": "LKZToroH",
                                                            "score": 1,
                                                            "created_utc": 1653317499.0,
                                                            "response": "As the other guy said, get a hardware wallet. I've heard of software wallets that you can host on your own machine but I know nothing about it tbh",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9ovtbj",
                                                                    "author": "Ar0war",
                                                                    "score": 1,
                                                                    "created_utc": 1653318425.0,
                                                                    "response": "No. \n\nSoftware wallets are fine if you plan to move some sats but do not hodl your Bitcoin in a wallet installed on your PC EVER. No. Never. \n\nI have some sats on my windows Wallet (Electrum in my case), but i would never put my holdings on it.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9oxgzp",
                                                                            "author": "LKZToroH",
                                                                            "score": 1,
                                                                            "created_utc": 1653319153.0,
                                                                            "response": "I guessed it wasn't a good idea anyway lmao.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        },
                                                                        {
                                                                            "id": "i9qt4bl",
                                                                            "author": "willtopol",
                                                                            "score": 1,
                                                                            "created_utc": 1653348813.0,
                                                                            "response": "Thanks for saying that, I am glad to see this now man.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "i9ppmu4",
                                                                    "author": "pshaxe1969",
                                                                    "score": 1,
                                                                    "created_utc": 1653331018.0,
                                                                    "response": "Nah I will still say that you guys gotta buy a hardware one, software won't gonna do something that hardware wallets can do at the end of the day my brother.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "i9rnquj",
                                                            "author": "istmike",
                                                            "score": 1,
                                                            "created_utc": 1653364124.0,
                                                            "response": "Just get a hardware wallet my friend, personal wallets are something better and those devices will give you a good level of privacy, you better get one of those hardware wallets.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9q3i94",
                                            "author": "headgsket",
                                            "score": 1,
                                            "created_utc": 1653336961.0,
                                            "response": "Why not hold why you would go for exchange just tell me this at first!",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9qdmwg",
                                                    "author": "4reddityo",
                                                    "score": 1,
                                                    "created_utc": 1653341428.0,
                                                    "response": "Huh?",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9ofgr7",
                            "author": "Leading-Fail-7263",
                            "score": 1,
                            "created_utc": 1653310685.0,
                            "response": "Why can’t it also be the case for a hot wallet that is your own?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9otabw",
                                    "author": "nullama",
                                    "score": 1,
                                    "created_utc": 1653317313.0,
                                    "response": "Hot wallets are insecure because you can get malware hijacking your device.\n\nAt a bare minimum they could swap the BTC address that you copy/paste (this happens)",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9pzejq",
                            "author": "oODantheManXx",
                            "score": 1,
                            "created_utc": 1653335202.0,
                            "response": "Bitcoin was indeed made for the long run though we ought to see things for the further future though!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9n93an",
                    "author": "Background-Fun-5646",
                    "score": 6,
                    "created_utc": 1653278457.0,
                    "response": "It’s so cute when people find this meme for the 1st time 🥰",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ofaew",
                            "author": "tvmove",
                            "score": 1,
                            "created_utc": 1653310589.0,
                            "response": "This was indeed posted earlier too and I have this image saved in my gallery though!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9qkmk0",
                                    "author": "qwestbase77",
                                    "score": 1,
                                    "created_utc": 1653344684.0,
                                    "response": "I am glad that I am not one of those people who found this meme so late, we are seeing this for like 1 time every month since last year lol. This meme is repetitive but still it's gold.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9nb514",
                    "author": "IconWorld",
                    "score": 3,
                    "created_utc": 1653279730.0,
                    "response": "yes, it's very important to shut your brain off during these times.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9pmwa4",
                            "author": "mercstills",
                            "score": 1,
                            "created_utc": 1653329848.0,
                            "response": "Better though just think of making it long term and just be patient enough!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9ob15g",
                    "author": "NoSohoth",
                    "score": 3,
                    "created_utc": 1653308156.0,
                    "response": "Re: Fwd: Fwd: Re: Re: Fwd: Re: Re: Fwd: Re:",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9oeibx",
                            "author": "DirtyPolecat",
                            "score": 1,
                            "created_utc": 1653310164.0,
                            "response": "This one does have a fair amount of bit rot.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9pkryt",
                            "author": "lag0255",
                            "score": 1,
                            "created_utc": 1653328939.0,
                            "response": "Is that some kind of code word you are using? Like I didn't get you!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9ngf47",
                    "author": "Llonga",
                    "score": 6,
                    "created_utc": 1653283278.0,
                    "response": "Yeah I’ve never got this meme. Hodling is the easiest thing to do. You literally do nothing!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9opp07",
                            "author": "urbste",
                            "score": 1,
                            "created_utc": 1653315705.0,
                            "response": "But still people do not get this thoughts well enough that clearly though!\n\nHolding is what a globally accepted solution for the long run no matter we come through obstacles but we need to make that out!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9r8mb5",
                                    "author": "Marek0504",
                                    "score": 1,
                                    "created_utc": 1653356405.0,
                                    "response": "Holding is not something easy if people are seeing that as a tough task, we better understand that it's not something tough it's just something we all can do with patience, nothing else.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9o3om9",
                    "author": "Thicasripper9k",
                    "score": 2,
                    "created_utc": 1653303162.0,
                    "response": "That's if u put in more money than you can afford to lose.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9po3mm",
                            "author": "luna1939",
                            "score": 2,
                            "created_utc": 1653330358.0,
                            "response": "Just wait for the right time don't be too early to put money.\n\nYou are money is indeed safe if you look for long term nevertheless worry less :)",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9nk2fs",
                    "author": "Comewhatevermaycry4",
                    "score": 2,
                    "created_utc": 1653285972.0,
                    "response": "The slope is going the wrong way",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9pphl7",
                            "author": "Starfordo",
                            "score": 1,
                            "created_utc": 1653330955.0,
                            "response": "Like no the wrong it just indicates the ups and downs we need to face and what holding actually feels like!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9nob9f",
                    "author": "Stunning-Ad-1208",
                    "score": 1,
                    "created_utc": 1653289401.0,
                    "response": "An opportunity that was once a fear is now my full-time career.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9p9zdu",
                            "author": "jeffw601",
                            "score": 1,
                            "created_utc": 1653324405.0,
                            "response": "Hahaha good to hear that positivity coming up though just loved it! Keep going man",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9nt62r",
                    "author": "Zetalos",
                    "score": 1,
                    "created_utc": 1653293793.0,
                    "response": "To me it is the first picture. But on the beach, beneath a palm tree enjoying a cold beverage.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9o4br2",
                            "author": "generateduser29128",
                            "score": 2,
                            "created_utc": 1653303649.0,
                            "response": "You probably either have a lot or very little",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9qx6qd",
                                    "author": "smaraux",
                                    "score": 1,
                                    "created_utc": 1653350824.0,
                                    "response": "True though just time will speak from little he can gain a lot and from a lot he can gain a lot more.\n\nTime will speak and how long he holds keeping enough patience that would indeed matter too!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9q2frh",
                            "author": "qfman",
                            "score": 1,
                            "created_utc": 1653336496.0,
                            "response": "That depends though about which path the people choose!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9o22yp",
                    "author": "drluppo",
                    "score": 1,
                    "created_utc": 1653301885.0,
                    "response": "300%",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9qnx7k",
                            "author": "LordVelimir",
                            "score": 2,
                            "created_utc": 1653346267.0,
                            "response": "300% what you talking about the reality behind the meme? Or the surety you are giving to hold!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9o3smx",
                    "author": "Mas113m",
                    "score": 1,
                    "created_utc": 1653303249.0,
                    "response": "Same as any investment during bear markets for me:\n\n1. Make certain my investment thesis is intact\n2. Crank up my DCA until it hurts\n3. Try not to think about or look at the price\n\nThe advice is always to not be emotional with investing. I just use it to my advantage. Feeling happy about my financial situation? That probably means values are high so just stick to regular DCA. Feeling sad about my financial future? This means it is the time to buy more. Crank up the DCA, throw whatever extra fiat at it. I use this for all my investing, BTC, real estate, stocks. As the famous quote goes, \"You make most of your money in a bear market, you just don't know it at the time\". This keeps me from doing anything stupid at bottoms and keeps me from overbuying at highs. The regular DCA is because I do not know what the future holds. I do not pretend to think I can time markets, thus the DCA, but I do know my happy/sad market indicator works to make me stick it out and to increase my assets when prices are best.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9oz701",
                            "author": "svcorp77",
                            "score": 1,
                            "created_utc": 1653319884.0,
                            "response": "Inflation and deflation being a part of the game though.\n\nThis just gives us an indication of wether to buy or sell though!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9pqj6z",
                                    "author": "Mas113m",
                                    "score": 1,
                                    "created_utc": 1653331408.0,
                                    "response": "always are with any investment.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9rvrv3",
                                    "author": "joz1975",
                                    "score": 1,
                                    "created_utc": 1653369270.0,
                                    "response": "Damn I really want BTC to beat the inflation shit for life.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9o4dkc",
                    "author": "Hodl_it",
                    "score": 1,
                    "created_utc": 1653303686.0,
                    "response": "If you are only investing the money you don't care to lose, With Bitcoin, you will not have a rough journey at all.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9qoy7b",
                            "author": "scwosh21",
                            "score": 3,
                            "created_utc": 1653346767.0,
                            "response": "Rough journey like yeah it won't be but at some point it might too depends on how bold and courageous the person is!",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9pkml3",
                            "author": "LiteratureUsual614",
                            "score": 1,
                            "created_utc": 1653328876.0,
                            "response": "I bought btc with money I was ready to lose back in 2015. It turned into money I’m not ready to lose at all!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9o9is1",
                    "author": "dogboyboy",
                    "score": 1,
                    "created_utc": 1653307213.0,
                    "response": "Don’t look at the price and hodling is like the first picture.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9rlzv6",
                            "author": "ysiioxfo",
                            "score": 1,
                            "created_utc": 1653363111.0,
                            "response": "True though bother less have patience more because that would take you more further!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9oc5ic",
                    "author": "scottmsul",
                    "score": 1,
                    "created_utc": 1653308823.0,
                    "response": "I'd say it's the opposite. All my normie friends keep asking if I'm worried about the price going down. But the number of coins on my wallet hasn't changed at all.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9rjyrx",
                            "author": "akikingbtce",
                            "score": 3,
                            "created_utc": 1653361995.0,
                            "response": "Just stay calm and keep quiet sometimes indeed silence is the best answer!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9ojew4",
                    "author": "Da0ptimist",
                    "score": 1,
                    "created_utc": 1653312714.0,
                    "response": "What is the flag at the end there?\nIs that when you sell?\nIs it a straight line from there?\n\nLike what even is this meme?\n\nMissing the point if bitcoin",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9qc99y",
                            "author": "BITHIGHCOIN",
                            "score": 0,
                            "created_utc": 1653340809.0,
                            "response": "He missed many points and we can't mention all of em.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9ojfh3",
                    "author": "saltyload",
                    "score": 1,
                    "created_utc": 1653312722.0,
                    "response": "Actually the top pic is exactly what its like to hold…bottom picture  is the pussies",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9qpwgs",
                            "author": "the_2_jammer",
                            "score": 4,
                            "created_utc": 1653347226.0,
                            "response": "I just had a fucking laugh because of your comment lol.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9ojo5o",
                    "author": "lordstickmax",
                    "score": 1,
                    "created_utc": 1653312847.0,
                    "response": "i just treat it like a 401k and have a recurring buy",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9pym8g",
                            "author": "davidtomczak80",
                            "score": 1,
                            "created_utc": 1653334866.0,
                            "response": "Damn this is something new to me lol,  thanks for that.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9orgbx",
                    "author": "Dimev1981",
                    "score": 1,
                    "created_utc": 1653316502.0,
                    "response": "The funniest part about about that graph is the lie of a finish line lmao!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9rhfic",
                            "author": "Landho01",
                            "score": 1,
                            "created_utc": 1653360697.0,
                            "response": "Lol yeah, we all know that it's never gonna end lmao.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9osxkf",
                    "author": "volhall",
                    "score": 1,
                    "created_utc": 1653317157.0,
                    "response": "If you bought crypto and has a solid intention to HODL, then I don't see any problems and difficulties in this. Another thing is to speculate on the rise and fall of prices. This is really extremely difficult but you shouldn't equate these things.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9reeq3",
                            "author": "bsham84",
                            "score": 3,
                            "created_utc": 1653359169.0,
                            "response": "Thanks for telling the truth to me now mate, I really wanted to see something like that, I am glad that I saw this meme today, had a laugh after a pretty long time but this comment is gold.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9ousgp",
                    "author": "OceanSlim",
                    "score": 1,
                    "created_utc": 1653317975.0,
                    "response": "There's a finish line?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ovvds",
                    "author": "Corona_DIY_GUY",
                    "score": 1,
                    "created_utc": 1653318450.0,
                    "response": "2018-2020 was pretty rough.  A lot of 'hey, do you still have your bitcoin' sparky conversations at work or family gatherings.\n\nNow they're more like, 'what's it at now? That low? Are you gonna sell?'\n\nH E to the double hockey sticks no.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9pxiux",
                    "author": "Hospital_Slow",
                    "score": 1,
                    "created_utc": 1653334403.0,
                    "response": "Or short it and make money.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9qd2tn",
                    "author": "lorddiablo86",
                    "score": 1,
                    "created_utc": 1653341175.0,
                    "response": "We all know that it's really tough to hold for a fucking long time but we have to do that for a good beautiful future, I hope people will understand what I am trying to say now.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ql9je",
                    "author": "Zubakin",
                    "score": 1,
                    "created_utc": 1653344991.0,
                    "response": "I guess this was posted few weeks ago though I remember that roughly.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9qoee3",
                    "author": "aknotio",
                    "score": 1,
                    "created_utc": 1653346499.0,
                    "response": "Hold and just hold and more important, invest every fucking week, these two things will help us in coming years if we do that in a correct manner, good luck for the future.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9qrl5x",
                    "author": "Ghost_Lawless",
                    "score": 1,
                    "created_utc": 1653348058.0,
                    "response": "I hope people will still hold for a long period because that's what we all need at the end of the day, we gonna be so happy in coming 10 or 15 years if we hold in a good manner.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9qs57w",
                    "author": "BpzID",
                    "score": 1,
                    "created_utc": 1653348328.0,
                    "response": "Man this is just making me cry now because I am holding for a long time and I don't think I can hold more than this but still I know that I have to hold for a bit more long these days.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9qxysu",
                    "author": "domofsteel",
                    "score": 1,
                    "created_utc": 1653351223.0,
                    "response": "Amen! 🙏🏾",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9qyk4f",
                    "author": "Cronos919",
                    "score": 1,
                    "created_utc": 1653351524.0,
                    "response": "I wish you added family pressure in this because I am facing that issue like hell these days, I can't even do anything because of that shit man, it's just so fucked up to me.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9rbaz1",
                    "author": "lenkaprius",
                    "score": 1,
                    "created_utc": 1653357678.0,
                    "response": "Hold more you all we can't see other people being that weak okay, we are here to prove that we will hold and we all will win together, so don't worry about anything else now.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}