{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uv5sgc",
            "title": "How is crypto the \"Freedom\" money?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/uv5sgc/how_is_crypto_the_freedom_money/",
            "author": "yalisa67",
            "created_utc": 1653203778.0,
            "score": 27,
            "num_comments": 38,
            "subreddit": "BitcoinBeginners",
            "selftext": "Quite new to Bitcoin and other crypto, but initially, it sounded like crypto is the freedom money - private, untraceable, untaxable, take it anywhere, use it however you like. But how it is private if KYC verification is a requirement to buy on most, if not all, exchanges? How is it private if all transactions are 100% traceable? Isn’t it exactly the opposite of what crypto was aspiring to be, the “freedom” money? The more I read and think about it, the more is seems quite the opposite: the global, digital money that can be easily controlled - say/do the opposite of current narrative, don't comply/disagree with the next \"thing\", wrong nationality/race/citizenship, etc and just like your bank account, your crypto wallet is also \"frozen\", no?",
            "stickied": false,
            "comments": [
                {
                    "id": "i9jk5eg",
                    "author": "bitusher",
                    "score": 12,
                    "created_utc": 1653208342.0,
                    "response": "Bitcoin onchain is pseudonymous which means that transactions by default are not linked to your personal identity. Thus you can choose to have the bitcoin linked to your ID or not depending how you use it. \n\nKeep in mind that over 99% of transactions occur offchain or on other layers though that have different levels of privacy and chain analysis is not possible . For example if you use Bitcoin in a lightning wallet(how you would normally spend bitcoin for day to day things)  chain analysis is useless and you are very private because its multihop and onion routed by default. \n\nThere are also many ways to buy or get bitcoin without ID but this is not needed because even if you initially bought bitcoin with ID its trivial to regain your privacy after the fact",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9jmc5t",
                            "author": "yalisa67",
                            "score": 3,
                            "created_utc": 1653210367.0,
                            "response": "Thank you for taking the time to reply! I'm still in research phase and yet to learn a lot. I haven't bought any crypto yet, trying to figure out the best way to do it for my main goals -  hold and hopefully gain, and in case of need, for example if moving countries, not having to pay tax twice (income tax 1st time, tax on taking money out of the country 2nd time). \n\nAt the very tip of the iceberg \"knowledge\" I have, it just seems if I go and buy on exchange right now, the tax man will straight away take note and will send me a bill the moment I board the plane. I'm exaggerating, of course, but taking substantial amounts of money from one country to another without incurring losses seems tricky. So I thought perhaps crypto, as volatile as it is and as risky as that would hence be, could present a solution, but maybe not so, if one didn't initially buy without ID.\n\nOther than cash, what other ways are there to buy/get crypto without ID, if you don't mind sharing?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9jn5h1",
                                    "author": "bitusher",
                                    "score": 4,
                                    "created_utc": 1653211133.0,
                                    "response": "If you are merely concerned about longterm privacy than you are likely overthinking things and the solution is rather simple.\n\n1)\tWithdraw your btc from exchange to wallet A(mobile wallet) , than send to wallet  wallet B(example - HW wallet) within a few hours and never in reverse you create more plausible deniability which is good for privacy and tax reasons. Make sure you send the entire amount each time as well. \n\n2)\tWhen you are ready to spend your bitcoin in your hardware wallet there are many ways to sell or spend the bitcoin very privately like loading the bitcoin up in a lightning wallet where chain analysis cannot track those UTXOs offchain. \n\nWith Chainanalytics exchanges and regulators are using probabilistic guess work in tracking transactions onchain. They merely assume your withdraw address likely belongs to you. By sending the bitcoin from wallet A to wallet B within a few hours you are creating plausible deniability and adding in significant doubt those UTXOs(bitcoin) belong to you and doing so in such a small window that the price change is moot to avoid creating a taxable event. At any time in the future you can privately spend the bitcoin or sell it for fiat in a private manner. \n\n>Other than cash, what other ways are there to buy/get crypto without ID, if you don't mind sharing?\n\nmany ATMs don't require ID and just sms verification - coinatmradar.com\n\nOther options are any way that doesn't require verification like this list -\n\nhttps://github.com/cointastical/P2P-Trading-Exchanges\n\nYou can also get bitcoin for selling a good or service , mining bitcoin , using a DEX , p2p for cash",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9jq1e7",
                                            "author": "yalisa67",
                                            "score": 2,
                                            "created_utc": 1653213786.0,
                                            "response": "Thank you so much, that is all very enlightening and helpful. Indeed, probably paralysis by analysis with insufficient data ))\n\nI just thought if I follow this path and want to sell for fiat later, even if there is more than 1 wallet, isn't it all traceable back to me still: \n\nBank account (ID) -> Exchange (ID) -> Wallet A (hot) -> Wallet B (cold/HW) -> Wallet (lightning)... then what? How does one sell it privately without exchange and eventually back to bank account? I understand more and more places accept crypto as a valid way of payment now, but what if one wanted to say, buy a house? \n\n&#x200B;\n\n>many ATMs don't require ID and just sms verification - [coinatmradar.com](https://coinatmradar.com)   \n>  \n>https://github.com/cointastical/P2P-Trading-Exchanges\n\nThank you for these resources, will def check them out! As well as DEX and p2p for cash options.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9k38wy",
                                                    "author": "bitusher",
                                                    "score": 2,
                                                    "created_utc": 1653223720.0,
                                                    "response": ">but what if one wanted to say, buy a house? \n\nAny item you buy that is registered , house , land, car, boat, atv ... You need to pay taxes on because the item is registered to your name and they will wonder where you came up with that money\n\nmost items you buy are not registered",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9l1kgf",
                    "author": "Madteklynd",
                    "score": 2,
                    "created_utc": 1653239599.0,
                    "response": "You're asking a genuine question, but you are atleast 30 hour of education away from needing to ask Ina forum such as this. You don't even understand the most fundamental thing about crypto. I'm not trying to be a dick. Go to saylor.org and do the bitcoin for everyone course, it's 12 hours",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9loyj3",
                            "author": "Vehron_Official",
                            "score": 1,
                            "created_utc": 1653250045.0,
                            "response": "So is this what everyone should do before using a currency built on the promise of privacy and individuality?., to take a 12 hour course?.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9jgvge",
                    "author": "parchence",
                    "score": 4,
                    "created_utc": 1653205358.0,
                    "response": "purchase for cash in person and spend in shop, so even if every transaction is traceable, it's only tied to a btc address. In case of severe surveilance it could trace your ip address, but using tor to connect to a node's gonna help.\n\n\nBasically governments did their best to make handling bitcoin in privacy as difficult as possible, but not impossible...",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9jilgz",
                            "author": "yalisa67",
                            "score": 2,
                            "created_utc": 1653206918.0,
                            "response": "Thank you for your reply! Yes, I was thinking to buy for cash, but not sure if it's available in Australia yet. Yet to learn a lot, but looks like I'm on the right path :)",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9k9qe7",
                                    "author": "Matt-Mathews",
                                    "score": -3,
                                    "created_utc": 1653227261.0,
                                    "response": "Try localbitcoins.com",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9ke8r6",
                                            "author": "bitusher",
                                            "score": 3,
                                            "created_utc": 1653229484.0,
                                            "response": "Local bitcoins now requires ID \n\nhere is a better list \n\nhttps://github.com/cointastical/P2P-Trading-Exchanges",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9jmzfy",
                    "author": "BTCMachineElf",
                    "score": 3,
                    "created_utc": 1653210975.0,
                    "response": "It's not private. But it is uncensorable and unconfiscatable, spendable globally and infinitely transportable. There's a lot of freedom in that.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9jqocg",
                            "author": "yalisa67",
                            "score": 2,
                            "created_utc": 1653214353.0,
                            "response": "Thank you for your input! I am learning still ) So far I am researching ways to buy and own crypto privately, so your wallet cannot be traced back to you. Because if it can be traced, then if not confiscated, it can be \"frozen\", just like bank account, no?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9jytsc",
                                    "author": "putyograsseson",
                                    "score": 1,
                                    "created_utc": 1653220860.0,
                                    "response": "as long as you use bitcoin and control your own private keys through a non-custodial wallet, your coins can not be frozen, as that is the whole point of bitcoin\n\nif they could, then the project would be a failure",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9k1k96",
                                            "author": "yalisa67",
                                            "score": 2,
                                            "created_utc": 1653222686.0,
                                            "response": "Ok, I am not sure about HW/cold wallets, but say one is keeping their coins on a hot wallet, that is clearly identifiable to a particular individual as the coins were put there by a conversion from a Bank Account (ID) -> Exchange (ID) -> Wallet. Wouldn't that wallet (app essentially, owned by 3rd party) be able to freeze/block activity by their user?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9k2bgb",
                                                    "author": "BTCMachineElf",
                                                    "score": 3,
                                                    "created_utc": 1653223152.0,
                                                    "response": "Why would anyone choose a wallet that could control their funds. Do nor use a custodial wallet. Keep your bitcoin on your own private key and no one can stop you from spending it however you wish.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9k2xnu",
                                                            "author": "yalisa67",
                                                            "score": 2,
                                                            "created_utc": 1653223533.0,
                                                            "response": "Wouldn't that be the case with anything that involves a 3rd party, or even a 2nd party? Be it a wallet app or a bank account? Very well may be that I don't understand something as I am very new to this, but the way I see it now is any app is created by a developer, i.e. a 3rd party, therefore that 3rd party can control it, no?",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9kn4r1",
                                                                    "author": "civilengineer4",
                                                                    "score": 5,
                                                                    "created_utc": 1653233514.0,
                                                                    "response": "First off,\nBitcoin or any crypto are not ever on a wallet, whether it is hardware or software. The crypto always lives on the blockchain. If you use a non custodial wallet, the funds can’t be confiscated or taken by anyone else unless you give them your private key or phrase. That is the key to access your coins. You can use any wallet you want that uses bip39. You can even use the same keys on multiple wallets if you want. All the wallets do is give you an interface to access your funds on the blockchain. You want to be very careful where you type in or have your private key/phrase located.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                },
                                                                {
                                                                    "id": "i9k5om7",
                                                                    "author": "putyograsseson",
                                                                    "score": 2,
                                                                    "created_utc": 1653225128.0,
                                                                    "response": "No, the wallet which you choose should be completely open source, so that nothing shady inside the code could lead to your funds being frozen/stolen by the developers.\n\nEvery reputable software/hardware wallet in existence works by this rule.\n\nFor example, bitbox02 is a hardware wallet that is open source.\n\nThe team publishes all of the code on GitHub, from firmware of the device, to companion wallet app.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9jsz8y",
                    "author": "Severe_Bluebird_184",
                    "score": 2,
                    "created_utc": 1653216355.0,
                    "response": "₿itcoin is often dubbed “freedom money”. This is partly because Bitcoin is free from the influence of central banks. Unlike fiat currencies, Bitcoin's maximum supply is capped, meaning your savings in Bitcoin cannot be diluted through inflation",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9k2kde",
                    "author": "Zealousideal_Raise81",
                    "score": 1,
                    "created_utc": 1653223303.0,
                    "response": "Forget any other „crypto“. There is Bitcoin and then there is shitcoin. Look up the story of Luna and their UST token. Everything other then Bitcoin is the same bullshit, no exception.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9k6z4x",
                    "author": "caron3979",
                    "score": 1,
                    "created_utc": 1653225822.0,
                    "response": "Banking services do not give you anonymity, they cannot protect you. Bitcoin gives you all this and the whole process depends only on you. You are not listening to the ga of the state.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9jf2bs",
                    "author": "AutoModerator",
                    "score": 0,
                    "created_utc": 1653203779.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ks4iw",
                    "author": "ShoelessMoose",
                    "score": 1,
                    "created_utc": 1653235674.0,
                    "response": "Bitcoin is all you need to worry about if you care about freedom",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9kv3hm",
                    "author": "MrQ01",
                    "score": 1,
                    "created_utc": 1653236950.0,
                    "response": "Bitcoin is pseudonymous and so doesn't advertise itself as being private (and in fact doesn't advertise itself at all). Otherwise, being a public blockchain would go against that. What Bitcoin doesn't require is for you to provide your name and address in order to own a wallet and start owning and trading Bitcoin.\n\nIt is free because Bitcoin does not require you to participate with exchanges - these are \"middlemen\" which are only a recent phenomena, and normally fall under particular jurisdictions and so have to play by their rules.\n\nAnd that is what happens when decentralisation interacts with centralised ecosystems. And so if you don't like your localised area's rules and requirements, that's you're responsibility to resolve and not Bitcoin's. You can avoid doing KYC by simply not dealing with exchanges, and instead trade via P2P and over the counter trading. Governments cannot control your (hardware) wallet.\n\nIf people instead decide they want the full benefits of centralisation and so are fine to do KYC then that is also their right. The point of decentralisation is that it is up to the individual to choose.\n\nIt's not even relevant what Satoshi originally wanted, and he has voluntarily given up control.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9kxc5d",
                    "author": "Coco_Ardo",
                    "score": 1,
                    "created_utc": 1653237850.0,
                    "response": "its not. Bitcoin is.\n\ncrypto is scam",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9lhixw",
                    "author": "RonTOWK",
                    "score": 1,
                    "created_utc": 1653246642.0,
                    "response": "Crypto is a bunch of fat virgin dudes in their 30s talking about how fiat is dead while using fiat to get their 13 bags of cheetoosand 8 6 packs of monster energy drink",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9lmrz8",
                    "author": "sescobreezy727",
                    "score": 1,
                    "created_utc": 1653249053.0,
                    "response": "Value is derived.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}