{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uimyl4",
            "title": "What exchanges allow for immediate withdrawal to external wallet?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/uimyl4/what_exchanges_allow_for_immediate_withdrawal_to/",
            "author": "makinmoves421",
            "created_utc": 1651717219.0,
            "score": 3,
            "num_comments": 19,
            "subreddit": "BitcoinBeginners",
            "selftext": "Hey guys, I am trying to remember what exchange(s) allow you to purchase/fund account with debit card (US based) and turn around and buy a small amount of BTC, and then immediately be able to transfer the newly purchased BTC to an external wallet address.  I remember I did this last summer if I remember right, and I cannot remember which exchange it was or how I did it unfortunately, as I have been out of the crypto game and on cruise control for a bit now.\n\nLet me know if you guys have any suggestions on how I could do this, without having some multiple day holding period after funding/purchase prior to being able to move it off the exchange and into an external wallet.\n\nThanks!!",
            "stickied": false,
            "comments": []
        },
        {
            "id": "t5u1m8",
            "title": "Is Bitcoin truly resistant to government regulation?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/t5u1m8/is_bitcoin_truly_resistant_to_government/",
            "author": "dmantzoor",
            "created_utc": 1646321204.0,
            "score": 3,
            "num_comments": 34,
            "subreddit": "BitcoinBeginners",
            "selftext": "You hear this point repeated a lot by bitcoin pushers - that bitcoin is resistant to government manipulation, or, in a sense, unbannable. It's almost considered a fact by many in the community.\n\nBut is that *really* true? Bitcoin prices regularly fluctuate in response to government action and rhetoric. Bitcoin proponents on these very reddit threads catastrophize about *this* government or *that* government cracking down on bitcoin. Frankly, as a bitcoin novice, I get the impression that this truism - \"bitcoin is resistant to government manipulation\" - is something people tell themselves but don't actually believe in practice. \n\nPlease let me know if I'm looking at this wrong. This has been a point of confusion for me ever since I started researching crypto.",
            "stickied": false,
            "comments": [
                {
                    "id": "hz704lb",
                    "author": "igadjeed",
                    "score": 6,
                    "created_utc": 1646322183.0,
                    "response": "> Bitcoin prices regularly fluctuate\n\nThe price of Bitcoin may fluctuate for reasons or for no reasons. Bitcoin is not its price. Bitcoin doesn't care how many dollars you paid to buy it",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uj3bs4",
            "title": "DO YOU AGREE WITH GOLDMAN SACHS DECISION TO OFFER THE FIRST-EVER BITCOIN-BACKED SERVICE?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/uj3bs4/do_you_agree_with_goldman_sachs_decision_to_offer/",
            "author": "RubySophie57",
            "created_utc": 1651773779.0,
            "score": 31,
            "num_comments": 11,
            "subreddit": "BitcoinBeginners",
            "selftext": "Goldman Sachs's decision to offer the first-ever Bitcoin Backed Service is seen as a major milestone in boosting institutional Crypto adoptions on wall street. \nDuring an interview with Bloomberg, a Goldman Sachs official said that the company is among the first few banks in history to lend debt against Bitcoin. \nGoldman Sachs stated that the agreement was based on interest in its structure and 24-hour risk management. \n\nBitcoin users can use this type of loan to borrow US dollars by using their Bitcoin as collateral in the bank. If the price falls too low, Bitcoin volatility tends to make this loan very risky and the borrower may be liquidated.\nThe move signals its entry into a new business line in which many crypto- specialized firms want to enter. Goldman Sachs completed the first OTC cryptocurrency transaction by joining forces with crypto investment firm Threedium, Metaloop, Faith Tribe, and Galaxy Digital's trading units. \n\nGoldman Sachs is not the only banking giant that seeks a solid presence in the crypto industry. Currently, the multi-trillion-dollar Black Rock has been in the headlines as it announced plans to launch a blockchain-focused ETF. The firm announced a partnership with the operator of the USDC stable coin.\n\nAccording to Damien Vanderwilt, lending to companies that supply virtual currency as collateral is the next future milestone. Apart from that, other crypto-related products available on Wall Street are wealth management, investment, and trading.\n\nSo what do you think, do you agree with Goldman Sachs?",
            "stickied": false,
            "comments": [
                {
                    "id": "i7gtjme",
                    "author": "igadjeed",
                    "score": 6,
                    "created_utc": 1651780517.0,
                    "response": "> crypto industry\n\nScammers crawling out of the woodwork, like cockroaches scavenging for crumbs. Not relevant to Bitcoin",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7h6e4t",
                    "author": "soul-king420",
                    "score": 3,
                    "created_utc": 1651785740.0,
                    "response": "I have a total of 0% good faith in Goldman Sachs as a bank. So anything they offer I will not accept, im down for any and all bitcoin related banking ventres, but Goldman Sachs is the entity I would trust the least with it.\n\nAny time, literally any singular time there's an issue with the banking industry, Goldman Sachs is somehow involved, either GS or Chase it usually ends up being one or both of them on just about any and every banking scandal that has existed throughout the last few decades. .\n\nSachs was literally investigated, charged, and fined for not only manipulating its customers bank accounts, but for also using those accounts to play very, very dangerous financial games with their customers money, without permission... lost a bunch of money in the process, got charged, sued, and lost, and are still a functioning bank somehow. \n\nThere is no bank I would trust less on the entire planet.\n\nFor a rough summary of their roles in various financial meltdowns since the recession of the early 2000's here's the Wikipedia page: https://en.m.wikipedia.org/wiki/Goldman_Sachs_controversies",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}