{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "urnfi4",
            "title": "Limit order / US/ Lowest fee?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/urnfi4/limit_order_us_lowest_fee/",
            "author": "miamiair92",
            "created_utc": 1652796919.0,
            "score": 2,
            "num_comments": 20,
            "subreddit": "BitcoinBeginners",
            "selftext": "Hello team! I tried searching for this answer but was not getting a clear response…\n\nI’m in the US, want to set a limit buy order and pay the lowest fees possible. I also need to be able to move the Bitcoin off line after it clears. What’s my best option? Coin base pro? Currently I’m using Strike and FTX to buy but I’m feeling like a slave constantly checking prices waiting to buy at my price target.\n\nThanks and HOLD!",
            "stickied": false,
            "comments": [
                {
                    "id": "i8y8a76",
                    "author": "bitusher",
                    "score": 3,
                    "created_utc": 1652798133.0,
                    "response": "On coinbase pro /coinbase advanced trader  you can lower the fee from 0.6% to 0.4% by using a limit order and under advanced section select \"post only\" which forces a maker order",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8ycytd",
                            "author": "miamiair92",
                            "score": 1,
                            "created_utc": 1652800094.0,
                            "response": "That’s the answer I was looking for thank you! To get to pro status do I need to deposit a certain threshold?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8yd6py",
                                    "author": "bitusher",
                                    "score": 2,
                                    "created_utc": 1652800187.0,
                                    "response": "No, its free and same credentials to login as coinbase , just slightly more complicated to use in its UX",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8y5h75",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1652796919.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}