{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ulqclp",
            "title": "USD to bitcoin",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/ulqclp/usd_to_bitcoin/",
            "author": "neoknife9111",
            "created_utc": 1652100098.0,
            "score": 2,
            "num_comments": 29,
            "subreddit": "BitcoinBeginners",
            "selftext": "Hello,\n\nI'm currently using coinbase to buy and and then transfer bitcoin into my personal wallet.  Coinbase wont let me transfer into my personal wallet for about 5-7 business days.  Is a faster method of buying bitcoin to transfer into my Exodus wallet?",
            "stickied": false,
            "comments": [
                {
                    "id": "i7wvlp0",
                    "author": "bitusher",
                    "score": 9,
                    "created_utc": 1652100292.0,
                    "response": "> Is a faster method of buying bitcoin to transfer\n\nYou can use cash app or strike.me with a debit card and instantly withdraw once you have verified \n\n>transfer into my Exodus wallet?\n\nI would personally avoid using exodus for these reasons \n\n1) large attack surface\n\n2) bad security practices \n\n3) missing important features\n\n4) You should never use a wallet in windows or osx without a hardware wallet and if you have a hardware wallet you should avoid exodus regardless. If you cannot afford a hardware wallet than use a wallet in ios or android \n\n5) closed source and not peer reviewed \n\nThis means that at best you have a wallet that is slightly better than using a custodian because you have access to the private keys that you could restore your coins in a separate wallet if their full nodes that support this light client is offline but there might be privacy leaks or exploits and backdoors that allow them or outsiders to steal your coins.\n\nWhat is the point in using cryptocurrency if you ultimately need to have faith in a single company or developer ? This undermines many of the security assumptions of cryptocurrencies.\n\nFor wallets stick to open source wallets and withdraw your bitcoin to them\n\nhttps://walletscrutiny.com\n\nhttps://docs.google.com/spreadsheets/d/1aZ1zbaUEzCo9NCctN8-eL2VLIiSdY009tTJvRXDUWEw/edit#gid=0\n\nhttps://www.reddit.com/r/BitcoinBeginners/comments/g42ijd/faq_for_beginners/",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7x9147",
                    "author": "unvieledloki",
                    "score": 2,
                    "created_utc": 1652106569.0,
                    "response": "if you want instant, can use debit card but their are fees for that",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7wv8ma",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1652100098.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7y31ns",
                    "author": "Particular-Walk-6089",
                    "score": 1,
                    "created_utc": 1652118654.0,
                    "response": "If you want to buy Bitcoin or other cryptocurrency coins you'll need to invest or trade your dollars or other fiat currency for these digital coins.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i804xrm",
                    "author": "igadjeed",
                    "score": 1,
                    "created_utc": 1652150745.0,
                    "response": "> faster method of buying bitcoin\n\nBuy Bitcoin from your friends, in person, for cash",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8c67e1",
                    "author": "IkeTrian",
                    "score": 1,
                    "created_utc": 1652373680.0,
                    "response": "Join $FLURRY to generate income on your deposit. Does it sound great to your ear? If yes, then join $FLURRY commiunity today.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7wx2l4",
                    "author": "KravoxWeb",
                    "score": -7,
                    "created_utc": 1652101053.0,
                    "response": "Coinbase is a centralize exchange (CEX). It's mean that all transaction beetwen your wallet and exchange's wallet reqire few days (because bitcoin's blockchain is not fast). \r  \n\r  \nAnd remember, that all you coins on CEXs is not your...",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7wz0u3",
                            "author": "civilengineer4",
                            "score": 8,
                            "created_utc": 1652102038.0,
                            "response": "No. It’s due to Coinbase waiting for funds to settle.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i7x09qu",
                            "author": "bitusher",
                            "score": 1,
                            "created_utc": 1652102643.0,
                            "response": "It has nothing to do with bitcoin , when you request a withdrawal of bitcoin in your wallet coinbase immediately sends it \n\nIt has to do with coinbase waiting for the fiat ACH bank transfer to settle, if you used a wire or debit card coinbase would allow you to instantly withdraw",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i832ogy",
                    "author": "Imaginary_Wing_2072",
                    "score": 0,
                    "created_utc": 1652208724.0,
                    "response": "Bitcoin will continue to appeal to investors seeking low-correlation assets that diversify portfolios.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}