{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uyx55p",
            "title": "Card declined. 40 min on a line to \"explain myself\".",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uyx55p/card_declined_40_min_on_a_line_to_explain_myself/",
            "author": "leanpreneur",
            "created_utc": 1653654462.0,
            "score": 4,
            "num_comments": 7,
            "subreddit": "Bitcoin",
            "selftext": "I just want to buy some btc, and it's so hard, I have to explain myself to use my own money. 40 mins the robotic voice is apologizing for the delay. \n\nMy bank is a joke. Not your keys not your wallet. Financial sovereignty is freedom.",
            "stickied": false,
            "comments": [
                {
                    "id": "ia6pckd",
                    "author": "Effin_Kris",
                    "score": 1,
                    "created_utc": 1653654859.0,
                    "response": "I remember when Chase did this last year. I told them to figure this shit out or I’m withdrawing any extra money and not looking back. They said I couldn’t buy BTC, I said I’ll withdraw the money using y’all’s atm and drive across the street to the BTM and buy it there.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia6pgtq",
                            "author": "leanpreneur",
                            "score": 1,
                            "created_utc": 1653654924.0,
                            "response": "I'm considering to do the same actually!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia6p57r",
                    "author": "Vendura663",
                    "score": 1,
                    "created_utc": 1653654746.0,
                    "response": "You're using a credit card?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia6p6fg",
                            "author": "leanpreneur",
                            "score": 1,
                            "created_utc": 1653654765.0,
                            "response": "Yes",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia6p87c",
                                    "author": "Vendura663",
                                    "score": 1,
                                    "created_utc": 1653654792.0,
                                    "response": "Then it's not your money",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia6p9xe",
                                            "author": "leanpreneur",
                                            "score": 1,
                                            "created_utc": 1653654819.0,
                                            "response": "This is how I feel right now",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia6pdbh",
                                                    "author": "Vendura663",
                                                    "score": 1,
                                                    "created_utc": 1653654870.0,
                                                    "response": "Yeah that sucks. I have 2 credit cards and one of them gets refused everywhere crypto related. I hope it'll get less strict in the future",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "id": "uyx9lw",
            "title": "Am I missing something?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uyx9lw/am_i_missing_something/",
            "author": "TheDumbInvesto",
            "created_utc": 1653654888.0,
            "score": 20,
            "num_comments": 41,
            "subreddit": "Bitcoin",
            "selftext": "I invested some amount in UST and lost it. People told \"you should have known what you are getting into\", \"you should have read the white paper\" etc. No I didn't read the white paper and I just went with \"stable coin\" tag and learnt the lesson. But am not worried about it.  It was not even 5% of what I have in BTC. Events like this makes one a Bitcoin maxi. \n\nMy only concern now is, do I know all that I need to know about BTC? I am not a techie, so haven't read the white paper. I know what mining is, on a very high level - about nonce, missing bit and machines trying to figure it out to add next block to the block chain and earn btc reward. That's it, I can't explain anything more about it. I know these machines are called nodes and it is spread across the globe which protects the bitcoin network. I know bitcoin network was never hacked in the last 12+ years and it is only increasingly getting difficult to hack in future too. I know future quantum computers can break crypto algorithm/hashkeys but it is quite far away and this is a risk for all banking and other regular finance sector too so not a btc specific concern. I know I need to keep my coins in self custody, preferably in a hardware wallet and not rely on exchanges or online platforms (like celcius/nexo) to store the coins. I know how to safeguard the 24 words. I know governments can take drastic steps one day and even arrest btc holders (it already happened in china). I know BTC started as a currency but it is predominantly used a store of value today (like gold). I know even in few decades it may or may not become a currency used to do day to day transactions but will definitely continue as a store of value and may even become a reserve currency for few countries. \n\nThat's all I know. Do I know enough? Can I continue to invest in BTC with just this knowledge?",
            "stickied": false,
            "comments": [
                {
                    "id": "ia7kgkv",
                    "author": "etmetm",
                    "score": 15,
                    "created_utc": 1653668654.0,
                    "response": "Bitcoin is the first and only coin that was launched fairly and without the motivation of the immediate benefit for the creator(s). \n\nBitcoin is pure, it's strict in its rules without rulers. Bitcoin is defined in its core properties for example by the just under 21 million coin limit and proof-of-work. Anything else is by definition and on the network not Bitcoin.\n\nIt's the best you can hope for.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia84cl0",
                    "author": "Advanced_Shoulder_56",
                    "score": 11,
                    "created_utc": 1653677039.0,
                    "response": "The fact that you seek to question your own level of knowledge bodes well for you bud.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia6xkvn",
                    "author": "Western_Boris",
                    "score": 16,
                    "created_utc": 1653658988.0,
                    "response": "You have good amount of basics covered. Is that enough? It never is. Keep learning, keep reading of the latest development around the world. That is the only way to keep up with the world.\n\nAlso, there is no singe use of Bitcoin ever. It is at the moment being used as an investment, savings account AND daily currency. Use cases depend of the person and the area he/she is living in. If you have crazy dictator or government cracking down on opposition and human rights movements and confiscating their money, it is normal that those people turn to use Bitcoin as a currency. If you have more stable goivernment and local currency, then you will most likely use Bitcoin more as an investment or savings account. So it always depends on what the conditions for some person are.\n\nThe beauty of Bitcoin is that no one can tell you how to use it and no one needs any kind of permission to use it.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia7eswx",
                            "author": "pierreman",
                            "score": -6,
                            "created_utc": 1653666345.0,
                            "response": "Nobody can tell me how to use my earned fiat currency or give me permission to use it.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia7jfe0",
                                    "author": "walloon5",
                                    "score": 7,
                                    "created_utc": 1653668235.0,
                                    "response": ">Nobody can tell me how to use my earned fiat currency or give me permission to use it.\n\nThat's where you're wrong \n\nBanks can and do block access to your fiat\n\nAnd they are scheming to end cash too",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "ia7nxhi",
                                    "author": "Western_Boris",
                                    "score": 3,
                                    "created_utc": 1653670071.0,
                                    "response": "Yes they can. Central banks control 100% of what the purchasing power of your fiat is and the local government  or militia can ban you from using it, like it happens all the time in some countries.\n\nAlso, try to see the big picture. Bitcoin is not about YOU. It is about every person on the planet.\n\nMy country too does not have insane inflation numbers. Only 8%. Which is still shit. But I like it that people who are suffering from 80% inflation have more fair currency available to them via Bitcoin.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia7olb3",
                                            "author": "Accomplished-Row5989",
                                            "score": 2,
                                            "created_utc": 1653670340.0,
                                            "response": "Once one puts away their ego for others that’s when you become what we call a Gigachad. That was a Gigachad answer love to see it.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "ia85elr",
                                    "author": "MilesPower",
                                    "score": 3,
                                    "created_utc": 1653677497.0,
                                    "response": "Not only can they stop you using it.   \n\n\nThey can freeze it. (AML)  \n\n\nThey can steal it. (Civil forfeiture)  \n\n\nThey can devalue it. (Fed printing)",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia7sp3t",
                    "author": "SHA256dynasty",
                    "score": 5,
                    "created_utc": 1653672034.0,
                    "response": ">I know these machines are called nodes and it is spread across the globe which protects the bitcoin network.  \n>  \n>I know I need to keep my coins in self custody, preferably in a hardware wallet and not rely on exchanges or online platforms (like celcius/nexo) to store the coins.\n\nyou seem to understand the point of self custody. another key thing you should look into is the importance of running your own node. bitcoin is a peer-to-peer protocol/network. nodes don't just protect the network from afar, nodes *are* the network - they are the \"peers\" in the \"peer-to-peer\" part of bitcoin. your node makes you a \"peer\" in the system, it protects *you* from fraudulent transactions, it is what maintains your privacy, it is how you personally verify your transactions are real and your bitcoin is real, it is how you know there are not more than 21m bitcoin in the system. every outgoing transaction has to be broadcast through a node, and every incoming transaction has to be validated by a node. if you aren't running your own node, when you send bitcoin, you are signing transactions and sending the signed tx to someone else's node to be broadcast across the network. if you aren't using your own node, every time you open your wallet and check your balance, you are sending a request to some server node somewhere and asking the balance of your addresses (leaking your IP address and bitcoin addresses to this outside server). without your own node, you aren't part of the bitcoin network, and you are ultimately relying on trust of centralized server nodes.\n\na non-custodial wallet protects your keys. a node enables you to directly and privately interact with the bitcoin network.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia6qoou",
                    "author": "Deacon86",
                    "score": 13,
                    "created_utc": 1653655587.0,
                    "response": "I would say Bitcoin has a 13 year track record, and has basically never failed to do what it's meant to do.  For most of that time, there has been strong financial incentive to attack the Bitcoin network, to either expose a flaw or to force through an invalid transaction. Such attacks have never succeeded.  Regardless of technical details, I for one am pretty confident that if Bitcoin were flawed, that flaw would have been exposed by now.  TerraLuna had only been around for a couple of years, and only really became popular within the last few months.  It was untested.  Bitcoin isn't.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia7zxcq",
                            "author": "cutoffs89",
                            "score": 1,
                            "created_utc": 1653675108.0,
                            "response": "Everyone is soo spoooked by this event.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "ia8tft4",
                            "author": "deadontheinternet",
                            "score": 1,
                            "created_utc": 1653688579.0,
                            "response": "It often doesn’t just succeed either, it succeeds at rates much faster than anticipated",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia7xss1",
                    "author": "crushfield",
                    "score": 3,
                    "created_utc": 1653674185.0,
                    "response": "Read the whitepaper it's like 3 pages",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia8508r",
                    "author": "Dont_Waver",
                    "score": 3,
                    "created_utc": 1653677325.0,
                    "response": "Yes, I give you permission. But if bitcoin fails, everyone will say \"you should have known better\". You just need to get comfortable with the risks you're taking and continue reading and learning.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia70th4",
                    "author": "solomonsatoshi",
                    "score": 6,
                    "created_utc": 1653660472.0,
                    "response": "IMO, Everyone should *at least* read The Bitcoin Standard before buying any Bitcoin.\n\nEdit- And they should then decide they *want to be part of the revolution to restore monetary integrity*, knowing the risks, and the mechanism.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia7i0ts",
                    "author": "iammasvidal",
                    "score": 4,
                    "created_utc": 1653667658.0,
                    "response": "Read mastering bitcoin \n\nRead the bitcoin standard.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia81ybr",
                    "author": "MadMaxwell92",
                    "score": 2,
                    "created_utc": 1653675993.0,
                    "response": "Don’t listen to people, these shitcoin companies all seemed legit at first and some had very reputable people on the boards that made them seem like they were going to have some real utilities. I don’t believe all of these companies were created with malicious intent but none of them have really shown any kind of valuable utility that makes it viable for use anywhere.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia82sse",
                    "author": "Familiar_Hotel_5269",
                    "score": 2,
                    "created_utc": 1653676364.0,
                    "response": "Look up the Saylor Series on the What Is Money podcast it’s excellent",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia71r37",
                    "author": "ndgoLiberty",
                    "score": 2,
                    "created_utc": 1653660889.0,
                    "response": "The nice thing about bitcoin is that if you really really really want to NOT do your own research you can create a wallet, protect your seed phrase on a physical storage device. Delete your wallet from everything except the physical storage device and then HODL your bitcoin for the next 300-1500 years. (Or until you die).\n\nIt works. And your coins will be accessible forever. There are technically market forces that could take bitcoin to $0 but it won’t be from a simple arbitrage trade like Teara Loosa. It would take a permanent global internet outage or the Fed raising interest rates to 15% and leaving them there for a century.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia7p95w",
                            "author": "life762",
                            "score": 2,
                            "created_utc": 1653670611.0,
                            "response": "Well said, but frankly I don't think either of your hypothetical situations would even be enough to take Bitcoin to $0. Or even near $0.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia6sx3d",
                    "author": "gotamm",
                    "score": 1,
                    "created_utc": 1653656740.0,
                    "response": "For sure you don't know enough, because nobody know enough about Bitcoin :-) You'd better keep on studying!\n\nIn other words, there always a small, very small chance you could lose your funds!\n\nAnyway, good job, because you probably know more about bitcoin than the majority of investors!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia6u4ng",
                    "author": "Ok_Aerie3546",
                    "score": 1,
                    "created_utc": 1653657338.0,
                    "response": "I would say you know enough. But finally everyone makes their own decisions about how much is enough.\n\nI dont know about cryptography or elliptical curve blah blah. I am just trusting the decade long history of whatever was said before is still working.\n\nI am always afraid of soft forks. But I cant really help it. Pick a few trusted sources and listen to what they say and based on their explanations make up your mind.\n\nIts somewhat politics more than a technical thing.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia6xk88",
                            "author": "davidcwilliams",
                            "score": 1,
                            "created_utc": 1653658979.0,
                            "response": "> Its somewhat politics more than a technical thing.\n\nIronically, this could describe Bitcoin itself.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia6ygxi",
                                    "author": "Ok_Aerie3546",
                                    "score": -1,
                                    "created_utc": 1653659401.0,
                                    "response": "Maybe at some point if bitcoin stops having soft forks, it will stop being political.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia6w9d6",
                    "author": "frequent_heron_2102",
                    "score": 1,
                    "created_utc": 1653658365.0,
                    "response": "You don't necessarily have to understand everything about an investment, but if you don't then you shouldn't invest more than you are comfortable losing.\n\nIt doesn't matter how the technology works or how safely you store your keys, there could be a black swan event that drives the value down 90% or more. It's a very volatile asset, even after 10+ years. So if you aren't comfortable with that, don't invest, or invest very little.\n\nThere's nothing in the Bitcoin whitepaper or code or development process that gives it value. It's people that give it value, and people could decide someday that it has no value.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia754ad",
                    "author": "llewsor",
                    "score": 1,
                    "created_utc": 1653662342.0,
                    "response": "well the saying around here is “don’t trust. verify.”\n\nat the end of the day, you have to own up to your decisions. bitcoin could fail theoretically, but is it likely? not really, especially after 13 years of no hacks and pumping out blocks. \n\nafterall bitcoin is still an experiment - but it’s the most successful one we have so far. nothing is guaranteed in this life. \n\ndo i know enough about bitcoin? nope, but i feel that i know enough about the alternatives and bitcoin is by far the one i would stake my future in.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia7uarf",
                    "author": "Crawlero",
                    "score": 1,
                    "created_utc": 1653672703.0,
                    "response": "Enough to see a future crash? I don't think there will be, but you could examine the attack surface superficially.  Soft forks, governments shutting down exchanges, a critical percentage of users wanting the consensus rules to change, there's ways to mess up bitcoin, how likely any of them are at this point is hard to say, but unlikely.  I think on the long time horizon bitcoin is going to go up, but if you want the assurance then that would be the place to look.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia7o1qz",
                    "author": "Bitcoin__Hodler",
                    "score": 1,
                    "created_utc": 1653670119.0,
                    "response": "\"you should have known what you are getting into\"",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia7xv3z",
                    "author": "HaikuHaiku",
                    "score": 1,
                    "created_utc": 1653674213.0,
                    "response": "how does one \"invest\" in a stablecoin?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia86bb1",
                    "author": "Fine-Artichoke-7485",
                    "score": 1,
                    "created_utc": 1653677905.0,
                    "response": "Don't invest in crypto if you don't understand it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia89yn2",
                    "author": "ApprehensiveSorbet76",
                    "score": 1,
                    "created_utc": 1653679527.0,
                    "response": "If you learn too much you will change your mind.  Don't overthink it.  It's really about wants.  If you want to invest in Bitcoin and sleep at night, stop researching and turn the blinders on otherwise all you will do is introduce doubt for yourself.    \n\n\n\"but will definitely continue as a store of value\"  You already state that you know this which I presume means you have 100% certainty.  So what can further research do to raise this number?  It can only introduce doubt and uncertainty from here.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia8eyfv",
                    "author": "The_Estranger_0001",
                    "score": 1,
                    "created_utc": 1653681781.0,
                    "response": "I’d say you already know more than many people in this sub, especially those line-drawing TAs. \n\nBut aside from the techie detail, you may also want to understand:\n\n1) Although China banned it, even a government with such tight grip and monitoring can’t stop her people continually mining it. China is already back as the 2nd largest Bitcoin mining country now.\n\n2) There are countries ( El Salvador and Central Africa), places (South Africa etc.), shops (Balanciaga and Gucci) and POS network (strike) where you can already use Bitcoin as a method of payment, as a true currency.\n\n3) Governments (such as FED / SEC) are objecting Bitcoin because they are afraid of losing control, investment companies (such as Warren Buffett) are playing down Bitcoin because it is not something they are familiar with.\n\nSo it’s not the technology or safety you need to worry about, but the resistance from the authorities and old school investment giants (and of cos those paper hands and buy-high-sell-low genius) to delay Bitcoin mooning as it should.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia8f1l5",
                    "author": "igadjeed",
                    "score": 1,
                    "created_utc": 1653681820.0,
                    "response": "Bitcoin is secured by a network of 50,000 nodes, operated by volunteers. Would you risk your future assets investing in that?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia8iuee",
                    "author": "dig_bick_super_man",
                    "score": 1,
                    "created_utc": 1653683552.0,
                    "response": "You can never know enough, and it sounds like that’s already your stance. The beat way to make the best decisions is to be the best informed. So just stay on top of it",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia8smuk",
                    "author": "mbrochh",
                    "score": 1,
                    "created_utc": 1653688188.0,
                    "response": "the white paper is only nine pages. just read it for fun. you will probably get lost when they talk about Merkle Trees, so then you either glance over it, or you learn about it on Wikipedia/Google or ask here on Reddit.\n\nWhen you realise how insanely simple bitcoin really is at its core, your conviction will become unshakable.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia8xjmw",
                    "author": "fawnside",
                    "score": 1,
                    "created_utc": 1653690578.0,
                    "response": "Just read the white paper dude…",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia90k68",
                    "author": "King-Donkey-Kong",
                    "score": 1,
                    "created_utc": 1653692065.0,
                    "response": "Read Mastering Bitcoin if you want to learn more, if you haven’t.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia90th7",
                    "author": "po00on",
                    "score": 1,
                    "created_utc": 1653692195.0,
                    "response": "US Dollars (and all other national currencies) are broken, because a small group of people can create more of them, whenever they feel like it, and out of thin air.   \nEvery time they print more dollars, the dollars in your pocket become worth less. They are essentially stealing from you, but they're doing so from a distance, so you don't immediately notice.\n\nAs long as the game theory and decentralision are maintained, Bitcoin remains one of, if not the the only thing on this planet that is truely scarse. ie there is no group of people. small or large, who can create more of it.  \n\n\nThis is why you should hold Bitcoin.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}