{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uulwtu",
            "title": "Wage slave by design (post deleted in r/antiwork)",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uulwtu/wage_slave_by_design_post_deleted_in_rantiwork/",
            "author": "voluntarygang",
            "created_utc": 1653135393.0,
            "score": 60,
            "num_comments": 42,
            "subreddit": "Bitcoin",
            "selftext": "This post was deemed off topic in r/antiwork so I'm posting it here for posterity.\n______\n\nWhen you look around you and you observe the way the world works today you get this feeling that something is wrong. You see rich people with more wealth that they could possibly enjoy in a single lifetime and then you see yourself, struggling and you can't understand why, why are you living month to month barely getting by. You talk to people like r/antiwork and you find out you are not alone so you lach onto one of the popular explanations for why this is. The rich man is bad! The government is bad! The capitalist system is bad! You are being exploited at your job! etc etc \n\nBut you never learned what really is the primary cause of your suffering. And it's this: https://youtu.be/sI1C9DyIi_8 \n\nYou don't understand the exponential function and just what 2% per year inflation target by your central bank really means for your money. \n\nYou don't understand that this POLICY, publicly stated by YOUR central bank, is the main reason why you can't get ahead. Because you don't think 2% per year is a big deal. You don't get how the exponential function works as it's very counter intuitive. You don't get that 2% per year means in just 35 years your money will be worth HALF of what it was on the day you earned it. And you don't understand that if they overshoot their target(again publicly stated as some sort of virtue called \"price stability\") and the inflation is really 7% this happens in just 10 years. 10 fucking years and your savings lose half of it's purchasing power!!\n\nTHIS is the cage you are in.\n\nIt's the monetary system of steady decrease of the value of money you earn. And guess what, the way this inflation is achieved helps out the richer getting even more rich.\n\nI guess what the purpose of my message to you is, understand the cage you are in. Because if you fail to do this, you will never get out. Learn about money and monetary systems, support people who speak out against the current global monetary enslavement scam, put your wealth into money and assets that can't be inflated(gold, bitcoin, land, commodities) and spread this knowledge.\n\nIt's not hopeless. In fact with the invention of the internet and Bitcoin it's as hopefull as it ever was as this is a really really old scheme(think Romans old) and we have tools to fight it for the first time in human history. But you have to learn what the real problem is, the exponential function is really counter intuitive and it's how they keep you blind to just how much pain their 2% per year cuases you.\n\nGood luck and peace out.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9g1m6t",
                    "author": "freemarketcommie",
                    "score": 10,
                    "created_utc": 1653138125.0,
                    "response": "This is the one great strength of the Fiat system. Forcible participation. There’s gotta be a way to produce the same affect without all the coercion.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9g2s8f",
                    "author": "Level_Willingness790",
                    "score": 5,
                    "created_utc": 1653138789.0,
                    "response": "Piece....out?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9g3eqy",
                            "author": "voluntarygang",
                            "score": 9,
                            "created_utc": 1653139144.0,
                            "response": "It was my sign off for r/antiwork. I'm in this Bitcoin space since 2011, ain't going anywhere, obv 🤣\n\nEDIT: it just hit me.. LOL I'm an idiot 🤣🤣 Ty, made the edit.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9g9j4m",
                    "author": "planet_hallows",
                    "score": 7,
                    "created_utc": 1653142333.0,
                    "response": "It's not just inflation, but bailouts that's the problem.\n\nImagine two men with the same investment strategy: keep 6 months living expenses in cash and the rest in stocks. The first man has a net worth of $100k and living expenses of $2.5k/month. This means he has 15% of his net worth in cash and 85% in stocks. The second man has a net worth of $1M and living expenses of $10k/month. This means he has 6% of his net worth in cash and 94% on stocks. If in a year interest was 1% on cash and the stock market went up by 5%, the first man is 4.4% richer, but the rich man is 4.76% richer. That may not sound like a lot, but he's richer in both absolute and % terms. Over time, the rich get richer.\n\nHigher interest rates diminish this effect both by making the cash earn more and diminishing stock returns, but that just slows things down.\n\nThe natural solution is market crashes, which periodically take from the rich who invested poorly, invested using leverage or otherwise took great advantage of the system. Without bailouts, the rich would have to keep more cash on hand for emergencies, and over time, only the cautious and careful investor who did the hard work of discovering businesses useful enough that market gyrations can't stop them would prosper. Those who can't do that could always save cash instead, not to get rich, but to support themselves during lean times and in retirement.\n\n\nLow interest rates/inflation make taking advantage of the system possible, and force the average man to invest in stocks to slow how quickly he gets poorer and make him accept bailouts that he doesn't realize benefit richer men much more than they benefit him. Bailouts serve to solidify ill-gotten gains and encourage imprudent risk taking that is counter-productive to real economic growth.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9fykd2",
                    "author": "Lucky-Painting6553",
                    "score": 12,
                    "created_utc": 1653136299.0,
                    "response": "instead put in crypto and lose 50%",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9g6uad",
                            "author": "voluntarygang",
                            "score": 8,
                            "created_utc": 1653140983.0,
                            "response": "What are you talking about? I'm up 250000% 🤣",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9gjfvu",
                                    "author": "theplushpairing",
                                    "score": 1,
                                    "created_utc": 1653146958.0,
                                    "response": "I’m down 90%",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9gax5f",
                            "author": "Riker-Was-Here",
                            "score": 9,
                            "created_utc": 1653142999.0,
                            "response": "your first mistake was investing in \"crypto\" instead of just BITCOIN.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9g0q3g",
                            "author": "JaceTheWoodSculptor",
                            "score": 12,
                            "created_utc": 1653137610.0,
                            "response": "You don’t lose 50%, you lose 50% of its value when paired in your local currency, your haven’t lost a single satoshi. The problem is those local currencies. Don’t you see a problem with having private entities in control of printing said currencies ? Ain’t nothing federal about the federal reserve. \n\nOr maybe you like working your ass off only to see your purchasing power slowly melt away.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9g4ipx",
                                    "author": "polloponzi",
                                    "score": 3,
                                    "created_utc": 1653139754.0,
                                    "response": "Same with dollar, you don't lose any dollar because of inflation. 1 dollar = 1 dollar forever.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9g572g",
                                            "author": "JaceTheWoodSculptor",
                                            "score": 7,
                                            "created_utc": 1653140120.0,
                                            "response": "Yes but you cannot dilute the value of BTC by just printing more.\n\nYou may still have 1$ but everything now costs 2$…",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9g5oly",
                                                    "author": "polloponzi",
                                                    "score": 0,
                                                    "created_utc": 1653140377.0,
                                                    "response": "You can dilute the value of Bitcoin by selling it, just see how the market is.. Bitcoin lost 50% of the  value recently",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9g62q7",
                                                            "author": "JaceTheWoodSculptor",
                                                            "score": 5,
                                                            "created_utc": 1653140577.0,
                                                            "response": "You can dilute the value of any asset by selling it… I just think BTC is a better alternative to fiat currencies.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9gh9ad",
                                                                    "author": "polloponzi",
                                                                    "score": 1,
                                                                    "created_utc": 1653145943.0,
                                                                    "response": "I agree with that",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "i9gaxo9",
                                                            "author": "Ok_Aerie3546",
                                                            "score": 5,
                                                            "created_utc": 1653143006.0,
                                                            "response": "That not dilution.\n\nCentral bank printing is dilution, gold miners mining is dilution and bitcoin miners mining is dilution. Difference is in bitcoin the dilution is predictable. And keeps decreasing.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9ghd67",
                                                                    "author": "polloponzi",
                                                                    "score": 1,
                                                                    "created_utc": 1653145993.0,
                                                                    "response": "Is not dilution in technical terms, yet the end effect is the same: your wealth goes down.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9gighn",
                                                                            "author": "Ok_Aerie3546",
                                                                            "score": 1,
                                                                            "created_utc": 1653146496.0,
                                                                            "response": "People are ok with wealth going down. They are never ok with unexpected dilutions. Thats why people sell their stocks if the company announces an unexpected share offerring. But no extra people exit if just the stock price moves up or down.\n\nUnexpected stock offerring can even make long term investors leave, price fluctuations cant.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9ghzmf",
                            "author": "Bitcoin__Hodler",
                            "score": 1,
                            "created_utc": 1653146282.0,
                            "response": "or 99,9%.\n\nbetter stack sats!",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9fzd6s",
                            "author": "Apprehensive-Page-33",
                            "score": -5,
                            "created_utc": 1653136800.0,
                            "response": "Right? This propaganda piece is particularly poorly timed.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9g0u7w",
                                    "author": "grundatcom",
                                    "score": 7,
                                    "created_utc": 1653137678.0,
                                    "response": "Propaganda because of? Isn’t it true that your money is losing value due to inflation?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9g7znf",
                                            "author": "Apprehensive-Page-33",
                                            "score": 0,
                                            "created_utc": 1653141570.0,
                                            "response": "No doubt it is true that USD suffers from the effects of inflation. We are seeing that right now. I am talking about the reason why we suffer inflation and the solutions that regular folk can take. This is not the only place I disagree. It is the vehemence and arrogance with which you propose your solution that has me throw it away as propaganda. That you say this when most of us are in the red means that it is also ill timed. We have much bigger problems than inflation and crypto is as much a part of the bigger problem as it is a solution to anything related to inflation IMO. Inflation is just one symptom of the illness on the wider economic system IMO. Crypto won't save us from inflation or the wider structural problems facing our system.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9ga2dt",
                                                    "author": "voluntarygang",
                                                    "score": 2,
                                                    "created_utc": 1653142596.0,
                                                    "response": "You keep saying crypto but this is r/bitcoin and I suggested Bitcoin only. And Bitcoin with its excellent good money properties is precisely the solution to inflation. The rest of crpyto not ao much.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9g5z9l",
                                    "author": "Knerd5",
                                    "score": 3,
                                    "created_utc": 1653140529.0,
                                    "response": "It’s really not though. Taking the ATH point is glossing past the fact that’s not the average buy price of 99% of participants. Yes, many are underwater by 20-40%, but that’s what happens when you buy hype. Doesn’t matter what asset it is. Anyone who does any semblance of DD should have known the price does this. If you aren’t averaging down, you’ll never be *truly* successful in this space.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9g94ly",
                                            "author": "Apprehensive-Page-33",
                                            "score": -2,
                                            "created_utc": 1653142134.0,
                                            "response": "I'm good homie. Cost basis aside... I'm talking big picture. The larger economic system including inflation. Crypto is not going to save anyone or disrupt that. That's all I am saying here. I am a crypto investor myself so I do think that people are involved and will continue to be. As far as the price action no one knows shit about fuck if you ask me (self included).",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9g9wo6",
                                                    "author": "nameisjose",
                                                    "score": 3,
                                                    "created_utc": 1653142518.0,
                                                    "response": "Crypto won’t save us, but Bitcoin will. It’s Bitcoins economic principles that save us, 21 million, fixed supply schedule.  If all workers demanded to be paid in Bitcoin the world would be a different place.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9gbqvs",
                                                            "author": "Apprehensive-Page-33",
                                                            "score": -2,
                                                            "created_utc": 1653143390.0,
                                                            "response": "I disagree. I use BTC and crypto interchangeable. It becomes a bit of a leap of faith to believe that something will happen when you have no proof. I am a skeptic and very disagreeable on purpose. To have a paradigm shift that changes an entrenched and corrupt system requires enormous time and effort (good timing and good fortune as well). Sorry if I'm all out of hopium. I think our system is irretrievably corrupt.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9gdj8l",
                                                                    "author": "voluntarygang",
                                                                    "score": 1,
                                                                    "created_utc": 1653144234.0,
                                                                    "response": "Boy, you should have been here to spread your lack of vision when the price was sub 1$ and hardly anyone knew let alone used Bitcoin 🤣",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                },
                                                                {
                                                                    "id": "i9ge0x9",
                                                                    "author": "nameisjose",
                                                                    "score": 1,
                                                                    "created_utc": 1653144462.0,
                                                                    "response": "I agree it will be a paradigm shift and it’s happening. Going from a handful of Bitcoiners to millions in a decade is proof. How do you stop an idea that seems to be catching on?",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                },
                                                                {
                                                                    "id": "i9gg6ot",
                                                                    "author": "techma2019",
                                                                    "score": 1,
                                                                    "created_utc": 1653145453.0,
                                                                    "response": "You lost me when you conflated Bitcoin with crypto. There's Bitcoin and then there's ELONCUMROCKET. I am pretty sure you do not think both can save the world. I would hope you don't anyway. \n\nI fully agree on corruption. I also think more and more people are waking up. Much harder to keep people silent like in the old days. We have the Internet now and the era of accountability will be upon us shortly.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9gj3xz",
                                                                            "author": "Apprehensive-Page-33",
                                                                            "score": 1,
                                                                            "created_utc": 1653146804.0,
                                                                            "response": "That is a technicality, but ok you win? The fact is our corrupt overburdened debt system is likely to crash the global economy again regardless of crypto, bypto or BTC.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i9gb7do",
                                                    "author": "Knerd5",
                                                    "score": 3,
                                                    "created_utc": 1653143133.0,
                                                    "response": "See, I disagree with you on the bigger picture. Bitcoin IS going to help, and does help, protect against inflation. At this point in its existence it only protects over longer timeframes (2-4 years) though. The reason being is OG holders have massive positions that need to be unwound, a decently high issuance rate (~2%) and access to high amounts of leverage (20x) all lead to high volatility. I have always believed that the 2028-2032 halvings are when we see price volatility significantly calm down. Large individual holders will have dispersed to larger groups of people, inflation will be well under 1% and exchanges will forced to bring leverage into a reasonable range (probably 3-7x). All these factors will lead to the swings calming TF down.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9ga76v",
                    "author": "shreveportfixit",
                    "score": 2,
                    "created_utc": 1653142662.0,
                    "response": "I've tried talking to them about inflation.  Their only response is that minimum wage should rise with it.  They wanna put a bandaid on a gunshot wound without removing the bullet first. It is infuriating.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9gad58",
                            "author": "voluntarygang",
                            "score": 1,
                            "created_utc": 1653142740.0,
                            "response": "Yep.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9gkcat",
                    "author": "Digital_Wampum",
                    "score": 1,
                    "created_utc": 1653147377.0,
                    "response": "Quality post!\n\nIn my culture, we're taught to think and take consideration what we do today and that it resonates 7 generations into the future.\n\nThat relates to the video link in the post \"arithmetic, population and energy\" where at ~24 minutes the speaker uses bacteria growth in a jar.  It takes 7 iterations to go from 1 bacterium to filling the jar.\n\nUnderstanding exponential functions like that, and the king and the chessboard and providing a reward by doubling the grains on each square also reflect this.\n\nAs a youth with access to computers and supporting and repairing them on my own, I observed this doubling with ram... 2, 4, 8.... 4096, 8192.... Etc\n\nWhen people see a percentage on paper, say in financial information... People don't get the notion to extrapolate and properly calculate this provided information.  \n\nI was always told to \"show your work!\" In math class.  And now I see why.  Because if everyone walked into a bank with pen, paper and calculator and were knowledgeable with the mathematics presented in this video regarding exponential function it would wind up as exactly what henry ford said\n\n\"It is well enough that people of the nation do not understand our banking and monetary system, for if they did, I believe there would be a revolution before tomorrow morning.\"",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9gdphf",
                    "author": "JimBloc",
                    "score": 1,
                    "created_utc": 1653144315.0,
                    "response": "As they say in movies FUCK YOU MONEY(enough to tell people I'm not doing your shity job anymore) they don't want you to get that point. \nThe governments have been devaluing your money and loading you with debt for years. It's a way to control the masses.\nMargaret Thatcher is good example, she loaded the poor up with debt and mortgages so they couldn't go on strike any more, and it worked.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9geljn",
                    "author": "Benjamincito",
                    "score": 1,
                    "created_utc": 1653144722.0,
                    "response": "People dont want to listen to us when we say inflation is impacting their lived",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ggcmz",
                    "author": "IndicaFruits",
                    "score": 1,
                    "created_utc": 1653145527.0,
                    "response": "our monetary policy is all about survival of the fittest. you can never rest in this environment, your wealth is always at risk, either through debasement or the blow-ups they eventually create.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9gj0l0",
                    "author": "FutureNotBleak",
                    "score": 1,
                    "created_utc": 1653146760.0,
                    "response": "We’re moving towards a zero inflation economy.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9gj9e3",
                    "author": "VPNApe",
                    "score": 1,
                    "created_utc": 1653146874.0,
                    "response": "Inflation is usually around 5%, not the 2% figure that they want you to believe. That basically throws the entire American retirement system out the window for most of the population. Their value stocks/bonds don't even maintain purchasing power throughout retirement. \n\nThat said, everyone is a wage slave even without inflation. It's been like that since society was formed and Bitcoin won't change that.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9gknf1",
                    "author": "Zelgada",
                    "score": 1,
                    "created_utc": 1653147519.0,
                    "response": "I'm sincerely trying to give you constructive feedback here.\n\nYou're right about inflation, but you are too condescending and negative in your communication.  You are putting others' thoughts into your words (which is insulting at best).  If you want to better advocate against this problem, you should work on your communication.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}