{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uscwnx",
            "title": "Why is the media always quick to cover news on Bitcoin emphasizing on Bitcoin dropping by 56% blah blah blah but they are nowhere to be found during bull runs.it’s as though they are in partnership with government to deface Bitcoin.",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uscwnx/why_is_the_media_always_quick_to_cover_news_on/",
            "author": "Madalyn765",
            "created_utc": 1652880380.0,
            "score": 109,
            "num_comments": 157,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i92ttlf",
                    "author": "krikreuk",
                    "score": 192,
                    "created_utc": 1652884713.0,
                    "response": "This is untrue and you're just cherry picking facts. We're in the middle of a crash, what else are they supposed to talk about besides the price dropping?\n\nLast Bull Run the new ATH of BTC was plastered on every newspaper so frequently my grandma started talking to me about BTC.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i92vw14",
                            "author": "and02572",
                            "score": 18,
                            "created_utc": 1652885585.0,
                            "response": "Yeah they talk about every high and every drop.  \nThat being said, I do wish they'd \"zoom out\" more when they talked about drops.  Even when they talk about new ATHs it would be good for them to zoom out and show how the cycles are happening.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i930ait",
                                    "author": "Technical_Emu_8567",
                                    "score": 17,
                                    "created_utc": 1652887407.0,
                                    "response": "You expect a thorough, rational analysis from MSM? Come on...",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i93n91m",
                                            "author": "NozzlerE2",
                                            "score": 2,
                                            "created_utc": 1652896675.0,
                                            "response": "Under rated comment",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i92xa9m",
                            "author": "Megaskreth",
                            "score": 6,
                            "created_utc": 1652886164.0,
                            "response": "Came here to say exactly this. The problem is the leverage and the young, underpaid yet overly bullish/over leveraged short term minded demographic",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i94d6i8",
                            "author": "Salt_Concentrate_609",
                            "score": 2,
                            "created_utc": 1652907240.0,
                            "response": "# 66666",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i954ezy",
                                    "author": "Zestyclose-Tailor-61",
                                    "score": 1,
                                    "created_utc": 1652919456.0,
                                    "response": "66667",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i93cpo3",
                            "author": "MilesPower",
                            "score": 5,
                            "created_utc": 1652892450.0,
                            "response": "Half the fuckers in here only know what BTC is *because* of the last ATH bullrun being plastered everywhere in MSM. \n\nOP is literally a 6month old account for fuck sake.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i94pvbc",
                            "author": "Dazzling_Marzipan474",
                            "score": 1,
                            "created_utc": 1652912671.0,
                            "response": "Did grandma buy?",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i95dvph",
                            "author": "EkariKeimei",
                            "score": 1,
                            "created_utc": 1652923892.0,
                            "response": "Happy cake day!",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i92vutb",
                            "author": "Madalyn765",
                            "score": -11,
                            "created_utc": 1652885571.0,
                            "response": "Well of course btc becomes popular it’s normal they had no choice but to put it out due to increasing adoption but the criticism and the emphasis on people commiting suicide due to market crash,btc plunges etc its not the title of the  headlines that startled me it’s the emphasis the newscaster was placing on market crash,suicide,volatility,unstable asset etc it was like those were the exact  chosen words for the public to hear.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i92w14m",
                                    "author": "energetic-dad",
                                    "score": 5,
                                    "created_utc": 1652885644.0,
                                    "response": ">Well of course btc becomes popular it’s normal they had no choice but to put it out due to increasing adoption\n\nNo, they put it out because of meteoric price rises, which may or may not have much to do with \"adoption\", unless you consider buying $15 of BTC on Coinbase \"adoption\"",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i92wmgk",
                                            "author": "Madalyn765",
                                            "score": -6,
                                            "created_utc": 1652885891.0,
                                            "response": "Tell me If it was dying almost fast as it came out,no mass adoption   and was becoming UNpopular would it frequent the  headlines ?",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i92ugvy",
                    "author": "Get_dat_bread69",
                    "score": 8,
                    "created_utc": 1652884989.0,
                    "response": "I saw it all over the local news when it was hitting ATHs",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i92uhwe",
                    "author": "Uldregirne",
                    "score": 14,
                    "created_utc": 1652885001.0,
                    "response": "The media was all over the bull run. What are you talking about?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i92vmej",
                    "author": "WORLDBENDER",
                    "score": 14,
                    "created_utc": 1652885474.0,
                    "response": "There has basically been a BTC price ticker on the bottom of CNBC’s cable stream for the past 2 years. So… that is not true at all.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i96ky54",
                            "author": "lag0255",
                            "score": 1,
                            "created_utc": 1652952492.0,
                            "response": "Yeah man, they cover those things and we all know that.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i92qwnp",
                    "author": "alxjnssn",
                    "score": 25,
                    "created_utc": 1652883455.0,
                    "response": "that is false. don’t pretend they don’t blast the bull run on news networks just to fit your narrative.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i93ddhf",
                            "author": "Rozzz123",
                            "score": 7,
                            "created_utc": 1652892712.0,
                            "response": "He got the tinfoil hat out tho",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i92r9lp",
                    "author": "cl4yf4c3",
                    "score": 20,
                    "created_utc": 1652883611.0,
                    "response": "This isn't true and I would recommend changing how you consume media. There is no conspiracy, you are just consuming the wrong media.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i95j5uf",
                            "author": "poe7645",
                            "score": 2,
                            "created_utc": 1652926340.0,
                            "response": "Right. This is the perfect time while sitting on losses to actually learn as much as you can about what you've invested in, and decide if you even want to be in the space. \n\nI want as much negative information as possible. The obsessions over price. What security actually means. What personal responsibility is. All the ways it can go wrong. Scaling debates. Moral and philosophical arguments. As much as the constant noise is unbearable, I can't seem to leave because the entire culture is such a wild ride and tribalism and yet so potentially changing for individuals. \n\nI don't want to be sure of anything. I just want to learn as much as I can. And challenge my biases. And watch. But the deeper I go. The more conviction I seem to be gathering.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i92vt7k",
                            "author": "Odd_Round_7993",
                            "score": -2,
                            "created_utc": 1652885552.0,
                            "response": "Your avatar looks exactly the same as mine. Happy twin day!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i92u1hw",
                    "author": "javier123454321",
                    "score": 4,
                    "created_utc": 1652884807.0,
                    "response": "Seems to me that everyone was talking about btc in the news, just like the other bull runs.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i92l703",
                    "author": "ivgur",
                    "score": 19,
                    "created_utc": 1652880833.0,
                    "response": "conflict of interest with finance lobbies",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i92ngd1",
                    "author": "Woodpecker3453",
                    "score": 9,
                    "created_utc": 1652881890.0,
                    "response": "Didn't you know that Bitcoin is the reason inflation is so high? Also the Bitcoin crash is causing stocks to crash as well. /s\n\nBut seriously, when Bitcoin reaches $1 Million and crashes down to $400k they're going to claim Bitcoin died for 9th time.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i92p0rl",
                    "author": "TorontoDavid",
                    "score": 10,
                    "created_utc": 1652882601.0,
                    "response": "There is no partnership with ‘the’ government to suppress news of Bitcoin. \n\nThe time to accept this claim is when there’s evidence for it.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i92rdpr",
                            "author": "bittercoin99",
                            "score": -3,
                            "created_utc": 1652883660.0,
                            "response": "If you haven't concluded yet that rich people collude to stay rich, I dunno what to tell ya.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i92rvhl",
                                    "author": "TorontoDavid",
                                    "score": 5,
                                    "created_utc": 1652883877.0,
                                    "response": "The claim is ‘the’ government is working across all mediums of media, across all partisan lines, and across all levels of trustworthiness, to suppress news about Bitcoin rising in value - and yet there is no evidence of this in the form of insiders, communications, plans, meetings, etc. \n\nDoes that seem like a reasonable claim?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i92x8io",
                                            "author": "A-Whole-Unit",
                                            "score": 4,
                                            "created_utc": 1652886144.0,
                                            "response": "I mean, I’m sure it didn’t seem reasonable at the time that the United States employed yellow journalism at a nationwide scale in order to preemptively justify the Spanish-American war during the 1890’s, but it happened. The US government has *never* been above using the ‘free’ press/media to lie & manipulate people. \n\nHello, they ‘classify’ (hide) information from us & don’t release it until 50 years later; assuming it isn’t re-classified. They lie every day. They decide what we are and aren’t allowed to know. Every day. Regardless of one’s political beliefs, having any confidence in the government to *not* lie to you is more than a bit naive.\n\nEdit: grammar/spelling",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i92xsun",
                                                    "author": "TorontoDavid",
                                                    "score": 1,
                                                    "created_utc": 1652886377.0,
                                                    "response": "You’re arguing a different point. \n\nI never said nor argued the US government doesn’t lie. \n\nI questioned the central claim in this post - namely the US government is conspiring with media to suppress news about Bitcoin’s price going up. \n\nWould you like to rebut my argument?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i931ike",
                                                            "author": "A-Whole-Unit",
                                                            "score": 2,
                                                            "created_utc": 1652887901.0,
                                                            "response": "I won’t necessarily rebut it, because I haven’t seen much (any) hard evidence myself, but I’m just pointing out that it isn’t a far-fetched idea/isn’t something to write off because it falls well within the realm of established possibility, ya know? \n\nThe government has catered to the rich for some time; so it isn’t unlikely that the trend continues with BTC or crypto in general if it means the rich may no longer be *the rich*. \n\nWith the current trend in cracking down on ‘compliance’ for wallets (like Celsius) or the ludicrous taxes on crypto, I’m just saying it wouldn’t surprise me if they’ve begun pushing the message subtly. \n\nSo, to put it succinctly, I’m not saying that it’s as widespread as the media manipulation in the 1890’s example I threw out by any stretch, I’m just saying it may very well be in the early stages since the government is clearly pretty anti-crypto.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i931pxk",
                                                                    "author": "TorontoDavid",
                                                                    "score": 5,
                                                                    "created_utc": 1652887989.0,
                                                                    "response": "A lot is possible - my central point is we should only accept a claim when there is evidence for it. \n\nCheers.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i938amx",
                                                                            "author": "A-Whole-Unit",
                                                                            "score": 1,
                                                                            "created_utc": 1652890681.0,
                                                                            "response": "Fair enough fam. I get the logic. Makes no sense to go crazy about something & start acting on things until they’re confirmed. Being suspicious on the other hand? I can’t help myself being a history dude lol. \n\nCheers!",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i92w3ph",
                                            "author": "energetic-dad",
                                            "score": 1,
                                            "created_utc": 1652885674.0,
                                            "response": "Absolutely not, but many people cling to unreasonable claims without evidence these days.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i92kj2e",
                    "author": "Hank___Scorpio",
                    "score": 9,
                    "created_utc": 1652880512.0,
                    "response": "Imagine the headlines. Bitcoin traded sideways today. Its up 12 cents.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i92ttpx",
                            "author": "D-6Hunter",
                            "score": 2,
                            "created_utc": 1652884714.0,
                            "response": "We see those news for stocks though",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i92vssa",
                                    "author": "EmbarrassedBridge189",
                                    "score": 2,
                                    "created_utc": 1652885548.0,
                                    "response": "We see it for Bitcoin with a little ticker too.  But yeah big bull runs and crashes are both plastered everywhere",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i92w5w7",
                                    "author": "energetic-dad",
                                    "score": 1,
                                    "created_utc": 1652885699.0,
                                    "response": "That's because stocks matter to more people than bitcoin. Everyone with a 401k cares about stocks.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i92wr9g",
                    "author": "Oddball369",
                    "score": 2,
                    "created_utc": 1652885947.0,
                    "response": "Mass media is biased, controlled by entrenched interest like corporations and yes, government. A lot of MSM is state-funded too.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i92y67c",
                    "author": "StonksPeasant",
                    "score": 2,
                    "created_utc": 1652886531.0,
                    "response": "Because corporate media has always been pro big government. They are hacks",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i931wpv",
                    "author": "Technical_Emu_8567",
                    "score": 2,
                    "created_utc": 1652888066.0,
                    "response": "Better question is: why are you consuming garbage media?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9328rf",
                    "author": "JoeYo743",
                    "score": 2,
                    "created_utc": 1652888204.0,
                    "response": "The Media IS in partnership with the government. Where do you live dude wake the f up this is not conspiracy thats just how the government works.\n\nThey took this style from the Germans who were masters at media control. The media is a tool for the government to push their agenda.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i932v87",
                    "author": "lgieg",
                    "score": 2,
                    "created_utc": 1652888459.0,
                    "response": "Your going to exhaust yourself. North America money is far too liberal and the liberal masses which includes MSM FUD btc constantly. Also Since the libs run Wall Street They will never accept btc. DONT FORGET WHOS RUNNING or should I say RUINING your country. Sounds terrible I know but the sooner realized you can then put your energy into more constructive avenues",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i935fc6",
                    "author": "SamWizza",
                    "score": 2,
                    "created_utc": 1652889503.0,
                    "response": "Media is an extension of government anyhow.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i96lc8x",
                    "author": "yoderjr8940",
                    "score": 2,
                    "created_utc": 1652952850.0,
                    "response": "I don't know but I want to know these things so bad now man.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i96u8pm",
                    "author": "Rossmacca1",
                    "score": 1,
                    "created_utc": 1652959747.0,
                    "response": "They are nothing like that, I have been following those media houses for a pretty long time and I disagree with your post right now my friend, stop saying these fake things please.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i92n7y8",
                    "author": "chikaca",
                    "score": 7,
                    "created_utc": 1652881784.0,
                    "response": "Because fear sells",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i92sml1",
                    "author": "HyprbolicTimeChamber",
                    "score": 3,
                    "created_utc": 1652884202.0,
                    "response": "Lol what? You didnt see the media talk about bitcoin when it went from sub 10k to nearly 60k+? Must have been living under a rock, or only seeing what you want to see.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i92t6jx",
                    "author": "Life_is_Liquid25",
                    "score": 2,
                    "created_utc": 1652884442.0,
                    "response": "Dude what are you talking about MSNBC was pumping Bitcoin to no tomorrow during the last bull cycle….",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i92sswz",
                    "author": "n0x103",
                    "score": 2,
                    "created_utc": 1652884279.0,
                    "response": "lol you are delusional. when btc is rallying it's all over the news and everyone and their grandma is asking how to get invested in it. That's one of the signs it's at the cycle peak.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i92ofog",
                    "author": "mibjt",
                    "score": 1,
                    "created_utc": 1652882338.0,
                    "response": "You should see the Peter schiff index",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i92l4ah",
                    "author": "comfyggs",
                    "score": -2,
                    "created_utc": 1652880797.0,
                    "response": "Funny i was having this EXACT thought this morning and after thinking about it, made me hopeful for the future towards the next halving. \nThe Revolution Will Not Be Televised!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i92mb7p",
                    "author": "meatismoydelicious",
                    "score": -2,
                    "created_utc": 1652881362.0,
                    "response": "Bitcoin, senators, presidents and nominees, celebrities, whistleblowers, foreign government officials, leaders of any rebel group regardless of intentions or context...... Fuck the government. Fuck the media. Stack Bitcoin.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i92vqg7",
                    "author": "deeneendo",
                    "score": 0,
                    "created_utc": 1652885520.0,
                    "response": "ah, you figured it out.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i92vc8l",
                    "author": "Normal_Cranberry_526",
                    "score": 1,
                    "created_utc": 1652885356.0,
                    "response": "You truly think that bull runs are caused always by the same group of people that are already in crypto and not new money?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i92x3zv",
                    "author": "Dogeonlygood",
                    "score": 1,
                    "created_utc": 1652886092.0,
                    "response": "Everything is about engagement. The crypto people will be upset and talk about it, Getting more people to look at it and vise versa for the people who will say \"I told you so\" and their like minded people will see. Which then provides time to their advertisers and tells the algorithm that you are interested in this and the cycle begins again. \n\nYou are the product and your reaction is a currency. Never forget that!\n\n-from someone in the advertising industry for the past 10 years",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i92xram",
                    "author": "Titty_Guy92",
                    "score": 1,
                    "created_utc": 1652886359.0,
                    "response": "Yeah baby keep droppin dat azz til payday 📉",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i92xwur",
                    "author": "Brucifer99",
                    "score": 1,
                    "created_utc": 1652886424.0,
                    "response": "They want to keep the price low so they can get more. They aren’t gonna come out and say Bitcoin is the real deal get as much as you can.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i92y7ac",
                    "author": "tzt1324",
                    "score": 1,
                    "created_utc": 1652886544.0,
                    "response": "We are still early",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i92zi4l",
                    "author": "JeremyLinForever",
                    "score": 1,
                    "created_utc": 1652887090.0,
                    "response": "Sounds about right… if OP is in China. Not so much in the US though.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i92zklj",
                    "author": "wockyplush",
                    "score": 1,
                    "created_utc": 1652887118.0,
                    "response": "Media presents what you look for, this is why observing all sides of a coin is important in finishing true value.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9307ou",
                    "author": "505hy",
                    "score": 1,
                    "created_utc": 1652887375.0,
                    "response": "Because negative news sell better.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i931du6",
                    "author": "johndoeisback",
                    "score": 1,
                    "created_utc": 1652887847.0,
                    "response": "The media shows whatever there is demand for.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i932v0u",
                    "author": "MirzaTheMan",
                    "score": 1,
                    "created_utc": 1652888456.0,
                    "response": "Mate the media is always super quick to cover news on bitcoin emphasizing on Bitcoin increasing by a lot blah blah blah",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9335tx",
                    "author": "coredweller1785",
                    "score": 1,
                    "created_utc": 1652888579.0,
                    "response": "The media is owned by Manufactured Consent by capitalists. They have a vested interest in keeping their bs going at all costs. \n\nSo they need to discredit anything else from bitcoin to socialism to really anything that threatens their easy accumulation of wealth.\n\nThat is why it's in all of our best interest as the workers to break that up.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i933mqa",
                    "author": "Alarmmy",
                    "score": 1,
                    "created_utc": 1652888769.0,
                    "response": "Don't lie to yourself.\nNews did cover Bitcoin during its skyrocketing in value.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i935geg",
                    "author": "Deeky8383",
                    "score": 1,
                    "created_utc": 1652889515.0,
                    "response": "Easier to fall vs climb... \n\nTherefor, likely easier to report on a fall vs a rise, because the falls are usually more drastic and in a shorter period of time. \n\nI've also seen news post/report on such small gains and make it seem like they're bigger than they really are. All for the clicks\\*\\*\\*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i935wcr",
                    "author": "P00G1",
                    "score": 1,
                    "created_utc": 1652889693.0,
                    "response": "Completely untrue",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i935z42",
                    "author": "captgh",
                    "score": 1,
                    "created_utc": 1652889725.0,
                    "response": "Good news does not sell.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93803d",
                    "author": "LUCKYARTURO",
                    "score": 1,
                    "created_utc": 1652890562.0,
                    "response": "Respectfully, “Media” is too wide a word to use to draw your conclusion. There’s so much reporting out there that you have to be specific to make a value judgement.\nThere are so many established avenues of information covering the crypto space - if you want information related to digital assists, that’s where one should look (coindesk as an example).\nOtherwise, it’s like looking at people magazine and complaining about a lack of coverage on the climate crisis.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9388jh",
                    "author": "zeycus",
                    "score": 1,
                    "created_utc": 1652890657.0,
                    "response": "In my experience that is not really true, the media will also end up talking BTC again when there is a spectacular run... to warn the public about the Bitcoin bubble and discourage any use/investment of it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i938jpg",
                    "author": "Tasty_Albatross_137",
                    "score": 1,
                    "created_utc": 1652890784.0,
                    "response": "I disagree strongly",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i939gdg",
                    "author": "Life_Airline_6767",
                    "score": 1,
                    "created_utc": 1652891148.0,
                    "response": "The media controls the information. That’s why some people refuse to watch CNN and only watch FOX news.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93avdo",
                    "author": "randompittuser",
                    "score": 1,
                    "created_utc": 1652891719.0,
                    "response": "Not everything is a conspiracy against you.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93b0v7",
                    "author": "djskooda",
                    "score": 1,
                    "created_utc": 1652891781.0,
                    "response": "Not 100% true but that last sentence…has some truth behind it",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93brjn",
                    "author": "madmancryptokilla",
                    "score": 1,
                    "created_utc": 1652892076.0,
                    "response": "From day one....",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93e51a",
                    "author": "Nicks_WRX",
                    "score": 1,
                    "created_utc": 1652893016.0,
                    "response": "It’s like you don’t even realize Bitcoin goes against everything those in power want.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93e6c1",
                    "author": "NYG_5",
                    "score": 1,
                    "created_utc": 1652893031.0,
                    "response": "normies be like:\n\ncorporation, BAD!\n\ncorporation with rainbow flag who tells us what DEMOOOCRACY is and tells us to send more weapons overseas, GOOD!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93g2v9",
                    "author": "AmDDJunkie",
                    "score": 1,
                    "created_utc": 1652893791.0,
                    "response": "Doom and Gloom sell..",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93hm4e",
                    "author": "nickname432",
                    "score": 1,
                    "created_utc": 1652894414.0,
                    "response": "I'd say all big price movements are mentioned. There was stuff that was covered in the past that was factually wrong though. I find it improved though.\n\nThey keep mentioning \"it's so and so many percent down from its ATH\" and rarely zoom out to a multi-year period. At least that's my perception - maybe they do it with all assets.\n\nMainstream media is dumb and we shouldn't pay so much attention.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93jg2k",
                    "author": "apoletta",
                    "score": 1,
                    "created_utc": 1652895154.0,
                    "response": "Could be also about where you are located as well.  People here are from all over the world.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93jnaa",
                    "author": "Ima_Wreckyou",
                    "score": 1,
                    "created_utc": 1652895236.0,
                    "response": "IMHO this isn't Bitcoin only, but the corporate media almost exclusively cover negative news this days. This is because of their business model. They are part of the attention economy, it's not about informing people, but getting as much of their attention so you can sell ads, and because we are fucking apes, we just pay more attention to negative things.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93kouu",
                    "author": "Unfair-Pie9403",
                    "score": 1,
                    "created_utc": 1652895659.0,
                    "response": "btcs was in the prime time news in GER when it hit 30k in 2021...",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93lgx6",
                    "author": "crazyblane",
                    "score": 1,
                    "created_utc": 1652895968.0,
                    "response": "They cover both, but the bull run headlines are always cautionary or inflammatory. Ie: \"bitcoin in a frenzy, Munger warns the run wont last forever\" Shit like that...",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93nktx",
                    "author": "SmileAndWaveB0ys",
                    "score": 1,
                    "created_utc": 1652896807.0,
                    "response": "in bullruns they’re talking about crypto bubbles. in bearmarkets they say crypto is dead.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93ryzi",
                    "author": "caron3979",
                    "score": 1,
                    "created_utc": 1652898579.0,
                    "response": "I've always been interested in this. Sometimes it seems to me that it is profitable for them to cover only bad news. For example, tether has done a lot of good for the crypto community, but the corrupt media only talk about the potential danger.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93u88w",
                    "author": "g3r0n1m0o",
                    "score": 1,
                    "created_utc": 1652899508.0,
                    "response": "Even the german media talked about the last bullrun. And they seem to hate crypto.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93uspm",
                    "author": "CraftyBelt",
                    "score": 1,
                    "created_utc": 1652899743.0,
                    "response": "Cool, let us know when you’re back on your meds",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93uv1t",
                    "author": "abhilodha",
                    "score": 1,
                    "created_utc": 1652899770.0,
                    "response": "It pumps 100x and dumps 80%\nSame story every fucking time",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93vijr",
                    "author": "dig_bick_super_man",
                    "score": 1,
                    "created_utc": 1652900034.0,
                    "response": "The funniest part is that bitcoin is up, over the last 3 years, and the stick market is down. And I saw a headline saying bitcoin may drag down the economy with it. LMFAO the economy is dragging bitcoin down with IT. Not vice versa. Obnoxious",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93w2ix",
                    "author": "Marokiii",
                    "score": 1,
                    "created_utc": 1652900258.0,
                    "response": "Idk where you guys have been, but I have seen years of articles covering each time bitcoin hits a new high.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93x168",
                    "author": "Impossible_Soup_1932",
                    "score": 1,
                    "created_utc": 1652900653.0,
                    "response": "To be honest I've seen a lot more 'BTC new ATH' news than I've seen about this crash. Mainstream media.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i942gql",
                    "author": "AvisPhlox",
                    "score": 1,
                    "created_utc": 1652902871.0,
                    "response": "When there's a rise they briefly mention it and at the end attach a FUD warning to their audience, discouraging them from buying any.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i943uah",
                    "author": "Telechain",
                    "score": 1,
                    "created_utc": 1652903424.0,
                    "response": "Duh",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i946lw2",
                    "author": "Satoshiman256",
                    "score": 1,
                    "created_utc": 1652904553.0,
                    "response": "Who cares, fuck them.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i94eos7",
                    "author": "Phooeychopsuey",
                    "score": 1,
                    "created_utc": 1652907867.0,
                    "response": "The media does cover it ur just sensitive to when the media bashes it so u notice/remember it more",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i94gt48",
                    "author": "Papersoulja",
                    "score": 1,
                    "created_utc": 1652908770.0,
                    "response": "Because they want to own enough of it to maintain the status quo and make a little profit at the same time.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i94ly5z",
                    "author": "TrudleR",
                    "score": 1,
                    "created_utc": 1652910969.0,
                    "response": "imho media lives off ur clicks. that's almost all that 98% of media cares for.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i94msl0",
                    "author": "ftw5623",
                    "score": 1,
                    "created_utc": 1652911324.0,
                    "response": "Cringe post",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i94q3aj",
                    "author": "First-Refrigerator96",
                    "score": 1,
                    "created_utc": 1652912769.0,
                    "response": "We've started trending down now. pumped for a couple years, it makes sense to go into a bear market till next btc halving.\n\nWe might get some relief rallies but most likely will only make a lower high and keep trending down.\n\n Last time we took a dip near 28k we rrcovered real quick. Now btc is hovering near 29k and 30k, it hasnt done that since forever. Thats why imo we are bearish. But hey, everythings on sale xD",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i94qyii",
                    "author": "lolasanchez69",
                    "score": 1,
                    "created_utc": 1652913164.0,
                    "response": "Like seriously",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i94r0vn",
                    "author": "Appropriate_Ad_1450",
                    "score": 1,
                    "created_utc": 1652913194.0,
                    "response": "Even in China 🇨🇳 the news is high on both directions",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i94se40",
                    "author": "FGforty2",
                    "score": 1,
                    "created_utc": 1652913812.0,
                    "response": "I just wish they would report the Dow and Nasdaq in Billions of Dollars instead of points. \n\n\"Bitcoin down 450,000,000,000 !!!!!\"\n\n\"Dow down 600 Points!\"\n\nOne sounds worse than the other..",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i94vh4z",
                    "author": "parkranger2000",
                    "score": 1,
                    "created_utc": 1652915235.0,
                    "response": "What’s a bull run?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i94x125",
                    "author": "kiaryp",
                    "score": 1,
                    "created_utc": 1652915963.0,
                    "response": "You sound very paranoid. get help",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i96u1l5",
                            "author": "erwssdvbds",
                            "score": 1,
                            "created_utc": 1652959614.0,
                            "response": "Man is just doing these things for some attention in the sub.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i94yplf",
                    "author": "69trevor69",
                    "score": 1,
                    "created_utc": 1652916749.0,
                    "response": "Who says they aren't partnered with the government tho 🧐?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i950jzz",
                    "author": "smellyboi6969",
                    "score": 1,
                    "created_utc": 1652917621.0,
                    "response": "OP ur dum",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i957qz0",
                    "author": "NegotiationNice9291",
                    "score": 1,
                    "created_utc": 1652921029.0,
                    "response": "We all know this question is rhethoric",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i96nw3t",
                            "author": "KristianLani",
                            "score": 1,
                            "created_utc": 1652955058.0,
                            "response": "He need to surf more media websites for sure now lol man.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i95b7ec",
                    "author": "Constant_Two_5546",
                    "score": 1,
                    "created_utc": 1652922648.0,
                    "response": "Its the big bank and pollutitions own the media",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i95e2dm",
                    "author": "songbolt",
                    "score": 1,
                    "created_utc": 1652923978.0,
                    "response": "56% crash is worse, more dramatic, than 56% growth.\n\nGiven $10,000, 56% loss is -$5600.\n\nGiven $5600, 56% growth is +$3136.\n\nInterestingly, $3136 regained is 56% of the amount that was initially lost ($5600). Same headline figure, nearly twice as worse when it goes down than when it goes up (for the number you picked).",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i95ef73",
                    "author": "JediElectrician",
                    "score": 1,
                    "created_utc": 1652924139.0,
                    "response": "The news is in partnership with certain parts of our  government in a lot of ways.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i95gwy6",
                    "author": "GodOfOdium",
                    "score": 1,
                    "created_utc": 1652925288.0,
                    "response": "..you know thats a signal for buy opportunity right?\n\nIf you are as smart as Buffet or Munger you would be buying this dip ..they have.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i95hsj1",
                    "author": "halfblack2",
                    "score": 1,
                    "created_utc": 1652925693.0,
                    "response": "Tragedies sell more?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i95n4vt",
                    "author": "bitcourseCEO",
                    "score": 1,
                    "created_utc": 1652928281.0,
                    "response": "They are",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i95qwrh",
                    "author": "Erpelente_",
                    "score": 1,
                    "created_utc": 1652930199.0,
                    "response": "Don't know what you are in about, but as soon as it started rising, media picked it up in Germany.\n\nMedia hype is pretty much the only reason Btc made new highs and didn't die off again after a couple of thousand bucks",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i95tja2",
                    "author": "Future_981",
                    "score": 1,
                    "created_utc": 1652931592.0,
                    "response": "The corporate media is extremely corrupt, everyone with half a brain knows this. Boycott watching them.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i95xbih",
                    "author": "Truly-Drew",
                    "score": 1,
                    "created_utc": 1652933770.0,
                    "response": "Guvmint took my bitcernnnn",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i96tber",
                            "author": "gigiuh",
                            "score": 1,
                            "created_utc": 1652959136.0,
                            "response": "Lmao, it's just so good that people are mocking the man.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i95xdtr",
                    "author": "Bone-Head-J",
                    "score": 1,
                    "created_utc": 1652933810.0,
                    "response": "You obviously don’t pay attention",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i965zh3",
                    "author": "FishiesTheCat",
                    "score": 1,
                    "created_utc": 1652939607.0,
                    "response": "They're quite simply a dated business model who want clicks etc because that = revenue. People in this sub really ought to grow up or think a little.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i968388",
                    "author": "adm928",
                    "score": 1,
                    "created_utc": 1652941228.0,
                    "response": "For the same reason why they bravuraly cover the situation in one yellow-blue country, loudly showing a couple of their local victories, and bashfully passing a couple of thousand crushing defeats past their eyes, pretending that they do not exist (you can just google it)\r  \n\r  \nEverything is exactly the same with **cryptos**. Normies are too foolish to **check the facts**, and therefore they can be outright lying to normies.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i96b3kw",
                    "author": "carlbentleyofficial",
                    "score": 1,
                    "created_utc": 1652943661.0,
                    "response": "The news also always reports shootings but never reports anything positive either. It’s the way the news works.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i96jte8",
                    "author": "bvedn7",
                    "score": 1,
                    "created_utc": 1652951453.0,
                    "response": "Well you gotta understand that they are not our enemy.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i96k6h8",
                    "author": "Dalichuk",
                    "score": 1,
                    "created_utc": 1652951792.0,
                    "response": "Can't say what's good and what's bad, they should post that too.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i96ne83",
                    "author": "CryptoCure-ious",
                    "score": 1,
                    "created_utc": 1652954639.0,
                    "response": "Slightly off-topic, but it's in the media's blood to be highlighting anything negative over the positive, right? Creating a frightening image of the world and anything new, so we can comfortably stay in risk-free consumer zone with a slave mentality \n\nSorry if I overdid that",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i92o6kx",
                    "author": "Asesinato",
                    "score": -1,
                    "created_utc": 1652882222.0,
                    "response": "You literally answered your own question in the title.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i96wv8e",
                            "author": "koenbruin",
                            "score": 1,
                            "created_utc": 1652961385.0,
                            "response": "I don't think that's something true at all my man, that's a lie.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i92rftx",
                    "author": "Icy-Hat-7029",
                    "score": -2,
                    "created_utc": 1652883686.0,
                    "response": "The government pays the media approximately $20MM per story aired.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i92wc8y",
                            "author": "energetic-dad",
                            "score": 1,
                            "created_utc": 1652885774.0,
                            "response": "lmao",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i92qbwm",
                    "author": "NiceDoctorBeam",
                    "score": -1,
                    "created_utc": 1652883193.0,
                    "response": "Stop watching that shit.  Just kill your television - you won't miss it.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i96v70h",
                            "author": "kristianstreiner",
                            "score": 1,
                            "created_utc": 1652960356.0,
                            "response": "Well we should watch that shit because it's something important.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i92qima",
                    "author": "NYKNYb",
                    "score": -1,
                    "created_utc": 1652883278.0,
                    "response": "\"it’s as though they are in partnership with government\"\n\nWhat?! You mean the government, banking sector and media is one apparatus that works hand in hand to maintain the existing system?\n\nThat's crazy.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i92wbp1",
                            "author": "energetic-dad",
                            "score": 1,
                            "created_utc": 1652885767.0,
                            "response": "it is",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i92st26",
                    "author": "TheGreatOkay",
                    "score": -1,
                    "created_utc": 1652884280.0,
                    "response": "It’s still stigmatized in the main stream as being an unsound investment, probably because of all the people yolo yeeting their entire cash out refi into shitcoin69420. It’ll eventually turn the tide though and for now we can just accumulate.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i92tifl",
                    "author": "FiatDiaper6000",
                    "score": 0,
                    "created_utc": 1652884580.0,
                    "response": "Because Reptillians rule and manipulate us from the 4th dimension :)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i92tsm5",
                    "author": "BlockChainR3volution",
                    "score": 0,
                    "created_utc": 1652884701.0,
                    "response": "Whys the media really only cover certain topics… That dont really matter… But r meant to scare n divide the populous",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i92txh2",
                    "author": "undercover_life",
                    "score": 0,
                    "created_utc": 1652884760.0,
                    "response": "For them btc exists in two states only, bubble or crash. Sage wisdom for the sheeple",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i92tz1s",
                    "author": "crushfield",
                    "score": 0,
                    "created_utc": 1652884778.0,
                    "response": "Owned by banks.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i92us4j",
                    "author": "VPNApe",
                    "score": 0,
                    "created_utc": 1652885121.0,
                    "response": "\n\nFinancial media is run by big money and big money has a vested interest in stopping stuff that jeapordizes traditional financial institutions.\n\nThat's why every time something like GameStop, Bitcoin, disruptive fintechs, etc are mentioned by the media it's always in a negative light.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i92v2dj",
                    "author": "LiveFreelyOrDie",
                    "score": 0,
                    "created_utc": 1652885242.0,
                    "response": "I always hate the “X Billion dollars have been WIPED OUT” line. As if it evaporated forever.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i92wqdj",
                    "author": "Fearless_Rutabaga467",
                    "score": 0,
                    "created_utc": 1652885937.0,
                    "response": "Well just have a look at who the media corporations are in bed with...",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}