{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uxw90v",
            "title": "I want to believe in bitcoin long term, but I worry about the end when there are no more bitcoin being mined and miners rely on transactions. I know it's over a century out, but I don't care! Why start down the path of investing and building out something that has an end of a wick?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uxw90v/i_want_to_believe_in_bitcoin_long_term_but_i/",
            "author": "itesasecret",
            "created_utc": 1653528272.0,
            "score": 0,
            "num_comments": 25,
            "subreddit": "Bitcoin",
            "selftext": "Genuinely looking for solid answers here as to why you believe this wont be an issue. People are not going to transact with BTC in the long run, absolutely not. Lightning doesn't help this issue with bitcoin.",
            "stickied": false,
            "comments": [
                {
                    "id": "ia0jb8x",
                    "author": "ThePronto8",
                    "score": 19,
                    "created_utc": 1653530151.0,
                    "response": "By the time miners are earning transaction fees only, I believe those fees will be lucrative enough that mining will be more in demand then ever.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia0huhk",
                    "author": "Independent-Snow-129",
                    "score": 10,
                    "created_utc": 1653529457.0,
                    "response": "Where's the problem ?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia0u693",
                    "author": "sciencetaco",
                    "score": 3,
                    "created_utc": 1653535397.0,
                    "response": "https://www.lynalden.com/bitcoin-security-modeling/",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia53x75",
                            "author": "itesasecret",
                            "score": 1,
                            "created_utc": 1653615851.0,
                            "response": "Thank you! I knew I was going to get something out of posting this from someone, and that was you! Very much appreciate this!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia0fmy6",
                    "author": "meatismoydelicious",
                    "score": 11,
                    "created_utc": 1653528440.0,
                    "response": "Considering the end point of fiat is and always has been complete devaluation, I'll take the wick and keep stacking.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia0ub35",
                    "author": "savinelli_smoker",
                    "score": 7,
                    "created_utc": 1653535468.0,
                    "response": "Because it’s 120 years out. Technology change beyond recognition in 30 years. 120 years ago radio broadcasts was the absolute latest technology. I think you’re worrying too much. That’s 4-5 generations later leave it to your great great great grand sons / daughters to tackle it",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia13acr",
                    "author": "Keith_Kong",
                    "score": 2,
                    "created_utc": 1653540927.0,
                    "response": "Blocks will continue having transactions because:\n1) Very large transactions will probably not have the liquidity on Lightning to handle them (and companies may not want to use lightning) so they will pay a high fee for on-chain exchange. Global trade will provide thousands of these.\n2) Lightning still has to settle on-chain at some point and people (at least those with high net worth) will want to store most of their wealth on-chain rather than Lightning.\n3) At a bare minimum, there will be some quantity of transaction fees each block because either the fee is cheap (and many people will want to do it) or the fee is expensive (because of high demand for transactions driving that price up).\n\nWorst case scenario, we experience a moment in time where there are way more miners in the market than is profitable to run due to a massive decrease in block rewards post last halving. This will crash the price of miners and I suppose you might need to worry about an entity buying them up to 51% attack the network. But there would have to be an absolutely massive misallocation of capital in the mining business to create this situation.\n\nIt’s not really a game theoretic problem from what I can tell… and it’s certainly not an immediate issue 😂",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia0h0x5",
                    "author": "NiceDoctorBeam",
                    "score": 4,
                    "created_utc": 1653529081.0,
                    "response": "Then hold US Dollars, which are guaranteed to keep losing value over time until it collapses.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia0hp7f",
                    "author": "Biddycola",
                    "score": 2,
                    "created_utc": 1653529391.0,
                    "response": "Your concern is legitimate. Idk shit about what happens after the last halving or have I ever even considered it. But, I’ve accepted that BTC won’t be used as means of payment (at least not like some other alts are already.) \n\nI mean, they were pushing the “store of value” narrative pretty hard during the peak of the last bullrun, and from what I remember during the 2017 bullrun, they were most definitely calling it a payments network.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia1dizs",
                            "author": "Neinfu",
                            "score": 2,
                            "created_utc": 1653548679.0,
                            "response": "The last halving reduces the block subsidy from 1 Satoshi to 0. I don't think it will make a big difference in comparison to the fees collected",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia0rccy",
                    "author": "Extremely-Bad-Idea",
                    "score": 1,
                    "created_utc": 1653533949.0,
                    "response": "I would be more worried about the US dollar becoming worthless from inflation within the next few years, than being concerned about BTC mining status a century from now.\n\nYou worry too much.  But if you are scared to hold BTC, then I'm sure many people here would be happy to buy your BTC at a discount off the current price.  I would be willing to go as high as $10,000 per BTC if you are interested.  LOLOLOLOLOLOL",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia0gj1w",
                    "author": "uncontrollableop",
                    "score": 1,
                    "created_utc": 1653528854.0,
                    "response": "people are not going to use bitcoin?i  that's your starting assumption? maybe you should question that assumption. and tell us why the actual fuck you would think such a thing. because you haven't made the slightest bit of an argument in favor of such a bold and absolute prediction.   and if your prediction is that nobody will use bitcoin, then why do you want to believe anything else?  you should definitely not invest in something that people will absolutely not use.  of course people are absolutely using bitcoin, so not sure why that would change... what are you getting at?  something is clearly not straight in your head.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia0ysj8",
                    "author": "bandoonparade",
                    "score": 1,
                    "created_utc": 1653538044.0,
                    "response": "Ah yes, you're totally right. I should also sell my car because we won't be using gasoline in fifty years. In fact, why do we even have gas stations??",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia15cfk",
                    "author": "Deathstaroperatorguy",
                    "score": 1,
                    "created_utc": 1653542365.0,
                    "response": "Ask your question again, but this time substitute “Bitcoin”for “fiat.”",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia0g163",
                    "author": "Sendmedoge",
                    "score": 0,
                    "created_utc": 1653528625.0,
                    "response": "You have the opinion thats the end of it.\nOthers dont.\nSo to answer your question why.... to them.. your point is null.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia0voc4",
                    "author": "BonusCyberTelemetry",
                    "score": 1,
                    "created_utc": 1653536223.0,
                    "response": "Truth is we don’t know. But many people believe that, as you said, miners will come to rely on transaction fees as a sufficient incentive. \nI believe people will transact with Bitcoin in the long run. I believe Lightning will be used as well. \nI’m not sure I understand your reasoning for why no one will be transacting with Bitcoin in the future.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia0xyu5",
                    "author": "kwaker88",
                    "score": 1,
                    "created_utc": 1653537554.0,
                    "response": "Can you clarify what the issue is?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia1fr00",
                    "author": "Obias0309",
                    "score": 1,
                    "created_utc": 1653550579.0,
                    "response": "Did you find a way to live longer than the average Joe? If not you do not need to worry.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia1o8t7",
                    "author": "Boe_Ning",
                    "score": 1,
                    "created_utc": 1653558177.0,
                    "response": "The vast majority of companies in operation today will not exist in 2140.  Better liquidate your 401k fast!!!!!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia30455",
                    "author": "haakon",
                    "score": 1,
                    "created_utc": 1653582643.0,
                    "response": "> People are not going to transact with BTC in the long run, absolutely not.\n\nHow are you so sure about that? Do you think blocks will be more or less empty in the future?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia1qtns",
                    "author": "maxcoiner",
                    "score": 0,
                    "created_utc": 1653560358.0,
                    "response": "You... you never heard of fees?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia3yrq5",
                    "author": "CulturedButtermilk86",
                    "score": 0,
                    "created_utc": 1653596727.0,
                    "response": "Idiot",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia4ibgo",
                    "author": "igadjeed",
                    "score": 0,
                    "created_utc": 1653605361.0,
                    "response": "Your logic is self-referential. If you discard your starting assumptions about investment and transactions, and learn about Bitcoin's original purpose, it's obvious that the transaction purpose is unaffected by the declining mining reward  \n\nTurning your logic around  \n\nIf the declining mining reward makes Bitcoin a bad long-term investment, that's because Bitcoin was never designed to be an investment\n\n> People are not going to transact with BTC in the long run\n\nYour assertion, contradicted by reality. People transact with Bitcoin today",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}