{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uuk93v",
            "title": "What happens to our crypto when we die",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/uuk93v/what_happens_to_our_crypto_when_we_die/",
            "author": "alaurence",
            "created_utc": 1653128353.0,
            "score": 75,
            "num_comments": 123,
            "subreddit": "BitcoinBeginners",
            "selftext": "Was wondering how to securely pass on my crypto info after I die (wallets, seed phrases, instructions etc) and it got me thinking - how do I safely and securely pass this info on to family when I die?\n\nDoes anyone here currently have a solution for passing on this kind of info after death that they trust?\n\n******** I'm really just putting feelers out to find out what people in the community are doing to ensure their assets don't get lost forever. ********",
            "stickied": false,
            "comments": [
                {
                    "id": "i9fongf",
                    "author": "bitusher",
                    "score": 91,
                    "created_utc": 1653128884.0,
                    "response": "The simplest solution is to place the 12 -24 seed words in a safety deposit box and than use a 5-8 word passphrase ontop of this that is secured locally in a secure location and in your memory . Your will that has a tamper proof seal can reveal the location of your passphrase and the bank they can uncover your safety deposit box upon death . Legally they would not have access to the safety deposit box until after your death \n\nThis way if your safety deposit box gets stolen or seized it would just reveal the decoy wallet with a small balance and not your real wallet \n\nIf someone prematurely opens your will you would see evidence of this and that would reveal the passphrase alone which is not enough because they would not have access to your hidden hardware wallet or backup seed words in the safety deposit box\n\nMore sophisticated solutions would be using a multisig instead",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9g1bsf",
                            "author": "Fuji-one",
                            "score": 18,
                            "created_utc": 1653137967.0,
                            "response": "I love your brain dude.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9g96uz",
                            "author": "MadMaxwell92",
                            "score": 7,
                            "created_utc": 1653142167.0,
                            "response": "Great reply. I’d like to add that making sure that the people that the btc gets passed to fully understand bitcoin, wallets, private and public keys, seed phrases etc. is highly important too. Make sure they’re comfortable with the transaction process, verifying keys and the importance of keeping your keys secure. We are all radically responsible for our own bitcoin and it must be protected.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9g9otu",
                                    "author": "bitusher",
                                    "score": 2,
                                    "created_utc": 1653142411.0,
                                    "response": "Salient point. \n\nAt minimum with those seed words one should also add the wallet used to create them and or the derivation path backup standard because not all wallet backups are created same. \n\nhttps://walletsrecovery.org/\n\nEven better some instructions on common questions, security practices and recovery in a clear manner as well. (Some one should make these to print out)",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9g9uv2",
                            "author": "MadMaxwell92",
                            "score": 6,
                            "created_utc": 1653142494.0,
                            "response": "I bet you in the next 5 to 10 years we see some sort of layer two or layer three software that will be able to set up some kind of smart contract where when the obligations are met the bitcoin automatically goes into the wallet of the heir.\n\nMaybe one day our Social Security system will be built around Blockchain and a biometric signature and a signature from your Social Security will work as the multi sig function to release the bitcoin.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9gam3p",
                                    "author": "bitusher",
                                    "score": 2,
                                    "created_utc": 1653142855.0,
                                    "response": "the big problem with multisig for backups and why I only encourage sophisticated users to use them is the need to backup a set of  long MPKs or Xpubs which are not mnemonic like BIP39 and can suffer from typos or degradation/data loss problems \n\nBitcoin covenants/vaults are being developed that address some of the concerns with security and recovery in situations like death \n\nhttps://bitcoinops.org/en/topics/covenants/\n\nhttps://bitcoinops.org/en/topics/vaults/",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9gfn6w",
                                            "author": "MadMaxwell92",
                                            "score": 1,
                                            "created_utc": 1653145208.0,
                                            "response": "So would this change to the consensus script create a fork?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9gfxsk",
                                                    "author": "bitusher",
                                                    "score": 1,
                                                    "created_utc": 1653145339.0,
                                                    "response": "At most a backwards compatible soft fork to upgrade",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9ggpot",
                                                            "author": "MadMaxwell92",
                                                            "score": 1,
                                                            "created_utc": 1653145694.0,
                                                            "response": "Ahh so there’s probably already people using covenants on lightning networks?",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9ghby9",
                                                                    "author": "bitusher",
                                                                    "score": 1,
                                                                    "created_utc": 1653145978.0,
                                                                    "response": "just on testnet",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9ixgh4",
                                    "author": "BetYouWannaKnow",
                                    "score": 2,
                                    "created_utc": 1653190569.0,
                                    "response": "I'm hard at work on this as we speak!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9hbwad",
                            "author": "cryptoripto123",
                            "score": 3,
                            "created_utc": 1653160166.0,
                            "response": "> safety deposit box\n\nThose are a pretty bad idea these days now. They aren't well regulated and banks are doing away with them already.\n\nhttps://www.nytimes.com/2019/07/19/business/safe-deposit-box-theft.html",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9hcker",
                                    "author": "bitusher",
                                    "score": -2,
                                    "created_utc": 1653160497.0,
                                    "response": "I don't subscribe to that rag , What is your exact concern ?\n\nThey can't steal your bitcoin in my example as I explain if they steal your box",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9hg0bx",
                                            "author": "cryptoripto123",
                                            "score": 2,
                                            "created_utc": 1653162180.0,
                                            "response": "Ok, if you don't want to read informative articles, that's fine, but the point isn't about banks stealing your coins. It's about contents of the safety deposit boxes being lost and you have ZERO recourse.\n\nDepending on them to keep stuff long term is extremely dangerous. If you're counting on the contents of it to be passed down reliably when you're dead, I'd look into a better storage solution.\n\nHere's the thing about banks. There's a lot of regulations pertaining to your $20 or $100 or $10,000 in your bank account. There's virtually no way to lose that and if the bank loses that, you do have a lot of legal recourse to get it back including FDIC. With safe deposit boxes, there's virtually nothing regulating it. The whole article talks about how many people have lost valuables and struggle to get anything including compensation back.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9hgxxb",
                                                    "author": "bitusher",
                                                    "score": 1,
                                                    "created_utc": 1653162644.0,
                                                    "response": "> Ok, if you don't want to read informative articles, \n\nI can't, Its pay walled, I just said I don't subscribe to them.  \n\n>It's about contents of the safety deposit boxes being lost and you have ZERO recourse.\n\nYou don't lose your bitcoin backup as the private keys are in your HW wallet and or another backup. Also how likely is this going to happen per capita of users besides some anecdotes? \n\n> I'd look into a better storage solution.\n\nSuggestion?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9ll618",
                                                            "author": "cryptoripto123",
                                                            "score": 1,
                                                            "created_utc": 1653248310.0,
                                                            "response": ">I can't, Its pay walled, I just said I don't subscribe to them. \n\nYeah but you had to throw out a low effort insult by calling it \"rag.\" It's a good publication. And for someone at least semi-technically sound enough to be in crypto, you should be running adblockers that let you read NYT and other basic paywalls.\n\n> You don't lose your bitcoin backup as the private keys are in your HW wallet and or another backup. Also how likely is this going to happen per capita of users besides some anecdotes? \n\nMaybe you should re-read this thread. It's talking about when you're dead, meaning you want a reliable way to pass down keys to next of kin. An unreliable solution ISN'T a smart idea.\n\nThis isn't about anecdotes. It's about safe deposit boxes being basically unregulated when compared to $100 in your bank account which is protected.\n\nYou can call it anecdotes or whatever, but I'm not sure why you are so set on defending safe deposit boxes when the risks are pretty clear.\n\n>No regulator formally tallies customer losses in safe deposit boxes. Mr. Pluard, who tracks legal filings and news reports, estimates that around 33,000 boxes a year are harmed by accidents, natural disasters and thefts. He often gets phone calls from people who are fighting their bank for compensation. “I tell them it’s hard, almost impossible,” he said. “What drives banks’ conduct is regulatory oversight, and none of the regulators pay any attention to safe deposit boxes. This just falls through the cracks. If the banks do something inappropriate, it’s very hard for customers to get any sort of relief.”",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9obhg4",
                                                                    "author": "bitusher",
                                                                    "score": 1,
                                                                    "created_utc": 1653308428.0,
                                                                    "response": "Don't take it personally , most journalism these days is very poor including that publication. I wasn't targeting them or you. \n\nYou are very correct that one of the goals is to insure your assets are reliably transferred. As a side note at least with bitcoin any loss in backups leads to a charitable donation to all bitcoin users as a default consequence unlike with fiat. \n\n >estimates that around 33,000 boxes a year are harmed by accidents, natural disasters and thefts.\n\nI am wondering what \"harmed\" constitutes here as its a very general list of concerns grouped. In most cases a metal backup within these \"harmed\" safety deposit boxes would be perfectly fine. Thus the more important question is how often are boxes stolen or lost .\n\nAnother question that comes to mind is how common are these concerns in  well established and trusted banks with better security vs small private businesses ?\n\nKeep in mind that I never suggested safety deposit boxes are the best solution just one of the simplest solutions. I would be curious to hear your solution to these concerns",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9qbpn8",
                                                                            "author": "cryptoripto123",
                                                                            "score": 1,
                                                                            "created_utc": 1653340563.0,
                                                                            "response": "My concern with using safe deposit boxes is this is specifically about passing down funds to your next of kin. Given how secure phrases are and if you don't have any other ones accessible, it is paramount that the passing down isn't botched. So in some ways it's just as important you ensure nothing happens to your seed phrase in storage just like you protect your seed phrase from being stolen. If anything is missing in the transfer, no one can access your key. This is why I often stress on the importance of not losing seed phrases, whereas most users including yourself seem to be stressing protection against malware. I find the former to be a more common form of lost access which users don't think about enough.\n\n>I am wondering what \"harmed\" constitutes here as its a very general list of concerns grouped. In most cases a metal backup within these \"harmed\" safety deposit boxes would be perfectly fine. Thus the more important question is how often are boxes stolen or lost .\n\nIt's unclear, but in the article it talks about banks doing some basic operations of moving stuff around. Not because they want to lose your stuff, but think about it. Over time bank buildings, vaults, etc need to be maintained, updated. So say they're renovating the safe deposit section--they probably work room by room row by row, so they may temporarily move your stuff out to renovate a room, move it back in. Now all of that can be done securely, but it doesn't mean there aren't mistakes. Also branches move too--sometimes they may decide to consolidate branches (as more people do things online these days), or new larger ones are built and they decide to move vaults. My point is human error exists and this is a threat to your seed phrase integrity.\n\n>Another question that comes to mind is how common are these concerns in well established and trusted banks with better security vs small private businesses ?\n\nGood question, but the stories in NYT article involve at least 3 of the 4 big banks.\n\n>Keep in mind that I never suggested safety deposit boxes are the best solution just one of the simplest solutions. I would be curious to hear your solution to these concerns\n\nFair enough. It is an option for a solution and I have to admit I haven't researched this enough. From a high level standpoint, you know I've been posting on here for a while but I'm a big fan of digital backups. I know there is risk involved, but nothing is risk free. If done properly, you can probably mitigate a lot of risk of malware (e.g. airgapped computers, etc.). It's far easier to have duplicate copies, stored in multiple digital vaults that can be unlocked with a passphrase the same way you are proposing (via will). Digital account access can be granted upon presentation of a death certificate (pretty typical these days for big data companies).\n\nIt's far from perfect, but I think this is something probably worth consulting an estate lawyer over.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i9qdh21",
                                                                                    "author": "bitusher",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653341354.0,
                                                                                    "response": "> new larger ones are built and they decide to move vaults. My point is human error exists and this is a threat to your seed phrase integrity.\n\nThis is a valid concern. The question remains is this risk higher than the risk of storing your seed in another location?\n\n>but the stories in NYT article involve at least 3 of the 4 big banks.\n\nI am sure it occurs in all banks, but I would be inclined to believe it might be more risky in cheap private deposit box stores.\n\n>but I'm a big fan of digital backups.\n\nThis is very risky due to bitrot concerns and proper encryption and storage in clean environments. The general rule of thumb for most people is to never store their seed words or passphrase digitally. \n\nPersonally, my suggestion of using a safety deposit box is not my own solution as I use carefully setup and tested multisig which is not easy to properly setup.\n\nThe biggest concern with multisig is not merely the complexity but dataloss from the xpubs/ypubs/zpubs that need to be backed up for recovery and aren't mnemonic(which exists in part to help prevent data loss). Any typos of the master public keys or degradation in what you have stamped/written or bitrot down can lead to loss of funds. Of course if all 3 sigs in a 2 of 3 have all 3 xpubs/ypubs/zpubs you can suffer partial data loss in 1 of the 3 but it is a concern . Typically since writing out such a long string of \"random\" characters is so cumbersome people also digitally copy the master public keys and store them digitally which also means a potential privacy concern as well.\n\nWhat would be better is a mnemonic standard for the master public keys to solve some of these concerns that is unique enough not to be confused with BIP39\n\nRight now there are not any great solutions but ones that have tradeoffs. **Your concerns with safety deposit boxes are completely valid.** I simply wish we had better data on those but I suppose this is wishful thinking. Perhaps in the future with covenants/vaults being used this would create a safer standard",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i9qn43h",
                                                                                            "author": "cryptoripto123",
                                                                                            "score": 1,
                                                                                            "created_utc": 1653345877.0,
                                                                                            "response": "> I am sure it occurs in all banks, but I would be inclined to believe it might be more risky in cheap private deposit box stores.\n\nSure. I'm not advocating for private deposit box either. The point is there's extremely little regulation here. This is like banks pre-FDIC or maybe even earlier.\n\n>This is very risky due to bitrot concerns and proper encryption and storage in clean environments. The general rule of thumb for most people is to never store their seed words or passphrase digitally. \n\nI don't advocate storing it on a personal hard drive. If HDD, then 3-2-1 rules need to apply, but I do think perhaps cloud solutions are useful provided you encrypt the files ahead of time. There are probably also other good habits such as users checking in on their solutions--for instance if a cloud backup provider you used is no longer in business, the strategy will fail, so it's important to double check these things. Big data providers like LastPass, Google, DropBox, etc may be good solutions if you want longevity.\n\nSome of my assumptions are that many of us chatting here are young, so this is more geared for the relatively young. If you're 96 years old and concerned with passing down Bitcoin, you might not even be in a physical or mental state good enough to manage backup/storage/protection schemes.\n\nHowever for those of us concerned that relatively young and healthy people can potentially suddenly die leaving millions locked away and unretrievable for their spouses, I do think a cloud backup may make sense. The addage that peopel should not enter their seed phrases digitally is solely focused on the risk of malware. However, as I said, there are ways to mitigate this with airgapped devices. I also think there's a huge difference between a one time backup versus accessing and copy pasting or typing your seed phrase on a daily basis. The latter is far more dangerous.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9h6jru",
                            "author": "International-Owl345",
                            "score": 2,
                            "created_utc": 1653157576.0,
                            "response": "Crazy this is the “simple” solution",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9h7593",
                                    "author": "bitusher",
                                    "score": 3,
                                    "created_utc": 1653157869.0,
                                    "response": "Its much simpler than having a lawyer and court system decide upon ownership of assets while family members fight for years over the estate when it comes to fiat",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9hc0w2",
                                            "author": "cryptoripto123",
                                            "score": 2,
                                            "created_utc": 1653160229.0,
                                            "response": "Same issue with Crypto though, so that's why a will is important.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9hcsp3",
                                                    "author": "bitusher",
                                                    "score": 2,
                                                    "created_utc": 1653160609.0,
                                                    "response": "Bitcoin backups greatly simplify matters because possession of private keys is what really matters with ownership unlike with registered value like fiat",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9hgodh",
                                                            "author": "cryptoripto123",
                                                            "score": 1,
                                                            "created_utc": 1653162514.0,
                                                            "response": "Unless you divide up your coins into 10 wallets for the 10 next of kin you're passing things down to, there will still be a fight for your assets. Most people probably have all their assets in 1 wallet if they follow your daily push for hardware wallets. You may still be in the same protracted legal battles about dividing up assets.\n\nLook, I think your overall strategy is good. I'm just saying unless you lay things out into different accounts, with separate wallets packaged for relative, you're going to have the same legal fights over one pile of Bitcoin. Or worse, you have the first person (most tech saavy) run off with those funds and your spouse and kids are left with nothing.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9hhfob",
                                                                    "author": "bitusher",
                                                                    "score": 1,
                                                                    "created_utc": 1653162887.0,
                                                                    "response": "> Unless you divide up your coins into 10 wallets for the 10 next of kin you're passing things down to, there will still be a fight for your assets.\n\nUsually you just have 1 person in control of the estate control the issuance. If you are concerned about not trusting anyone than multisig would be a better option \n\n>Or worse, you have the first person (most tech saavy) run off with those funds and your spouse and kids are left with nothing.\n\nBitcoin vaults and covenants solves this problem but is still being developed",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9hdjda",
                                            "author": "International-Owl345",
                                            "score": 1,
                                            "created_utc": 1653160968.0,
                                            "response": "Non-crypto assets would be “make a will”",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9hdumy",
                                                    "author": "bitusher",
                                                    "score": 2,
                                                    "created_utc": 1653161122.0,
                                                    "response": "I'm talking about the process of probate even with a will. If everything goes smoothly without any disputes the process takes months , vs with bitcoin which can take less than 1 hour. If there is any dispute(even with a will) the process can take years and be very expensive",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9hdz78",
                                                            "author": "International-Owl345",
                                                            "score": 1,
                                                            "created_utc": 1653161185.0,
                                                            "response": "Revise my comment to “make a will with a competent lawyer”. Also, your process is a lot more likely to fall into the rigamarole you described…unless there’s a will.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9he9t7",
                                                                    "author": "bitusher",
                                                                    "score": 1,
                                                                    "created_utc": 1653161331.0,
                                                                    "response": "Which reduces the process down 3-6 weeks at the quickest and costs the price of a good lawyer and has tax implications (unless you setup a trust which is more complicated and costly) unlike Bitcoin where no lawyer is needed and you can transfer the assets without tax complications in under 1 hour",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                },
                                                                {
                                                                    "id": "i9hex5i",
                                                                    "author": "bitusher",
                                                                    "score": 0,
                                                                    "created_utc": 1653161651.0,
                                                                    "response": ">Also, your process is a lot more likely to fall into the rigamarole you described…unless there’s a will.\n\nMy process includes a will as I originally explained. You technically do not need to use a lawyer with my process and with Bitcoin , control of the private keys = ownership unlike with registered value thus legal issues after the fact cannot seize any bitcoin you have easily.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9hjnft",
                                                                            "author": "andero",
                                                                            "score": 1,
                                                                            "created_utc": 1653163985.0,
                                                                            "response": "Realistically, you still need a Will.  \n(which I realize you sort of acknowledged)\n\n>with Bitcoin , control of the private keys = ownership unlike with registered value  \n\nYou could say the same about physical objects, but it doesn't really work like that.  \nIf someone goes into your house after you die and steals your couch, do they \"own\" your couch? Not legally they don't. That person does *de facto* possess your couch, but *de jure* they do not own your couch.  \n\nWe might be in a time where unregistered assets manage to slip through the cracks, but that isn't something to use as your main plan. For example, if I had a bar of gold in my house, that bar of gold would be in my Will. I would not just hope that someone desirable gets there first so they can rely on \"finders keepers\" to secure the transition of wealth.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i9hl3ku",
                                                                                    "author": "bitusher",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653164704.0,
                                                                                    "response": "> do they \"own\" your couch? Not legally they don't. \n\nThis is the point of bitcoin. What is and isn't legal starts to become moot because courts opinions on legal ownership is not effectively enforceable with bitcoin unlike with digital fiat and couches\n\n> if I had a bar of gold in my house, that bar of gold would be in my Will. I would not just hope that someone desirable gets there first so they can rely on \"finders keepers\" to secure the transition of wealth.\n\nAgreed, which in part is why covenants and vaults are created. \n\nRight now if you don't trust anyone to handle your estate multisig is the best solution as it will force a majority of the family members to decide on distribution and its game theory encourages this majority to cooperate. \n\nThis is a crude solution that allows a minority to be cheated which is what covenants/vaults intend to solve instead .",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9o9nlg",
                            "author": "BTCexecutor",
                            "score": 1,
                            "created_utc": 1653307292.0,
                            "response": "Yes, current best solutions are all some version of \"multisig\" with pros and cons:\n\n1. **Split/sharded seed phrase**: Pro: simplest, Con: drastically, exponentially, wildly reduces security of your seed phrase. Grade: F  \n\n2. **Seed and passphrase**: Pro: next simplest, Con: phrases are \"out in the open\" Grade: C  \n\n3. **Clone HWW and PIN**: Pro: Similar to split seed and passphrase, but requires physical possession of HWW and can't be taken \"on sight,\" Con: Risk of HWW failure, out of date firmware issues. Grade: C  \n\n4. **Actual multisig**: Pro: solidly secure during life and after death, Con: complicated, need a knowledgable executor or company involved, Grade B-",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9oaj4y",
                                    "author": "bitusher",
                                    "score": 1,
                                    "created_utc": 1653307847.0,
                                    "response": "The biggest concern with multisig is not merely the complexity but dataloss from the xpubs/ypubs/zpubs that need to be backed up for recovery and aren't mnemonic(which exists in part to help prevent data loss). Any typos of the master public keys or degradation in what you have stamped/written or bitrot down can lead to loss of funds. Of course if all 3 sigs in a 2 of 3 have all 3  xpubs/ypubs/zpubs you can suffer partial data loss in 1 of the 3 but it is a concern . Typically since writing out such a long string of \"random\" characters is so cumbersome people also digitally copy the master public keys and store them digitally which also means a potential privacy concern as well. \n\nWhat would be better is a mnemonic standard for the master public keys to solve some of these concerns that is unique enough not to be confused with BIP39",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9obomx",
                                            "author": "BTCexecutor",
                                            "score": 1,
                                            "created_utc": 1653308545.0,
                                            "response": "If you're referring to the multisig configuration file, my cost/benefit analysis it that digital storage is fine, does not require nearly the opsec as a seed or passphrase (Ofc everyone should DYOR and decide how important is their privacy)\n\nI consider maintaining and knowing what to do with this file part of the complexity, and hence why it'll only realistically work after death if one of your keyholders is an  executor or company knowledgeable in multisig custody\n\nFwiw I'm a professional executor and probate atty, so my perspective is based on having witnessed all the shennanigans after death with non-bitcoin probates, and how even the simplest estate plans fail.\n\nSo my pov is to keep things as **simple** and **flexible** as possible",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9oc8e9",
                                                    "author": "bitusher",
                                                    "score": 1,
                                                    "created_utc": 1653308871.0,
                                                    "response": "This is fine, but since your are personally guiding new users through this process it makes Multisig naturally a better option because of this fact. For the average person without professional assistance they should be very careful. \n\nP.S. - I personably use multisig , but its  complicated to setup right to address bitrot/dataloss problems with the master public keys and maintain privacy. I have multiple backups of the public keys in different forms physically and digitally represented",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9ftlyh",
                    "author": "itsnotlupus",
                    "score": 30,
                    "created_utc": 1653132922.0,
                    "response": "It follows us into the afterlife, much like the pharaohs of old.  \n\nHow else are crypto bros supposed to cross the Styx otherwise.  \nYou think Charon takes filthy fiat?\n\nThink Mark. Think.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9fy8m1",
                            "author": "bitusher",
                            "score": 6,
                            "created_utc": 1653136088.0,
                            "response": "I have actually considered this as a viable option, taking my bitcoin with me with death as its the easiest way to both donate value to the whole bitcoin community and help secure bitcoin network more with scarcity",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9j3wae",
                                    "author": "BlueberryDefender",
                                    "score": 1,
                                    "created_utc": 1653194828.0,
                                    "response": "Why would you taking your bitcoin help secure the network? More scarcity, pushing price up, encourages/increases overall adoption?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9jkjei",
                                            "author": "bitusher",
                                            "score": 2,
                                            "created_utc": 1653208701.0,
                                            "response": "Scarcity increases the price , which in turn encourages more adoption and higher price = more hash rate securing bitcoin",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9h08b5",
                            "author": "PeyroniesCat",
                            "score": 5,
                            "created_utc": 1653154632.0,
                            "response": "I’m crossing it using floatable tires on my ghost lambo.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9gntr0",
                    "author": "jaragon6676",
                    "score": 3,
                    "created_utc": 1653148971.0,
                    "response": "Idk if I had tons of invested crypto I’d probably get a lawyer involved utilizing a will so there’s not discrepancies with people who thought they deserved it or whatnot after I died.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9grfi3",
                    "author": "Puzzled_Raccoon8169",
                    "score": 3,
                    "created_utc": 1653150629.0,
                    "response": "If you have never experienced the loss of an older family member that left assets (of any kind, be it money, property, or just keepsakes and photos), I suggest you ask some folks who have gone thru that. It’s a shit show. Everyone wants what was left to someone else (assuming there was a will or any type of documentation), everyone thinks they should have gotten more. If you have life insurance left to a survivor spouse, the kids turn on each other to “look out” for the survivor parent AND have more control over the assets. If you don’t have a legal spouse, your siblings will fight with your children over your assets. If you have any sizeable assets get an attorney involved in your estate planning early, have the discussions with the heirs while ur ALIVE, or better yet transfer assets to them before you die. Otherwise, try your best to have barely enough to bury you without burdening anybody and hope your family stays intact and doesn’t hate each other after you die.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ft6bd",
                    "author": "rraattbbooyy",
                    "score": 10,
                    "created_utc": 1653132595.0,
                    "response": "I already had a hidden envelope labeled “do not open until I die” which contained the website and login credentials for my various investments and savings.  When I bought crypto, I just added my wallet and seed phrase info to that envelope.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9g99wg",
                            "author": "NecessaryPear",
                            "score": 6,
                            "created_utc": 1653142208.0,
                            "response": "What else do you have in there?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9gadop",
                                    "author": "rraattbbooyy",
                                    "score": 11,
                                    "created_utc": 1653142748.0,
                                    "response": "I have URLs and login credentials for all the financial websites I use.  Banking, credit card, mortgage, investment accounts, insurance, Coinbase, etc.  \n\nI have no family except for a brother, and if I die I want for him to know exactly where my money is.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9h095z",
                                            "author": "MotiongraphicsBlog",
                                            "score": 6,
                                            "created_utc": 1653154643.0,
                                            "response": "Alright we know what we are looking for then",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9h2esg",
                                                    "author": "rraattbbooyy",
                                                    "score": 3,
                                                    "created_utc": 1653155630.0,
                                                    "response": "I hope I haven’t revealed too much.  \n\nAre you hacking me right now?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9jfkr0",
                                                            "author": "LoL_LoL123987",
                                                            "score": 1,
                                                            "created_utc": 1653204218.0,
                                                            "response": "How many miles does your car have on it? Just curious…",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9jhk6u",
                                                                    "author": "rraattbbooyy",
                                                                    "score": 1,
                                                                    "created_utc": 1653205976.0,
                                                                    "response": "116,000, give or take.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9jibbm",
                                                                            "author": "LoL_LoL123987",
                                                                            "score": 2,
                                                                            "created_utc": 1653206659.0,
                                                                            "response": "You fool! You fell for it, your bitcoin are [mine now](https://www.reddit.com/r/ProgrammerHumor/comments/usseb0/your_odometer_is_your_private_key_i_guess/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i9jqgcv",
                                                                                    "author": "rraattbbooyy",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653214151.0,
                                                                                    "response": "Oh no!  I forgot about the 5g!  All my coin is now gone!",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9hvwja",
                                    "author": "Remarkable_News2455",
                                    "score": 2,
                                    "created_utc": 1653170191.0,
                                    "response": "he has a lot of btc\r  \nHahaha",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9ipzwp",
                                    "author": "mrkushnugz",
                                    "score": 1,
                                    "created_utc": 1653186357.0,
                                    "response": "That's what she said",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9h94w3",
                            "author": "XGamingMan",
                            "score": 3,
                            "created_utc": 1653158832.0,
                            "response": "Have you given this any thought my friend? In all seriousness, burn that and find another secure way",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9h9rpb",
                                    "author": "rraattbbooyy",
                                    "score": 3,
                                    "created_utc": 1653159138.0,
                                    "response": "I appreciate the concern, but my method is as secure as it needs to be.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9j0g13",
                            "author": "tabac-en-paris",
                            "score": 1,
                            "created_utc": 1653192474.0,
                            "response": "This is pretty crazy. Either it’s hidden well enough that it won’t be found when you die, or it’s not hidden well enough and it can be too easily lost.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9jhgbq",
                                    "author": "rraattbbooyy",
                                    "score": 0,
                                    "created_utc": 1653205879.0,
                                    "response": "I know the imagination can run wild when you don’t have any details, but rest assured, my info is secure.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9jih1m",
                                            "author": "tabac-en-paris",
                                            "score": 1,
                                            "created_utc": 1653206799.0,
                                            "response": "It’s not a question of imagination. Either you have a mechanism you’re not describing here, or it could be permanently lost because it’s too well hidden. If. It that then you have written down all of your most valuable information in a place it could be acquired. It’s the same fundamental problem everyone has.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9jqn5f",
                                                    "author": "rraattbbooyy",
                                                    "score": 0,
                                                    "created_utc": 1653214323.0,
                                                    "response": "I’m leaving out many details.  Just believe me when I say my info is secure. 🤷‍♂️",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9k3bww",
                                                            "author": "tabac-en-paris",
                                                            "score": 1,
                                                            "created_utc": 1653223769.0,
                                                            "response": "Nobody wants the details just an idea of the mechanism. Otherwise yeah, no I don’t believe you’ve solved the problem. \n\nand by the way maybe you don’t actually understand the question…? It’s not a question of whether the info is secure (that part is easy), it’s a question of a mechanism that deals with you disappearing and it still being useful for next of kin. “I have a letter with all my passwords in” is clearly not both secure and readily accessible after death.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9k3yzl",
                                                                    "author": "rraattbbooyy",
                                                                    "score": 0,
                                                                    "created_utc": 1653224150.0,
                                                                    "response": "Your obsession is starting to creep me out.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9ke0a8",
                                                                            "author": "tabac-en-paris",
                                                                            "score": 1,
                                                                            "created_utc": 1653229370.0,
                                                                            "response": "Let’s hope you’ve employed the same level of paranoia to your crypto security then eh?",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9fo21u",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653128353.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9fvqlf",
                    "author": "yonash53",
                    "score": 1,
                    "created_utc": 1653134442.0,
                    "response": "Give them the trezor + seed.\n\nThat's it ?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9johjz",
                            "author": "drdoubleyou",
                            "score": 1,
                            "created_utc": 1653212370.0,
                            "response": "But you’re dead in this scenario. How do you securely give them the trezor and seed phrase?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9lwur5",
                                    "author": "yonash53",
                                    "score": 1,
                                    "created_utc": 1653253669.0,
                                    "response": "Leave it In a safe and tell them the code and seed. They will figure the rest",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9fw68v",
                    "author": "igadjeed",
                    "score": 1,
                    "created_utc": 1653134731.0,
                    "response": "Some ideas  \nhttps://blog.lopp.net/fifteen-men-on-a-dead-man-s-switch/  \n\nA book, motivated by the same ideas  \nhttps://www.amazon.com/Cryptoasset-Inheritance-Planning-Simple-Owners/dp/1947910116",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9fwiu1",
                    "author": "candyclown1",
                    "score": 1,
                    "created_utc": 1653134965.0,
                    "response": "It’ll be inherited 😂😂",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9h99l7",
                            "author": "XGamingMan",
                            "score": 1,
                            "created_utc": 1653158896.0,
                            "response": "How? If it's a cold wallet and phrase isn't anywhere to be found, then how exactly?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9gd518",
                    "author": "BigfootAteMyBooty",
                    "score": 1,
                    "created_utc": 1653144050.0,
                    "response": "It goes to a farm to live its life happily with other crypto",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9h1ww4",
                    "author": "cj4130",
                    "score": 1,
                    "created_utc": 1653155400.0,
                    "response": "I know 2 ppl that have passed and their assets are still in CB",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9h6134",
                            "author": "bitusher",
                            "score": 1,
                            "created_utc": 1653157331.0,
                            "response": "Another reason to never leave your coins on an exchange or with custodian is they are allowed to legally ~~take~~ steal your bitcoin \nin as little as 3 years on inactivity \n\nhttps://help.coinbase.com/en/coinbase/managing-my-account/other/escheatment-and-unclaimed-funds",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9hxt9m",
                                    "author": "cj4130",
                                    "score": 1,
                                    "created_utc": 1653171178.0,
                                    "response": "Really? So if someone left a couple grand worth if btc on coinbase for 4yrs hoping to be rich in 5yrs they could log on and see no assets??? \nCrazy",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9hz44q",
                                            "author": "bitusher",
                                            "score": 2,
                                            "created_utc": 1653171852.0,
                                            "response": "In as as soon as 3 years exchanges can take your money with inactivity",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9h2yhc",
                    "author": "Metal_Stacks13",
                    "score": 1,
                    "created_utc": 1653155879.0,
                    "response": "It goes to the great wallet in the sky",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9h6jcp",
                    "author": "isisishtar",
                    "score": 1,
                    "created_utc": 1653157570.0,
                    "response": "All these multi-step processes, ifs-ands, and therefores just make it more clear that, society-wide, we’re going to need standardized custodial processes for crypto.  Most people, even those enthusiastic about crypto, are just not that smart or organized.\n\nwho’s going to start?  The legacy banking industry, or (hopefully) someone else?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9hx60e",
                    "author": "VisualScholar3385",
                    "score": 1,
                    "created_utc": 1653170841.0,
                    "response": "It becomes cash app it goes",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ifi5o",
                    "author": "JR-6420",
                    "score": 1,
                    "created_utc": 1653180683.0,
                    "response": "You can take it with you",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ifkil",
                    "author": "au_bits",
                    "score": 1,
                    "created_utc": 1653180719.0,
                    "response": "The MyCitadel app looks promising for the future, still in development. \n\nhttps://github.com/mycitadel",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ivhm6",
                    "author": "wildemam",
                    "score": 1,
                    "created_utc": 1653189404.0,
                    "response": "If no one finds your seed phrase, you will simply have burnt the crypto. No private key tokens. I guess that’s where deflation will happen as these sinks become common.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9jpc8u",
                    "author": "Sufficient-Doubt-134",
                    "score": 1,
                    "created_utc": 1653213147.0,
                    "response": "Like your real estate property and other possessions you own in your name, crypto is considered a probate asset. This means that it has to go through probate (the legal and court-driven process of distributing your estate) before it can be legally transferred to your beneficiaries after you die",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9jpdve",
                    "author": "Alternative-Rich-578",
                    "score": 1,
                    "created_utc": 1653213189.0,
                    "response": "Bitcoin and all other cryptocurrencies are decentralized, meaning they weren't issued by a central bank or authority. That makes it impossible for anyone to help access a loved one's account when they die, unless they possess the security key (password) and/or seed phrase to unlock their wallet",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9jpmj7",
                    "author": "Embarrassed_Gold_489",
                    "score": 1,
                    "created_utc": 1653213413.0,
                    "response": "If you hold crypto on a platform like Coinbase or Gemini or any exchange, your heirs will have to go through probate — a lengthy (and often costly) legal process — to get the money out",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ju2y5",
                    "author": "Aggravating-Ad-160",
                    "score": 1,
                    "created_utc": 1653217283.0,
                    "response": "we can inherit it. If you have a loved one who invested in cryptocurrency, they can legally bequeath it to you through their estate plan. Although cryptocurrency is a new asset class, it's still an asset just the same. It can be legally passed on upon the owner's death.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9mwt23",
                    "author": "d3vrandom",
                    "score": 1,
                    "created_utc": 1653271801.0,
                    "response": "your next of kin aren't going to grok crypto. it's better if you cash out and pass on fiat to the them. otherwise you better get your heirs some crypto training while you are alive. if they are prepared beforehand then they can handle it. otherwise they can't.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9i8otc",
                    "author": "Crypto_bro999",
                    "score": 0,
                    "created_utc": 1653176948.0,
                    "response": "I think you just can leave your crypto to your kids or reletives.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}