{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "up8m4x",
            "title": "Bitcoin wedding ring?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/up8m4x/bitcoin_wedding_ring/",
            "author": "eOg5Khe",
            "created_utc": 1652499388.0,
            "score": 3,
            "num_comments": 7,
            "subreddit": "Bitcoin",
            "selftext": "I propose with one Bitcoin?",
            "stickied": false,
            "comments": [
                {
                    "id": "i8jdtv6",
                    "author": "Big_Swede89",
                    "score": 9,
                    "created_utc": 1652500055.0,
                    "response": "She'll say no. You'll still have 1 BTC. Win/Win",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uowoi5",
            "title": "#BitcoinHydraThesis the end game",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uowoi5/bitcoinhydrathesis_the_end_game/",
            "author": "MGTOW_and_Bitcoin",
            "created_utc": 1652462458.0,
            "score": 3,
            "num_comments": 14,
            "subreddit": "Bitcoin",
            "selftext": "Only 1/19430 of these Blockchain projects are going to survive: Bitcoin... and that's because all possible Innovation throughout all of these all the altcoins has been built already on top of Bitcoin as a second layer, third layer or sidechain... consistant with the #BitcoinHydraThesis",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uo1o0k",
            "title": "Sell-off fear?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uo1o0k/selloff_fear/",
            "author": "PoensieWeit",
            "created_utc": 1652363747.0,
            "score": 4,
            "num_comments": 1,
            "subreddit": "Bitcoin",
            "selftext": "Sell-off-fear? Do not forget that this is a race to acquire as much Bitcoin as you can…   More than 90 percent of Bitcoin has already been mined.   With Bitcoin price dropping, hodlers continue to eat up only a bigger percentage of an asset that has a finite supply. It is similar to a company repurchasing its shares at discount prices. Holders buying now, during a crash, acquire triple the amount of btc than during the all time high period. Once put away in cold storage, it s off the market.   \n\nIf btc-price drops, more Bitcoin gets bought up for an equal amount of fiat money. That same money is being printed every day, so fiat supply is unlimited.   Don’t let a sell-off scare you; the fundamental reasons why you’re in Bitcoin are still intact.",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uo0mpw",
            "title": "I am pretty sure institutional players are waiting on the sidelines to scoop up some BTC for themselves.",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uo0mpw/i_am_pretty_sure_institutional_players_are/",
            "author": "sgtslaughterTV",
            "created_utc": 1652360738.0,
            "score": 3,
            "num_comments": 12,
            "subreddit": "Bitcoin",
            "selftext": "Title.\n\nThey've had plenty of time and Michael Saylor's bitcoin for business lecture was given in February of 2021. No time like the present.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8baupw",
                    "author": "dlq84",
                    "score": 3,
                    "created_utc": 1652360960.0,
                    "response": "Indeed, whales feast on paper hands' coins.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "unia2u",
            "title": "United Kingdom All-set to Introduce Crypto Framework For Safer Adoption",
            "url": "https://thenewscrypto.com/united-kingdom-all-set-to-introduce-crypto-framework-for-safer-adoption/",
            "author": "Loud_Dingo7261",
            "created_utc": 1652298542.0,
            "score": 3,
            "num_comments": 2,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i88khad",
                    "author": "Nada_Lives",
                    "score": 3,
                    "created_utc": 1652304387.0,
                    "response": "*As the embryonic asset class has become more popular, market watchdogs like the Financial Conduct Authority (FCA) have imposed a slew of rules, including a ban on numerous cryptocurrency exchanges, including Binance.*\n\nI feel safer already.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uo1yut",
            "title": "Don’t sell don’t panic",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uo1yut/dont_sell_dont_panic/",
            "author": "luckystar865",
            "created_utc": 1652364598.0,
            "score": 3,
            "num_comments": 17,
            "subreddit": "Bitcoin",
            "selftext": "This will all pass patience is the key my friends. It’s not about what you’re losing right now the whole market is taking a dump. The best thing you can do is average down and buy more stocks or more coins you’re only at a loss if you sell and this is what they want. Put your money in but don’t buy until it hit a lower price or just buy little by little $25 at a time for a coin it’ll all average it self out and the market will eventually correct it’s self. When you panic sell you’re the one becoming poorer do what the rich do hold and sell at the top don’t sell at the bottom. You’re losing your hard earned dollars and that’s what they want. This is the perfect opportunity to buy right now and get in. Go for a run work out do something beside obsess over your losses. If you can’t stomach it you shouldn’t be in the market. This is what investing is about holding when you don’t want too cause the price is down. I know many people who are at retirement age and they’re just going to leave their money alone until it recovers and it always recovers. Just buy more little by little you’ll thank me later and everyone else who has said the same thing.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8bn2ju",
                    "author": "hepazepie",
                    "score": 6,
                    "created_utc": 1652366199.0,
                    "response": "Sell? I'll buy more! It's discount season!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8bosov",
                    "author": "shawnewoods",
                    "score": 3,
                    "created_utc": 1652366877.0,
                    "response": "just bought another 2k worth, hodl.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "unraa1",
            "title": "Buffet sold out already, but making voice of negativity in Bitcoin / Cryptocurrencies just year/week ago !",
            "url": "https://www.reddit.com/r/PokketOfficial/comments/suhro8/so_not_rat_poison_squared_anymore_huh_warren/?utm_medium=android_app&utm_source=share",
            "author": "cyberwargame",
            "created_utc": 1652324951.0,
            "score": 4,
            "num_comments": 2,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uovg94",
            "title": "7 common misconceptions about how bitcoin mining helps cutting methane emissions (methane has 84x the warming effect of CO2)",
            "url": "https://twitter.com/DSBatten/status/1524566067817107456",
            "author": "polloponzi",
            "created_utc": 1652458963.0,
            "score": 3,
            "num_comments": 0,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "upgmwu",
            "title": "Book About Bitcoin?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/upgmwu/book_about_bitcoin/",
            "author": "gcthorpe",
            "created_utc": 1652532774.0,
            "score": 14,
            "num_comments": 23,
            "subreddit": "Bitcoin",
            "selftext": "Hey everyone, long time lurker… \n\nI’ve been trying to orange pill my girlfriend and her birthday is fast approaching. I’d like one of her gifts to be a book about Bitcoin, but I’m looking for a book that can be easily understood from someone who’s new to the ecosystem and has very little understanding. I’d figured some of y’all would have a good idea or two?\n\nThanks for the help!\n\nEdit: Just for the record, the book will be in addition to two other gifts she’ll be getting. This will be more of an add-on gift.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8kl62v",
                    "author": "ContraianD",
                    "score": 25,
                    "created_utc": 1652532831.0,
                    "response": "The Bitcoin Standard",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8komon",
                            "author": "usernamewastaken5",
                            "score": 9,
                            "created_utc": 1652534793.0,
                            "response": "^ this \n\nBut also buy something sweet like a necklace or some flowers, she might be expecting something along those lines from her partner",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8kphuy",
                                    "author": "Lbkelp",
                                    "score": 3,
                                    "created_utc": 1652535256.0,
                                    "response": "Yes. I would just buy the book as an additional gift to something else. Maybe shes not interested or finds it boring and then it would suck.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8knx9r",
                    "author": "reclamerommelenzo",
                    "score": 9,
                    "created_utc": 1652534409.0,
                    "response": "Definitely The Bitcoin Standard. \n\nNot only good for learning about Bitcoin, but also the concept and history of money. That's an essential part to understanding the value of Bitcoin.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ksbkb",
                    "author": "AvengedTurtleFold",
                    "score": 3,
                    "created_utc": 1652536719.0,
                    "response": "Gift books that you want others to read on your own birthday since their reading it is what you want, not necessarily what they want. You should focus on what would bring your girlfriend joy on her birthday when you choose a gift. If she hasn't explicitly expressed an interest in wanting to learn more about Bitcoin, don't get her a book on Bitcoin. \n\nBetter yet, ask her if she wants something like that and talk about it.\n\nThis applies to any other subject really. Replace \"Bitcoin\" with any other thing you don't really know or care about and consider whether you'd want to be gifted a book on that subject on your birthday.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8kn6ys",
                    "author": "cableguy_21",
                    "score": 5,
                    "created_utc": 1652534003.0,
                    "response": "Buying somebody a book that they never asked for is always risky and may be a waste. Explainer YouTube videos may be better and cheaper. Then maybe send her crypto to play with after.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "upgpzc",
            "title": "Coinbase bankruptcy and funds",
            "url": "https://www.reddit.com/r/Bitcoin/comments/upgpzc/coinbase_bankruptcy_and_funds/",
            "author": "LordMinax",
            "created_utc": 1652533068.0,
            "score": 8,
            "num_comments": 99,
            "subreddit": "Bitcoin",
            "selftext": "I heard that if Coinbase goes bankrupt, people may lose their funds on the exchange. Is that true?",
            "stickied": false,
            "comments": [
                {
                    "id": "i8ks4tj",
                    "author": "Atreyu_n_Falcor_BFF",
                    "score": 34,
                    "created_utc": 1652536625.0,
                    "response": "They are not going bankrupt. They have massive backing by big institutional players.  If it really came down to it, someone would buy them out.\n\nNow that being said, get your coins into a hard wallet and off exchanges. I moved the remainder off coinbase yesterday. Smooth transactions and no issues to report",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8ledxd",
                            "author": "CARadders",
                            "score": 5,
                            "created_utc": 1652546982.0,
                            "response": "Would the Coinbase wallet be affected? I mean I have the keys so I’m all good right?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8lg7wi",
                                    "author": "IanMichael001",
                                    "score": 5,
                                    "created_utc": 1652547818.0,
                                    "response": "You have the keys so it’s safe",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8kmy7g",
                    "author": "Sealobo",
                    "score": 52,
                    "created_utc": 1652533865.0,
                    "response": "Fake news. It's a risk disclosure in their latest quarterly as required by the SEC. It's been taken out of context.\n\nCoinbase is the most secure and transparent bitcoin (crypto) exchange out there. They're public, meaning they're also under tight surveillance by all the relevant agencies and commissions of the government. If you HAVE to store your bitcoin on an exchange, Coinbase is bar-none in terms of safety.\n\nHaving said that, if you're not an active trader, the best strategy is still self-custody.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8l8m1e",
                            "author": "Kingfisher_ybw",
                            "score": 9,
                            "created_utc": 1652544416.0,
                            "response": "It’s risk disclosure. Which means that IF Coinbase goes bankrupt, your money is gone. \n\nPeople act shocked, but that’s a rather obvious fact.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8kroxw",
                            "author": "Stoopiddogface",
                            "score": 9,
                            "created_utc": 1652536400.0,
                            "response": "Yea, this \"warning\" that they issued, was none of that.\n\nIt was disclosed in a bunch of paperwork that says if they go bankrupt your assets would go under with them... Its no different than any others id bet.\n\nEasy fix, move them off the CEX",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8klskz",
                    "author": "Informal-Act1282",
                    "score": 19,
                    "created_utc": 1652533199.0,
                    "response": "Its true, also your post might get deleted, mine got when i made an discussion.\nCeo said l funds are property of coinbase in case of bankruptcy",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8kmo48",
                            "author": "LordMinax",
                            "score": 9,
                            "created_utc": 1652533702.0,
                            "response": "That’s f@cked up.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8knpik",
                                    "author": "Fluffy_Total_1899",
                                    "score": 18,
                                    "created_utc": 1652534291.0,
                                    "response": "Not really, just the way it works. Not your key, not your coins. Need to move them off CEX.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8kww72",
                                            "author": "leeljay",
                                            "score": 5,
                                            "created_utc": 1652538980.0,
                                            "response": "Read this the other day and started moving mine off CB that night, did 3 transactions, all 3 progressively larger than the last, no problem. The next morning, tried to move a larger amount, and the transaction got flagged for suspicious activity and postponed for 3 days. Emailed them and got a response made up entirely of copy pasted information from their “Help” page. Coinbase won’t get anymore of my business after I’ve moved everything off it. I’ll print my tax paperwork and then I’ll start using Kraken or something to buy.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8l24h5",
                                                    "author": "LilBlueFire",
                                                    "score": 3,
                                                    "created_utc": 1652541466.0,
                                                    "response": "I'm moving my sats off in batches too and despite the amount being small in my head I'm like 'mwahaha let's see you cough up this amount of btc, Coinbase'",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i8kro89",
                                            "author": "sonicode",
                                            "score": 6,
                                            "created_utc": 1652536390.0,
                                            "response": "People act surprised when they hear NYKNYC, but seriously it has been posted on /r/bitcoin 100 times a day ever since Mt Gox and there are tons of youtube videos explaining exactly why this is the case (exchanges are just banks, you lend them your coins so that gives them posession) and how to protect yourself from it (get a fucking hardware wallet and get your damned coins off the exchanges plebs)  \n\n\nWho buys something valuable and then just leaves it there at the store in case they want to sell it back in a few months/years?",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i8lbtn6",
                                    "author": "Sabertoothkittens",
                                    "score": 3,
                                    "created_utc": 1652545846.0,
                                    "response": "news flash Bitcoin isn't FDIC insured?! insert shocked Pikachu face.\n\nthat's the deal with literally every CEX \"not your keys not your coins\" is not hyperbole. The bright side is that Coinbase made over $4 billion in profit last year has $7 billion in cash and has tripled their number of employees in the last year. I would be more concerned about Robinhood who lost $3.6 billion in the last year and recently laid off 10% of their work force",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8klvjt",
                    "author": "oachkatzalschwoaf",
                    "score": 7,
                    "created_utc": 1652533245.0,
                    "response": "Not you keys not your money.\n\nCrypto on exchanges cant be Safu.\nAll your coins might get lost on any exchanges Bankruptcy.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8kmfnk",
                    "author": "RakDizzle",
                    "score": 7,
                    "created_utc": 1652533565.0,
                    "response": "I’m still going to use them. 256 Billion in assets (the ones they had to report) + decent operating costs. Don’t see them in a bankruptcy court anytime soon…",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ko3k9",
                    "author": "Amoci",
                    "score": 3,
                    "created_utc": 1652534505.0,
                    "response": "[https://www.youtube.com/watch?v=1zcoaKP2ieg](https://www.youtube.com/watch?v=1zcoaKP2ieg)\n\n5 minutes of dodging, but basically, yes.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8kx54s",
                    "author": "Impressive_Ruin2775",
                    "score": 3,
                    "created_utc": 1652539099.0,
                    "response": "Yes, when a company goes bankrupt, people lose their funds. Economics 101.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uphohu",
            "title": "Did the IMF crash Bitcoin to make El Salvador look bad?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uphohu/did_the_imf_crash_bitcoin_to_make_el_salvador/",
            "author": "CryptoDApper",
            "created_utc": 1652536254.0,
            "score": 52,
            "num_comments": 196,
            "subreddit": "Bitcoin",
            "selftext": "A bit of a conspiracy theory for those interested. Today news articles started to pop up from multiple supposedly unconnected media - their message was uncanningly similar though; El Salvador has lost so much money on Bitcoin that they can’t pay back their due IMF loans. In fact, the loan payment they will forfeit is almost exactly the amount they’ve invested in Bitcoin - well isn’t that a big coincident.. It all just seems too convenient as if it’s all part of a plan to make El Salvador look bad and to discurage other rogue states to break free from the IMF monetary prison system.\n\nhttps://www.bloomberg.com/news/articles/2022-05-12/el-salvador-s-bitcoin-losses-are-as-big-as-its-next-bond-payment\n\nhttps://www.bloomberg.com/news/articles/2022-05-10/el-salvador-s-bitcoin-losses-swell-to-28-as-bukele-buys-more\n\nhttps://e24-no.translate.goog/boers-og-finans/i/wOBPKn/el-salvador-trues-av-statskonkurs-etter-bitcoin-kjoep?_x_tr_sl=auto&_x_tr_tl=en&_x_tr_hl=no&_x_tr_pto=wapp",
            "stickied": false,
            "comments": [
                {
                    "id": "i8ksutj",
                    "author": "NiceDoctorBeam",
                    "score": 112,
                    "created_utc": 1652536988.0,
                    "response": "Tell us how the IMF could crash Bitcoin.  Convince us it is even possible.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8leb6r",
                            "author": "DisorientedPanda",
                            "score": 23,
                            "created_utc": 1652546948.0,
                            "response": "They rang the Bitcoin ceo and asked",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8mnmso",
                                    "author": "Smackolol",
                                    "score": 6,
                                    "created_utc": 1652567880.0,
                                    "response": "Good ol’ Bit Coinstein, he’s a shady fella.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8ktg1n",
                            "author": "carpetedman",
                            "score": 30,
                            "created_utc": 1652537281.0,
                            "response": "I'm still stuck on the idea that El Salvador has a **mortgage** payment.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8ktw9o",
                                    "author": "learner77",
                                    "score": 20,
                                    "created_utc": 1652537507.0,
                                    "response": "It’s a REALLY big house ;)",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8m29b7",
                                    "author": "Financial_Chemist286",
                                    "score": 14,
                                    "created_utc": 1652557972.0,
                                    "response": "The USA is not a country, it’s a corporation.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8m3kdt",
                                            "author": "ThatOrdinaryJoe",
                                            "score": 4,
                                            "created_utc": 1652558577.0,
                                            "response": "USA Inc.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8m4i2n",
                                                    "author": "Financial_Chemist286",
                                                    "score": 9,
                                                    "created_utc": 1652559006.0,
                                                    "response": "And everyone with a social security number is a good little employee of said Inc. including allowing your corporate father to educate you and of course learn how to take it on the chin for being a good patriot using USD while it’s debased.  \n\nFederal Debt Slaves ;We’re all collateralized",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8m88zc",
                                                            "author": "Mojicana",
                                                            "score": 5,
                                                            "created_utc": 1652560733.0,
                                                            "response": "I am now the gold standard. They bet everything that I'll be paying taxes forever.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i8ku37q",
                                    "author": "CryptoDApper",
                                    "score": 7,
                                    "created_utc": 1652537605.0,
                                    "response": "Sorry about that, english is not my native language, fixed it now.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8l9wgo",
                            "author": "I-make-ada-spaghetti",
                            "score": 10,
                            "created_utc": 1652544996.0,
                            "response": "Easy.\n\n1. Convince Tether to mint them enough USDT to move the spot price during a period of low trading volume.\n2. Buy the dips.\n3. Offload accumulated Bitcoin at significant price levels when trading volume dies down.\n\nI don’t think this was done but it is possible.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8m741h",
                                    "author": "yuckfoubitch",
                                    "score": 5,
                                    "created_utc": 1652560202.0,
                                    "response": "The IMF is not a prop firm or hedge fund. They wouldn’t take trading risk like this, ever",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8lpknv",
                                    "author": "KnightzEnd2",
                                    "score": 3,
                                    "created_utc": 1652552074.0,
                                    "response": "Thank you... it is insane how people think bitcoin is untouchable",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8luk98",
                                            "author": "generateduser29128",
                                            "score": 8,
                                            "created_utc": 1652554359.0,
                                            "response": "Bitcoin is untouchable, but price action and laws aren't.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8lv407",
                                                    "author": "KnightzEnd2",
                                                    "score": 3,
                                                    "created_utc": 1652554614.0,
                                                    "response": "Manipulation of price in grand ways is not bitcoin being untouchable. It may be virtually impossible to kill but it can damn sure be manipulated and touched.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8lvxoz",
                                                            "author": "generateduser29128",
                                                            "score": 4,
                                                            "created_utc": 1652554999.0,
                                                            "response": "They can put forth hostile legislations and manipulate the price for some time, but they can't change consensus rules or the underlying fundamentals. It has too much political support to outright ban at this point, so it's going to recover and increase adoption eventually.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8lwn3d",
                                                                    "author": "KnightzEnd2",
                                                                    "score": 4,
                                                                    "created_utc": 1652555328.0,
                                                                    "response": "Yes, but if this conspiracy theory is true they did not need to kill it. They simply wanted to delay it by making el salvador fail.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i8lgkju",
                                    "author": "DigitaleDukaten",
                                    "score": 4,
                                    "created_utc": 1652547977.0,
                                    "response": "This is like \"just buy the deepest dip and sell the tippitytop\"",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8lkk3f",
                                            "author": "sexyhoebot",
                                            "score": 8,
                                            "created_utc": 1652549800.0,
                                            "response": "no its like saying all you gotta do is bribe the right person at tether",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8m5t4u",
                            "author": "brohamsontheright",
                            "score": 4,
                            "created_utc": 1652559602.0,
                            "response": ">Tell us how the IMF could crash Bitcoin.  Convince us it is even possible.\n\nAre you serious? The IMF has unlimited access to capital... \n\n1. Buy lots of Bitcoin on the dips.. slowly, but steadily, over the course of many months, or years.\n2. When you're ready to \"crash\" the price -- sell it all, on the open market, in giant heaps to create fear.  Spread those dumps out over a few weeks if you really want to give it a bloody nose.\n3. This will create ENORMOUS fear, and the market will do the rest... \n4. If it looks like it's going to recover, start against from step 2.\n5. Repeat. Repeat. Repeat from step 1 until nobody believes in Bitcoin anymore -- or until you own every token not in long-term cold storage. (Mission accomplished, in either case).\n\nThis narrative that Bitcoin can't be manipulated is absolutely ABSURD. Given the small amount of float at any given time, \"crashing\" the price of Bitcoin, and keeping the price suppressed, could be done for as little as a few billion dollars. Chump change to the fed or the IMF.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8lbvdz",
                    "author": "KaiSosceles",
                    "score": 18,
                    "created_utc": 1652545868.0,
                    "response": "Did the IMF crash Bitcoin the last 9 times it dropped more than 50%?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8m6opr",
                            "author": "Scam_Destroyer",
                            "score": 7,
                            "created_utc": 1652560003.0,
                            "response": "No, i did. But i ran out of borrowed bitcoins and now im angry. :)",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8lgnkn",
                    "author": "Level_Willingness790",
                    "score": 14,
                    "created_utc": 1652548015.0,
                    "response": "No. The imf crashed netflix to make dave chapelle look bad.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8lj9sz",
                    "author": "Engine_Light_On",
                    "score": 11,
                    "created_utc": 1652549213.0,
                    "response": "Omg how can people disregard FED rate increase and every tech stock plummeting and think it is just a conspiracy to bring BTC down?\n\n\n\nJeez, open any finance website and read. Don’t get all your information from your echo chamber",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8l3bv2",
                    "author": "zeycus",
                    "score": 31,
                    "created_utc": 1652542022.0,
                    "response": "Let's see. Using a search engine, El Salvador has a current debt of about 20,000,000,000 USD. Bukele claims to have bought 2,300 BTC. Worst case scenario, assume all was bought ATP, so the loss would be about 2300 \\* 30000 USD = 70,000,000 USD. I know it is less, but anyway. Are they saying that El Salvador is defaulting because of a loss of 70 million, whet your debt is 20,000 million? Seriously?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8lbq0r",
                            "author": "Earth2Andy",
                            "score": 7,
                            "created_utc": 1652545801.0,
                            "response": "There’s a specific $800M due in January, that  El Salvador borrowed 10yrs ago and has no way to pay it back.  That’s what they think they’ll default on.  \n\nSpending $150M on Bitcoin (buying it and rolling it out to your whole country) rather than trying to pay back some of your $800M in debt is not a great way to get people to lend you more money.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8l786j",
                    "author": "Shougee369",
                    "score": 17,
                    "created_utc": 1652543790.0,
                    "response": "if bitcoin can be “manipulated” to crash then it deserves to crash.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8m4o8z",
                            "author": "EntaronAdun",
                            "score": 4,
                            "created_utc": 1652559084.0,
                            "response": "The IMF sits on a shit ton of money, they can buy a shit ton of Bitcoin and then sell it all at once to create a crash.\n\nThe price of everything can be manipulated with enough power.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8mft2k",
                                    "author": "CryptoDApper",
                                    "score": 3,
                                    "created_utc": 1652564216.0,
                                    "response": "Preach!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8lh0zi",
                            "author": "L_Tryptophan",
                            "score": 8,
                            "created_utc": 1652548187.0,
                            "response": "a handful of rich assholes have enough money to easily crash ANY market hard and then allow retail to sell the bottom. It is unfortunate that the wealth inequality is so great, it can allow this to happen. \n\nIts doesn't deserve to crash",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8lcwvv",
                            "author": "CryptoDApper",
                            "score": 3,
                            "created_utc": 1652546327.0,
                            "response": "I think you can crash any stock too if you have enough money, or any market given enough time and resources.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8lnl5n",
                    "author": "Rokey76",
                    "score": 15,
                    "created_utc": 1652551180.0,
                    "response": "This is like thinking because Bill Gates said a pandemic would happen, and then it did, he must have created the virus.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8kytd8",
                    "author": "Lazy-Substance-5161",
                    "score": 4,
                    "created_utc": 1652539901.0,
                    "response": "I hope they recover.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8l3myz",
                    "author": "LordHaldon",
                    "score": 3,
                    "created_utc": 1652542164.0,
                    "response": "El Salvador is not a \"rogue\" state and if the IMF wanted to act in a manner to kill off the El Salvador experiment, they could. All will come to light when El Salvador has to renegotiate its loans in Jan 2023. The dip has happened and it was all noise. We all know where bitcoin is heading and that this is but a blimp.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8lf2yx",
                    "author": "NoShip7475",
                    "score": 3,
                    "created_utc": 1652547297.0,
                    "response": "Yes all 2% LOL",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8kspn7",
                    "author": "FucktheCaball",
                    "score": 16,
                    "created_utc": 1652536915.0,
                    "response": "I don’t think it’s conspiracy but fact. The IMF are a bunch of banker thugs who force countries through regime change either by loans they can’t pay back or installing one of their men as the new president or invade them with another countries army (USA). Look at any country that don’t have a central bank, they are always demonized. If the Bitcoin would work out it would free to many people and countries rendering the IMF and all central banks useless the globalist would loose all control over us and their plan would start to unravel.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8kt29i",
                            "author": "Userid77",
                            "score": 15,
                            "created_utc": 1652537091.0,
                            "response": "The great rest is underway right now. Klaus Schwab, the WEF and the rest of the cabal need to be arrested and tried for crimes against humanity.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8ku9r9",
                                    "author": "FucktheCaball",
                                    "score": 11,
                                    "created_utc": 1652537695.0,
                                    "response": "I agree",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8l5b43",
                                            "author": "Floridaman__________",
                                            "score": 3,
                                            "created_utc": 1652542924.0,
                                            "response": "User name checks out^",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8l1c2n",
                    "author": "bitrequest",
                    "score": 7,
                    "created_utc": 1652541095.0,
                    "response": "Well, they don't like Bitcoin, that's a fact.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8lahcm",
                    "author": "Earth2Andy",
                    "score": 14,
                    "created_utc": 1652545245.0,
                    "response": "Jesus, the lack of understanding of basic economics here is staggering.\n\nEl Salvador borrowed $800M almost 20 years ago, in January it’ll be time to pay it back.\n\nDue to massive amounts of corruption and a huge violence problem, the El Salvadorian economy is in the shitter, the govt continues to spend far more than it takes in in taxes.  None of this is new or the doing of the IMF.\n\nIn the last year El Salvador has taken $150M of tax revenue and decided to try and get out of this mess.  \n\nThey could have invested it creating manufacturing jobs to grow the economy , \n\nThey could have used it to stamp out corruption and try to attract foreign investment.\n\nThey could have spent it on generating green energy to sell to their neighbors.\n\nBut no, they decided to YOLO it into a crypto and lost.\n\nSo now they are going to the IMF saying “Can we borrow more money please?” and the IMF is quite reasonably saying “If we give you this money do you promise to invest it in growing your economy in ways proven to work and not YOLO it again?”\n\nYet somehow the Bitcoin community thinks that’s the IMF trying to stamp out Bitcoin.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8lfvyu",
                            "author": "IanMichael001",
                            "score": 7,
                            "created_utc": 1652547666.0,
                            "response": "Either way they wouldn’t have the money so I don’t get your point. IMF gave loans to a country they knew wouldn’t be able to pay back to control them, china does the same thing.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8lhqyv",
                                    "author": "Earth2Andy",
                                    "score": 4,
                                    "created_utc": 1652548520.0,
                                    "response": "If they can’t pay it all back they have 2 choices…\n\n1/ Borrow the money, by convincing someone they can make the payments on the new loan\n\n2/ Don’t pay it and nobody will ever lend to them again \n\nIf they want to go with #1, they have to convince the new lender that they’ve got a way to cover the new payments.  Most lenders would rather see you investing in growing jobs and building up industries, rather than betting on Bitcoin going up.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8loht5",
                                            "author": "IanMichael001",
                                            "score": 3,
                                            "created_utc": 1652551583.0,
                                            "response": "Option 1 is quite literally the world banks plans. Enslave them.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8lh4ht",
                            "author": "_CypherIO",
                            "score": 3,
                            "created_utc": 1652548231.0,
                            "response": "> they decided to YOLO it into a crypto and lost.\n\nIt was not into 'crypto' in this case but into Bitcoin and they didn't lost a single sat if they didn't panic sell.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8lk87m",
                                    "author": "bittenbycoin",
                                    "score": 3,
                                    "created_utc": 1652549649.0,
                                    "response": "You know, I get the feeling there's two kinds of fomo. There's that external fomo when everyone around you is getting in and you get swept along. But there's also this internal fomo for those who had their internal light switch go on regarding bitcoin. I've got to get in, I now realize how important this is and I have to get in ASAP! There is no way I can  wait and wait for an optimal entry point - the time is now, says my internal light bulb. \n\nSo if you are hit by internal fomo, there's a lot of luck involved, in the short term, that it happened at an optimal price entry point. Win some lose some in the short term, but in the long term there is not much doubt what the outcome will be.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8lt9m6",
                    "author": "LastRecognition4151",
                    "score": 4,
                    "created_utc": 1652553764.0,
                    "response": "Everything is a conspiracy these days. Go outside, people.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8l4x9n",
                    "author": "lilroadsta",
                    "score": 3,
                    "created_utc": 1652542753.0,
                    "response": "El Salvador isn’t that important anyways. It’s not like it’s the ghetto in America.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ktvsp",
                    "author": "VariousTransition795",
                    "score": 4,
                    "created_utc": 1652537500.0,
                    "response": "lol - your theory is missing some polish.\n\nEl Salvador bought most of his stack at a $30K price tag.\n\nCurrent BTC price $29K\n\nGuess where the price was between the start of this journey and now.\n\nSeriously, use numbers only on your calculator (and share source).",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uphkop",
            "title": "Bitcoiners evolves eventually",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uphkop/bitcoiners_evolves_eventually/",
            "author": "givethought",
            "created_utc": 1652535899.0,
            "score": 146,
            "num_comments": 30,
            "subreddit": "Bitcoin",
            "selftext": "&#x200B;\n\nhttps://preview.redd.it/8i7g7cw44gz81.jpg?width=500&format=pjpg&auto=webp&s=c2a869c258a767f6d75932b9e7f1c045fb72f3d5",
            "stickied": false,
            "comments": [
                {
                    "id": "i8ktf35",
                    "author": "Bedroom-Eastern",
                    "score": 75,
                    "created_utc": 1652537268.0,
                    "response": "In god we trust - dollar note\n\nProof of work - bitcoin",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8lkx79",
                            "author": "Hefty_Jicama",
                            "score": 7,
                            "created_utc": 1652549970.0,
                            "response": "We’re all Satoshi",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8m1l9k",
                                    "author": "noddingacquaintance",
                                    "score": 11,
                                    "created_utc": 1652557656.0,
                                    "response": "What if satoshi is the friends we made along the way?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8m66tl",
                                            "author": "Into-the-Beyond",
                                            "score": 4,
                                            "created_utc": 1652559777.0,
                                            "response": "You’re saying they’re all dead and didn’t leave me the keys to their wallets?",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8mb8wy",
                            "author": "immersive-matthew",
                            "score": 6,
                            "created_utc": 1652562117.0,
                            "response": "In decentralization we trust",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8m6fqd",
                            "author": "Antoni8024",
                            "score": 4,
                            "created_utc": 1652559889.0,
                            "response": "In code we trust",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8l7vo3",
                    "author": "PerformanceVarious45",
                    "score": 10,
                    "created_utc": 1652544087.0,
                    "response": "Since 1913 my friend",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8lite7",
                            "author": "givethought",
                            "score": 5,
                            "created_utc": 1652549003.0,
                            "response": "yeah, I was thinking that. I just wanted to direct people to the year, because so much has declined specifically since 1971",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8ksoxw",
                    "author": "Novel-Counter-8093",
                    "score": 18,
                    "created_utc": 1652536905.0,
                    "response": "thats crazy bro. ever smoke DMT after buying BTC?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8kwkc7",
                            "author": "leeljay",
                            "score": 17,
                            "created_utc": 1652538821.0,
                            "response": "Dimethyltryptacoin",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8kwzui",
                                    "author": "Novel-Counter-8093",
                                    "score": 4,
                                    "created_utc": 1652539027.0,
                                    "response": "now that sounds like an awesome name for a shitcoin",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8kx9bx",
                                            "author": "leeljay",
                                            "score": 3,
                                            "created_utc": 1652539156.0,
                                            "response": "🤔 hmmm",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8le4oo",
                            "author": "BTCMachineElf",
                            "score": 5,
                            "created_utc": 1652546869.0,
                            "response": "If you do, you might meet me.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8l0qx0",
                            "author": "NYKNYb",
                            "score": 6,
                            "created_utc": 1652540816.0,
                            "response": "Weed & Bitcoin meditation goes well together.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8m3rge",
                    "author": "mediablitz91",
                    "score": 7,
                    "created_utc": 1652558666.0,
                    "response": "Been in this since 2017 doesn’t even bother me anymore watching it drop 40% in a week I’ve seen this go up just as fast. It’s how crypto works",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8mkyy2",
                            "author": "DigitaleDukaten",
                            "score": 3,
                            "created_utc": 1652566630.0,
                            "response": "Its how bitcoin works*\n\nNot so sure about (some) alts, but 99% sure about bitcoin.\n\nThat last 1% though,... always scary.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8krs6n",
                    "author": "Hot_Necessary_2618",
                    "score": 3,
                    "created_utc": 1652536446.0,
                    "response": "Love it",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "upgc2v",
            "title": "Michael Saylor Just Called Cathie Wood's $1M Bitcoin By 2030 Prediction \"Conservative\" (short audio clip)",
            "url": "https://podclips.com/c/ndutb6?ss=r&ss2=bitcoin&d=2022-05-14",
            "author": "PodClips",
            "created_utc": 1652531704.0,
            "score": 52,
            "num_comments": 24,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8lc59y",
                    "author": "truthseeking_missel",
                    "score": 20,
                    "created_utc": 1652545990.0,
                    "response": "McAfee's ghost rises again",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8kvb9i",
                    "author": "Inca30",
                    "score": 15,
                    "created_utc": 1652538208.0,
                    "response": "Could be, who knows - but let's hope so. However, the next few months could be choppy for bitcoin - and terminal for many altcoins. This week may turn out to have been just Round 1 of a big shakeout. Bitcoin will come through but I suspect a lot of second-tier coins will now begin a gradual fade against bitcoin. Bear markets usually herald a flight to quality and that means money into bitcoin that would hitherto have gone into coins we don't name in polite company.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8m6u1x",
                    "author": "mikesevnteen",
                    "score": 3,
                    "created_utc": 1652560070.0,
                    "response": "It won't be long to wait, and then it will become clear whether she was conservative?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8o1oxt",
                    "author": "no-intrinsic-value",
                    "score": 3,
                    "created_utc": 1652595896.0,
                    "response": "I’m extremely bullish on BTC long term, but Saylor annoys me.  His moonboi vibe with mainstream media makes many no coiners think BTC is hype driven BS.  \n\nBTC ain’t NFTs.  We don’t need evangelists.  It speaks for itself at this point.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8mo10r",
                    "author": "Dry-Cardiologist2187",
                    "score": 5,
                    "created_utc": 1652568061.0,
                    "response": "$100M by 2025. That's my conservative estimate.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8m64a1",
                    "author": "Downtown-Ad-4117",
                    "score": 3,
                    "created_utc": 1652559744.0,
                    "response": "Whatever happens, it won't be what majority plebs believe now.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8mp0vb",
                    "author": "glasswiper69",
                    "score": 3,
                    "created_utc": 1652568533.0,
                    "response": "heh.. dollar just keeps losing value, it's probably gonna be even more",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}