{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "v0eo14",
            "title": "Are we headed for a secular commodity boom and what would that look like for bitcoin?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/v0eo14/are_we_headed_for_a_secular_commodity_boom_and/",
            "author": "PenroseB",
            "created_utc": 1653841352.0,
            "score": 0,
            "num_comments": 8,
            "subreddit": "Bitcoin",
            "selftext": "Recently a trend broke in the S&P 500/Commodities index that suggests we could be headed for an equities secular bear market that could last quite a while. This is usually followed by a commodities boom.\n\nSince there are only ever going to be 21M bitcoin and there is no central bank to add to the supply as the bitcoin economy expands.. that would make bitcoin a commodity and due to the way the technology works (4M coins lost forever and counting) this commodity is quite scarce and will only get scarcer.\n\nBitcoin already acts as a safe haven for wealth outside the reach of greedy bankers and wallstreet charlatans.\n\nIn addition to the safe haven we know and love, we are now seeing that bitcoin can take shots at major companies such as western union in the world of money transfers with El Salvador estimating their recent adoption of bitcoin will cost money transfer companies upwards of 400M per year.\n\nThe argument that bitcoin has no real use is entirely invalid and holds no merit whatsoever, mass adoption could continue off third world money transfer savings alone.\n\nSo I guess my question is, if a commodities boom is about to happen and we are actually the first digital commodity, wouldn't it make sense that we would decouple from the stock market?",
            "stickied": false,
            "comments": [
                {
                    "id": "iag7hcq",
                    "author": "class-action-now",
                    "score": 3,
                    "created_utc": 1653845987.0,
                    "response": "If you look at commodities charts for the last 100 years it follows a bull/bear alternating pattern. It’s quite clear and we seem to be entering the bull market for commodities. These trends last from 10-40 years. George Gammon did a video about this last month maybe?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iag8d94",
                            "author": "PenroseB",
                            "score": 1,
                            "created_utc": 1653846395.0,
                            "response": "The trend is there. To make it even more interesting JPM did an article the other day about bitcoin starting to move more like gold 👀\n\nhttps://fortune.com/2022/05/27/bitcoin-gold-institutional-investment-jpmorgan-shocking-chart/amp/",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iag8f35",
                            "author": "drock1705",
                            "score": 1,
                            "created_utc": 1653846418.0,
                            "response": "George Gammon 💪",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iag13ay",
                    "author": "Nada_Lives",
                    "score": 2,
                    "created_utc": 1653843086.0,
                    "response": "Just looking at the corruption and control the fiat system has over our lives was enough for me. I've been worried that my wealth could only be preserved by moving my money into the few narrow categories that they totally rule, stocks, bonds, IRAs, etc.\n\nNada has left the building, with his Bitcoin.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iagsiun",
                    "author": "mrv1ckt3r",
                    "score": 1,
                    "created_utc": 1653855833.0,
                    "response": "21 Million Bitcoin*",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaguvtn",
                            "author": "PenroseB",
                            "score": 1,
                            "created_utc": 1653856986.0,
                            "response": "Whoops 😅",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iafzo8o",
                    "author": "solomonsatoshi",
                    "score": 2,
                    "created_utc": 1653842446.0,
                    "response": "China and Russia are at war with the West.\n\nhttps://www.newyorker.com/news/daily-comment/russia-and-china-unveil-a-pact-against-america-and-the-west\n\nRussia openly in a military and commodity war...China more subtly in the economic, strategic influence and monetary realms...although Taiwan is on the horizon as a military conflict.\n\nChinas Belt and Road program is a broad long term strategy for global resource and infrastructure empire. The tertiary layer of this program includes a monetary system using digital Yuan (DCEP). China has already banned Bitcoin as a MoE and most of Asia has banned use of Bitcoin as MoE, under pressure from China, their largest trade partner.\n\nUSD vs DCEP vs BTC",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iag419y",
                    "author": "uncontrollableop",
                    "score": 1,
                    "created_utc": 1653844413.0,
                    "response": "markets aren't physics",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}