{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uwkjfg",
            "title": "A Declaration of the Independence of Cyberspace",
            "url": "https://www.eff.org/cyberspace-independence",
            "author": "NYKNYb",
            "created_utc": 1653374219.0,
            "score": 2,
            "num_comments": 1,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9s2t24",
                    "author": "coinfeeds-bot",
                    "score": 1,
                    "created_utc": 1653374725.0,
                    "response": "tldr; In an open letter to the governments of the Industrial World, the author wrote, \"I come from Cyberspace, the new home of Mind. On behalf of the future, I ask you of the past to leave us alone. You are not welcome among us. You have no sovereignty where we gather. We have no elected government, nor are we likely to have one,\" he added.\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR.*",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uwkg5o",
            "title": "Reserve Bank of India Governor: #Bitcoin has no underlying value.",
            "url": "https://i.redd.it/yiusl19pbd191.png",
            "author": "Ahad_Chee",
            "created_utc": 1653373819.0,
            "score": 0,
            "num_comments": 7,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9s2dar",
                    "author": "Helen666_Keller",
                    "score": 1,
                    "created_utc": 1653374368.0,
                    "response": "What's Indias underlying value again?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9s3mgq",
                            "author": "Black_Labs_Matter69",
                            "score": 1,
                            "created_utc": 1653375408.0,
                            "response": "They poop outside and bathe in cow piss…there’s something there just not sure what",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9s29ot",
                    "author": "Ne0_sphere",
                    "score": 1,
                    "created_utc": 1653374289.0,
                    "response": "As did the Internet.\n\n\nOnce upon a time.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9s3kni",
                    "author": "Black_Labs_Matter69",
                    "score": 1,
                    "created_utc": 1653375364.0,
                    "response": "This country also has the highest rate of outdoor defecation of any developing country in the world…so jot that down while you shovel this man’s bullshit.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9s3pi9",
                    "author": "mattoratto",
                    "score": 1,
                    "created_utc": 1653375480.0,
                    "response": "Oh please, can this old fuckdrum generation die already",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uwkbmb",
            "title": "Bitcoin and the American Experiment Saylor/Lummis/Cruz @ Heritage Foundation",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uwkbmb/bitcoin_and_the_american_experiment/",
            "author": "Emotional-Ad-3475",
            "created_utc": 1653373279.0,
            "score": 3,
            "num_comments": 1,
            "subreddit": "Bitcoin",
            "selftext": "[https://twitter.com/Heritage/status/1528859061013204992](https://twitter.com/Heritage/status/1528859061013204992)",
            "stickied": false,
            "comments": [
                {
                    "id": "i9s56e2",
                    "author": "Bitcoin__Hodler",
                    "score": 1,
                    "created_utc": 1653376758.0,
                    "response": "ty for sharing",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uwkef8",
            "title": "Gambling addiction.",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uwkef8/gambling_addiction/",
            "author": "aceops23",
            "created_utc": 1653373618.0,
            "score": 49,
            "num_comments": 64,
            "subreddit": "Bitcoin",
            "selftext": "So I had a gambling addiction with casinos and lottery tickets etc. I’ve cut that out cold turkey and use the money from that to buy BTC. I know absolutely nothing about BTC besides how volatile it is but I mean, can’t be worse than me throwing hundreds away every day playing lottery. Right? I need something to fill the void, might as well try BTC since lottery wasn’t working. Can’t wait to make my first dollar!",
            "stickied": false,
            "comments": [
                {
                    "id": "i9s3dhe",
                    "author": "wwmore11",
                    "score": 80,
                    "created_utc": 1653375196.0,
                    "response": "Don’t trade. Your addiction will ruin you trading crypto.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9s3f0s",
                            "author": "aceops23",
                            "score": 56,
                            "created_utc": 1653375232.0,
                            "response": "I’ll just keep buying",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9scvs9",
                                    "author": "SuccessfulTea3959",
                                    "score": 17,
                                    "created_utc": 1653383898.0,
                                    "response": "good answer!",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9sz1uc",
                                    "author": "MatthiasLee11",
                                    "score": 5,
                                    "created_utc": 1653398850.0,
                                    "response": "Imagine trading, but whenever you want to sell, you buy instead",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9sqtm4",
                            "author": "afBeaver",
                            "score": 5,
                            "created_utc": 1653394431.0,
                            "response": "This is important. Trading is basically gambling.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9sczbw",
                    "author": "Tichy",
                    "score": 9,
                    "created_utc": 1653383986.0,
                    "response": "Move the BTC into cold storage and make them hard to get to. That may help prevent you from gambling with it.\n\nYou can set it up in such a way that you can always send BTC you buy to that cold storage address, but it would be a chore to get them out again.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9s89j5",
                    "author": "ikkatop",
                    "score": 7,
                    "created_utc": 1653379542.0,
                    "response": "Probably ok providing you're not leverage trading and just stacking.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9s63c3",
                    "author": "Kie_ra",
                    "score": 8,
                    "created_utc": 1653377574.0,
                    "response": "BTC is still gambling but it is completely in your hands. Can't lose anything if you never intend to sell and just hodl.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9sho4p",
                            "author": "Temporary_Deer_7116",
                            "score": -1,
                            "created_utc": 1653388118.0,
                            "response": "So if you HODL forever what is the point of having it? If everyone decides to stop HODLing at the same time to buy lambos, it goes to zero. When are you planning to HODL it until? And why?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9sil7r",
                                    "author": "alltheballs13",
                                    "score": 3,
                                    "created_utc": 1653388857.0,
                                    "response": "Until BTC is actually a mainstream worldwide currently, the value has gone waaay up, and it's stabilized. Or until you want to spend it on things you value in the real world.\n\nMost people still have fiat currencies they can buy things with, so it makes more sense to use fiat for everyday purchases and to just save in BTC for now.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9sklhv",
                                    "author": "Kie_ra",
                                    "score": 1,
                                    "created_utc": 1653390372.0,
                                    "response": "Alright, let me explain. What i meant by that comment is that you cannot lose anything if you never sell for less than you bought it. There are, however, some circumstances in which i would consider selling.\n\nI, like many others, are in it not because we like the technology, but simply see cryptocurrencies as a potential way to make a fuckton of money.\n\nMy plan is really simple: if fiat doesn't become irrelevant by the time i can safely FIRE and crypto remains extremely volatile, i will sell not only my BTC, but pull out of most, if not all crypto and just no longer give a damn.\n\nNow the other option: if BTC actually manages to achieve what it set out to do and makes banks and fiat useless worldwide, why would you ever want to sell? The potential is there.\n\n>If everyone decides to stop HODLing at the same time to buy lambos, it goes to zero.\n\nWon't happen, it literally CANNOT go to zero, think about it.\n\nThere is a chance it loses most of its value and never recovers (or at least in our lives), in which case it'd fail. Or it succeeds, in which case its price would skyrocket beyond belief.\n\nThe thing is i still wouldn't give a fuck if it failed because i am not overinvested in crypto. I like to believe i am well diversified into other investments. Would it hurt? Yes, a little bit but i treat all the money i put into BTC as \"lost\" money that i won't ever see again.\n\nI've been DCAing for years now. I have seen my portfolio skyrocket with everything in green and excellent profits. I didn't sell and kept buying. Now, when everything is red i don't sell either - i keep buying and we'll see where this gets me.\n\nEdit: remember when BTC fell to like 3k and everyone jumped ship? Just for it to rally up back to 70k some time later? Imagine you kept DCAing through all of this and actually bought some on the way down.... Yeah.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9sr5j5",
                                            "author": "Temporary_Deer_7116",
                                            "score": 1,
                                            "created_utc": 1653394629.0,
                                            "response": "When it’s not possible to actually use as money, due to the slow transaction speed and fees, I don’t follow this argument.  Given it’s been copied thousands of times the technology is not special, and still it’s not used in everyday transactions. The only people buying and holding have a plan to get rich, and currently the number buying is significant.  Is it possible for you all to get so rich that you don’t need to work?  If you gave half the world population $1billon dollars each tomorrow would they all be rich, or would the price of goods simply increase to balance out?  It’s actually impossible for all bitcoin holders to become significantly wealthy from it.  Have a good think about that, the only people who are rich from it got in early, and essentially bought a winning lottery ticket.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9t460x",
                                                    "author": "cryptomultimoon",
                                                    "score": 1,
                                                    "created_utc": 1653401273.0,
                                                    "response": "If the value of the world economy slowly moves into Bitcoin and out of fiat, which it has only begun to do, the value of Bitcoin will continuously rise.  What is hard to understand about this?  \n\nVISA transactions take a long time to settle.  When you use your card it isn’t instantly settled in your bank account.  Bitcoin already has a system like this setup called the lightning network.  \n\nBitcoin has been copied but there is no use for a second Bitcoin when we already have one that is functioning.  All attempts to fork into alternate versions have failed.  Bitcoin relies on the network, and it is healthier than ever. \n\nYour wake up with a billion dollars argument applies to the dollars you use now, not Bitcoin.  There will only ever be 21 million Bitcoin.  It can not be inflated.  So, if I wake up with a million bitcoin, it came from someone else’s wallet.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9ssea2",
                                            "author": "Temporary_Deer_7116",
                                            "score": 1,
                                            "created_utc": 1653395343.0,
                                            "response": "Let’s test my other theory here then also, what is your overall % increase or decrease on bitcoin from all your investments over time?   The majority of people joining in the last phase will be nursing major losses.  Physiology prevents a lot from taking a loss ‘as it’s not real until you cash out’ but that is not correct.  You have taken a loss anyway, but you are hoping it will reverse.    All I can see is a larger group of people being sucked into a non regulated product, which has no fundamentals (I.e does not produce any value at any point in time, but does use value and energy to run).  Prove me wrong and tell me you are one of the masses and have made good returns?  The people who can afford it least, are buying on the hope of getting rich quickly and getting burned in the process.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9t4paw",
                                                    "author": "cryptomultimoon",
                                                    "score": 1,
                                                    "created_utc": 1653401520.0,
                                                    "response": "The end result is all that matters.  Either Bitcoin grows in value over time or it doesn’t.  Who wins and loses over time by trying to time the market is inconsequential to the overall success of Bitcoin.  You cannot say that people that hold through the ups and downs have lost anything because you do not know what the end result will be.  If they hold and Bitcoin goes up to a million dollars per coin, would that make their strategy profitable or no?  For most investors buying and holding is a better strategy than trying to trade against people that are more experienced than you.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9s3pno",
                    "author": "No-Research8107",
                    "score": 10,
                    "created_utc": 1653375484.0,
                    "response": "Stacking Bitcoin is a Healthy Addiction. \n\nJust don't trade or margin etc and you'll be good.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9s56m2",
                            "author": "5liveR",
                            "score": 8,
                            "created_utc": 1653376764.0,
                            "response": "that will be quite a challenge for a gambler.\n\nMay the force be with him",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9sb8qf",
                    "author": "Djr215",
                    "score": 3,
                    "created_utc": 1653382352.0,
                    "response": "I think it’s a good idea. If you’re addicted to gambling, when you have plenty of disposable income sitting in a bank you will be even more tempted to gamble it. Because “why not”. By investing whatever you would have once gambled, you’re actually giving that money a chance to grow. In my opinion, you’ll get your kick from watching the charts and checking your balance. \n\nI also had a gambling addiction a few years ago. I invested my money that I would have lost gambling and have amassed a healthy sum of crypto. \n\nAs other people have said, don’t leverage/margin trade. Just build your bag and let it grow. Good luck mate. You’ll soon realise how easy it is to save when you’re not gambling. From my experience, long term, you will NEVER win with gambling. Crypto on the other hand, you have a good chance.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9se1t5",
                    "author": "coffee_for_dinner",
                    "score": 3,
                    "created_utc": 1653384966.0,
                    "response": "Like the others said, set yourself a hard rule of only converting $ to ₿, never ₿ to $. Otherwise you'll just become addicted to trading and fucking with margins and that will make you lose your money all over again. When the time comes and your bitcoin stack can make a difference in your life then you can look into exchanging your wealth for something meaningful, but that time is still a long way off.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9shjs4",
                    "author": "Zealousideal_Lab537",
                    "score": 6,
                    "created_utc": 1653388018.0,
                    "response": "Fill the void? You need help mate, crypto will fuck you up, stay away.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9sijta",
                            "author": "aceops23",
                            "score": 1,
                            "created_utc": 1653388828.0,
                            "response": "The world in general will fuck you up. Can’t stay away from that",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9sjp6e",
                                    "author": "Zealousideal_Lab537",
                                    "score": 4,
                                    "created_utc": 1653389720.0,
                                    "response": "I have had family members deal with addiction, the month you start looking at charts daily and make emotional moves, you are in addiction mode, watch yourself.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9shrdz",
                    "author": "fuckparks",
                    "score": 2,
                    "created_utc": 1653388192.0,
                    "response": "As someone in front of Boomtown in Reno right now.. and someone who invests in crypto… it’s about the same… but I’m still going to play blackjack",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9sjre5",
                    "author": "Salti21",
                    "score": 2,
                    "created_utc": 1653389766.0,
                    "response": "Look into a hardware wallet.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9sl3yh",
                    "author": "AdeptnessWarm3141",
                    "score": 2,
                    "created_utc": 1653390745.0,
                    "response": "I had gambling addiction as well, started stacking crypto, now i found futures, dont try it, its the same as gambling:D",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9snxqt",
                    "author": "DatBuridansAss",
                    "score": 2,
                    "created_utc": 1653392649.0,
                    "response": "If buying BTC scratches the itch then a) you've just channeled a destructive compulsion into something extremely productive for yourself, and b) you should consider writing a book on the subject for other gambling addicts out there.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9sydgv",
                    "author": "Alea_Iacta_Est21",
                    "score": 2,
                    "created_utc": 1653398520.0,
                    "response": "Right! You will get the same thrill, just don’t buy at the top and sell at the low. If you manage that, you will have the best of both worlds 😅",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9sythy",
                    "author": "Mysterious_Base1149",
                    "score": 2,
                    "created_utc": 1653398738.0,
                    "response": "Life’s a gamble",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9s20qe",
                    "author": "88eth",
                    "score": 3,
                    "created_utc": 1653374081.0,
                    "response": "Probably a pretty good time to buy BTC now. Better than at $70k, right.\n  \nAlso I dont play lottery, but you could essentially have the same effect of anticipating a giant win by just buying one ticket for like €2.50 or whatever its in your country for the Eurojackpot which can be €100m. And putting the ticket away and just checking it after like 5 months or so (you usually have at least 6 months if you win) :) So in this case you could anticipate a gigantic win for 5 months for the price of just €2.50 once. I think thats a fair tradeoff if you ever need \"the kick\" again.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9se2ma",
                            "author": "coffee_for_dinner",
                            "score": 2,
                            "created_utc": 1653384985.0,
                            "response": "Buying and holding bitcoin is like winning the lottery in slow motion.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9s9gzd",
                    "author": "Evilroot55",
                    "score": 3,
                    "created_utc": 1653380670.0,
                    "response": "Tried switching my Heroin addiction to alcohol. . .",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9s1r4a",
                    "author": "solomonsatoshi",
                    "score": 2,
                    "created_utc": 1653373859.0,
                    "response": "Read this and decide if you want to be part of the peaceful constructive monetary revolution.\n\n[https://www.z-epub.com/book/1712](https://www.z-epub.com/book/1712)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9s2kx6",
                    "author": "porpoisebuilt",
                    "score": 1,
                    "created_utc": 1653374540.0,
                    "response": "Best post I’ve read for a while and congratulations…..no better ‘gamble’ than BTC exists IMO, so proper kudos to you.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9s2vvb",
                    "author": "SpectatorWon",
                    "score": 1,
                    "created_utc": 1653374791.0,
                    "response": "Theres some rushes when you loose 300k in a day. profits are nice to but the elevator drop is what I really like. I am so messed up. whens it gonna drop. and then afterwards. I just buy more.\n\n\\-I bought nice house too.\n\ntax loss harvesting software is super simple, pay the fees and use it.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9s8e4s",
                            "author": "ikkatop",
                            "score": 0,
                            "created_utc": 1653379660.0,
                            "response": "With that kind of money, it wouldn't hurt to hire an English teacher for a few hours.\n\nLoose = the opposite of tight.\n\nLose = the opposite of win.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9sh7rx",
                                    "author": "ikkatop",
                                    "score": 1,
                                    "created_utc": 1653387741.0,
                                    "response": "It's always amusing ( and achingly painful ) to see butt hurt ego dented children downvote something useful.  Pretty much sums up the majority of society these days. They rage against wisdom and betterment, and yet, they're here, trying to get ahead.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9saweu",
                                    "author": "SpectatorWon",
                                    "score": 0,
                                    "created_utc": 1653382032.0,
                                    "response": "The money's loose. Ied have to catch it, to much work",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9sbf6g",
                                            "author": "ikkatop",
                                            "score": 1,
                                            "created_utc": 1653382524.0,
                                            "response": "Downvoting a helpful post. \nHow mature.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9sctny",
                                                    "author": "SpectatorWon",
                                                    "score": 2,
                                                    "created_utc": 1653383841.0,
                                                    "response": "not me. give you two ups just to be sure.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9sgts0",
                                                            "author": "ikkatop",
                                                            "score": 1,
                                                            "created_utc": 1653387432.0,
                                                            "response": "😂😂😂",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9s50j4",
                    "author": "Black_Labs_Matter69",
                    "score": 1,
                    "created_utc": 1653376612.0,
                    "response": "Good post",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9s2mo7",
                    "author": "sangderenard",
                    "score": 1,
                    "created_utc": 1653374579.0,
                    "response": "I don't like casinos but I knows theres some mental dysfunction that wants to take things too far and feel genuine risk or else it's not as fun, for me, with some of my crypto and stock choices. For a bit I was pissing my money away on a pay to win game I was addicted to. I'm always fucking up with my money, at least in this compulsive hobby I have the option to pull something out in an emergency. They don't generally let you withdraw the coins you lost to a slot machine or to most money-sink hobbies.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9s2tvg",
                            "author": "aceops23",
                            "score": 2,
                            "created_utc": 1653374744.0,
                            "response": "This is true. Unfortunately my grandfather got me into gambling at a young age and I’ve had issues with it since. Nothing major, I’m still on time with all my bills but it’s an itch that never goes away. BTC is a bit of a gamble so I’m testing the waters to see if that will help.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9savp5",
                    "author": "SeanyBlaze",
                    "score": 1,
                    "created_utc": 1653382013.0,
                    "response": "Make it an automatic transaction each month/week, take the \"fun\" out of it. Gambling is gambling no matter the vice.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9scx1k",
                    "author": "hcollector",
                    "score": 1,
                    "created_utc": 1653383930.0,
                    "response": "Wrong mindset. If you don't understand crypto you should stay away from it.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9seenu",
                            "author": "aceops23",
                            "score": 1,
                            "created_utc": 1653385289.0,
                            "response": "Hm, you’re the first out of 26 to say that",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9sixvc",
                                    "author": "alltheballs13",
                                    "score": 1,
                                    "created_utc": 1653389135.0,
                                    "response": "Sort of makes sense, I guess. Doing anything just to \"fill the void\" might be a bad idea.\n\nBut a lot of people here would agree that even if you get into Bitcoin for the wrong reasons, you'll eventually learn why it's a powerful technology and will want to stay invested.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9sfwpf",
                    "author": "Johndrc",
                    "score": 1,
                    "created_utc": 1653386652.0,
                    "response": "Dont sell at 10% gains in Bitcoin\n\nHold 4 years its 500% \n\n\nWait 4 years its 6000% in alts",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9smlxj",
                    "author": "TheChoosey1",
                    "score": 1,
                    "created_utc": 1653391772.0,
                    "response": "Bitcoin 101 course \n\nWhy Bitcoin is the most important invention since the internet?\nhttps://youtu.be/lYYr4aoOoEI\n*Correction - Bitcoin is a discovery, and it's the most important anything in human history. \n\nThe Bitcoin Standard summary - A deep understanding of money and why Bitcoin is the best possible money. \nhttps://youtu.be/t1brCcgi174\n\nThere are many currencies in the world today. Why do Bitcoiners think only Bitcoin will win, and be the only money?\n\nExcellent question with an excellent answer:\nhttps://mobile.twitter.com/parman_the/status/1439849158051917828?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1439849158051917828%7Ctwgr%5E%7Ctwcon%5Es1_&ref_url=https%3A%2F%2Farmantheparman.com%2Fwhy-bitcoin-only%2F",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9suqbk",
                    "author": "bri8985",
                    "score": 1,
                    "created_utc": 1653396646.0,
                    "response": "You should be buying a variety of assets and just not looking at them. Obviously people are here because they think BTC will become the standard, but that’s not a 100% thing so other assets are also good to have (index funds, metals, and RE, not random ‘to the moon coins’ and tokens).",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9sw4l5",
                    "author": "dbvbtm",
                    "score": 1,
                    "created_utc": 1653397382.0,
                    "response": "Be really careful with trading. It's gambling on crack.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9swwnk",
                            "author": "aceops23",
                            "score": 3,
                            "created_utc": 1653397783.0,
                            "response": "Avoiding trading",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9sw6hy",
                    "author": "JunkSkink",
                    "score": 1,
                    "created_utc": 1653397410.0,
                    "response": "Spend your money on a good therapist to address your issues around gambling, those things don’t just go away by going cold turkey. \n\nAfter that you can make informed and controlled choices on what to do with your money, and Bitcoin may be something you choose at that stage.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9sx0e3",
                            "author": "aceops23",
                            "score": 1,
                            "created_utc": 1653397836.0,
                            "response": "I get nothing monetary from that. It’s been a week so far and haven’t had the “itch”. (Was multiple times a day, every day)",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9t4uwj",
                    "author": "realslizzard",
                    "score": 1,
                    "created_utc": 1653401591.0,
                    "response": "Crypto is like gambling on steroids.\n\nOne month can be like an entire cycle in the stock market.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9t865k",
                    "author": "punktwilli",
                    "score": 1,
                    "created_utc": 1653403036.0,
                    "response": "You HAD an addiction? Are you sure, its under control?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9t9inv",
                    "author": "DudeWhatThe",
                    "score": 1,
                    "created_utc": 1653403616.0,
                    "response": "The time preferences between gambling and bitcoin are all completely different. I'm in Bitcoin for life and never selling a single sat.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9sd4f0",
                    "author": "P9Customs",
                    "score": 0,
                    "created_utc": 1653384112.0,
                    "response": "Oh cool. You should try Bitcoin casinos.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9seg9z",
                            "author": "aceops23",
                            "score": 1,
                            "created_utc": 1653385331.0,
                            "response": "👁👄👁",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9str5g",
                    "author": "never-give-up-every1",
                    "score": 0,
                    "created_utc": 1653396111.0,
                    "response": "Make a research first bro nothing is stable at Crypto you need to know the possible outcome of starting this, you can try using crypto academy lessons at Netcoins if you're in Canada because there is a possibility also that you could not earn money in crypto if you just do it without proper knowledge",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9suy1c",
                            "author": "aceops23",
                            "score": 1,
                            "created_utc": 1653396760.0,
                            "response": "I didn’t make money gambling either. I’ll take the risk and learn along the way",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "uwkhd8",
            "title": "Where are my keys stored?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uwkhd8/where_are_my_keys_stored/",
            "author": "Leading-Fail-7263",
            "created_utc": 1653373965.0,
            "score": 1,
            "num_comments": 12,
            "subreddit": "Bitcoin",
            "selftext": "I read a bit about cold wallets. Am I correct to understand that with a hot wallet, the information about my keys is stored in the data of my wallet’s app? \n\nAdditionally, if you lose your cold wallet drive, are your Bitcoins lost forever?",
            "stickied": false,
            "comments": [
                {
                    "id": "i9s2efm",
                    "author": "igadjeed",
                    "score": 2,
                    "created_utc": 1653374394.0,
                    "response": "A cold wallet is a computer, not a drive\n\n> if you lose your cold wallet drive, are your Bitcoins lost forever?\n\nFollow the instructions. Write the recovery mnemonic (24 words) on paper. The recovery mnemonic allows recovery of the keys on a new device",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9s2iw3",
                            "author": "Leading-Fail-7263",
                            "score": 1,
                            "created_utc": 1653374491.0,
                            "response": "So what’s  the difference between that and the words I’ve written to access my hot wallet? Why is one more secure?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9s7f5b",
                                    "author": "savinelli_smoker",
                                    "score": 4,
                                    "created_utc": 1653378774.0,
                                    "response": "Wallet holds your key, be it hot or cold. The difference is one is connected to the internet the other is designed not to",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9s370l",
                                    "author": "igadjeed",
                                    "score": 3,
                                    "created_utc": 1653375046.0,
                                    "response": "The hot wallet is exposed to the Internet and any malware which might send your keys out to the world  \n\nThe cold wallet keeps the keys away from the network, even when it is plugged in",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9s3tw9",
                                            "author": "Leading-Fail-7263",
                                            "score": 1,
                                            "created_utc": 1653375586.0,
                                            "response": "Got it. So my keys are stored in my hot wallet, right?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9s49eb",
                                                    "author": "igadjeed",
                                                    "score": 1,
                                                    "created_utc": 1653375950.0,
                                                    "response": "Yes they are",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9t9hwa",
                    "author": "cpt_charisma",
                    "score": 1,
                    "created_utc": 1653403607.0,
                    "response": "Habeus Claves - Who has the keys?  This is the most important question a Bitcoiner can ask.  If you don't know where you keys are, you don't own any Bitcoin!\n\nHot wallets store the keys with their data.  But make sure!  It could be a custodial wallet.  This means the keys are stored somewhere else, and all you have is an interface for asking someone else to do transactions on your behalf. The app author should provide this information clearly on their website.  If not, get a new app.\n\nCold wallets usually provide some means of secure backup.  A list of 24 words is the most common.  Make sure you take advantage of this feature.  No one else can retrieve your keys if you lose them or your cold wallet dies.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ta6cx",
                            "author": "Leading-Fail-7263",
                            "score": 1,
                            "created_utc": 1653403897.0,
                            "response": "So, the keys to my hot wallet are stored on my iPhone, where the app is?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9tb2wa",
                                    "author": "cpt_charisma",
                                    "score": 1,
                                    "created_utc": 1653404282.0,
                                    "response": "Probably, but you should check with the app developer.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9tbkhj",
                                            "author": "Leading-Fail-7263",
                                            "score": 1,
                                            "created_utc": 1653404485.0,
                                            "response": "So how is it that if I destroy my iPhone I will still be able to access the wallet?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9teutz",
                                                    "author": "cpt_charisma",
                                                    "score": 1,
                                                    "created_utc": 1653405866.0,
                                                    "response": "Again, check with the app developer.  Some provide a way to make backups, and some don't.\n\nSomeone here may know the answer if you tell us which app you're using.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9tf3n4",
                                                            "author": "Leading-Fail-7263",
                                                            "score": 1,
                                                            "created_utc": 1653405968.0,
                                                            "response": "Blockstream green. \n\nBut you’re saying there are certain wallets that it you destroy the device you lose your BTC, even if you’ve written it down?!",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}