{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uwxiw8",
            "title": "Answer this if you believe in bitcoin",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uwxiw8/answer_this_if_you_believe_in_bitcoin/",
            "author": "Ok_Economics1981",
            "created_utc": 1653416925.0,
            "score": 0,
            "num_comments": 29,
            "subreddit": "Bitcoin",
            "selftext": "can the bitcoin blockchain be modified so that only certain wallets can access the full observation of the blockchain and the blockchain is no longer public?",
            "stickied": false,
            "comments": [
                {
                    "id": "i9u7nga",
                    "author": "ts_wrathchild",
                    "score": 23,
                    "created_utc": 1653417747.0,
                    "response": "Code could be introduced tomorrow that siphons all BTC to a single wallet, wiping everyone out for good. Code could also be introduced to stop all mining rewards, thus effectively shutting down the network entirely. The bottom line is that code can be written to do just about anything, save for wiping your ass (because we all know the three seashells are the best option).\n\nThe problem is that you would need 51% of the network node operators to agree to letting this happen.\n\nHave fun with that obstacle!\n\nEDIT: That's why you hear from folks in the know that as the network grows, it becomes more secure because you then need more and more nodes to agree to do something nefarious. The network effect Bitcoin commands is vastly underestimated by many, many people.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9u9tij",
                            "author": "bitsteiner",
                            "score": 5,
                            "created_utc": 1653418661.0,
                            "response": "A majority of Bitcoin transactors needed to accept the new coin instead of the original Bitcoin. You can't just set up thousands of nodes on AWS. They would be ignored by users transacting Bitcoin.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9upqkc",
                                    "author": "ZeroGrift",
                                    "score": 2,
                                    "created_utc": 1653425369.0,
                                    "response": "In practice, this kind of changes is a hard fork. So users will decide which of the network they want to continue transacting with. The original network, or the new network that rug-pull them 🤷🏻‍♂️. Users vote with their money.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9usco1",
                                            "author": "bitsteiner",
                                            "score": 1,
                                            "created_utc": 1653426481.0,
                                            "response": "Exactly. As long as not many people vote with their money, the price will be low, miners can't throw much hash power on it, making it less secure, which is distracts \"voting\" for the new coin. It is a catch-22 situation. A new coin needed to have about a magnitude better utility with same level of security to be successful against Bitcoin.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9uuafk",
                            "author": "DestructorEFX",
                            "score": 4,
                            "created_utc": 1653427325.0,
                            "response": "Wrong, you need way more than 51% of consensus to change the code. 51% is the network mining rate so that you could double spend, not change de code.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9uy7il",
                            "author": "slepyhed",
                            "score": 3,
                            "created_utc": 1653429045.0,
                            "response": "I'm not certain, but I don't think a 51% attack is really relevant here. Even if 51% of the miners and/or nodes implemented this change proposed by OP,  or the changes you posited, my node won't run that software, and will see these blocks as invalid and reject them. I'd continue on with the 49% of miners/nodes that are mining/accepting valid blocks.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9unjpk",
                            "author": "coinjaf",
                            "score": 2,
                            "created_utc": 1653424438.0,
                            "response": "Bullshit. Node count means nothing.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9uxxd0",
                            "author": "Kalikazam",
                            "score": 1,
                            "created_utc": 1653428921.0,
                            "response": "Once mining rewards end though what stops everyone small from shutting down network controlled by a few select miners who change the code and drain everyone? What stops the big mining pools from doing that now? Btw I’m asking not knowing anything about this but I’m a believer and HODL and invested in a mining operation as an LP but always trying to be educated",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9u6p9l",
                    "author": "tohaz",
                    "score": 3,
                    "created_utc": 1653417345.0,
                    "response": "any programming problem can be solved by additional interface :)) thing left is to make those pesky people all around the world use your new interface",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ua7t3",
                    "author": "dima054",
                    "score": 3,
                    "created_utc": 1653418828.0,
                    "response": "What does it have to do with \"believe\"?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ucl4m",
                            "author": "Ok_Economics1981",
                            "score": -4,
                            "created_utc": 1653419833.0,
                            "response": "it means, houston we have a problem if we really want to go to the moon",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9udo94",
                                    "author": "Nada_Lives",
                                    "score": 5,
                                    "created_utc": 1653420284.0,
                                    "response": "You and 7.9 billion others don't get to go without following the rules.\n\nNot sorry.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9uehah",
                                            "author": "NiceDoctorBeam",
                                            "score": 7,
                                            "created_utc": 1653420624.0,
                                            "response": "He just heard about Bitcoin.  He's here to fix it.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9uis83",
                                    "author": "dima054",
                                    "score": 3,
                                    "created_utc": 1653422427.0,
                                    "response": "No we don't. You can fork bitcoin today and change all the rules you want. Nobody will use that fork.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9uqfnh",
                    "author": "Iguana_The_Wise",
                    "score": 3,
                    "created_utc": 1653425663.0,
                    "response": "I believe that's similar to trying to change the 21 million cap.\n\nIt's possible in theory, but in practice it's never going to happen.\n\nEveryone would reject such a nonsensical update.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ujsjx",
                    "author": "Perringer",
                    "score": 2,
                    "created_utc": 1653422852.0,
                    "response": "No.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9u7ssg",
                    "author": "bitsteiner",
                    "score": 2,
                    "created_utc": 1653417809.0,
                    "response": "Bitcoin or blockchain can't be modified in reality. You can create a new coin, but that won't make Bitcoin go away. If someone tried to change the Bitcoin code, it will lead to the same result: a new coin which all Bitcoin nodes will reject.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9uctat",
                            "author": "Ok_Economics1981",
                            "score": -4,
                            "created_utc": 1653419929.0,
                            "response": "i was afraid to read this :(",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9unuvv",
                                    "author": "coinjaf",
                                    "score": 2,
                                    "created_utc": 1653424569.0,
                                    "response": "Afraid of the truth?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9upxn3",
                                            "author": "bitsteiner",
                                            "score": 3,
                                            "created_utc": 1653425452.0,
                                            "response": "Probably he planned to  own and control Bitcoin by changing the code.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9v84gd",
                                    "author": "infopocalypse",
                                    "score": 1,
                                    "created_utc": 1653433512.0,
                                    "response": "Why are you afraid that it can't be co opted to be a censorship tool?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9vjcva",
                                            "author": "Ok_Economics1981",
                                            "score": 1,
                                            "created_utc": 1653438858.0,
                                            "response": "the only problem that bitcoin has for now is that is public, and is a problem between civilians\n\nthey can know your balance.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9uhp0w",
                    "author": "ZZ3xhZz",
                    "score": 1,
                    "created_utc": 1653421973.0,
                    "response": "Don't forget, anybody that is able to \"hack\" bitcoin for self gain would destroy the value of bitcoin and of course their stolen coins value goes with it too.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9uim3l",
                            "author": "Nada_Lives",
                            "score": 1,
                            "created_utc": 1653422358.0,
                            "response": "Probably get a big tax bill too! Thankless bastards.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "uwxi9w",
            "title": "Is Liquid Network Compatible with Bitcoin Decentralized Mantra",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uwxi9w/is_liquid_network_compatible_with_bitcoin/",
            "author": "MyAddidas",
            "created_utc": 1653416880.0,
            "score": 10,
            "num_comments": 11,
            "subreddit": "Bitcoin",
            "selftext": "I've been doing some research on Bitcoin L2s, besides Lightning, and came across the Liquid Network. From what I can tell, Liquid is a side chain that's touted as the premier Bitcoin L2 as it allows for 1 minute block times, confidential transactions, issuance of pegged assets, supports tokens, stable-coins, atomic swaps, and a few other features. That's all great, but the backbone of the network is a federation of large crypto businesses (exchanges, trading desks, etc.) that control block creation/signing and pegging assets into/out of the network.   \n\n\nWhy does the Bitcoin community support such a L2 setup that has companies as the backbone of the side chain? (Honest question, I'm trying to learn and not troll.) Is it because Liquid is not meant for the average user and is mainly focused on facilitating high value transactions between big entities? If that's the case, then I guess it makes sense that only those large businesses can create blocks. I guess the Lightning Network is for everyone else and when decentralization and speed are important.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9u6r0e",
                    "author": "dinglebarry9",
                    "score": 6,
                    "created_utc": 1653417366.0,
                    "response": "I personally like Liquid. It is built on the open-source Elements Project, so you are free to spin up your own sidechain (I have). A failure of Liquid has no effect on the base chain while success enhances it by increasing functionality and requiring BTC for use without sacrificing security. As A. Antonopoulos says \"innovation at the edges\" and that is what Liquid is.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9u829p",
                            "author": "MyAddidas",
                            "score": 2,
                            "created_utc": 1653417920.0,
                            "response": "Why launch your own side chain? To run your own Dapp? And who validates your side chain?  \n\"Innovation at the edges\", I like that. Bitcoin does need to grow its sandbox type environments.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9uwbao",
                                    "author": "dinglebarry9",
                                    "score": 6,
                                    "created_utc": 1653428210.0,
                                    "response": "For whatever you want.\n\nSure why the hell not.\n\nYou or however you want.\n\nI think about them like a website for Bitcoin. A individual can peg their own Bitcoin in or more practically you can, then set up LN channels with capacity for atomic swaps between onchain Bitcoin and sidechain Bitcoin so that a user can come in do some stuff then go leave, just like a website.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9u8whv",
                    "author": "bitsteiner",
                    "score": 3,
                    "created_utc": 1653418275.0,
                    "response": "Any higher layer solutions impact security, but most of the transactions don't require the level of security Bitcoin provides. E.g. Starbucks doesn't insist on central bank clearing when you buy a cup of coffee, they will send some  information to the payment service provider based on your plastic card.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9v39c3",
                    "author": "halt_spell",
                    "score": 3,
                    "created_utc": 1653431269.0,
                    "response": "L2 solutions are inherently less secure than L1. As long as L1 leaves L2 development open and competitive I'm not too worried about the risks of a particular implementation.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9w16v0",
                    "author": "ipcoffeepot",
                    "score": 3,
                    "created_utc": 1653447304.0,
                    "response": "It’s all about tradeoffs. There is no free lunch in cryptocurrency. \n\nLiquid gives you deterministic block times and a bunch of additional features (assets, additional opcodes, confidential transactions) in exchange for being more centralized than L1. The centralization risk isn’t quite as bad as it might seem because: \n\n1.\tUsers can run full nodes to validate all the transactions, and can reject blocks that break the rules if the block producers cheat\n2.\tconfidential transactions mean that its hard for the block producers to censor transactions - they can’t see what the transactions are!\n3.\thaving coins custodied by a federation is better than a single company. A majority of the custodians (who have business interests in having bitcoin and liquid work) would have to collude to exit scam with the money\n\nIs liquid as safe/secure/trustless as L1? No. Absolutely not. Don’t keep your life savings on liquid! Is it a reasonable set of tradeoffs for a settlement network that users can use to move assets between a bunch of companies that work together? I think so.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9u8gf2",
                    "author": "AntonNonymous",
                    "score": 2,
                    "created_utc": 1653418088.0,
                    "response": "L1s and L2s can have speed, security, and decentralization but they can only pick 2. \nBecause L1 chose security and decentralization, it created the need for L2. \nAs long as L1 is decentralized, it's okay for L2 to be a little less so, as long as people know the risks. \n\nI don't think the centralization jibes with a purist ethos, but I think the trade-off to get more usability is okay as long as using it is voluntary",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9udsga",
                    "author": "sovrynMatt",
                    "score": 3,
                    "created_utc": 1653420333.0,
                    "response": "RSK is much more decentralised and secured compared liquid. RSK has many cool dapps now like Sovryn for BTC lending, borrowing and trading services.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9vtb0f",
                            "author": "MyAddidas",
                            "score": 2,
                            "created_utc": 1653443561.0,
                            "response": "How come RSK doesn't seem to get as much love as Liquid Network?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9xvzo6",
                                    "author": "sovrynMatt",
                                    "score": 1,
                                    "created_utc": 1653489987.0,
                                    "response": "RSK began in 2017 and is based in South America, Its pretty well known in South/central Amercian. I think Liquid is much more popular because of Blockstream is behind it. Blockstream has huge influence in the English speaking countries because of Adam Back and its BTC involvement since 2014.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}