{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "rmbsmg",
            "title": "Alan Greenspan after the U.S. credit downgrade (2011)",
            "url": "https://v.redd.it/bfjf9su535781",
            "author": "theloiteringlinguist",
            "created_utc": 1640198657.0,
            "score": 961,
            "num_comments": 223,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "hpldfs5",
                    "author": "odif740",
                    "score": 198,
                    "created_utc": 1640201650.0,
                    "response": "I'm over here enjoying that look of talking head #2... he is like, \"what kinda bullshit is this guy dishing out?!\"",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hplgxq5",
                            "author": "theloiteringlinguist",
                            "score": 46,
                            "created_utc": 1640203081.0,
                            "response": "Best part ever",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hpm3pd8",
                            "author": "otiswrath",
                            "score": 85,
                            "created_utc": 1640212460.0,
                            "response": "That is Austin Goolsbee. He was an Obama Economic Advisor. He is fucking awesome. \n\nAn yeah...he just had the look of, \"Wait...wtf...you were in charge of the Fed for how long and you just said what now?!?\"",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hpmq3fh",
                                    "author": "odif740",
                                    "score": 32,
                                    "created_utc": 1640222804.0,
                                    "response": "Exactly!  He's like, \"get a load of this f'ing guy!\"",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hpn45hp",
                                            "author": "Jd20001",
                                            "score": 16,
                                            "created_utc": 1640229591.0,
                                            "response": "Someone should edit this so his lips do the \"Printer goes Brrrrrrr\" sound when they cut to him.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "hpo7bob",
                                    "author": "Maticus",
                                    "score": 8,
                                    "created_utc": 1640259049.0,
                                    "response": "Greenspan was probably the most conservative fed chair ever, and if he was willing to print away the US' debts, you can be sure any fed chair would do that.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "hpphpms",
                                    "author": "srob321",
                                    "score": 4,
                                    "created_utc": 1640282112.0,
                                    "response": "0% probability of Default by printing Money.\nWeimar Republic or Venezuela anyone?",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "hpmr8i5",
                                    "author": "VikingBuddhaDragon",
                                    "score": 10,
                                    "created_utc": 1640223342.0,
                                    "response": "I love how there’s always someone that knows the missing detail",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "hpnaivk",
                                    "author": "luciferfinancial",
                                    "score": -8,
                                    "created_utc": 1640234947.0,
                                    "response": "Honestly, I’m not vibing with you all. Isn’t the dollar supposed to be a non fungible currency, whose value we all agree on, isn’t it exchangeable for services in most parts of the world?  \n\nThe fact is the systems that control the value of the dollar don’ mind fucking people over. \n\nWhose to say that in five years there’s an attack which renders Bitcoin useless. No tracking of transactions. No exchangability. \n\nWhose to say Bitcoin is t going to end up, by the math, by ineffable design, completely useless by some other better technology. \n\nWhose to say that people stop using the dollar. \n\nDoes Bitcoin have an army, a navy, and other defense branches of its government?\n\nBitcoin is governed by the math that outlines how it is valued. I would say most people don’t understand just how complicated the math on either the dollars non fungibility in physical form nor bitcoins value. What if we don’t have power?  What if we can’t connect to a node to verify a transaction because no power. \n\nWhy should we implicitly trust the longevity of Bitcoin?\n\nIt’s a novel technology, a better one doesn’t exist yet. \n\nThe dollar might be fucking Americans but the world is by and large better for most people because of the dollar. \n\nI’m participating because this technology might facilitate human rights concerns. The blockchain is an incredible technology. \n\nBitcoin, also, but less so.\n\nI just think the dollar might be meeting at least some peoples financial needs. But maybe I’m an optimist. \n\nMy needs aren’t met by the dollar but Bitcoin doesn’t really either. I want some coin that’s better for everyone.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hpnhy1a",
                                            "author": "Castcle_Ecosystem",
                                            "score": 13,
                                            "created_utc": 1640239429.0,
                                            "response": "You do realize the dollar's value has declined 90% since the 1950s right?  When the FED prints money it literally takes from the poor and gives to the rich.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hpnie9s",
                                                    "author": "luciferfinancial",
                                                    "score": -6,
                                                    "created_utc": 1640239717.0,
                                                    "response": "I don’t know about that. China lifted two billion people out of poverty because of the relationship it nurtured between its working class and the United States. That relationship is facilitated by the dollar. How am I supposed to believe that two billion people escaping crushing poverty because of their trade relationship with the US, is a bad thing?\n\nPeople have really benefitted from the dollar. It would be nice to see a coin improve peoples lives. Not people who made a purchase ten years ago and now drive a Lamborghini. \n\nThe wealth fetish is cheap.  I think there’s better uses for the blockchain. \n\nBitcoin is a great first step. But it’s not the end all be all for this tech.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "hpntl6w",
                                                            "author": "Mccawsleftfoot",
                                                            "score": 7,
                                                            "created_utc": 1640247836.0,
                                                            "response": ">China lifted two billion people out of poverty\n\nChina doesn't have two billion people, and its economic performance is pathetic compared to its close neighbours Japan, South Korea and Singapore. Hundreds of millions still live in abominable conditions.\n\n>How am I supposed to believe that two billion people escaping crushing poverty because of their trade relationship with the US, is a bad thing?\n\nIt's not a bad thing they escaped crushing poverty. It's bad that it took them so long to do so, and that the working class in America had to be sacrificed for it.\n\n>It would be nice to see a coin improve peoples lives\n\nAn asset which holds its value improves lives. An asset which is inflated by those in power robs the wealth of any holder.",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "hpoeze8",
                                                            "author": "bigLeafTree",
                                                            "score": 3,
                                                            "created_utc": 1640264305.0,
                                                            "response": "What dumb arguments you have. The US dollar did not help China, trade did, and they would have done much better if a solid currency was used. The chinese people have been double fcked by the devaluation of the dollar and the yuan.",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "hpok3qf",
                                                            "author": "buckeyedownsouth07",
                                                            "score": 1,
                                                            "created_utc": 1640267225.0,
                                                            "response": "China has less than 2 billion people. China lies about every metric. Don't believe china. China is asshole.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "hpnw2dr",
                                                    "author": "sporteous1",
                                                    "score": -3,
                                                    "created_utc": 1640249839.0,
                                                    "response": "Fed doesn't print money",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "hpnkm1g",
                                            "author": "saylevee",
                                            "score": 2,
                                            "created_utc": 1640241189.0,
                                            "response": "The blockchain is just one of several novel technologies that make Bitcoin a generational technology.\n\nNot the other way around.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "hpok0u2",
                                    "author": "cat-playing-poker",
                                    "score": -1,
                                    "created_utc": 1640267182.0,
                                    "response": "Guy #1 is Alan Greenspan.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hposci9",
                                            "author": "otiswrath",
                                            "score": 1,
                                            "created_utc": 1640271288.0,
                                            "response": "Yeah, just like the title said but the dude next to him is Austin Goolsbee. \n\nNot sure your point here.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "hpnvz48",
                            "author": "sporteous1",
                            "score": 1,
                            "created_utc": 1640249765.0,
                            "response": "The bullshit is facts",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hplntu7",
                    "author": "matriesling",
                    "score": 29,
                    "created_utc": 1640205873.0,
                    "response": "He is absolutely right.\n\n>!He just left out the part where toilet paper will become more valuable than the $\\* if it continues indefinitely.!<",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hpmvcm1",
                            "author": "jmw74",
                            "score": 9,
                            "created_utc": 1640225312.0,
                            "response": "To be fair, the clip ends there, unless you've seen the whole thing we don't know what he said next.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hpl8tv9",
                    "author": "Shep_Meister",
                    "score": 101,
                    "created_utc": 1640199789.0,
                    "response": "I really must be missing something when the experts think that printing more money definitively solves economic issues. I could be wrong, but I’m pretty sure I’m not AND I’m probably preaching to the choir that is aligned with my belief.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hplpemy",
                            "author": "FedRCivP11",
                            "score": 31,
                            "created_utc": 1640206519.0,
                            "response": "He didn’t say printing money would solve economic issues, he said it is a power the government has, which is true, and as a result the government will never default on its debt. I think the second part is only true if you assume the current congress believes it’s more harmful to let the country default than it is to continue to raise the debt ceiling.\n\nBut Greenspan doesn’t talk, in this clip, about the impact on the dollar of continuing to pay such debts",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hpm8usx",
                                    "author": "circleuranus",
                                    "score": 10,
                                    "created_utc": 1640214738.0,
                                    "response": "The debt ceiling is artificial and meaningless.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hpm8z20",
                                            "author": "FedRCivP11",
                                            "score": 13,
                                            "created_utc": 1640214791.0,
                                            "response": "It is exactly as artificial and meaningless as all the other laws in the US Code.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "hplh6k1",
                            "author": "theloiteringlinguist",
                            "score": 25,
                            "created_utc": 1640203180.0,
                            "response": "Yupp, they know something we don’t apperently",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hpllv73",
                                    "author": "IndianaGeoff",
                                    "score": 45,
                                    "created_utc": 1640205083.0,
                                    "response": "As long as the Dollar is in high demand around the world (and it is) that will soak up a lot of our extra printing.  But if that ever ends, we are screwed.\n\nAnd Greenspan is absolutely correct.  The US can never default on US denominated currency.  The problem is if we so screw up the dollar and our economy that people start demanding it be priced in other currencies.  For example, if European investors demanded Euro based bonds paid in Euro's instead of dollars.  But right now, Europeans will take dollar treasuries, US investors will take Euro debt, both will take Japanese Yen denominated debt. So we can all play this game.\n\nFor now.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hpm53g8",
                                            "author": "ultron290196",
                                            "score": 21,
                                            "created_utc": 1640213065.0,
                                            "response": "That's like kicking a can of shit down the road for future generations to clean up.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hpmgxfb",
                                                    "author": "northrupthebandgeek",
                                                    "score": 17,
                                                    "created_utc": 1640218441.0,
                                                    "response": "Society in a nutshell.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "hpmur9a",
                                                    "author": "Fmanow",
                                                    "score": 3,
                                                    "created_utc": 1640225032.0,
                                                    "response": "Are playing captain obvious now?",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "hpn42kt",
                                                    "author": "ksknksk",
                                                    "score": 1,
                                                    "created_utc": 1640229551.0,
                                                    "response": "I mean… yeah that’s always been their play lmao\n\n\n\nJust look at how global warming is being handled — it’s essentially ignored, as it only really affects the coming generations",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "hpn8ehd",
                                                            "author": "theloiteringlinguist",
                                                            "score": 1,
                                                            "created_utc": 1640233717.0,
                                                            "response": "Thorium fixes that",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "hpnhgxj",
                                                                    "author": "BigLurker",
                                                                    "score": 2,
                                                                    "created_utc": 1640239124.0,
                                                                    "response": "probably too far gone to fix at this point, were in for some hurt",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                },
                                                                {
                                                                    "id": "hpniqe1",
                                                                    "author": "Redbone1441",
                                                                    "score": 2,
                                                                    "created_utc": 1640239934.0,
                                                                    "response": "I like Nuclear Fission Power as the alternative to Carbon-Based, but its an unrealistic dream to say that Thorium is the ‘solution’ to Climate Change.\n\nNuclear Power will never be able to replace Coal, and its not an issue of logistics or viability, its an issue of Public Trust, which incidents like Chernobyl and 3 Mile Island have slowly but surely destroyed. And it doesnt help that the first demonstration of Nuclear Power was used as a Weapon of mass destruction, either.\n\nI would bet that nobody in Seattle or San Diego cares that at any given time they are just a few miles away from dozens of Nuclear Power Plants operated by people between the ages of 19 and about 25, but that is twofold in the facts of general public ignorance of their existence, and that they are operated by an organization that has never officially had a Nuclear Accident.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "hpmkqi9",
                                                    "author": "piquant-nuggets",
                                                    "score": -8,
                                                    "created_utc": 1640220242.0,
                                                    "response": "WELCOME TO CAPITALISM (and don't even fucking think about collecting $200 as you pass GO!)",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "hpmpoey",
                                                            "author": "IndianaHoosierFan",
                                                            "score": 1,
                                                            "created_utc": 1640222608.0,
                                                            "response": "How is that a feature of capitalism?",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "hpmtiob",
                                                                    "author": "TheDividendReport",
                                                                    "score": 1,
                                                                    "created_utc": 1640224437.0,
                                                                    "response": "Capitalism, or more accurately, Laissez-faire economies thrive on debt.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "hpmy4i3",
                                                                            "author": "IndianaHoosierFan",
                                                                            "score": 1,
                                                                            "created_utc": 1640226643.0,
                                                                            "response": "Okay but debt isn't necessarily a bad thing and can still help create economic growth and prosperity. But a federal reserve that keeps interest rates artificially low to increase the amount of debt and spending while injecting trillions of dollars into the supply and inflating our currency, all at an attempt to devalue the currency so that we can attempt to pay back that debt at a reduced value, is inherently not \"Laissez-faire\".",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "hpmpuej",
                                                                    "author": "piquant-nuggets",
                                                                    "score": 0,
                                                                    "created_utc": 1640222686.0,
                                                                    "response": "Short term gains. Leave someone else to clean up the mess.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "hpn3mo4",
                                                                            "author": "InquisitiveBoba",
                                                                            "score": 2,
                                                                            "created_utc": 1640229331.0,
                                                                            "response": "\"Short term gains. Leave someone else to clean up the mess.\"\n\na very good definition of socialism",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "hpn8bks",
                                                                                    "author": "theloiteringlinguist",
                                                                                    "score": -1,
                                                                                    "created_utc": 1640233671.0,
                                                                                    "response": "Agreed",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "hpmfl7x",
                                            "author": "jt7855",
                                            "score": 5,
                                            "created_utc": 1640217818.0,
                                            "response": "Europeans accept the US dollar because they print Euros faster than the Fed prints dollars.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hpmgjni",
                                                    "author": "IndianaGeoff",
                                                    "score": 6,
                                                    "created_utc": 1640218263.0,
                                                    "response": "Yeah, I have called the US Dollar the prettiest dog in an ugly dog contest.  But we are trying hard to get enough botox, face lifts and skin peels to compete with the ugly dogs.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "hppi0gh",
                                                            "author": "jt7855",
                                                            "score": 1,
                                                            "created_utc": 1640282236.0,
                                                            "response": "Facelift and botox not necessary.  Fiat better spent on buying BTC.  All nations succumb to the temptation to print more money.  My previous comment was a criticism of central banking, the fractional reserve system, and the money printing press.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "hpml36s",
                                            "author": "Fuse_Holder",
                                            "score": 1,
                                            "created_utc": 1640220411.0,
                                            "response": "Yeah it's all a game that they are in control of right now.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "hpmla2w",
                                            "author": "deadontheinternet",
                                            "score": 1,
                                            "created_utc": 1640220502.0,
                                            "response": "Why would European investors want bonds paid in dollars and not euros? Euros are stronger correct? Or is that exactly why they want to pay in dollars?",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "hpm3vkp",
                                    "author": "MeanyWeenie",
                                    "score": 13,
                                    "created_utc": 1640212535.0,
                                    "response": "Our dollar is backed by our military and our willingness to use that military. That's why it's the first thing we print money for, and why we print so much for it. It a self reinforcing scheme.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hpm5bz7",
                                            "author": "44gallonsoflube",
                                            "score": 2,
                                            "created_utc": 1640213169.0,
                                            "response": "Sure as hell worked in the Middle East /s",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hpmd4v9",
                                                    "author": "Moalgendy99",
                                                    "score": 6,
                                                    "created_utc": 1640216684.0,
                                                    "response": "It's not /s tho, ghadafi wanted to stop using the dollar and look what happened to him",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "hpmks22",
                                                            "author": "piquant-nuggets",
                                                            "score": 7,
                                                            "created_utc": 1640220263.0,
                                                            "response": "Should've bought BTC.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "hpmv07h",
                                                                    "author": "Fmanow",
                                                                    "score": 5,
                                                                    "created_utc": 1640225148.0,
                                                                    "response": "And end up like Satoshi Nakamoto? No thank you. Oh wait.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "hpnbfno",
                                                            "author": "44gallonsoflube",
                                                            "score": 2,
                                                            "created_utc": 1640235468.0,
                                                            "response": "This hypothesis seems to fit really well after the fact. US foreign policy 2001-19 in the whole region was to make a glass crater out of the Middle East, transfer wealth to military contractors and flex muscle while eroding private citizens liberties such as the patriot act did. The bet didn’t pay off as it crippled the American economy. Now there has to be somebody to blame. The idea that this is some conspiracy with only Gaddafi is a bridge too far for me. \n\nPetrodollar funds wars, it’s that simple. If they couldn’t print the money, there wouldn’t have been an Iraq war.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "hpm88lw",
                                                    "author": "Sabrewolf",
                                                    "score": 3,
                                                    "created_utc": 1640214460.0,
                                                    "response": "Technically yes I suppose",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "hpo4n54",
                            "author": "yechielkops",
                            "score": 3,
                            "created_utc": 1640256949.0,
                            "response": "The SHOCK on the other guests face LMAO A its as if they wanted him to shut up or the Jigg is up ....priceless 😅",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hpme3af",
                            "author": "rtheiss",
                            "score": 6,
                            "created_utc": 1640217121.0,
                            "response": "It's weird because bitcoiners and austrian economics is economic principles we've been doing since the beginning of time. Past generations would look at us now with fiat and tax levels and think we're insane morons.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hpn9r4i",
                                    "author": "SJWcucksoyboy",
                                    "score": 3,
                                    "created_utc": 1640234501.0,
                                    "response": "Past generations would think we're morons for stuff like germ theory, just because people used to think one way doesn't mean it's a good idea.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hpnrfwo",
                                            "author": "danda",
                                            "score": 1,
                                            "created_utc": 1640246139.0,
                                            "response": "and they'd be right.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "hpndspz",
                                    "author": "jstef215",
                                    "score": 1,
                                    "created_utc": 1640236845.0,
                                    "response": "What would past generations think about current tax levels?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "hpmjyia",
                            "author": "Psynaut",
                            "score": 4,
                            "created_utc": 1640219872.0,
                            "response": "Except he didn't say anything like that.  He said \"there is zero probability of default\" which is 100% true, because default is not paying back your debt, and the US can print as much money as it wants to pay back debt.  He never said it wouldn't result in the wholesale slaughter of the US economy, and the Middle Class. He just said we can print money to avoid default.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hpmzglh",
                                    "author": "Shep_Meister",
                                    "score": 2,
                                    "created_utc": 1640227290.0,
                                    "response": "So printing more money is good so you don’t default on your debts? Why can’t we print more money to pay our bills opposed to just managing our money properly so that there isn’t a risk of default?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hpns0za",
                                            "author": "Screwyball",
                                            "score": 2,
                                            "created_utc": 1640246598.0,
                                            "response": "Like, did you even watch the same video as us? Where did he say it was good?\n\nHe was asked if it was \"still safe to invest in US government bonds\" because apparently their credit rating was downgraded (the headline).\n\nHe responded with saying that it is guaranteed to be safe because the US cannot ever default as there is always the option to print money to cover it.\n\nHe did not say this is the only way, nor did he say it was a good or the best way. Its a guarantee that they can give. Period.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "hqrecvu",
                                            "author": "Psynaut",
                                            "score": 0,
                                            "created_utc": 1641004422.0,
                                            "response": "Your not the smartest cow in the pasture are you. You could start to improve by simply reading the posts and listening to the videos you are responding to. You seem to be off having a whole different conversation with just yourself or something.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hqs7nwr",
                                                    "author": "Shep_Meister",
                                                    "score": 1,
                                                    "created_utc": 1641021869.0,
                                                    "response": "This was nine days ago and now you respond. I’m so glad you lost that much sleep over this that even after a week went by, you still just couldn’t resist shutting the fuck up. Happy New year!",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "hr60h6p",
                                                            "author": "Psynaut",
                                                            "score": 1,
                                                            "created_utc": 1641267099.0,
                                                            "response": "I was out of the country backpacking douchebag. Not everyone is a nose breathing, mother's basement dwelling, sub human loser like you. Some of us have lives. I just got around to reading your stupid ass comment and felt like you needed to know you are a fucking loser.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "hpliddy",
                            "author": "BrainsOfCrypto",
                            "score": 4,
                            "created_utc": 1640203662.0,
                            "response": "Over the last few years many of us learned that “the experts” are often wrong, sometimes in major ways.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hpn30qz",
                                    "author": "IllVagrant",
                                    "score": 3,
                                    "created_utc": 1640229030.0,
                                    "response": "They're not \"wrong,\" they're willfully complicit in misleading the public.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "hplj7og",
                                    "author": "Shep_Meister",
                                    "score": 6,
                                    "created_utc": 1640204008.0,
                                    "response": "All “experts” need to be scrutinized when first learning about them; with respect of course. I honestly know nothing about Alan Greenspan other then his longevity at the fed. The fed isn’t even a federal entity so that right there should be a red flag to people, but even doctors can stand behind things that aren’t in the best interest of their patients and we have a history of medical malpractice cases to refer to concerning this.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hplkruc",
                                            "author": "BrainsOfCrypto",
                                            "score": 3,
                                            "created_utc": 1640204639.0,
                                            "response": "Agree, although I think as some of these experts agree, they lose their edge and need to be scrutinized a bit more. I guess to me it’s kinda like auditing the person I’m learning from, to make sure it’s the best available info for the thing they’re teaching me. Btw, I’m all for ending the fed.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hplkv5b",
                                                    "author": "BrainsOfCrypto",
                                                    "score": 2,
                                                    "created_utc": 1640204676.0,
                                                    "response": "As they age, not agree. **",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "hpmy73r",
                                                    "author": "Shep_Meister",
                                                    "score": 2,
                                                    "created_utc": 1640226677.0,
                                                    "response": "Every word you said resonates with me on every level.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "hponguh",
                                                            "author": "BrainsOfCrypto",
                                                            "score": 2,
                                                            "created_utc": 1640268967.0,
                                                            "response": "We are brothers.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "hpmcui9",
                            "author": "beef-medallions",
                            "score": -3,
                            "created_utc": 1640216552.0,
                            "response": "Print money till you can't anymore than create a pandemic and blame it for the collapse.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hpmyfgv",
                                    "author": "Shep_Meister",
                                    "score": -3,
                                    "created_utc": 1640226787.0,
                                    "response": "Not sure why you saying something truthful got you downvoted. The truth is a hard thing to swallow I guess.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hpn9u8l",
                                            "author": "SJWcucksoyboy",
                                            "score": 4,
                                            "created_utc": 1640234551.0,
                                            "response": "Maybe cuz it's a ridiculous conspiracy theory and not \"truthful\"",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "hpn7htc",
                            "author": "TyranaSoreWristWreck",
                            "score": 1,
                            "created_utc": 1640233188.0,
                            "response": "The big secret is that most people are extremely stupid, and willfully so. Ruling them by lying to their faces with the most absurd fallacy you can think of is preferable to all parties, verses the slightly unpleasant truth.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hpls2zv",
                    "author": "genius_retard",
                    "score": 16,
                    "created_utc": 1640207620.0,
                    "response": "What I hear: \"We could always devalue our debt by hyper-inflating the currency\".",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hplbaq3",
                    "author": "slvbtc",
                    "score": 114,
                    "created_utc": 1640200784.0,
                    "response": "The US dollar is a shitcoin based on a US treasury debt ponzi scheme.\n\nRetirement funds will be the ones left holding the bag leading to 60+ year olds around the world all getting wiped out at once.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hpm2r2x",
                            "author": "Rollinrollin1000",
                            "score": 28,
                            "created_utc": 1640212044.0,
                            "response": "Those funds hold McDonald's stock so if they go under you may lose your job too...",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hpmhkfb",
                                    "author": "danpaq",
                                    "score": 2,
                                    "created_utc": 1640218745.0,
                                    "response": "Fallacy? wealth redistribution may cause disruption In the short term, but long term there will still be demand for a meal in 5 seconds or less",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "hplp6mw",
                            "author": "bisnexu",
                            "score": 11,
                            "created_utc": 1640206426.0,
                            "response": "LOL, TRUE",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hpnzwlf",
                            "author": "NeuroticKnight",
                            "score": 1,
                            "created_utc": 1640253018.0,
                            "response": "All money has only value because we choose to believe it having value and it is often easy to make people believe in you when you have the world's largest military.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hpl8pri",
                    "author": "EnergySilly3061",
                    "score": 67,
                    "created_utc": 1640199743.0,
                    "response": "Don’t worry guys I’m able to pay my debts by taking out new credit cards increasing my credit limit.\n\nWith an unlimited checking account too but I’m spending more than I’m producing.\n\nYep seems fine 👍",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hplpskv",
                            "author": "anax4096",
                            "score": 6,
                            "created_utc": 1640206680.0,
                            "response": "If  you only you could print your own money, imagine the freedom!",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hpm8zsy",
                            "author": "circleuranus",
                            "score": 3,
                            "created_utc": 1640214801.0,
                            "response": "Federal Reserve banking doesn't work like your \"home\" budget\" not even close...",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hpmj5qr",
                            "author": "Kangaroo_Low",
                            "score": 2,
                            "created_utc": 1640219497.0,
                            "response": "You can't,  the government can. They are currency issuers you are not.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hposs1r",
                                    "author": "EnergySilly3061",
                                    "score": 1,
                                    "created_utc": 1640271488.0,
                                    "response": "Sure I could, but would you use my currency?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hplki63",
                    "author": "fresheneesz",
                    "score": 9,
                    "created_utc": 1640204530.0,
                    "response": "Why pay back your debts to zero when you can devalue them to zero?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hpm61j0",
                    "author": "mikez56",
                    "score": 4,
                    "created_utc": 1640213480.0,
                    "response": "Austan Goolsbee's face is priceless! LMAO",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hplddrd",
                    "author": "Jaizhanju",
                    "score": 10,
                    "created_utc": 1640201627.0,
                    "response": "Alan Greenspan? More like Alan Greenspam.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hplda8b",
                    "author": "explosiveplacard",
                    "score": 8,
                    "created_utc": 1640201586.0,
                    "response": "Wow. Just wow. \n\nI thought this was edited or a parity. Nope, this is real and how the Fed used to (and still does) think.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hpljnkd",
                            "author": "Cimexus",
                            "score": 12,
                            "created_utc": 1640204188.0,
                            "response": "Yes that’s how fiat currency works. And more generally is also why sovereign debt isn’t like personal or household debt. When you can create more of the very thing the debt is denominated in on a whim, then there’s no chance of default, and is why countries can happily have sovereign debt multiple times their own GDP without creditors doubting their ability to pay.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hplndgx",
                                    "author": "zipzapbloop",
                                    "score": 6,
                                    "created_utc": 1640205688.0,
                                    "response": ">why sovereign debt isn’t like personal or household debt\n\nPreach! It bums me out how little recognition there is in society of the fundamental difference between a social unit like a family and a nation state. They don't, and conceptually can't, operate using the same rules.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hpmdg6x",
                                            "author": "Rife_",
                                            "score": 5,
                                            "created_utc": 1640216828.0,
                                            "response": "Why? Genuine question, not being sarcastic.\n\nWhy can't a country have sound money and only spend what it earns?\n\nI know the general idea is that the US is happy to print USD to pay back debt in USD and that isn't a problem to the country as long as the USD stays in global demand but it sure as shit is a problem for all US citizens who have their savings and bank account purchasing power severely diminished each year.\n\nI also know the US is happy to take out huge loans from other countries to lessen the need to print USD and the idea is that in 10/20/30 years when those loans are due the size of the US economy will have grown to a point where those loans are a much smaller burden on the economy than they are now. Take out a loan that equates to 10% GDP now and in 20 years pay it back when it's 2% of GDP, for example.\n\nBut isn't this also how economies and currencies collapse? What happens when the economy doesn't grow fast enough or consistently enough to cover those loan obligations further down the road without crippling the economy? Isn't this what is happening right now in India? What happens when the USD has been inflated so much that working class people with nothing but fiat assets see those assets buy 10-20% less stuff each year and decide to stop playing the game that is so obviously rigged against them?\n\nSovereign debt is a literal Ponzi scheme. Todays debt is covered by an ever expanding workforce tomorrow. Boomer debt is going to be covered by Millennials working and Millennial debt is going to be covered by Gen Z working but it doesn't look like the numbers add up. The west is scrambling to solve this issue now by importing migrant labour but that creates a whole slew of new issues too. US national debt per person is $85,000. I don't see how that is sustainable unless there are 2/3/4 times as many Millennials than Boomers and so on. This seems like Social Security writ large to me. Where there used to be 20 people working per retiree, now there are 2 or something and the whole system is going bankrupt.\n\nSaylor said \"fix the money, fix the world\" and I think part of that is curbing the Ponzi scheme that is sovereign debt. What am I missing here?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "hpmkzmg",
                                                    "author": "zipzapbloop",
                                                    "score": 2,
                                                    "created_utc": 1640220364.0,
                                                    "response": "I wish I could answer your thoughtful questions. I haven't sorted them out myself.\n\nI was specifically responding to the common notion that there's something obvious about how features and rules of a group of people at the level of a family should apply to a group of people at the level of a nation state. Sometimes. Maybe. But it isn't obvious that things should or even *could* work the same because there's a fundamental difference between the systems and we should expect that difference to produce a different set of possible and likely dynamics and rules.\n\nI was introduced to this idea through geopolitics. I'm not at all an expert, it's just one of those concepts you come across when you venture into a domain. In geopolitics there's a concept of [anarchy](https://en.wikipedia.org/wiki/Anarchy_(international_relations)), but it means something different than the way \"anarchy\" is typically used. It means:\n\n>there is no hierarchically superior, coercive power that can resolve disputes, enforce law, or order the system\n\nAt the level of our lives as individuals, families, neighborhoods, and so on up the ladder we can find a hierarchically superior, coercive power that can resolve disputes, enforce law, or order the system...until you arrive at the level of the nation state. At that level things can start to get weird and things like the commonsense ethics of day-to-day living can break down and something that would seem perverse becomes ethical or rational or what have you because there's no higher authority that can help resolve disputes.\n\nAnyway, my point is simply that merely because a family ought to manage life a certain way isn't in itself reason to think that a nation-state should manage itself among its peers the same way. Again, maybe, maybe not. Hopefully that makes what I wrote make a little more sense. I should have fleshed it out more when I wrote it.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "hpnd2pn",
                                                    "author": "SJWcucksoyboy",
                                                    "score": 1,
                                                    "created_utc": 1640236418.0,
                                                    "response": "> Why can't a country have sound money and only spend what it earns?\n\nThey could it's just a bad idea that would lead to much slower economic growth and a lot less important government programs. It'd essentially be austerity for no reason. \n\n> But isn't this also how economies and currencies collapse?\n\nUsually hyperinflation or defaulting on debts are just a symptom of a larger issue. If you get to the point where you risk default or hyper inflation you'd still have a ton of issues no matter your level of debt.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "hpo0alf",
                                                    "author": "NeuroticKnight",
                                                    "score": 1,
                                                    "created_utc": 1640253343.0,
                                                    "response": ">Why can't a country have sound money and only spend what it earns?\n\nFor one because nothing has any value intrinsically in objective manner. Like the universe doesnt value one thing over another  it is as is. So when a country or people come together to assign  value then they have to contrive  it together. Much like you can use any noises to mean anything but for sake of practical and personal sanity, we agree to use specific noises to mean specific things.\n\nAlso because in a global economy, if your country isnt buying something, some other country is, and in the long run, you are losing resources for it.  For most of our economic system be it land , oil or other resources, it is first come first serve, and as such grabbing all raw materials now and figuring out how to manage them effectively later is better than trying to figure it out first.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "hplh0wx",
                            "author": "theloiteringlinguist",
                            "score": 6,
                            "created_utc": 1640203116.0,
                            "response": "Longest standing fed president lol",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "hplwze4",
                            "author": "satuuurn",
                            "score": 2,
                            "created_utc": 1640209624.0,
                            "response": "Greenspan’s “print money” quote isn’t a matter of thinking. It’s how the system works. And it’s a big part of what the Bitcoin community and others around the finance world talk about all the time.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hpli4us",
                    "author": "BrainsOfCrypto",
                    "score": 3,
                    "created_utc": 1640203565.0,
                    "response": "Infinite money hack: just print more bro.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hplpdsb",
                    "author": "hemzer",
                    "score": 3,
                    "created_utc": 1640206509.0,
                    "response": "Says it with Pride !!     \nLOL ! I Luv the confidence.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hplsxu4",
                    "author": "warriorlynx",
                    "score": 3,
                    "created_utc": 1640207970.0,
                    "response": "Millennials are so screwed man",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hplu5zo",
                    "author": "AutonomousAutomaton_",
                    "score": 3,
                    "created_utc": 1640208469.0,
                    "response": "What he is assuming everyone knows is that bc we have ensured status as global reserve by strategic military action (or threat of action) we can print money with impunity. \n\nGreenspan as key to petro dollars rise to dominance might take this for granted - most people don’t know this so printing money ad Infinitum sounds crazy. And it might be but he does have a logical backing for his claim",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hpnatvh",
                            "author": "waffleboi999",
                            "score": 2,
                            "created_utc": 1640235120.0,
                            "response": ">Austan Goolsbee's\n\nExactly! Check out Jason Lowry on youtube with Pomp, he talks about our Proof of War capability and how Bitcoin will be the next stage in societal evolution. Moving from Mutual assured destruction (military might - if you attack me, then I'll do xyz with nukes and we'll all die) to Mutual assured preservation (if you secure the network more (mining) then I will benefit from that as well!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hpnf2h9",
                                    "author": "AutonomousAutomaton_",
                                    "score": 2,
                                    "created_utc": 1640237618.0,
                                    "response": "Yeah I love that as a concept - Henry Ford speculated on it 100 years ago",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hpmm53w",
                    "author": "Mage_Ozz",
                    "score": 3,
                    "created_utc": 1640220915.0,
                    "response": "Is out of context , and technically is true…. \n\nhe is not speaking about consequences of that measure… he is just stating a true fact: the probability of US defaulting Us debt is 0.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hplqnx9",
                    "author": "HailToTheKink",
                    "score": 2,
                    "created_utc": 1640207038.0,
                    "response": "The slight of hand here is that the central bank has turned a credit default from a true/false to a spectrum. This is called a \"soft\" default, which is not a default by any means, but still pretty bad.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hpls15b",
                    "author": "Tendieman98",
                    "score": 2,
                    "created_utc": 1640207599.0,
                    "response": "that's literally the worst thing he could have said, that's like being asked \"is your product worth buying?\" and responding \"well I suppose we make so many that when they break we can just send you another\"\n\nlike fuck me man, what an amazing fucking product, I GUESS THAT MEANS IF ITS A FAULTY PIECE OF SHIT ITS OK THEN IS IT?????\n\nits like saying being asked in court \"so did you commit tax fraud?\" and saying \"well maybe but I have so much money from all that tax I was meant to pay that I can pay it back anyway\"\n\nfucking idiot, this is what happens when the aging class doesn't shuffle off their seats of power before the FUCKING DEMENTIA sets in.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hplviwb",
                    "author": "birmingslam",
                    "score": 2,
                    "created_utc": 1640209031.0,
                    "response": "Remember... When you owe a creditor a good some of money, they own you...But when you owe the creditor an incredibly massive sum of money, you own them.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hpml62e",
                    "author": "moonlanding1976",
                    "score": 2,
                    "created_utc": 1640220448.0,
                    "response": "The idiot of the fed",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hpmyah7",
                    "author": "bo0da",
                    "score": 2,
                    "created_utc": 1640226720.0,
                    "response": "Mo money mo money! Brrrrrrrrrr",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hpn456r",
                    "author": "TheGreatest34567",
                    "score": 2,
                    "created_utc": 1640229587.0,
                    "response": "The other dude be like, \"time to invest in some Bitcoin\".",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hpnh488",
                    "author": "jhx264",
                    "score": 2,
                    "created_utc": 1640238897.0,
                    "response": "MMT\n\nSay it with me. \n\nMMT",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hpo4qio",
                    "author": "moofarf",
                    "score": 2,
                    "created_utc": 1640257027.0,
                    "response": "The US can pay ANY debt\" say Greenspan. Poor the Americans who fall into the hand of guys like him .",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hpoe7q3",
                    "author": "dimiurgz",
                    "score": 2,
                    "created_utc": 1640263832.0,
                    "response": "PRINT MORE MONEY ? THAT'S THE ROOT OF THE DAMN PROBLEM !",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hpopxu6",
                    "author": "xiangbing",
                    "score": 2,
                    "created_utc": 1640270158.0,
                    "response": "Every person who believes that printing $ is a great idea should watch \"Gold for Bread\" by Journeyman Pictures. It is amazing how people in the government can get away with causing so much suffering.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hpl64hw",
                    "author": "theloiteringlinguist",
                    "score": 4,
                    "created_utc": 1640198704.0,
                    "response": "[Full video on The Valuable Investor youtube page ](https://youtu.be/Zr3qj2gtvBw)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hplrvp6",
                    "author": "MenacingMelons",
                    "score": 3,
                    "created_utc": 1640207536.0,
                    "response": "These old bags think that the answer is just to print more. What morons.\n\n\"Not our problem I'll be dead by then. Fuck you, future generations!\" - them daily, probably",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hplwc0a",
                    "author": "Asum_chum",
                    "score": 1,
                    "created_utc": 1640209361.0,
                    "response": "Sound logic. I’m in. I’ll give you a rate of 1 btc-1 usd.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hplwq4q",
                    "author": "rakeruk",
                    "score": 1,
                    "created_utc": 1640209519.0,
                    "response": "Legalised counterfeiting.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hpm2xzs",
                    "author": "Jdilla23",
                    "score": 1,
                    "created_utc": 1640212130.0,
                    "response": "Doesn’t even get creative with language. Just fucking says it 😂",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hpm3j9f",
                    "author": "Rollinrollin1000",
                    "score": 1,
                    "created_utc": 1640212386.0,
                    "response": "Some hedge fund manager must have banged his head on the post once too many.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hpm4xmj",
                    "author": "Yattiel",
                    "score": 1,
                    "created_utc": 1640212994.0,
                    "response": "Why are people still listening to this guy??",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hpm4xpk",
                    "author": "StoneHammers",
                    "score": 1,
                    "created_utc": 1640212995.0,
                    "response": "That guy on the right; that look on his face. What is that expression? \"what the fuck he just say?\"",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hpm59lu",
                    "author": "sebikun",
                    "score": 1,
                    "created_utc": 1640213141.0,
                    "response": "Whattttt? It's this a real answer or just Comedy 😂",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hpm5if8",
                    "author": "GreenMantis99",
                    "score": 1,
                    "created_utc": 1640213248.0,
                    "response": "So can’t other countries just print worthless American dollars too?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hpm65x1",
                    "author": "AIBobbleHead",
                    "score": 1,
                    "created_utc": 1640213534.0,
                    "response": "He's right. If the fed raises rates the govt will just print more money and then for sure the currency will be completely worthless and so will all the debt backing it. Good man. Nevermind there is no more market for that debt to create the dollars to pay off the current debt. That's why the fed developed plans for a managed default of the US govt and wrote up guidelines on what debt the govt should default on first.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hpm6jws",
                    "author": "Initial-Good4678",
                    "score": 1,
                    "created_utc": 1640213706.0,
                    "response": "As long as we (the USA) have the most powerful military in the world, we can call peanuts-in-a-shell money. When China takes over the mantle of military might, then we'll change our tune.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hpm7hz4",
                    "author": "rulesbite",
                    "score": 1,
                    "created_utc": 1640214129.0,
                    "response": "You telling me we can just print money because we say so????! Must be real nice.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hpm7v4u",
                    "author": "hdfb1",
                    "score": 1,
                    "created_utc": 1640214293.0,
                    "response": "Wowzers",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hpm8ac6",
                    "author": "BourbonChillin",
                    "score": 1,
                    "created_utc": 1640214482.0,
                    "response": "Well, that's scary as hell.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hpm8pi3",
                    "author": "circleuranus",
                    "score": 1,
                    "created_utc": 1640214671.0,
                    "response": "And the number of people who don't understand that statement or it's implications is astounding. The U.S. will never default.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hpmbu9v",
                    "author": "Philbot_",
                    "score": 1,
                    "created_utc": 1640216096.0,
                    "response": "Goolsbee kills me with that look.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hpmdhf2",
                    "author": "0x1a3c3e7",
                    "score": 1,
                    "created_utc": 1640216843.0,
                    "response": "He lied. It very much is a credit rating issue.  The US government uses income tax revenue as collateral. So as long as the US can tax our incomes, it can maintain this snowball cycle of debt. And that's why Congress can never replace the income tax.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hpmdx60",
                    "author": "rtheiss",
                    "score": 1,
                    "created_utc": 1640217042.0,
                    "response": "0% probability of default, 100% probability of inflation.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hpmge9t",
                    "author": "amphibian303",
                    "score": 1,
                    "created_utc": 1640218194.0,
                    "response": "Wow",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hpmlhlg",
                    "author": "HalfRick",
                    "score": 1,
                    "created_utc": 1640220602.0,
                    "response": "He’s not saying that money printing is inherently and by definition harmless for the economy. What he’s saying is that the downgrade in the US credit rating doesn’t mean what it means when an enterprise gets a decreased credit rating - because of the most basic and fundamental characteristic of a central bank.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hpmnqw3",
                    "author": "florin2977",
                    "score": 1,
                    "created_utc": 1640221685.0,
                    "response": "Does he even hear himself!?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hpmusap",
                    "author": "hsmst4",
                    "score": 1,
                    "created_utc": 1640225046.0,
                    "response": "He's not confessing.  He's bragging...",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hpmxlwa",
                    "author": "ShawnShipsCars",
                    "score": 1,
                    "created_utc": 1640226395.0,
                    "response": "Bruv...",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hpn0pvx",
                    "author": "pedrobuffon",
                    "score": 1,
                    "created_utc": 1640227907.0,
                    "response": "solution for world economy: PRINT MORE MONEY SO WE CAN BE MORE RICH",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hpn2dt7",
                    "author": "bitcoinharambeee",
                    "score": 1,
                    "created_utc": 1640228715.0,
                    "response": "🤡🤡🤡",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hpn3fx1",
                    "author": "Netbr0ke",
                    "score": 1,
                    "created_utc": 1640229240.0,
                    "response": "Hey Greenspan, how's that work out in Nazi Germany? Nazi America doesn't stand a chance.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hpn4tlu",
                    "author": "set-271",
                    "score": 1,
                    "created_utc": 1640229927.0,
                    "response": "My bet is the guy next to Greenspan is the real Satoshi Nakamoto!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hpn52ax",
                    "author": "Salts-Flags",
                    "score": 1,
                    "created_utc": 1640230052.0,
                    "response": "The downgrade of the United States credit rating was a disgraceful move by S&P. Alan Greenspan was spot on when he said that it was a political decision, not an economic one.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hpn5qea",
                    "author": "NickMtothemoon",
                    "score": 1,
                    "created_utc": 1640232110.0,
                    "response": "You have to love the honestly",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hpn7nur",
                    "author": "TyranaSoreWristWreck",
                    "score": 1,
                    "created_utc": 1640233284.0,
                    "response": "So we can just print our own money? When the IRS asks me for taxes next year I can just print the sum out on my computer and send it to them? Is that how this works?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hpn911z",
                    "author": "mustangy0634",
                    "score": 1,
                    "created_utc": 1640234083.0,
                    "response": ":) thats it,",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hpnh6a3",
                    "author": "Deeze_Rmuh_Nudds",
                    "score": 1,
                    "created_utc": 1640238933.0,
                    "response": "Oof",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hpnhrk3",
                    "author": "Castcle_Ecosystem",
                    "score": 1,
                    "created_utc": 1640239313.0,
                    "response": "Hugely bearish for the USD",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hpnj5h7",
                    "author": "Friar-Pacioli",
                    "score": 1,
                    "created_utc": 1640240209.0,
                    "response": "Greenspan is right, and history has proved him right. The US has monetary souvereignty. This is awesome. No other country has that. And believe me, there are smarter people in other countries. US is full of degenerates who don‘t get the Federal Reserve System.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hpnl2uq",
                    "author": "44pol477",
                    "score": 1,
                    "created_utc": 1640241499.0,
                    "response": "Speaking on this subject, is there anything else that devalues itself the more there is other than money? It's not like saying the more doctors you have the less valuable they are... Gold, silver and other precious metals don't fit either because they can be used for other things... What else is like money? Not even toilet paper is like money. Damn... help me here.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hpnmkmh",
                    "author": "traderraye",
                    "score": 1,
                    "created_utc": 1640242536.0,
                    "response": "I thought Alan Greenspan's comments were very significant - he's actually admitting that the downgrade status will rock the socks of the markets for a while.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hpnmt4f",
                    "author": "brd111",
                    "score": 1,
                    "created_utc": 1640242706.0,
                    "response": "This is true as long as the dollar is the key currency. Paying existing debt in this manner is not a problem. Also, printing dollars makes paying existing debts easier. However, there is a possibility that future bonds will lack demand in a world that the USD is not key.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hpnp5q6",
                    "author": "netbyka",
                    "score": 1,
                    "created_utc": 1640244397.0,
                    "response": "if you can just print money, then every country should be AAA.  Zimbabwe should be AAA.......Just make sure they got a printing press.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hpulzeb",
                            "author": "firl21",
                            "score": 1,
                            "created_utc": 1640380289.0,
                            "response": "The problem is when you take on debts in foreign currency. \n\ncant print your way out of that.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hpnqt9v",
                    "author": "Bunga_Dude",
                    "score": 1,
                    "created_utc": 1640245657.0,
                    "response": "My dude on the right just had a coming to Jesus moment on TV.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hpnu1b7",
                    "author": "juandow43",
                    "score": 1,
                    "created_utc": 1640248198.0,
                    "response": "Arguably the person and the administration responsible for the worst hit to US reputation in modern times. The myth that the American Financial system is self regulating and beyond reproach is forever broken. Greenspan deserved all the ridicule and even much worse.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hpnukog",
                    "author": "Bitcoin_is_plan_A",
                    "score": 1,
                    "created_utc": 1640248625.0,
                    "response": "that is true for every country that can print its own currency and has only debt in its own currency.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hpnwnn2",
                    "author": "WWG1WGA_crypto",
                    "score": 1,
                    "created_utc": 1640250319.0,
                    "response": "In less than 15 years, bonds will be completely useless and worth next to nothing, and the bag holders will be the biggest jokes in US history; Who TF is still buying bonds besides baby boomers and their still living parents??",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hpulviz",
                            "author": "firl21",
                            "score": 2,
                            "created_utc": 1640380236.0,
                            "response": "Institutions and people near retirement",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hpnws2o",
                    "author": "spirit2912",
                    "score": 1,
                    "created_utc": 1640250418.0,
                    "response": "\"Is there a risk of a double dip?\" -Greenspan: \"Depends on Europe. Not the United States.\" -Hahahahahahahahahahahahaha!! What an ultra jerk!!!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hpnyhsk",
                    "author": "evkolac",
                    "score": 1,
                    "created_utc": 1640251826.0,
                    "response": "So...what about inflation?? I don't understand. this confuses me now so much.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hpnzfuk",
                    "author": "77sergik",
                    "score": 1,
                    "created_utc": 1640252622.0,
                    "response": "Is that a good thing?  I would argue the other way..  That it means our \"money\" is phoney...Or like Elon musk said \"it's a hustle\"..",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hpo13xs",
                    "author": "carpediem-88",
                    "score": 1,
                    "created_utc": 1640254019.0,
                    "response": "Very smart man",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hpo4om6",
                    "author": "Tw1sttt",
                    "score": 1,
                    "created_utc": 1640256983.0,
                    "response": "By printing money to pay back bonds, the bond holders dollars are losing value faster than they’re gaining in interest dollars",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hpulrn6",
                            "author": "firl21",
                            "score": 1,
                            "created_utc": 1640380183.0,
                            "response": "not always, real return is most of the time higher than nominal return.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hpod1k8",
                    "author": "Mektzer",
                    "score": 1,
                    "created_utc": 1640263092.0,
                    "response": "And what's even funnier is that the more we print the more we devalue our own debt!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hpoq3tq",
                    "author": "fubolibs",
                    "score": 1,
                    "created_utc": 1640270237.0,
                    "response": "US can print as much as it wants because of the perceived power of the US military.   That perceive power got hit big with Afghanistan withdrawal.  The moment Us loses a battle against Russia or China the entire house of cards will fall",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hpornf9",
                    "author": "fiercygoat",
                    "score": 1,
                    "created_utc": 1640270964.0,
                    "response": "Every government has this power of unlimited printing. The question is how much of an impact  will it have on the value of your currency",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hpos9vw",
                    "author": "misn0ma",
                    "score": 1,
                    "created_utc": 1640271254.0,
                    "response": "Respect to the producer for covering the reaction.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hpot7la",
                    "author": "kaseyriot",
                    "score": 1,
                    "created_utc": 1640271687.0,
                    "response": "ok grandpa lets get you to bed",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hpoywfc",
                    "author": "Salt-Appointment5803",
                    "score": 1,
                    "created_utc": 1640274218.0,
                    "response": "what an asshole",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hpp3v3w",
                    "author": "AbuddyFL",
                    "score": 1,
                    "created_utc": 1640276354.0,
                    "response": "ID10T",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hpp46eq",
                    "author": "TheNumenorian",
                    "score": 1,
                    "created_utc": 1640276485.0,
                    "response": "Just like Bitcoin, as long as there are enough billionaires accumulating money and taking money out of circulation, printing more money worked. But if you let everyone get some, and they are out there spending it into circulation, THEN you get inflation.\n\nAt least with BTC, they can't \"just print more.\"",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hpull6f",
                            "author": "firl21",
                            "score": 1,
                            "created_utc": 1640380094.0,
                            "response": "we can just make a new crypto :)",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "hpphvqs",
                    "author": "natalituk75",
                    "score": 1,
                    "created_utc": 1640282183.0,
                    "response": "He's a bloody lunatic! Because of people like him the global economy is going to collapse soon. Time to go physical gold and crypto.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hppkxfz",
                    "author": "str0118q",
                    "score": 1,
                    "created_utc": 1640283445.0,
                    "response": "we can always print more money.... let's get those printing machines ready...how about we just print 24 hours a day.... non-stop .",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hpplf5n",
                    "author": "merkleID",
                    "score": 1,
                    "created_utc": 1640283648.0,
                    "response": "other guy’s face goes like “he didn’t say THAT. no he definitely DIDN’T SAY THAT. no no no no no he didn’t”",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hppqpy8",
                    "author": "Critical_Bookkeeper3",
                    "score": 1,
                    "created_utc": 1640285887.0,
                    "response": "👌🏽😂😂😂",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hqde461",
                    "author": "IanPrado",
                    "score": 1,
                    "created_utc": 1640752461.0,
                    "response": "When you say what you're not suppose to say",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hqoaqnp",
                    "author": "Barnoptimus",
                    "score": 1,
                    "created_utc": 1640953663.0,
                    "response": "Can I get 10 upvotes so I have enough comment karma to educate some people on the banking system in another group - kinda annoyed I typed all this out it’s been removed:\n\nIf you take all the money in the world, it wouldn’t be enough to pay back all the debt! Sounds like an issue to me and disproves your point that every debit has an equal credit, even if you take all money and all tangible assets in existence, it wouldn’t be enough to pay back all the debt + interest - I can’t remember the exact figure , but the interest on American debt alone amounted to like 305 billion per annum - and that’s at historically low interest rates , imagine if we saw interest rates rise to 5%...... can someone please explain to me who profiteers off the interest accrued from but national, commercial and retail debt ? \n\nAlso I don’t see how people don’t have a problem with for profit financial institution? It is literally a conflict of interest between making profit margins and what’s beneficial for the global economy - this literally happened during the times of the Templar knights and all the banking leaders were captured a decapitated for this exact reason\n\nTbh this system works fine as long as there is perpetual growth , once growth stagnates the entire system collapses on itself. The reason people support crypto is so that banks don’t skim the wealth of the people as they are currently doing! By lending you are literally stealing wealth from the future by reducing purchasing power and increasing how much debt needs to be serviced by tax payer dollars annually - again who is benefiting from this ?\nIt is a problem when more money is entering the system than is been burned or value created !\n\nAnd just a question - how would people feel about interest free loans as it currently is in Islamic countries - the reason it is law to have interest free loans in those states is because they remember the collapse from the previous banking system dating all the way back to the Templar knights (the fathers of the modern banking system )\n\nHonestly all people defending this are idiots - all it would take to collapse this entire system would be a hike in interest rates , and we are happy to let a small group of central bankers decide this at a whim ? The issue now is they have created such a giant debt bubble that they need to keep interest rates low and keep printing money or the economy collapses - eventually inflation will out pace economic growth and the system will collapse either way - we are just fortunate that currently this balance hasn’t reached tipping point",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hs64gdw",
                    "author": "aircrew85",
                    "score": 1,
                    "created_utc": 1641877764.0,
                    "response": "Greenspan…thinking he can keep expanding that green",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hpmmlmy",
                    "author": "originalbanks",
                    "score": 0,
                    "created_utc": 1640221135.0,
                    "response": "Lmao perfect example of why the country is in the state it is in. Print print print…",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}