{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ursj2y",
            "title": "Beginner Bitcoin Buyer",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/ursj2y/beginner_bitcoin_buyer/",
            "author": "long_covid_memes",
            "created_utc": 1652811012.0,
            "score": 2,
            "num_comments": 12,
            "subreddit": "BitcoinBeginners",
            "selftext": "Hello, I am looking to buy a chunk of Bitcoin for the first time and keep investing monthly or so. What is the best place to do it in your opinion? All these different sites/apps and their fees is confusing",
            "stickied": false,
            "comments": [
                {
                    "id": "i8z3spx",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1652811012.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8z4ynl",
                            "author": "long_covid_memes",
                            "score": 2,
                            "created_utc": 1652811491.0,
                            "response": "Yup, aware of all the scams",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8z5242",
                    "author": "mtnbikey",
                    "score": 1,
                    "created_utc": 1652811532.0,
                    "response": "Use a centralized exchange like Kraken or Binance or Coinbase Pro or FTX",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8z52vn",
                    "author": "bitusher",
                    "score": 1,
                    "created_utc": 1652811541.0,
                    "response": ">All these different sites/apps and their fees is confusing\n\nThan lets simplify everything into 2 basic steps :\n\n**Step 1 Setup a wallet** , and backup your words to keep them secret and private.\n\nRead the FAQ - https://www.reddit.com/r/BitcoinBeginners/comments/g42ijd/faq_for_beginners/\n\nHere are some good wallets for beginners and video tutorials-\n\n**Blockstream Green Wallet** IOS and android wallet\n\nhttps://www.youtube.com/watch?v=uO3Zi9D5b0Y\n\nhttps://blockstream.com/green/\n\n**Step 2 Buy BTC and transfer it to your personal wallet**- If you are in the USA than the best way to buy BTC is with cash app - https://cash.app/help/us/en-us/1016-bitcoin\n\nhttps://itunes.apple.com/us/app/square-cash/id711923939?mt=8\n\nhttps://play.google.com/store/apps/details?id=com.squareup.cash&referrer=utm_source%3Dcash-web-bitcoin%26utm_medium%3Dweb\n\nVerification either is instant or can take a couple days once you verify your phone, email and ID.\nBuying and selling bitcoin is listed under the investing tab to the right of dollar sign on bottom(squiggly line) than selecting Bitcoin\n\n\nIf you need BTC slightly quicker or need to pay in cash than https://coinatmradar.com or https://www.coinstar.com/bitcoin but fees are at least 7% and higher\n\nIf you are out of the US or buying larger amounts of bitcoin than look into coinbase pro, gemini active trader , or kraken\n\nLet us know if you have any other questions",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8z87nu",
                    "author": "BTCMachineElf",
                    "score": 1,
                    "created_utc": 1652812818.0,
                    "response": "Coinbase Pro, Gemini with Active Trader, cashapp, others.\n\nThen get a phone wallet, Bluewallet or Blockstream Green, and once you're a few thousand $ deep, get a hardware wallet, Trezor or Coldcard.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8zbn8m",
                    "author": "CuriousResearcher506",
                    "score": 1,
                    "created_utc": 1652814220.0,
                    "response": "You could check Guarda, it's a non-custodial wallet suitable for beginners and experts. You can buy Bitcoin with credit card or SEPA transfer and hodl safely. You have the power over your assets since you own your private keys and saving these in a secure place ensures the safety of your crypto journey. \n\nUseful links: \n\n\nhttps://guarda.com/coins/bitcoin-wallet/\n\nhttps://guarda.com/academy/blockchain/where-to-keep-cryptocurrency/\n\nhttps://guarda.com/buy-bitcoin/",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8zcwug",
                    "author": "jrkellum84",
                    "score": -3,
                    "created_utc": 1652814736.0,
                    "response": "Don’t be a holder, sell your profits as you go",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i91d10c",
                            "author": "JazzyHandzzz",
                            "score": 1,
                            "created_utc": 1652848519.0,
                            "response": "Not the best advice for someone who is just starting in crypto",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8zaikv",
                    "author": "AdvertisingWitty4373",
                    "score": 0,
                    "created_utc": 1652813757.0,
                    "response": "The Crypto market has proved to be profitable over time but it all depends on your choice of investment. Investing  wrongly might have you ending up with losses and no one wants that.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "urryhf",
            "title": "Receive address changing",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/urryhf/receive_address_changing/",
            "author": "Madteklynd",
            "created_utc": 1652809484.0,
            "score": 1,
            "num_comments": 4,
            "subreddit": "BitcoinBeginners",
            "selftext": "Yesterday I initiated moving my funds from Celsius to the Casa app. I currently have only the basic setup with them having custody of my coins. I checked the wallet receive address in Casa, and input it to celsius to wait 24 hours for it to whitelist. When I open Casa today to check on the address, it has now changed.\n\nIs this normal? How am I supposed to send from Celsius if it changes?\n\nThanks in advance for any help.\n\nAlso, how come Casa doesn't have a subreddit? It also doesn't have a single review on trustpilot. Seems a little fishy to me",
            "stickied": false,
            "comments": [
                {
                    "id": "i8z3uh6",
                    "author": "bitusher",
                    "score": 1,
                    "created_utc": 1652811032.0,
                    "response": "Its normal for almost all Bitcoin wallets to change the address with every transaction for privacy reasons \n\n>How am I supposed to send from Celsius if it changes?\n\nSending to an old address still means you get the bitcoin as long as you are using the same wallet . Its just not as good for privacy if you keep using the same address multiple times \n\n>Also, how come Casa doesn't have a subreddit? \n\nLooks like they do \n\nhttps://www.reddit.com/r/casanode/\n\n>It also doesn't have a single review on trustpilot.\n\nBitcoin has hundreds of wallets , an most don't have reviews on trustpilot , trustpilot isn't the best source for verifying a wallet \n\nYou should use better sources like \n\nhttps://walletscrutiny.com/",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8zmv28",
                    "author": "BitcoinWell",
                    "score": 1,
                    "created_utc": 1652818832.0,
                    "response": "All bitcoin wallets have essentially an unlimited number of addresses that can be used. Most wallets will give you a new one every time you use the previous one as its better for privacy. None of the addresses expire either so if you send someone an address and wait 10 years and have them send BTC to you, it will still end up in your wallet.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}