{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "us82qj",
            "title": "The Bolt Card - Contactless Bitcoin payments over the lightning network",
            "url": "https://www.reddit.com/r/Bitcoin/comments/us82qj/the_bolt_card_contactless_bitcoin_payments_over/",
            "author": "coincorner",
            "created_utc": 1652862166.0,
            "score": 39,
            "num_comments": 37,
            "subreddit": "Bitcoin",
            "selftext": "I guess that some of you will have seen the announcement about CoinCorner's new [Bolt Card](https://www.coincorner.com/theboltcard).\n\nDo you have any thoughts / questions? Are contactless card payments the future of bitcoin UX?\n\nMSW - Data Analyst at [CoinCorner](https://www.coincorner.com/)",
            "stickied": false,
            "comments": [
                {
                    "id": "i94dj13",
                    "author": "1entreprenewer",
                    "score": 5,
                    "created_utc": 1652907384.0,
                    "response": "We all wanna know how the heck it works.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i94tw2d",
                            "author": "ElucTheG33K",
                            "score": 3,
                            "created_utc": 1652914500.0,
                            "response": "Search for LNURLw.\n\nBasically some wallet (LNbits for example) can generate a static LNURL (a code) that allow another wallet to withdraw sat from the wallet of the card (fixed value or within a range).\n\nIt's mostly use with custodial wallet, the merchant create the wallet for the customer and load sats and his wallet associated with the LNURLw. The card is just an NFC tag that has the LNURLw on it. You could as well just copy past the URL to the app.\n\nBTCPay is used in the demo, I tried to activate this function on my BTCPay but so far it's not working with NFC, only by pasting the LNURLw. I will try again when I have time.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i96ksha",
                            "author": "coincorner",
                            "score": 2,
                            "created_utc": 1652952352.0,
                            "response": "Check out Danny's [blog post](https://blog.coincorner.com/the-bolt-card-d8510b4161b8) for a high level description. \n\nA more detailed technical description will be released in the near future (can't give a date yet, sorry!)\n\nMSW - Data Analyst at [CoinCorner](https://www.coincorner.com/)",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i92j5eg",
                    "author": "cookmanager",
                    "score": 3,
                    "created_utc": 1652879854.0,
                    "response": "This is something I have been thinking about and working on for a while; glad someone was able to do it—congratulations!  Like other posters said, the lack of available locations might be a downside to use, but I suggest CoinCorner to work with a worldwide vendor of tap to pay card readers like Verifone that have already set up equipment and methods for bitcoin payments via their system, if you haven’t done so already:\n\nhttps://www.verifone.com/en/us/engage\n\nhttps://www.verifone.com/en/us/services/verifone-cloud-services/crypto-payments\n\nEDIT:  I also have some suggestions for next gen of the card—you are on to a good thing here!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i96k93p",
                            "author": "coincorner",
                            "score": 1,
                            "created_utc": 1652951857.0,
                            "response": "Hi! Thanks for the reply. \n\nI agree that getting a critical mass of merchants to accept lightning is the major challenge here. Hopefully, the ease of use will be a big selling point. We are looking into several point of sales integrations :)\n\nVery interested in hearing your suggestions for next gen of the card! Feel free to leave them here or dm on twitter.\n\nMSW - Data Analyst at [CoinCorner](https://www.coincorner.com/)",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i92zbx0",
                    "author": "cpt_charisma",
                    "score": 3,
                    "created_utc": 1652887019.0,
                    "response": "How does this actually work?  Does it hold a private key?  What information is it giving to the merchant that they are able to initiate a lightning transaction?\n\nWhile this is convenient, it seems to put *way* too much trust in the merchant.  If I were an unscrupulous merchant, I could display a transaction for $5, but actually charge the customer $50.  They wouldn't have any way of knowing and they would have no recourse, other than going back to the shop and complaining.  That won't work with a dishonest merchant.  The user needs to be able to verify the amount and payment recipient independently.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i935bma",
                            "author": "BigDeezerrr",
                            "score": 1,
                            "created_utc": 1652889461.0,
                            "response": "I was wondering this too. What if you could connect the card to your LN wallet on your phone and when you scan the card a popup appears on your phone stating the sats being moved that you approve with one touch? Seems like you could quickly verify the payment details and avoid scanning/messing around with a phone app which so many people seem to have trouble with.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i93g697",
                    "author": "Ima_Wreckyou",
                    "score": 3,
                    "created_utc": 1652893829.0,
                    "response": "Is there a more in-dept technical explanation on how this works? I guess it's transmitting an invoice or an lnurl or something? Would apprechiate some pointers.\n\nI absolutely love the look of the cards, just ordered the wizzard and the black one. Can't wait to play with them, even if probably no shop is around to use them XD",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93xh4x",
                    "author": "whitslack",
                    "score": 3,
                    "created_utc": 1652900830.0,
                    "response": "This is no good. The only safe way to implement this would be for the card to have an e-ink display and a capacitive touch button. Tap the card on the payment terminal once, and the e-ink screen updates to show the amount of the payment being requested. Tap the card again while holding the button, and if the requested amount is still the same as the amount displayed on the screen, then the payment is signed.\n\nWithout the two-step confirmation, a rogue merchant could simply display one amount but present a much higher amount by NFC. There would be no way for the customer to dispute the charge or claw the funds back.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i922y48",
                    "author": "Serene-dippity",
                    "score": 5,
                    "created_utc": 1652870025.0,
                    "response": "I immediately checked it out - because I want to be able to use BTC / LN conveniently IRL .  However I found an absolute paucity of info on locations where it can be used (unless you live on the Isle of Man - I don't). \n\nI realise this is not your problem as it needs merchant demand pull.\n\nHowever if/when you integrate in common Payment terminals I will be buying very soon.\n\nWill strike get to Europe before you do that - who knows ? Game on",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i924w0k",
                            "author": "coincorner",
                            "score": 7,
                            "created_utc": 1652871510.0,
                            "response": "Hey :)\n\nIt can be used anywhere that accepts lightning and has NFC capability - either a point-of-sales device or just a phone app. Admittedly, the number of merchants accepting lightning is currently quite small. We're working on a number of integrations with payment terminals, so watch this space. \n\nFeel free to shill [CoinCorner Checkout](https://www.coincorner.com/Checkout) to merchants near you. They have the option of instantly converting BTC received to GBP or EUR for a 1% fee.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i929fl9",
                                    "author": "Serene-dippity",
                                    "score": 3,
                                    "created_utc": 1652874554.0,
                                    "response": "\\>> We're working on a number of integrations with payment terminals, so watch this space.\n\nGreat ! - Certainly will.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i92sub9",
                    "author": "not_SatoshiNakamoto",
                    "score": 2,
                    "created_utc": 1652884296.0,
                    "response": "This is pretty cool! One security question though. Say a thief knows I have a loaded Bolt Card in my wallet. Wouldn't stealing funds be as easy as creating a lightning invoice and tapping their phone on my wallet?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i93cgy1",
                            "author": "bigdaddyjeff69",
                            "score": 2,
                            "created_utc": 1652892355.0,
                            "response": "If it was then maybe users should also buy one of those wallets that block those",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i92u947",
                    "author": "r3310",
                    "score": 2,
                    "created_utc": 1652884897.0,
                    "response": "Can't open the website because of geo-restriction. Ironic, isn't it?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93kmaw",
                    "author": "Acceptable-Risks",
                    "score": 2,
                    "created_utc": 1652895631.0,
                    "response": "I've heard about this and am excited about it. This is a great step toward global adoption. Making the bitcoin network easy to use (even as a way to transact in other currencies) is the most important piece IMO. Massive adoption of nearly all technology does not come until someone figures out how to make it the obvious easy choice for the lay-man. We are heading in a good direction.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93qmk7",
                    "author": "ActionParticular7697",
                    "score": 2,
                    "created_utc": 1652898031.0,
                    "response": "The Bolt Card enables a user to simply tap their card on a point of sale device displaying a Lightning invoice and the Lightning payment is made in the background.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9223h6",
                    "author": "summonsterism",
                    "score": 2,
                    "created_utc": 1652869330.0,
                    "response": "What is needed is it to be *more* like a gift card.  \n\n\nOh, it can't be? Because a gift card it is.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i923e62",
                            "author": "Amoci",
                            "score": 4,
                            "created_utc": 1652870383.0,
                            "response": "Okay, so there's one difference after reading a little more.\n\n>The recipient can tap the card on their phone (NFC) and **sweep the bitcoin into their own Lightning wallet**.\n\nI guess that's kind of neat. If I was under 18, this would probably be something I would like to be gifted. I would prefer an Opendime, but sats are sats, amirite?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i923yhs",
                                    "author": "coincorner",
                                    "score": 4,
                                    "created_utc": 1652870818.0,
                                    "response": "Sats are sats - I can't fault your logic there! \n\nOpendimes are great if you want to give someone sats to hodl\n\nThe Bolt Card is ideal if you want to give someone sats to spend or if you want to spend sats regularly yourself\n\nDifferent horses for different courses :)",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i926ny8",
                                            "author": "Amoci",
                                            "score": 1,
                                            "created_utc": 1652872753.0,
                                            "response": "Is it ideal though? I don’t think it’s ideal.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i96kn3e",
                                                    "author": "coincorner",
                                                    "score": 2,
                                                    "created_utc": 1652952213.0,
                                                    "response": "Don't buy one then :)",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i96m195",
                                                            "author": "Amoci",
                                                            "score": 1,
                                                            "created_utc": 1652953458.0,
                                                            "response": "K",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i91vyqk",
                    "author": "Amoci",
                    "score": -3,
                    "created_utc": 1652863813.0,
                    "response": "Many consider gift cards to be impersonal gifts that give the impression that the gift giver is lazy. I don't think Bitcoin is going to change that.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i91wcbg",
                            "author": "coincorner",
                            "score": 5,
                            "created_utc": 1652864179.0,
                            "response": "Thanks for your comment! The Bolt Card isn't just a gift card, though it can be used as such. It is a contactless card which you can use to spend your bitcoin in shops and even online - no entering card details, just tap! A huge step forward in user experience relative to scanning QR codes in my humble opinion :)",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i91wtm4",
                                    "author": "Amoci",
                                    "score": 1,
                                    "created_utc": 1652864619.0,
                                    "response": "~~Can you use it anywhere or only where places accept lightning? Sounds a lot like a gift card.~~  \nIn addition to behaving like a gift card, it looks like the bolt card can also be used like a cashier's check to gift satoshis via lightning. Almost like Opendime but on lightning instead of legacy and requiring some custodial services.\n\nIf I was gifting someone satoshis, this would probably be a better option than Opendime for someone less tech savvy.  \n\nReally though, when I gift satoshis, I simply send it straight to their wallet and **skip the middlemen** because that's what the tech allows. \n\nOpendime is neat because you can keep changing hands, transferring the total value on the device, all without broadcast on-chain, similar to how cash behaves.\n\nI haven't actually used the bolt card, but from what I've read, I assume it could behave the same. How does the recipient check the balance? Would that require downloading CoinCorner's app?\n\nAlso, with Opendime, the recipient can hodl the device for years safely, but it looks like CoinCorner charges monthly fees if your account is inactive for 24 months.\n\n>If you haven't logged into your CoinCorner account for over 24 consecutive months, your account status will be deemed 'inactive'.  \nFor inactive accounts that still have a balance, we'll begin charging a £10 monthly fee to cover ongoing account maintenance costs until the account reaches zero.\n\nSo as the gifter, do I have to keep the CoinCorner app and keep logging in, or does the recipient need to?\n\nAlso, it sucks I have to register an account with CoinCorner to gift satoshis. No account creation needed with Opendime.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i924y26",
                                            "author": "coincorner",
                                            "score": 1,
                                            "created_utc": 1652871552.0,
                                            "response": "Hey :)\r  \n\r  \nIt can be used anywhere that accepts lightning and has NFC capability - either a point-of-sales device or just a phone app. Admittedly, the number of merchants accepting lightning is currently quite small. We're working on a number of integrations with payment terminals, so watch this space.\r  \n\r  \nFeel free to shill [CoinCorner Checkout](https://www.coincorner.com/Checkout) to merchants near you. They have the option of instantly converting BTC received to GBP or EUR for a 1% fee.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i926kkz",
                                                    "author": "Amoci",
                                                    "score": 1,
                                                    "created_utc": 1652872687.0,
                                                    "response": "Hell no. \nUse BTCPAY to accept Bitcoin and Lightning payments with 0% Fees & No Third-party.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i92qwko",
                    "author": "bigdaddyjeff69",
                    "score": 1,
                    "created_utc": 1652883454.0,
                    "response": "So I have couple questions. \n\nIs the card just a 2FA for a lightning wallet or is the card the wallet itself?\n\nHow decentralised is LN channel in the app? Or do you connect your own node or something?\n\nDoes the app let you store both fiat and BTC? \n\nCan any merchant accept this or will they need to go out of their way to set up something to accept payments from the card?\n\nIt says Kyc after depositing $100. Can users avoid kyc if they only deposit BTC?\n\nThe card tab isn’t available in the app. When will this be updated?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i94u3h8",
                            "author": "ElucTheG33K",
                            "score": 1,
                            "created_utc": 1652914595.0,
                            "response": "The card has a LNURLw on it, which allow to pull money out of the wallet (within defined limit, min/max amount, min interval between pull, max number or use,...).",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i94sn37",
                    "author": "user_name_checks_out",
                    "score": 1,
                    "created_utc": 1652913926.0,
                    "response": "Can I spend my sats without undergoing KYC?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i96e9jf",
                            "author": "bigdaddyjeff69",
                            "score": 3,
                            "created_utc": 1652946386.0,
                            "response": "No they block your account from any use after a while without KYC. Absolutely killing their business",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i96ewcr",
                                    "author": "user_name_checks_out",
                                    "score": 1,
                                    "created_utc": 1652946957.0,
                                    "response": "Fuck that.  Thanks for the info!",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i96f9bz",
                                            "author": "bigdaddyjeff69",
                                            "score": 3,
                                            "created_utc": 1652947282.0,
                                            "response": "Although just found out you can apparently use in.cash and NFC Tools to do it yourself.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i98r0wn",
                    "author": "ElucTheG33K",
                    "score": 1,
                    "created_utc": 1652989991.0,
                    "response": "Is it possible to program the cards without the CoinCorner app with our own LNURLw? Which Android app allow that?\n\nI have setup my BTCPay server with NFC support but on mobile only WebView browser show the button Pay with NFC and LNURLw at the bottom, in Firefox or Brave it shows only \"Paste LNURLw\". How do you setup the phone to work in the demo here? [https://www.youtube.com/watch?v=7SuhEPSMRoA](https://www.youtube.com/watch?v=7SuhEPSMRoA) It looks like Android Firefox, right?",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "us88bw",
            "title": "Best exchange to purchase BTC and send straight to cold storage",
            "url": "https://www.reddit.com/r/Bitcoin/comments/us88bw/best_exchange_to_purchase_btc_and_send_straight/",
            "author": "TuberTrends",
            "created_utc": 1652862903.0,
            "score": 2,
            "num_comments": 11,
            "subreddit": "Bitcoin",
            "selftext": "Hey all,\n\nDo you know of any exchanges that allow to purchase BTC and send it straight to cold storage using a direct debit in the UK? \n\nThanks",
            "stickied": false,
            "comments": [
                {
                    "id": "i92h7f3",
                    "author": "MrDopple68",
                    "score": 3,
                    "created_utc": 1652878891.0,
                    "response": "Gemini Active Trader.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i91x3vb",
                    "author": "WolfAmoungst_Sheep",
                    "score": 2,
                    "created_utc": 1652864885.0,
                    "response": "Coincorner.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i91ylap",
                    "author": "RastaDee",
                    "score": 2,
                    "created_utc": 1652866272.0,
                    "response": "Bisq or localbitcoins",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i92ilum",
                    "author": "pangeo63",
                    "score": 2,
                    "created_utc": 1652879591.0,
                    "response": "This may be an unpopular opinion, but Hitbtc is great for this. I think so because that's what this exchange always does",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i91wkw9",
                    "author": "kaacaSL",
                    "score": 2,
                    "created_utc": 1652864405.0,
                    "response": "You can purchase crypto straight in our Trezor Suite app! Check out how it works: https://wiki.trezor.io/Suite_manual:Buy_cryptocurrencies_in_Trezor_Suite",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i920tka",
                            "author": "Boe_Ning",
                            "score": 1,
                            "created_utc": 1652868257.0,
                            "response": "Why is native coinjoin development taking so long",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i91veuz",
                    "author": "vitalyevodin",
                    "score": 1,
                    "created_utc": 1652863285.0,
                    "response": "there’s p2p exchange [HodlHodl](https://hodlhodl.com) where you can buy bitcoin p2p and attach your own bitcoin wallet \nit means that after you complete trading contract your bitcoin will be released to your wallet",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i922lsc",
                    "author": "Serene-dippity",
                    "score": 1,
                    "created_utc": 1652869751.0,
                    "response": "I have used Pocketbitcoin - Great service, fair price, no KYC under allowed limits and simple (They only support buying  what you do afterwards s up to you)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i936n9j",
                    "author": "Luckyking223",
                    "score": 1,
                    "created_utc": 1652889999.0,
                    "response": "I‘d say it‘s Kraken",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9leo05",
                    "author": "CleanHodler",
                    "score": 1,
                    "created_utc": 1653245357.0,
                    "response": "Capital com for me, it sucks less than other exchanges",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}