{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uud3qj",
            "title": "Why Service Members Should Buy Bitcoin",
            "url": "https://bitcoinmagazine.com/culture/why-service-members-should-buy-bitcoin?utm_source=carrot&utm_medium=partner&utm_campaign=carrot_share",
            "author": "Accomplished-Row5989",
            "created_utc": 1653098100.0,
            "score": 3,
            "num_comments": 3,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9ejac8",
                    "author": "coinfeeds-bot",
                    "score": 1,
                    "created_utc": 1653098402.0,
                    "response": "tldr; Mickey Koss, a member of the U.S. military, believes that Bitcoin is a natural fit for the American service member. He argues that the military can be an incredible sacrifice at times, but it can also serve as an incredible opportunity for personal development and societal advancement. Bitcoin is your best opportunity to make one of your best opportunities even better.\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9elxys",
                    "author": "SteamCleaner23",
                    "score": 1,
                    "created_utc": 1653099815.0,
                    "response": "I’m fine with Bitcoin, but this article seems predatory.  Seems to be making promises they can’t keep to a demographic that is not traditionally good with money.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ewlk2",
                            "author": "caploves1019",
                            "score": 1,
                            "created_utc": 1653105771.0,
                            "response": "\"a demographic that is not traditionally good with money.\"\n\nSeems like a learning opportunity, does it not? Teach how to save rather than burn through all inbound money on worthless consumer goods? Live better within means by having a set aside amount of your income that is dedicated to DCA BTC seems wiser than \"grab a cardboard sign to the nearest corner for your next beer\" which is the default position society allows veterans to move to in the absence of local community services and proper education in the direction of financial stability long term.\n\nI've met with vets who feel chewed up and spit out with zero preparedness for the future. It would appear Bitcoin fixes this, yet again.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}