{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uy8sii",
            "title": "cost basis in the clouds above me",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uy8sii/cost_basis_in_the_clouds_above_me/",
            "author": "TownConscious",
            "created_utc": 1653575072.0,
            "score": 3,
            "num_comments": 1,
            "subreddit": "Bitcoin",
            "selftext": "I'm a class of 2021 inductee.  I spent 25k of my hard earned money and bought in at 58k.  I put another 10k into it at 50k.  But since then I've dca'd into it at 500 usd fiat per week.  My cost basis is around 40k, but I own about 1.1 bitcoin.  Its very frustrating to know that if I'd waited 5 months I'd be at about 2 bitcoin at least.  This doesn't at all mitigate my belief in bitcoins long term potential, I'm happy to be a part of this community despite the fact that I'm at a huge disadvantage.  Anyway yall have a great day and just know that there's people around like me, and you should be happy that you got into it at a time that's so much better than people like me! \n\np.s- I've drank a whole bottle of pino noir and this is my personal stream of consciousness at this moment, please forgive my odd writing style as I'm quite intoxicated.",
            "stickied": false,
            "comments": [
                {
                    "id": "ia2ijg8",
                    "author": "NiceDoctorBeam",
                    "score": 1,
                    "created_utc": 1653575566.0,
                    "response": "Pino Noir.  \n\nWell, then, get some Italian \"French bread\" and some really, really good Blue Cheese, aged.\n\nTear (do not cut) the bread into chunks.  Arrange pieces onto a cookie sheet.  Stuff chunks of the cheese into the nooks and crannies.  \n\nPut the sheet under your broiler.  Keep an eye.  When browned enough, pull them from the oven.  Open another bottle, wash down the 'cheese toast'.  Enjoy.  \n\nHold your Bitcoin.  When I first bought, there was an 85% drop.  I held.  It's worth it.  I promise.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uy8rza",
            "title": "Bitcoin is Insurance on a Failing Financial System with Greg Foss - A must watch episode from a must watch podcast!",
            "url": "https://youtu.be/6EcZn_cbtGI",
            "author": "NYKNYb",
            "created_utc": 1653575030.0,
            "score": 1,
            "num_comments": 1,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "ia2hdq5",
                    "author": "NYKNYb",
                    "score": 1,
                    "created_utc": 1653575077.0,
                    "response": "Hey guys!\n\nCan you put a description or a comment on a link that you post?\n\nI couldn't figure it out.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}