{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "e0osqh",
            "title": "How do crypto wallets make money?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/e0osqh/how_do_crypto_wallets_make_money/",
            "author": "ongdisha",
            "created_utc": 1574546062.0,
            "score": 17,
            "num_comments": 13,
            "subreddit": "BitcoinBeginners",
            "selftext": "I'm currently looking into BRD and Edge wallet, but I was wondering how they (the companies) generate revenue. Does anybody know?",
            "stickied": false,
            "comments": [
                {
                    "id": "f8fycl5",
                    "author": "dgoon21",
                    "score": 8,
                    "created_utc": 1574551199.0,
                    "response": "Hey here is a [short article](https://hackernoon.com/the-business-model-of-crypto-wallets-89aeed8322dc) that goes into some common business models of wallets.  I think most wallets, software, and hardware, don't really have a sustainable solid business model.  Wasabi wallet and samurai wallet charge for certain transactions and they both have had VC investments. The economic considerations are definitely second thought to most wallet creators. The crypto space seems stuck in the idea that you get the traffic first, then you get profit from that traffic type mentality that is prevalent in other software-based areas.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "f8hxrou",
                            "author": "ongdisha",
                            "score": 1,
                            "created_utc": 1574581438.0,
                            "response": "Thanks. I will check the link.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "f8frxmr",
                    "author": "snowkeld",
                    "score": 8,
                    "created_utc": 1574548581.0,
                    "response": "Most offer services through the wallet that some users will use. These services (like buy bitcoin button, or changelly) the wallet creator will get a cut.\n\nOther wallets are open source and are developed on donations, like electrum and bitcoin core.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "f8hvxta",
                            "author": "igadjeed",
                            "score": 2,
                            "created_utc": 1574580778.0,
                            "response": "> electrum\n\nAlso, Electrum has optional 2FA which has fees. A part of the 2FA fee income goes to the developer",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "f8k5fg0",
                                    "author": "snowkeld",
                                    "score": 2,
                                    "created_utc": 1574607620.0,
                                    "response": "Interesting, I did not know that",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "f8jli6p",
                            "author": "d3vrandom",
                            "score": 2,
                            "created_utc": 1574601787.0,
                            "response": "Electrum's maintainer ThomasV doesn't take donations so I think he's funding it out of pocket. Whenever people ask him about donating money he says its better to give it to the electrum server operators via the help menu in electrum. Electrum servers are run by volunteers.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "f8ftb7s",
                    "author": "DaMonk2019",
                    "score": 7,
                    "created_utc": 1574549126.0,
                    "response": "Transaction fees, different valuations on different exchanges, a % interest on your account... if you can name it, they can make money from your crypto account. Possibly even trading themselves.. like hedge funds. (With say Binance total account balance on the line, even a few dollars increase would gain them massively). But, I could be wrong lol",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "f8hw85w",
                    "author": "igadjeed",
                    "score": 4,
                    "created_utc": 1574580907.0,
                    "response": "Most free wallets are not developed by companies. Free software is developed by volunteers for free. Most developers accept donations",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "f8h0fig",
                    "author": "kryptoeny",
                    "score": 1,
                    "created_utc": 1574567756.0,
                    "response": "mainly through the fees you pay to them when you make withdrawals\n\nothers also get them through adds they show you",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "f8h7oul",
                    "author": "Paullinator",
                    "score": 1,
                    "created_utc": 1574570629.0,
                    "response": "Edge is less a wallet and more a global non custodial exchange. It let’s you buy, sell, and trade crypto in hundreds of countries with half a dozen different payment methods including credit card, ACH, SEPA, Apple Pay, Swish, and cash. We make revenue from transaction fees of the exchange operations. Not unlike the centralized exchanges but we let users fully control their funds before and after a trade.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "f8h9s19",
                    "author": "OpeningWin5",
                    "score": -1,
                    "created_utc": 1574571492.0,
                    "response": "I think wallets do gain profits through transaction fees.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "f8h4snb",
                    "author": "FluxSeer",
                    "score": 0,
                    "created_utc": 1574569482.0,
                    "response": "Prob from selling your address data. \n\nRun your own node ;)",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}