{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uz8jut",
            "title": "Bitcoin in times of war.",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uz8jut/bitcoin_in_times_of_war/",
            "author": "timaenho",
            "created_utc": 1653687642.0,
            "score": 0,
            "num_comments": 7,
            "subreddit": "Bitcoin",
            "selftext": "Question: Imagine a world where several countries adopted bitcoin and some didn't. Some of these countries are authoritarian with strong militaries. These countries decide to go into a war with the countries that adopted bitcoin. Wouldn't be the countries that are bitcoinfriendly in disadvantage? I think they would be, because the military of those countries would be smaller...",
            "stickied": false,
            "comments": [
                {
                    "id": "ia96ku8",
                    "author": "NiceDoctorBeam",
                    "score": 3,
                    "created_utc": 1653695124.0,
                    "response": "*Individuals* should buy Bitcoin, then send it to their own hardware wallets to hold, long term - whether their country's government adopts it or not.  \n\nAuthoritarian governments with bloated militaries are incompatible.  So, your \"what if\" is based upon a nonsense premise.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia8svun",
                    "author": "Nada_Lives",
                    "score": 0,
                    "created_utc": 1653688310.0,
                    "response": "The currency with the broadest economy would win.\n\nAnd Putin can go to Hell.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia8varq",
                            "author": "Kwanzika_Boy",
                            "score": 1,
                            "created_utc": 1653689479.0,
                            "response": "Ruble doing pretty good this year though...",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia981xx",
                    "author": "Spl00ky",
                    "score": 1,
                    "created_utc": 1653695892.0,
                    "response": "Countries would seek to destroy other nations crypto currency stash to boost the value of their own stash just like in James Bond Goldfinger",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia9asn0",
                    "author": "phincster",
                    "score": 1,
                    "created_utc": 1653697326.0,
                    "response": "Governments need to get their taxes somehow.  If there was a severe decrease in income tax due to people hiding in crypto, they would just ratchet up taxes some other way. \n\nIncome and wealth taxes are just two ways to tax people, they would probably just ratchet up in other places, like sales taxes or property taxes.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaejew1",
                    "author": "Simple_List_3092",
                    "score": 1,
                    "created_utc": 1653809566.0,
                    "response": ">  Imagine a world where several countries adopted bitcoin and some didn't\n\nOk.\n\n> Some of these countries are authoritarian with strong militaries. \n\nWhile using BTC?  Are you serious?  That is extremely unlikely.\n\nThe easiness of corruption and leaving the country will brain drain and destroy it.  It will not be strong at all, let alone militarily.  See Russia for example and they are still able to stop fiat transfers.\n\n> These countries decide to go into a war with the countries that adopted bitcoin.\n\nWhy?\n\n> Wouldn't be the countries that are bitcoinfriendly in disadvantage?\n\nYes.  Authoritarian governments are weak because they have no motivation to expand the production of the worker class, it doesn't increase their treasury to distribute to the key supporters.\n\nThis means they have less production and resilience compared to non-authoritarian countries.\n\nThat's a disadvantage.  It has nothing to do with BTC though.\n\n> I think they would be, because the military of those countries would be smaller.\n\nYes.  Smaller countries are disadvantaged, which is why your assumption of 'are authoritarian with strong militaries' is wrong.  \n\nBut you stated that assumption so how is the strong millitary smaller exactly?  You are contradicting yourself.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia8ux5l",
                    "author": "Accomplished-Row5989",
                    "score": -1,
                    "created_utc": 1653689291.0,
                    "response": "no bitcoin would eventually debase the currencies of the countries who weren’t using bitcoin",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}