{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uua7r4",
            "title": "IMO the bottom is in FOR NOW, you can disagree but I see a relief rally coming for the next month or so. Too many bears, such a bearish outlook from everyone its rare to find a bull right now, look at every time reserves have spiked before a buying opportunity in history to see why I think this",
            "url": "https://i.redd.it/821q2pjbqp091.png",
            "author": "TrrDemo",
            "created_utc": 1653088169.0,
            "score": 4,
            "num_comments": 7,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9e12ud",
                    "author": "HlIlM",
                    "score": 1,
                    "created_utc": 1653088841.0,
                    "response": "People have piled into cash.  A week or two ago the dollar was touching decades highs.  That money is going to go somewhere.  Right now it is into US bonds and foreign equity.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9e2mlt",
                    "author": "brohamsontheright",
                    "score": 1,
                    "created_utc": 1653089633.0,
                    "response": "You got the wrong chart up there, chief... For the first time in history, the price of Bitcoin is moving in lock-step with the S&P-500. (You guys wanted mainstream adoption.. this is what it looks like).\n\nThe Bitcoin rally starts when the price movements de-couple from the stock market and the pattern moves independently.... Until then, whatever the S&P does, Bitcoin will move in lock-step. (It behaves like 2x leveraged SPY).\n\nThis has never happened before, so all historical analysis using JUST the Bitcoin chart, supply charts, on-chain data, etc. etc. is now totally irrelevant.\n\n...... And I don't know very many experts who think the S&P is headed to the moon any time soon.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9e35mi",
                            "author": "TrrDemo",
                            "score": 1,
                            "created_utc": 1653089903.0,
                            "response": "And the dow posted 8 red weekly candles in a row, if i couldve i wouldve posted multiple images of why i believe the equities market has bottomed for now as well",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9e3wyo",
                                    "author": "brohamsontheright",
                                    "score": 1,
                                    "created_utc": 1653090294.0,
                                    "response": "If you believe we've bottomed, then I agree, it's time to push all the chips in.\n\nI think we've got a LONG way to fall, still... But for every seller there's a buyer.. so what do I know.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9e2qsn",
                    "author": "OpticallyMosache",
                    "score": 1,
                    "created_utc": 1653089693.0,
                    "response": "There is bound to be a relief rally. My concern is for the longs building up and getting liquidated before then.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9e43az",
                    "author": "muddyclunge",
                    "score": 1,
                    "created_utc": 1653090386.0,
                    "response": "Nice lines. Doesn't adhered to reality though. Right now bitcoin is tracking equities and equities are in for a bad time until inflation eases. So do you think inflation is over?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9e4aws",
                    "author": "skimmilkislife",
                    "score": 1,
                    "created_utc": 1653090496.0,
                    "response": "You realise historic graphs tell us absolutely nothing, right?",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}