{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "utdiel",
            "title": "Bitcoin is metric",
            "url": "https://www.reddit.com/r/Bitcoin/comments/utdiel/bitcoin_is_metric/",
            "author": "Beachcouple365",
            "created_utc": 1652995626.0,
            "score": 0,
            "num_comments": 23,
            "subreddit": "Bitcoin",
            "selftext": "What is a mile? Before the metric system it was considered as 8 furlongs. So what is a furlong? It was an English unit of length based on the distance a team of Oxen could pull a plough before having to rest. So it was able to be manipulated for gain. Wanted a bigger field? Get a stronger team of oxen. So ultimately those with assets were able to get stronger oxen, bigger fields, more yield and became wealthier. Sound familiar?\nThe mile became more stable when measured against km, 1.609km in mile. So what is a kilometer? It’s based on the distance between the orbital poles and the equator. So 10,000 km between the poles and the equator. It’s infinitely divisible. It’s finite, unless the world unilaterally decides to change where the equator or the poles are located…\nBitcoin is metric. It’s not replacing $’s, Euro’s or Pounds. Bitcoin is a tool to measure value and ultimately stabilizes other forms of measuring value. It’s not going to be easy, because those most threatened by it are those who’s ability to get bigger fields is at risk. \nThis is why the posts in here saying Bitcoin is not political are important. Bitcoin should not political just like a mile is no longer political. The countries and political parties who recognize this first will ultimately win. Miles, kilometers, furlongs, acres, inches all co-exist, just like Bitcoin and other currencies will one day co-exist. The only thing remotely political about Bitcoin is that we need to help politicians learn that they can’t stop it. Resistance will be like resisting the metric system, pointless and ultimately self defeating.  ",
            "stickied": false,
            "comments": [
                {
                    "id": "i992td6",
                    "author": "hairyscrotes",
                    "score": 4,
                    "created_utc": 1652995744.0,
                    "response": "Alrighty then",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i995a1g",
                    "author": "ICURaBigdeal",
                    "score": 2,
                    "created_utc": 1652996867.0,
                    "response": "Why no TLDR? Here I’ll write one.. Bitcoin is metric",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i999nij",
                    "author": "swgo1",
                    "score": 2,
                    "created_utc": 1652998885.0,
                    "response": "Don't say this. Americans will never accept the metric system.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i995z77",
                    "author": "SmoothGoing",
                    "score": 2,
                    "created_utc": 1652997182.0,
                    "response": "It appears you're saying that bitcoin is measurement of value. Of course it isn't, and the claims are unconvincing.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i99adk7",
                            "author": "solomonsatoshi",
                            "score": 0,
                            "created_utc": 1652999230.0,
                            "response": "You are demonstrably wrong to the point of borderline trolling.\n\nBitcoin determines value via completely voluntary adoption by those who choose to.\n\nFiat determines value via state compulsion upon a particular jurisdiction where fiat is imposed.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i99flie",
                                    "author": "Stunning_Novel9398",
                                    "score": 2,
                                    "created_utc": 1653001787.0,
                                    "response": "Who actually uses Bitcoin to measure anything? Any examples?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i99ge6x",
                                            "author": "solomonsatoshi",
                                            "score": 1,
                                            "created_utc": 1653002192.0,
                                            "response": "Anyone who looks up a usd/btc chart is measuring relative value.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i99gkfo",
                                                    "author": "Stunning_Novel9398",
                                                    "score": 1,
                                                    "created_utc": 1653002281.0,
                                                    "response": "That’s a hilarious example because you’re converting BTC into something that actually **is** used to measure value (USD)",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i99ifmb",
                                                            "author": "solomonsatoshi",
                                                            "score": 1,
                                                            "created_utc": 1653003223.0,
                                                            "response": "Yes USD is the established primary global reserve currency while Bitcoin is an emerging currency. Most currencies are still compared to the USD due to its current dominance. Are you saying other currencies are not used to measure value? Hilarious indeed!",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i99juio",
                                                                    "author": "Stunning_Novel9398",
                                                                    "score": 1,
                                                                    "created_utc": 1653003937.0,
                                                                    "response": "Quite the leap in logic there mate. \n\nUSD/BTC is used to value BTC, no one is checking that to value their USD 😂. Just because I can look up the value of a tulip in USD doesn’t mean I’ll measure the value of a house in tulips. \n\nOther currencies are indeed used to measure value of things locally. \n\nStill waiting on a practical example of something that is valued using BTC…",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i99kjyc",
                                                                            "author": "solomonsatoshi",
                                                                            "score": 1,
                                                                            "created_utc": 1653004299.0,
                                                                            "response": "Fiat currencies still dominate MoE therefore for nearly all people understanding value of Bitcoin is most easily conferred by converting to fiat. The domination of the daily use of fiat for MoE is sustained via the state backed coercion that fiat relies upon and this will take time to change but over time as Bitcoin grows in value and stabilises relative to goods and services direct and intuitive understanding of its value relative to MoE transactions will naturally increase too.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i99ogbm",
                                                                                    "author": "Stunning_Novel9398",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653006294.0,
                                                                                    "response": "Right, so in summary:\n\nBTC is not currently used to measure anything.\n\nIn the future if BTC somehow stabilized it could be.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i99u6hl",
                                                                                            "author": "solomonsatoshi",
                                                                                            "score": 0,
                                                                                            "created_utc": 1653009161.0,
                                                                                            "response": "No so in summary Bitcoin is just as much a measure of value as any other currency which is valued relative to the dominant currency the USD.\n\nIn the future Bitcoin will very likely be the dominant currency because of its superior qualities and integrity...ie BTC Sov integrity is built into the algorithm and cannot be messed with by corrupt bankers and politicians.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i999622",
                    "author": "solomonsatoshi",
                    "score": 0,
                    "created_utc": 1652998659.0,
                    "response": "Great analogy and largely agree, however the fiat monetary system is inherently political and so Bitcoin does as you acknowledge, challenge those with the overly large 'fields'- the bankers and buffets who own the politicians and who own us via fiat debt slavery.\n\nThe decoupling of monetary powers from political powers will be as epic though hopefully more swift as the separation of state from religion was and continues to be - it is inevitable because monetary integrity ultimately fosters greater wealth and prosperity as does religious freedom and the secular state.\n\nThe age of reason resulted in Western domination over the planet-\n\nThe age of the algorithm will have equally if not even more substantial effects.\n\nIt is unavoidable that those who adopt will prosper while those who resist will decline if not perish.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i99fhgk",
                    "author": "Stunning_Novel9398",
                    "score": 1,
                    "created_utc": 1653001729.0,
                    "response": "Hmmmm ok… any actual historic examples of people manipulating the length of a mile for gain?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i99gpni",
                    "author": "anax4096",
                    "score": 1,
                    "created_utc": 1653002353.0,
                    "response": "> So it was able to be manipulated for gain. Wanted a bigger field? Get a stronger team of oxen. \n\nPeople in the past weren't morons. They used measuring wheels, not actual animals, to measure things. Just because the base unit sounds quaint or archaic does not mean it was inaccurate.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i99jt83",
                    "author": "Ralph_Naders_Ghost",
                    "score": 1,
                    "created_utc": 1653003919.0,
                    "response": "24 hours in a day, ~24,000 mile earth circumference. \n\n1000 mph at the equator. \n\ncosine of latitude for anything else. \n\nJust coincidence.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i994bm9",
                    "author": "gooner-1969",
                    "score": 0,
                    "created_utc": 1652996435.0,
                    "response": "Keep taking the meds",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i99a0ig",
                            "author": "solomonsatoshi",
                            "score": 0,
                            "created_utc": 1652999057.0,
                            "response": "You appear to be the one in denial of reality. Stop taking the meds and deal with it.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "utdemn",
            "title": "Buttcoin page is the most sincere form of flattery and echo-guided denial all wrapped into one",
            "url": "https://www.reddit.com/r/Bitcoin/comments/utdemn/buttcoin_page_is_the_most_sincere_form_of/",
            "author": "JerryLeeDog",
            "created_utc": 1652995329.0,
            "score": 120,
            "num_comments": 92,
            "subreddit": "Bitcoin",
            "selftext": "Imagine an asset that has performed so well that there is literally a denial page of dedicated non-investors to discuss all of their non-investments. \n\nI'm curious what other assets have done well enough that they have active pages of people who waste their time to discuss NOT investing into it? Anything?\n\nIs it the psychological damage that takes place knowing you could have put a few dollsrs into something when the page was started and have been retired many times over by now? \n\nI found BTC to be exciting, but having a page like that speaks to its insane reach and affect on people's daily lives who both invest, or choose to reject it to the point that you need everyone to know your about your rejection and theories. Severe insecurities, denial, misinformation and outdated comments or not, Buttcoin is a part of BTCs continued publicity  whether you like it or not. In my eyes, we should be thankful for their heavy lifting in a way",
            "stickied": false,
            "comments": [
                {
                    "id": "i993cab",
                    "author": "GLCstaked",
                    "score": 106,
                    "created_utc": 1652995985.0,
                    "response": "Yes, I've followed for years, I find it fascinating, it's so obvious that at the core is bitterness of having missed out in some way. Bitcoin and crypto are voluntary networks, you choose to participate and if not just ignore it.\n\nI've never liked football, I kind of hate it. I cant imagine joining a community of other football haters to talk daily, comment, and make content. In order to keep up I have to watch football matches, keep up to date with the scores, read the latest football news. And talk about it with my fellow football haters, all the while believing (wishing) that world will wake up and realize how stupid football is and it will eventually go away to zero.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i993i8a",
                            "author": "JerryLeeDog",
                            "score": 27,
                            "created_utc": 1652996062.0,
                            "response": "Lol spot on, such a good analogy",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9cgup3",
                                    "author": "Spartacus_Nakamoto",
                                    "score": 1,
                                    "created_utc": 1653063551.0,
                                    "response": "It would appear we’ve struck a nerve.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9aist3",
                            "author": "HurricaneHarvey7",
                            "score": 18,
                            "created_utc": 1653022398.0,
                            "response": "Basically this sums it up:\n\n* 2010: Lol what a stupid technology, it'll never take off. I'm not buying any of that crap.\n* 2020: Bitcoin is a ponzi and only people who got in first are benefiting.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9akg5o",
                                    "author": "Ne710",
                                    "score": 15,
                                    "created_utc": 1653023529.0,
                                    "response": "2030: Only people who got in before 2025 are benefitting.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9bhpny",
                                            "author": "Ofiller",
                                            "score": 8,
                                            "created_utc": 1653048542.0,
                                            "response": "2035: only people who got in before 2030 are benefitting.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9chteu",
                                                    "author": "Spartacus_Nakamoto",
                                                    "score": 1,
                                                    "created_utc": 1653063927.0,
                                                    "response": "2036: “In direct support of our plebs, for the welfare of our children and to finally stamp out crime, thought-crime and pre-thought-crime, this administration is launching a new dick of the law know as Buttcoin.”",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9b2drd",
                            "author": "Moderately_Opposed",
                            "score": 4,
                            "created_utc": 1653038181.0,
                            "response": "I check them whenever we're at ATHs or major crashes. It's a never-ending cycle of jealousy and schadenfreude...10+ years lol",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9ajsj7",
                            "author": "TheChoosey1",
                            "score": 1,
                            "created_utc": 1653023072.0,
                            "response": "I had a roommate that watched a show specifically because he hated the host. It had a very strong \"fuck you bitch\" vibe.\n\nHate is a common pastime.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9bp7lz",
                            "author": "Hobokusha",
                            "score": 1,
                            "created_utc": 1653052226.0,
                            "response": "All that to say you don't like something so everyone else should not like it🤦‍♂️",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9c7vkq",
                            "author": "neckos",
                            "score": 1,
                            "created_utc": 1653060010.0,
                            "response": "Never doubt the bored or underemployed to dedicate their time to pointless pursuits.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9955q4",
                    "author": "llewsor",
                    "score": 33,
                    "created_utc": 1652996813.0,
                    "response": "it used to only be about bitcoin but since bitcoin refuses to die much to their dismay - they rant about shitcoins and nfts because they’re running out things to talk about.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9bxlxx",
                            "author": "volvostupidshit",
                            "score": 1,
                            "created_utc": 1653055870.0,
                            "response": "Someone should offer to make them a token reward system like r/cc Moons. I'd like to see their reaction.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9929rq",
                    "author": "swgo1",
                    "score": 25,
                    "created_utc": 1652995493.0,
                    "response": "I'm in there. It's fun to play with them.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i99lms4",
                    "author": "soggypoopsock",
                    "score": 15,
                    "created_utc": 1653004855.0,
                    "response": "I’ve been checking in on them every once in a while for years now. It’s a predictable pattern that repeats with every cycle, ending with a “told you so” at a price level far above anything they had ever imagined the last time around \n\nas time goes on I start to feel bad for them- imagine marrying a bear position on a technology that you have sworn off and loudly ridiculed, you watch it go up so much that if you had put even a small % of your portfolio in it, you would have outpaced all your other investments. So you’re bitter and angry and want it to die. It pulls back, you celebrate, only to watch it do it again.\n\nSome of them, it’s been 3 cycles. Imagine this sequence happening 3 times, how bitter and angry you would be. You could have just put 1% of the portfolio in...but here you are. You may deep down want to give up and just buy some, but it hurts too much buying it thousands of % higher than you could have if you had just swallowed your pride and thought “maybe it’s not impossible”",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9aosj0",
                            "author": "bittabet",
                            "score": 5,
                            "created_utc": 1653026674.0,
                            "response": "Yep and now they still post idiotic posts about how they’re sure Bitcoin will totally soon crash like the ponzi shitcoins. Completely ignoring that it’s still at $30K and like 3000X the price when they started mocking it 😂\n\nI remember for years and years they kept posting ridiculous shit like how nobody ever actually cashed out on any exchange anywhere because they were convinced there was no liquidity at all. Just unbelievably idiotic stuff equivalent to internet flat earther levels of idiocy.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9aj8rt",
                            "author": "HurricaneHarvey7",
                            "score": 3,
                            "created_utc": 1653022701.0,
                            "response": "Personally I can't wait to see posts there when Bitcoin surpasses $100k",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9atsx5",
                                    "author": "5liveR",
                                    "score": 1,
                                    "created_utc": 1653030656.0,
                                    "response": "I'd think that some of them have rushed in to some shitcoin along the way, as they think they are smart and their arrogance could make them fall for \" the next Bitcoin\". But then, like the story always goes, the shitcoin crashes... they will tell to no one of course, out of shame, especially not to their buttcoin buddies.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i993q06",
                    "author": "saintkamus",
                    "score": 8,
                    "created_utc": 1652996159.0,
                    "response": "Speaking of \"non investors\" that talk a lot about Bitcoin... You should drop by on the arstechinca comment section on any Bitcoin related threads... \nThere's a lot of \"concerned\" people over there regarding Bitcoin, and how it's killing the planet, and how it ate their baby.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i995h6q",
                            "author": "Gunzenator",
                            "score": 6,
                            "created_utc": 1652996958.0,
                            "response": "I heard about that. You can’t leave Antminers around kids unsupervised.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i99qihb",
                                    "author": "IFThenElse42",
                                    "score": 3,
                                    "created_utc": 1653007340.0,
                                    "response": "I'm 4 years old and Antminers endangered me 10 times already",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i99qm3b",
                                            "author": "Gunzenator",
                                            "score": 3,
                                            "created_utc": 1653007390.0,
                                            "response": "You’re lucky to be alive.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i99zm6f",
                                    "author": "noipv4",
                                    "score": 1,
                                    "created_utc": 1653011800.0,
                                    "response": "The antminer fans are baby grinders",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i994ssi",
                    "author": "Roberthergas",
                    "score": 11,
                    "created_utc": 1652996651.0,
                    "response": "Crypto bros can be annoying and there are parts of the crypto space that definitely annoy me too.. but I can’t imagine joining a community to discuss my non belief and annoyance with it. I’d imagine they probably invested in something at the wrong time or got scammed and hate it because of that.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i994jdp",
                    "author": "Msim300",
                    "score": 4,
                    "created_utc": 1652996533.0,
                    "response": "New asset classes always have the purists and the deniers. We haven't had the mix between a get rich quick scheme and true technology innovation since the 90s.  I was highly skeptical until I wasn't.  Saylor's thesis pushed me off the fence, but I can see he gets carried away sometimes. Reading the crazy for and against arguments helps you find the truth somewhere in the middle. In a way it is strangely educational like reading the awful reddit political posts.  As long as you can think for yourself reddit can be beneficial.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i99gndp",
                    "author": "dreiberg3",
                    "score": 4,
                    "created_utc": 1653002321.0,
                    "response": "I don’t understand that sub. There are a lot of good arguments that can be made against crypto, but I’ve never seen any of them in the buttcoin sub.\n\nI sort of think it’s just filled with former crypto investors who have been burned by rug pulls and now have a really negative view of crypto in general.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9blu14",
                            "author": "AussieCryptoCurrency",
                            "score": 1,
                            "created_utc": 1653050622.0,
                            "response": ">I sort of think it’s just filled with former crypto investors who have been burned by rug pulls and now have a really negative view of crypto in general\n\nThat's actually a lot given the last week",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i99d1td",
                    "author": "descartablet",
                    "score": 17,
                    "created_utc": 1653000520.0,
                    "response": "well, I go there daily to have my dose of skepticism.  You are not going to read bad news in /r/bitcoin",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i99ft6o",
                            "author": "Bar98704",
                            "score": 9,
                            "created_utc": 1653001895.0,
                            "response": "Like it or not they make good points. Bitcoin is only worth what someone else is willing to pay for it. Sure enough, it can't be debased but but that doesn't mean the value denominated in your local currency is going to hold. As long as things are priced in a currency other than bitcoin then that's an issue",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9ahq3x",
                                    "author": "rartedw",
                                    "score": 3,
                                    "created_utc": 1653021695.0,
                                    "response": "Pretty much everything is based on shared myths not just things that have \"value\"",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9bg3vm",
                                            "author": "descartablet",
                                            "score": 3,
                                            "created_utc": 1653047694.0,
                                            "response": "that Sapiens book made me re-evaluate lots of things",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9chefq",
                                                    "author": "Dont_Say_No_to_Panda",
                                                    "score": 1,
                                                    "created_utc": 1653063763.0,
                                                    "response": "Which one?",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i99qd8k",
                                    "author": "IFThenElse42",
                                    "score": 11,
                                    "created_utc": 1653007265.0,
                                    "response": "I mean that argument is valid for absolutely everything in the market.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9a601x",
                                            "author": "avocadoes-on-toast",
                                            "score": 3,
                                            "created_utc": 1653014977.0,
                                            "response": "Not really. If everyone suddenly didn’t care for gold and oil then I’d be balling in a gold-plated mansion with dirt cheap gas. But if people stop buying bitcoin i’ll have find a job instead of being on reddit.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9a8yec",
                                                    "author": "Previous-Pea6642",
                                                    "score": 7,
                                                    "created_utc": 1653016530.0,
                                                    "response": "That's just because you own Bitcoin. If your wealth was in gold and oil, you'd also have to find a job if everyone stopped valuing it lol",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9agyis",
                                                            "author": "avocadoes-on-toast",
                                                            "score": 4,
                                                            "created_utc": 1653021206.0,
                                                            "response": "But my point is that gold and oil have a worth that is independent of speculation. If gold crashes to pennies, ill buy it cause it’s pretty. I’ll buy cheap oil cause my car needs gas. I’ll buy cheap bitcoin to… only to sell it to someone else later for a profit.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9ai1kb",
                                                                    "author": "Previous-Pea6642",
                                                                    "score": 3,
                                                                    "created_utc": 1653021900.0,
                                                                    "response": "I very much think Bitcoin is beautiful, so it'll have value for me forever in that same sense. But the real value of course comes from its utility. This is where the analogy actually breaks down, because for oil to become worthless, we would have to assume that anything oil-based falls into disuse as well. So cars and traffic infrastructure wouldn't be a given anymore, and your car would be useless essentially by definition of the worthlessness of oil.\n\nI think the comparison here is quite shaky and doesn't hold up well. In order for anything to lose its value like that, it has to lose its utility. That's one of the reasons I'm personally so confident in Bitcoin to begin with.\n\nEdit: Another scenario where the price of gold and oil plummets is of course extreme supply inflation. Oxygen is free, but still extremely valuable. But this scenario of course can't apply to Bitcoin due to the strictly limited supply.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9bm02i",
                                                                            "author": "AussieCryptoCurrency",
                                                                            "score": 1,
                                                                            "created_utc": 1653050705.0,
                                                                            "response": ">But the real value of course comes from its utility.\n\nSo let's say I own all the Bitcoin. Would you buy it? Nope.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i9cahdy",
                                                                                    "author": "Previous-Pea6642",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653061039.0,
                                                                                    "response": "Not necessarily correct, and equally useless hypothetical. Go out and *actually* acquire all the Bitcoin and then we can talk.\n\nEdit: Bitcoin's utility is obviously affected by someone taking all of it, which is why another reason this adds nothing to the conversation.",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "i9avfd1",
                                                                    "author": "5liveR",
                                                                    "score": 1,
                                                                    "created_utc": 1653032067.0,
                                                                    "response": "some of the main utilities of Bitcoin are:\n\n• magnificent store of value (if you hold long enough),\n• the permissionless transfer of value (in a world that is moving towards capital controls),\n• means of payment that is cheap and faster than payment providers (lightning),\n• the privacy of cash (if you coinjoin, avoid kyc) combined with the frictionless and speed of digital,\n• no counterparty risk (decentralized, since 13y),\n• transparency of its network nature of transactions (chain analysis)\n• open source\n• limited supply backed into the code, cheap to verify (node)\n• the best way ever to move all your funds, by only memorizing 12 words in a particular order, without being physically exposed to all sorts of risks: confiscation, robbery, loss or criminal prosecution.\n\nThere are multiple more, but will depend on your own situation to value them. This has never existed before and its still unique (no altcoin can replicate). The implications for this are gigantic and the potential growth, well, I'll leave it up to you.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9axgvo",
                                                                            "author": "avocadoes-on-toast",
                                                                            "score": 4,
                                                                            "created_utc": 1653033899.0,
                                                                            "response": "But these are all benefits of the bitcoin network, as opposed to bitcoin as a currency (ie, the coins themselves). The network would still have all of these characteristics, except maybe store of value, if bitcoin dropped to $1. In fact it’s had all these characteristics since btc was $1. And now it’s $30,000. Which suggests that price action and thus its valuation is based mostly on speculation. \n\nIll refine my argument; bitcoin as a network and a technological experiment is invaluable, but bitcoin’s worth as a currency is only backed by speculation.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i99tiu3",
                                            "author": "Bar98704",
                                            "score": 5,
                                            "created_utc": 1653008834.0,
                                            "response": "Yeah but bitcoin is supposed to be a currency and other things aren't. Bitcoin would work in its only little bitcoin universe but we live in the real world. Even in El Salvadore, the prices are in USD, not Bitcoin",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i99zhpo",
                                                    "author": "noipv4",
                                                    "score": 2,
                                                    "created_utc": 1653011739.0,
                                                    "response": "I see it as Energy coin and remove the USD relationship in my mind.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9aq38b",
                                    "author": "ElephantsAreHeavy",
                                    "score": 1,
                                    "created_utc": 1653027658.0,
                                    "response": "Many tech stocks are so overvalued compared to their underlying assets that they are essentially speculative assets.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9a38tb",
                            "author": "Bisquick_in_da_MGM",
                            "score": 1,
                            "created_utc": 1653013594.0,
                            "response": "I do the same. I do like it when something that I don’t own blows up. It’s like Christmas has come early.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9984wi",
                    "author": "Keith_Kong",
                    "score": 7,
                    "created_utc": 1652998173.0,
                    "response": "It's a response to the downward volatility which targets the newest investors primarily. Individuals invest into Bitcoin without really understanding the \"why\" and then sell out with massive losses. That, or they see stories of others who make this terrible blind action mistake.\n\nOnce the notion of Bitcoin being a ponzi enters your mind it starts to feel \"evil\" and this is what drives Buttcoiners intense hatred and mockery–not bitterness or insecurity.\n\nBitcoin is one of the few things open to retail investment from the very beginning. It has had real problems which needed (and still need) to be solved. Most people simply cannot imagine a future state of Bitcoin. It's all about what it *IS* right now (more precisely, what is *WAS* when they first made this instant judgement).\n\nYou can't really expect the average person to understand the development of early technology, especially when the price fluctuates based on emotional sentiment changes around the development of that technology.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9c1mvd",
                    "author": "stunt_junk",
                    "score": 3,
                    "created_utc": 1653057514.0,
                    "response": "Unpopular opinion: buttcoin had value. When I browsed it I was forced to evaluate all of those perceived weaknesses in bitcoin. Early on I used buttcoin to identify the questions I hadn't asked, and then went out to see if those apparent weaknesses in BTC could materialize into a failure of some type. Eventually I wasn't seeing any new things that I felt I needed to look into so I basically stopped going.\n\nI still go back periodically to see if there is any valuable discourse but it's become an echo chamber and I'd be really surprised to find much value there these days.\n\nIf you want to get all of the value of (early) buttcoin with all the snark, angst and an actual discussion, check out Bitcoin Uncensored. Its not for everyone, and its pretty likely to offend more than a few people, but being able to speak at a technical level and address socially relevant themes makes it a far more valuable resource than buttcoin.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ci6ad",
                            "author": "Dont_Say_No_to_Panda",
                            "score": 1,
                            "created_utc": 1653064067.0,
                            "response": "My biggest preoccupation right now is contemplating how I’m Bitcoin future, a truly deflationary asset that acts as the global store of value and medium of exchange, and unit of account will still encourage investment and innovation.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i99dgvf",
                    "author": "Rtbrosk",
                    "score": 2,
                    "created_utc": 1653000723.0,
                    "response": "i got banned from that subreddit......i guess they don't like me",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i99fu16",
                    "author": "voltsmeter",
                    "score": 2,
                    "created_utc": 1653001907.0,
                    "response": "I bet most r/economy members are part of that sub too.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i99z39g",
                    "author": "recessiontime",
                    "score": 2,
                    "created_utc": 1653011543.0,
                    "response": "I'm banned there too. It's true that the vast majority of content there now is non-Bitcoin and after calling them out on this they just said they reserve the right to criticize altcoins. I asked them whether their lack of critique on BTC lately means they have accepted it but they told me no they still believe it is a scam too, just that new crazes like NFTs are more attractive to talk about. It boggles my mind how these people knew about BTC for many years, seen it all play out and still refuse to accept it. A few of them admitted to owning btc at one time and selling for a good fiat profit but will not acknowledge BTC as a possible alternative to the fiat monetary system. I wonder whether there is a dollar equivalent BTC could reach to make a person there admit they were wrong or at least trigger some self-reflection on their part. For me, I heard about BTC when it was $1.00 assumed it was a scam. I started investigating it for the first time  it hit $600 to understand why anyone would pay that sum of money to purchase it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9aul4h",
                    "author": "sgtslaughterTV",
                    "score": 2,
                    "created_utc": 1653031330.0,
                    "response": ">Is it the psychological damage that takes place knowing you could have put a few dollsrs into something when the page was started and have been retired many times over by now?              \n\nI've seen altcoiners boast \"how much money\" they made off of alts that I won't name here. The thing is I look at those alts and occasionally I'll notice that they got to the top ten and I'll have a moment that's like, \"I remember I had a chance to buy it when I saw it in the top 90 spot. I didn't want to buy it then. I don't want to buy it now. Nothing changed.\"              \n\nI am of the persuasion that the crowd in buttcoin is of a similar thought process.               \n\nI think I could sit down and have a civil conversation with anyone from /r/buttcoin, to tell the truth. The only thing that really separates my thought processes from theirs is that we are all of the belief that investments need to be in good places, and I think bitcoin is a good place so long as you are holding long term and understand safe storage practices.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i99axqh",
                    "author": "LordPrettyMax",
                    "score": 5,
                    "created_utc": 1652999502.0,
                    "response": "I got permanently banned for saying Bitcoin is the best performing asset of all time and then when I messaged the mod asking what I said was wrong and if he can refute he told me to fuck off lmao but apparently Bitcoin is the cult",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i992fxf",
                    "author": "caploves1019",
                    "score": 7,
                    "created_utc": 1652995572.0,
                    "response": "The antiwork sub is filled with similar lifelong paycheck to paycheck flunkies with a short time preference and distain for human existence as well. Just as entertaining to watch them dismantle every reason to be a benefit to their friends, family, and neighbors while arguing they should be paid just for breathing air....",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i993dk7",
                            "author": "JerryLeeDog",
                            "score": 8,
                            "created_utc": 1652996002.0,
                            "response": "Pretty good anology, I follow that page too. I actually agreed with some of the stuff, then other stuff I read and made me think; dude you just described a normal job, what do you expect. \n\nIt's like I didn't go to work for 3 days and got fired, can you believe that?! Only 3 days",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i993t9s",
                                    "author": "Slapshot382",
                                    "score": 3,
                                    "created_utc": 1652996201.0,
                                    "response": "Same just like anything there are good points to be taken from the AntiWork sub. But the majority probably are 25 and under and don’t fully understand global dynamics and economy, needing to work so that we can all have nice things, etc. \n\nSome things I am all for in the AntiWork sub though, mainly not taking shit from my employer/learning where to draw the line in the sand and not being used.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i99u9iy",
                                            "author": "Ernest-Everhard42",
                                            "score": 3,
                                            "created_utc": 1653009202.0,
                                            "response": "Antiwork is awesome yes!",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i99f675",
                            "author": "stereoagnostic",
                            "score": 1,
                            "created_utc": 1653001569.0,
                            "response": "This is a savage burn. Well played.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9a5niy",
                            "author": "ukrainianhater",
                            "score": 1,
                            "created_utc": 1653014801.0,
                            "response": "the temporarily embarrassed millionaire has spoken",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i999hom",
                    "author": "Zixxer",
                    "score": 4,
                    "created_utc": 1652998812.0,
                    "response": "Much of buttcoins problem I believe is stemmed from their inability to disassociate Bitcoin with other cryptocurrencies.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i99qlsq",
                            "author": "IFThenElse42",
                            "score": 3,
                            "created_utc": 1653007386.0,
                            "response": "Nor do they can disassociate BTC with BTCUSD.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i99qpq3",
                                    "author": "Zixxer",
                                    "score": 1,
                                    "created_utc": 1653007442.0,
                                    "response": "Facts!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9a64v1",
                    "author": "Phil_Drill",
                    "score": 4,
                    "created_utc": 1653015044.0,
                    "response": "Your echo chamber vs theirs",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i99ozf4",
                    "author": "Significant_Cut_5812",
                    "score": 2,
                    "created_utc": 1653006566.0,
                    "response": "I wish people would stop posting about that sub all the time",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i99ex3b",
                    "author": "who-evun_karezz",
                    "score": 1,
                    "created_utc": 1653001444.0,
                    "response": "I just went and checked it out for the first time in a while and what a bunch of sad pathetic losers. The way they rationalize what they’re doing….\n\nLike get a life you fucking virgins. ItS dOwN 50% iN 6 mOnThs. So what, its up 150% in the last 2 years retards. They have wayyyy too much time on their hands clearly.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i99qt87",
                            "author": "IFThenElse42",
                            "score": 3,
                            "created_utc": 1653007490.0,
                            "response": "Nasdaq also took a hit. And bitcoin went 10x in a few years... Yeah, just like nasdaq and the USD money supply. As an edge against inflation it did it work and so are most stocks actually",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i99tedj",
                    "author": "firelizard77",
                    "score": 0,
                    "created_utc": 1653008775.0,
                    "response": "they're like flat earthers. probably somewhere there's people who get together to discuss how the internet is obviously a scam because they don't understand what it is",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i997hoi",
                    "author": "CMDR_Nightshady",
                    "score": 1,
                    "created_utc": 1652997877.0,
                    "response": "I’m banned from Buttcoin lol",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i99auj1",
                            "author": "JerryLeeDog",
                            "score": 2,
                            "created_utc": 1652999458.0,
                            "response": "It's not hard. They ban anyone who threatens their viewpoints and opinions",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i99e7yk",
                                    "author": "hoenndex",
                                    "score": 12,
                                    "created_utc": 1653001099.0,
                                    "response": "Just like this page",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i99e9ue",
                    "author": "acegarrettjuan",
                    "score": 1,
                    "created_utc": 1653001126.0,
                    "response": "I wanted to post about this too. I started getting suggestions like I would want to join this sub. At first I thought it was some kind of parody, but then I realized there are people who hate bitcoin so much they joined a sub just to talk about how much they hate it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i99k371",
                    "author": "Silly_Objective_5186",
                    "score": 1,
                    "created_utc": 1653004061.0,
                    "response": "there’s good anti-shitcoin content on that sub.  not sophisticated enough for the most part to criticize bitcoin in a meaningful way though.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i99ov5h",
                    "author": "quixoticquiltmaker",
                    "score": 1,
                    "created_utc": 1653006504.0,
                    "response": "It was the perfect time 😀",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i99q4lp",
                    "author": "IFThenElse42",
                    "score": 1,
                    "created_utc": 1653007145.0,
                    "response": "I would pay to see someone compiling arguments that makes them panick and not respond.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i99t0oy",
                    "author": "blahblaaahblaaaaah",
                    "score": 1,
                    "created_utc": 1653008593.0,
                    "response": "i fucking hate those guys, not that i can't understand the bitterness of having missed such a crazy investment, or how you can be biased when you don't understand something, or even their skepticism which is valid on some levels\n\nbut they just stink of sheer frustration, bitterness and ill will",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ahslj",
                    "author": "rartedw",
                    "score": 1,
                    "created_utc": 1653021739.0,
                    "response": "I just wanna thank them for the mos entertaining sub of all time unfortunately they have banned me tho",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ap8qo",
                    "author": "Matilozano96",
                    "score": 1,
                    "created_utc": 1653027013.0,
                    "response": "Tesla, Apple, Facebook, Google, maybe? Pretty much any company that has/had a billionaire to hate as their face.\n\nLots of big tech detractors REALLY want for it to fail and prove it’s a bubble.\n\nThey fail to acknowledge that online services got so big because they’re WAY more scalable than traditional industries; which is why their reach and relevance is so huge.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9apb3x",
                    "author": "kspsksps",
                    "score": 1,
                    "created_utc": 1653027063.0,
                    "response": "What if I told you that the founder was one of my professors on degree?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9askrq",
                    "author": "PikaBanee",
                    "score": 1,
                    "created_utc": 1653029638.0,
                    "response": "It honestly just makes me bullish AF seeing all that. Not everyone understood the internet at first and many mocked it. I really think that sub is going to age like fine milk!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9aux9x",
                    "author": "sQtWLgK",
                    "score": 1,
                    "created_utc": 1653031630.0,
                    "response": "Consistently wrong. Since 2011.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9b126v",
                    "author": "JSammut29",
                    "score": 1,
                    "created_utc": 1653037145.0,
                    "response": "Buttcoin should be the next shitcoin no cap.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9b381d",
                    "author": "Think_Cat7703",
                    "score": 1,
                    "created_utc": 1653038836.0,
                    "response": "I've noticed a few things as I lurk there occasionally, attempting to find fair and reasonable counter arguments to my pro-bitcoin stance. \n\n1. The community is founded on 'anti' reasoning, but rarely makes suggestions on alternatives. I guess they assume no alternative is required? To be fundamentally negative without providing a better suggestion to the problem faced in the fiat system just seems fuckin flat to me. Like if all you can do is sit around being negative, I don't know how far you're gonna get in life.\n2. Lately, most of their vitriol and disdain for Bitcoin has diverged broadly into crypto, especially ponzis like luna. I feel like sometimes they willing conflate the two, which is odd for a group of people who purport to know enough about the subject to have a firm negative conviction about it. Seems a bit strawman to me. Regardless, I'm not a big fan of their 'told you so' schadenfreude approach to people who've lost a lot of their stored value, no matter how stupid or irresponsible they were.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9b41ns",
                    "author": "snazzles97",
                    "score": 1,
                    "created_utc": 1653039469.0,
                    "response": "The only other asset that I know of that has a dedicated hate page is Gamestop",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9bbm7k",
                    "author": "iamthereal_jb",
                    "score": 1,
                    "created_utc": 1653045099.0,
                    "response": "They are just sad they didn't get in before 2021",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9blg3j",
                    "author": "AussieCryptoCurrency",
                    "score": 1,
                    "created_utc": 1653050435.0,
                    "response": "I've been around for 11 years in Bitcoin. I've seen the same things happen again and again. There has been marginal change in so many areas. \n\nLet's get this out of the way.\n\n\\- At some stage Bitcoin will probably go to $100k. \n\n\\- No I do not think BTC will ever die.\n\nI'm not upset if you guys make money. But let's stop saying BTC solves the problems of the financial system and call it what it is- a speculative investment.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i99b15i",
                    "author": "ReedoIncognito",
                    "score": 0,
                    "created_utc": 1652999547.0,
                    "response": "I love it so much there",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "utdgkf",
            "title": "Throwback: Banksters Paradise (A Bitcoin Song)",
            "url": "https://www.youtube.com/watch?v=6ZKzapbQPZA",
            "author": "FluxSeer",
            "created_utc": 1652995482.0,
            "score": 13,
            "num_comments": 1,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9cngtp",
                    "author": "Verallendingen",
                    "score": 1,
                    "created_utc": 1653066140.0,
                    "response": "hell yeah i'm pumped! good weekend lads!",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}