{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uw4dx0",
            "title": "Computer scientist: blockchain has lot's of potential uses, but the first and best is digital currencies like bitcoin.",
            "url": "https://www.youtube.com/watch?v=2z3g-ZCaWF0",
            "author": "tmf1988",
            "created_utc": 1653323898.0,
            "score": 3,
            "num_comments": 5,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9pspwr",
                    "author": "DesignerAccount",
                    "score": 1,
                    "created_utc": 1653332353.0,
                    "response": "Lol No, it doesn't. Blockchain tech is useless unless used for digital scarcity in the form of money. Which is what Bitcoin is.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9pn3vs",
                    "author": "pink_raya",
                    "score": 2,
                    "created_utc": 1653329939.0,
                    "response": "lol\n\nwhat is second and second best then?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9pthbz",
                    "author": "bitusher",
                    "score": 1,
                    "created_utc": 1653332674.0,
                    "response": "Blockchains have very narrow use cases.The only reason Blocks within a Blockchain exist is specifically because the Poisson process used in proof of work. There is no need to batch together transactions in blocks without this as doing so merely adds latency which is completely unnecessary as one can merely cryptographically link together a chain of transactions if one wanted to . This is also the reason many other projects that do not use proof or work are pivoting away from using the term Blockchain and using the term DLT instead.\n\nSome people promote \"Block Chains\" as this transformative technology that will magically improve everything in society which is completely misleading. Block chains , with or without proof or work , are extremely inefficient \"databases\" by design. **This inefficiency is a specific tradeoff to pay for censorship resistance.** Therefore if something does not need censorship resistance than it most likely has no need for a blockchain.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9pu8nc",
                    "author": "vmalarcon",
                    "score": 1,
                    "created_utc": 1653333004.0,
                    "response": "Reminds me of roman arches. Five stones that create an structure so solid to withstand great loads. You take any stone out and the whole thing is useless.\nHere again, Bitcoin is a combination of things. Blockchain being only one stone.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}