{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "urt49y",
            "title": "COTPS SCAM",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/urt49y/cotps_scam/",
            "author": "Tall-Natural-4897",
            "created_utc": 1652812617.0,
            "score": 1,
            "num_comments": 1,
            "subreddit": "BitcoinBeginners",
            "selftext": "EVERYBODY HAS OUT MONEY INTO COTPS.COM HAS BEEN SCAMMED DO NOT DEPOSIT MORE MONEY.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8z7qb3",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1652812617.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ursvoz",
            "title": "Is there anyway to purchase Bitcoin truly anonymously?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/ursvoz/is_there_anyway_to_purchase_bitcoin_truly/",
            "author": "Pots454",
            "created_utc": 1652811960.0,
            "score": 3,
            "num_comments": 19,
            "subreddit": "BitcoinBeginners",
            "selftext": "Noob still picking it up. In the process of opening a couple of accounts and I do have a hardware wallet. Not planning any illegal activities or depositing millions of dollars, just trying to completely understand how things work.   \nPurchasing from an exchange they have all your info and you need to link a bank account so your bank also has everything. Every penny in and out is documented.\n\nHaven’t tried one yet but using an ATM is mentioned a lot. From what I have seen even these require some ID. One I just looked at requires a registered account for over $250. Under that amount you still need a phone number. Easily traced back to you. Of course I guess you could use a burner phone but for small amounts that makes no sense.\n\nOther than person to person and handing over cash is there really any way to do it?\n\nOf course you would then have to eliminate that person because they know what you just received.\n\n(that was a joke)",
            "stickied": false,
            "comments": [
                {
                    "id": "i8z9gtl",
                    "author": "bitusher",
                    "score": 10,
                    "created_utc": 1652813325.0,
                    "response": ">truly anonymously?\n\nNothing in life is 100% anonymous . Privacy is a spectrum. Even if you are dealing with gold and physical cash \n\n>Not planning any illegal activities or depositing millions of dollars, just trying to completely understand how things work.\n\nIf you are merely concerned about longterm privacy than you are likely overthinking things and the solution is rather simple. \n\n1)\tWithdraw your btc from exchange to wallet A(mobile wallet) , than send to wallet  wallet B(example - HW wallet) within a few hours and never in reverse you create more plausible deniability which is good for privacy and tax reasons. Make sure you send the entire amount each time as well. \n\n2)\tWhen you are ready to spend your bitcoin in your hardware wallet there are many ways to sell or spend the bitcoin very privately like loading the bitcoin up in a lightning wallet where chain analysis cannot track those UTXOs offchain. \n\nWith Chainanalytics exchanges and regulators are using probabilistic guess work in tracking transactions onchain. They merely assume your withdraw address likely belongs to you. By sending the bitcoin from wallet A to wallet B within a few hours you are creating plausible deniability and adding in significant doubt those UTXOs(bitcoin) belong to you and doing so in such a small window that the price change is moot to avoid creating a taxable event. At any time in the future you can privately spend the bitcoin or sell it for fiat in a private manner. \n\n>you need to link a bank account so your bank also has everything. \n\nYour bank knows how much fiat was deposited and withdrawn . That is it. not what you bought or if you bought any bitcoin or when you withdrew it or for how much \n\n>Haven’t tried one yet but using an ATM is mentioned a lot. From what I have seen even these require some ID\n\nDepends \n\nmany people visit atms that only require sms verification for smaller amounts in this list - https://coinatmradar.com/\n\n> Under that amount you still need a phone number. Easily traced back to you. \n\nthere are many free sms services online \n\n>Other than person to person and handing over cash is there really any way to do it?\n\nmany ways to achieve privacy (you understand the blackmarket mainly uses bitcoin even to this day... ask yourself why is this ):\n\n1) mine bitcoin \n\n2) accept bitcoin for a good or service \n\n3) buy bitcoin p2p \n\n4) Use many DEXs or escrow exchanges \n\nhttps://github.com/cointastical/P2P-Trading-Exchanges\n\n5) use an atm with a mask and free sms service \n\n6) Buy bitcoin with a CEX and coinjoin it \n\n7) Buy bitcoin with a CEX and spend it with a lightning wallet , payjoin, liquid sidechain , etc ..\n\n8) buy bitcoin with a cex and mix it with 2 lightning wallets instead of coinjoining",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8znr9r",
                            "author": "Pots454",
                            "score": 1,
                            "created_utc": 1652819205.0,
                            "response": "Thanks for the responses. I am not necessarily over thinking the whole thing, trying to understand exactly how it works. I believe the exchanges send you a 1099?\n\nOnce that occurs it’s pretty much over with. Everybody knows. What you do with it from then on doesn’t really matter.\n\nLooked into the Lightning network you mentioned but I think I’m getting ahead of myself.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8zq3af",
                                    "author": "bitusher",
                                    "score": 3,
                                    "created_utc": 1652820182.0,
                                    "response": ">I believe the exchanges send you a 1099?\n\nEvery exchange is different. For example coinbase uses a 1099MISC where they will not send anything to the IRS by default unless you have made over 600 dollars in interest (staking shitcoin ponzi's) and thus its more self reporting unless they need to report you for the FINCEN provision where any tx over 10k usd in value or structuring is reported \n\nIn the year 2024 exchanges in the USA will likely start reporting 1099B forms under the American infrastructure bill where people or businesses accepting txs over 10k in value will be reported directly to the IRS instead of indirectly with FINCEN , but that is a long way off and things might change closer to that date \n\n>Once that occurs it’s pretty much over with. Everybody knows. What you do with it from then on doesn’t really matter.\n\nThis statement is wrong in multiple ways. Who \"knows\" is the exchange, and perhaps a department in the government. Not \"everyone\" \n\nAdditionally, If the a tax department knows you bought bitcoin they don't know much else. They don't know how much you sold/spent it for or if you lost it , or if it was stolen , or who you spent it with in many cases. \n\nOf course if you are a complete idiot , and bought bitcoin from a regulated exchange with your ID , withdrew bitcoin to wallet A , than sent bitcoin back to that same exchange that you bought it from with a tx over 10k usd , than yes , you have almost no privacy(with the exchange and FINCEN/IRS) and the tax authorities will know that those are your bitcoin and you are responsible for those taxes. \n\nBut you are not an idiot , so won't do this , right ?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9017gc",
                                            "author": "Pots454",
                                            "score": 1,
                                            "created_utc": 1652824937.0,
                                            "response": "Re the last paragraph. I was going to buy from a regulated exchange. (That’s what started this. I was trying to see other ways to obtain).\n\nWhen purchased it would go directly to the hardware wallet. To sell it would go back to an exchange then to a bank account.\n\nSounds like don’t buy & sell with the same exchange? That sounds like a good idea.\n\nThe only problem (yes I’m over thinking it) unless you have multiple bank accounts,  which I’m not considering, all transactions would go through your bank.   \nIf the gov really wanted to get into it, it would be pretty obvious what’s going on. Say you purchase 10k of coin from Binance and it goes up to 15k and you sell through Coinbase.\n\nYou’re not buying and selling car parts or bananas, if you have money coming and going from these places you’re dealing in crypto.\n\nSeems a lot depends on how intrusive uncle Joe wants to get.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i902ztr",
                                                    "author": "bitusher",
                                                    "score": 1,
                                                    "created_utc": 1652825738.0,
                                                    "response": "> When purchased it would go directly to the hardware wallet.\n\nSmarter to withdraw to an intermediary wallet as I discussed above for the 6-20 cent added tx fees , but ok. \n\n>To sell it would go back to an exchange then to a bank account.\n\nMuch wiser to simply spend the bitcoin directly on non registered items (and save 3-20% off everything and skip the exchange fees ) or sell it p2p or sell it on a DEX \n\nAt minimum you would want to send the BTC to another exchange (other than you purchased it from) and sell it under amounts that are self reported \n\n...or just decide to pay taxes on it \n\nHere are other ways people avoid taxes -\n\nspend btc directly for non registered items –technically illegal if you don’t pay taxes but difficult to enforce\n\nsell at 2 way atms without ID (coinatmradar.com) –technically illegal if you don’t pay taxes but difficult to enforce\n\n\nsell p2p with others–technically illegal if you don’t pay taxes but difficult to enforce\n\n\nsell on a DEX like BISQ–technically illegal if you don’t pay taxes but difficult to enforce\n\n\nSell the minimum in a country like the USA where you can get in the 0% long term cap gains rate - legal\n\nKeep the btc as collateral and take on debt that is not taxable - legal\n\nGift bitcoin with a gift tax exemption - legal\n\nDonate bitcoin to charities - legal\n\n----------------------\n\n>all transactions would go through your bank.\n\nBanks do not report anything under 10k usd (unless you are structuring) . Also , its not difficult at all to open a 2nd bank account \n\n>If the gov really wanted to get into it, it would be pretty obvious what’s going on.\n\nThe IRS targets low hanging fruit. They need to be efficient in tax collecting after all. If you get audited than they will get this information, but most people avoid getting audited. If you are concerned about the probability being audited than why are you selling it back to fiat or using a CEX to spend/cash out in the first place?",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8z9boe",
                    "author": "Hwy39",
                    "score": 2,
                    "created_utc": 1652813266.0,
                    "response": "Buy it from a friend in person",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8z64cl",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1652811961.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8zbfk9",
                    "author": "AlienPearl",
                    "score": 1,
                    "created_utc": 1652814133.0,
                    "response": "Cash",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8zcktg",
                    "author": "Mean_Reflection_5845",
                    "score": 1,
                    "created_utc": 1652814598.0,
                    "response": "P2P exchange. I know of someone who uses one and it seems pretty under the radar. \nBut hey, if you’re paying taxes, you’re making money.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i909e1r",
                    "author": "Jetjones",
                    "score": 1,
                    "created_utc": 1652828703.0,
                    "response": "Bisq is a good way. You can pay with cash and it’s non KYC. You pay extra, tho.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i90iw32",
                    "author": "Inner-Assignment-601",
                    "score": 1,
                    "created_utc": 1652833277.0,
                    "response": "Yeah sure",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i90lzdn",
                    "author": "Crypto_bro999",
                    "score": 1,
                    "created_utc": 1652834725.0,
                    "response": "I don't really know but I think you can try finex cos it doesn't have a KYC system.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i91029q",
                    "author": "ouyangnna",
                    "score": 1,
                    "created_utc": 1652841388.0,
                    "response": "There is no way to be anonymous at all, and ID verification is required to withdraw and buy cryptocurrencies.\r  \nThere is no way to buy more cryptocurrencies without ID verification on the account.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i91d6ja",
                    "author": "JazzyHandzzz",
                    "score": 1,
                    "created_utc": 1652848616.0,
                    "response": "You could buy it from a Bitcoin ATM down side would be the fees and the spreads",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}