{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uumyn9",
            "title": "BRD phone wallet help",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uumyn9/brd_phone_wallet_help/",
            "author": "quigleydude",
            "created_utc": 1653139108.0,
            "score": 1,
            "num_comments": 4,
            "subreddit": "Bitcoin",
            "selftext": "I have a  BRD wallet on my phone just because. As an old boomer, I occasionally use it to move small amounts of BTC to and from my hard wallet for practice. Last time I checked it was not supported and a link to Coinbase to convert it to their phone wallet. I don't want to use Coinbase. Can anyone recomend a simple phone wallet. I'm not too concerned with a lot of features, just something simple. Thank you in advance.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9g432o",
                    "author": "igadjeed",
                    "score": 1,
                    "created_utc": 1653139515.0,
                    "response": "> simple phone wallet\n\nElectrum",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9g49kr",
                    "author": "mrv1ckt3r",
                    "score": 1,
                    "created_utc": 1653139615.0,
                    "response": "https://muun.com",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9g8ylj",
                    "author": "esemene",
                    "score": 1,
                    "created_utc": 1653142049.0,
                    "response": "Blue wallet",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9g95az",
                    "author": "myironcity",
                    "score": 1,
                    "created_utc": 1653142144.0,
                    "response": "I’m using Munn since I exclusively use my phone. I used Electrum with my computer. Both are simple wallets.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uumt0w",
            "title": "Why you’re Losing Money: Living with Inflation (Bitcoin fixes this)",
            "url": "https://youtu.be/v-ipLeVsrIs",
            "author": "Able-Parsley3128",
            "created_utc": 1653138606.0,
            "score": 1,
            "num_comments": 3,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9g3dx9",
                    "author": "TonightSame",
                    "score": 2,
                    "created_utc": 1653139131.0,
                    "response": "Bitcoin inflation has been running at around 400% for the past six months.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9gdsc5",
                    "author": "jsbjsb12345",
                    "score": 1,
                    "created_utc": 1653144351.0,
                    "response": "Buying Land is also a good hedge for inflation.. and you can live on it !!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9gexac",
                    "author": "lukanmac",
                    "score": 1,
                    "created_utc": 1653144873.0,
                    "response": "(Bitcoin fixes this.. you lose all you’re money so you don’t have to worry!)",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uumyrj",
            "title": "A what if theory",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uumyrj/a_what_if_theory/",
            "author": "Rdlhjr47",
            "created_utc": 1653139118.0,
            "score": 2,
            "num_comments": 27,
            "subreddit": "Bitcoin",
            "selftext": "So I know this will probably get hate but that doesn't mean it shouldn't be brought up so here it goes. We all know the government is coming out with their own cbdc and a digital id system. With the help of the WEF the US is able to implement these systems. The WEF has many of the biggest companies as their partners including a lot of our phone service providers and internet companies. As well as a ton of other tech companies like google apple etc. Now i know this forum would say bitcoin can't be shut down because you can't shutdown the internet. And even if they blocked bitcoin websites you could just use a VPN. Now I'll take it a step further because our governments don't mind taking extreme steps to further the global agenda. Let's say this new system would require that in order for you to have internet you must be a part of this new system and have the new ID and use the new digital dollar to pay for that internet. And the US would require all companies to abide by their new rules and regulations. If you aren't a part of the new system you can't have what you used to have. You are kicked out and left for dead. Now I am religious and truly believe the cbdc and digital ID is the mark of the beast. I hate this system and it seems likely to happen. I think for sure gold and silver can help people to stay out of that system. And I think bitcoin is cool and could possibly fight off that system. But I also know the powerful want this new system and don't care what toes they step on to get there. They've basically been prepping us with forced lockdowns locked bank accounts shutting off speech and tons more. So to end it what if this happens? I understand bitcoin wants to put up a fight and that's really cool. But governments and huge companies have a lot of power and provide us all our resources. If they lock us out then what do we have. This is one reason why I think in this scenario gold and silver seem to be better suited to fight off the government. Hopefully this can be proven wrong though.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9g8j4x",
                    "author": "myironcity",
                    "score": 4,
                    "created_utc": 1653141838.0,
                    "response": "First WEF has to convince at least the biggest global leaders and so far that’s not happening. China and Russia still will not accept globalism. Most of the US, other than politicians, do not want globalism and believe Bitcoin is the way to do that. Andrew Torba, founder of Gab social media platform found out how hard it is to go against the status quo but he did it using Bitcoin. Gold and silver were old money protectors and that’s why they try so hard to keep it up. If you noticed when Gold was falling in value Bitcoin was rising, old money had to knock it down, and when Bitcoin went down Gold started to rise. There has always been a black market and that will never change. The US will adapt there digital money because they don’t want to lose money to other countries that have found a way out of US control. This administration let it slip that if they control usd they can sanction other countries for whatever reasons and smaller countries now know they need to get away from the American dollar. Bitcoin is global but not part of the globalism agenda, no entity solely controls it, which is why they try to get as much as they can before we do, they haven’t been able to stop it , and now they want the most nodes they can get. They’re thinking they’ll change it from the inside out, but we continue to peck away. They love all the crypto that takes money away from Bitcoin. The world is in turmoil, countries are turning to nationalism, Pandora’s box is open, and  Bitcoin is will pave the way.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ghl5r",
                            "author": "Adamn27",
                            "score": 1,
                            "created_utc": 1653146096.0,
                            "response": "> China and Russia still will not accept globalism.\n\nYet.\n\n>There has always been a black market and that will never change.\n\nThat might be true, but what about the price? If the exchanges will be shut down and governments make owning crypto a felony, Bitcoin would lose 99% of its value.\n\n&#x200B;\n\n>Bitcoin is global but not part of the globalism agenda, no entity solely controls it\n\nActually nobody knows that. How could anybody know if Bitcoin's 50% for example is owned by some government? What if they already bought in?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9gbu59",
                    "author": "MrQ01",
                    "score": 1,
                    "created_utc": 1653143433.0,
                    "response": "Please re-edit this and split into paragraphs.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ggkce",
                            "author": "NiceDoctorBeam",
                            "score": 1,
                            "created_utc": 1653145624.0,
                            "response": "*Oh!  Look at you, dishing \"hate\"*...\n\nJust kidding.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9g6am3",
                    "author": "ThisCoconut8834",
                    "score": 2,
                    "created_utc": 1653140697.0,
                    "response": "this seems valid...",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9gfam8",
                    "author": "Adamn27",
                    "score": 1,
                    "created_utc": 1653145047.0,
                    "response": "If you want a constructive conversation edit your post with including paragraphs.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9g3zdo",
                    "author": "igadjeed",
                    "score": 2,
                    "created_utc": 1653139457.0,
                    "response": "> cbdc\n\nNot relevant to Bitcoin",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9g44ew",
                            "author": "Rdlhjr47",
                            "score": 0,
                            "created_utc": 1653139536.0,
                            "response": "Did you even read the full thing or did you just see that word and assume? And good argument against what I said lol. I can already see I've hit a hornets nest.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9g4e62",
                                    "author": "igadjeed",
                                    "score": 3,
                                    "created_utc": 1653139686.0,
                                    "response": "> Did you even read the full thing\n\nYes I read the entire pile of halfwit conspiracy bullshit, you creep",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9g575b",
                                            "author": "Rdlhjr47",
                                            "score": 1,
                                            "created_utc": 1653140121.0,
                                            "response": "You reacting like that let's me know you have the same fear in your head. And creep? Lol you don't even know who I am. Just sounds like your mad for no reason and can't even seem to think about what you're investing in.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9g631u",
                                                    "author": "igadjeed",
                                                    "score": 2,
                                                    "created_utc": 1653140582.0,
                                                    "response": "> you don't even know who I am\n\nYou're this clown ...\n\n> I just want to mine btc directly with my GPU",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9g8vg6",
                                                            "author": "Independent-Snow-129",
                                                            "score": -1,
                                                            "created_utc": 1653142004.0,
                                                            "response": "Nonsense",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9gf0c0",
                                            "author": "Adamn27",
                                            "score": 1,
                                            "created_utc": 1653144911.0,
                                            "response": "Why is he a creep?",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9gf7dk",
                            "author": "Adamn27",
                            "score": 1,
                            "created_utc": 1653145003.0,
                            "response": "Why is it not relevant to Bitcoin? A money which can be tracked an makes your income and expenses fully 100% transparent to the government? How is this not relevant to Bitcoin?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9g6pbr",
                    "author": "NiceDoctorBeam",
                    "score": 2,
                    "created_utc": 1653140912.0,
                    "response": "It says something about you, that people addressing/criticizing your question are, in your mind, acting hatefully.  \n\nYou should learn about this new thing they invented.  It's called the \"paragraph\".  Did I just hurt your little feeling?  Do you feel all hated now?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9g9z64",
                    "author": "Volkl777",
                    "score": 2,
                    "created_utc": 1653142551.0,
                    "response": "You lost me at the I am religious part.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9g58s1",
                    "author": "Suspicious_Highway70",
                    "score": 1,
                    "created_utc": 1653140145.0,
                    "response": "Igadjeed :) \nI liked your response",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9gel8o",
                            "author": "n8dahwgg",
                            "score": 1,
                            "created_utc": 1653144718.0,
                            "response": "Tbh that guy is a looser",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9ger27",
                    "author": "Blex98",
                    "score": 1,
                    "created_utc": 1653144794.0,
                    "response": "First of all, stop it with the religion bs. If let's say that your \"God\" exists, than whatever happens doesn't matter because it is according to its plan, so chill. Bitcoin is pure mathematics, its universally true, how can a truly rational person that studies and learns about Bitcoin, hate it or want to shut it down is beyond me. Moreover the politicians are just people like everyone else, they also can get greedy and of course love to have more money. If they see the potential in Bitcoin, they won't stop it. Additionally they also can't stop it, even if they wanted to and remember they are your public servents, you can actually demand from them that they work for your interests. But if you are unhappy with your government go vote for someone else or move to another country.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ggoh9",
                            "author": "Adamn27",
                            "score": 1,
                            "created_utc": 1653145678.0,
                            "response": ">If let's say that your \"God\" exists, than whatever happens doesn't matter because it is according to its plan, so chill.\n\nReligions are not about \"God doing his plan\" but about making your own conscious choices to live a valuable life with good morals.\n\n>how can a truly rational person that studies and learns about Bitcoin, hate it or want to shut it down is beyond me.\n\nTo the people in charge has no \"good\" or \"bad\" things only power they can posses. If they see Bitcoin as a threat to their power they would want to end Bitcoin.\n\n>Moreover the politicians are just people like everyone else, they also can get greedy and of course love to have more money. If they see the potential in Bitcoin, they won't stop it.\n\nThere are certain levels where it is not about the money but power. Above politicians there are the true leaders of the world. If they see Bitcoin as a threat they would (will) stop it.\n\n>Additionally they also can't stop it,\n\nThey can stop it. Make it a felony to own, send, or run any crypto exchange in all major regions like USA, Canada, EU, Russa, China, India, Australia and Bitcoin will drop 99.9% of its value. The only question whether they want to stop it.\n\n>remember they are your public servents, you can actually demand from them that they work for your interests.\n\nOh my sweet summer child.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9geyc0",
                    "author": "Adamn27",
                    "score": 1,
                    "created_utc": 1653144887.0,
                    "response": "> Now i know this forum would say bitcoin can't be shut down because you can't shutdown the internet.\n\nThis forum says this but it is false. If all major regions: USA, Canada, Russia, India, Australia, India and the EU bans cryptocurrency, and by ban, think of it as a felony if you own, send, or run any crypto currency broker, then its price would tank 99.9%. That would be the end of Bitcoin.  \n\n\nGuys will downvote and argue with unmature arguments like \"Drugs are illegal too\" but this is a whole different topic. Bitcoin can thrive because it is the people's money. If you make it illegal it will really be the criminals money, thus 99.9% people would sell, including institutions, because they would be forced to do so.  \n\n\nThe question is whether this scenario will happen or not. I might say not, or not in the near future, but you cannot say Bitcoin is unkillable.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ggtjg",
                            "author": "NiceDoctorBeam",
                            "score": 1,
                            "created_utc": 1653145744.0,
                            "response": "You are not correct.  \n\nThe Internet Protocol was **designed** to withstand attacks.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9ghy6a",
                                    "author": "Adamn27",
                                    "score": 1,
                                    "created_utc": 1653146264.0,
                                    "response": "What are you even talking about? I said countries can make it a felony to own, send, or run crypto exchanges.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9ggh4t",
                    "author": "MadMaxwell92",
                    "score": 1,
                    "created_utc": 1653145584.0,
                    "response": "I think that the what if world you described we already live in. 😂",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9gi5cn",
                    "author": "Read-Moishe-Postone",
                    "score": 1,
                    "created_utc": 1653146357.0,
                    "response": "Just build your own society bro",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9g7hzz",
                    "author": "Independent-Snow-129",
                    "score": 0,
                    "created_utc": 1653141317.0,
                    "response": "Stack Sats and use bitcoin instead ? Grow fruits and vegetable in case ?  Build or buy solar panels or other self-powered energy alternative .\n\nThen, what can you do about it ?  Stack Sats... Stack Sats... Stack Sats...\n\nTake a deep breath , mark of the beast or not ,  If you stack enough Sats you'll become the beast who can place your own mark !\n\n(Not financial advise)",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}