{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uu429k",
            "title": "I have like 3 wallets but I’m scared to put my coins in there. Currently in the exchange but I keep hearing stuff about coinbase maybe keeping my holdings if they go bankrupt",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/uu429k/i_have_like_3_wallets_but_im_scared_to_put_my/",
            "author": "person508800027",
            "created_utc": 1653070160.0,
            "score": 20,
            "num_comments": 47,
            "subreddit": "BitcoinBeginners",
            "selftext": "I’m not sure how to keep my keys safe. I don’t trust the digital wallets and the ledger wallets I would be anxious to hold. Currently I have the keys written on a small piece of paper but that’s a dumb idea. I need a more permanent solution. Plus I don’t trust that the source is legit. Is Amazon a safe place to get a ledger? I want a good one if I’m holding my coins but I can’t chose yet. Ledger nano is the only one I hear good things about",
            "stickied": false,
            "comments": [
                {
                    "id": "i9dxc0y",
                    "author": "MostBoringStan",
                    "score": 21,
                    "created_utc": 1653086973.0,
                    "response": "I personally would not buy a hardware wallet from Amazon.  Due to the way Amazon warehouses work, just because you buy from a trusted source does not mean you will actually receive your wallet from that source.  The warehouse can just grab a Ledger from another seller, because it's the same product, and send it to you as if it's from the source you purchased from.\n\nSome will say that is too paranoid, but when it comes to crypto I'd rather be too paranoid than lose everything.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9fkp5a",
                            "author": "hhtoavon",
                            "score": 2,
                            "created_utc": 1653125234.0,
                            "response": "You can validate the software to check against this type of attack.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9floh1",
                                    "author": "bitusher",
                                    "score": 1,
                                    "created_utc": 1653126169.0,
                                    "response": "correct , supply chain attacks can also occur buying directly from the manufacturer as well which is precisely why cold card makes their case transparent to who can see if the hardware has been altered at all",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9dd47b",
                    "author": "BitcoinWell",
                    "score": 8,
                    "created_utc": 1653077531.0,
                    "response": "Putting your coins on a hardware wallet is much safer than keeping them on a custodial exchange. For your words, its highly recommended to put them onto something more sturdy like metal and then you don't have to worry about a fire or water damaging it.\n\nFor ledger (or any hardware wallet) if you buy directly from their site or from an authorized reseller then that's the best option for trying to buy a wallet. Ledger specifically will list their resellers on the website.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9dea0e",
                            "author": "person508800027",
                            "score": 3,
                            "created_utc": 1653078062.0,
                            "response": "Seems like direct from the source is best. Thank you for replying :)",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9cyefj",
                    "author": "igadjeed",
                    "score": 3,
                    "created_utc": 1653070779.0,
                    "response": "https://www.reddit.com/r/BitcoinBeginners/comments/g42ijd/faq_for_beginners/",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9dcfvt",
                    "author": "08160486256",
                    "score": 2,
                    "created_utc": 1653077221.0,
                    "response": "There’s actually nothing wrong with keeping them in a piece of paper. Actually a personal dairy should help you better, especially if you’ll use that diary for your investments plans later in future",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9fs4u7",
                    "author": "BTCMachineElf",
                    "score": 2,
                    "created_utc": 1653131797.0,
                    "response": ">Currently I have the keys written on a small piece of paper but that’s a dumb idea.\n\nIt really isn't, if you have it safe and secure, and especially if you have a backup. A metal plate is better in case of fire, but thats your only real concern. \n\nUse passphrases and store them seperatly for better security. \n\nTrezor is better than ledger imo. \n\nStart by withdrawing a small amount. Wipe the wallet and restore to gain confidence. Then you'll probably feel comfortable enough withdrawing the rest.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9d8t24",
                    "author": "Psychological-Ad212",
                    "score": 2,
                    "created_utc": 1653075615.0,
                    "response": "There is a feature on Binance called custodial wallet, well the whole point of Bitcoin is its self custodial but one can lose his/her private keys and might be lost forever. For features like Binance custody, it offers crime insurance coverage and other insurance(DYOR). And also uses a protocol called multisignature where multiple parties are required to approve transactions before they can be carried out.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9deqkl",
                            "author": "person508800027",
                            "score": 2,
                            "created_utc": 1653078266.0,
                            "response": "I keep hearing though that if it’s custodial then they can basically keep you from having access to it. I don’t know there was a difference until now lol. Got to keep doing research. I definitely would like to have full control of my bad decisions hah",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9djkzl",
                                    "author": "Psychological-Ad212",
                                    "score": 1,
                                    "created_utc": 1653080467.0,
                                    "response": "If you decide to use a custodial wallet you may want to look at the custody service providers rules, what types of services you get, how your private keys are stored and whether there is insurance coverage. This information may not be the same in different custody service providers.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9ddgwv",
                    "author": "kuzkokronk",
                    "score": 1,
                    "created_utc": 1653077694.0,
                    "response": "I use this to store my seed phrase:\n\n[https://bitcoinseedbackup.com/](https://bitcoinseedbackup.com/)\n\nYou punch in the first 4 letters of each word in order, then store it somewhere safe. It's basically indestructible.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9e8ggg",
                            "author": "DisQualified__",
                            "score": 2,
                            "created_utc": 1653092686.0,
                            "response": "I really don't understand. How does this work? It's just a sheet of metal?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9edgp6",
                                    "author": "MyOtherAcctsAPorsche",
                                    "score": 1,
                                    "created_utc": 1653095372.0,
                                    "response": "You punch marks in the grid with your seed words letters.\n\nAnything that lets you store 100 characters in order works.\n\nYou could buy a cheap set of character punches from amazon and then stamp the seed on a random piece of metal that's might be easier to hide.\n\nOr buy some stainless steel washers and stamp those",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9cx21q",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653070160.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9d50q6",
                    "author": "tradingnomads",
                    "score": 1,
                    "created_utc": 1653073892.0,
                    "response": "There are multiple good wallet. Ledger Nano is good as well. Plenty of information to find on google and youtube. Keep em safe and keep stacking buddy!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9d69e2",
                            "author": "person508800027",
                            "score": 1,
                            "created_utc": 1653074468.0,
                            "response": "Yup yup I keep stacking so I think it’s about that time I invest in a good wallet. 🙂",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9dj475",
                                    "author": "lookingglass91",
                                    "score": 3,
                                    "created_utc": 1653080255.0,
                                    "response": "Yes but buy the ledger nano ONLY from ledgers website themselves. Amazon is a third party and even tho it may seem safe enough, there are ways for third parties to manipulate the devices before reaching you. It’s always best to buy directly from the source",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9djkz8",
                                            "author": "person508800027",
                                            "score": 2,
                                            "created_utc": 1653080466.0,
                                            "response": "Noted. Thanks for the tip. I’m trying to stay as safe as possible",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9e80ws",
                                                    "author": "lookingglass91",
                                                    "score": 3,
                                                    "created_utc": 1653092455.0,
                                                    "response": "Why did I get downvoted?",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9dlv3x",
                    "author": "IamPantone376",
                    "score": 1,
                    "created_utc": 1653081527.0,
                    "response": "Is there a fee to transfer coins to a wallet?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9e4oj0",
                            "author": "Brettanomyces78",
                            "score": 1,
                            "created_utc": 1653090689.0,
                            "response": "Depends where it's being sent from.  You need to be more specific.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9e79jl",
                                    "author": "IamPantone376",
                                    "score": 2,
                                    "created_utc": 1653092049.0,
                                    "response": "Coinbase",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9e7vcc",
                                            "author": "Brettanomyces78",
                                            "score": 2,
                                            "created_utc": 1653092372.0,
                                            "response": "Coinbase charges a small withdrawal fee, but it's not a flat fee.  It'll change over time.  You need to initiate a withdrawal to get a quote for the actual fee.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9e7xiy",
                                                    "author": "IamPantone376",
                                                    "score": 2,
                                                    "created_utc": 1653092405.0,
                                                    "response": "Thanks for the info!",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9dmxbs",
                    "author": "DudeIncogneto",
                    "score": 1,
                    "created_utc": 1653082016.0,
                    "response": "Make two copies of your keys and a third punched into metal",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9efy1u",
                    "author": "SurprisedByItAll",
                    "score": 1,
                    "created_utc": 1653096699.0,
                    "response": "I feel your pain.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9egaz5",
                    "author": "MichaelFackrell4",
                    "score": 1,
                    "created_utc": 1653096887.0,
                    "response": "A few simple lessons in cryptography and you can make your own formulas for keys so you never need to remember them or have them written down anywhere. You could theoretically store your keys publicly, on social media for the whole world to see, where they will remain indefinitely. Add dates and times to your formulas for added security. Makes for an easy and convenient way to transfer them too.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ekaca",
                    "author": "Crypto_bro999",
                    "score": 1,
                    "created_utc": 1653098923.0,
                    "response": "Don't worry, I hold crypto on exchange (finex) too, so it's fine.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9eq380",
                    "author": "Altruistic_Exit3841",
                    "score": 1,
                    "created_utc": 1653102069.0,
                    "response": "Amazon is fine. One of the first steps of activating a ledger is certifying it’s authenticity on the desktop app… \n\nEven if you lose your device, your seed phrase is what gives you access to your private ley… if you’re that freaked out about a piece of paper just memorize it… if you don’t trust yourself, you have to realize at some point you have to take risk, even if it’s small. There is no way you can ever cancel out all contingencies… that’s life. In this case this is the blessing and curse of being your own bank.\n\nThe amount of risk you are taking on by keeping assets in exchanges vs. cold wallet is incomparable",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9extqe",
                    "author": "calbears82",
                    "score": 1,
                    "created_utc": 1653106551.0,
                    "response": "Electrum.org",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9eypyf",
                    "author": "FoxhoundDumpGawd",
                    "score": 1,
                    "created_utc": 1653107125.0,
                    "response": "Buy a hardware wallet, and ONLY buy it from the official website. Never from a third party like Amazon, etc.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9fdky4",
                    "author": "Madteklynd",
                    "score": 1,
                    "created_utc": 1653118668.0,
                    "response": "Get Casa you have multi sig with hardware, app and they hold one key. I was in the same boat",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9g482u",
                    "author": "TheCryptoSquirrels",
                    "score": 1,
                    "created_utc": 1653139593.0,
                    "response": "Coin lost 430 MILIION in Q1... check out my tik toks on crypto I talk about Sw and HW wallets.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9g4x9y",
                    "author": "dwmtl1000s",
                    "score": 1,
                    "created_utc": 1653139974.0,
                    "response": "Get a cold wallet.  Next take notes anyone could use to access it (Incase you forget). Then place your keys and the note in a banks safety security box.  This is what I did last week and feel so much better about it now.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}