{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ur6843",
            "title": "How to move BTC from Coinbase Pro to cold wallet storage?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/ur6843/how_to_move_btc_from_coinbase_pro_to_cold_wallet/",
            "author": "PThorn90",
            "created_utc": 1652735571.0,
            "score": 16,
            "num_comments": 16,
            "subreddit": "BitcoinBeginners",
            "selftext": "Question is in the title - I can’t for the life of me find a step by step guide or ‘how to video’ for moving Bitcoin from your Coinbase pro account to a hard wallet. I’m a complete noob which probably doesn’t help in this search. \nBonus: I appreciate this is a Bitcoin sub, however is the process the same for other cryptos? \nBonus 2: any general advice on storing cryptos would be great \n\nAny helpful responses will be hugely appreciated! Many thanks.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8vfxhg",
                    "author": "Ven1821",
                    "score": 15,
                    "created_utc": 1652737671.0,
                    "response": "Create and use or use the bitcoin address in the hardware wallet, be sure is for bitcoin 'cause (to make the thing easy) every crypto has a different address, click to copy this address, go to coinbase and click withdraw or send, insert the amount you need to send and the address, compare some words and number of the address to be sure is correct and send the transaction.\nRules: \n-always check the addresses\n- if you need to transfer big amount do a micro transaction first and if everything worked smooth, transfer the rest.\n- in some wallet like bluewallet or bitpay you can select the gas fees, select the best fees for your pourpose, imo a big amount is better to be sent using high fees to be sure.\n- use the newest adresses, address which starts with the number 1 are old--> this means they are slow and they has higher fees, an address that start with bc1 are new, fast and cheap (old means they have a old standard, not that they are used lol) \n- backup the seedphrase offline, always, NEVER BACKUP THE PHRASE ONLINE AND NEVER WRITE THIS PHRASE TO ANYONE, do not trust anyone, a wallet do not ask you the seed untill you click \"import a wallet\"\n-u can use a paper wallet too, it's an old and slow solution but the cheapest and most secure way to store bitcoin, remember to generate the wallet and print it offline, through a cable, you can use and follow the rules on bitaddress.org \n- do not store all your bitcoin into a single wallet, share the risks at least on 2 wallets \n- have fun, try things, love crypto, stay safe, do not trust anyone that's not your mom, be a diamond hands hodler but explore the lightning network too.\n\nMuch love, bc1venerdi",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8wontk",
                            "author": "Smok_eater",
                            "score": 1,
                            "created_utc": 1652760077.0,
                            "response": "Mad love",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8vqghf",
                    "author": "FlyEarly4259",
                    "score": 3,
                    "created_utc": 1652742446.0,
                    "response": "I’m with you! I just bought a ledger x but I’m trying to find a true step by step how to transfer to it..",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8vvign",
                    "author": "sigmundsplatz",
                    "score": 3,
                    "created_utc": 1652744916.0,
                    "response": "Followup question:\nI have two options to send BTC - Bitcoin Network and Lightning network - will either work to a regular BTC receive address on a cold wallet?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8wf339",
                            "author": "DudeIncogneto",
                            "score": 1,
                            "created_utc": 1652754735.0,
                            "response": "Bitcoin network",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8ww8cd",
                            "author": "Ven1821",
                            "score": 1,
                            "created_utc": 1652765093.0,
                            "response": "Nope, lightning and btc has different address, but the lightning address is directly related to the onchain btc address, lightning address often begin with ln",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8vbqt0",
                    "author": "DudeIncogneto",
                    "score": 4,
                    "created_utc": 1652735873.0,
                    "response": "Create a receiving address in your hardware wallet, copy it and paste it in the send section of coinbase pro. Check a couple of words/numbers in the front, middle and end of the address to make sure it pasted correctly. Send the bitcoin from coinbase pro to your hardware wallet",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8vre3x",
                    "author": "509BandwidthLimit",
                    "score": 3,
                    "created_utc": 1652742899.0,
                    "response": "Take a look on YT for The Crypto Dad, he shows you in person how to setup a Ledger and buy/transfer crypto",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8x2iir",
                    "author": "ourielohayon",
                    "score": 1,
                    "created_utc": 1652769975.0,
                    "response": "to move funds from Any exchange to any wallet\n\n&#x200B;\n\n1. go to your exchange\n2. go to the coin you want to move out\n3. find the button \"send\" or \"withdraw\"\n4. use the wallet address of the same coin on the wallet you are using (usually this is the \"receive\" function or \"wallet address\"\n5. press send\n\n&#x200B;\n\nNot blockchain transactions are not instant usually and some exchanges may charge you additional withdrawal fees on top of the network fees\n\n&#x200B;\n\nG luck",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}