{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uzg2ri",
            "title": "#Bitcoin ATM installed at the International Airport in Slovakia",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uzg2ri/bitcoin_atm_installed_at_the_international/",
            "author": "CWCOfficial",
            "created_utc": 1653713624.0,
            "score": 43,
            "num_comments": 10,
            "subreddit": "Bitcoin",
            "selftext": " Get ready... soon it will be habitual everywhere.\n\n&#x200B;\n\n[ #Bitcoin ATM installed at the International Airport in Slovakia](https://preview.redd.it/7llebjjwd5291.jpg?width=980&format=pjpg&auto=webp&s=d742f6ebc326c45ecc23faccde7178f99c77d22b)",
            "stickied": false,
            "comments": [
                {
                    "id": "iaabr2p",
                    "author": "Ok_Estimate_2896",
                    "score": 3,
                    "created_utc": 1653719613.0,
                    "response": "And they were completely yanked in South Korea and are losing popularity here in Vietnam.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaapx6h",
                            "author": "CWCOfficial",
                            "score": 1,
                            "created_utc": 1653732422.0,
                            "response": "Why?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iabil2p",
                                    "author": "Ok_Estimate_2896",
                                    "score": 2,
                                    "created_utc": 1653750239.0,
                                    "response": "In Korea it was a government decision. South Korea is known as being liberal but it is actually a very conservative society. In Vietnam the average person just isn't very interested in bitcoin so the machines don't get used much. If I was a government person that had a viable currency I would likely be against bitcoin too. Until recently South Korea had a great economy yet a pretty weak currency. Why? The government wanted it that way. They can export and outcompete Japan and Taiwan because of this advantage. \n\nI currently own no bitcoin, I'm emotionally uninvolved. I'd love to see some major nations get behind it, but I don't see that happening. And I would bet money the US is bullying El Salvador over them getting into it. The US has the most to lose here as our currency is super vulnerable to a shock. I'm pretty sure the US is also scared of Gold, back in the day Bernake made a comment that people should consider bitcoin over gold. I doubt he was trying to make any peons some easy money, but trying to get the air out of the gold and silver market. At the time bitcoin was probably seen as the lesser of two evils, but once it reached a trillion market cap it becomes a threat.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iaaxdrt",
                    "author": "NYKNYb",
                    "score": 3,
                    "created_utc": 1653738417.0,
                    "response": "That's actually pretty useful to have them in an airport.\n\nYou can go straight from BTC to cash in the local currency! Neat!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaar6z4",
                    "author": "Boriz0",
                    "score": 1,
                    "created_utc": 1653733588.0,
                    "response": "Is it non-KYC (withdrawal/deposit)?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaaswcz",
                            "author": "pink_raya",
                            "score": 2,
                            "created_utc": 1653735009.0,
                            "response": "usually non kyc up to <1000€ cash, many are both way, some just buy, but this being the airport it can be a lot different.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iaarb9j",
                            "author": "SamWizza",
                            "score": 1,
                            "created_utc": 1653733697.0,
                            "response": "I don’t think as you need to link it to a local bank to have local currency.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iaarfwa",
                                    "author": "Boriz0",
                                    "score": 1,
                                    "created_utc": 1653733806.0,
                                    "response": "So cash withdrawal/deposit is not possible? Only electronic money?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iaba01m",
                    "author": "tennisss819",
                    "score": 1,
                    "created_utc": 1653745975.0,
                    "response": "I’m in Texas and they are in lots of gas stations and grocery stores. The fees are outrageous currently. But I like the exposure.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iad1ye7",
                    "author": "Suspended_9996",
                    "score": 1,
                    "created_utc": 1653776463.0,
                    "response": "March  11,  2022\n\nAre Crypto  ATMs  Illegal?   Here is Why the UK  is Banning  Bitcoin Crypto  ATMs\n\nAccording  to their  statement  most  Crypto  ATMs  in United Kingdom  are owned  by  a firms   who have not  been   approved  by law  to operate  them.  As such they have  began  the process  of  notifying  operators  to shut  down  their Crypto  ATMs   or face  legal consequences.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}