{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uuas00",
            "title": "Swiss watchmaker TAG Heuer starts accepting Bitcoin",
            "url": "https://bitcoinnews.com/tag-heuer-watch-bitcoin/",
            "author": "hyperfreeto",
            "created_utc": 1653089999.0,
            "score": 47,
            "num_comments": 8,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9efh1y",
                    "author": "d3vrandom",
                    "score": 5,
                    "created_utc": 1653096442.0,
                    "response": "$10k limit",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9fejbp",
                            "author": "LayPessimist",
                            "score": 1,
                            "created_utc": 1653119531.0,
                            "response": "And only in US.\n\nWay less exciting than I thought.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9ep0rk",
                    "author": "tldrpg",
                    "score": 2,
                    "created_utc": 1653101492.0,
                    "response": "During a dip too, pretty bold",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9f7mk2",
                            "author": "JerryLeeDog",
                            "score": 1,
                            "created_utc": 1653113573.0,
                            "response": "Probably converted immediately so I wouldn't think it matters. \n\nAlso, I'd rather have more BTC per transaction, while it's low, so if I weren't converting it right away so when it goes back up it multiples it's own buying power",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9evfyl",
                    "author": "shwirv",
                    "score": 2,
                    "created_utc": 1653105078.0,
                    "response": "They know what TIME it is... btc time bay bee!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9e7yqk",
                    "author": "likethis999",
                    "score": 1,
                    "created_utc": 1653092422.0,
                    "response": "Ofc they do as only smart people prefer btc over fiat 🤣🤣",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9f9ire",
                    "author": "MrDopple68",
                    "score": 1,
                    "created_utc": 1653115154.0,
                    "response": "I've been WATCHING out for this.\n\nAll I can say is about TIME!",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uuaksq",
            "title": "What happens when the whale to non-whale ratio gets disproportionate in the whales favour?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uuaksq/what_happens_when_the_whale_to_nonwhale_ratio/",
            "author": "imthejoshT",
            "created_utc": 1653089329.0,
            "score": 3,
            "num_comments": 43,
            "subreddit": "Bitcoin",
            "selftext": "Time goes by, dip after dip, peoples hands get weaker.\n\nNon-whales selling to the whales every dip.\n\nWhales pots are get bigger as non-whales leave the blockchain.\n\nUntil several whales own more than 50%.\n\nThen whales start getting bought out and consolidated.\n\nWhat happens then?",
            "stickied": false,
            "comments": [
                {
                    "id": "i9e3p71",
                    "author": "sean488",
                    "score": 10,
                    "created_utc": 1653090184.0,
                    "response": "The rich get richer and the poor get poorer.\n\nJust like with any other form of money or store of wealth.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ealja",
                            "author": "mcintoshshowoff",
                            "score": 1,
                            "created_utc": 1653093827.0,
                            "response": "Not quite.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9ebatx",
                                    "author": "sean488",
                                    "score": 3,
                                    "created_utc": 1653094207.0,
                                    "response": "The simplicity of it is, the more money you have, the more money you can make.\n\nThat's never changed and it never will.\n\nWhy?  It takes money to make money.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9ej9cb",
                                            "author": "mcintoshshowoff",
                                            "score": 2,
                                            "created_utc": 1653098388.0,
                                            "response": "Yet, how can one make more “money” when the supply is finite and they’re controlling/holding a higher percentage? What would stop these holders from colluding and changing the rules to benefit themselves?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9fdl1y",
                                                    "author": "robotsdev",
                                                    "score": 3,
                                                    "created_utc": 1653118670.0,
                                                    "response": "If one person owned 20 million BTC it wouldn't matter regarding the rules.  \nAll other nodes will continue in their own fork and keep going like nothing happened.  \n\nIt's how Bitcoin works, basically.  \nPriof of Stake coins on the other hand, would be a mess.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9ff02f",
                                                            "author": "mcintoshshowoff",
                                                            "score": 1,
                                                            "created_utc": 1653119956.0,
                                                            "response": "The largest holders are likely the same people who have the ability to make changes to the source code. Anything about bitcoin can be changed, even the max amount in total circulation or the reward for mining and if a group that colluded also had control of the network, it would be the end. Maybe no one colludes, maybe the US Government just bans cryptocurrencies and enforces that ban by getting the needed access from Github and then commandeers enough computing power to control the network. Maybe it's China. Maybe it's just blamed on China.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9fhkm0",
                                                                    "author": "it_is_gaslighting",
                                                                    "score": 1,
                                                                    "created_utc": 1653122302.0,
                                                                    "response": "The fact that that computing power needs to be extremly high is the reason even the USA wouldn't be able to harm bitcoin.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                },
                                                                {
                                                                    "id": "i9flm1u",
                                                                    "author": "robotsdev",
                                                                    "score": 1,
                                                                    "created_utc": 1653126104.0,
                                                                    "response": "No",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i9f3icl",
                                                    "author": "sean488",
                                                    "score": -2,
                                                    "created_utc": 1653110423.0,
                                                    "response": "You think bitcoin isn't infinite?\n\nYou can keep cutting it up into smaller and smaller pieces.\n\nNo one has ever tried to buy .0001 dollars.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9f4sog",
                                                            "author": "mcintoshshowoff",
                                                            "score": 3,
                                                            "created_utc": 1653111355.0,
                                                            "response": "Infinite in total number is a very different thing than divisible to one-millionth of a coin.\n\nYou can keep doing stock splits too, but that doesn’t change the fact that a founder or a small group of shareholders actually control the company for example.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9f51yx",
                                                                    "author": "sean488",
                                                                    "score": -1,
                                                                    "created_utc": 1653111544.0,
                                                                    "response": "No it isn't.\n\nYou can cut something in half forever.  If there is something there, you can keep cutting it up.\n\nYou end up with exactly the same thing.  More of it in circulation causing the amount it is worth to fall.\n\nThis is one reason why there is a definite \"bottom\" to fiat.  You can't go less than one whole cent.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9f5vbv",
                                                                            "author": "mcintoshshowoff",
                                                                            "score": 2,
                                                                            "created_utc": 1653112165.0,
                                                                            "response": "That’s not true, go read up. Cutting up something doesn’t make more of it. The divisibility isn’t an issue, it’s the total. When already a large amount of all Bitcoin is held long-term or lost, this creates liquidity issues because less and less of the bitcoin in circulation actually is used for trading. This is fine when there are more buyers than sellers, but creates huge amounts of downward pressure on the price in times of crisis. At some point, if the price continues to fall because of economic factors, you’ll see these whales all rush to exits and Bitcoin will collapse in price.  \nSince there are no cash flows, no dividends, and no physical assets backing Bitcoin, there is no floor at which investors would certainly step in. Because of this, a far higher percentage of the market cap can feasibly be destroyed by supply/demand imbalances. This would’ve happened had the fed not stepped in March 2020 and now the problem is even worse because they did.\n\nI have yet to see a half-intelligent response here to any comments I've made. It's honestly very troubling. Bitcoin is supposed to be \"de-centralized\" but it's already becoming obvious that a collective few (people & entities) pull the strings. Just like there's no true communism in the world, there is also no such thing as a decentralized currency.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i9gc7ee",
                                                                                    "author": "sean488",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653143610.0,
                                                                                    "response": "It makes more of it available. \n\nThings have worth because of their lack of availability.",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "id": "i9fc9nb",
                                                                            "author": "BigSmokeyTheBear",
                                                                            "score": 1,
                                                                            "created_utc": 1653117503.0,
                                                                            "response": "If you're creating more liquidity by creating smaller units of currency, how would what it's worth be falling? Prices would still be declining and be forced to decline, especially if smaller units needed to be used to have enough to exchange, therefore savers would still be rewarded which is pretty much the whole point.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        },
                                                                        {
                                                                            "id": "i9fdslx",
                                                                            "author": "MrQ01",
                                                                            "score": 1,
                                                                            "created_utc": 1653118860.0,
                                                                            "response": "Where do you get the idea that not getting less than one cent is some intrinsic rule.\n\nIt's a completely arbitrary decision by the currency's treasury (or whichever financial body it is). They can easily create a coin/bill/any physical thing and declare it to be $0.0001 if they wanted to.\n\nIt's just that they currently dont need to because the current value of a cent means that it is sufficient enough in that dividing further would be impractical. By the way, many countries do not have a one-penny coin.\n\nNot sure if you're trying to say that increased divisibility of a unit equates to an increase in units. If so then that would definitely be wrong, and a principle I'm sure you wouldn't accept I  any real world situation.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i9gc1kx",
                                                                                    "author": "sean488",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653143533.0,
                                                                                    "response": "So you're saying that Bitcoin was made to be infinite because it can be cut into smaller and smaller pieces?",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9fvbtr",
                            "author": "MasterDebater100",
                            "score": -1,
                            "created_utc": 1653134158.0,
                            "response": "I was poor but now I am rich by simply buying Bitcoin 6-7 years ago.\n\nMaybe your just not smart enough to get rich.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9gbwhg",
                                    "author": "sean488",
                                    "score": 1,
                                    "created_utc": 1653143464.0,
                                    "response": "Maybe you are lying and have no clue what being rich is.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9ge81x",
                                            "author": "MasterDebater100",
                                            "score": 1,
                                            "created_utc": 1653144552.0,
                                            "response": "lol sure",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9e3p99",
                    "author": "OpticallyMosache",
                    "score": 5,
                    "created_utc": 1653090185.0,
                    "response": "The amount of small holders (less than 10 BTC) buying BTC right now is at record highs. I don't think much retail selling is happening. We haven't capitulated. We're still buying the whales' dumpings.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ea92r",
                            "author": "FastFwdFrank",
                            "score": 7,
                            "created_utc": 1653093645.0,
                            "response": "Shrimp are bottom feeders. But their overall combined biomass is probably larger then that of all the whale's biomass. Harder to kill off all the shrip than it is to hunt whales to extinction.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9e65i2",
                    "author": "SmoothGoing",
                    "score": 2,
                    "created_utc": 1653091464.0,
                    "response": "Leaving the blockchain means you got zero, so wouldn't count towards any ratio.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9e70gw",
                            "author": "imthejoshT",
                            "score": 1,
                            "created_utc": 1653091917.0,
                            "response": "Yes, but smaller bag holders emptying their bags, to the whales. \n\nSurely someone or a group of people get to hold out the longest and own a majority. \n\nWhether that’s a country, philanthropist, or Dr Evil.\n\nThen it’s only valuable to that group of people or person? \n\nWhen the rest of the hodlers turn around and give up and say, you know what, it’s worthless now only a few people have it. Because they owned only tiny amounts in comparison.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9e8id8",
                                    "author": "SmoothGoing",
                                    "score": 4,
                                    "created_utc": 1653092714.0,
                                    "response": "You probably wouldn't want a coin where 90% of it is owned by 10 people. If almost no one wants it the whales will be stuck with something worth very little. So amassing insane amounts is not in anyone's best interests.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9eb3gv",
                                    "author": "BitcoinUser263895",
                                    "score": 3,
                                    "created_utc": 1653094097.0,
                                    "response": "> Surely someone or a group of people get to hold out the longest and own a majority.\n\nNo.\n\nThey distribute through time. You've got it all entirely backwards.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9fc16x",
                                            "author": "imthejoshT",
                                            "score": 1,
                                            "created_utc": 1653117298.0,
                                            "response": "Where’s the proof of that?\n\nIs it a definitive rule built into the blockchain that causes it to distribute over time? \n\nBecause if there isn’t, then it is still a possibility.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9e2ovi",
                    "author": "na3than",
                    "score": 3,
                    "created_utc": 1653089666.0,
                    "response": ">dip after dip, peoples hands get weaker.\n\nDo they? Evidence, please.\n\n>Non-whales selling to the whales every dip.\n\nDo they? Evidence, please.\n\n> non-whales leave the blockchain.\n\nDo they? Evidence, please.\n\n>Until several whales own more than 50%.\n\nYou claim this, but I think no more than one whale will ever own more than 50%.\n\n>Then whales start getting bought out and consolidated.\n\nWhy would that happen?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9e2zn2",
                            "author": "imthejoshT",
                            "score": 5,
                            "created_utc": 1653089819.0,
                            "response": "I’m asking what happens then. \n\nIsn’t that what happens with the stock market. Institutions who have been buying up for decades hoarding assets, just like real estate.\n\nSurely our generation is going to be hoarding Bitcoin in a similar fashion. We are the ones buying it up.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9ebf1o",
                                    "author": "BitcoinUser263895",
                                    "score": 1,
                                    "created_utc": 1653094269.0,
                                    "response": "> Surely our generation is going to be hoarding Bitcoin in a similar fashion. We are the ones buying it up.\n\nHal Finney was born in 1956.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9e3m2k",
                            "author": "rsa121717",
                            "score": 3,
                            "created_utc": 1653090141.0,
                            "response": "Its clearly a theoretical scenario that takes into account that retail investors tend to sell during market crashes while whales tend to accumulate. Evidence? Look at the largest wallets (>10 btc) and compare it to those with less than 1 btc whenever the market tanks",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9e46hj",
                                    "author": "imthejoshT",
                                    "score": 1,
                                    "created_utc": 1653090431.0,
                                    "response": "Thanks. \n\nYes exactly.\n\nIt is a question open to debate, I’m wanting to know what peoples thoughts are on this.\n\nWill it still have value at that point? \n\nWhat if it where to fork?\n\nWhat about spurious groups looking to double spend?\n\nI’m interested if anyone else has thought about it. Especially 20-30 years from now. \n\nI know no one can tell the future, but it’s good to think about it.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9febxa",
                                            "author": "robotsdev",
                                            "score": 2,
                                            "created_utc": 1653119347.0,
                                            "response": "Will it have value if elon musk buys up 50%? Who knows. But there's like only 10% of existing Bitcoin in exchanges. If someone bought that many, the price would be astronomical by that point.\n\nIf it were to fork? Same as always i assume. One fork wins, other fork might or might not survive. I'd sell the fork that i disagree with as fast as possible.\n\nDouble spend doesn't happen if the miners are working. Someone owning more than 51% of the miners would be a danger. But they'd be wasting their fortune if they tried to kill Bitcoin with that. \nMost miners are pools though, and there's a new (upcoming?) Fork? patch? Con n that will allow individual miners to vote whatever they want even while in big pools. Which can help with this problem.\n\nBut nobody knows, and the fact that BTC might go to 0 is part of what gives it value.   \nIt can go to 0 because it's decentralized.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9eb8vd",
                                    "author": "BitcoinUser263895",
                                    "score": 0,
                                    "created_utc": 1653094177.0,
                                    "response": "> Its clearly a theoretical scenario \n\nWhich is invalidated by the actual data.\n\n>  whales tend to accumulate\n\nand then later what happens?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9e2d52",
                    "author": "BLD7",
                    "score": 1,
                    "created_utc": 1653089496.0,
                    "response": "George soros will own all the Bitcoin. He is buying",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ea0wr",
                    "author": "mcintoshshowoff",
                    "score": 1,
                    "created_utc": 1653093526.0,
                    "response": "The end of Bitcoin or the rules change which will eventually defeat the entire purpose.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9eaxpo",
                    "author": "BitcoinUser263895",
                    "score": 1,
                    "created_utc": 1653094009.0,
                    "response": "> Whales pots are get bigger as non-whales leave the blockchain.\n\nOpposite is true.\n\n> Until several whales own more than 50%.\n\n3 of them? How many percents? :D\n\n> Then whales start getting bought out and consolidated.\n\nWhich is it, bought out or consolidated?\n\nThis reads like utter gibberish.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9fbfrz",
                            "author": "imthejoshT",
                            "score": 1,
                            "created_utc": 1653116778.0,
                            "response": "You are good at debating, you should continue doing it, you can clearly entertain other ideas for the sole purpose of a debate.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9fwrhj",
                    "author": "Shefpan",
                    "score": 1,
                    "created_utc": 1653135123.0,
                    "response": "One ring to rule them all!\n\nWe throw the whales into a volcano.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9efkqv",
                    "author": "d3vrandom",
                    "score": 0,
                    "created_utc": 1653096498.0,
                    "response": "Fatter whales are ripe for the slaughter.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9f96td",
                    "author": "0x1a3c3e7",
                    "score": 0,
                    "created_utc": 1653114874.0,
                    "response": "Nothing.  Bitcoin whales are just richer than everyone else, and they deserve it because they supported the network when nobody else would.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9fdzvq",
                            "author": "MrQ01",
                            "score": 0,
                            "created_utc": 1653119044.0,
                            "response": "In terms of deserving it, I dont think its that simplistic. Michael Saylor certainly wasnt supportive of it until quite late in the game (when compared to BTCs history).",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}