{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ta9734",
            "title": "Kraken CEO on Decision Not to Ban Russian Users",
            "url": "https://www.youtube.com/watch?v=tI5YsndByKU",
            "author": "Bitcoin__Hodler",
            "created_utc": 1646836716.0,
            "score": 84,
            "num_comments": 36,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "hzzouvc",
                    "author": "ubunt2",
                    "score": 20,
                    "created_utc": 1646844566.0,
                    "response": "good for him",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hzzxdtl",
                    "author": "EasywayScissors",
                    "score": 13,
                    "created_utc": 1646847803.0,
                    "response": "Kraken needs a .onion site; so they can't ban countries.\n\nThen we just have to lobby regulators to do away with KYC.\n\nOr we could, you know, use BitCoin as a currency rather than an investment.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i02wyhj",
                            "author": "li-_-il",
                            "score": 1,
                            "created_utc": 1646896818.0,
                            "response": "Centralized exchange is more than a website.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i03oua4",
                                    "author": "EasywayScissors",
                                    "score": 0,
                                    "created_utc": 1646917735.0,
                                    "response": "> a exchange is more than a website.\n\nAn exchange is just a website:\n\n- like amazon\n- or eBay\n\nI could be an ebay seller, selling you a Bitcoin at the current price.\n\nThe rest is just UI, and lots of data.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i049d09",
                                            "author": "backafterdeleting",
                                            "score": 2,
                                            "created_utc": 1646927063.0,
                                            "response": "There's also the payment method for the fiat side of the equation. Which is the part that cannot be sent via tor or any VPN.\n\nSame with Amazon, you can go there through a VPN in North Korea if you want but they aren't going to ship you the order.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i04lzsh",
                                                    "author": "li-_-il",
                                                    "score": 1,
                                                    "created_utc": 1646931995.0,
                                                    "response": "Yep, the only way is to have some kind of P2P payments or other payment provider who is potentially going risk some sanctions or going out of business after letting you in.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i04lqc9",
                                            "author": "li-_-il",
                                            "score": 1,
                                            "created_utc": 1646931894.0,
                                            "response": "If it's just a website, why don't you build one? Website are easy to build, I am sure you can get HTML after few hours of an online course. You can be another Amazon.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i00hi3c",
                    "author": "TitForSnack",
                    "score": 12,
                    "created_utc": 1646855752.0,
                    "response": "Imo you're an enemy of bitcoin if you don't want Russians using it.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i04u44k",
                            "author": "The_Estranger_0001",
                            "score": 0,
                            "created_utc": 1646935105.0,
                            "response": "If you continue to let Russian use it, politicians will start attacking you along with Bitcoin, which will put a big pressure on Bitcoin, which is not good for Bitcoin.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i05swwh",
                                    "author": "TitForSnack",
                                    "score": 1,
                                    "created_utc": 1646948730.0,
                                    "response": "If anyone has the power to decide who gets to use bitcoin, bitcoin has failed.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i08fqms",
                                            "author": "The_Estranger_0001",
                                            "score": 0,
                                            "created_utc": 1647002782.0,
                                            "response": "You cannot decide who can buy or use gold, but governments can put embargo on gold.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i08kbh9",
                                                    "author": "TitForSnack",
                                                    "score": 1,
                                                    "created_utc": 1647005285.0,
                                                    "response": "And that's why gold failed as the world reserve asset.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i08kydp",
                                                            "author": "The_Estranger_0001",
                                                            "score": 0,
                                                            "created_utc": 1647005619.0,
                                                            "response": "Gold is deemed to fail because of its immobility, low accessibility, and inability to breakdown like sats to name a few.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i08p8vr",
                                                                    "author": "TitForSnack",
                                                                    "score": 1,
                                                                    "created_utc": 1647007708.0,
                                                                    "response": "Which lead to centralisation and a permissioned system. The whole point of bitcoin is that it's permissionless. If you don't understand this, you don't understand bitcoin. If you are against this, you are against bitcoin.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i08qdqg",
                                                                            "author": "The_Estranger_0001",
                                                                            "score": 0,
                                                                            "created_utc": 1647008245.0,
                                                                            "response": "None of the properties I named is even remotely related to centralisation nor permission.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i0hjyaa",
                                                                                    "author": "TitForSnack",
                                                                                    "score": 0,
                                                                                    "created_utc": 1647176352.0,
                                                                                    "response": "Of course they do. You just haven't thought about them deeply enough.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i0ihmek",
                                                                                            "author": "The_Estranger_0001",
                                                                                            "score": 1,
                                                                                            "created_utc": 1647192358.0,
                                                                                            "response": "How? Can I pay for my snack without that convenience store’s permission? Can I pay for my burger without McDonald’s permission? When a company to reject you to use Bitcoin at their premises, why can’t a country reject you?\n\nI think it’s stupid for any country to ban Bitcoin, but they definitely can do so. Be real.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "id": "i08qq2o",
                                                                            "author": "The_Estranger_0001",
                                                                            "score": 0,
                                                                            "created_utc": 1647008400.0,
                                                                            "response": "On the other hand, how is gold centralised or permissioned? You can buy physical gold in many gold shops around the world without anyone’s permission.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i01ov21",
                    "author": "danda",
                    "score": 3,
                    "created_utc": 1646873348.0,
                    "response": "If they were doing it right, the quote would be:  Kraken cannot freeze accounts of our customers because our customers hold their own keys and we have no technical means to do so.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i03mfiz",
                            "author": "ModAlternate",
                            "score": 1,
                            "created_utc": 1646916384.0,
                            "response": "You know they run a crypto custody service for institutions/HNWI's, right? And that the CEO regularly tells ordinary folk on Twitter to move their coins off of exchanges.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i04ysil",
                                    "author": "danda",
                                    "score": 1,
                                    "created_utc": 1646936913.0,
                                    "response": "There's a reason I'm not a CEO of an exchange.\n\nI wrote exchange software in the early days.  I never launched it though because I decided it was not right to custody other's keys and the risk was too high.  If I were to be involved in such an endeavor it would have to be in a decentralized fashion, following bitcoin's lead.\n\nPeople make choices.  No one forced Kraken's CEO to be in that position.  Tweeting to \"get your coins off of exchanges\" is not the same as investing in and promoting decentralized exchange technology.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i00b2vb",
                    "author": "RN-Wingman",
                    "score": 4,
                    "created_utc": 1646853248.0,
                    "response": "… up next legal requirement to do so. 🤦‍♂️ damn it Kraken",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hzzcqpz",
                    "author": "mimblezimble",
                    "score": 5,
                    "created_utc": 1646839784.0,
                    "response": ">**\"global regulators\"**\n\nIn theory, there are only national regulators, as each country is supposed to be sovereign. However, the USA try to impose their regulations onto other countries in various ways.\n\nOne method consists in imposing \"sanctions\".\n\nRussia's survival as a sovereign nation now depends on their ability to thwart, undermine, bypass, and circumvent these sanctions as to render them ineffective. Russia is a sufficiently large economy that they will be able to do that, and solve the problem once and for all, for everyone else too.\n\nTherefore, I suspect that one important long-term consequence of the war in the Ukraine will be that the entire sanctions regime will totally collapse and become completely unusable.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hzzjac9",
                            "author": "sloaleks",
                            "score": -20,
                            "created_utc": 1646842403.0,
                            "response": "In your wet dreams. Russia is becoming a third world economy. Only fascist companies, like Kraken here, stil facilitate Russians with a way out.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hzzkmz4",
                                    "author": "spine99m1",
                                    "score": 15,
                                    "created_utc": 1646842933.0,
                                    "response": "\"if a company doesn't comply with government dictates proscribing particular ethnicities or nationalities they are fascist\"",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "hzzlh89",
                                            "author": "sloaleks",
                                            "score": -13,
                                            "created_utc": 1646843261.0,
                                            "response": "A company is fascist more beacuse of facilitating the citizens of a fascist country (of which a lot of them openly endorse the war against a peaceful nation) with a workaround of international sanctions against them. Better now?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i00d5s1",
                                                    "author": "GhostLooper",
                                                    "score": 7,
                                                    "created_utc": 1646854050.0,
                                                    "response": "Hahahaha.  Just stop.  You are making a fool out of yourself.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i00xg9k",
                                                            "author": "sloaleks",
                                                            "score": -3,
                                                            "created_utc": 1646861879.0,
                                                            "response": "Salty your loops dropped 3x, are you ...",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "hzzopa0",
                                                    "author": "50mm-f2",
                                                    "score": 3,
                                                    "created_utc": 1646844508.0,
                                                    "response": "bitcoin is the workaround",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i02r7qp",
                            "author": "NearbyTurnover",
                            "score": 0,
                            "created_utc": 1646892750.0,
                            "response": "Or you know, they can just fuxk right off Ukraine. Donbas and Crimera belongs to Ukraine.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i04d8ak",
                    "author": "MultipleOgres",
                    "score": 1,
                    "created_utc": 1646928608.0,
                    "response": "He should have left it at \"the underlying idea of bitcoin is to be non-discriminatory regardless of aliegances and nationalities, as opposed to standard financial institution\". But the moment he went into cheap \"Not all Russians\" and \"US does  the same\" he showed lack of fundamental understanding of the Urkaininan conflict. Wel, I guess business is booming and he is not obliged to care.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "urolxh",
            "title": "Tax tools aren't easy to use as they claim",
            "url": "https://www.reddit.com/r/Bitcoin/comments/urolxh/tax_tools_arent_easy_to_use_as_they_claim/",
            "author": "muttoutpickety",
            "created_utc": 1652800287.0,
            "score": 77,
            "num_comments": 74,
            "subreddit": "Bitcoin",
            "selftext": " Hi Everyone, I’m sharing my experience and maybe it could help you with your taxes. I’ did my taxes by using Cointelli. But one thing got me really upset. Every crypto tool claims that it’s easy to use but it’s not the truth. I used CoinTracker and TaxBit before moving on to Cointelli. Both tools were calculating my gains differently. That was really frustrating. I was asking for recommendations from my friends and one of my colleagues suggested I should try Cointelli. I did research about it before jumping into it. I was hesitant to use it because I’d never heard of it before. I shared the problems via e-mail that I was facing with other tools about how they can help me with that. I was impressed when Cointelli’s cofounder responded to me and then I got to know that actually, he is the one who directly deals with customers' issues. He guided me through it (I’m not sharing the details it could get boring). I used it for free to see if I can get my calculations right. And luckily I did ad then I bought their package to download my report. \n\nIt was a roller coaster ride but finally, it’s over. Hope it could help you guys next season. Which tool do you find the best, share your thoughts? I want to see if there’s a better option than Cointelli. I would love to explore.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8yenwk",
                    "author": "Ok-Imagination-7014",
                    "score": 18,
                    "created_utc": 1652800812.0,
                    "response": "Koinly is the best in my opinion",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8yt168",
                            "author": "yolodogewtf",
                            "score": 5,
                            "created_utc": 1652806688.0,
                            "response": "Facts \n\nIt’s all annoying, but they are the best",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8zjokz",
                                    "author": "muttoutpickety",
                                    "score": 1,
                                    "created_utc": 1652817517.0,
                                    "response": "yes, they are except Cointelli and Koinly. That's what I've found so far.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9064uz",
                                            "author": "Wsemenske",
                                            "score": 1,
                                            "created_utc": 1652827178.0,
                                            "response": "I wouldn't use Cointelli, Koinly was much better",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i91ogzo",
                                                    "author": "graham0125et",
                                                    "score": 1,
                                                    "created_utc": 1652857010.0,
                                                    "response": "Koinly is really that good as people are telling or some catch in there.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9254am",
                                                            "author": "imthebubbleboy",
                                                            "score": 1,
                                                            "created_utc": 1652871673.0,
                                                            "response": "no catch, its just how it is. IDK, they all seem to claim the same, but Koinly wins",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i93j38m",
                                            "author": "leoqa",
                                            "score": 1,
                                            "created_utc": 1652895009.0,
                                            "response": "After hearing all the positive feedback, lemme check if they are good.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i92aagh",
                            "author": "bloodilyAgitate72",
                            "score": 1,
                            "created_utc": 1652875076.0,
                            "response": "For how long you are using this? Does it work on the every exchange?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i92c6f0",
                                    "author": "Ok-Imagination-7014",
                                    "score": 1,
                                    "created_utc": 1652876189.0,
                                    "response": "I used it last tax season, used it with coinbase, CBP, and ledger.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8ygn8f",
                    "author": "Successful-Driver722",
                    "score": 6,
                    "created_utc": 1652801637.0,
                    "response": "Without a doubt Koinly has the most user friendly interface I've used (works brilliantly as a portfolio tracker as well).  \nThe different coin values are par for the course with crypto tax software.  \nWe have to do a little bit of work for our profits!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8yij8r",
                            "author": "muttoutpickety",
                            "score": 2,
                            "created_utc": 1652802414.0,
                            "response": "Every other person suggests Koinly. I think it's time for me to try it out. The tool that I used also worked like Koinly and has the same price package.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8yjc9z",
                                    "author": "Successful-Driver722",
                                    "score": 3,
                                    "created_utc": 1652802745.0,
                                    "response": "Give it a crack. Costs nothing until you want that tax report.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i92ldg9",
                                    "author": "lambdatrader",
                                    "score": 1,
                                    "created_utc": 1652880918.0,
                                    "response": "You just pick my world, after hearing all that suggestion i am also thinking to shift myself into this.\n\nI used Taxbit in the past, and that gives me the headache and never used that again.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i929svg",
                            "author": "ssteinborn",
                            "score": 1,
                            "created_utc": 1652874778.0,
                            "response": "True, the interface and the usability of that is very user friendly.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8yg7ri",
                    "author": "thescheit",
                    "score": 3,
                    "created_utc": 1652801457.0,
                    "response": "Bitcoin.tax hands down.  It allows easy direct importing of all accounts and wallets to easily calculate your ins and outs. It also allows you to choose your cost basis calculations to give you the best tax advantage. It then generates a completed form 8949 for easy reporting on your taxes.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i90np6t",
                            "author": "y90210",
                            "score": 2,
                            "created_utc": 1652835535.0,
                            "response": "I've been using this since 2017, no problems so far.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i92ump9",
                                    "author": "ninlempis",
                                    "score": 1,
                                    "created_utc": 1652885058.0,
                                    "response": "What are the charges? Is there any demo version of that is well?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i92xaia",
                                            "author": "y90210",
                                            "score": 1,
                                            "created_utc": 1652886167.0,
                                            "response": "Free to use for a certain amount of transactions. The fee above that is 39 or 49 bucks.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i932vcw",
                            "author": "zrqmars",
                            "score": 1,
                            "created_utc": 1652888460.0,
                            "response": "So this is just for the bitcoin or can used for any other coins is well?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8yyukn",
                    "author": "qualifiedtempo021",
                    "score": 2,
                    "created_utc": 1652809027.0,
                    "response": " I never heard of this tool before.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8yzygq",
                            "author": "nehruulto6",
                            "score": 1,
                            "created_utc": 1652809464.0,
                            "response": "I did a quick research on it. They started providing their services this year. So, they are new in the market.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i91w4qi",
                                    "author": "318318dsdsd",
                                    "score": 1,
                                    "created_utc": 1652863977.0,
                                    "response": "So, are they offering some sort of the discount is well for their software?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8z7md6",
                    "author": "HulaDulaHouseRula",
                    "score": 2,
                    "created_utc": 1652812571.0,
                    "response": "I too have tried many crypto tax software, and I gotta say, Koinly was my fav. The reasons I say this is because:\n\n\\- The interface is very easy to use compared to software such as TaxBit and Zenledger\n\n\\- The support system is fast to reply, and has helped me get through any questions I had. Also, has a lot of blogs to support your understanding of everything in regard to crypto taxes\n\n\\- Supports the widest range of exchanges\n\n\\- Easiest imports with the least amount of errors\n\nHope this helps",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i91paot",
                            "author": "amcsyssv",
                            "score": 4,
                            "created_utc": 1652857704.0,
                            "response": "I never used the Koinly but this is one the most recommend here.\n\nSo i have decide to give it a shot and let's see, if he really that's good like what people talking about him.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8zcnm7",
                    "author": "Flaky-Pace-9914",
                    "score": 2,
                    "created_utc": 1652814630.0,
                    "response": "I've been using Koinly as my crypto tax software. Although it's not perfect, it has been very helpful for my taxes. It enables the direct import of all integrations and wallets, allowing the users calculate your gains and losses.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i92e4mu",
                            "author": "makubis",
                            "score": 1,
                            "created_utc": 1652877272.0,
                            "response": "I think there is no software at the current date that is perfect for the crypto tax calculation.\n\nEveryone has some sort of the flaws, we just need to figure out what will be best for us.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8zet7k",
                    "author": "SilentMaster",
                    "score": 2,
                    "created_utc": 1652815507.0,
                    "response": "I've spent the last two Januaries prepping reports for my accountant.  It's not even remotely easy.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i92txrp",
                            "author": "Teirce",
                            "score": 1,
                            "created_utc": 1652884764.0,
                            "response": "I can't think how much time you would have spent for that.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8ygag6",
                    "author": "redhtbassplyr",
                    "score": 1,
                    "created_utc": 1652801489.0,
                    "response": "I just send over all my 1099 csv and pdfs reports to my CPA. Pay her $550 for her troubles and let her deal with it. $550 well spent to save my time & my stress. No clue if she uses anything or calculates everything manually",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8ygxl9",
                            "author": "muttoutpickety",
                            "score": 1,
                            "created_utc": 1652801755.0,
                            "response": "Isn't it expensive as compare to tools? What's the guarantee that CPA will not do any mistake.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8yhzvw",
                                    "author": "redhtbassplyr",
                                    "score": 3,
                                    "created_utc": 1652802193.0,
                                    "response": ">Isn't it expensive as compare to tools?\n\nYes but the difference is I'm not doing it. I just send her w-2s and all of our income stuff, All of my retirement accounts and stock sales, and then crypto on top of that. It would probably take me 2-4 hours at least to do my taxes myself with all I have and even then I wouldn't have confidence that I wasn't messing something up. She also is finding me tax loopholes as much as possible and finding write offs for me and reducing my tax burden overall. \n\n$550 so I don't have 4 hours worth of work is well worth the price for me. \n\n>What's the guarantee that CPA will not do any mistake.\n\nI have a contract with her that as long as I do not falsify records and as long as I give her everything that I know exists, she provides audit protection and her firm will come out of pocket for any damages or mistakes she makes while filing.\n\nGot my taxes back probably three or four weeks ago now. No issues no mistakes FYI. Easy peasy",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8yi9bn",
                                            "author": "muttoutpickety",
                                            "score": 1,
                                            "created_utc": 1652802301.0,
                                            "response": "That sounds good. But not everyone can afford CPA.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8yj73s",
                                                    "author": "redhtbassplyr",
                                                    "score": 1,
                                                    "created_utc": 1652802686.0,
                                                    "response": "True, for one that $550 just comes out of my return so it's not like I'm having to cough up any money tomorrow actually. Also if you don't have as much activity on cryptocurrency, stocks or what have you then your taxes are simpler anyways so you wouldn't necessarily need a CPA. \n\nI just assumed that you were needing a cryptocurrency tax program because you were making a lot of cryptocurrency moves and therefore had a bunch of capital gains as well. I always try to account for my tax burden for the next year which includes my tax preparation fees when I'm deciding if I'm using any money from my capital gains in the first place. Basically remember to set aside money for Uncle Sam when you make any sales. CPA fee is the cost of doing business, but yeah $550 isn't anything I'm missing relative to my income.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8yjrnv",
                                                            "author": "muttoutpickety",
                                                            "score": 2,
                                                            "created_utc": 1652802918.0,
                                                            "response": "You are right.  But in my case, I had a lot of different exchanges and also I did my taxes by my own. It was difficult. I wasted a lot of time on trying different tools before trying the cointelli.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i92y48r",
                                                                    "author": "omadammiak",
                                                                    "score": 1,
                                                                    "created_utc": 1652886509.0,
                                                                    "response": "It's very hard to calculate or doing this manually if you are using the different different coins on the different different exchanges.\n\nI tried just for my one month trading and trust me it wasn't that easy.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "i9264i5",
                                                            "author": "biostitu",
                                                            "score": 2,
                                                            "created_utc": 1652872376.0,
                                                            "response": "I am doing less trade and so far keeping the entry at the manually.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i935y42",
                                                    "author": "xiong_dn",
                                                    "score": 1,
                                                    "created_utc": 1652889713.0,
                                                    "response": "Yes, for me it's like my whole portfolio at the current time.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i91pxda",
                                    "author": "javico88",
                                    "score": 1,
                                    "created_utc": 1652858265.0,
                                    "response": "My whole profit sometime is not that big, so i am not see that.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9381vb",
                                            "author": "redhtbassplyr",
                                            "score": 1,
                                            "created_utc": 1652890582.0,
                                            "response": "Yea that's understandable. I had $48k in just crypto capital gains that I had to report for last year so in my case it made a lot more sense to hire someone. Plus then I had my stock capital gains and my income on top of that so $550 makes a lot more sense given that",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i92adwg",
                            "author": "ViperX7777",
                            "score": 1,
                            "created_utc": 1652875134.0,
                            "response": "550$ yearly or the fee for the one time? Either way looking very expansive.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i92c53r",
                                    "author": "redhtbassplyr",
                                    "score": 1,
                                    "created_utc": 1652876168.0,
                                    "response": "Yearly, but that's for my business and personal combined. Plus the first year that I used her I had already started the file on TurboTax and then hit a road block. She took over and the return increased by $3k, so the fee more than pays for itself. Also at my income level $550 is more than benign",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8yhg8g",
                    "author": "prodelta_lol",
                    "score": 1,
                    "created_utc": 1652801969.0,
                    "response": "Great. That seems like they really care about their customers.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8yjv3g",
                            "author": "muttoutpickety",
                            "score": 1,
                            "created_utc": 1652802958.0,
                            "response": "Yeah, they do.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i92ae5o",
                                    "author": "pecealino",
                                    "score": 4,
                                    "created_utc": 1652875138.0,
                                    "response": "For how long you have been using? or many other thing i need to keep in mind?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i91t79o",
                            "author": "jshouhbsb5",
                            "score": 1,
                            "created_utc": 1652861209.0,
                            "response": "Hard find something that genuine in these times, lemme look into them.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8yl06o",
                    "author": "quiet_outdoors",
                    "score": 1,
                    "created_utc": 1652803431.0,
                    "response": "Sounds good. Is it easy to use?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8yn8f6",
                            "author": "muttoutpickety",
                            "score": 1,
                            "created_utc": 1652804362.0,
                            "response": "Yes, it is. You have to connect your wallets and exchanges or you can manually upload a CSV of your trade history. Your transaction history will be available. If you see any error, fix it manually, and you can simply download it. They have more than 100 options for exchanges, check it out before using if they cover your exchange.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8yph3k",
                                    "author": "Pagmanhyper",
                                    "score": 1,
                                    "created_utc": 1652805261.0,
                                    "response": "That doesn't sound complicated at all. But there are other tools too that are really great and reliable. Like Koinly is one of them. I have used it personally and the experience has been great.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i91rc2l",
                                            "author": "tttrrr356",
                                            "score": 1,
                                            "created_utc": 1652859507.0,
                                            "response": "After all the comment i have seen now i am confused which one should i try.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i92n5v5",
                                                    "author": "EducationalYou",
                                                    "score": 1,
                                                    "created_utc": 1652881757.0,
                                                    "response": "def Koinly. free to try out!",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i8ywicb",
                                    "author": "daringstoryteller70",
                                    "score": 1,
                                    "created_utc": 1652808087.0,
                                    "response": "Can you tell me it’s price range?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8za6ui",
                                            "author": "muttoutpickety",
                                            "score": 5,
                                            "created_utc": 1652813624.0,
                                            "response": "It’s really affordable. You can [here](https://cointelli.com/pricing) for more details.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i922elw",
                                            "author": "zhou010010",
                                            "score": 1,
                                            "created_utc": 1652869586.0,
                                            "response": "For me it's the user interface and the accuracy matter the most.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8yoppb",
                    "author": "senfmeister",
                    "score": 1,
                    "created_utc": 1652804956.0,
                    "response": "I just use Google Sheets.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i91tzym",
                            "author": "WarmPlevna178",
                            "score": 1,
                            "created_utc": 1652861949.0,
                            "response": "How much time we need to give it to get the actual outcome?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8ypzcc",
                    "author": "4meat",
                    "score": 1,
                    "created_utc": 1652805462.0,
                    "response": "TurboTax has a feature to import your trade data directly from your broker or exchange.  It seemed to work perfect for me and was included in the price.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i92m9vp",
                            "author": "maherbabsail",
                            "score": 1,
                            "created_utc": 1652881345.0,
                            "response": "Does it work something like pancake or not? I am doing some trading on them is well.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8yte26",
                    "author": "Skaiashes",
                    "score": 1,
                    "created_utc": 1652806829.0,
                    "response": " Depends on experience. I used CoinTracker. It didn't create trouble for me at all. So, I don’t think I’m switching it in the future.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i93hzx8",
                            "author": "azatbinici",
                            "score": 1,
                            "created_utc": 1652894567.0,
                            "response": "Yes i use them in past the only problem i faced that time was the UI.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8yxoei",
                            "author": "Melanynavfam",
                            "score": 1,
                            "created_utc": 1652808550.0,
                            "response": "Yes, Agreed. Everyone has a different experience. But I think it didn't hurt to have other options in case something doesn't go well.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i91wng2",
                                    "author": "AcidPhrost",
                                    "score": 1,
                                    "created_utc": 1652864464.0,
                                    "response": "Yes, we always need to keep the option under our sleeves.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8zmmgq",
                    "author": "BtcKing1111",
                    "score": 1,
                    "created_utc": 1652818735.0,
                    "response": "I used koinly.io this year to clean-up and organize 4 years worth of transactions across multiple exchanges (some with really shit accounting that I had to import manually). \n\nIt is amazing, saved me tens of hours. It even converted all transactions to my local currency from various buy/sell currencies.\n\nYou can change accounting settings based on your country's tax requirements, great if you live in Europe. ie. In Poland you don't pay capital gains when trading between cryptos, so you can disable that feature.\n\nNext year is going to be much easier since I only use Kraken now, and importing from Kraken is clean and accurate.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i920rah",
                            "author": "huyec196",
                            "score": 1,
                            "created_utc": 1652868203.0,
                            "response": "I haven't done any reporting, but i am getting some really good reference in here.\n\nFor me so far, koinly and cointracker are the ones that is looking good,  lemme do some more research.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i90ig4g",
                    "author": "III1IIIIIII1IIIIII1I",
                    "score": 1,
                    "created_utc": 1652833075.0,
                    "response": "I’ve tried various tax data gathering services like Koinly and Cointracker, etc., but unfortunately none of them consistently import all data.\n\nIt’s nice when they use API access, but when it comes to importing CSVs there seems to be no consistent format— the brokers and exchanges often use a random format for CSV columns and data, and all of that needs to be reformatted before they can be processed by the tax data sites.\n\nEdit: punctuation",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i91xwbo",
                            "author": "Howeverconnect",
                            "score": 1,
                            "created_utc": 1652865627.0,
                            "response": "The only problem i am getting is the consistent accuracy with these apps.\n\nI can do some calculation or can deal with the UI but for me accuracy that matter the most in the end.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i90ytj2",
                    "author": "blaze1234",
                    "score": 1,
                    "created_utc": 1652840781.0,
                    "response": "Track all your transactions in Quicken.\n\nNever rely on the FIs",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i91qycm",
                            "author": "markapapa",
                            "score": 1,
                            "created_utc": 1652859162.0,
                            "response": "What is the price cost of them? First time hearing about them.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i926lsv",
                                    "author": "blaze1234",
                                    "score": 1,
                                    "created_utc": 1652872712.0,
                                    "response": "Premier $70/yr",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i91p0li",
                    "author": "canaldolulis",
                    "score": 1,
                    "created_utc": 1652857462.0,
                    "response": "the one i'm using is cryptotaxcalculator - not perfect, but 100% saved me some mental turmoil",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i91puww",
                    "author": "NYKNYb",
                    "score": 1,
                    "created_utc": 1652858202.0,
                    "response": "You're the tool if you trade and pay taxes.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i920fjf",
                    "author": "waxminer",
                    "score": 1,
                    "created_utc": 1652867920.0,
                    "response": "Hard to get any good single software mate, i am still searching for one.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i92mwub",
                    "author": "EducationalYou",
                    "score": 1,
                    "created_utc": 1652881642.0,
                    "response": "I as well tried many and hands down Koinly is best. Not perfect, no software is, but the UI is great, handled all my exchanges with very few errors, and not pricey. They also have a bomb [blog](https://koinly.io/guides/) with tax guides that are regularly updated. I use it often.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9376ik",
                    "author": "FuzzyPeaches19",
                    "score": 1,
                    "created_utc": 1652890222.0,
                    "response": "Totally agree with people boosting software's, scrolling through reddit you'd think all of them are 10/10. Reality is they all work a little different and will all come with their own unique hurdles. My go too ended up being Koinly in the end for the reason that with every issue I encountered I seemed to effortlessly find a walkthrough guide on their site on how to fix said issue. Walkthrough articles and YouTube videos like the one below are what helped a beginner like myself confidently manage through my taxes. I think any software claiming you will be issue free is lying because of all the more complex ways people are investing now a days but having resources imo is the real key to these calculators and Koinly has one for pretty much anything \n\n[https://help.koinly.io/en/articles/3662963-how-to-import-data-from-crypto-exchanges-services](https://help.koinly.io/en/articles/3662963-how-to-import-data-from-crypto-exchanges-services) \n\n[https://koinly.io/blog/crypto-gambling-tax/](https://koinly.io/blog/crypto-gambling-tax/)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93gn81",
                    "author": "Flaky-Pace-9914",
                    "score": 1,
                    "created_utc": 1652894022.0,
                    "response": "There's no perfect software out there, you'll eventually encounter problem at some point but in my case I've been using Koinly for my taxes and it helped my do all my taxes at all times. It's not perfect but has been very useful since I joined in Crypto world.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}