{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uq2th0",
            "title": "Of this happens, would bitcoin fly?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uq2th0/of_this_happens_would_bitcoin_fly/",
            "author": "purplemoccies",
            "created_utc": 1652608657.0,
            "score": 3,
            "num_comments": 19,
            "subreddit": "Bitcoin",
            "selftext": "So rumers are circulating that Putin has some sort of cancer and that the only way for Russia to save face with the war on Ukraine is for him to be deposed/ dispose of. Russian oligarchs could then move to end sanctions saying it was all him, wasn't us, and let's get on with making money again. If this was to happen, and for WW3 to be no longer imminently possible, would the following positive sentiment drive Bitcoin to finally achieve the 2021 goal of 100k? Quickly? \nAsking for a friend living on 2 minute noodles.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8oihd0",
                    "author": "BookMobil3",
                    "score": 9,
                    "created_utc": 1652610102.0,
                    "response": "Only people looking to paperhand their holdings should be rooting for it to moon. Stackers should be rooting for it not too. I hope your asking for stacking purposes but you should always only buy more with money you don’t think you need to spend in the next 2-10yrs",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8osl9j",
                            "author": "Otowner98",
                            "score": 3,
                            "created_utc": 1652617536.0,
                            "response": "Bingo.  Also why I don’t want a spot ETF in the US, as all that pension/401k money might moon it.  \n\nI am loving the bargain buying & need more time.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8olcgd",
                    "author": "registered-username",
                    "score": 4,
                    "created_utc": 1652612481.0,
                    "response": "Pro tip: drop some egg on that ramen for additional nutrients 😉👍, thoughts and prayers to you fellow bitcoiner.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ohb9z",
                    "author": "solomonsatoshi",
                    "score": 4,
                    "created_utc": 1652609096.0,
                    "response": "Putin is a dead man walking.\n\nHe will be gone by the end of the month...I guarantee it.\n\nNo guarantees about BTC price relative to USD.\n\nTry rice and beans for dietary variety.\n\nZoooom out the big picture as always is ----\n\nUSD vs DCEP vs BTC",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8olxpn",
                            "author": "makito_burgerito",
                            "score": 3,
                            "created_utc": 1652612942.0,
                            "response": "At least good old Joe looks healthy AF",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "uqbg8d",
            "title": "9 years ago, May 15th 2013, the US authorities seized accounts associated with Mt. Gox after discovering that it had not registered as a money transmitter with FinCEN in the US. NOT YOUR KEYS, NOT YOUR SATS!",
            "url": "https://www.reuters.com/article/us-bitcoin-accounts-idUKBRE94G0LS20130517",
            "author": "CoinCorner_Sam",
            "created_utc": 1652637131.0,
            "score": 9,
            "num_comments": 5,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8pz991",
                    "author": "coinfeeds-bot",
                    "score": 3,
                    "created_utc": 1652637603.0,
                    "response": "tldr; US authorities have seized two accounts linked to Tokyo-based Bitcoin exchange Mt. Gox. The move may prevent the firm from facilitating the purchase and sale of Bitcoins in US dollars at a time when use of the currency has mushroomed. Authorities worry that a lack of regulation has left Bitcoin vulnerable to money launderers and other criminals.\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR.*",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}