{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uvj9y4",
            "title": "Ledger Hack",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uvj9y4/ledger_hack/",
            "author": "EyesFor1",
            "created_utc": 1653250810.0,
            "score": 2,
            "num_comments": 15,
            "subreddit": "Bitcoin",
            "selftext": "So I've seen a few post recently from people claiming to have had their ledgers hacked and crypto stolen. They always claim the seed was not compromised....is this possible ? Can a Ledger or any other Hardware wallet be hacked ?",
            "stickied": false,
            "comments": [
                {
                    "id": "i9lr3wh",
                    "author": "dan_geles",
                    "score": 16,
                    "created_utc": 1653251034.0,
                    "response": "I am guessing these people are some sort of scammers TBH.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9lrc1e",
                            "author": "dan_geles",
                            "score": 3,
                            "created_utc": 1653251140.0,
                            "response": "But to answer your question I don’t think you can hack a cold wallet without the seed phrases",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9lswav",
                                    "author": "EyesFor1",
                                    "score": 3,
                                    "created_utc": 1653251860.0,
                                    "response": "Exactly, I don't think guessing a 24 word seed phrase in the correct order is remotely possible either.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9lvfi0",
                                            "author": "Main_Sergeant_40",
                                            "score": 4,
                                            "created_utc": 1653253019.0,
                                            "response": "I saw a post on probability of guessing it once and it was virtually impossible",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9lr977",
                    "author": "Knurlinger",
                    "score": 3,
                    "created_utc": 1653251103.0,
                    "response": "You can sign malicious contracts. But that’s it. 95% it’s their seed which has been exposed. So far ledger / STMicro secure elements haven’t been hacked.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9lreas",
                            "author": "EyesFor1",
                            "score": 1,
                            "created_utc": 1653251170.0,
                            "response": "Can you elaborate when you say sign malicious contracts.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9lrh6x",
                                    "author": "Knurlinger",
                                    "score": 3,
                                    "created_utc": 1653251207.0,
                                    "response": "Can’t happen with BTC ;)",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9lsqvk",
                                            "author": "EyesFor1",
                                            "score": 2,
                                            "created_utc": 1653251792.0,
                                            "response": "hahah",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9lzykn",
                                    "author": "deviantgoober",
                                    "score": 2,
                                    "created_utc": 1653255128.0,
                                    "response": "Smart contracts are just code... they can be written to be malicious and steal crypto/tokens from your wallet when you give it permission via signing (approving) a transaction.\n\nA hardware wallet doesnt necessary prevent this type of attack, what it does is prevent the autosigning of such transactions when the software wallet side or computer side is compromised by a virus by forcing that approval to happen on the hardware wallet instead and thus acts as a 2FA for transaction signing (in addition to its base function of protecting the seed phrase from being accessed by any means).\n\nSo the vulnerability is still the individual.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9m3zrc",
                    "author": "Thanis_in_Eve",
                    "score": 3,
                    "created_utc": 1653257048.0,
                    "response": "Generally you don't let the victim do the post-mortem. \n\nWhen I see these posts, and the explanation, it isn't difficult for me to imagine their ignorance being the root cause of the loss.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9mlruu",
                    "author": "Hectic-Mind",
                    "score": 1,
                    "created_utc": 1653266212.0,
                    "response": "Some people have expressed concerns that the development of quantum mechanics will allow hardware wallets to be hacked in the future. Anyone have anything to add to this?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9mtv6e",
                            "author": "GLCstaked",
                            "score": 1,
                            "created_utc": 1653270323.0,
                            "response": "Not just hardware wallets, any wallet. But in that world bitcoin is the least of our worries, every password to every online account would be susceptible, all banking, nuclear launch codes... ect.\n\nBitcoin will have to update to quantum resistant algorithms, and despite its slow development i'm confident it will do this faster than many legacy institutions.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9lyly1",
                    "author": "arbalest_22",
                    "score": 1,
                    "created_utc": 1653254483.0,
                    "response": "If you have access to the device, MAYBE, otherwise? No. The people who got “hacked” mishandled their seed phrase somehow or did something stupid like every other person that got “hacked”. It’s bullshit or a scam. Ledger is perfectly secure.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9mlv14",
                            "author": "Hectic-Mind",
                            "score": 3,
                            "created_utc": 1653266259.0,
                            "response": "Probably stored their seed phrase in Google docs lol.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9m1ulj",
                    "author": "Scrapin-Nee",
                    "score": 1,
                    "created_utc": 1653256029.0,
                    "response": "Could potentially happen if it’s a fake ledger with a private key already prerecorded by the seller. That’s why it’s best to purchase directly from Ledger. Real Ledger products do a self check when first setting up to confirm authenticity. I assume this feature was added because of fake copycats.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}