{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uz9opi",
            "title": "Bitcoin is DED with Knoxville Bitcoin Network - State of Bitcoin Ep. 23",
            "url": "https://youtu.be/O1y-4kNuUks",
            "author": "Fit_Rooster2702",
            "created_utc": 1653691064.0,
            "score": 0,
            "num_comments": 1,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "ia8zbb6",
                    "author": "EE214_Verilog",
                    "score": 1,
                    "created_utc": 1653691450.0,
                    "response": "Who dafuq is this guy?",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uz9myw",
            "title": "Newbie question",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uz9myw/newbie_question/",
            "author": "Actual_Direction_599",
            "created_utc": 1653690913.0,
            "score": 2,
            "num_comments": 27,
            "subreddit": "Bitcoin",
            "selftext": "I saw an option to pay with Bitcoin and the site mentioned that only Bitcoin BTC Network payments are accepted, not “Layer-2 transfers” and lists “SegWit” as an example.  How can I know if the wallet I chose is BTC Network and not “Layer-2”?\n\nSorry if this question isn’t allowed.\n\nEdit: corrected the name of type of transfer not accepted.",
            "stickied": false,
            "comments": [
                {
                    "id": "ia92czc",
                    "author": "BitcoinUser263895",
                    "score": 4,
                    "created_utc": 1653692976.0,
                    "response": "What you witnessed is a bcash bagholder or worse scammer trying to tell you that Bitcoin isn't Bitcoin. They want to sell you the bags they hold in an insecure minority fork.\n\nMany people were caught by this scam years ago and some refuse to accept that they were scammed.\n\n>  the site mentioned \n\nWhich site?  Don't link it, but what domain?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia95g1o",
                            "author": "Actual_Direction_599",
                            "score": -1,
                            "created_utc": 1653694543.0,
                            "response": "They’re actually a payment site, as to pay for services.  They’re not trying to sell me any crypto.  Rather, just telling me to send a specific amount of Bitcoin (0.001030 BTC, or $30) so I can pay a merchant and access a service.  The page contains a QR code which I would have to scan on the wallet app, I guess.\n\nAnyway, I’m wary now.  Any further info would be appreciated.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia9jmps",
                                    "author": "igadjeed",
                                    "score": 4,
                                    "created_utc": 1653702015.0,
                                    "response": ">  Any further info\n\nYou're avoiding the question. What domain?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia8yme9",
                    "author": "SmoothGoing",
                    "score": 3,
                    "created_utc": 1653691109.0,
                    "response": "There are no levels. And only one network.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia8zetb",
                            "author": "Actual_Direction_599",
                            "score": 1,
                            "created_utc": 1653691499.0,
                            "response": "Sorry.  It actually says “Layer-2 transfers” and lists “SegWit” as an example.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia92hpr",
                                    "author": "BitcoinUser263895",
                                    "score": 7,
                                    "created_utc": 1653693042.0,
                                    "response": "They're bullshitting you. Trying to say that SegWit isn't Bitcoin and that you need to buy their forked bcash chain.\n\nClose the site and never visit it again.\n\nGet a reputable Bitcoin wallet.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia94rzr",
                                            "author": "Actual_Direction_599",
                                            "score": 1,
                                            "created_utc": 1653694203.0,
                                            "response": "Thanks!",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia8yywf",
                    "author": "ranamok",
                    "score": 1,
                    "created_utc": 1653691279.0,
                    "response": "I suspect what you mean is layer two. Bitcoin is a (the) layer one protocol. Protocols like Lightning or Liquid are a layer two. Layer 2s operate on top of Bitcoin, enabling faster, cheaper and smaller transactions, arguably at a marginal cost of security/centralization). It still uses the Bitcoin blockchain for final settlement.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia8zvo5",
                            "author": "Actual_Direction_599",
                            "score": 1,
                            "created_utc": 1653691732.0,
                            "response": "Correct. It actually is “Layer-2 transfers” which the site says it does not accept.  \n\nAny way to know if the wallet I chose is “Layer-2”?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia90pr0",
                                    "author": "DatBuridansAss",
                                    "score": 3,
                                    "created_utc": 1653692143.0,
                                    "response": "Just avoid any lightning wallets for that transaction. At least 9/10 popular choices would be fine. Try electrum. Bitcoin green if you're on mobile.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia92o5g",
                                            "author": "BitcoinUser263895",
                                            "score": 3,
                                            "created_utc": 1653693131.0,
                                            "response": "> Just avoid any lightning wallets for that transaction. \n\nThey're bcash bagholders selling OP \"SegWit Coin\" bullshit.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia94uzs",
                                                    "author": "Actual_Direction_599",
                                                    "score": 1,
                                                    "created_utc": 1653694244.0,
                                                    "response": "Thanks!",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "ia94mr8",
                                            "author": "savinelli_smoker",
                                            "score": 3,
                                            "created_utc": 1653694130.0,
                                            "response": "Sounds like they aren’t even bitcoiners, they are the b-cashers. If they say “base layer bitcoin only, no lightning yet” then yeah that’s bitcoin. But “no layer 2 or Segwit” that’s b-cash man. Be careful.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia94wiz",
                                                    "author": "Actual_Direction_599",
                                                    "score": 1,
                                                    "created_utc": 1653694266.0,
                                                    "response": "Thanks! I’ll have to watch some YouTube videos to understand some of these terms.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "ia9838e",
                                                            "author": "BitcoinUser263895",
                                                            "score": 1,
                                                            "created_utc": 1653695911.0,
                                                            "response": "> ’ll have to watch some YouTube videos to understand some of these terms.\n\nYou'll only find historical bullshit and propaganda, especially on youtube. Best bet is to just ignore the whole fiasco.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "ia9a6jp",
                                                                    "author": "Actual_Direction_599",
                                                                    "score": 1,
                                                                    "created_utc": 1653697001.0,
                                                                    "response": ":/ So I checked the other crypto options and they also add a message like “main network only, no forks!”  They even say that if you use a fork you’ll lose your money and they won’t refund. :/",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "ia9avdq",
                                                                            "author": "BitcoinUser263895",
                                                                            "score": 1,
                                                                            "created_utc": 1653697367.0,
                                                                            "response": "> “main network only, no forks!”\n\nThat's could be backwards bullshit. When they say \"main network\" they might mean \"Bitcoin is a fork!! Ours fork is real Bitcoin!!\". \n\nWhatever the case when people talk this way you can be assured that they're lying and acting fraudulently.\n\nBitcoin is Bitcoin. There is no \"Main network\" it's just Bitcoin.\n\n>  They even say that if you use a fork you’ll lose your money and they won’t refund.\n\nThat's because bcash failed to change their address format and created a situation where the people they duped into buying their forked version of \"Bitcoin\", thought they had bought Bitcoin and would send it to Bitcoin addresses. At which point they'd discover they had been scammed and actually bought bcash.\n\nWhat's the site? Will be easier to just glance at it and see what's actually going on.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "ia9di3e",
                                                                                    "author": "Actual_Direction_599",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653698769.0,
                                                                                    "response": "So by not accepting forks and insisting in using “main networks” or “Layer 1” only they don’t want to be scammed themselves? Or are scams posible even using “Layer 1”?",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "ia94uh1",
                                            "author": "Actual_Direction_599",
                                            "score": 1,
                                            "created_utc": 1653694237.0,
                                            "response": "Thanks!",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "ia95jer",
                                    "author": "savinelli_smoker",
                                    "score": 2,
                                    "created_utc": 1653694591.0,
                                    "response": "B-cash lost the war to the real bitcoin. So they basically keep saying bitcoin had deviated from being true bitcoin by having a layer 2, layer 2 isn’t bitcoin, you must transact on base layer, you just increase the block size blah blah. Once Segwit is thrown into the conversation you know they’re the b-cashers, Segwit is the default type on most wallets for BTC these days. The BCHers are living in the past.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia967aw",
                                            "author": "Actual_Direction_599",
                                            "score": 2,
                                            "created_utc": 1653694931.0,
                                            "response": "Hmm.  Yeah, someone else also commented something like that.  But it seems that the problem or risk would be to the merchant I’m trying to pay and not me? That is, they’re not trying to sell me any crypto, there supposed to be a crypto payment platform that allows you to pay a merchant with Bitcoin (and other crypto).  So if that merchant created an account with that platform, aren’t they at risk to be scammed? Is there any risks for me if I’m just trying to *pay*?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia96hrb",
                                                    "author": "ride_the_LN",
                                                    "score": 2,
                                                    "created_utc": 1653695080.0,
                                                    "response": "If I wanted to be helpful to that merchant, I'd alert them to the scam their payment platform is attempting. It's a bad look. I wouldn't buy from them in the first place but if you have some personal connection, then it's a good deed to clue them in.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "ia97s9b",
                                                    "author": "BitcoinUser263895",
                                                    "score": 1,
                                                    "created_utc": 1653695750.0,
                                                    "response": "> risk would be to the merchant I’m trying to pay and not me? \n\nAny merchant accepting bcash is a bagholder who isn't thinking logically. They are taking on risk and acting irrationally because they have lost a lot of money on this scam and can't accept the loss.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "ia97yp0",
                                                    "author": "savinelli_smoker",
                                                    "score": 1,
                                                    "created_utc": 1653695844.0,
                                                    "response": "The merchant didn’t know better. The BCHers, after losing the war, became very active in getting “merchant adoption”. They go door to door asking merchant if they want to adopt “bitcoin” while what they help set up for the merchants aren’t BTC, but BCH. To most people they heard the name “bitcoin” and go yeah I’m in… it’s pretty messed up in the BCH world. It’s only fitting that one BCH now trades at 0.006 BTC in the market. \nThe market has clearly spoken but the BCHer just refuse to accept the reality. \n\nhttps://youtu.be/n1ZIGsUxwXE",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia9mryo",
                    "author": "MatthiasLee11",
                    "score": 1,
                    "created_utc": 1653703684.0,
                    "response": "Its most likely a bullshit site that isn't worth your time. What is the site URL?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia9n5px",
                            "author": "Actual_Direction_599",
                            "score": -1,
                            "created_utc": 1653703892.0,
                            "response": "Yeah, I’m not going to use the site after reading all the feedback.  I’d rather not mention the URL.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}