{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ur52je",
            "title": "Is Bitcoin’s public ledger a compete violation of company and personal privacy?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/ur52je/is_bitcoins_public_ledger_a_compete_violation_of/",
            "author": "SwurveMan",
            "created_utc": 1652732470.0,
            "score": 0,
            "num_comments": 11,
            "subreddit": "BitcoinBeginners",
            "selftext": "Everyone deserves to have some level of privacy with how they spend their money, is this a flaw in bitcoins protocol?",
            "stickied": false,
            "comments": [
                {
                    "id": "i8v3kzx",
                    "author": "subduderecords",
                    "score": 8,
                    "created_utc": 1652732518.0,
                    "response": "No",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8v4bg3",
                    "author": "DmJerkface",
                    "score": 3,
                    "created_utc": 1652732822.0,
                    "response": "Company privacy? what you smoking?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8v7fir",
                    "author": "MrQ01",
                    "score": 2,
                    "created_utc": 1652734094.0,
                    "response": "The blockchain doesn't tell you what you're spending your money on. This is why Bitcoin has a negative (and unfair) reputation for enabling criminal activity. \n\nNo it's not a violation, because it's a public blockchain.. And it's not a flaw because being public means it is publicly auditable and transparent. Don't like it? Don't use it",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8vafo5",
                    "author": "cryptochill",
                    "score": 2,
                    "created_utc": 1652735318.0,
                    "response": "It's a lot more private than using a debit or credit card.\n\nIn analyzing the blockchain, one can often piece together who the different wallets belong to, but the blockchain doesn't have information about what specifically was purchased, among other things.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8vr9jr",
                    "author": "d3vrandom",
                    "score": 2,
                    "created_utc": 1652742838.0,
                    "response": "yes it is",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8vjb11",
                    "author": "johnson5067",
                    "score": 1,
                    "created_utc": 1652739161.0,
                    "response": "Participation is voluntary, so it does not violate anyone's perceived right to \"some level of privacy.\" For many of us, the transparency (providing a fixed, auditable supply) is a major feature over fiat.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8w1syl",
                    "author": "seg_fault0x0000",
                    "score": 1,
                    "created_utc": 1652748065.0,
                    "response": "as long as there's no connection between your wallet and you, it's completely private.\n\nalso, if a company or person decides to use the coin, the problem is their's, use another coin or whatever.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8x1m5v",
                    "author": "never_safe_for_life",
                    "score": 1,
                    "created_utc": 1652769231.0,
                    "response": "Yes, Satoshi wrote about how his original vision included full anonymity. In exchange for getting something off the ground he settled for pseudonymity, as anonymity with the UTXO model is a hard problem. \n\nLuckily people are still working on this. The recent Taproot upgrade introduced Schnorr signatures, which have the potential to effectively mask owners. I expect in a few years this will be fleshed out and integrated into wallets for a seamless experience.\n\nI’m the meantime there are several available, if not inconvenient, ways to ensure anonymity.\n\nAll modern wallets use extended private keys which generate a new address for every transaction. Sure the feds can track the coins you send from a KYC exchange to your first address, but as you spend them they all leave that address for new ones. It’s hard but maybe not impossible for them to follow the trail.\n\nYou can transfer your coins to Lightning and back again, effectively washed. \n\nYou can use a coinjoin service. \n\nYou can find non-KYC ways to get coins.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}