{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uqbihw",
            "title": "Emirates now accepts bitcoin as payment",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uqbihw/emirates_now_accepts_bitcoin_as_payment/",
            "author": "Eileen755",
            "created_utc": 1652637314.0,
            "score": 54,
            "num_comments": 8,
            "subreddit": "Bitcoin",
            "selftext": "The Dubai airline Emirates has revealed plans to integrate \"bitcoin as a payment for services rendered\". The aspirations to embrace Bitcoin by this airline came just a few weeks after the company disclosed its NFT and metaverse plans. Although the time the plans will be implemented is still unknown. \n\nEmirate, the major airline in the United Arab Emirates (UAE), also plans to launch a metaverse and NFT trading platform for other decentralized currencies like Threedium, Metaloop, MetaTokyo Faith Tribe, etc. \n\nAccording to the company’s chief operating officer (COO), Adel Ahmed Al-Redha. The airline’s aspirations to embrace Bitcoin come just a few weeks after the company disclosed its NFT and metaverse plans.\n\nHowever, in comments published in Arab News, Al Redha mentioned that his company might need to hire staff to help it develop applications that track client wants. He also indicated that the airline would try to use blockchain to track aircraft records. However, when Emirates implements these plans, and customers will be able to pay with Bitcoin is unknown.\n\nFinally, just like Abu Dhabi and the wider United Arab Emirates, Dubai has been attempting to attract crypto companies by establishing a clear legislative framework within which digital asset companies can operate. These regulations have attracted many crypto exchanges, but they also appear to be opening the door for more traditional businesses to embrace crypto.",
            "stickied": false,
            "comments": []
        }
    ]
}