{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uttzi7",
            "title": "Bitcoin Reclaims $30K, Why Bulls Face Uphill Task",
            "url": "https://boundingintocrypto.com/bitcoin-reclaims-30k-why-bulls-face-uphill-task",
            "author": "blacksandwealth",
            "created_utc": 1653049130.0,
            "score": 1,
            "num_comments": 0,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uttxb0",
            "title": "Michael Saylor The Ultimate Bitcoin Compilation 10 hours",
            "url": "https://youtube.com/watch?v=VYy3OI-R5TI&feature=share",
            "author": "yeho_meta",
            "created_utc": 1653048992.0,
            "score": 1,
            "num_comments": 0,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uttlwt",
            "title": "Any ideas on the economic effects of countries with out-of-control inflation switching to bitcoin?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uttlwt/any_ideas_on_the_economic_effects_of_countries/",
            "author": "sje397",
            "created_utc": 1653048280.0,
            "score": 5,
            "num_comments": 3,
            "subreddit": "Bitcoin",
            "selftext": "I'm not an economist, but I enjoy reading people's thoughts on it, even if the system is so complicated it seems totally possible to formulate equally convincing but opposing theories...\n\nIt strikes me that it's getting increasingly difficult for governments with failing currencies to prevent their citizens from switching to bitcoin. As a global commodity/currency/new thing, what sort of impact does the adoption of bitcoin by these folks have on the rest of the bitcoin world?",
            "stickied": false,
            "comments": [
                {
                    "id": "i9bitq9",
                    "author": "swgo1",
                    "score": 1,
                    "created_utc": 1653049127.0,
                    "response": "Over time this will give the citizens a way to save up capital. It will help them.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9bq2z3",
                            "author": "sje397",
                            "score": 1,
                            "created_utc": 1653052620.0,
                            "response": "I think that's very true. But my question is about the economic impact on everyone else when a country adopts bitcoin because their currency failed. What if anything does it do to the worth/value of bitcoin globally?\n\nI suppose there is the hype factor which could drive prices up just because it makes the news, but I figure that aside there must be effects from varying exchange rates (even if it came to barter), subjective judgements of value, etc.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9bqqb8",
                    "author": "meatismoydelicious",
                    "score": 1,
                    "created_utc": 1653052907.0,
                    "response": "Price stability mainly. Let's say it replaced a nation's currency. Then the government has no control over what is minted. This is not what governments are used to. My bet is taxes go up, but with anonymity, \"What capital gains, sir?\" So they begin buying up BTC by any means. Well by the nature of deflation, in this scenario government spending actually benefits the citizens by driving up the value of BTC. For once in human history, government spending will actually be good for the public. But unlike history they will only have so much access to said spending. By the time these things begin, I imagine the real struggles for resources will begin. Wars will start just for water and food. Hundreds, if not thousands, of wallets and keys will be lost. Inflation will hit new highs, the call for decentralized, deflationary currency will grow stronger. If not Bitcoin, some other type of crypto. Though according to what little I truly understand, it would take one hell of a code to top what BTC is doing. \n\nTl;dr: Shit hits the fan. BTC go up. Big big moneys.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}