{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uz7rno",
            "title": "Bitcoin is DED with Knoxville Bitcoin Network - State of Bitcoin",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/uz7rno/bitcoin_is_ded_with_knoxville_bitcoin_network/",
            "author": "Fit_Rooster2702",
            "created_utc": 1653685391.0,
            "score": 1,
            "num_comments": 1,
            "subreddit": "BitcoinBeginners",
            "selftext": "In this episode Brandon is joined by the leader of the Knoxville Bitcoin Network (@BitcoinKbn) who also works for GRIID a Bitcoin mining company. They get into his Bitcoin origin story, what it is like running a Bitcoin meetup, what it is like working for a Bitcoin mining company, and more! They also dive into 6 current event stories surrounding Bitcoin including Bitcoin price falling with 8 straight red candles for the first time in history, the use of Ocean Thermal Energy Conversion to be used in Bitcoin mining, Oslo Freedom Forum, Central African Republic creating a Bitcoin Island, Bitcoin being taught in 40 high schools in Argentina, and Balenciaga and other luxury brands accepting Bitcoin payments.   \n\nCheck out the episode [here.](https://open.spotify.com/episode/5RFDQdbx6O06UKqybjjscn?si=2nhHKH4MSHmFunCY_FjI1Q)",
            "stickied": false,
            "comments": [
                {
                    "id": "ia8msmu",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653685392.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}