{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ux67iy",
            "title": "Bitcoin Is Venice: Bitcoin Will Make Us Think Long Term, Whether We Want To Or Not",
            "url": "https://bitcoinmagazine.com/culture/bitcoin-forces-long-term-thinking",
            "author": "castorfromtheva",
            "created_utc": 1653442070.0,
            "score": 9,
            "num_comments": 2,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9vqj36",
                    "author": "coinfeeds-bot",
                    "score": 1,
                    "created_utc": 1653442260.0,
                    "response": "tldr; The wealth that ultimately sustains any nation or community is derived from green plants growing on regenerating soil, a fact that even the most sophisticated financial planning methods don't take into account, writes Allan Savory. Savory laments this loss of foundational knowledge in hyper-specialized, degenerate fiat modernity. The root of the essentially communitarian tradeoffs of all capital is in the tradeoffs inherent in adopting agriculture in the first place.\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR.*",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ux6b2z",
            "title": "In a Bitcoin:Gold analogy, is there a cryptocurrency:Reserve Note equivalent?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/ux6b2z/in_a_bitcoingold_analogy_is_there_a/",
            "author": "direwolfexmachina",
            "created_utc": 1653442394.0,
            "score": 0,
            "num_comments": 4,
            "subreddit": "Bitcoin",
            "selftext": "This assumes reserve notes before FDR’s gold banning, Nixon’s departure from the gold standard, etc. Is there a coin tokenized and minted that can be traded back to bitcoin by a central neobank authority?",
            "stickied": false,
            "comments": [
                {
                    "id": "i9w0146",
                    "author": "savinelli_smoker",
                    "score": 3,
                    "created_utc": 1653446740.0,
                    "response": "Why would you want that though? Isn’t bitcoin itself the token that can be sent around? Bitcoin is the best of both worlds, it’s a bearer asset that any reserve can safe keep, but at the same time it can be sent across the world in an instant. So I think this is where the analogy breaks down: You don’t need to create another token to represent bitcoin, bitcoin itself is a token, yet the value is embedded in this token rather than having something valuable to “back” it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9vtiol",
                    "author": "PerformanceVarious45",
                    "score": 1,
                    "created_utc": 1653443659.0,
                    "response": "Better than that:\n\nhttps://opendime.com\n\n\nAnd for those living In the 21st century:\n\nhttps://www.coincorner.com/TheBoltCard",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ux6dtq",
            "title": "How to claim Bitcoin?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/ux6dtq/how_to_claim_bitcoin/",
            "author": "bananabear666",
            "created_utc": 1653442643.0,
            "score": 0,
            "num_comments": 21,
            "subreddit": "Bitcoin",
            "selftext": "I have no idea how it works but many years ago my grandpa had a company from Canada come to his property and mine, some time went by and they became uninterested and decided to go back to Canada. Court ordered them to pay up what was owed and they decided to just pay in Bitcoin instead. My grandpa claims he still has paperwork and everything. But at the time no one knew what Bitcoin was so my grandpa considered it a loss. How would we recover this? What information would they have sent to my grandpa for him to cash it out? They sent roughly 700 Bitcoin because at the time it was cheap. I keep trying to explain to my grandpa that this is big money but he has a hard time understanding. If I know which documents to look for then I may be on the right track to helping him. Thanks",
            "stickied": false,
            "comments": [
                {
                    "id": "i9vwpo6",
                    "author": "Black_Labs_Matter69",
                    "score": 9,
                    "created_utc": 1653445169.0,
                    "response": "This is a lie",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9vzg28",
                            "author": "monerobae",
                            "score": 1,
                            "created_utc": 1653446458.0,
                            "response": "It does sound a little suspicious lol but then you wondered what was the point of the post.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9wefrv",
                                    "author": "bananabear666",
                                    "score": 1,
                                    "created_utc": 1653454613.0,
                                    "response": "No this is why I'm looking into it because it is suspicious. But I remember at the time my grandpa and my mom thought it was a scam so whatever was sent through email probably was never opened up. My grandpa just told me about it recently. It also wasn't an accepted payment, at the time my grandpa said they \"did it to be assholes\" because they didn't pay in actual cash",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9wez6o",
                            "author": "bananabear666",
                            "score": 1,
                            "created_utc": 1653454956.0,
                            "response": "It's actually not but you can believe what you would like. This is why I came here because I don't understand how Bitcoin is sent or transferred to someone as payment. I'm hoping it is as simple as an email and not something downloaded onto a flashdrive. Because my grandpa still has the same email",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9wgf2i",
                                    "author": "Black_Labs_Matter69",
                                    "score": 3,
                                    "created_utc": 1653455905.0,
                                    "response": "Post any sort of proof. Should be easy",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9wsdyc",
                                            "author": "bananabear666",
                                            "score": 1,
                                            "created_utc": 1653465157.0,
                                            "response": "That's the whole point of this post. I have no idea what I'm looking for. But now that I learned that it may be within his email from years back I will let him know about it tomorrow. You never know maybe I will have proof in due time if I find what we're looking for",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9w2617",
                    "author": "Boe_Ning",
                    "score": 6,
                    "created_utc": 1653447786.0,
                    "response": "Your grandpa accepted a court ordered payment in Bitcoin without understanding how to actually receive/access it?  Sorry: bullshit.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9weu83",
                            "author": "bananabear666",
                            "score": 1,
                            "created_utc": 1653454870.0,
                            "response": "No the payment wasn't court ordered to be Bitcoin. The company had a contract through court to pay my grandpa what they owed and instead they sent Bitcoin instead and my grandpa just considered it a loss. I'm not even sure at the time Bitcoin was worth. But they basically got in an argument with him and instead of giving him $700 they got $700 in Bitcoin or 700 Bitcoin. I'm not sure how Bitcoin works that's why I came here to see if I can figure it out. My grandpa still has the same email so hopefully it's found that way?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9wf1ip",
                                    "author": "Boe_Ning",
                                    "score": 2,
                                    "created_utc": 1653454997.0,
                                    "response": "What does the email say, megamind?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9wsi52",
                                            "author": "bananabear666",
                                            "score": 1,
                                            "created_utc": 1653465263.0,
                                            "response": "Waiting on response from him I'll get into his phone soon to check for him since he doesn't understand how it works. It also could have been sent to my mom's email at the time because she was also owed half since the mining claims were in half her name so time will tell",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9wsu48",
                                                    "author": "Boe_Ning",
                                                    "score": 1,
                                                    "created_utc": 1653465566.0,
                                                    "response": "\"Mining claims\" from when Bitcoin was $1?  Not sure what you're trying to pull here, but to anyone with half a braincell, you're either very misinformed or a shitty, uninformed scammer.\n\nAnyone who doesn't recognize this and feels compelled to engage this idiot privately: don't.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9vvj2s",
                    "author": "DudeIncogneto",
                    "score": 5,
                    "created_utc": 1653444600.0,
                    "response": "Please do not respond to anyone who sends you a DM. They are a scammer",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9wqv3b",
                    "author": "dlq84",
                    "score": 1,
                    "created_utc": 1653463814.0,
                    "response": "Sorry for hijacking this thread: I was actually visited by aliens and they left 1000 BTC on my night stand, how do I claim them?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9vt3oe",
                    "author": "dwin31",
                    "score": 2,
                    "created_utc": 1653443467.0,
                    "response": "Does your grandpa use email for the business or personal reasons? Id just run a search for \"btc\"  \"bitcoin\" and \"bc1\" in both the sent and received and see if you end up with a any leads.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9wf4xi",
                            "author": "bananabear666",
                            "score": 1,
                            "created_utc": 1653455057.0,
                            "response": "Yes he does and he still has the same email! Is this how it would have been sent to him? I try looking up information on how to transfer Bitcoin or accept it and online it says fine the address?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9vu1te",
                    "author": "UnityIsUnreal",
                    "score": 1,
                    "created_utc": 1653443913.0,
                    "response": "Thats not big money it’s HUGE!!!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9w1bcq",
                    "author": "nullama",
                    "score": 1,
                    "created_utc": 1653447364.0,
                    "response": "> They sent roughly 700 Bitcoin\n\nHow was that transaction made?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9wekmb",
                            "author": "bananabear666",
                            "score": 1,
                            "created_utc": 1653454700.0,
                            "response": "That's what I'm trying to figure out. At the time it was new and my mom and grandpa didn't know what it was and they thought the company in Canada was scamming them so they just considered it a loss. But I am here now wondering if there's money just sitting in an email somewhere waiting to be spent",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9wkd7c",
                                    "author": "nullama",
                                    "score": 3,
                                    "created_utc": 1653458653.0,
                                    "response": "> they thought the company in Canada was scamming them \n\nLooks like they were right then...",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9wskyo",
                                            "author": "bananabear666",
                                            "score": 1,
                                            "created_utc": 1653465334.0,
                                            "response": "Could have been. All I know is at the time they didn't know what Bitcoin was because it just started up and they didn't wanna mess around and find out.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9wsq3c",
                    "author": "BTCMachineElf",
                    "score": 1,
                    "created_utc": 1653465465.0,
                    "response": "You can't just \"send someone bitcoin\". Nor can you just send someone a wallet.\n\nYour grandfather would have to have made his own wallet for them to send it to. Since it's clear he didn't do that, there is nowhere for that bitcoin to be (except perhaps still in the custody of that company, and good luck getting it from them now!)",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}