{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "upp4g4",
            "title": "If bitcoin mining requires \"the energy of a small country\", shouldn't miners collectively have the energy bill of a small country?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/upp4g4/if_bitcoin_mining_requires_the_energy_of_a_small/",
            "author": "HelloFellowTraveller",
            "created_utc": 1652558394.0,
            "score": 2,
            "num_comments": 17,
            "subreddit": "BitcoinBeginners",
            "selftext": "Wouldn't it not be worth it for them to mine in the first place?",
            "stickied": false,
            "comments": [
                {
                    "id": "i8m6mgf",
                    "author": "ArchiMode25",
                    "score": 4,
                    "created_utc": 1652559974.0,
                    "response": "No because a large portion of the mining is done on renewable energy and excess energy that would have otherwise been wasted. Some metrics even show that the majority of mining is done on renewable energy.\n\nThis is why the narrative of \"bitcoin is killing the environment\" is false.\n\nEven with regularly supplied electricity, fossil fuels, some places energy is so costly that no it wouldn't be profitable to mine but other locations have very cheap energy making it profitable in those locations.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8n0vwu",
                            "author": "LaForge_Maneuver",
                            "score": 1,
                            "created_utc": 1652574273.0,
                            "response": "I mean yes and no. I have renewable energy (solar) I could mine or I could send energy back to the grid to make the entire system more sustainable. Renewable or not there is an impact for increased power usage.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8m80s7",
                    "author": "AdS_CFT_",
                    "score": 4,
                    "created_utc": 1652560626.0,
                    "response": "Remember they receive bitcoin for  mining... It's not just paying electricity for no reason.\n\nIf electricity is expensive in your country then yes, you should directly buy the coin instead of mining it.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8mee2a",
                            "author": "comfyggs",
                            "score": 1,
                            "created_utc": 1652563567.0,
                            "response": "Exactly. It incentives mining from renewable and waste energy",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8m7acr",
                    "author": "bitusher",
                    "score": 2,
                    "created_utc": 1652560287.0,
                    "response": "Bitcoin mining incentivizing building out green infrastructure and uses many wasted energy sources\n\nThe proof of work algo insures mining will always remain profitable for efficient mining thus naturally driving miners to these efficient and green sources of energy",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8mawoz",
                    "author": "MuchTemperature6776",
                    "score": 2,
                    "created_utc": 1652561963.0,
                    "response": "Bitcoin mining uses vastly less energy than any other financial sector.\n\nIt’s basically a lie told by banks etc. because they don’t want to be outperformed or want Bitcoin to succeed at all.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ml8zs",
                    "author": "stuaxo",
                    "score": 1,
                    "created_utc": 1652566761.0,
                    "response": "I love all the excuses below.\n\nBitcoin mining gets them more money than the energy bill.\n\nFor miners at scale there are various ways they can get lower bills - miners based in cold countries use the cold around as \"free\" cooling (but they are still being warmed).\n\nOthers have bought up old coal power stations and situated themselves near them.\n\nSome others say they use \"excess\" renewable energy, though of course this is energy that could just as well be stored for use later.\n\nBasically - various methods of being near cheap power keep bills down (and profits up), how much you buy the claims that this is energy that is \"excess\" or wouldn't be used is up to you.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8n5p7v",
                            "author": "cryptosareagirlsbf",
                            "score": 1,
                            "created_utc": 1652576713.0,
                            "response": ">energy that could just as well be stored for use later.\n\nHow, exactly? Try cooking your lunch on the energy stored in your laptop's battery, then imagine what could possibly store a meaningful fraction of grid's needs for a meaningful amount of time. Ridiculous.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8m361h",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1652558394.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8mkv4x",
                    "author": "ndgoLiberty",
                    "score": 1,
                    "created_utc": 1652566578.0,
                    "response": "Small countries with as much close-to-free/very-cheap energy as bitcoin miners do could go a long way. Unfortunately countries the same size as bitcoin don’t have as much wealth as bitcoin does.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ocgcs",
                    "author": "igadjeed",
                    "score": 1,
                    "created_utc": 1652604894.0,
                    "response": "> shouldn't miners collectively have the energy bill of a small country?\n\nYes. They should have a monthly energy bill approximately 80-90% of the value of a month of mined Bitcoin, which is approximately USD840 million per month\n\n> Wouldn't it not be worth it\n\nThe fiat value of the amount mined is greater than the fiat cost of mining",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}