{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uvniud",
            "title": "I'm going to be paying for my Bitcoin Pizza with Strike so I keep my stash. But, here is my salute to Laszlo!",
            "url": "https://anchor.fm/bitcoinbulletin/episodes/52-Bitcoin-Pizza-Day-May-22nd--2022-e1itdq2",
            "author": "cocoabeachbrews",
            "created_utc": 1653263876.0,
            "score": 1,
            "num_comments": 0,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uvnfrw",
            "title": "My friend is a catfish",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uvnfrw/my_friend_is_a_catfish/",
            "author": "Ok_Cycle5178",
            "created_utc": 1653263575.0,
            "score": 1,
            "num_comments": 1,
            "subreddit": "Bitcoin",
            "selftext": "I am fed up now so I am writing this thread.\nMy old friend from Pakistan had a UK girl who used to supply him with pictures to grow his twitter and crypto paid group. \n\nHis paid group failed because bitcoin dumped but now he's doing paid promotions for dog shit projects \nHe is at 130.000 followers now. \nYears ago the girl stopped supplying pictures but he kept re using her old pictures to get paid promotions\n\nHe even started flirting with dumb men talking about sex and feet pictures to get free bitcoin\nAt this point he should get a sex change but he doesn't stop \n\nHow can I stop this guy from catfishing for bitcoin",
            "stickied": false,
            "comments": [
                {
                    "id": "i9mh01k",
                    "author": "ndgoLiberty",
                    "score": 1,
                    "created_utc": 1653263687.0,
                    "response": "Idk how this is related to bitcoin but your friend needs a J O B",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uvnel4",
            "title": "6 best cryptocurrencies to buy now for a solid portfolio",
            "url": "https://cryptosorted.info/best-cryptocurrencies-to-buy/",
            "author": "CryptoSorted",
            "created_utc": 1653263459.0,
            "score": 0,
            "num_comments": 3,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9mi0o7",
                    "author": "swgo1",
                    "score": 1,
                    "created_utc": 1653264227.0,
                    "response": "BTC, BTC, BTC, BTC, BTC, and BTC.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9mivz3",
                    "author": "PerformanceVarious45",
                    "score": 1,
                    "created_utc": 1653264688.0,
                    "response": "Get rekt shitcoiners",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uvndwp",
            "title": "Crypto Enthusiasts Celebrate Bitcoin Pizza Day All Over the World",
            "url": "https://thenewscrypto.com/crypto-enthusiasts-celebrate-bitcoin-pizza-day-all-over-the-world/",
            "author": "Loud_Dingo7261",
            "created_utc": 1653263396.0,
            "score": 3,
            "num_comments": 3,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9moj5p",
                    "author": "coinfeeds-bot",
                    "score": 1,
                    "created_utc": 1653267653.0,
                    "response": "tldr; Bitcoin Pizza Day honors the day in 2010 when a Florida-based BTC miner purchased two Papa John’s pizzas using Bitcoin. Hanyecz shelled out 10,000 BTC for the purchase of a pizza, which was worth around $41 at the time. Every year on May 22, Bitcoin enthusiasts gather to purchase pizza and eat it together and celebrate it.\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR.*",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uvnb0w",
            "title": "In the memory of most expensive Pizza 🍕 I’m buying pizza and dip tonight.😂",
            "url": "https://i.redd.it/qu5kc3mj64191.jpg",
            "author": "DjVutra",
            "created_utc": 1653263120.0,
            "score": 1,
            "num_comments": 3,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9mp23j",
                    "author": "RogerWilco357",
                    "score": 2,
                    "created_utc": 1653267918.0,
                    "response": "It wasn't the most expensive pizzas, it was $40.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9o8ki2",
                    "author": "gumbelslaint",
                    "score": 2,
                    "created_utc": 1653306592.0,
                    "response": "Who eats pizza with dip",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9oswxn",
                            "author": "DjVutra",
                            "score": 1,
                            "created_utc": 1653317149.0,
                            "response": "I just buy it, I don’t eat it.🤣",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "uvnb8p",
            "title": "Are we using bitcoin the wrong way?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uvnb8p/are_we_using_bitcoin_the_wrong_way/",
            "author": "danielqba",
            "created_utc": 1653263141.0,
            "score": 11,
            "num_comments": 69,
            "subreddit": "Bitcoin",
            "selftext": "I am fairly new to crypto (bitcoin) and all I keep hearing is “bitcoin is the future of money” but actually, currently, it may not be. \n\nSince all I read/see around is everyone trying to hodl or buy the dip, or sell, and bulls and bears.\n\nBut does anyone really uses it like money? Apart from El Salvador people, do you go get a coffee and pay with your bitcoins? Or is it a mentality that someday you will regret since what you payed for that coffee is now worth millions or whatever. \n\nI understand that everything began with a pizza, and yes, with current value, that was an expensive pizza, but it was what started the wheel. \n\nDo we use bitcoin in everyday transactions (bills, goods, taxes, etc) or do we hodl until we are rich?\n\nAre we using bitcoin as money or just as a store of value?\n\nEnglish is not my first language, and I am fairly new to bitcoin, be kind lol.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9mmlzr",
                    "author": "ralphyb0b",
                    "score": 9,
                    "created_utc": 1653266656.0,
                    "response": "Nic Carter talks about it being the base layer of money on the Lex Friedman pod. When you swipe your Visa card, you’re about 5+ layers removed from the base layer of the US financial system and it doesn’t actually get settled until around a month later.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9o7tfy",
                            "author": "hopelesslyhip",
                            "score": 1,
                            "created_utc": 1653306099.0,
                            "response": "You get it.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9mgpld",
                    "author": "thisischalupa",
                    "score": 8,
                    "created_utc": 1653263530.0,
                    "response": "I use it as a store of value. I’m not too worried about current prices or short term future prices. I’m in for the long haul.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9mxpu5",
                            "author": "Warm-Second-7810",
                            "score": 5,
                            "created_utc": 1653272273.0,
                            "response": "I like the idea of using BTC as a store of value. Invest what you don't need in the next 5 years, and see what happens. (My outlook)",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9ow1ar",
                                    "author": "SWGamOR",
                                    "score": 2,
                                    "created_utc": 1653318522.0,
                                    "response": "I just want my hour of time that I exchanged for value now to be reversible in the future.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9n306g",
                                    "author": "thisischalupa",
                                    "score": 2,
                                    "created_utc": 1653275035.0,
                                    "response": "See this guy gets it!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9mgv8w",
                            "author": "danielqba",
                            "score": 2,
                            "created_utc": 1653263615.0,
                            "response": "That’s my point, then bitcoin is not “money” is just something like gold or any metal that we expect to rise in value.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9mno3m",
                                    "author": "solomonsatoshi",
                                    "score": 5,
                                    "created_utc": 1653267208.0,
                                    "response": "Money without SoV is bad money. Bitcoin SoV is inherent and so is the basis for good money. \n\nHowever use of Bitcoin is highly obstructed by the legacy fiat debt slavery banking cartel in most jurisdictions.\n\nLightening Network delivers superior MoE - where regulatory powers allow it!",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9o2ry7",
                                            "author": "papercut_666",
                                            "score": 1,
                                            "created_utc": 1653302454.0,
                                            "response": "What is SoV and MoE ?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9ohgum",
                                                    "author": "solomonsatoshi",
                                                    "score": 3,
                                                    "created_utc": 1653311730.0,
                                                    "response": "Store of Value and Means of Exchange.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9olaeg",
                                                            "author": "papercut_666",
                                                            "score": 1,
                                                            "created_utc": 1653313639.0,
                                                            "response": "Thank you",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9nf8gs",
                                    "author": "tokyo_aces",
                                    "score": 3,
                                    "created_utc": 1653282450.0,
                                    "response": "Unfortunately all replies to what you just wrote are only saying \"But gold was like that, and it was also money\" - a sort of hand-wavy fallacy that \"Bitcoin is A, and Gold is A and at one time it was B, therefore Bitcoin is also B\".\n\nYour point is very valid.  Without knowing it, many people are playing the greater fool game, even those who eschew altcoin scams and refuse to dabble in futures gambling because it leaves others holding the bag.\n\n**Fact**: if you and everyone else believe something will increase in value consistently, you will never get rid of that valuable thing until it hits absurd levels, and then *someone* will dump back into fiat (maybe not you), collapsing it all.  You become a beanie baby enthusiast.  You are entering into a greater fool system of value.\n\nTo break out of this, there must be differing viewpoints on the value of the item - more people must believe it has intrinsic value (such as banking oneself, international payments, etc) than simply \"hodl value\".  This sub either forgets this (since those who sodl are mocked) or believes ourselves to be the chosen group who can ride the gravy train, while the masses must deign to use BTC as actual currency.  Because if you truly think 100% of humanity should hodl, you don't math.\n\nBitcoin's value vs fiat is rising for a variety of reasons, but we must make sure that one of them is **because it is - not can be - used as money**.  Hodling is fine, that's what a savings/checking account is.  But you still spend from it.  Circulate the coins so non-Bitcoiners get exposure *as consumers*, not \"investors\".\n\n&#x200B;\n\nAnd one more thing before you kids get off my porch - when BTC/USD goes *up*, we tend to say \"it's an inflation hedge\", but when it goes *down*, we don't say the USD inflation improved, for obvious reasons.  So let's stop saying Bitcoin **today** is an inflation hedge, as it is not there yet.  Change the language slightly - Bitcoin *will become* an inflation hedge based on its properties.  The **spot** increase and decrease in BTC price today is not so directly related to inflation (one may argue that the 5 or 10 year trend is, but the 50-90% dips which happen in a month and are reversed in 6 months have 0 to do with inflation, and the weekly prices ditto)",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9o6rfe",
                                            "author": "pink_raya",
                                            "score": 2,
                                            "created_utc": 1653305396.0,
                                            "response": "reason why people are told to hold it is because it has been historically a very bad decision to sell for profit.\n\nIf you use it as a SoV for long enough, it goes up so much you don't mind spending a little bit. Especially if you are all in, there's not much choice if you need to buy something and don't have enough fiat.\n\nI bought stuff from a coffee, a notebook to a motorcycle with bitcoin (some directly, some had to transfer to fiat).\n\nBut the advice is mostly aimed for newbs trying to buy low and sell high. After few years you don't need to listen to anyone else.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9qrsn6",
                                                    "author": "danielqba",
                                                    "score": 1,
                                                    "created_utc": 1653348159.0,
                                                    "response": "Yes, this is what’s wrong with the teachings. Get into bitcoin and you might get rich in a few years. \n\nNo!\n\nGet into bitcoin so you can enjoy all the advantages this money has. All those exchanges, all they do is feed the hopes of people hungry for getting rich right away!\n\nI am very glad some do, I hope many do get rich, but Bitcoin needs to be money. \n\nWould you tell me something like, hey, buy some euros and save them so in a few years you can sell them for usd and make a profit? No! That’s what’s wrong!",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9onryr",
                                            "author": "solomonsatoshi",
                                            "score": 1,
                                            "created_utc": 1653314817.0,
                                            "response": "What your ignorant FUD rant completely f to fails consider is that use of Bitcoin for MoE is highly restricted in nearly all jurisdictions by the legacy fiat debt slavery banking cartel.\n\nIn my country, New Zealand, businesses have been threatened with removal of access to banking if they accept Bitcoin as a means of payment.\n\nLightening Network has shown that Bitcoin can provision MoE (payments function) far more effectively and efficiently than legacy fiat systems...IF and when regulatory authorities and the bankers fiat debt slavery cartel (are forced to) allow it.\n\nDon't fall off your porch when incapable of responding to the facts and issues raised.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i9qrd98",
                                            "author": "danielqba",
                                            "score": 1,
                                            "created_utc": 1653347955.0,
                                            "response": "Exactly this. \nBitcoin won’t become money if we keep holding it because it might rise in value, so is like habinh a new kind money under the mattress, not many people knows it or owns it, but the few that do, won’t spend it because some day I could exchange it for a lot of fiat!",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9ojba7",
                                    "author": "Ar0war",
                                    "score": 2,
                                    "created_utc": 1653312663.0,
                                    "response": "Most of us buy but we wont ever sell because we believe some day we will use those sats to buy things. It doesn't makes much sense now to buy things using sats because this is a new thing - the market cap is still too low so it is easy to manipulate and the grow potential is still too high  Once BTC hits 10T market cap is going to be less volatil (we suppose). Now is mainly used as an store of value  \n\nI use btw Bitcoin to buy many things btw, have been doing so sincr 2013. \n\nGood luck and do not stop researching for info. The more you know the easiest it gets to keep buying. I LOOOOVE huge dips. We are now in acumulation time.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9mild2",
                                    "author": "lsmod1",
                                    "score": 3,
                                    "created_utc": 1653264532.0,
                                    "response": "Gold, silver were money long time ago. Gold coin! But there were counterfeiting issues and difficulty to send it abroad.\nBTC can be a mean of exchanges too. Hard money seems a good definition for BTC. One days billions will want it",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9qsb5r",
                                            "author": "danielqba",
                                            "score": 1,
                                            "created_utc": 1653348409.0,
                                            "response": "Yes, one day billions will want it, but just a few will have it all. Soooooo, would it be useful? Nope. \n\nUnless Bitcoin starts to get used as money, I think it could fail in mass adoption.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9mwh3b",
                                    "author": "Ok_Aerie3546",
                                    "score": 1,
                                    "created_utc": 1653271634.0,
                                    "response": "Thats what money meant before we made currencies. Money is the commodity that rises in value the mist among all commodities.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9mi6v6",
                                    "author": "PerformanceVarious45",
                                    "score": -1,
                                    "created_utc": 1653264317.0,
                                    "response": "Ok...",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9mj1sw",
                    "author": "ETAVEGAMING",
                    "score": 5,
                    "created_utc": 1653264772.0,
                    "response": "There are stages to adoption. Adoption is not a guarantee.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9nex4t",
                    "author": "sciencetaco",
                    "score": 4,
                    "created_utc": 1653282233.0,
                    "response": "There is no wrong way to use bitcoin. It becomes whatever people want it to be.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9njgwb",
                            "author": "Crawlero",
                            "score": 2,
                            "created_utc": 1653285523.0,
                            "response": "I think this is more accurate than people give it credit for.  Hearing old school bitcoiners talk about the early days they say things like \"we still weren't sure what it was\".  Looking to the future, there doesn't seem to be a strong idea of where we are headed exactly, even under the assumption that hyper bitcoinization is the end state; lightning for instance is an interesting platform, it offers this \"infinite liquidity\", but opening and closing channels still requires on chain action, so if 50 million people are using lightning it would be technically impossible for them all to settle monthly.  I had an interesting response to this on a mentor Monday, I was told eventually there would be no need to settle, I don't think there is a crystalized idea of how this will be possible if channels are only bidirectional.  Say we had channel factories, that solves opening channels bit not closing them, so the answer I have gotten is that we won't close channels in the distant future.  I am hopeful if not confident that we will resolve these issues, but to the best of my knowledge we haven't yet, and it appears that the original predictions that on chain settlements would only be for large institutions is going to come to fruition.  I am hoping to start a lightning wallet and run my own node soon, I don't think I have a sufficient conceptual idea of how it works, so maybe I just misunderstand the issue.  With that in mind, I am of the belief that we (like, even hardcore bitcoiners) are not exactly sure what the future of the protocol will look like.  If this is the case, its reasonable to assume that the future may be malleable to the desired use, for better or for worse.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9nl2s6",
                                    "author": "mikiozwei",
                                    "score": 0,
                                    "created_utc": 1653286773.0,
                                    "response": "this is a good description. I think bitcoin is cool and everything, but the likelihood that it offers some sort of libertarian reform of our financial system i think is very low. I think it is more likely to just be used by the powers that be to continue the status quo.\n\nI.e., the only way bitcoin gains mass adoption is through institutions abstracting away the complexity of ownership, through L2 and maybe L3 solutions for transactions, etc... And then we're back to where we are now.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9o872r",
                                            "author": "Crawlero",
                                            "score": 2,
                                            "created_utc": 1653306350.0,
                                            "response": "I'm more on the optimistic side, just cautious of the dangers.  I have long loved lightweight programs that just work, or protocols that just work; look at IPV4 or IPV6, its not by government decree nor divine law that these protocols are ubiquitous, its just very good at what it does, and the reasons why match bitcoin in some senses like having limited design scope and highly refined code.  No other coin really makes sense, its like attempting to lead a revolt against IPV6 when it already does its job flawlessly and perfectly neutral, unbiased and ubiquitous.  This is what I want from bitcoin, it to do a narrow task extremely, extremely, extremely well, and let the rest (Netflix, google or Lightning, stike) Be built on top.  I believe in it's ability to transform our economy in many ways, least and soonest of all is eating into the asset market, jewelry, collectors cars, paintings etc. Are cheap replacements for the value you added to acquire them.  Traditionally, wealth would imply vast pools of money, today it implies all your money is tied up in investments that you hope are keeping up with inflation; bitcoin is a better asset, its liquid and fast, its value tracks economic output rather than lags inflation, even if its hopeium then at least there's a fixed supply.  Banks will chew it up as a tradable reserve asset, skip ACH.  Governments will want it to replace their failing currencies.  At small but unimaginable scale its already happening.\n\nOf course, it all comes down to who makes the decisions and how they are decided on, even bitcoiners with the best intentions will murder the protocol if discourse isn't conducted rationally.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9ojjff",
                                                    "author": "mikiozwei",
                                                    "score": 1,
                                                    "created_utc": 1653312779.0,
                                                    "response": "Yeah that’s a good point.\n\nI’ve seen a lot of people argue against the store of value thesis for Bitcoin given the recent price action. But if we compare it to a tech stock like Alphabet it’s not so different. No one uses stocks as a store of value for 2 years. They all use it as a store of value on the timespan of at least a decade.\n\nI think once Bitcoin survives a major recession (‘08 style) we will have a much stronger case. \n\nFeel bad for El Salvador though. Their timing was off (in hindsight of course). It would have been wise to wait until 2023-2024.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9oopdc",
                                                            "author": "solomonsatoshi",
                                                            "score": 0,
                                                            "created_utc": 1653315252.0,
                                                            "response": "Still too early to say El Salvadors timing was off. \n\nThey have taken a bold and principled stand and demonstrated a small 3rd world nation can enable digital payments available to all who have internet access. That provided a road map for many other nations to potentially follow.\n\nOnly buy and adopt Bitcoin if you believe in its principles of integrity and inclusion and recognise the risks involved in challenging the fiat debt slavery cartel.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9otd2r",
                                                                    "author": "mikiozwei",
                                                                    "score": 1,
                                                                    "created_utc": 1653317346.0,
                                                                    "response": "Fair point about El Salvador. But in response to your comment about trying to limit bitcoin ownership to a special group….no - Bitcoin is for all.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9pl52l",
                                                                            "author": "solomonsatoshi",
                                                                            "score": 1,
                                                                            "created_utc": 1653329093.0,
                                                                            "response": "Special group? You missed the point. Anyone can buy Btc but if you buy and do not understand it and do not fundamentally support it and are only seeking personal gain you are paper hands and unlikely to make gain...the first dip you will panic and lose.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9mwchk",
                    "author": "NiceDoctorBeam",
                    "score": 5,
                    "created_utc": 1653271567.0,
                    "response": "Gresham's Law.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9mkgp9",
                    "author": "solomonsatoshi",
                    "score": 3,
                    "created_utc": 1653265515.0,
                    "response": "Payments channels are still highly obstructed in most jurisdictions- obstructed by the fiat debt slavery cartel.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9mkwkc",
                            "author": "danielqba",
                            "score": 3,
                            "created_utc": 1653265747.0,
                            "response": "That might be, but if it is P2P what stops me to sell you something and accept Bitcoin? IDK, I am not from USA.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9n1p2u",
                                    "author": "solomonsatoshi",
                                    "score": 2,
                                    "created_utc": 1653274334.0,
                                    "response": "Governments and banks. I am here in New Zealand and multiple businesses accepting Bitcoin have been threatened with closure of access to banking services if they accept payment in Bitcoin. There are multiple ways in which the banks and governments are deliberately obstructing adoption of Bitcoin on a citizen, business and national level.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9no9kv",
                                    "author": "MrQ01",
                                    "score": 1,
                                    "created_utc": 1653289361.0,
                                    "response": "If you're not from the USA then you have to check your local laws to see if it allows P2P.\n\nIf you're asking what stops you from breaking the law either way then the decision to do so is on you really. \n\nFor the record, I'm not advocating that you break the law.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9qst7v",
                                            "author": "danielqba",
                                            "score": 1,
                                            "created_utc": 1653348659.0,
                                            "response": "I understand, can I, in USA, give you my car in exchange for, let’s say, a boat? Do we have to pay taxes on that?\n\nIn my country criptos are just being regulated, and the government position is kind of, if you get scammed is your problem, don’t come crying over to us. They really don’t mind (for now) about crypto.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9moxoz",
                    "author": "RogerWilco357",
                    "score": 3,
                    "created_utc": 1653267858.0,
                    "response": "Idk, I use it to buy things. Speculative holding isn't using, but I do that as well.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ntutd",
                    "author": "CallingVoid",
                    "score": 3,
                    "created_utc": 1653294433.0,
                    "response": "It's definitely both for me. Between the main chain and lightning network it has infrastructure to be an ideal currency (something gold could never have). \n\nIf I could be 100% native Bitcoin I would be (I live in a BTC hostile country). Would I starve to death? No. I'd just spend bitcoin that I earned in my job to buy food, just as I do now. Just because the value goes up over time I won't starve myself to death to get rich. If I need a car? Maybe I'll go for a cheaper, fuel efficient option or, better yet take the train or bus. I want to buy a house? It had better be up to modern energy standards so I don't haemorrhage my bitcoin on bills. I want to buy a coffee? Eh, maybe I'll pass, I don't really need one.\n\n\"Ah, but what about those non-essentials? Won't that hurt the economy? People won't buy things that they don't need to survive!\"\n\nTo which my response is: \"Good\"\n\nThere is a hardcore environmental case for Bitcoin here that energy fudders miss entirely imo. It is an  anti-consumerism currency that forces you to make a real choice between saving and spending. Currently you can watch your money get more and more worthless or buy pointless crap you don't need at great cost to the environment.\n\nBitcoin changes this equation.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9mndlr",
                    "author": "uncontrollableop",
                    "score": 6,
                    "created_utc": 1653267057.0,
                    "response": "when a new money replaces an old money, the old money is the one that gets spent. \n\nbitcoin also doesn't enjoy the same tax benefits that fiat currency does. so govt is punishing bitcoin users for using a new kind of money.  \n\nall in due time though.  \n\nfurther, i think you're conflating currency and money. which is natural having grown up in a world where fiat currency has no pretense of backing.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9mmdea",
                    "author": "Leading_Zeros",
                    "score": 2,
                    "created_utc": 1653266528.0,
                    "response": "People have this wierd percption that money is only for use in the act of exchange for goods. When that is the precise moment you stop using a portion of money and the merchant begins using that money. Money is the tool that allows you to store the value of your labour through time.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9my15l",
                            "author": "danielqba",
                            "score": 1,
                            "created_utc": 1653272435.0,
                            "response": "Yes. And you use that value of your labor to get goods and food.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9n9msw",
                    "author": "rtheiss",
                    "score": 2,
                    "created_utc": 1653278785.0,
                    "response": "You're right, it needs to be the currency of a parallel economy to obtain its true value, otherwise it is simply a speculative asset. With L2 solutions like Lightning it can outcompete for every transactions, and the infrastructure is set up to start creating this more efficient economy.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9qtgoy",
                            "author": "danielqba",
                            "score": 1,
                            "created_utc": 1653348983.0,
                            "response": "Yes. Thanks for understanding!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9nb1tx",
                    "author": "BitcoinUser263895",
                    "score": 2,
                    "created_utc": 1653279672.0,
                    "response": "Currency has a stable value.\n\nBitcoin will become currency at the top of the adoption curve when value stabilises when fiat is worthless and 1 Bitcoin = 1 Bitcoin.\n\nGreed and hodling is baked into the halvening algo and drives that adoption.\n\nThat and tax law needs to evolve in many countries. Cap gains on buying coffee sucks.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9qt2hl",
                            "author": "danielqba",
                            "score": 1,
                            "created_utc": 1653348788.0,
                            "response": "I don’t think currency has a stable value at all. All fiat’s values change all the time. Not as volatile as cryptos, but they do. We call it stable because every day we buy bread with the same amount of fiat.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9qt6ra",
                                    "author": "BitcoinUser263895",
                                    "score": 1,
                                    "created_utc": 1653348847.0,
                                    "response": "As we will with Bitcoin at 1 Bitcoin = 1 Bitcoin.\n\nUntil then halvening is designed to make it appreciate against fiat.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9nhcmx",
                    "author": "EstablishmentDry2735",
                    "score": 2,
                    "created_utc": 1653283955.0,
                    "response": "i spent btc on a giftcard and got a phone with that",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9qtr7q",
                            "author": "danielqba",
                            "score": 1,
                            "created_utc": 1653349130.0,
                            "response": "And this is what pushes mass adoption. Since you bought that gift card, some commerce or person saw that bitcoin really can be used as money, and kept that business running (accepting crypto payments). Otherwise, if all we do is hodl, no one is gonna buy/sell anything in crypto, so it won’t circulate, so it will remain in a small circle and become completely useless.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9njv91",
                    "author": "Bitcoin__Hodler",
                    "score": 2,
                    "created_utc": 1653285820.0,
                    "response": ">Apart from El Salvador people, do you go get a coffee and pay with your bitcoins?\n\nIf i can yes.\n\n>Or is it a mentality that someday you will regret since what you payed for that coffee is now worth millions or whatever. \n\nNo, i love using it.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9njvu8",
                            "author": "Paid-Not-Payed-Bot",
                            "score": 1,
                            "created_utc": 1653285833.0,
                            "response": "> what you *paid* for that\n\nFTFY.\n\nAlthough *payed* exists (the reason why autocorrection didn't help you), it is only correct in:\n\n * Nautical context, when it means to paint a surface, or to cover with something like tar or resin in order to make it waterproof or corrosion-resistant. *The deck is yet to be payed.*\n\n * *Payed out* when letting strings, cables or ropes out, by slacking them. *The rope is payed out! You can pull now.*\n\nUnfortunately, I was unable to find nautical or rope-related words in your comment.\n\n*Beep, boop, I'm a bot*",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9nor13",
                    "author": "enterusername34",
                    "score": 2,
                    "created_utc": 1653289772.0,
                    "response": "at this point in time, i think it is mostly just digital gold - fits into portfolio during inflation, but during tightening policies it falls",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9npeic",
                    "author": "thefullmcnulty",
                    "score": 2,
                    "created_utc": 1653290330.0,
                    "response": "This year I’ve bought 2 things with bitcoin and paid for 2 services rendered with bitcoin. It’s being used as needed all over the world in many, many different ways.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9qq5gc",
                    "author": "BitcoinIslandPH",
                    "score": 1,
                    "created_utc": 1653347349.0,
                    "response": "We are onboarding buisnesses every day. Setting up fiat on/off ramps.  Banking the unbanked.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9qs0dn",
                            "author": "danielqba",
                            "score": 1,
                            "created_utc": 1653348265.0,
                            "response": "Banking the unbanked, may be it is because am a 3rd world country resident, but we don’t have PayPal, visa, Mastercard, Zelle, banks transfers, Stripe or anything like it!\n\nAll we can do is use bitcoin as money, not just to store and hope some day I wake up Elon Musk rich.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9ml4me",
                    "author": "SmoothGoing",
                    "score": 2,
                    "created_utc": 1653265866.0,
                    "response": "There are no explicit requirements. Use it however you want. It isn't money, it isn't currency, it isn't digital gold, it isn't an inflation hedge, it isn't freedom, it isn't any of the other nonsense narratives. It is whatever you want it to be for you. Save it, spend it, trade it, give it away to earn interest. Nobody cares. Go nuts.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9mln39",
                            "author": "danielqba",
                            "score": 2,
                            "created_utc": 1653266139.0,
                            "response": "lol I actually like your response. I completely agree with you!\n\nBut I would really like it to become money!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9op5j0",
                                    "author": "solomonsatoshi",
                                    "score": 2,
                                    "created_utc": 1653315461.0,
                                    "response": "Nothing stopping you from using Bitcoin as money - except frightened governments and bankers, and perhaps yourself...",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9mh0ox",
                    "author": "Accomplished-Row5989",
                    "score": 1,
                    "created_utc": 1653263697.0,
                    "response": "You need to run bitcoin if you really want to use it the right way by that i mean have a node. umbrel or mynodebtc software great way to start",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9mh6ds",
                            "author": "danielqba",
                            "score": 3,
                            "created_utc": 1653263782.0,
                            "response": "I do. I am running a node.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9n1fsa",
                    "author": "deadweight999",
                    "score": 1,
                    "created_utc": 1653274198.0,
                    "response": "I think of it like my stacks of silver, but the digital version.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9n2qjd",
                    "author": "Ralph_Naders_Ghost",
                    "score": 1,
                    "created_utc": 1653274888.0,
                    "response": "I'm not so sure about advertising for a specific website, but a major computer / electronics parts online retail accepts bitcoin.  And quite a few other online retailers. It does take some effort to find them, but it also took some effort to find BBSs in the '80s.\n\nI typically try to use bitcoin with a \"buy and replace\" methodology (or more accurately \"replace prior to buying\").  If only to do a small part in growing adoption.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ns32r",
                    "author": "priapic_green_dildo",
                    "score": 1,
                    "created_utc": 1653292771.0,
                    "response": "I use it as money when I know that it will be kept as Bitcoin and used as money.\n\nI have no interest giving away my value in Bitcoin to a merchant that autoconverts to fiat.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9nsbfm",
                    "author": "igadjeed",
                    "score": 1,
                    "created_utc": 1653292982.0,
                    "response": "Not coffee, not the future of money, not a store of value, not going to make you rich  \n\nhttps://bitcoin.org/bitcoin.pdf\n\n> Commerce on the Internet has come to rely almost exclusively on financial institutions serving as trusted third parties to process electronic payments. While the system works well enough for most transactions, it still suffers from the inherent weaknesses of the trust based model. Completely non-reversible transactions are not really possible, since financial institutions cannot avoid mediating disputes. The cost of mediation increases transaction costs, limiting the minimum practical transaction size and cutting off the possibility for small casual transactions, and there is a broader cost in the loss of ability to make non-reversible payments for non-reversible services. With the possibility of reversal, the need for trust spreads. Merchants must be wary of their customers, hassling them for more information than they would otherwise need. A certain percentage of fraud is accepted as unavoidable. These costs and payment uncertainties can be avoided in person by using physical currency, but no mechanism exists to make payments over a communications channel without a trusted party",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9nvnjt",
                    "author": "Western_Boris",
                    "score": 1,
                    "created_utc": 1653296128.0,
                    "response": "In developed countries the usage is more of investment or savings account, as the local currency usually does not have 70% inflation and there is no dictator in charge. In less developed countries people use Bitcoin more as a every day currency if their own currency is shit and/or the government bans people from using local currency or tries to confiscate the money from people. There are several cases, for example women in Afghanistan, that Bitcoin is the only method for them to really own anything, as the Taliban takes from them everything they can.\n\nPoint is that anyone can use Bitcoin in anyway they want. There is no one single use case or one single method of how everyone should use it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9nz0vy",
                    "author": "DeepFuckingVision",
                    "score": 1,
                    "created_utc": 1653299252.0,
                    "response": "Coin is for custody (up to 2 after the decimal)\n\nSats are for spending (the remaining 6)\n\nWhen it becomes saturated along with other currencies, 1 sat will be closer to 1 cent or 1 yen. (That's a million dollar bitcoin)\n\nLets say you have 1.02347389 bitcoin\n\nKeep the 1.02 btc safe and stored and the 347,389 remaining sats in a lite wallet. Worth roughly $3,473.89. Best to have sat spending linked with a rewards program that earns back sats like a cash back card\n\nIf you need to buy something bigger, take a loan out against the coin. That's how I anticipate I'd use it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9oa7gu",
                    "author": "hopelesslyhip",
                    "score": 1,
                    "created_utc": 1653307639.0,
                    "response": "My.02 is we are moving from pure speculation to use cases. Think about it as settlement. A ten dollar fee for settling a billion dollars between banks is orders of magnitude more efficient than how's it's currently done. Customers won't even know they are using Bitcoin. \n\nLightning network can become the P2P payments network. Again settling every block on the BTC network for pennies a transaction. As mentioned in the comments Nic Carter has done great work on this idea.\n\nMore and more will settle on the network over time because it's the only non corruptable  ledger we have ever had. Bonds and real estate are the big fish we all hope for. \n\nThe cherry on top is it acts as a lifeboat for inflation giving us all a real option to fiat if money supply is managed poorly. My guess is this in time will force central banks to better manage their balance sheets as people can now run away from bad actors. (I think the future involves fiat for a long time so I don't think much about a BTC standard as much as the path to get there)\n\nYou are buying a piece of that network today at ridiculous value, even if price dips in the short term.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9okety",
                    "author": "Cautious_Audience225",
                    "score": 1,
                    "created_utc": 1653313210.0,
                    "response": "I like using it whenever I can. If my bill is $68, I’ll pay $70 in crypto and immediately buy back $80+. More sats in my stack, more transactions on the network.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}