{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "urhwiu",
            "title": "Grayscale Investments rolls out its first European crypto ETF | CryptoSlate",
            "url": "https://cryptoslate.com/grayscale-investments-rolls-out-its-first-european-crypto-etf/",
            "author": "sandygws",
            "created_utc": 1652776542.0,
            "score": 9,
            "num_comments": 3,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8xbf98",
                    "author": "coinfeeds-bot",
                    "score": 1,
                    "created_utc": 1652778002.0,
                    "response": "tldr; Grayscale Investments has teamed up with HANetf to launch a crypto-based exchange-traded fund (ETF) in Europe. The GFOF UCITS ETF will trade on the London Stock Exchange (LSE), Borsa Italiana, and Deutsche Börse Xetra. The ETF seeks to expose investors to companies building the digital economy.\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8xfgqu",
                    "author": "Mallardshead",
                    "score": 0,
                    "created_utc": 1652781639.0,
                    "response": "Grayscale has turned into just another shitcoin vehicle.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "urhqhm",
            "title": "Balance 0 in Bitcoin Core wallet",
            "url": "https://www.reddit.com/r/Bitcoin/comments/urhqhm/balance_0_in_bitcoin_core_wallet/",
            "author": "fullmetalcryptomist",
            "created_utc": 1652775740.0,
            "score": 8,
            "num_comments": 12,
            "subreddit": "Bitcoin",
            "selftext": "Hi everyone,\n\nSome days ago I tried to set up my BTC node and a BTC wallet using Bitcoin Core. After syncing, I created a wallet (I didn't know that I was creating a descriptor wallet) and generated a receiving address and sent a small transaction. As it worked, I created another receiving address and did a bigger transaction (it worked too). However, my current balance is 0. I used a btc explorer and the funds still are in the receiving address. I though that It could be because I was using the prune blockchain function. I re-indexed all the blockchain but still showing balance 0. The wallet is encrypted (there is a padlock in the lower right side corner), but it's not asking me any password to open the wallet.\n\n Don't know what more could I try, so please, let me know if I'm doing something wrong.\n\nThanks in advance.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8x9dp0",
                    "author": "dlq84",
                    "score": 4,
                    "created_utc": 1652776110.0,
                    "response": "Is it really fully synced? Because that usually takes a week or two depending on your hardware.\n\nI wouldn't use a hot wallet for storage though, buy hardware.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8x9vv3",
                            "author": "fullmetalcryptomist",
                            "score": 3,
                            "created_utc": 1652776580.0,
                            "response": "Yep it was fully synced but finally I was able to restore the proper wallet and it is showing the balance. I deleted the wallet due to the pruning mechanism (as it showed 0 balance I though it was a \"test wallet\" I created when learning to use bitcoin core). I'm fuckin dump xD",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8xa1bn",
                            "author": "fullmetalcryptomist",
                            "score": 2,
                            "created_utc": 1652776726.0,
                            "response": "I'd like to ask you about HW wallet, if it gets broken, I only need to buy a new one and insert the mnemonic to restore all the wallets at the same time? And, it supports to have multiple accounts (wallets) using the same HW wallet?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8xafwb",
                                    "author": "dlq84",
                                    "score": 3,
                                    "created_utc": 1652777097.0,
                                    "response": "Yes, that's the idea, any wallet (software or hardware) that support the same seed standard (BIP39) can restore it. So keeping your seed safe is vital.\n\nYes, you can have multiple \"accounts\".",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8xb3z8",
                                            "author": "fullmetalcryptomist",
                                            "score": 1,
                                            "created_utc": 1652777711.0,
                                            "response": "Okey, thank you so much :)",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i8xah9s",
                                    "author": "Albo-LuckyBastard",
                                    "score": 2,
                                    "created_utc": 1652777133.0,
                                    "response": "Yes you can restore all your Cryptos if your device is broken, just buy a new one and restore it with your 24 words (seedphrase), if you want to move your funds faster (device stolen) you can also use a software wallet (electrum) to move funds faster to a temporary Software wallet or Exchange!",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8xb2c6",
                                            "author": "fullmetalcryptomist",
                                            "score": 1,
                                            "created_utc": 1652777668.0,
                                            "response": "In case it was stolen, how could I use electrum without having the HW wallet?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8xb7vp",
                                                    "author": "Albo-LuckyBastard",
                                                    "score": 3,
                                                    "created_utc": 1652777814.0,
                                                    "response": "Thats why you need the 24 Words phrase(Bip 39 Standard), the most Important thing is to secure it properly and never Digitalize it (take Pictures, Cloud saving, Pc hard drive saving etc, it should only exist on Paper handwritten, or steel Plate engraved) \nYour 24 Words will be your Door to restore everything you had on Nano x or Metamask or other connected wallets to te Ledger… ❗️❗️",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8xdlgw",
                                                            "author": "fullmetalcryptomist",
                                                            "score": 1,
                                                            "created_utc": 1652779998.0,
                                                            "response": "Ok, I understand. Thank you so much. Definitely, I'm going to buy one. I saw that there are different HW options, do you recommend some in particular?",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8xdnhm",
                                                                    "author": "Albo-LuckyBastard",
                                                                    "score": 3,
                                                                    "created_utc": 1652780049.0,
                                                                    "response": "I got the Ledger Nano X, its the best Wallet i got so far, Trezor wallets are also good or BitBox02 👍👍",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i8xb5xr",
                                                    "author": "fullmetalcryptomist",
                                                    "score": 2,
                                                    "created_utc": 1652777761.0,
                                                    "response": "Ok I think that's because they share the BIP39, no?",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}