{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uugzxs",
            "title": "Looks like Bitcoin mining difficulty will be reducing next week... #bitcoin #bitcoinmining #bitcoincrash",
            "url": "https://www.youtube.com/watch?v=7-2lKtj-X_E",
            "author": "MrBitcoinButlerToYou",
            "created_utc": 1653112993.0,
            "score": 0,
            "num_comments": 0,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uuh65i",
            "title": "Today's lesson: Be an Apathetic investor",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uuh65i/todays_lesson_be_an_apathetic_investor/",
            "author": "BroncoFanInOR",
            "created_utc": 1653113789.0,
            "score": 55,
            "num_comments": 51,
            "subreddit": "Bitcoin",
            "selftext": "If you are on a 5+ year plan and believe in BTC, learn how to be apathetic about ANY news, price predictions, FUD & fucking charts. \n\nWho cares if you miss the bottom or DCA in over the highs and lows. You are still going to be making a minimum of 10x. do you really care if you missed a low by 10k? Not if BTC goes to $400,000.\n\nIt doesn't matter! You are in this for the long run and all of this noise just makes the ride uncomfortable. Take the higher path and don't look or listen to fear. Have a who the fuck cares attitude. You'll end up a hellava lot richer than you are today and a happy person for being apathetic all long the way.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9fdzxp",
                    "author": "Asum_chum",
                    "score": 15,
                    "created_utc": 1653119045.0,
                    "response": "I spent 2018 thinking it was going to recover, watching my shitcoins sinking as well as my bitcoin (in fiat terms) and I eventually decided it’s gone. Chalk it down to a life experience. If they ever hit my buy in cost, I’ll sell them and leave it there. Then I started to deep dive into bitcoin using the What Bitcoin Did beginners guide series and realised everything else was actually a shitcoin. I then started buying bitcoin again in 2019 and still planned to exchange my shitcoins for bitcoin when they hit par but I ended up doing it at a loss because I didn’t want to Hodl anything else. Some of those coins, top ten in the 2017/18 run, never hit my average buy in during this last run.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9fsy73",
                    "author": "BTCMachineElf",
                    "score": 10,
                    "created_utc": 1653132421.0,
                    "response": "I'm 5 years in. The first year was such an emotional rollercoaster. In time I got my 'sea legs'. Now nothing phases me. Thankfully I hodled.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9fa9bq",
                    "author": "gruffbear212",
                    "score": 3,
                    "created_utc": 1653115782.0,
                    "response": "Also being a lazy investor helps too I think, just set up your shit and let it get on with its thing while you do yours. But agree that you need to get BTC off exchanges and into proper self custody storage",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9f9uek",
                    "author": "Particular_Ad5888",
                    "score": 2,
                    "created_utc": 1653115431.0,
                    "response": "From your mouth to god’s ears !",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9gip6a",
                    "author": "CoHemperor",
                    "score": 2,
                    "created_utc": 1653146610.0,
                    "response": " I like hopium 🥰 not FUD 🤨",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9h2kgo",
                            "author": "Vilv25",
                            "score": 1,
                            "created_utc": 1653155703.0,
                            "response": "Hopium is always good for us and we want everyday hopium, FUD will create further negative sentiment in market which will result in panic selling of coins and no one loves it only whales accumulate at this low price",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9fko00",
                    "author": "solomonsatoshi",
                    "score": 10,
                    "created_utc": 1653125203.0,
                    "response": "This post is misleading.\n\nThere is absolutely zero guarantee Bitcoin will go to $400000, or even $100000.\n\nThere are significant forces determined to destroy or at least capture and control Bitcoin.\n\nThe fiat debt slavery cartel is the most powerful profitable cartel in the world ... and by a significant margin.\n\nONLY BUY BITCOIN if you recognise the risks and challenges ahead but also want to be part of the revolution seeking to bring integrity, fairness and transparency to the monetary system.\n\nDo not believe anything is inevitable in this project- although already Bitcoin has succeeded beyond my hopes to raise awareness of the corrupt fiat system there is a long way to go yet before victory is certain.\n\n**Lagarde Says Crypto Is ‘Worth Nothing’ and Should Be Regulated**\n\nhttps://archive.ph/nLwjp",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ftig6",
                            "author": "lightbulb-7",
                            "score": 3,
                            "created_utc": 1653132852.0,
                            "response": "True",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9fvbz1",
                            "author": "OffThread",
                            "score": 2,
                            "created_utc": 1653134161.0,
                            "response": "Honestly, you got to be kidding yourself if you think bitcoin will never go back up. Or maybe its just not understand the full scope and power of bitcoin.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9gdtqy",
                                    "author": "Jetjones",
                                    "score": 5,
                                    "created_utc": 1653144368.0,
                                    "response": "OP was pretty realistic in his statement. It’s by being over optimistic like you that you get burnt.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9gh8rp",
                                            "author": "OffThread",
                                            "score": 0,
                                            "created_utc": 1653145936.0,
                                            "response": "Why do you not think bitcoin will raise in value over the next decade?  What factors make you think we will not continue this exponential growth?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9gjhvf",
                                                    "author": "Jetjones",
                                                    "score": 1,
                                                    "created_utc": 1653146984.0,
                                                    "response": "There’s tons of reasons why bitcoin could stagnate or go lower. Even tho halvings give an incentive for the price to go up, demand needs to at least stay the same. Manipulation, governments regulations or bans for a variety of reasons, CBDCs, recession could also affect btc in unprecedented ways, burst of interest towards crypto in general, other cryptos tarnishing bitcoin’s name - nobody knows for sure that it will hold up and keep going up. You’d be stupid not to at least admit there’s a chance bitcoin doesn’t grow forever.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9gwpib",
                                                            "author": "OffThread",
                                                            "score": 1,
                                                            "created_utc": 1653153027.0,
                                                            "response": "Weeks after two nations agree to use Bitcoin as their currency and we all find out large sums can be moved on the lighting network you think we're stagnant or heading towards it?  \n\nStop listening to the fud, they want you to think that way.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9gefhn",
                                    "author": "jsbjsb12345",
                                    "score": 0,
                                    "created_utc": 1653144645.0,
                                    "response": "True, my tulips have infinitely increased in price and I am now the worlds richest person",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9ghh5j",
                                            "author": "OffThread",
                                            "score": 3,
                                            "created_utc": 1653146043.0,
                                            "response": "You got to be kidding with this 2010 argument.  \n\nYes tulip bulbs are the same as Bitcoin which solved a double-spending problem using a peer-to-peer network forming a record that cannot be changed without redoing the proof-of-work created by the largest mass of computational hardware in the history of human kind. \n\nThere totally the same.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9gsx4v",
                                                    "author": "solomonsatoshi",
                                                    "score": 1,
                                                    "created_utc": 1653151309.0,
                                                    "response": "Tulips did not directly challenge the state banker-fiat debt slavery monetary cartel system of power, wealth and control over humanity.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9gwd7p",
                                                            "author": "OffThread",
                                                            "score": 3,
                                                            "created_utc": 1653152872.0,
                                                            "response": "Thus the importance of holding the keys to your own bitcoins.  The ledger is public, anything on the chain is known. Banking cartels can only fake what they can pretend to own. Remove them from the equation and there's nothing they can do.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9gx4fg",
                                                                    "author": "solomonsatoshi",
                                                                    "score": 2,
                                                                    "created_utc": 1653153217.0,
                                                                    "response": "Yes.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9gu4es",
                                    "author": "solomonsatoshi",
                                    "score": 0,
                                    "created_utc": 1653151862.0,
                                    "response": "I have not asserted it will not ever go back up. IMO it *probably* will, but with the proviso here there are *zero guarantees given the very powerful and wealthy forces that Bitcoin challenges.*  To ignore those forces as you appear to do and/or to assume that triumph over them is somehow magically inevitable, and that $400,000 is inevitable, is IMO indicative that you do not understand the true scope, nature and context of Bitcoin.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9gx1ct",
                            "author": "BroncoFanInOR",
                            "score": 1,
                            "created_utc": 1653153177.0,
                            "response": "The EU Central bank president thinks that BTC is worth nothing. Call me shocked that a wealthy banker thinks that.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9gyw5o",
                                    "author": "solomonsatoshi",
                                    "score": 2,
                                    "created_utc": 1653154017.0,
                                    "response": "Yes Bitcoin provides Europeans with an alternative MoE and SoV to the Euro - the Euro which is imposed by the EU and the banks upon all citizens by force. Lagarde is elected to her position by EU politicians and has the backing of the bankers. Her desire to FUD Bitcoin is both an obvious conflict of interest and dishonesty, but how many EU politicians will support Europeans freedom of choice? The opposition to Bitcoin is very, powerful, dishonest and corrupt. Victory for Bitcoin is possible but not guaranteed.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9h1wkl",
                                            "author": "BroncoFanInOR",
                                            "score": 1,
                                            "created_utc": 1653155396.0,
                                            "response": "I do agree that there are many forces at play here that can derail crypto. But I also remember the early days of the internet where every damn govt tried to control and derail this freedom also. \n\nI guess it comes down to each persons research, beliefs and convictions. I currently see a very bright future for BTC. I can’t say that for 99% of the other crypto market.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9h7gwn",
                                                    "author": "solomonsatoshi",
                                                    "score": 2,
                                                    "created_utc": 1653158027.0,
                                                    "response": "Totally agree there are good grounds for hope, but with caution and acknowledging there are risks. IMO the potential for positive change which Bitcoin provides makes investing in Bitcoin something I want to do. \n\nGiven the state of the world it is something positive we can all do to potentially preserve and strengthen our wealth, rights and freedoms whereas a world where surveillance state fiat CBDCs are imposed on us by Lagarde & Co and Bitcoin is suppressed is something to be resisted.\n\nBitcoin is monetary liberty and freedom from state/banker imposed fiat debt slavery and debasement...ie Bitcoin is a great investment IMO!",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9f92k0",
                    "author": "bdjilka",
                    "score": 1,
                    "created_utc": 1653114776.0,
                    "response": "Agree with post.  \n\nI also want to mention that you need to buy BTC only on decentralized exchanges like Simple Swap or 1inch and never store it on cex wallets like binance.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9fae15",
                            "author": "alien3d",
                            "score": 3,
                            "created_utc": 1653115893.0,
                            "response": "cex wallets do care explain to newbies here.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9fpemk",
                                    "author": "CarbonTail",
                                    "score": 2,
                                    "created_utc": 1653129558.0,
                                    "response": "Centralizes exchanges where you don't hold the keys. Not your keys, not your coins.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9fq76t",
                                            "author": "alien3d",
                                            "score": 3,
                                            "created_utc": 1653130233.0,
                                            "response": "not my key ? which mean the exchange hold it for me ?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9fqnqs",
                                                    "author": "CarbonTail",
                                                    "score": 3,
                                                    "created_utc": 1653130618.0,
                                                    "response": "Yes.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9fahgz",
                            "author": "West-Effective3790",
                            "score": 3,
                            "created_utc": 1653115975.0,
                            "response": "SIMPLE SWAP:\n\n You may be asked to provide the following information and/or documents (including, but not limited to):\n\nyour full name, residential address, and phone number;\n\na copy of your legal documents, such as an ID or a passport, a selfie of you holding the document;\n\ninformation about your occupation, a utility bill or any official proof of address, proof of funds.\n\nNo thanks!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9fb1ep",
                                    "author": "bdjilka",
                                    "score": 3,
                                    "created_utc": 1653116453.0,
                                    "response": "This is the usual process for buying cryptocurrencies through a visa or mastercard. Otherwise, you will not be able to because of a law EU.  \nOne way or another, I personally bought there and everything went smoothly for me, the cryptocurrency almost immediately arrived in my wallet.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9fmfkl",
                    "author": "dzdra",
                    "score": 0,
                    "created_utc": 1653126876.0,
                    "response": "If you buy something 0.20$ or even 0.60$ it doesnt matter when u sell it 10$",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9g6gy0",
                            "author": "senfmeister",
                            "score": 4,
                            "created_utc": 1653140789.0,
                            "response": "$0.20 to $10 is 50x, $0.60 to $10 is 16.7x. Both are nice, but the $0.20 cost basis is three times better.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9g7ony",
                                    "author": "dzdra",
                                    "score": -2,
                                    "created_utc": 1653141414.0,
                                    "response": "So you are telling me that 9.80 is three times bigger than 9.40 ? It depends how you think about it. But the human being is like that, we always search for max (and fast) profits in terms of « x » or leverage. This is gamble for too much ppl. I dont even want x2 on my invest, i just want a better alternative from banks.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9gfljr",
                                            "author": "senfmeister",
                                            "score": 3,
                                            "created_utc": 1653145188.0,
                                            "response": ">So you are telling me that 9.80 is three times bigger than 9.40 ? It depends how you think about it.\n\nNo, it really isn't just how you think about it. \n\nIf you have $100, you can buy 500 things that cost $0.20. If those things become worth $10 each, you now have $5,000 worth of those things. You turned $100 into $5,000.\n\nIf you buy $100 worth of something that costs $0.60 each, you can buy 166 of them (with $0.40 left over). If those things become worth $10 each, you now have $1,660.40 worth of those things. You turned $100 into $1,660.40, which is great! It's $3,339.60 less than if you were able to buy them for $0.20, though.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9gytaz",
                                                    "author": "dzdra",
                                                    "score": 1,
                                                    "created_utc": 1653153981.0,
                                                    "response": "If it costs 0.60 then i’ll put 300$. I understood wtv ^^",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9gzl9j",
                                                            "author": "senfmeister",
                                                            "score": 2,
                                                            "created_utc": 1653154332.0,
                                                            "response": "Great, then you've turned $300 into $5,000 rather than $100 into $5,000. You could have turned $300 into $15,000 if you were able to buy with the $0.20 cost basis.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9h1bdc",
                                                                    "author": "dzdra",
                                                                    "score": 1,
                                                                    "created_utc": 1653155125.0,
                                                                    "response": "But when the btc is at 60k he is not at 20k in the same time, thats the point i was trying to make. Of course you will choose the cheaper but ut wasnt my goal. Sorry for poor english.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9gln43",
                                            "author": "Lysorgic",
                                            "score": 1,
                                            "created_utc": 1653147979.0,
                                            "response": "There is a huge different between 0.20 / 0.60 and 9.40 / 9.80 dude. What kind of logic…",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9fo66t",
                            "author": "Forgot_Password_Dude",
                            "score": 3,
                            "created_utc": 1653128451.0,
                            "response": "by that time you wont need to sell it",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9hb8mt",
                    "author": "Undercover_Rabbi93",
                    "score": 1,
                    "created_utc": 1653159850.0,
                    "response": "Take it you fucs",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9hdi4i",
                    "author": "JJackes",
                    "score": 1,
                    "created_utc": 1653160951.0,
                    "response": "We are here for investing not for trading because it's stress free, and you don't care about current volatility in investing and we see the long-term picture, let's hope market will stay with us till end so we can make huge gains",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9f9ees",
                    "author": "MrDopple68",
                    "score": -1,
                    "created_utc": 1653115051.0,
                    "response": "Meh",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9fnz0l",
                    "author": "Eastern-Ad-298",
                    "score": -1,
                    "created_utc": 1653128277.0,
                    "response": "In other words, “Don’t Look Up.” A comet was definitely NOT heading for Leo and Tether is most definitely NOT a scam.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9g4ozh",
                            "author": "MiguelLancaster",
                            "score": 2,
                            "created_utc": 1653139849.0,
                            "response": "tether being a scam or not is of little importance to bitcoin",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9gs90n",
                                    "author": "Eastern-Ad-298",
                                    "score": -1,
                                    "created_utc": 1653151006.0,
                                    "response": "Lol okay keep telling yourself that. Either way, Tether, Bitcoin, crypto, it’s all a scam and you guys are the late entrant bag holders who are probably going to lose everything you put in, I’m sorry to say.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9gxkae",
                                            "author": "BroncoFanInOR",
                                            "score": 1,
                                            "created_utc": 1653153424.0,
                                            "response": "I mean this in the kindest way possible. But why even post in a true BTC sub if you have zero belief in the technology and future? Or are you just a dick all the time to everyone?",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i9h4ucy",
                                            "author": "MiguelLancaster",
                                            "score": 1,
                                            "created_utc": 1653156765.0,
                                            "response": "okay, guy",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9ge42z",
                    "author": "jsbjsb12345",
                    "score": 0,
                    "created_utc": 1653144504.0,
                    "response": "'You are still going to be making a minimum of 10x' amazing future crystal ball man, I must invest my life savings this instant!",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}