{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uwf2ra",
            "title": "Hundreds of Chinese university grads are getting arrested when they go back home because they were identified online as being bitcoin traders or just for owning a cryptocurrency wallet. Snowden was right about blockchain security having a weak link that compromises trading privacy.",
            "url": "https://www.reddit.com/r/ChinaBitcoinNews/comments/uwdq5h/so_far_230_chinese_graduates_of_us_universities/",
            "author": "artificialfire",
            "created_utc": 1653354183.0,
            "score": 3,
            "num_comments": 20,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9r51zf",
                    "author": "nullc",
                    "score": 10,
                    "created_utc": 1653354681.0,
                    "response": "They're not being arrested because of \"blockchain\"-- they're presumably being arrested because of exchanges giving up user's personal info without assuring that it won't be abused by authoritarian regimes.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9r7t5i",
                            "author": "bitsteiner",
                            "score": 2,
                            "created_utc": 1653356017.0,
                            "response": "Right, is has little to do with Blockchain. They were spied on by Chinese agents in the US: \"3 of the 150 “wolf-pack” agents sent from China to hunt down university students trading and mining in cryptocurrencies in America, U.K., Canada, and Australia. Some have actually enrolled in universities and others just hang out on campuses overseas and “recruit” members into “Crypto Clubs” or Wei Xin groups. An insider wolf says they were provided lists of over 5,000 Chinese student studying abroad who were monitored electronically trading with Iphones.\" (article linked in the comments).",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9r7mzj",
                            "author": "artificialfire",
                            "score": 0,
                            "created_utc": 1653355933.0,
                            "response": "**No, they are being arrested because it is illegal in China for Chinese citizens to buy, sell, or trade any cryptocurrency.  See details at** r/ChinaBitcoinNews",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9rdygp",
                                    "author": "nullc",
                                    "score": 1,
                                    "created_utc": 1653358947.0,
                                    "response": "How is it not a huge scandal that there are undisclosed agents of the Chinese government conducting operations on US soil to arrange arrests for disloyalty of students at our universities when they arrive in china?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9r6kcc",
                    "author": "Nada_Lives",
                    "score": 4,
                    "created_utc": 1653355412.0,
                    "response": "China is asshole.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9rb2ei",
                            "author": "artificialfire",
                            "score": 1,
                            "created_utc": 1653357568.0,
                            "response": "I hope you don't blame the uni students for their government. They were trading just like the rest of us to make some money. They have international tuition to pay which is double what you and I would pay (They pay $80,000 a year to attend NYU). They have zero say in what their government does - just like us!  We only have the illusion of having a say, but in reality the elite do what they damn well please.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9r5zzo",
                    "author": "Frognation777",
                    "score": 3,
                    "created_utc": 1653355145.0,
                    "response": "I scrolled through the post. The title is misleading. The “Chinese students” are not really “students”. They are the bitcoin miners got students visa. (Easy to apply I guess).",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9r6zin",
                            "author": "bitsteiner",
                            "score": 1,
                            "created_utc": 1653355617.0,
                            "response": "They took their mining machines to US after China banned mining?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9r7y1n",
                                    "author": "Frognation777",
                                    "score": 2,
                                    "created_utc": 1653356082.0,
                                    "response": "They moved their operations to US. So they need visas.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9r8way",
                                    "author": "artificialfire",
                                    "score": 1,
                                    "created_utc": 1653356535.0,
                                    "response": "**No.  Once again these are not miners. These are regular Chinese students from NYU, Columbia, Stanford, etc. who were investing and trading in Bitcoin, which they cannot do back in China.  Regarding  the privacy problem and blockchain flaws, see** r/PrivacySelfDefense   **There is no real privacy when trading bitcoin, ESPECIALLY if you use an IPHONE.**",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9rakdk",
                            "author": "artificialfire",
                            "score": 1,
                            "created_utc": 1653357334.0,
                            "response": "**No, they are UNIVERSITY GRADUATES - not miners. They were trading online. What article did you read?  Please give us a link. Otherwise see the posts at** r/ChinaBitcoinNews",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9r4i80",
                    "author": "uncontrollableop",
                    "score": 2,
                    "created_utc": 1653354415.0,
                    "response": "every other asset has weaker links. so not sure what you're implying.  they fucked up. they could have obfuscated their identities and hidden their wallets. they didn't.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9r5cd4",
                            "author": "hairyscrotes",
                            "score": 1,
                            "created_utc": 1653354822.0,
                            "response": "You know what he’s implying. It bugs you so bad",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9rac4k",
                            "author": "artificialfire",
                            "score": 1,
                            "created_utc": 1653357224.0,
                            "response": "Sorry, but according to Ed Snowden and Bruce Schneier the top two IT experts in the world, any hacker who has access to a super computer (12 in the world) can hack blockchain and manipulate bitcoin or simply identify miners and traders. Taproot did not solve the problem. Furthermore, Apple finally caved to the DOJ and gave access to every Iphone in the world so NSA/FBI can easily insert key-loggers. Lastly, Tor was compromised over a year ago.  All these stories are well-documented at r/PrivacySelfDefense  So unless you are friends with Chinese Crypto Club members, your potential demise will not come from a Chinese student who got busted.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9r4ior",
                    "author": "Oilfieldtrash631",
                    "score": 1,
                    "created_utc": 1653354421.0,
                    "response": "Yup and soon they will freeze your accounts even easier.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9r4o4p",
                    "author": "Keith_Kong",
                    "score": 1,
                    "created_utc": 1653354494.0,
                    "response": "This is horrible. Certain individuals definitely need to keep their Bitcoin interactions private. Hopefully most Chinese individuals knew to remain quiet about their interactions with Bitcoin. Hard to have that foresight though (with the Chinese police you just gotta assume the worst on everything).",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9r7fom",
                    "author": "sarahhenders",
                    "score": 1,
                    "created_utc": 1653355833.0,
                    "response": "Lol, bitcoin is a planet saver",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9r7jxi",
                    "author": "Any_Loquat1854",
                    "score": 1,
                    "created_utc": 1653355890.0,
                    "response": "I always thought this too. The government knows how many times and at what times you take your shit. \n\nThe purpose of cryptocurrency is to operate outside of a system created by the government... A SECOND OPTION....it doesn't mean you can do whatever hell you want under complete secrecy lol...\n\nOnce uncle sam planted its systems in place, that's it, they know everything.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9r7xcx",
                    "author": "pink_raya",
                    "score": 1,
                    "created_utc": 1653356073.0,
                    "response": "snowden was wrong about every single part of bitcoin, on a separate occasion. Quite an outstanding record, really.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9rf4op",
                    "author": "Marcion_Sinope",
                    "score": 1,
                    "created_utc": 1653359531.0,
                    "response": "That's why you should never use KYC exchanges.\n\nNo matter where you live.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}