{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uyi3d2",
            "title": "Can government track bitcoin",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/uyi3d2/can_government_track_bitcoin/",
            "author": "Diet_Inevitable",
            "created_utc": 1653600767.0,
            "score": 3,
            "num_comments": 43,
            "subreddit": "BitcoinBeginners",
            "selftext": "This is a serious question I need to apply for ssi and was wondering if they can find out, if I receive money thru bitcoin",
            "stickied": false,
            "comments": [
                {
                    "id": "ia49aes",
                    "author": "Mallardshead",
                    "score": 12,
                    "created_utc": 1653601271.0,
                    "response": "Anyone can track bitcoin. That's the beauty of an open transparent ledger. Can they track you? that's is the question. The blockchain is pseudonymous, not anonymous. So if you're not using an exchange with KYC (Coinbase, Gemini, etc) and have taken self-custody of your bitcoin, you'll be fine. No ssi is ever going to know unless you let hem know.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia49bq1",
                    "author": "EntertainerWorth",
                    "score": 3,
                    "created_utc": 1653601287.0,
                    "response": "Depends but yes. The moment you connect your identity to an on or off-ramp. Or if you buy giftcards with an account linked to your id, etc. bitcoin uses a public ledger which allows tracking via blockchain analysis companies/solutions.\n\nIf you use a “wallet” not connected to your id on a phone not connected to your id then it would be more difficult to track when you use bitcoin in a circular economy (meaning you don’t cash out)\n\nSomeone feel free to correct me if I’m mistaken.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia4c9kn",
                            "author": "Diet_Inevitable",
                            "score": 1,
                            "created_utc": 1653602576.0,
                            "response": " if i send it to someone else and they cash it out  they wouldnt be able to track me?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia4jvkg",
                                    "author": "bitusher",
                                    "score": 3,
                                    "created_utc": 1653606101.0,
                                    "response": "Chain analytics is probabilistic guess work and sending bitcoin with a lightning wallet is extremely private. if you want to use bitcoin privately you can",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia4kdvs",
                                            "author": "EntertainerWorth",
                                            "score": 2,
                                            "created_utc": 1653606341.0,
                                            "response": "There are some issues with lightning privacy but it is much better than on-chain that’s for sure.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia4khaq",
                                                    "author": "bitusher",
                                                    "score": 4,
                                                    "created_utc": 1653606387.0,
                                                    "response": "There is no such thing as 100% anonymity in anything . Privacy is a spectrum and a complex topic",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "ia54c6c",
                                                            "author": "EntertainerWorth",
                                                            "score": 1,
                                                            "created_utc": 1653616053.0,
                                                            "response": "Agreed",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "ia4esl1",
                                    "author": "Remarkable_News2455",
                                    "score": 0,
                                    "created_utc": 1653603719.0,
                                    "response": "Just try it out for a small amount",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "ia4cjn9",
                            "author": "Diet_Inevitable",
                            "score": 1,
                            "created_utc": 1653602699.0,
                            "response": "okay, fyi ssi only lets you have 2000 in a bank account which is ridiculous if your applying on your own and no one can help you  so like i would be homeless or ask my abusive family for money no thank u",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia4ilwp",
                                    "author": "Brettanomyces78",
                                    "score": 2,
                                    "created_utc": 1653605497.0,
                                    "response": "The SSI rules are onerous, for sure.  But trying to skirt them is difficult, and may open you up to trouble years after the fact.  You might be able to pull off hiding assets like this, if you're very careful, but it's awful risky, and it requires good knowledge of how this all works.  Since you're just starting out, that may not be your best option.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia4jyax",
                                            "author": "Diet_Inevitable",
                                            "score": 1,
                                            "created_utc": 1653606137.0,
                                            "response": "I understand but this would be the third time trying if I do and I don’t want to b homeless and I am poor struggling to keep my job and I don’t know what to do.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia4k30j",
                                                    "author": "Brettanomyces78",
                                                    "score": 2,
                                                    "created_utc": 1653606199.0,
                                                    "response": "Good luck.  Hope you figure something out.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "ia4k7ti",
                                                            "author": "Diet_Inevitable",
                                                            "score": 1,
                                                            "created_utc": 1653606262.0,
                                                            "response": "Thanks",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "ia5bc62",
                            "author": "BlockChainR3volution",
                            "score": 1,
                            "created_utc": 1653619486.0,
                            "response": "It still shows the btc getting to that wallet… and then again back when it’s connected again n sent… hence why we ate aware wallets r being activated after they’ve been cold for a decade",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia4h3c1",
                    "author": "Jetjones",
                    "score": 2,
                    "created_utc": 1653604787.0,
                    "response": "What you want to do is open a wallet that has never touched any KYC (client identification). If you buy or sell BTC with most exchanges, they'll ask you to identify yourself and if you send that BTC to your wallet, anyone can see that transaction on the blockchain so it's easy to trace.\n\nThat said, anybody can create a wallet without KYC. So if you never link it to any form of KYCd wallet, you're good. Just sell the coins thru P2P using BISQ or something. That's if you want to sell, tho.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia5b6ss",
                    "author": "BlockChainR3volution",
                    "score": 1,
                    "created_utc": 1653619410.0,
                    "response": "Its digital. Why would u think it cant",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia485ai",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653600768.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia4s4wl",
                    "author": "igadjeed",
                    "score": 1,
                    "created_utc": 1653610089.0,
                    "response": "Not reliably. Guessing is common. Guesses are more or less accurate depending on the behavior of the spenders, but never 100% accurate  \n\nExplore the nuance here:  \nhttps://en.bitcoin.it/wiki/Privacy",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia597ys",
                    "author": "Still_Not-Sure",
                    "score": 1,
                    "created_utc": 1653618421.0,
                    "response": "If you have enough in bitcoin… this would be an option.\n\nGo to mexico for a month or so.. try to get an address and some kind of ID… as if you are planning to live there and apply for citizenship..\n\nthen use that ID to start an international account to subvert the system…  \n\nit will still be in your name but the numbers should hit an international address.\n\nI’m sure there are better ways to do this.. but this would be fun as you would have to take vacations to mexico once a year i guess.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia5iqjv",
                    "author": "legoprimero",
                    "score": 1,
                    "created_utc": 1653623325.0,
                    "response": "Or just be honest",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia5ir9a",
                    "author": "bdjilka",
                    "score": 1,
                    "created_utc": 1653623336.0,
                    "response": "Anyone can track bitcoin. This is the point of the blockchain, that every transaction is traceble.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia5o3zv",
                    "author": "ApplicationNo5082",
                    "score": 1,
                    "created_utc": 1653626489.0,
                    "response": "We all can. There is no secrets",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia5wem8",
                    "author": "graphic-crypto",
                    "score": 1,
                    "created_utc": 1653632230.0,
                    "response": "Pseudonymous not anonymous.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia60u5k",
                    "author": "Economy_Director_761",
                    "score": 1,
                    "created_utc": 1653635772.0,
                    "response": "I don’t think government can take over bitcoin, but they can incriminate all the transactions involving bitcoin, which is definitely possible, and would make bitcoin transactions incredibly costly, negating it’s biggest advantage.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia7j4tw",
                    "author": "aktiveradio",
                    "score": 1,
                    "created_utc": 1653668114.0,
                    "response": "Yes, the ledger is public and if you ever bought on an exchange the KYC is attached to your address. There are many services used to track you and your bitcoin.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iabhk8a",
                    "author": "Fragrant-Mongoose67",
                    "score": 1,
                    "created_utc": 1653749740.0,
                    "response": " cryptocurrencies have a reputation for anonymity, but now the government is sending a message to crypto thieves, they can track you down.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iabo69v",
                    "author": "National-Run4610",
                    "score": 1,
                    "created_utc": 1653752846.0,
                    "response": "Another method the IRS uses to track cryptocurrency and virtual currency transactions is to issue subpoenas. Over the past few years, the IRS has issued many subpoenas to several exchanges, ordering them to disclose certain user accounts.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia57udb",
                    "author": "CryptoAnarchyst",
                    "score": 0,
                    "created_utc": 1653617754.0,
                    "response": "I think you miss the point my friend. Completely.\n\nGet your head screwed on straight, then start asking the right questions in life.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}