{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uzpeub",
            "title": "Tech Hustler Crypto Influencers GiveAway",
            "url": "https://sweepwidget.com/view/57253-bn1yp3xm",
            "author": "Farmer_Joshua",
            "created_utc": 1653751023.0,
            "score": 1,
            "num_comments": 0,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uzpemi",
            "title": "Bitcoin is not a hedge against inflation. It's a hedge against central banking as a whole.",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uzpemi/bitcoin_is_not_a_hedge_against_inflation_its_a/",
            "author": "Acceptable-Risks",
            "created_utc": 1653751005.0,
            "score": 464,
            "num_comments": 141,
            "subreddit": "Bitcoin",
            "selftext": "Inflation is a symptom of a bigger disease called central banking and unfortunately, as I post this, bitcoin is still tied to and valued in fiat currency. While people still invest in bitcoin hoping to cash out for fiat, you can be sure bitcoin will not decouple from fiat currency, and you'll see the \"value\" of it move with other markets tied to fiat (although we all know the real value is priceless)\n\n\nWe know the central banking system is collapsing. The ship is sinking and they cannot keep it afloat much longer. Decades of manipulation and Bipolar policy has damaged fiat beyond repair. It's going to zero, as it has in many areas of the world already. When you buy bitcoin you should understand you're betting against the central banks. You're betting against fiat currency altogether. You're expressing your desire to see this decentralized monetary system become the standard, so you should expect to have to hold for a decade or several decades to see the vision come true. Once the fiat currency system finally collapses for good (and it will) your Bitcoin will be the only life raft you have. It will be the only life raft anyone has, and then you'll see everything else valued in satoshis. \n\n\nDo you think the world is going back to trading physical gold when fiat finally collapses? I don't think so. In today's world technology is important and convenience. The world will choose bitcoin when central banking dies. Get on the boat and don't sell your bitcoin for any shitcoins especially the ultimate shitcoin USD.",
            "stickied": false,
            "comments": [
                {
                    "id": "iac76xa",
                    "author": "Hectic-Mind",
                    "score": 66,
                    "created_utc": 1653761809.0,
                    "response": "We can no longer trust central banks and governments. The internet has connected everyone, thus allowing us to see through the bullshit. We need a decentralized currency for everyone.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iacarag",
                            "author": "Acceptable-Risks",
                            "score": 36,
                            "created_utc": 1653763540.0,
                            "response": "It's certainly time to end this ridiculous game of bankers and governments controlling money.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iacresm",
                                    "author": "road22",
                                    "score": 12,
                                    "created_utc": 1653771493.0,
                                    "response": "Central Bankers, and large banks were invited to a free money party, they borrowed for nothing and devalued our currency.\n\nThey had a nice party and we, the public,  were not invited.\n\nWe will have our own Bitcoin Party.   We have to let the bankers join our party,  but at a much higher price when their party is over.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "iad5gqm",
                            "author": "BiLoSellHigher",
                            "score": 2,
                            "created_utc": 1653778195.0,
                            "response": "Clearly can't trust tether either",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iadeqwp",
                                    "author": "Acceptable-Risks",
                                    "score": 7,
                                    "created_utc": 1653783072.0,
                                    "response": "No, you can't trust stable coins or even cbdc when they rear their ugly heads. They're all based on houses of cards and they will collapse.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iacpu89",
                    "author": "slvbtc",
                    "score": 23,
                    "created_utc": 1653770736.0,
                    "response": "Bitcoin is a hedge against bank bailouts, its literally in the genisis block. \n\nBitcoin is a hedge against the entire financial system from central banks to commercial banks.\n\n99% of people will not buy bitcoin to hedge run away inflation. But 99% of people will buy bitcoin when their bank collapses, their credit card stops working and their grocery store accepts lightning payments.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iacripr",
                            "author": "Acceptable-Risks",
                            "score": 10,
                            "created_utc": 1653771544.0,
                            "response": "Exactly. We don't want that to happen but because of human tendency towards convenience it is what will most likely happen. People will have to see a collapse and feel the pain before they realize we were right all along and they should have slowly adopted bitcoin and replaced fiat.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iaclw3p",
                    "author": "braamdepace",
                    "score": 15,
                    "created_utc": 1653768904.0,
                    "response": "Bitcoin is a lot of things right now.  It’s a doomsday currency, it’s an inflation hedge, it’s a speculative asset, it’s central banking hedge, it’s a technology play, plus hundred more things.  All of things are components of its price and value. People buy, sell and hold for different reasons.  You can’t look at it and say “why is it dropping due to inflation, it’s a hedge against inflation.”  Also you can’t say it’s a hedge against central banks, because monetary policy and central banks is in probably one of the worst spots it’s been in a while.  Yet BTC isn’t at an all time high.\n \nBTC is wearing many hats right now don’t let anyone tell you it’s not any one of a number of different things.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iad7xfa",
                            "author": "Bladerslash",
                            "score": 2,
                            "created_utc": 1653779447.0,
                            "response": "Youve basically said a whole lot of nothing but something.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iad853d",
                                    "author": "braamdepace",
                                    "score": 3,
                                    "created_utc": 1653779561.0,
                                    "response": "Yeah I’m just saying anyone who tells you BTC is tied to predominantly one main thing is full of shit.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iad8d1u",
                                            "author": "Bladerslash",
                                            "score": 0,
                                            "created_utc": 1653779675.0,
                                            "response": "Hmm okay",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iabpvyn",
                    "author": "Western_Boris",
                    "score": 25,
                    "created_utc": 1653753645.0,
                    "response": "Try to cause inflation in Bitcoin and see if you succeed. There is your answer.\n\nBitcoin is volatile like all new asset class are. Volatility is a different thing than inflation.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iacch4y",
                    "author": "OldMercenary",
                    "score": 12,
                    "created_utc": 1653764380.0,
                    "response": "Bitcoin was never a hedge against inflation, I have never understood that argument. It was and still is an alternative to the current financial system that creates inflation.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iacoagd",
                            "author": "AdministrativeJob232",
                            "score": 3,
                            "created_utc": 1653770018.0,
                            "response": "Well it’s deflationary so it is exactly a hedge against inflation",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iacpt39",
                                    "author": "OldMercenary",
                                    "score": 8,
                                    "created_utc": 1653770720.0,
                                    "response": "You don't understand what a hedge is.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iacqc6k",
                                            "author": "AdministrativeJob232",
                                            "score": 1,
                                            "created_utc": 1653770980.0,
                                            "response": "Help me understand buddy",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iacs5wu",
                                                    "author": "OldMercenary",
                                                    "score": 6,
                                                    "created_utc": 1653771852.0,
                                                    "response": "What Is a Hedge? A hedge is an investment that is made with the intention of reducing the risk of adverse price movements in an asset. Normally, a hedge consists of taking an offsetting or opposite position in a related security.\n\nLink: https://www.investopedia.com/terms/h/hedge.asp\n\nBitcoin is not an offset or even the opposite of fiat, it is a completely different and new alternative system that is in the very, very early stages of adoption. For it to be a viable hedge we'd have to be in the stages of moderate to mass adoption and even then, I don't know if you'd be able to call it a hedge, it would be a total shift of the global financial system.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iacssdb",
                                                            "author": "AdministrativeJob232",
                                                            "score": -1,
                                                            "created_utc": 1653772161.0,
                                                            "response": "Bitcoin isn’t a security first of all,\n\nAnd it’s clear your haven’t looked at the all time chart of the USD versus Bitcoin. Or literally any fucking asset ever, versus bitcoin. \n\nF outta here",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "iacv4ge",
                                                                    "author": "OldMercenary",
                                                                    "score": 6,
                                                                    "created_utc": 1653773296.0,
                                                                    "response": "Bitcoin value is going down while inflation is going up, what part of that tells you Bitcoin is a hedge against inflation?\n\nAnd don't start with \"look at the whole chart\", bitcoin value is going up as adoption is going up, not because it's a hedge against inflation.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "iaewrwu",
                                                                            "author": "Idk826",
                                                                            "score": 2,
                                                                            "created_utc": 1653821532.0,
                                                                            "response": "We’re in a bear market, we aren’t beating inflation right now but when we go back to bullish the roi will far outweigh inflation. Therefore in the long run being a hedge against inflation. A hedge doesn’t have to mean it must go up while inflation goes up. It just means you will return the purchasing power to your money that inflation lost you.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        },
                                                                        {
                                                                            "id": "iaehk9r",
                                                                            "author": "DarkSyde3000",
                                                                            "score": 1,
                                                                            "created_utc": 1653807932.0,
                                                                            "response": "True enough but other actual hedges have gone down also. Gold shot down $200-300 an ounce while everyone is fearful. Weird market.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iacneeb",
                    "author": "Glum-Information-713",
                    "score": 3,
                    "created_utc": 1653769621.0,
                    "response": "Control over and the success for the dollar is the government's top priority. It's how they can keep swinging the big stick around.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iadc4ko",
                    "author": "Familiar_Hotel_5269",
                    "score": 3,
                    "created_utc": 1653781657.0,
                    "response": "The whole fiat system was a way to trick people into thinking that the US didn’t default on their debt in the 70s. Crazy that people nowadays actually think that it serves a just purpose.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iadfxkh",
                    "author": "1two3Fore",
                    "score": 3,
                    "created_utc": 1653783709.0,
                    "response": "When are you going to learn that the bankers are backed by all the weight and power of ALL the central governments in the world. Does BTC have nuclear weapons, a powerful military, and a large network of domestic police?? I don’t fucking think so. WE HAVE TO FIX THE CENTRALIZED BANKING SYSTEMS…and get rid of the corrupt and unjust dickholes that are perpetuating the wealth gaps globally.  BTC is a BETTER gold than gold. It cannot replace fiat as a currency and it shouldn’t. It CAN be a store of wealth so that your years of hard work can retain purchasing power in the future! The centralized banking system and BTC NEED to coexist. Stop perpetuating endgame theories and Libertarian ideals when NOONE can reasonably survive without the systems in place. Even if you could, BTC will NOT survive without the Fiat pegged to it.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iadhdbs",
                            "author": "Acceptable-Risks",
                            "score": 2,
                            "created_utc": 1653784494.0,
                            "response": "I'm sorry but I wasn't able to draw out of your reply exactly what your concerns are for BTC as a mainstream currency to replace the bank systems. Are you arguing that the infrastructure of the current monetary system is necessary? Basically the bitcoin network is incapable of handling the requirements?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iadotzp",
                                    "author": "1two3Fore",
                                    "score": 1,
                                    "created_utc": 1653788642.0,
                                    "response": "No. I’m arguing that BTC won’t work as a monetary currency unless the current powers at be take control of it first. I’m also arguing the entire world is better off without a BTC revolution replacing fiat as everyday currency. BTC and fiat need to exist together, otherwise everyone is screwed. \nAny system is only as good as it’s keepers. Replace the weak and corrupt central bankers who’ve bailed out all the WORST criminals of our time, with better leaders who answer to the masses. We need better organized leadership not 100% decentralized anarchy.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iadra9n",
                                            "author": "Acceptable-Risks",
                                            "score": 3,
                                            "created_utc": 1653790035.0,
                                            "response": "Ok now I see where you are coming from. You are more of the mind that a centralized authority made up of people is a good thing and will keep things fair, whereas I do not like the idea of a central human authority and do not want to trust that a new group of leaders wouldn't corrupt the system all over again in some way. I actually prefer the rules based monetary software of BTC over human authority figures and my argument for that is very simple. It's easier to trust software to work the way it should than it is to trust humans to not be corrupt. \n\n\nI do recognize your concern that the current systems are much better established than the bitcoin network. It does need more adoption and innovation to mature to the point where it could be an easy transition. We're heading in the right direction. \n\nSide question but what area of the world are you from?",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iacuozf",
                    "author": "Fine-Artichoke-7485",
                    "score": 2,
                    "created_utc": 1653773086.0,
                    "response": "Bitcoin is Hope & Love. Many people are buying and investing long for their kids, grand kids, neices and nephews. It's Hope and Love for them. ❤️",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iadhnf1",
                    "author": "jhx264",
                    "score": 2,
                    "created_utc": 1653784655.0,
                    "response": "If bitcoin is \"tied to fiat\" as you say, then when fiat collapses, so will bitcoin. Maybe you wanna rephrase that.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iadj0cc",
                            "author": "Acceptable-Risks",
                            "score": 1,
                            "created_utc": 1653785406.0,
                            "response": "I do realize that wasn't the most accurate choice of words for the point I was making. Correlation would have been a better word. Most people seem to get the point though.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iaeho0p",
                                    "author": "DarkSyde3000",
                                    "score": 2,
                                    "created_utc": 1653808021.0,
                                    "response": "From what I've seen, bitcoin is tied to tech stocks. When those are mooning bitcoin goes parabolic. That's how the markets see it anyway.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iaedesr",
                    "author": "FamousAstronaut2153",
                    "score": 2,
                    "created_utc": 1653804488.0,
                    "response": "Bitcoin is going to win. Traditional finance is obsolete. Hey guys let’s only trade during business hours lol. Hey I can move this without Anybodys  permission.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaeh8gx",
                    "author": "Bitcoin__Hodler",
                    "score": 2,
                    "created_utc": 1653807662.0,
                    "response": ">The ship is sinking and they cannot keep it afloat much longer.\n\nI´am reading this since decades. Don´t wait for it. The decline is a (gradual) process.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaf8x0x",
                            "author": "Acceptable-Risks",
                            "score": 1,
                            "created_utc": 1653829859.0,
                            "response": "Yes I imagine it will be a gradual process with some major events here and there leading to the final collapse.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iaentvw",
                    "author": "Q-cool-44",
                    "score": 2,
                    "created_utc": 1653813489.0,
                    "response": "I realised this after watching inside job on Netflix. Deregulation of the financial system completely broke the game. Bankers printing money with bad debt, they now have so much power and influence in government. Bitcoin is the best thing we have got to prevent corruption in a financial system. Yes people with more money have a great head start and the people ruining the system may get the biggest part of the pie but it’ll be the last time they can shaft everyone until the playing field is levelled again.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaf7cdv",
                    "author": "ultra_annoymnuos",
                    "score": 2,
                    "created_utc": 1653829004.0,
                    "response": "This is why I love ❤ the bitcoin community it's not just about fiat \n\nI hope I'll be around and alive one day when people will say \"how much is that in satoshis?\"\n\nNot bothering in converting into state fiat.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iact69p",
                    "author": "pocman512",
                    "score": 6,
                    "created_utc": 1653772353.0,
                    "response": "Nope. It is an speculative asset that follows the FED and cheap money",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iactf4x",
                            "author": "Acceptable-Risks",
                            "score": 2,
                            "created_utc": 1653772475.0,
                            "response": "In other words...you like bitcoin but only as a way to make a quick buck and cash back out for fiat? You don't believe it serves any other purpose?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iacu89q",
                                    "author": "pocman512",
                                    "score": 5,
                                    "created_utc": 1653772856.0,
                                    "response": "I don't like bitcoin at all.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iacucep",
                                            "author": "Acceptable-Risks",
                                            "score": 1,
                                            "created_utc": 1653772911.0,
                                            "response": "What do you like?",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iac1a5g",
                    "author": "GeologistEfficient89",
                    "score": 6,
                    "created_utc": 1653758971.0,
                    "response": "I don't think it is. Everyone here buys BTC in fiat because they want it to appreciate so they can have more access to fiat.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iacr484",
                            "author": "Zonnins",
                            "score": 7,
                            "created_utc": 1653771361.0,
                            "response": "You buy Bitcoin in fiat because you are not paid in Bitcoin. I’d gladly accept a salary in Bitcoin. Why would anyone want Fiat after seeing the US government increase the money supply 50%? You are forced to invest in the stock market to preserve your wealth. You wouldn’t have to do this if the US government didn’t constantly debase the money supply. That’s why we need a rules based system like Bitcoin.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iaf7swc",
                                    "author": "ultra_annoymnuos",
                                    "score": 1,
                                    "created_utc": 1653829272.0,
                                    "response": "Not being a smart arse but wasn't 40-46% these last 2 years?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "iach5fq",
                            "author": "wkw3",
                            "score": 8,
                            "created_utc": 1653766563.0,
                            "response": "I want to spend Bitcoin directly. So no, not everyone.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iaciv6n",
                                    "author": "Capital_Routine6903",
                                    "score": 3,
                                    "created_utc": 1653767402.0,
                                    "response": "“Access to fiat” is what you are talking about",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iack2sv",
                                            "author": "wkw3",
                                            "score": 4,
                                            "created_utc": 1653768003.0,
                                            "response": "Purchasing power, not access to fiat. When vendors accept Bitcoin, fiat doesn't enter into it.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "iadfk3b",
                                    "author": "Acceptable-Risks",
                                    "score": 1,
                                    "created_utc": 1653783508.0,
                                    "response": "Same. I am holding out until I dont have to sell it for fiat and my value in BTC has given me access to much more goods and services than my value in BTC can currently offer.\n\nEdit to add: once that goal is reached then I'll begin to participate in the further decentralization of the network by trading my BTC directly for goods and services.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "iac1yvv",
                            "author": "Acceptable-Risks",
                            "score": 4,
                            "created_utc": 1653759297.0,
                            "response": "I think that group is more of a minority than you imagine. Most bitcoiners I talk to are holding until BTC is the standard by which value is measured and most desired currency for commerce. I dont meet many bitcoiners who want to trade it back to fiat, but this sub does have a lot of shitcoiners who seem to think BTC is just like their shitcoin.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iaccfre",
                            "author": "EnchantedToMe",
                            "score": 2,
                            "created_utc": 1653764362.0,
                            "response": "I think you’re right as well as wrong. Because the moment people see it’s true value they will keep onto it.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iacb4iw",
                    "author": "Eyonizback",
                    "score": 6,
                    "created_utc": 1653763719.0,
                    "response": "What are we gonna say when its not a hedge against central banks too? We used to say inflation, that didn't work :(",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iacbx9d",
                            "author": "Acceptable-Risks",
                            "score": 1,
                            "created_utc": 1653764110.0,
                            "response": "Only time will tell, but all the signs point to Bitcoin. A fat lady has to sing before you can call it for BTC or fiat. Even this beer market and recession is not a fat lady singing.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iad5ny5",
                                    "author": "Advanced_Shoulder_56",
                                    "score": 3,
                                    "created_utc": 1653778296.0,
                                    "response": "All I read was beer and fat chicks.\n\nUpvoted.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "iad5pdx",
                                    "author": "Advanced_Shoulder_56",
                                    "score": 2,
                                    "created_utc": 1653778316.0,
                                    "response": "All I read was beer and fat chicks.\n\nUpvoted.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "iaer8tk",
                                    "author": "magides",
                                    "score": 1,
                                    "created_utc": 1653816594.0,
                                    "response": "All I read was beer and fat chicks.\n\nUpvoted.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "iaer96e",
                                    "author": "magides",
                                    "score": 1,
                                    "created_utc": 1653816604.0,
                                    "response": "All I read was beer and fat chicks.\n\nUpvoted.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iaczz9w",
                    "author": "ryanryans425",
                    "score": 2,
                    "created_utc": 1653775509.0,
                    "response": "Except that it’s not. Because too many people view the value of their Bitcoin in terms of how much it’s worth in dollars.  Once more people start to realize this and they sell only the idiots will be left holding the bag.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iad1fwy",
                            "author": "Acceptable-Risks",
                            "score": 1,
                            "created_utc": 1653776217.0,
                            "response": "What you've described is people who are playing casino vs people who hold because they believe it's going to replace fiat.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iadd741",
                                    "author": "CrazedLunatic13",
                                    "score": 1,
                                    "created_utc": 1653782234.0,
                                    "response": "So i only got into bitcoin because of casino , so rn i have 5,000$ worth of bitcoin , you guys are basically saying its best to hold onto it instead of cashing it for usd because it will be worth more in the future ? If i sound ignorant its because im not well informed , i only went into bitcoin because i was winning casino online etc and thought of it as a quick way to get my money . So is it worth holding onto 10 k bitcoin hypothetically to see an increase in value or if its just  10 k usd then might as well cashout since its not a lot of money  ? What are your thoughts ?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iadf8g4",
                                            "author": "Acceptable-Risks",
                                            "score": 1,
                                            "created_utc": 1653783334.0,
                                            "response": "I say hold the bitcoin until the day you don't have to sell it for fiat because it is so valuable and widely accepted everywhere. Learn more about what you are holding. It is something special.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iadi7di",
                                                    "author": "CrazedLunatic13",
                                                    "score": 1,
                                                    "created_utc": 1653784962.0,
                                                    "response": "Thanks",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iabykei",
                    "author": "diadlep",
                    "score": 3,
                    "created_utc": 1653757694.0,
                    "response": "It's not that central banks are necessarily collapsing now, it's that central banks always collapse eventually. Whether the fed goes down next week or in a hundred years, bitcoin won't.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iadgpye",
                    "author": "BashfulTurtle",
                    "score": 2,
                    "created_utc": 1653784138.0,
                    "response": "> bold claim\n\n> zero support, zero evidence, pure baseless opinion\n\nI mean you have no proof, so of course I believe you \n\nThe posts in this sub have been going down hill blindingly fast.\n\nAnother hodler in a mega hole trying to unload bags",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iadihuy",
                            "author": "Acceptable-Risks",
                            "score": 0,
                            "created_utc": 1653785123.0,
                            "response": "My evidence is the devaluation of fiat currency over the last 100 years. I'm assuming readers are intelligent enough to already know what has happened to fiat currencies globally all over the world during the last century, so I dont consider it necessary to present cases of devaluation for examination in this post. The proof of devaluation is clear because you can observe the decrease in buying power through history and recently even in real time. \n\n\nSo what's your real argument against BTC or the mass adoption of it? Coming on this post and acting like my reasonable vision for BTC is off the wall and some sort of representation of hysteria in this sub is not productive. Let's talk about exactly where you disagree with what I said.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iadjd27",
                                    "author": "BashfulTurtle",
                                    "score": 4,
                                    "created_utc": 1653785603.0,
                                    "response": "> my evidence is the devaluation of fiat currency over the last 100 years\n\nThat’s not evidence, that’s a claim. You need to support this claim with facts. Start with #s.\n\n> I’m assuming readers are intelligent enough\n\nSame tactic as snake oil salesmen. Oldest trick in the scam book. \n\nThat last sentence is another baseless claim because, let’s be honest, you have no proof. You have no facts. You have an opinion and a big red number on your bitcoin wallet. \n\nIf you my comment more closely, you’ll see I never agreed nor disagreed. You come with a big baseless claim, it’s only fair for people to expect to see some shred of proof or fact - of which you have neither. \n\nYour lack of research and lack of support for a big claim that directly impacts peoples’ livelihoods, when it’s tremendously evident that you don’t actually have a clue of what you’re opining on and are projecting a fantasy you think might be true with confidence.\n\nThat is what a bad actor does and crypto has enough of those.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iadlilp",
                                            "author": "Acceptable-Risks",
                                            "score": 0,
                                            "created_utc": 1653786799.0,
                                            "response": "You're telling me you don't believe fiat currencies around the world have been devalued because I didn't lay out all sorts of facts and evidence on this post? If I told you the sky was blue would you need evidence? Common knowledge is not fair in your book?\n\n\nIt's quite insulting for you to imply I have no education on this topic simply because you disagree, specifically with what you haven't made clear I might add. I'm among a rather large group of people who reasonably conclude we can and most likely will see bitcoin replace the current monetary system. Why that angers you so much is confusing to me because bitcoin is the most fair and humanitarian friendly invention I've seen in my life. It's for everyone.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iadp43q",
                                                    "author": "campionesidd",
                                                    "score": 2,
                                                    "created_utc": 1653788800.0,
                                                    "response": "If by devaluation, you mean inflation, then it is not a bad thing that currencies get devalued a little over time. Some amount of inflation in the system is necessary. An economy with zero inflation and price pegs would be disastrous.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iadtugd",
                                                            "author": "Acceptable-Risks",
                                                            "score": 1,
                                                            "created_utc": 1653791496.0,
                                                            "response": "Price fluctuation based on supply and demand is no problem and in fact is necessary. Inflating the supply of money and therefore devaluing the supply currently in circulation is not necessary if you ask me, unless your society has a problem with debt and can't win a war with anyone wanting to collect on that debt. \n\n\nI don't see why the value of an item couldn't rise over time based on it's usefulness/scarcity etc...\n\n\nIf there are no irresponsible, corrupt, or stupid leaders manipulating the debt of a nation there is no need for inflation. There is no need to create more bitcoin because it will absorb more and more value over time as the energy used to mine it increases and its adoption and desirability increases, and above all there won't be any bankers printing more of it or governments recklessly spending and then needing to be bailed out by money printing. What would happen on a BTC standard is the dishonest or corrupt or reckless government would fail and no one would bail them out. Survival of the fittest. It would give everyone an incentive to be honest and responsible financially. People don't realize how much the small guy suffers right now under the fiat monetary system. We absorb all the corruption of the elite who play their games and keep getting bailed out.\n\n\nI'm not sure why you think increasing money supply is a good thing but I'm interested to hear why.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "iadw3py",
                                                                    "author": "Free_Paramedic3849",
                                                                    "score": 0,
                                                                    "created_utc": 1653792805.0,
                                                                    "response": "> if you ask me...\n\nShould we? What are your qualifications?",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "iadlqwc",
                                                    "author": "BashfulTurtle",
                                                    "score": 0,
                                                    "created_utc": 1653786926.0,
                                                    "response": "Again, you’re not engaging the subject and are putting words in my mouth i never said. Why? Because you’re selling snake oil and you know it.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iadmmb7",
                                                            "author": "Acceptable-Risks",
                                                            "score": 1,
                                                            "created_utc": 1653787404.0,
                                                            "response": "I'm sorry but I'm not able to follow where you're going. I've tried to discuss but you are not taking any position or presenting any argument other than your opinion that I'm selling snake oil and my post is bad because I didn't provide a vague standard of evidence to your liking. There's really no where to take the conversation from there, I obviously disagree with your assertion my post is bad and my profession is snake oil sales....so unless you want to discuss some specific pro and cons of BTC or why you think my theory won't happen, I don't see any value in continuing to engage you. I have given it my best effort though.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iabsv8j",
                    "author": "SmoothGoing",
                    "score": 0,
                    "created_utc": 1653755037.0,
                    "response": "Collectible token doesn't replace banking. So no.\n\nYou can value bitcoin in anything you want. Chickens, beer, Teslas. Things are valued in fiat because it's a convenient standard.\n\nWhen you buy bitcoin you are not betting against banking. Whether you want bitcoin to become something is irrelevant. It doesn't care about your wishes.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iabx8e3",
                            "author": "Geoknysis",
                            "score": 1,
                            "created_utc": 1653757076.0,
                            "response": "Thoughts on the value of Bitcoin network as a value transfer system?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iabm78m",
                    "author": "AskALettuce",
                    "score": -4,
                    "created_utc": 1653751923.0,
                    "response": "BTC is not tied to fiat. BTC has fallen by over 50% against the $ in the last 6 months.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iabxlh2",
                            "author": "MiguelLancaster",
                            "score": 9,
                            "created_utc": 1653757244.0,
                            "response": "How about a year? How about two years?",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iabyzje",
                            "author": "BigTimeButNotReally",
                            "score": 9,
                            "created_utc": 1653757891.0,
                            "response": "Checked some of your other comments...  They're foolish too.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iacp4bl",
                            "author": "Ground_Lazy",
                            "score": 2,
                            "created_utc": 1653770398.0,
                            "response": "Can't fool me",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iack1th",
                            "author": "Boe_Ning",
                            "score": 1,
                            "created_utc": 1653767989.0,
                            "response": "Convenient time period, retard.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iabrh7t",
                    "author": "zachmoe",
                    "score": -2,
                    "created_utc": 1653754390.0,
                    "response": "Weird, stopping inflation is why central banks exist.  Before them, governments would print themselves out of confidence.\n\nI don't think you understand enough about the monetary system.\n\nWe measure things in USD, and will probably continue to.  There is no reward for holding assets that decline in price while trying to fight the Fed.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iac51ln",
                            "author": "Acceptable-Risks",
                            "score": -2,
                            "created_utc": 1653760771.0,
                            "response": "Value was once measured in coins minted by Caesar. That system didn't continue indefinitely. It was replaced and then the next one was replaced, time and again. \n\n\nBecause fiat has been in existence before we were alive does not mean it will continue indefinitely. It will be replaced with a better monetary system just like bartering and coins and gold nuggets.\n\n\nEven in the bitcoin subreddit it never fails to amaze me how many people are thinking in such short term. Bitcoin is for the people interested in the long game.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iac6ucy",
                                    "author": "HeIsMyPossum",
                                    "score": 4,
                                    "created_utc": 1653761640.0,
                                    "response": "I do understand your point, but citing something from 2,000 years ago and saying how that changed isn't helping your time horizon. Even if what you are saying is true, it doesn't matter as much to us if it takes 200 years to happen.\n\nAlso, there's a bias in the answer that if you don't believe in the current system, bitcoin is the answer. There is a lot of room for \"neither\" to be fair.\n\nI'm a big bitcoin supporter, but I'll be labeled as a hater for this post.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iacakcd",
                                            "author": "Acceptable-Risks",
                                            "score": 0,
                                            "created_utc": 1653763445.0,
                                            "response": "I dont think you're a hater but maybe you just don't know enough about bitcoin yet. I started off as an altcoin heavy investor and am now a BTC maxi by all means. BTC is a miracle that will not be replicated and you either see the value and potential or you don't. My philosophy is if people truly become educated about what BTC is, how it works, and who has power over it, the only people who would ever hate it are the bankers and governments because it threatens their stranglehold on power. Perhaps you are one of the ones who hasn't yet realized it's Bitcoin or a dystopian future. Call me closed minded if you want but I see the black and white here. Bitcoin is our one chance to break the monetary chains.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iacplco",
                                                    "author": "HeIsMyPossum",
                                                    "score": 7,
                                                    "created_utc": 1653770615.0,
                                                    "response": "> but maybe you just don't know enough about bitcoin yet.\n\nThis is a massive red flag. You are presented with a differing opinion, and your conclusion must be that you are smarter or more educated than that person. The implication is that no smart person could come to a different opinion.\n\nYou have literally no idea what my background on bitcoin is.\n\n>My philosophy is if people truly become educated about what BTC is, how it works, and who has power over it, **the only people who would ever hate it are the bankers and governments because it threatens their stranglehold on power.**\n\nYou are showing that it's not worth anyone's time to argue with you. You are way too sure of your position, to the point of arrogance and/or blindness.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iacr285",
                                                            "author": "Acceptable-Risks",
                                                            "score": -1,
                                                            "created_utc": 1653771336.0,
                                                            "response": "Can you produce a reasonable and intelligent argument on why anyone wouldn't want BTC to become a global standard currency and replace fiat besides the banks and governments? \n\n\nBased on what you said it seems like you're one of those people who believe being open minded and not claiming you have an absolute truth is a virtuous character trait. I do not believe that way, and to me that line of thinking is also a red flag. I think objective truth exists and it's ok to make a claim to it. Can it be backed up is where the real test comes. The truth will show itself when tested. You can take that as arrogance if you want. I'm a bitcoin maxi and not ashamed of that.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "iacrfgg",
                                                                    "author": "HeIsMyPossum",
                                                                    "score": 2,
                                                                    "created_utc": 1653771502.0,
                                                                    "response": ">Perhaps you are one of the ones who hasn't yet realized it's Bitcoin or a dystopian future.\n\nI mean... There's claiming objective truth, and then there's saying it's bitcoin or dystopia lol",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "iactn89",
                                                                            "author": "Acceptable-Risks",
                                                                            "score": 0,
                                                                            "created_utc": 1653772585.0,
                                                                            "response": "A truth claim! Let's see if I'm right.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iacre2v",
                    "author": "BigPlayCrypto",
                    "score": 1,
                    "created_utc": 1653771484.0,
                    "response": "🆙",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iadco4g",
                    "author": "-TYRS-",
                    "score": 1,
                    "created_utc": 1653781948.0,
                    "response": "You're out of your mind if you think the world's central banks are collapsing.\n\nThis is why people don't take crypto seriously. It's stupid takes like this. Jesus...",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iacv9pw",
                    "author": "TheChoosey1",
                    "score": 0,
                    "created_utc": 1653773366.0,
                    "response": "I just want to mention two things. \n\n1. Eventually everyone will only use Bitcoin because every other system will fail as designed. \n\n2. Someday each 1 BTC will be worth an unimaginable amount of wealth. There's no limit.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iacwdwq",
                            "author": "Acceptable-Risks",
                            "score": 2,
                            "created_utc": 1653773862.0,
                            "response": "I agree that we haven't seen the real value of Bitcoin yet. I dont think it fits in the box it's currently in, and we're thinking too small if we only look at it as an asset.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iacn8r5",
                    "author": "KnightzEnd2",
                    "score": 1,
                    "created_utc": 1653769552.0,
                    "response": "Although these 2 things are not totally interdependant they are dependent enough on eachother for this distinction to not mean much.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iacne83",
                            "author": "Acceptable-Risks",
                            "score": 1,
                            "created_utc": 1653769619.0,
                            "response": "Could you expand a bit more on your point? It's not clicking for me 100%",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iacnr9p",
                                    "author": "KnightzEnd2",
                                    "score": 1,
                                    "created_utc": 1653769777.0,
                                    "response": "I simply mean that inflation and central banking are so tied to eachother that calling bitcoin a hedge against central banking is practically calling it a hedge against inflation. There may be some tiny semantic diffefences between the 2 but not enough to matter when having a basic conversation about bitcoin.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iacplhd",
                                            "author": "Acceptable-Risks",
                                            "score": 1,
                                            "created_utc": 1653770616.0,
                                            "response": "Ah, I see and you are correct in a broad sense. On a more zoomed in line of thinking it's like a symptom and a disease. The fiat system/central banking being the disease, and inflation being a symptom of that disease. Many people have been looking to bitcoin to treat the symptom although it wasn't designed to do that. It was designed to cure the disease (if the world could agree and adopt it peacefully). We probably won't see bitcoin cure the disease in the most peaceful and least painful way because governments and banks are certainly fighting to produce anti bitcoin propaganda and the general public is easily convinced. We will probably see bitcoin become the AED machine when our global economy dies from the fiat system. Then it will remain and be proven to be the cure we had needed all along.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iacqn1z",
                                                    "author": "KnightzEnd2",
                                                    "score": 1,
                                                    "created_utc": 1653771132.0,
                                                    "response": "I honestly believe by that time it probably won't be bitcoin as the main player but overall I agree.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iad4g7s",
                    "author": "remarkablemayonaise",
                    "score": 1,
                    "created_utc": 1653777689.0,
                    "response": "I thought this might be the premise and I appreciate the risk is real (even without nuclear warfare taking us back to the stone age). Unfortunately gold and silver coins tick far more boxes as decentralised currency than Bitcoin does.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iad52dw",
                            "author": "Acceptable-Risks",
                            "score": 1,
                            "created_utc": 1653777996.0,
                            "response": "Aside from losing internet, which we all know is an absolute worst case scenario at this point, what are you considering a win for precious metal over BTC?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iad6q8j",
                                    "author": "Advanced_Shoulder_56",
                                    "score": 1,
                                    "created_utc": 1653778829.0,
                                    "response": "I would venture that gold/silver would have an infinitely easier time finding mainstream adoption.\n\nI would also counter argue that gold's industrial utility + rarity almost precludes it from use as circulating currency in modernity.\n\nNot sure where I stand on OPs .... OP - just following a good debate in a subject I love.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iad80u1",
                                            "author": "Acceptable-Risks",
                                            "score": 1,
                                            "created_utc": 1653779498.0,
                                            "response": "I'm assuming we are talking about a scenario where fiat system fails but we haven't been thrown back to the stone ages by a massive loss of infrastructure and internet. \n\nOne argument against gold and silver as a currency to fall back to is a lack of compatibility with our digital world. Cash would be the closest representation we currently have to gold and you can observe how the use of cash has been in decline. That's a shame too because I think we should always have a cash type currency which is physically exchanged. But cash can easily be divided by coins. Gold and silver are very difficult to divide down to smaller denominations, and weight and purity are major issues which will hinder that.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iad9guv",
                                                    "author": "Advanced_Shoulder_56",
                                                    "score": 2,
                                                    "created_utc": 1653780247.0,
                                                    "response": "I 100% agree with each point you just made - say something stupid so I can counter it lol 😆 \n\nI would further your point about the diviability of gold currency by saying the only ready solution for that problem would be to have a centralized organization (...) mint a series of denominations of hard to fake coins - which would ofc lead to both centralized control and currency debasing in its truest most literal sense. \n\nAll of this leads to the notion that indeed btc would be the superior choice in such a scenario, or indeed even without such a scenario (one that forces the adoption of a new monetary system).  The real question then becomes what can be done to drive mainstream adoption?  Do we wait for fiat to crumble?  Do we evangelize from a soapbox on the corner?  Do we activise the downfall of Central banking cartels?  Or do we simply answer the questions of those who ask while striving to improve upon whatever aspect of btc can be improved upon (carbon footprint comes to mind, an ugly pill for the unread masses)?  Where do we go from here beyond stacking on a ledger?",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "iad8b2x",
                                    "author": "remarkablemayonaise",
                                    "score": 1,
                                    "created_utc": 1653779647.0,
                                    "response": "Most countries in modern history who have suffered hyperinflation have gone to the USD (or EUR) as a temporary or permanent medium of exchange.\n\nIf the US or Eurozone central banks fucked up that badly Americans could use EUR and vice versa. If both go simultaneously the chances are pretty much every currency would be in wheelbarrow mode.\n\nBartering would be the default, with a local IOU system based on trust. Then a mixture of currencies would evolve based on the classic: durability, portability, divisibility, uniformity, limited supply, and acceptability.\n\nHooray, Satoshi got this far. Unfortunately for L1 limited transaction rates and fees work just as badly in this future as they do now. For large transactions it's fine, but silver and similar work a lot better, especially if minted into standard coins. A gram or two of silver works perfectly well for small transactions.\n\nIf the internet survived L2 and wrapped Bitcoin seem plausible as well as the alts.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iaddl3h",
                                            "author": "Acceptable-Risks",
                                            "score": 1,
                                            "created_utc": 1653782446.0,
                                            "response": ">Unfortunately for L1 limited transaction rates and fees work just as badly in this future as they do now.\n\nI'm not understanding this part of your reply. It seems like you're saying bitcoin has no solution for small transactions, which we agree would be paramount for global adoption in the case of USD, EUR (fiat system) collapse. In this case we do have lightning network and the transactions are nearly instantaneous now and fees are much lower. \n\n\nAs far as your point about minting coins out of silver and gold, we again bring in trust. Now we must trust the mint to be honest and not make fake coins or purposely skim weight to enrich their own pockets. When we compare that to the fact bitvoin cannot be faked or skimmed or diluted in any way, we clearly see bitcoin is superior in that regard.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iadfsta",
                                                    "author": "remarkablemayonaise",
                                                    "score": 1,
                                                    "created_utc": 1653783638.0,
                                                    "response": "I wasn't sure how well loved LN was here. I guess it ticks the boxes then, especially if they iron out the \"invoicing\" issues. Hooray!\n\nMinting coins brings up another set of issues as you said including central authorities. Assaying is cheaper than it was when the USD was defined by a gold or silver standard. Given 2.5% of the old pound coins (we switched over a few years ago) were fake the only victims are those \"holding the bag\".\n\nBut yes the different ways society collapses is interesting. I'm looking forward to Kevin Costner with gills.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iadj7m7",
                                                            "author": "Acceptable-Risks",
                                                            "score": 1,
                                                            "created_utc": 1653785518.0,
                                                            "response": "I'm not aware of the invoicing issue. What is it?",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "iaedthn",
                                                                    "author": "remarkablemayonaise",
                                                                    "score": 1,
                                                                    "created_utc": 1653804815.0,
                                                                    "response": "Ahh, I'm a bit behind. I hadn't realised that open invoices were now a thing where you can just pay someone without them specifying how much. Teething issues, eh?",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "iadikjn",
                                    "author": "campionesidd",
                                    "score": 1,
                                    "created_utc": 1653785164.0,
                                    "response": "For one thing, it has a real tangible value. Bitcoin’s value is zilch. Nada. Zero.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iadlyro",
                                            "author": "Acceptable-Risks",
                                            "score": 1,
                                            "created_utc": 1653787050.0,
                                            "response": "Ok why does gold have value and bitcoin doesnt? Explain your reasoning because I have a counter argument for what you'll likely say and would like to get you thinking about that.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iad9vhf",
                    "author": "circuit-braker",
                    "score": 1,
                    "created_utc": 1653780463.0,
                    "response": "A serious question, now that the USA and Russians are at war, what keeps Russians printing tons of US dollar?\n\nI know you might say, why would they when the USA doing so themselves, but I seriously want to know what stops Russians?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iadddw2",
                    "author": "Keth43",
                    "score": 1,
                    "created_utc": 1653782336.0,
                    "response": "Inflation is not a natural occurrence but the by product of monetary policy aka central banks. \n\nSo you are saying the same thing when you say Bitcoin is a hedge against inflation or central banks in general.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iadk2mv",
                            "author": "Acceptable-Risks",
                            "score": 1,
                            "created_utc": 1653786001.0,
                            "response": "Yes it clashes a bit but that's kind of my point. We should look at it as a replacement for a system that works for the elite but not the people. So it's a \"hedge\" (metaphorically) against this currency we believe is failing (as evidence clearly shows by devaluation of nearly every fiat currency globally). We have this alternative currency and system we can invest in, and we believe it will preserve our value if the fiat system collapses.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iadeqyf",
                    "author": "depaul9",
                    "score": 1,
                    "created_utc": 1653783073.0,
                    "response": "I've always heard that...\n\nBut now we see Bitcoin losing value during inflation",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iadkjq6",
                            "author": "Acceptable-Risks",
                            "score": 2,
                            "created_utc": 1653786260.0,
                            "response": "Think about it as a whole other monetary system based on different rules. But as of yet it has to mature and events have to take place to test it and test fiat. Which system do we believe is the more fair and equitable monetary system for earth? Fiat currency with central banking, or bitcoin with distributed ledger and self custody? \n\nCurrently a large number of people speculate on BTC, combined with tougher than average economic c9nditions in most of the world, we are seeing lots of people dump their investments in all markets in favor of cash liquidity. Most bitcoiners who I meet who really understand the potential of bitcoin, and don't just look at it as another coin to gamble on, are hodling for the future where BTC replaces fiat.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iadfaip",
                    "author": "idontspellcheckb46am",
                    "score": 1,
                    "created_utc": 1653783366.0,
                    "response": "I frequently say that in America, unfortunately, division is all we have left.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iadgb08",
                    "author": "easymoneeybabe",
                    "score": 1,
                    "created_utc": 1653783911.0,
                    "response": "Nope",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iadh09w",
                    "author": "campionesidd",
                    "score": 1,
                    "created_utc": 1653784298.0,
                    "response": "You should win the Nobel Prize for Economics. What a brilliant thesis /s",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iadlese",
                    "author": "Rjk214",
                    "score": 1,
                    "created_utc": 1653786740.0,
                    "response": "The funny thing is fiat won’t collapse.. I love BTC but to think fiat will magically collapse is just naive.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iadlrk7",
                            "author": "Acceptable-Risks",
                            "score": 0,
                            "created_utc": 1653786937.0,
                            "response": "Specifically, why do you think it won't collapse? \n\n\n\"Because banks are powerful and governments and its been around a long time\" is not an acceptable answer because we've seen entire nations crumble and monetary systems come and go several times in history. I want a good argument on why you think it's ridiculous to believe fiat monetary system will collapse.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iadqxjt",
                                    "author": "Rjk214",
                                    "score": 1,
                                    "created_utc": 1653789832.0,
                                    "response": "It’s weird though right. Even though those nations have “crumbled” they still exist and a new fiat system replaced the old… \n\nIt’s just an ignorant and naive thought process to truly believe that all fiat will just magically collapse\n\nBlockchain helps transition to a more open system.  Like the internet did. But BTC isn’t going to just replace the entire system. At least not in my or your lifetime. It’s a step forward but it will NEVER be what you expect it to be what you think it will be\n\nA similar fiat system can be created on a new blockchain. Which is likely to be the case for worldwide usage. If that’s how you see “crypto” evolving…\n\nIt’s just a common sense thought process in all honesty. I believe in it but I’m not naive to think it replaces the entire fiat system in the next 100 years",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iadsl2t",
                                            "author": "Acceptable-Risks",
                                            "score": 1,
                                            "created_utc": 1653790778.0,
                                            "response": ">Even though those nations have “crumbled” they still exist and a new fiat system replaced the old… \n\nWe didn't have bitcoin until now, so it's natural that fiat currencies replaced fiat currencies in modern examples of failure. \n\nThe point you seem to be making is fiat monetary policy won't go away because it's been here a long time, mixed with a touch of governments and banks are too powerful and we can't win. In that case I'd say it's not wise to think this monetary system can't go away. As humanity has progressed and become more advanced we've seen multiple monetary system replacements. They dont really happen overnight or instantly (perhaps you think I'm suggesting that's what will happen). It's always a gradual shift mixed with tragedy or genocide or revolt to help force us over the line to adopt the new system. \n\n\nIf you think I'm suggesting fiat is going to collapse one day suddenly and we will wake up to a total failure, that's not what I'm saying. I do believe it will totrally fail and BTC will eventually replace it completely but it will happen in stages like it always has. Unfortunately I do think the biggest phase of adoption will come with some major pain for many people with a large crash. We will see many red flags and black swan events and maybe even war and oppression before it finally pushes us over the line to full adoption.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iadtcrs",
                                                    "author": "Rjk214",
                                                    "score": 2,
                                                    "created_utc": 1653791218.0,
                                                    "response": "There is literally 0% chance that BTC is the monetary system that becomes the global currency. Literally 0.\n\nBTC is a proof of concept which will exist for a long time and become a wonderful store of value. Exactly what it was designed to do!\n\nA NEW worldwide digital currency will ultimately replace the current monetary system. At the end of the day it will just be an evolved fiat system that is digital.\n\nIt’s ok to be naive and think otherwise. All the power to you and hopefully one day you can see your hopes and dreams become a reality. But it’s highly highly unlikely!",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iadotnl",
                    "author": "torinakomara",
                    "score": 1,
                    "created_utc": 1653788637.0,
                    "response": "I just worry that mining is too centralized, high energy requirement makes it vulnerable. What if there is a war or something, Will network survive ?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iadu8vt",
                            "author": "Acceptable-Risks",
                            "score": 1,
                            "created_utc": 1653791727.0,
                            "response": "Bitcoin has a built in system for that. If there is a major war and a lot of miners have to shut down what will happen is the difficulty will go down drastically, so it will become easier for the small miner to find blocks. It's one of the amazing features of bitcoin. Also the network is not \"run\" by the miners as many think. You don't have to mine bitcoin to keep the network running. The nodes are the real boss of the network and if they are running we can transact on the network and do not need new supply constantly coming in from mining just to use the network. As a bonus on top of all that, realizing the nodes are actually the most important part of the network, another amazing feature of bitcoin is how you can run a node on a very basic computer. You don't need ASIC to run a btc node.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iadz2ci",
                    "author": "Malecite",
                    "score": 1,
                    "created_utc": 1653794572.0,
                    "response": "Ah yes the fiat collapse, when with much hand wringing and sighs the world shrugs and says *well better crypto*.\n\nNot like the simultaneous collapse of the entire world's financial system wouldn't involve you shooting your neighbor for the last box of pizza pops.\n\nBrings to mind that timeless adage: \"always fight the Fed\"",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iae06p9",
                            "author": "Acceptable-Risks",
                            "score": 2,
                            "created_utc": 1653795275.0,
                            "response": "It's more likely to be a slow bleed with some major events which cause more and more people to turn to bitcoin, but a sudden collapse certainly isn't off the table. I do believe there will be a painful final event which will bring us to the final stage of bitcoin adoption, but mainly because the anti btc propaganda works well on people who dont bother to do their own research and learn what btc is. Sadly people are not going to fully adopt until they have to. History has shown us this. When we adopted new monetary systems it was due to conflict and oppression and the need for inmovation to solve prpblems. We are in that same scenario today. We have major problems and corrupt people holding our wealth hostage. Those governments and bankers aren't going down without a fight to the death. They'll definitely be bringing down some no coiners and probably institutions and maybe even entire governments with them.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iae6dlz",
                    "author": "bilabrin",
                    "score": 1,
                    "created_utc": 1653799319.0,
                    "response": "Bitcoin is the end of governments.\n\nNothing is certain except death ~~and taxes~~.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaev4ed",
                    "author": "Fromasalesman",
                    "score": 1,
                    "created_utc": 1653820083.0,
                    "response": "Lol you said as a whole",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaff5ck",
                    "author": "xxskillerzz",
                    "score": 1,
                    "created_utc": 1653833077.0,
                    "response": "I am checking last one year trend but still not getting anything positive.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iafg3zp",
                            "author": "Acceptable-Risks",
                            "score": 1,
                            "created_utc": 1653833532.0,
                            "response": "That's a very narrow time period. Bitcoin is about the long time frame. We're talking about replacing the current monetary system with a new one. That certainly won't happen over night. Bitcoin has to grow up first.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iaffu4e",
                    "author": "benpud",
                    "score": 1,
                    "created_utc": 1653833397.0,
                    "response": "Fiat money suffers from inflation, Bitcoin is very volatile, but at least it is relatively independent.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iafg91h",
                    "author": "tunahantek",
                    "score": 1,
                    "created_utc": 1653833604.0,
                    "response": "Bitcoin is a hedge against inflation, but not on your 5 minute chart.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iafh0pr",
                            "author": "Acceptable-Risks",
                            "score": 1,
                            "created_utc": 1653833996.0,
                            "response": "Haha...the chart most people seem to be interested in.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iafgvj4",
                    "author": "jsd8cc",
                    "score": 1,
                    "created_utc": 1653833921.0,
                    "response": "Always remember , Successful investors are good at portfolio diversification.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iafhcfj",
                            "author": "Acceptable-Risks",
                            "score": 1,
                            "created_utc": 1653834154.0,
                            "response": "Yep. Got a little bitcoin over here and a little bitcoin over there. \n\n\nI'm just kidding. It's all in one place. \n\n\nHaha got ya again, I don't have any bitcoin. \n\n\nFooled ya!!! I do have some but I also have business assets and investments in other businesses that provide residual income.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iafil7t",
                    "author": "Steven81",
                    "score": 1,
                    "created_utc": 1653834779.0,
                    "response": "Its market behavior is different than both.\n\nIt's a hedge against the strength of the dollar. Every time DXY goes parabolic bitcoin gets killed, like every.single.time. Once DXY's rise gets tempered , Bitcoin's behavior gets tempered as well.\n\nAlso every time the DXY gets dumped hard, Bitcoin gets in a rally. Look how well Bitcoin's rally parallels that of dollars' competitors. It seems to rally every time Euro does, nothing to do with halving or whatever. I always look for Euro to bottom against the dollar and then start accumulating BTC like crazy (I am accumulating rn, there is some chance that the Euro bottomed).\n\nBuying/selling bitcoin is akin to buying/selling forex on margin, without the fear of liquidation, which is why I prefer it to forex. No need to play options when the real thing can be as volatile and present as many opportunities.\n\nAlso, the central banking is \"collapsing\" ever since Nixon got us off the gold standard. And while that may be true, these things happen slowly, do not go about your life thinking that such a collapse is imminent, it has been \"imminent\" for 50 years +... Obviously it will collapse, I just don't think that you should put much bank in it happening in our lifetimes...",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iacs1bc",
                    "author": "qr52",
                    "score": 0,
                    "created_utc": 1653771789.0,
                    "response": "It's a hedge against inflation as well, it's just not a stable hedge yet.   Probably never will be because we'll be off US dollars by then.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaf23v3",
                    "author": "Happiness_for_dogs",
                    "score": 0,
                    "created_utc": 1653825647.0,
                    "response": "What makes btc great is the level of fanaticism behind it , it’s like religion really you get all of the small holders believing all this nutty stuff and you skim off their blind faith for US dollars.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}