{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "u4d5sj",
            "title": "out of the loop: Why are people moving their coins from exchanges to private wallets?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/u4d5sj/out_of_the_loop_why_are_people_moving_their_coins/",
            "author": "onoponyo",
            "created_utc": 1650043673.0,
            "score": 282,
            "num_comments": 315,
            "subreddit": "Bitcoin",
            "selftext": "I bit of insight would be great\n\nEdit: Thanks to all of you who've replied.\nWhat're your hardware wallet suggestions?",
            "stickied": false,
            "comments": [
                {
                    "id": "i4uv3oi",
                    "author": "scarr34",
                    "score": 1185,
                    "created_utc": 1650044299.0,
                    "response": "When you biy something of value, you dont leave it at the store.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i4uwdx3",
                            "author": "FastFwdFrank",
                            "score": 147,
                            "created_utc": 1650044818.0,
                            "response": "I like this answer.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i4v4o0x",
                                    "author": "BTCdominance",
                                    "score": 115,
                                    "created_utc": 1650048210.0,
                                    "response": "”Not your keys, not your coin” is what the kids say.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i4vd65m",
                                            "author": "Ja_Nee_Misschien",
                                            "score": 13,
                                            "created_utc": 1650051826.0,
                                            "response": "exactly. the coins sit in the middle not in a vault, everyone sees them. Only the one with the keys controlls them. \n\nthe whole idea aboit Bitcoin is having secret keys. if someone else knows your keys thet aren't secret anymore so the whole idea collapses and you'll end up owning  cosfiscatable and taxable iou's.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i4vhuiw",
                                                    "author": "diradder",
                                                    "score": 14,
                                                    "created_utc": 1650053834.0,
                                                    "response": "> and you'll end up owning cosfiscatable and taxable iou's.\n\nThat's if you're lucky and the exchange doesn't (pretend to) get hacked and just tells you your balance is now 0. Or if they just run away with your money.\n\nGet a hardware wallet and withdraw. Take control. \n\n(And don't forget to have backups and test them).",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i4vjxib",
                                                            "author": "PRMan99",
                                                            "score": 11,
                                                            "created_utc": 1650054732.0,
                                                            "response": "> That's if you're lucky and the exchange doesn't (pretend to) get hacked and just tells you your balance is now 0. Or if they just run away with your money.\n\nAnd this is not a theoretical.  It has happened multiple times, including with the largest exchange in the world at the time Mt Gox.",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "i4vsxkb",
                                                            "author": "FixedGearJunkie",
                                                            "score": 9,
                                                            "created_utc": 1650058808.0,
                                                            "response": "Or your government doesn't force the exchange to freeze your assets. You know because of your unacceptable views.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i4wn2xi",
                                                                    "author": "vladamir_puto",
                                                                    "score": 11,
                                                                    "created_utc": 1650073162.0,
                                                                    "response": "There was a time not long ago when I would have called you nuts. That’s no longer the case",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                },
                                                                {
                                                                    "id": "i4x23gb",
                                                                    "author": "Kryptup",
                                                                    "score": 3,
                                                                    "created_utc": 1650080927.0,
                                                                    "response": "Governments shouldn't be able to freeze funds for an opposing view.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i4y0h7k",
                                                                            "author": "davidcwilliams",
                                                                            "score": 7,
                                                                            "created_utc": 1650106959.0,
                                                                            "response": "There’s a whole hell of a lot that governments shouldn’t.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i4v303v",
                            "author": "calabazookita",
                            "score": 34,
                            "created_utc": 1650047518.0,
                            "response": "But they promised they would take great care of it! \n\nI don’t even like to drive, I want to watch my lambo through the dealership glass.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i4vjzlb",
                                    "author": "PRMan99",
                                    "score": 3,
                                    "created_utc": 1650054758.0,
                                    "response": "The valet guys promise not to drive your Lambo.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i4v4dot",
                                    "author": "FDisk80",
                                    "score": 6,
                                    "created_utc": 1650048091.0,
                                    "response": "You can still drive it though, you just need an honest dealership to take care of it properly for you.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i4vhq8t",
                                            "author": "calabazookita",
                                            "score": 3,
                                            "created_utc": 1650053783.0,
                                            "response": "Please enjoy your very well deserved bank account sir",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i4v1t7p",
                            "author": "alxjnssn",
                            "score": 14,
                            "created_utc": 1650047029.0,
                            "response": "damn this goes hard",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i4uup6c",
                    "author": "-SPRENGMEISTER-",
                    "score": 66,
                    "created_utc": 1650044140.0,
                    "response": "As Andreas Antonopoulos famously phrased it: ”Not your keys, not your coins“. Custodial wallets like exchanges keep the private keys to your coins. Whoever has the private key, has the ultimate control over the coins on the corresponding address. So if you want to make sure that you are in control over your funds and don't lose them if e. g. the exchange gets hacked, you need to store the keys yourself, preferably on a hardware wallet.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4uwsm3",
                    "author": "Mallardshead",
                    "score": 45,
                    "created_utc": 1650044980.0,
                    "response": "* Because the friction with cold storage is collapsing. Self-custody is becoming quite easy and affordable, and soon with NFC, you'll be able to dispatch funds by tapping on your phone with the safety of your keys never touching a live internet connection.\n* Because simple free mobile software wallets (Bluewallet, MUUN, etc) and desktop wallets (Wasabi, Electrum, Samurai, Sparrow, etc) have proliferated like mad, which many people use casually now.\n* It's also growth of the LN that's sucking BTC into nodes-channels-wallets. It may not appear that there's that much BTC in LN channels currently, but those are all public routing nodes you can see, not private nodes which make up the vast majority and are hidden. That suckage should grow exponentially over the next few years.\n* It's bitcoin businesses growing\n* It's tax laws\n* It's more people opting to get paid in bitcoin\n* Most importantly however, it's actually that people are **SPENDING** more bitcoin than ever. More online businesses and brick and mortar shops are accepting bitcoin. People are gifting it. Donating it. Lots of rewards in bitcoin. Etcetera. All major exchanges have a mobile app that allows spending/sending, they have debit cards tied to their coinage, some even have bill pay.\n\nWe're moving from slowly, to suddenly.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i4wzetc",
                            "author": "Just_Me_91",
                            "score": 3,
                            "created_utc": 1650079456.0,
                            "response": "> Self-custody is becoming quite easy and affordable\n\nIs this true? I don't think there's been much change on that... it's always been easy and affordable.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i4uum9k",
                    "author": "ndgoLiberty",
                    "score": 17,
                    "created_utc": 1650044107.0,
                    "response": "The “don’t trust, verify” bitcoin mantra.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4v3odz",
                    "author": "DTR-Rob",
                    "score": 14,
                    "created_utc": 1650047798.0,
                    "response": "Ledger, when you get your ledger first learn how to reset it so you get to know the device better. After that you can move some crypto over. Start whit smal test transactions before you move over all the crypto. Take your time and learn to get used to the process. \n\nDon’t share your 24 words ever. \nDon’t save your 24 words on any device.\nWrite the words down. Save it in a vault. \nOur even better get a metal plate to engrave the words. \n\nAnd to be sure: Never share your 24 words.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4uuwab",
                    "author": "BTC-brother2018",
                    "score": 11,
                    "created_utc": 1650044217.0,
                    "response": "It means they plan to hodl those coins for a long period of time and not selling for years. If they're moving coins to exchanges it means they plan to sell sometime in the near term. It's also safer like the other commentor said.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4uukzd",
                    "author": "PanicBoners",
                    "score": 52,
                    "created_utc": 1650044094.0,
                    "response": "Not your keys, not your coins. Exchanges can be hacked and can use your positions to short the market",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i4uy7ns",
                            "author": "thondera",
                            "score": 17,
                            "created_utc": 1650045558.0,
                            "response": "honestly we're due another exchange collapse to teach the lesson",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i4vrlty",
                                    "author": "Retiredape",
                                    "score": 9,
                                    "created_utc": 1650058182.0,
                                    "response": "You're never going to get widespread Bitcoin adoption if you can't trust exchanges to hold your Bitcoin.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i4w0joz",
                                            "author": "arcrad",
                                            "score": 6,
                                            "created_utc": 1650062318.0,
                                            "response": "Widespread adoption of centralized exchanges is not widespread adoption of Bitcoin. It's widespread adoption of IOUs and is no different than the current fiat system.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i4xlxc5",
                                                    "author": "Dont_Say_No_to_Panda",
                                                    "score": 4,
                                                    "created_utc": 1650094465.0,
                                                    "response": "Yes and OP is saying a widespread amount of the population will not adopt Bitcoin without centralized exchanges. Not having to custody your own savings + being able to lose your bank password without going broke + FDIC insurance is peace of mind for most people.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i4wuvc9",
                            "author": "Slapshot382",
                            "score": 3,
                            "created_utc": 1650077058.0,
                            "response": "This. More troublesome than noobs losing their money for not taking custody of their own Bitcoin is the fact that exchanges can and probably are fractional reserve naming our Bitcoin.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i4v0dsz",
                    "author": "jimbowymbo",
                    "score": 32,
                    "created_utc": 1650046449.0,
                    "response": "I got scammed by MtGOX. Never again.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i4vsf4k",
                            "author": "dfunkmedia",
                            "score": 7,
                            "created_utc": 1650058560.0,
                            "response": "RIP in pieces me too buddy\n\nNever forgetti\n\nHardware wallets with recovery keys stamped into 314 stainless plates for me now",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i4uz1f5",
                    "author": "Dreboomboom",
                    "score": 7,
                    "created_utc": 1650045892.0,
                    "response": "Too many exchanges were hacked and people lost their life changing money because they left all their BTC and other coins on the exchange.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4uyppr",
                    "author": "brushpicks11",
                    "score": 19,
                    "created_utc": 1650045760.0,
                    "response": "I used to be in BlockFi gathering 4.5% interest and sure I earned $300 over the course of 7 months but I’d gladly give up $300 or 4.5% for the peace of mind no one can ever take that money from me.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i4v9zuy",
                            "author": "520throwaway",
                            "score": 9,
                            "created_utc": 1650050448.0,
                            "response": "Especially with BlockFi acting so shitty these days...",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i4uzr9s",
                    "author": "Br0kenRabbitTV",
                    "score": 7,
                    "created_utc": 1650046189.0,
                    "response": "It's more to do with exchanges trading paper coins than anything else that is being mentioned.\n\nNone of these people are even paying attention to the movement, or don't understand it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4uu21x",
                    "author": "HingleMccringel",
                    "score": 22,
                    "created_utc": 1650043885.0,
                    "response": "Potential for theft is much higher with exchanges. They get hacked: hacker steals your funds: youre fucked\n\nEdit: also exchanges tend to lock funds up sometimes so again your fucked if they decide to perform \"wallet maintenance\" for the next 7 years",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i4ux3va",
                            "author": "onoponyo",
                            "score": 5,
                            "created_utc": 1650045108.0,
                            "response": "Pardon my lack of knowledge - don't exchanges have liability up to some set amount if your funds are hacked / stolen?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i4vbom1",
                                    "author": "YesYesYesVeryGood",
                                    "score": 14,
                                    "created_utc": 1650051171.0,
                                    "response": "Not for Coinbase.  It is only insured by the FDIC for fiat currencies,  not crypto currencies. It's trick wording,  because they insure your account for $250,000,  but not in crypto currency.\n\nThere is even a clause they says they are not responsible for crypto theft.  check it out: https://help.coinbase.com/en/coinbase/other-topics/legal-policies/how-is-coinbase-insured",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i4uxcqs",
                                    "author": "Terror3y3z",
                                    "score": 11,
                                    "created_utc": 1650045209.0,
                                    "response": "Depends on the exchange. You have to read through all the legal jargon to see if they protect you or not.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i4v2qau",
                                            "author": "NiceDoctorBeam",
                                            "score": 11,
                                            "created_utc": 1650047407.0,
                                            "response": "With Bitcoin, possession is 100% of the law.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i4v9ckv",
                                    "author": "harbingerofzeke",
                                    "score": 6,
                                    "created_utc": 1650050174.0,
                                    "response": "Just because you have fire insurance doesn't mean you want your house to burn down.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i4v2qpp",
                                    "author": "LilBlueFire",
                                    "score": 5,
                                    "created_utc": 1650047412.0,
                                    "response": "Also even if they do have legal language protecting you, then you have to trust someone will enforce that language, and you have to trust it's even possible to make it even with you if they literally don't have Bitcoin to replace it with and can't acquire more because Bitcoin is worth a lot. Hypotheticals, sure, but its less of a headache to keep your own coins with your own private key because the number of things you have to worry a out reduces down to \"do I have access to my seed?\"",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i4uv0md",
                    "author": "Coctailer",
                    "score": 5,
                    "created_utc": 1650044264.0,
                    "response": "It also exposes the derivatives.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4uxe6k",
                    "author": "wattumofficial",
                    "score": 6,
                    "created_utc": 1650045226.0,
                    "response": "Leaving coins on the exchange is like allowing a mining provider to host your Bitcoin miner. It is more convenient but it is not in your possession. For HODL strategy, it is best to move your coins to your private wallet.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4v174y",
                    "author": "Awtz09",
                    "score": 5,
                    "created_utc": 1650046783.0,
                    "response": "Trezor is one of the best!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4v2pf8",
                    "author": "WiddleyScudds",
                    "score": 5,
                    "created_utc": 1650047397.0,
                    "response": "It make the price go uppy",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4vv71g",
                    "author": "bitcointwitter",
                    "score": 4,
                    "created_utc": 1650059847.0,
                    "response": "use bisq, not coinbase then you control your keys to trade for real bankers.\n\n&#x200B;\n\nnot some stablecoin defi pump dump regulation scam at those locations.\n\npoint72 is hell of payment for order flow; related to conbase.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4wwupo",
                    "author": "franzmr90",
                    "score": 4,
                    "created_utc": 1650078087.0,
                    "response": "Another perspective is that many people are looking at things like glassnode, doing data analysis and on-chain analytics. If large volumes of BTC move off exchange, it signals intent to hold long-term based on past data. We use things like the number of wallets that have not moved their coin in X time to determine market sentiment. If lots of people are moving BTC off exchange, and the number of individual wallets is growing, it signals A) people taking self-custody and B) retail market participation.  Things like 1 year illiquid vs liquid supply helps you determine the velocity of an asset. More HODLERS = less liquid supply. Less HODLERS = more liquid supply = higher velocity and more liquidity for large players entering and exiting the market.   \n\n\nWe've seen the BTC liquid supply on-exchange dwindle to somewhere between 1-2 million BTC by most estimates. When that exchange-side liquid supply drops below 1 million, I'm moving everything out of exchanges and my BlockFi interest account onto cold storage. You leave yours on exchange and let me know how it works out for you when exchange side liquid supply dries up and the market moves by an order of magnitude.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4utk8g",
                    "author": "morter88",
                    "score": 14,
                    "created_utc": 1650043687.0,
                    "response": "It’s safer",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4v1sgf",
                    "author": "KitchenProgram2555",
                    "score": 8,
                    "created_utc": 1650047021.0,
                    "response": "Exchanges are becoming more and more centralised. To operate in the US, UK etc they need licences and permission. If the government decides they want to freeze you assets they can freeze your crypto if on centralised exchange. They can’t if it’s in a private wallet.\n\nThen there’s the issue of hacking or exchange just vanishing with everyone’s crypto.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4uz22a",
                    "author": "captgh",
                    "score": 3,
                    "created_utc": 1650045899.0,
                    "response": "So they don't lose their coin when the exchange gets hacked. Next question.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4v26g0",
                    "author": "alxjnssn",
                    "score": 3,
                    "created_utc": 1650047180.0,
                    "response": "you don’t really know what you own on an exchange. if you withdraw it from the exchange into a hardware wallet, then you know you got bitcoin and are free to transact with it as you please. total control feels good.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4v3s22",
                    "author": "Rtbrosk",
                    "score": 3,
                    "created_utc": 1650047839.0,
                    "response": "moving assets from exchanges to wallets eliminates counter party risk......if they close the bank you can still access your money.....",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4xukkw",
                    "author": "Geee",
                    "score": 3,
                    "created_utc": 1650101970.0,
                    "response": "Exchanges can lie about their reserves, i.e. they can create \"paper bitcoin\" from thin air. You don't know if you actually own bitcoin unless you have it in your own wallet. On larger scale, this can lead to inflation and suppression of price.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i4ygzut",
                            "author": "nino262596",
                            "score": 3,
                            "created_utc": 1650117136.0,
                            "response": "No doubt about it they have been doing that from quite a long time now.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i4ygwmu",
                    "author": "Sharing-my-bad-ideas",
                    "score": 3,
                    "created_utc": 1650117092.0,
                    "response": "Not your keys…not your crypto",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4v21vb",
                    "author": "showmeyourcoins",
                    "score": 6,
                    "created_utc": 1650047128.0,
                    "response": "Google Mt. Gox",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i4w5nxa",
                            "author": "Chytrik",
                            "score": 3,
                            "created_utc": 1650064730.0,
                            "response": "Or Cryptsy... or QuadrigaCX... or one of the many, many other exchanges that lost customer funds one way or another. Don't leave your coins in a honeypot or you're gonna have a bad time.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i4uvvv8",
                    "author": "phamtruax",
                    "score": 3,
                    "created_utc": 1650044615.0,
                    "response": "If an exchange fails you lose everything",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "upn6oz",
            "title": "Question about DCAing into BTC right now",
            "url": "https://www.reddit.com/r/Bitcoin/comments/upn6oz/question_about_dcaing_into_btc_right_now/",
            "author": "WallstreetBytes",
            "created_utc": 1652552615.0,
            "score": 5,
            "num_comments": 47,
            "subreddit": "Bitcoin",
            "selftext": "We probably haven’t entered an official bear market yet (maybe we have? Who knows…) should we DCA on the way down or wait, what are your thoughts?\n\nI ask because I know there’s season vets on this sub, and I want to hear from you guys/gals, thanks!",
            "stickied": false,
            "comments": [
                {
                    "id": "i8lrnaj",
                    "author": "jmicsmith",
                    "score": 24,
                    "created_utc": 1652553025.0,
                    "response": "DCA is not conditional on price, that's the whole point.  If it goes down, DCA on the way down. If this is the bottom, DCA now at the bottom.  If it starts going up, keep DCA'ing on the way up.  Don't look at price, just DCA",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8lwy0m",
                            "author": "OfficialMarsCurrency",
                            "score": 3,
                            "created_utc": 1652555472.0,
                            "response": "This is the way",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8m95u2",
                            "author": "Infamous_Fun_14",
                            "score": 3,
                            "created_utc": 1652561148.0,
                            "response": "This guy DCAs",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8lt7sq",
                    "author": "GooeyButterflies",
                    "score": 13,
                    "created_utc": 1652553741.0,
                    "response": "We've been in a bear market for awhile now and I think it's a perfect time to start DCAing. Any BTC under 30k is a steal.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8lx5hr",
                            "author": "OfficialMarsCurrency",
                            "score": 3,
                            "created_utc": 1652555570.0,
                            "response": "Yes, if it goes down more pick that up too!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8m1rg9",
                                    "author": "thondera",
                                    "score": 3,
                                    "created_utc": 1652557737.0,
                                    "response": "Yeah, that's also why you should have a stable source of income when acumulating bitcoin. So you can take a chunk of your salary every month and put it to the best use, for your future self.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8ltm95",
                    "author": "bryanchicken",
                    "score": 6,
                    "created_utc": 1652553925.0,
                    "response": "Lower highs and lower lows. Clearly bear market. \nI’ve broken down my funds to last for 500 days worth of buys. Takes me until about 6months prior to halving",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8m5pp4",
                    "author": "Jarvidex",
                    "score": 4,
                    "created_utc": 1652559559.0,
                    "response": "Trying to perfectly time the bottom is an impossible game of chance, this is why DCA exists, to remove emotion from the table by setting strict purchase intervals & amounts.\nI buy regularly and constantly and don't worry too much about price since one years top is another years bottom.\nI do however tend to ramp things up a little once we enter extreme fear markets but even then I follow strict rules to prevent emotional smash buys.\nI never mess around with my intervals, they are a sacred part of my emotionless strategy, however I increase my intervals dollar spent amount by 50% once the fear index hits 25.\nEveryone's strategy is different but I learned a long time ago that I'm impulsive and often fucked myself with dumb smash buys.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8lwklk",
                    "author": "NiceDoctorBeam",
                    "score": 3,
                    "created_utc": 1652555295.0,
                    "response": "Time IN the market beats timing the market.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ls3hv",
                    "author": "solomonsatoshi",
                    "score": 7,
                    "created_utc": 1652553235.0,
                    "response": "Only buy Bitcoin if you want to be part of the revolution to restore integrity to the monetary system.\n\nOnly buy Bitcoin if you understand and accept there are risks involved in taking on the fiat debt slavery cartel.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "upr9eq",
            "title": "If you're bailing from bitcoin into other assets, you may as well look back into the past bear markets to see what you're doing to yourself. Gaze into the souls of those in 2017 and 2020 who did the same - and feel the ripples of their regret across years of space-time. Yep, you should've HODLd.",
            "url": "https://twitter.com/robustus/status/1525272002482868224?cxt=HHwWgMC43cKz7aoqAAAA",
            "author": "pcvcolin",
            "created_utc": 1652565092.0,
            "score": 86,
            "num_comments": 18,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8n6e8y",
                    "author": "0neLetter",
                    "score": 3,
                    "created_utc": 1652577077.0,
                    "response": "I owned AMD at 2$ to 3$ and sold because I made some pennies. It’s currently crashed to around 95$. \n\nIf I had just kept this one investment I’d be rich and made up for all other mistakes in all of my investments ever.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8mr99k",
                    "author": "micjolly1",
                    "score": 9,
                    "created_utc": 1652569559.0,
                    "response": "If you sell, you must like working the 9-5 because that's what you are opting for.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8mqy1t",
                    "author": "jusmar",
                    "score": 3,
                    "created_utc": 1652569423.0,
                    "response": "> don't sell you're making it worse",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ups756",
            "title": "If Celsius goes down your coins go down with it. Beware: Take your coins out of Exchanges.",
            "url": "https://i.redd.it/bec221huriz81.jpg",
            "author": "Deep-Art3195",
            "created_utc": 1652568090.0,
            "score": 333,
            "num_comments": 109,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8mtl0f",
                    "author": "Orchid_Significant",
                    "score": 105,
                    "created_utc": 1652570651.0,
                    "response": "Why is everyone so surprised by this? Banks have the FDIC which is how they guarantee a certain amount of your cash back if they go under. Exchanges are not banks and crypto is not government backed fiat",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8n8e8e",
                            "author": "kwayzzz",
                            "score": 33,
                            "created_utc": 1652578125.0,
                            "response": "People are surprised by this because it is wrong. Exchanges are not banks so they should not be acting like banks and leveraging and loaning against assets that they are simply holding. Everything held on exchange should be fully backed 1:1. The exchange should profit from fees, subscriptions, advertising, promotions, et. But NOT by risking peoples crypto.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8nmsij",
                                    "author": "One_Psychology_6500",
                                    "score": 14,
                                    "created_utc": 1652585887.0,
                                    "response": "It’s not wrong. It’s an agreement between customer and custodian. I lend you my bitcoin. You take risks with it to pay me a fair return commiserate to that risk.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8o31ca",
                                    "author": "BastiatF",
                                    "score": 7,
                                    "created_utc": 1652596963.0,
                                    "response": "You realize that you are lending your coins to Celcius, right? It's called default risk. That's why you get paid interest.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8nmnx1",
                                    "author": "MMinjin",
                                    "score": 6,
                                    "created_utc": 1652585811.0,
                                    "response": "When you give your crypto to someone else, you are risking it. It doesn't matter if it is fully backed or not. If they go bankrupt, those assets are in their possession and you are simply one one of many people on their list of creditors and you won't be at the top of the list. The only reason banks can promise that you keep possession of your money if a bank goes under is because the FDIC guarantees it.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8myzy1",
                    "author": "KaiSosceles",
                    "score": 32,
                    "created_utc": 1652573298.0,
                    "response": "This makes way more sense than Coinbase's disclaimer though.\n\nCelsius is very clear that your coins are part of a lending and borrowing service.\n\nCoinbase is a custodian.\n\nThere should be different risks associated with these 2 very different activities.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8n8js6",
                            "author": "kwayzzz",
                            "score": 8,
                            "created_utc": 1652578207.0,
                            "response": "Funny thing is everyone in crypto wants to argue that crypto is not security, until things like this happen and literally every argument is solved by treating it like a security",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8nmm1f",
                                    "author": "One_Psychology_6500",
                                    "score": 5,
                                    "created_utc": 1652585781.0,
                                    "response": "Bitcoin is property. Most crypto tokens are securities.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8ndqr6",
                    "author": "margalolwut",
                    "score": 14,
                    "created_utc": 1652580899.0,
                    "response": "Some reputable poster should write a guide and pin it on how to remove coins from an exchange.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8mokpg",
                    "author": "Inevitable_River_509",
                    "score": 30,
                    "created_utc": 1652568322.0,
                    "response": "Take your coins out of the freaking exchanges. No interest percentage is worth the risk.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8nh46m",
                            "author": "vwite",
                            "score": 7,
                            "created_utc": 1652582690.0,
                            "response": "I'd say it's worth the risk for small amounts per exchange, it's not worth the risk if your putting your life savings and absolutely all your money in a single exchange, but if you're diversified it's just like investing a stock that pays \\~6% dividends per year on top of normal growth but it has the risk of going bankrupt so shares could go to zero. You should never put all your money in a single stock but a small amount is worth the risk.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8mxe8d",
                    "author": "sebikun",
                    "score": 7,
                    "created_utc": 1652572497.0,
                    "response": "Not a fan of nonsense regulation but this needs to get regulated!\n\n\"or otherwise unable to repay\" for example losing the keys in a boating accident or CEO dies with the keys in india?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8n10vr",
                            "author": "dadlif3",
                            "score": 4,
                            "created_utc": 1652574343.0,
                            "response": ">losing the keys in a boating accident or CEO dies with the keys in india?\n\nHey I've seen his one before... it's a classic!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8myvt3",
                    "author": "Mas113m",
                    "score": 7,
                    "created_utc": 1652573239.0,
                    "response": "Hmmm. \n\nSo, is a Trezor Model One good?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8n0p91",
                            "author": "Savik519",
                            "score": 5,
                            "created_utc": 1652574177.0,
                            "response": "Yes, good choice. Buy directly from the Trezor website",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8nk1iv",
                    "author": "Kno010",
                    "score": 7,
                    "created_utc": 1652584315.0,
                    "response": "How do people still not understand that this is how every centralized crypto company works?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8mqwsb",
                    "author": "eqleriq",
                    "score": 12,
                    "created_utc": 1652569408.0,
                    "response": "They're not \"your coins.\"\n\nNotice it says \"regain ownership.\"",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8n6hfk",
                    "author": "maininshadow",
                    "score": 13,
                    "created_utc": 1652577125.0,
                    "response": "> If Celsius goes down\n\nImagine losing your stack because of the temperature.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8nvz3x",
                            "author": "Zooooooombie",
                            "score": 4,
                            "created_utc": 1652591635.0,
                            "response": "Dad?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8mpb3v",
                    "author": "Savik519",
                    "score": 13,
                    "created_utc": 1652568661.0,
                    "response": "It’s simple. I see a post about taking coins off exchanges and i upvote.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8nhna7",
                    "author": "chk0123456",
                    "score": 8,
                    "created_utc": 1652582983.0,
                    "response": "OP why are you posting dumb shit?\n\nCelsius is a lending platform, they lend the money you deposit. If they somehow lose the money they lent, you obviously are not getting that money back unless they have reserves to cover that loss (which as far as I know they have). If Celsius goes under, it'd be because the money they lent has not been paid back therefore they don't have \"your\" money. If you don't like that, don't give your money to a lending platform lmao and go do something else with your money.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ns750",
                    "author": "Rare_Ad9767",
                    "score": 5,
                    "created_utc": 1652589162.0,
                    "response": "well, the APY can't be for free...",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8o2inb",
                    "author": "Rtbrosk",
                    "score": 3,
                    "created_utc": 1652596553.0,
                    "response": "no different than a brokerage holding your stock in an account",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8mtkpp",
                    "author": "Baby-Yoda2021",
                    "score": 3,
                    "created_utc": 1652570647.0,
                    "response": "Have they posted something like this from coinbase??",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ups24g",
            "title": "Bitcoin tax free everywhere now it’s legal tender in two countries?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/ups24g/bitcoin_tax_free_everywhere_now_its_legal_tender/",
            "author": "paulminors",
            "created_utc": 1652567634.0,
            "score": 40,
            "num_comments": 19,
            "subreddit": "Bitcoin",
            "selftext": "I was recently listening to the [Orange Pill podcast](https://podcasts.apple.com/nz/podcast/orange-pill-podcast/id1527940173?i=1000558910300) and host Stacey stated that because Bitcoin is legal tender in at least two countries (El Salvador and Central African Republic) according to the UN charter it shouldn’t be taxed in all UN countries. \n\nI looked at the UN charter but couldn’t find evidence of this. Can anyone confirm or deny this statement?",
            "stickied": false,
            "comments": [
                {
                    "id": "i8mtnyd",
                    "author": "link_dead",
                    "score": 21,
                    "created_utc": 1652570691.0,
                    "response": "Yep sounds legit, just upload the podcast with your 1040.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8nhfbo",
                    "author": "eitoajtio",
                    "score": 19,
                    "created_utc": 1652582862.0,
                    "response": "That's not how it works. \n\nYou can literally trade USD to another fiat and back, you still pay taxes on gains.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8n7ghi",
                    "author": "DatBuridansAss",
                    "score": 6,
                    "created_utc": 1652577632.0,
                    "response": "This is like those people who say you don't really have to pay taxes, or that the law is unconstitutional. Even if they're right they end up in prison.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8mqxl2",
                    "author": "DonOregano",
                    "score": 4,
                    "created_utc": 1652569418.0,
                    "response": "That is unlikely to be the complete situation. I mean currency (fiat, I mean) traders get taxed, right?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8msfxk",
                    "author": "BitcoinUser263895",
                    "score": 6,
                    "created_utc": 1652570114.0,
                    "response": "This is why you don't waste time listening to pundits.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}