{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "u4d5sj",
            "title": "out of the loop: Why are people moving their coins from exchanges to private wallets?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/u4d5sj/out_of_the_loop_why_are_people_moving_their_coins/",
            "author": "onoponyo",
            "created_utc": 1650043673.0,
            "score": 282,
            "num_comments": 315,
            "subreddit": "Bitcoin",
            "selftext": "I bit of insight would be great\n\nEdit: Thanks to all of you who've replied.\nWhat're your hardware wallet suggestions?",
            "stickied": false,
            "comments": [
                {
                    "id": "i4uv3oi",
                    "author": "scarr34",
                    "score": 1185,
                    "created_utc": 1650044299.0,
                    "response": "When you biy something of value, you dont leave it at the store.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i4uwdx3",
                            "author": "FastFwdFrank",
                            "score": 147,
                            "created_utc": 1650044818.0,
                            "response": "I like this answer.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i4v4o0x",
                                    "author": "BTCdominance",
                                    "score": 115,
                                    "created_utc": 1650048210.0,
                                    "response": "”Not your keys, not your coin” is what the kids say.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i4vd65m",
                                            "author": "Ja_Nee_Misschien",
                                            "score": 13,
                                            "created_utc": 1650051826.0,
                                            "response": "exactly. the coins sit in the middle not in a vault, everyone sees them. Only the one with the keys controlls them. \n\nthe whole idea aboit Bitcoin is having secret keys. if someone else knows your keys thet aren't secret anymore so the whole idea collapses and you'll end up owning  cosfiscatable and taxable iou's.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i4vhuiw",
                                                    "author": "diradder",
                                                    "score": 14,
                                                    "created_utc": 1650053834.0,
                                                    "response": "> and you'll end up owning cosfiscatable and taxable iou's.\n\nThat's if you're lucky and the exchange doesn't (pretend to) get hacked and just tells you your balance is now 0. Or if they just run away with your money.\n\nGet a hardware wallet and withdraw. Take control. \n\n(And don't forget to have backups and test them).",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i4vjxib",
                                                            "author": "PRMan99",
                                                            "score": 11,
                                                            "created_utc": 1650054732.0,
                                                            "response": "> That's if you're lucky and the exchange doesn't (pretend to) get hacked and just tells you your balance is now 0. Or if they just run away with your money.\n\nAnd this is not a theoretical.  It has happened multiple times, including with the largest exchange in the world at the time Mt Gox.",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "i4vsxkb",
                                                            "author": "FixedGearJunkie",
                                                            "score": 9,
                                                            "created_utc": 1650058808.0,
                                                            "response": "Or your government doesn't force the exchange to freeze your assets. You know because of your unacceptable views.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i4wn2xi",
                                                                    "author": "vladamir_puto",
                                                                    "score": 11,
                                                                    "created_utc": 1650073162.0,
                                                                    "response": "There was a time not long ago when I would have called you nuts. That’s no longer the case",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                },
                                                                {
                                                                    "id": "i4x23gb",
                                                                    "author": "Kryptup",
                                                                    "score": 3,
                                                                    "created_utc": 1650080927.0,
                                                                    "response": "Governments shouldn't be able to freeze funds for an opposing view.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i4y0h7k",
                                                                            "author": "davidcwilliams",
                                                                            "score": 7,
                                                                            "created_utc": 1650106959.0,
                                                                            "response": "There’s a whole hell of a lot that governments shouldn’t.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i4v303v",
                            "author": "calabazookita",
                            "score": 34,
                            "created_utc": 1650047518.0,
                            "response": "But they promised they would take great care of it! \n\nI don’t even like to drive, I want to watch my lambo through the dealership glass.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i4vjzlb",
                                    "author": "PRMan99",
                                    "score": 3,
                                    "created_utc": 1650054758.0,
                                    "response": "The valet guys promise not to drive your Lambo.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i4v4dot",
                                    "author": "FDisk80",
                                    "score": 6,
                                    "created_utc": 1650048091.0,
                                    "response": "You can still drive it though, you just need an honest dealership to take care of it properly for you.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i4vhq8t",
                                            "author": "calabazookita",
                                            "score": 3,
                                            "created_utc": 1650053783.0,
                                            "response": "Please enjoy your very well deserved bank account sir",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i4v1t7p",
                            "author": "alxjnssn",
                            "score": 14,
                            "created_utc": 1650047029.0,
                            "response": "damn this goes hard",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i4uup6c",
                    "author": "-SPRENGMEISTER-",
                    "score": 66,
                    "created_utc": 1650044140.0,
                    "response": "As Andreas Antonopoulos famously phrased it: ”Not your keys, not your coins“. Custodial wallets like exchanges keep the private keys to your coins. Whoever has the private key, has the ultimate control over the coins on the corresponding address. So if you want to make sure that you are in control over your funds and don't lose them if e. g. the exchange gets hacked, you need to store the keys yourself, preferably on a hardware wallet.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4uwsm3",
                    "author": "Mallardshead",
                    "score": 45,
                    "created_utc": 1650044980.0,
                    "response": "* Because the friction with cold storage is collapsing. Self-custody is becoming quite easy and affordable, and soon with NFC, you'll be able to dispatch funds by tapping on your phone with the safety of your keys never touching a live internet connection.\n* Because simple free mobile software wallets (Bluewallet, MUUN, etc) and desktop wallets (Wasabi, Electrum, Samurai, Sparrow, etc) have proliferated like mad, which many people use casually now.\n* It's also growth of the LN that's sucking BTC into nodes-channels-wallets. It may not appear that there's that much BTC in LN channels currently, but those are all public routing nodes you can see, not private nodes which make up the vast majority and are hidden. That suckage should grow exponentially over the next few years.\n* It's bitcoin businesses growing\n* It's tax laws\n* It's more people opting to get paid in bitcoin\n* Most importantly however, it's actually that people are **SPENDING** more bitcoin than ever. More online businesses and brick and mortar shops are accepting bitcoin. People are gifting it. Donating it. Lots of rewards in bitcoin. Etcetera. All major exchanges have a mobile app that allows spending/sending, they have debit cards tied to their coinage, some even have bill pay.\n\nWe're moving from slowly, to suddenly.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i4wzetc",
                            "author": "Just_Me_91",
                            "score": 3,
                            "created_utc": 1650079456.0,
                            "response": "> Self-custody is becoming quite easy and affordable\n\nIs this true? I don't think there's been much change on that... it's always been easy and affordable.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i4uum9k",
                    "author": "ndgoLiberty",
                    "score": 17,
                    "created_utc": 1650044107.0,
                    "response": "The “don’t trust, verify” bitcoin mantra.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4v3odz",
                    "author": "DTR-Rob",
                    "score": 14,
                    "created_utc": 1650047798.0,
                    "response": "Ledger, when you get your ledger first learn how to reset it so you get to know the device better. After that you can move some crypto over. Start whit smal test transactions before you move over all the crypto. Take your time and learn to get used to the process. \n\nDon’t share your 24 words ever. \nDon’t save your 24 words on any device.\nWrite the words down. Save it in a vault. \nOur even better get a metal plate to engrave the words. \n\nAnd to be sure: Never share your 24 words.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4uuwab",
                    "author": "BTC-brother2018",
                    "score": 11,
                    "created_utc": 1650044217.0,
                    "response": "It means they plan to hodl those coins for a long period of time and not selling for years. If they're moving coins to exchanges it means they plan to sell sometime in the near term. It's also safer like the other commentor said.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4uukzd",
                    "author": "PanicBoners",
                    "score": 52,
                    "created_utc": 1650044094.0,
                    "response": "Not your keys, not your coins. Exchanges can be hacked and can use your positions to short the market",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i4uy7ns",
                            "author": "thondera",
                            "score": 17,
                            "created_utc": 1650045558.0,
                            "response": "honestly we're due another exchange collapse to teach the lesson",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i4vrlty",
                                    "author": "Retiredape",
                                    "score": 9,
                                    "created_utc": 1650058182.0,
                                    "response": "You're never going to get widespread Bitcoin adoption if you can't trust exchanges to hold your Bitcoin.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i4w0joz",
                                            "author": "arcrad",
                                            "score": 6,
                                            "created_utc": 1650062318.0,
                                            "response": "Widespread adoption of centralized exchanges is not widespread adoption of Bitcoin. It's widespread adoption of IOUs and is no different than the current fiat system.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i4xlxc5",
                                                    "author": "Dont_Say_No_to_Panda",
                                                    "score": 4,
                                                    "created_utc": 1650094465.0,
                                                    "response": "Yes and OP is saying a widespread amount of the population will not adopt Bitcoin without centralized exchanges. Not having to custody your own savings + being able to lose your bank password without going broke + FDIC insurance is peace of mind for most people.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i4wuvc9",
                            "author": "Slapshot382",
                            "score": 3,
                            "created_utc": 1650077058.0,
                            "response": "This. More troublesome than noobs losing their money for not taking custody of their own Bitcoin is the fact that exchanges can and probably are fractional reserve naming our Bitcoin.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i4v0dsz",
                    "author": "jimbowymbo",
                    "score": 32,
                    "created_utc": 1650046449.0,
                    "response": "I got scammed by MtGOX. Never again.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i4vsf4k",
                            "author": "dfunkmedia",
                            "score": 7,
                            "created_utc": 1650058560.0,
                            "response": "RIP in pieces me too buddy\n\nNever forgetti\n\nHardware wallets with recovery keys stamped into 314 stainless plates for me now",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i4uz1f5",
                    "author": "Dreboomboom",
                    "score": 7,
                    "created_utc": 1650045892.0,
                    "response": "Too many exchanges were hacked and people lost their life changing money because they left all their BTC and other coins on the exchange.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4uyppr",
                    "author": "brushpicks11",
                    "score": 19,
                    "created_utc": 1650045760.0,
                    "response": "I used to be in BlockFi gathering 4.5% interest and sure I earned $300 over the course of 7 months but I’d gladly give up $300 or 4.5% for the peace of mind no one can ever take that money from me.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i4v9zuy",
                            "author": "520throwaway",
                            "score": 9,
                            "created_utc": 1650050448.0,
                            "response": "Especially with BlockFi acting so shitty these days...",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i4uzr9s",
                    "author": "Br0kenRabbitTV",
                    "score": 7,
                    "created_utc": 1650046189.0,
                    "response": "It's more to do with exchanges trading paper coins than anything else that is being mentioned.\n\nNone of these people are even paying attention to the movement, or don't understand it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4uu21x",
                    "author": "HingleMccringel",
                    "score": 22,
                    "created_utc": 1650043885.0,
                    "response": "Potential for theft is much higher with exchanges. They get hacked: hacker steals your funds: youre fucked\n\nEdit: also exchanges tend to lock funds up sometimes so again your fucked if they decide to perform \"wallet maintenance\" for the next 7 years",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i4ux3va",
                            "author": "onoponyo",
                            "score": 5,
                            "created_utc": 1650045108.0,
                            "response": "Pardon my lack of knowledge - don't exchanges have liability up to some set amount if your funds are hacked / stolen?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i4vbom1",
                                    "author": "YesYesYesVeryGood",
                                    "score": 14,
                                    "created_utc": 1650051171.0,
                                    "response": "Not for Coinbase.  It is only insured by the FDIC for fiat currencies,  not crypto currencies. It's trick wording,  because they insure your account for $250,000,  but not in crypto currency.\n\nThere is even a clause they says they are not responsible for crypto theft.  check it out: https://help.coinbase.com/en/coinbase/other-topics/legal-policies/how-is-coinbase-insured",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i4uxcqs",
                                    "author": "Terror3y3z",
                                    "score": 11,
                                    "created_utc": 1650045209.0,
                                    "response": "Depends on the exchange. You have to read through all the legal jargon to see if they protect you or not.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i4v2qau",
                                            "author": "NiceDoctorBeam",
                                            "score": 11,
                                            "created_utc": 1650047407.0,
                                            "response": "With Bitcoin, possession is 100% of the law.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i4v9ckv",
                                    "author": "harbingerofzeke",
                                    "score": 6,
                                    "created_utc": 1650050174.0,
                                    "response": "Just because you have fire insurance doesn't mean you want your house to burn down.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i4v2qpp",
                                    "author": "LilBlueFire",
                                    "score": 5,
                                    "created_utc": 1650047412.0,
                                    "response": "Also even if they do have legal language protecting you, then you have to trust someone will enforce that language, and you have to trust it's even possible to make it even with you if they literally don't have Bitcoin to replace it with and can't acquire more because Bitcoin is worth a lot. Hypotheticals, sure, but its less of a headache to keep your own coins with your own private key because the number of things you have to worry a out reduces down to \"do I have access to my seed?\"",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i4uv0md",
                    "author": "Coctailer",
                    "score": 5,
                    "created_utc": 1650044264.0,
                    "response": "It also exposes the derivatives.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4uxe6k",
                    "author": "wattumofficial",
                    "score": 6,
                    "created_utc": 1650045226.0,
                    "response": "Leaving coins on the exchange is like allowing a mining provider to host your Bitcoin miner. It is more convenient but it is not in your possession. For HODL strategy, it is best to move your coins to your private wallet.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4v174y",
                    "author": "Awtz09",
                    "score": 5,
                    "created_utc": 1650046783.0,
                    "response": "Trezor is one of the best!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4v2pf8",
                    "author": "WiddleyScudds",
                    "score": 5,
                    "created_utc": 1650047397.0,
                    "response": "It make the price go uppy",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4vv71g",
                    "author": "bitcointwitter",
                    "score": 4,
                    "created_utc": 1650059847.0,
                    "response": "use bisq, not coinbase then you control your keys to trade for real bankers.\n\n&#x200B;\n\nnot some stablecoin defi pump dump regulation scam at those locations.\n\npoint72 is hell of payment for order flow; related to conbase.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4wwupo",
                    "author": "franzmr90",
                    "score": 4,
                    "created_utc": 1650078087.0,
                    "response": "Another perspective is that many people are looking at things like glassnode, doing data analysis and on-chain analytics. If large volumes of BTC move off exchange, it signals intent to hold long-term based on past data. We use things like the number of wallets that have not moved their coin in X time to determine market sentiment. If lots of people are moving BTC off exchange, and the number of individual wallets is growing, it signals A) people taking self-custody and B) retail market participation.  Things like 1 year illiquid vs liquid supply helps you determine the velocity of an asset. More HODLERS = less liquid supply. Less HODLERS = more liquid supply = higher velocity and more liquidity for large players entering and exiting the market.   \n\n\nWe've seen the BTC liquid supply on-exchange dwindle to somewhere between 1-2 million BTC by most estimates. When that exchange-side liquid supply drops below 1 million, I'm moving everything out of exchanges and my BlockFi interest account onto cold storage. You leave yours on exchange and let me know how it works out for you when exchange side liquid supply dries up and the market moves by an order of magnitude.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4utk8g",
                    "author": "morter88",
                    "score": 14,
                    "created_utc": 1650043687.0,
                    "response": "It’s safer",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4v1sgf",
                    "author": "KitchenProgram2555",
                    "score": 8,
                    "created_utc": 1650047021.0,
                    "response": "Exchanges are becoming more and more centralised. To operate in the US, UK etc they need licences and permission. If the government decides they want to freeze you assets they can freeze your crypto if on centralised exchange. They can’t if it’s in a private wallet.\n\nThen there’s the issue of hacking or exchange just vanishing with everyone’s crypto.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4uz22a",
                    "author": "captgh",
                    "score": 3,
                    "created_utc": 1650045899.0,
                    "response": "So they don't lose their coin when the exchange gets hacked. Next question.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4v26g0",
                    "author": "alxjnssn",
                    "score": 3,
                    "created_utc": 1650047180.0,
                    "response": "you don’t really know what you own on an exchange. if you withdraw it from the exchange into a hardware wallet, then you know you got bitcoin and are free to transact with it as you please. total control feels good.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4v3s22",
                    "author": "Rtbrosk",
                    "score": 3,
                    "created_utc": 1650047839.0,
                    "response": "moving assets from exchanges to wallets eliminates counter party risk......if they close the bank you can still access your money.....",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4xukkw",
                    "author": "Geee",
                    "score": 3,
                    "created_utc": 1650101970.0,
                    "response": "Exchanges can lie about their reserves, i.e. they can create \"paper bitcoin\" from thin air. You don't know if you actually own bitcoin unless you have it in your own wallet. On larger scale, this can lead to inflation and suppression of price.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i4ygzut",
                            "author": "nino262596",
                            "score": 3,
                            "created_utc": 1650117136.0,
                            "response": "No doubt about it they have been doing that from quite a long time now.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i4ygwmu",
                    "author": "Sharing-my-bad-ideas",
                    "score": 3,
                    "created_utc": 1650117092.0,
                    "response": "Not your keys…not your crypto",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4v21vb",
                    "author": "showmeyourcoins",
                    "score": 6,
                    "created_utc": 1650047128.0,
                    "response": "Google Mt. Gox",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i4w5nxa",
                            "author": "Chytrik",
                            "score": 3,
                            "created_utc": 1650064730.0,
                            "response": "Or Cryptsy... or QuadrigaCX... or one of the many, many other exchanges that lost customer funds one way or another. Don't leave your coins in a honeypot or you're gonna have a bad time.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i4uvvv8",
                    "author": "phamtruax",
                    "score": 3,
                    "created_utc": 1650044615.0,
                    "response": "If an exchange fails you lose everything",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "upn6oz",
            "title": "Question about DCAing into BTC right now",
            "url": "https://www.reddit.com/r/Bitcoin/comments/upn6oz/question_about_dcaing_into_btc_right_now/",
            "author": "WallstreetBytes",
            "created_utc": 1652552615.0,
            "score": 5,
            "num_comments": 64,
            "subreddit": "Bitcoin",
            "selftext": "We probably haven’t entered an official bear market yet (maybe we have? Who knows…) should we DCA on the way down or wait, what are your thoughts?\n\nI ask because I know there’s season vets on this sub, and I want to hear from you guys/gals, thanks!",
            "stickied": false,
            "comments": [
                {
                    "id": "i8lrnaj",
                    "author": "jmicsmith",
                    "score": 40,
                    "created_utc": 1652553025.0,
                    "response": "DCA is not conditional on price, that's the whole point.  If it goes down, DCA on the way down. If this is the bottom, DCA now at the bottom.  If it starts going up, keep DCA'ing on the way up.  Don't look at price, just DCA",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8lwy0m",
                            "author": "OfficialMarsCurrency",
                            "score": 7,
                            "created_utc": 1652555472.0,
                            "response": "This is the way",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8m95u2",
                            "author": "Infamous_Fun_14",
                            "score": 6,
                            "created_utc": 1652561148.0,
                            "response": "This guy DCAs",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8lt7sq",
                    "author": "GooeyButterflies",
                    "score": 17,
                    "created_utc": 1652553741.0,
                    "response": "We've been in a bear market for awhile now and I think it's a perfect time to start DCAing. Any BTC under 30k is a steal.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8lx5hr",
                            "author": "OfficialMarsCurrency",
                            "score": 6,
                            "created_utc": 1652555570.0,
                            "response": "Yes, if it goes down more pick that up too!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8m1rg9",
                                    "author": "thondera",
                                    "score": 6,
                                    "created_utc": 1652557737.0,
                                    "response": "Yeah, that's also why you should have a stable source of income when acumulating bitcoin. So you can take a chunk of your salary every month and put it to the best use, for your future self.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8miyr7",
                            "author": "ANGELINA__JOLIE",
                            "score": 6,
                            "created_utc": 1652565686.0,
                            "response": "i remember they used to say that  buying under 5k is a steal. And i was thinking no 5k is still expensive it might go lower.  funny now under 30k is a steal",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8mcpta",
                            "author": "WallstreetBytes",
                            "score": 3,
                            "created_utc": 1652562792.0,
                            "response": "Thanks friend! I’m gonna start DCAing tomorrow. I have USDT and BUSD on the sidelines.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8ltm95",
                    "author": "bryanchicken",
                    "score": 8,
                    "created_utc": 1652553925.0,
                    "response": "Lower highs and lower lows. Clearly bear market. \nI’ve broken down my funds to last for 500 days worth of buys. Takes me until about 6months prior to halving",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8m5pp4",
                    "author": "Jarvidex",
                    "score": 7,
                    "created_utc": 1652559559.0,
                    "response": "Trying to perfectly time the bottom is an impossible game of chance, this is why DCA exists, to remove emotion from the table by setting strict purchase intervals & amounts.\nI buy regularly and constantly and don't worry too much about price since one years top is another years bottom.\nI do however tend to ramp things up a little once we enter extreme fear markets but even then I follow strict rules to prevent emotional smash buys.\nI never mess around with my intervals, they are a sacred part of my emotionless strategy, however I increase my intervals dollar spent amount by 50% once the fear index hits 25.\nEveryone's strategy is different but I learned a long time ago that I'm impulsive and often fucked myself with dumb smash buys.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8mcvp6",
                            "author": "WallstreetBytes",
                            "score": 3,
                            "created_utc": 1652562868.0,
                            "response": "You’re right. I’m trying to time the bottom too much. thanks for the advice!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8lwklk",
                    "author": "NiceDoctorBeam",
                    "score": 5,
                    "created_utc": 1652555295.0,
                    "response": "Time IN the market beats timing the market.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8mczzd",
                            "author": "WallstreetBytes",
                            "score": 3,
                            "created_utc": 1652562923.0,
                            "response": "👌",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8ls3hv",
                    "author": "solomonsatoshi",
                    "score": 12,
                    "created_utc": 1652553235.0,
                    "response": "Only buy Bitcoin if you want to be part of the revolution to restore integrity to the monetary system.\n\nOnly buy Bitcoin if you understand and accept there are risks involved in taking on the fiat debt slavery cartel.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8lvaj2",
                            "author": "lordsamadhi",
                            "score": 4,
                            "created_utc": 1652554700.0,
                            "response": "I like you. This is what Bitcoin is about.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8mcykj",
                            "author": "WallstreetBytes",
                            "score": 4,
                            "created_utc": 1652562905.0,
                            "response": "MVP mindset, thanks!",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8mv9pm",
                            "author": "horsecyack",
                            "score": 3,
                            "created_utc": 1652571455.0,
                            "response": "Are you open for massage bookings?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8mhj8a",
                    "author": "Quantris",
                    "score": 3,
                    "created_utc": 1652565018.0,
                    "response": "The whole idea of DCA is that you're not looking at the price. It should be determined by how much cash you have to spare and then you just set it and forget it.\n\nIf you want to become a trader instead then do that but don't fool yourself into thinking it is DCA 2.0.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8msyov",
                    "author": "DryTechnology5224",
                    "score": 3,
                    "created_utc": 1652570358.0,
                    "response": "-50%+ over the past 6 months and we're still not in a bear market? What planet are you on?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8n2qdq",
                    "author": "Character_Body_2810",
                    "score": 3,
                    "created_utc": 1652575195.0,
                    "response": "I bought from the start of 2019- mid 2020. Then sold the second time it dropped to 50k in 2021.\n\nI started DCAing again this week. I will buy weekly for the next 18 months then sell at 150k.\n\nJust my personal plan. Do with it what you will.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ups24g",
            "title": "Bitcoin tax free everywhere now it’s legal tender in two countries?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/ups24g/bitcoin_tax_free_everywhere_now_its_legal_tender/",
            "author": "paulminors",
            "created_utc": 1652567634.0,
            "score": 46,
            "num_comments": 25,
            "subreddit": "Bitcoin",
            "selftext": "I was recently listening to the [Orange Pill podcast](https://podcasts.apple.com/nz/podcast/orange-pill-podcast/id1527940173?i=1000558910300) and host Stacey stated that because Bitcoin is legal tender in at least two countries (El Salvador and Central African Republic) according to the UN charter it shouldn’t be taxed in all UN countries. \n\nI looked at the UN charter but couldn’t find evidence of this. Can anyone confirm or deny this statement?",
            "stickied": false,
            "comments": [
                {
                    "id": "i8mtnyd",
                    "author": "link_dead",
                    "score": 26,
                    "created_utc": 1652570691.0,
                    "response": "Yep sounds legit, just upload the podcast with your 1040.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8pauc8",
                            "author": "ItsSomethingNot",
                            "score": 2,
                            "created_utc": 1652626919.0,
                            "response": "omfg :DDD",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8nhfbo",
                    "author": "eitoajtio",
                    "score": 24,
                    "created_utc": 1652582862.0,
                    "response": "That's not how it works. \n\nYou can literally trade USD to another fiat and back, you still pay taxes on gains.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8nkhy6",
                            "author": "tokyo_aces",
                            "score": 0,
                            "created_utc": 1652584572.0,
                            "response": "Should be higher up.\n\nOP's podcast's claim is quite easy to disprove, as it's available on [irs.gov](https://irs.gov) (of course) but also *your bank will tell you this as well*.  Both explicitly in a FAQ or small print on the foreign currency buy/sell page of their online site, and implicitly when they send you a P&L statement at EOY because you bought and sold some EUR or CHF or whatever.\n\nYou report gains on cross-currency trades.  Status of the currency or country using it (in UN, out of UN, who cares) is irrelevant.\n\nTo be charitable, perhaps they weren't talking about 0-tax, but rather categorization of BTC as a plain old currency no longer subject to capital gains tax on all types of liquidation (e.g. using it to buy something), only some?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8o3vqh",
                                    "author": "BastiatF",
                                    "score": 9,
                                    "created_utc": 1652597642.0,
                                    "response": "Not what we are talking about here. Suppose you buy EUR at your local bureau de change then weeks later spend them at a restaurant. If EURUSD has gone up in between the two events, do you owe capital gains tax? Obviously not, otherwise every trip abroad would become a huge tax headache.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8n7ghi",
                    "author": "DatBuridansAss",
                    "score": 7,
                    "created_utc": 1652577632.0,
                    "response": "This is like those people who say you don't really have to pay taxes, or that the law is unconstitutional. Even if they're right they end up in prison.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8nzy8i",
                            "author": "WalksOnLego",
                            "score": 2,
                            "created_utc": 1652594541.0,
                            "response": "You don't really have to drive on the correct side of the road, either.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8msfxk",
                    "author": "BitcoinUser263895",
                    "score": 6,
                    "created_utc": 1652570114.0,
                    "response": "This is why you don't waste time listening to pundits.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8mpb0k",
                    "author": "Nada_Lives",
                    "score": 2,
                    "created_utc": 1652568660.0,
                    "response": "Technical snag: It's a \"reference currency\" in the CAR, not legal tender.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8ncggj",
                            "author": "pigeonpoopypoo",
                            "score": 1,
                            "created_utc": 1652580223.0,
                            "response": "What about El Salvador",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8n0hsa",
                    "author": "midizzz",
                    "score": 2,
                    "created_utc": 1652574069.0,
                    "response": "Governments will hardly turn down money you give them volunteerily.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8n4g55",
                    "author": "Asmodiar_",
                    "score": 2,
                    "created_utc": 1652576063.0,
                    "response": "I'm not going to pay taxes ever again. Will keep y'all updated on what happens 🤷\n\nLosses only here though so.... Fml",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8mqxl2",
                    "author": "DonOregano",
                    "score": 2,
                    "created_utc": 1652569418.0,
                    "response": "That is unlikely to be the complete situation. I mean currency (fiat, I mean) traders get taxed, right?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8ol8xv",
                            "author": "MaxSan",
                            "score": 1,
                            "created_utc": 1652612408.0,
                            "response": "Depends on jurisdiction for that but  currency swaps (spot or some types of derivatives, sometimes) are tax free",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8otxku",
                                    "author": "DonOregano",
                                    "score": 1,
                                    "created_utc": 1652618358.0,
                                    "response": "Okay, I know nothing about this, really 😃.\nBut you'd still be taxed when you \"cash out\", right?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8tkk7h",
                                            "author": "MaxSan",
                                            "score": 1,
                                            "created_utc": 1652710092.0,
                                            "response": "Ive no idea what you mean by \"cash out\". A currency swap is a currency swap. Same answer as above.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8n8wgm",
                    "author": "Hughski",
                    "score": 2,
                    "created_utc": 1652578394.0,
                    "response": "Wouldn’t waste your time listening to this stuff",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ob0ka",
                    "author": "walloon5",
                    "score": 1,
                    "created_utc": 1652603663.0,
                    "response": "I think they're talking about the organization of the United Nations itself... or maybe the nations that make up the United Nations? Not sure.\n\n\"SECTION 5. Without being restricted by financial controls, regulations or moratoria of any kind,\n\n(a) The United Nations may hold funds, gold or currency of any kind and operate accounts in any currency;\n\n(b) The United Nations shall be free to transfer its funds, gold or currency from one country to another or within any country and to convert any currency held by it into any other currency\"\n\n[https://www.un.org/en/ethics/assets/pdfs/Convention%20of%20Privileges-Immunities%20of%20the%20UN.pdf](https://www.un.org/en/ethics/assets/pdfs/Convention%20of%20Privileges-Immunities%20of%20the%20UN.pdf)\n\nSo maybe she's saying that if El Salvador has made bitcoin legal tender (a currency of any kind) then they are free to transfer their funds to and from another country without restriction. Hmm I guess. Maybe the UN doesn't really allow for financial sanctions actually. Never thought of that.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8odwaf",
                    "author": "AbbydonX",
                    "score": 1,
                    "created_utc": 1652606134.0,
                    "response": "Foreign currencies are financial assets and liable for capital gains tax in the UK (with a few caveats for simplicity).",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8onkq4",
                    "author": "wowoowwowoow",
                    "score": 1,
                    "created_utc": 1652614195.0,
                    "response": "Dubai HK and Singapore",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8mq6tg",
                    "author": "metalzip",
                    "score": 0,
                    "created_utc": 1652569077.0,
                    "response": "bump",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "upr9eq",
            "title": "If you're bailing from bitcoin into other assets, you may as well look back into the past bear markets to see what you're doing to yourself. Gaze into the souls of those in 2017 and 2020 who did the same - and feel the ripples of their regret across years of space-time. Yep, you should've HODLd.",
            "url": "https://twitter.com/robustus/status/1525272002482868224?cxt=HHwWgMC43cKz7aoqAAAA",
            "author": "pcvcolin",
            "created_utc": 1652565092.0,
            "score": 145,
            "num_comments": 32,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8mr99k",
                    "author": "micjolly1",
                    "score": 10,
                    "created_utc": 1652569559.0,
                    "response": "If you sell, you must like working the 9-5 because that's what you are opting for.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8munef",
                            "author": "pcvcolin",
                            "score": 1,
                            "created_utc": 1652571156.0,
                            "response": "It's o.k. to have \"hustles\" and work, even a lot.  I enjoy doing work (so long as it's work I enjoy).\n\nMaybe another item to note here is that work isn't always about doing *everything that you love all the time*, just about doing what you want to be doing (things that give you joy) and those things that you need to be doing (things you know you need to do, even if some of those things you do don't always give you joy), so long as the end result of what you are contributing towards is meaningful, serves the purpose of your company or the organization you are working for, and gives you and your family satisfaction and security.   But I think I'm diverting from the point of this post.  \n\nThis isn't the antiwork sub (and I don't approve of antiwork) - this is the bitcoin sub, so to sum up in responding to your comment, this is just me stating that human **and** technological work is important, but by necessity, the sort of work that we will find ourselves doing or joyful doing in the open market will always be evolving and changing.  That is, the work *you* find valuable is important, the work performed *by specialized machines* (for example, bitcoin miners) is important, and *some sort of hybrid* is important where people gradually become owners and beneficiaries of work done by robots / automatons / automations - that's important too ( if you want to get more into ideas about that, see r/Vyrdism, and as one specific example, see:  [https://np.reddit.com/r/Vyrdism/comments/5d82w1/new\\_here\\_how\\_can\\_i\\_join\\_a\\_technocoop/](https://np.reddit.com/r/Vyrdism/comments/5d82w1/new_here_how_can_i_join_a_technocoop/) )\n\nBut mostly, my post was meant to emphasize that people shouldn't be quick to get into panic selling and trying to get into this to make a quick buck, and before they dump a valuable and scarce asset, they should look back on the past.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8n8bmo",
                                    "author": "BdayEvryDay",
                                    "score": 6,
                                    "created_utc": 1652578087.0,
                                    "response": "Btc has given me the ability to work only when I want. 5 years ago I was working like a mad man stacking as much Btc as possible. Thank god I did that. I am free to say no.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8o2iwi",
                                            "author": "Spartan3123",
                                            "score": 2,
                                            "created_utc": 1652596558.0,
                                            "response": "Yeah everyone needs some duck you money to avoid turning into a corporate simp like most people",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i8npobg",
                                            "author": "HootDaBugger",
                                            "score": 1,
                                            "created_utc": 1652587597.0,
                                            "response": "Out of curiosity how do you keep up with your obligations? Do you sell any btc or are you using it as collateral for loans?",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8mqy1t",
                    "author": "jusmar",
                    "score": 4,
                    "created_utc": 1652569423.0,
                    "response": "> don't sell you're making it worse",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8pnoi8",
                    "author": "No_Skill_RL",
                    "score": 2,
                    "created_utc": 1652632578.0,
                    "response": "Tell me this o wise reddit, what is the best way to convert all my small crypto assets to bitcoin? Convert them to Tether first? big thanks",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8txu27",
                            "author": "pcvcolin",
                            "score": 1,
                            "created_utc": 1652715719.0,
                            "response": "Use an exchange.  Obviously the less conversions possible the better.  Then, avoid acquiring the small cap crypto assets at all after the conversion.  [Dollar cost average into bitcoin](https://dcabtc.com/).  The exchanges that allow you the most direct conversions, that's great if you can do it, but many of those exchanges (most if not all) don't operate / aren't licensed from jurisdictions that give you any ownership rights at all over your assets.  So instead, use Kraken, which is licensed in Wyoming, which does give you ownership rights over your assets even when the assets are in fully managed custody of the exchange.\n\nIf you are running a business you can use a service like Coinpayments if you are a businessperson: [https://www.coinpayments.net/help-fees](https://www.coinpayments.net/help-fees) Simple, you can accept payment in any cryptocurrency, but do any number of conversions and have your settings directed to direct the conversion result in bitcoin payment to your hardware wallet address.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8n6e8y",
                    "author": "0neLetter",
                    "score": 6,
                    "created_utc": 1652577077.0,
                    "response": "I owned AMD at 2$ to 3$ and sold because I made some pennies. It’s currently crashed to around 95$. \n\nIf I had just kept this one investment I’d be rich and made up for all other mistakes in all of my investments ever.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8o2wiv",
                    "author": "TILTNSTACK",
                    "score": 4,
                    "created_utc": 1652596857.0,
                    "response": "Not just hodl.\n\nStart DCA’ing in through the bear and accumulation phases",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8o5100",
                            "author": "pcvcolin",
                            "score": 0,
                            "created_utc": 1652598574.0,
                            "response": "A thoughtful ₿ plan.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8o405u",
                    "author": "blopblipbloup",
                    "score": 2,
                    "created_utc": 1652597742.0,
                    "response": "There is no second Best",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8n0g7m",
                    "author": "Hughski",
                    "score": 2,
                    "created_utc": 1652574047.0,
                    "response": "I think it’s a pretty good time to sell because I think it’s gonna dip further, so you can then buy in again with a discount but nobody knows if we’ve bottomed out yet",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8ngszf",
                            "author": "aeras1131",
                            "score": 2,
                            "created_utc": 1652582521.0,
                            "response": "That is the capitulation talking ;)",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8nowwc",
                                    "author": "Hughski",
                                    "score": 5,
                                    "created_utc": 1652587144.0,
                                    "response": "Nah I honestly think it will drop more - I think lower than 15k actually. But I also think it’ll be back up above 50k again in the not too distant future and higher than ever. \n\nI’m thinking of selling half so I have leeway to rebuy at a discount but also won’t be super bummed out if I’m wrong and it plateaus or starts going straight back up.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8npi4f",
                                            "author": "coinoptic",
                                            "score": 5,
                                            "created_utc": 1652587497.0,
                                            "response": "Preserving capital is a part of investing I myself need to get better at.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8twqz2",
                            "author": "pcvcolin",
                            "score": 1,
                            "created_utc": 1652715276.0,
                            "response": "Or you could just keep it and DCA, which frankly would be wiser.\n\nhttps://dcabtc.com/",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8n4keo",
                    "author": "andstillheavy",
                    "score": -1,
                    "created_utc": 1652576125.0,
                    "response": "20 to 22k",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8mzjak",
                    "author": "Schwickity",
                    "score": -2,
                    "created_utc": 1652573576.0,
                    "response": "Yea just buy more. Btw, what do you think the bottom will be?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8of9w4",
                            "author": "Interstellar_Being",
                            "score": 1,
                            "created_utc": 1652607325.0,
                            "response": "I think we will see a shakeout to about 22k-24k. It’s hard to say, it could spike lower before big absorption begin. \n\nThen there could be a longer accumulation phase (sideway market) with some more shakeouts of leverage longs until we see an (explosive?) uptrend. \n\nBut no one knows, that’s just my view of things 🫠",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8q073b",
                            "author": "Gandalftron",
                            "score": 0,
                            "created_utc": 1652638009.0,
                            "response": "14k",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8q0lrl",
                                    "author": "Schwickity",
                                    "score": 2,
                                    "created_utc": 1652638185.0,
                                    "response": "Based on trust me bro?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8t6udn",
                    "author": "Marokiii",
                    "score": 0,
                    "created_utc": 1652703089.0,
                    "response": "i thought this was a currency and not a stock? do currencies have bear and bull markets?",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ups756",
            "title": "If Celsius goes down your coins go down with it. Beware: Take your coins out of Exchanges.",
            "url": "https://i.redd.it/bec221huriz81.jpg",
            "author": "Deep-Art3195",
            "created_utc": 1652568090.0,
            "score": 516,
            "num_comments": 250,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8mtl0f",
                    "author": "Orchid_Significant",
                    "score": 170,
                    "created_utc": 1652570651.0,
                    "response": "Why is everyone so surprised by this? Banks have the FDIC which is how they guarantee a certain amount of your cash back if they go under. Exchanges are not banks and crypto is not government backed fiat",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8n8e8e",
                            "author": "kwayzzz",
                            "score": 76,
                            "created_utc": 1652578125.0,
                            "response": "People are surprised by this because it is wrong. Exchanges are not banks so they should not be acting like banks and leveraging and loaning against assets that they are simply holding. Everything held on exchange should be fully backed 1:1. The exchange should profit from fees, subscriptions, advertising, promotions, et. But NOT by risking peoples crypto.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8nmsij",
                                    "author": "One_Psychology_6500",
                                    "score": 23,
                                    "created_utc": 1652585887.0,
                                    "response": "It’s not wrong. It’s an agreement between customer and custodian. I lend you my bitcoin. You take risks with it to pay me a fair return commiserate to that risk.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8oa9yg",
                                            "author": "reactorfuel",
                                            "score": 6,
                                            "created_utc": 1652603029.0,
                                            "response": "I commiserate.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i8p5b39",
                                            "author": "pwrstrug",
                                            "score": 1,
                                            "created_utc": 1652624369.0,
                                            "response": "> You take risks with it to pay me a fair return commiserate to that risk.\n\nwait... you guys are getting returns on your crypto from leaving it in exchanges? and here I am leaving it in my hardware wallet while the amount doesn't increase unless I add to it.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8phpp0",
                                                    "author": "anonymouscitizen2",
                                                    "score": 8,
                                                    "created_utc": 1652630011.0,
                                                    "response": "1-3% on your Bitcoin isn’t worth losing 100% of it. You are doing the right thing, looking back in history will show you that the people in charge of being custodians of extremely rare assets have a tendency to “lose them” at your expense",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i8srarj",
                                                    "author": "CallingVoid",
                                                    "score": 2,
                                                    "created_utc": 1652691124.0,
                                                    "response": "Keep it that way. These websites are risky as fuck, people have no idea what they get up to with their money and there are virtually no regulations protecting what gets stuck on them.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i8qclg8",
                                                    "author": "Unnormally2",
                                                    "score": 1,
                                                    "created_utc": 1652643520.0,
                                                    "response": "Yea, I get about a 5-6% return.  It gets paid in bitcoin, so I just add to my stack passively, as well as with my regular DCA.  Considering I am also getting the appreciation on bitcoin in the long term, it's pretty sweet.  Just choose your platform carefully, and do your research.  I use Hodlnaut.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8r2zvf",
                                                            "author": "One_Psychology_6500",
                                                            "score": 1,
                                                            "created_utc": 1652655241.0,
                                                            "response": "Better yet: spread your money across multiple platforms. That way you are getting the highest possible interest tier for each, and you lessen your exposure if one goes down. Hopefully, you are choosing reputable platforms, so it’s unlikely. Maxing out at 0.1 btc on each platform seems about right.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i8s1prh",
                                            "author": "thahobbyenjoyer",
                                            "score": -1,
                                            "created_utc": 1652672181.0,
                                            "response": "This conversation is the hopelessly naive vs. The incredibly cucked",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i8owdbx",
                                    "author": "tyroswork",
                                    "score": 18,
                                    "created_utc": 1652619764.0,
                                    "response": "Haha, \"should\"? They can do whatever the fuck they want, you agreed to it when you got suckered into it.\n\nDecentralization of crypto works both ways. Sure, no one controls it. But also no one is there to bail you out should you get fucked over by another individual or entity. You wanted decentralization and freedom from government control - this is it.\n\nIf you want to truly own crypto - buy and hold it yourself, without an exchange or a middle man, that's the only way you can be sure you have it.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8own0r",
                                            "author": "kwayzzz",
                                            "score": 2,
                                            "created_utc": 1652619908.0,
                                            "response": "Oh I agree. I did not get suckered into anything. The word you are looking for is “people”. People agreed to it.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i8qrnqd",
                                            "author": "gigahydra",
                                            "score": 1,
                                            "created_utc": 1652650108.0,
                                            "response": "Bitcoin will need to ditch this mentality to ultimately be successful.  The sad truth is the vast majority of human society value decentralization and freedom from government control significantly less than a stable and predictable return on investment.  It's on us to demonstrate that our option can provide that for the masses... Not on the masses to adopt to our worldview.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8rkpal",
                                                    "author": "tyroswork",
                                                    "score": 1,
                                                    "created_utc": 1652663809.0,
                                                    "response": "I agree. \n\nSadly, it's not going to happen. The average person will not bother putting an an effort to take responsibility for their own coins. Heck, an average person can barely use a computer at all",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i8plpgu",
                                            "author": "Cyclonis123",
                                            "score": 1,
                                            "created_utc": 1652631739.0,
                                            "response": "but exchanges aren't decentralized.  The ugly truth is these exchanges are needed.  I don't want crypto regulated but these centralized exchanges need to be regulated.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8pvx3u",
                                                    "author": "tyroswork",
                                                    "score": -1,
                                                    "created_utc": 1652636144.0,
                                                    "response": "Haha, do I hear a call for regulations from crypto bros? You do realize that's just going to make crypto same as fiat and we're going to be back where we started",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8pzpu0",
                                                            "author": "LayPessimist",
                                                            "score": 1,
                                                            "created_utc": 1652637802.0,
                                                            "response": "A lot of people simply cannot take responsibility for their own money, and cry for muh regulation when they lose it.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8qsetj",
                                                                    "author": "Cyclonis123",
                                                                    "score": 1,
                                                                    "created_utc": 1652650434.0,
                                                                    "response": "No, it's not that.  Bitcoin is decentralized and regulating it would be completely against what it is (and it would cease being what it is).  Exchanges are centralized companies, stablecoins (some) claim to be backed by other assets.  By its nature, Bitcoin is not directly tied to any asset nor is there is any authority that could make such a claim.\n\nMost seem against regulation under the premise that the point of crypto is to get away from government/bank control. I get that, but it seems unavoidable up to this point that centralized points form and these points need to be regulated. exchanges need to have some oversight and stablecoins that claim to have backed assets need to be forced to be transparent and should be audited.\n\ndo I want regulation of Bitcoin? fuck no.\n\ndo I want regulation of stable coins? fuck yes.\n\nIf you think this isn't necessary then moving forward we need to remove the need for exchanges and stable coins tied to other assets.  \n\nIf you have that figured out, I'm all ears.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                },
                                                                {
                                                                    "id": "i8q2n2v",
                                                                    "author": "tyroswork",
                                                                    "score": 0,
                                                                    "created_utc": 1652639074.0,
                                                                    "response": "I say we call for regulations so that the government can ensure our money is safe. Maybe we should also enforce so that exchanges keep a certain amount of our coins on hand so that they don't loan everyone's money out. Then we should probably institute a central exchange that would have power to be a \"lender of last resort\" so that exchanges can borrow from it overnight and so that they don't go out of business. We do want to ensure our money is safe, after all...\n\nHmm, wait...",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i8nmnx1",
                                    "author": "MMinjin",
                                    "score": 11,
                                    "created_utc": 1652585811.0,
                                    "response": "When you give your crypto to someone else, you are risking it. It doesn't matter if it is fully backed or not. If they go bankrupt, those assets are in their possession and you are simply one one of many people on their list of creditors and you won't be at the top of the list. The only reason banks can promise that you keep possession of your money if a bank goes under is because the FDIC guarantees it.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8pqz7h",
                                            "author": "AffectionateCanary25",
                                            "score": 3,
                                            "created_utc": 1652634011.0,
                                            "response": "Even the FDIC is not immune to being insolvent. \n\nIt wouldn't take much to push FDIC over the edge. \n\nThere really is risk everywhere.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i8w0ss8",
                                            "author": "francescotonizzo",
                                            "score": 3,
                                            "created_utc": 1652747566.0,
                                            "response": "But they promise to give us the coins back when we need it? Are they not sure about this?",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i8o31ca",
                                    "author": "BastiatF",
                                    "score": 12,
                                    "created_utc": 1652596963.0,
                                    "response": "You realize that you are lending your coins to Celcius, right? It's called default risk. That's why you get paid interest.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8w0p2a",
                                            "author": "rikandbitcoins",
                                            "score": 1,
                                            "created_utc": 1652747513.0,
                                            "response": "Don't trust your exchanges, keep your coins in your possession. It's a great feeling",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i8nmmgi",
                                    "author": "Gandalftron",
                                    "score": 0,
                                    "created_utc": 1652585788.0,
                                    "response": "Fully backed by who?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8nzmlt",
                                            "author": "tesseramous",
                                            "score": 8,
                                            "created_utc": 1652594294.0,
                                            "response": "by actual coins sitting in a wallet",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8p08bi",
                                                    "author": "Gandalftron",
                                                    "score": 1,
                                                    "created_utc": 1652621861.0,
                                                    "response": "That makes absolutely zero sense.  You cannot insure something with the thing itself.  \n\n\"I am insuring my car with my car. In the case that my car is damaged, stolen, or destroyed, then use my car as means of repayment\"",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8pw81v",
                                                            "author": "tesseramous",
                                                            "score": 3,
                                                            "created_utc": 1652636274.0,
                                                            "response": "I'm not saying it's insurance.  What I'm saying is when you deposit a coin,  the exchange should keep your actual coin under their control.  They shouldn't run a fractional reserve system and send your coin off the site to do some other investment and make even more money than the fees they are charging you. Imagine if you gave a gold bar to the bank for safekeeping and you asked for it back and they said 'sorry it's not here we sold it and you have to wait for us to buy it back'. \n\nIf traders have collectively deposited 100 bitcoins, 500 litecoins, and 2000 dogecoins,  then the exchange should  continue to possess safekeep at least 100 bitcoins, 500 litecoins, and 2000 dogecoins, and not some other configuration, until someone withdrawals.\n\nDeposited funds should not be used to write loans, make extra investments or to pay employees/ executives.  They should only make fees. \n\nI know as someone coming from a fiat banking system you may find this confusing or unreasonable",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i8nxgdw",
                                    "author": "yoitsbobby88",
                                    "score": 0,
                                    "created_utc": 1652592685.0,
                                    "response": "Wrong doesn’t mean you’re right.  A lot of things are wrong.  Life isn’t always fair.  So definitely don’t trust anyone with your loot",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8r8y28",
                                    "author": "Dont_Say_No_to_Panda",
                                    "score": 1,
                                    "created_utc": 1652658157.0,
                                    "response": "Banks have to give the same declaration in their 10Qs, the only difference is the FDIC. So are you in favor of more regulation in this space?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8nk263",
                            "author": "thefullmcnulty",
                            "score": 4,
                            "created_utc": 1652584325.0,
                            "response": "FDIC only covers a fraction of deposits and liabilities of banks. It’s designed to cover a singular failure and wasn’t sufficient for a 2008-style plural default situation.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8nn09o",
                                    "author": "togetherwem0m0",
                                    "score": 3,
                                    "created_utc": 1652586015.0,
                                    "response": "Fdic is for deposits, not investments. Fdic covers all deposits up to 250k in usd made at fdic insured banks",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8noe9q",
                                            "author": "thefullmcnulty",
                                            "score": 4,
                                            "created_utc": 1652586830.0,
                                            "response": "If all the major banks default (as they did previously) the FDIC doesn’t have close to enough liquidity to bail them out.\n\nI posted a link to proof in my reply to the other commenter.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8npc6w",
                                                    "author": "togetherwem0m0",
                                                    "score": 0,
                                                    "created_utc": 1652587400.0,
                                                    "response": "As they did previously when?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8nqfk8",
                                                            "author": "thefullmcnulty",
                                                            "score": 2,
                                                            "created_utc": 1652588061.0,
                                                            "response": "In 2008 many major banks went bankrupt. All but Lehman were bailed out with tax payer money because the FDIC didn’t hold enough to cover their liabilities.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8nsdcm",
                                                                    "author": "togetherwem0m0",
                                                                    "score": 2,
                                                                    "created_utc": 1652589267.0,
                                                                    "response": "Lehman wasn't \"bailed out\" by the fdic what are you talking about? You might want to check your history.\n\nLehman brothers was an investment bank, it was not part of the fdic insured deposits regime. It wasn't even bailed out. It was allowed to go into bankruptcy.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i8r92re",
                                                                            "author": "Dont_Say_No_to_Panda",
                                                                            "score": 3,
                                                                            "created_utc": 1652658223.0,
                                                                            "response": "It’s mind blowing you are being downvoted and the other guy is being upvoted.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        },
                                                                        {
                                                                            "id": "i8nt0gv",
                                                                            "author": "thefullmcnulty",
                                                                            "score": 4,
                                                                            "created_utc": 1652589670.0,
                                                                            "response": ">\tAll but Lehman were bailed out with tax payer money\n\nYou’re so biased and weird you misread the sentence and just contrived a fiction. Slow down and try harder to be cogent. \n\nMany retail banks went under in 2008 as well and the FDIC could not cover it. They moved balance sheets around, made ~~700 billion~~ a fuck ton of fugazi money, and swept it all under the rug. I actually took a class in business school about this crisis. \n\nYou’re also totally ignoring the fact that the former Vice chair of the FDIC also admitted on record they can’t cover their liabilities. \n\nYou’re wrong. Fix your comments and move on with on humility if you’re not a piece of shit.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i8nthv8",
                                                                                    "author": "togetherwem0m0",
                                                                                    "score": 4,
                                                                                    "created_utc": 1652589974.0,
                                                                                    "response": "The point of his comment isn't a warning it's how insurance works. The fdic doesn't need to have a balance sheet to cover all liabilities. A dissolved bank is liquidated and sold. The majority of funds used to cover deposits come from liquidation not the fdic balance sheet.\n\nThe fdic covered their insured deposits in every case during the 2008 crisis and none of the 700 billion has anything to do with how the fdic worked during g the crisis. The number you're talking about is tarp and tarp is the troubled assets relief program. Tarp let the treasury buy. troubled assets! Again nothing to do with fdic",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i8nveyd",
                                                                                            "author": "thefullmcnulty",
                                                                                            "score": 1,
                                                                                            "created_utc": 1652591240.0,
                                                                                            "response": "It wasn’t possible. The authorities won’t come out and say that but they just changed the ledgers in ways that worked and make up a bullshit story and moved on. It doesn’t matter because there is absolutely nothing people can do about their corruption. \n\nAgain, why are you ignoring the fact that the former vice chairman of the FDIC is on record saying they cannot cover even a small portion of their total liabilities? \n\nYou really sound like a guy who believes the FED speak and believes the political rhetoric and the official position of nation states. Are you that guy? Of course these people make up lies and paper over the very real frailty of the corrupt systems they run and the systems that keep them “successful”. \n\nIf the former vice chair of the FDIC doesn’t convince with his own admission then your delusions are far too imbedded to untangle. And idgaf that you’re delusional I’m done w it",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "id": "i8nwtoh",
                                                                                    "author": "GildedSilverBitcoins",
                                                                                    "score": 0,
                                                                                    "created_utc": 1652592226.0,
                                                                                    "response": "It'd be a little irrelevant. The government would step in to fund FDIC if there was ever a problem with the insurance coverage for depositors. \n\nWhy am I so sure? \n\nRegime change would be highly probable if that situation occurred and the government did not follow through and make people whole. Deposit insurance is an explicit guarantee to expressly avoid the types of bank runs the US used to have before the 1930s.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i8nxpoa",
                                                                                            "author": "thefullmcnulty",
                                                                                            "score": 1,
                                                                                            "created_utc": 1652592870.0,
                                                                                            "response": "Just like in 2008. If the FDIC could’ve covered things in 2008 they would have but they had 10% of the required reserves or less. \n\nOf course the US federal government stepped in. Banksters are huge benefactors and they were mostly all insolvent. The planners had the few solvent banks left “buy” the insolvent banks to wipe out as much of the bad liabilities as possible. All the remaining liabilities (estimated at .5-1 trillion) were covered by the fed in a record (at that time) bailout. \n\nIf the FDIC could’ve done it the planners would have loved for that institution to have fulfilled its main purpose lol but it was woefully inadequate.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "i8te1j1",
                                                                    "author": "Gandalftron",
                                                                    "score": 1,
                                                                    "created_utc": 1652707000.0,
                                                                    "response": "Holy shit man...do you know what the FDIC is?",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i8nmo2k",
                                    "author": "Gandalftron",
                                    "score": -5,
                                    "created_utc": 1652585813.0,
                                    "response": "This is a lie.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8no57k",
                                            "author": "thefullmcnulty",
                                            "score": 3,
                                            "created_utc": 1652586681.0,
                                            "response": "Actually, it’s completely true.\n\nListen to what the former Vice Chairman of the FDIC Thomas Hoenig [had to say about the inability of the FDIC to cover its massive liabilities](https://youtu.be/VV6U206lHEI&t=1m30s) in the event of another financial crisis. \n \nSince your comment is actually the lie you should edit it to reflect the fact that you’re wrong, or delete it.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8nx1q3",
                                                    "author": "HearMeRoar69",
                                                    "score": 2,
                                                    "created_utc": 1652592387.0,
                                                    "response": "FDIC is a government agency, they will honor their promise no matter what if they want to maintain the creditworthiness of the US federal government. \n\nin your video it's already shown congress will pass whatever amount is needed to fund the FDIC's payout. Yeah without congress stepping in, FDIC doesn't have enough on hand on a regular basis, they don't have several trillion just sitting there waiting for a big financial crisis that wipe out all banks, but congress will ALWAYS pass whatever amount FDIC needs to cover everyone.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8ny145",
                                                            "author": "thefullmcnulty",
                                                            "score": 0,
                                                            "created_utc": 1652593103.0,
                                                            "response": "Yeah I agree. The point is as it stands the FDIC is a token to manipulate people and realistically a joke. \n\nIn the end we all know the fiat planners will just make however much fake debt “money” as they need in the event of anything deemed a crisis.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i8nv0zm",
                                    "author": "Orchid_Significant",
                                    "score": -1,
                                    "created_utc": 1652590985.0,
                                    "response": "I know what the FDIC is. My comment is implying that the people shocked by crypto apps not insuring their coins do not know or understand.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8o2uoi",
                            "author": "Doppelex",
                            "score": 1,
                            "created_utc": 1652596818.0,
                            "response": "Securities brokers have segregated accounts from client assets",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8otynm",
                                    "author": "Orchid_Significant",
                                    "score": 2,
                                    "created_utc": 1652618375.0,
                                    "response": "I get that but crypto is not a security. I mean it could be eventually, but you will have to agree to allow it to be government regulated if you want the safety that goes along with it",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8p9z6z",
                                            "author": "Doppelex",
                                            "score": 1,
                                            "created_utc": 1652626526.0,
                                            "response": "I don’t know, you can just structure your company such that there is strict segregation and clients are not senior debt holders of the company but such that you are just their custodian\n\nComingling client assets with the company balance sheet is a choice",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8mwmuo",
                            "author": "Deep-Art3195",
                            "score": -6,
                            "created_utc": 1652572119.0,
                            "response": "cos many people still hold their coins on exchanges. I guess they are lazy and won’t take effort to move and store them by themselves",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8ndgdp",
                                    "author": "ejfrodo",
                                    "score": 9,
                                    "created_utc": 1652580744.0,
                                    "response": "It's not laziness. In the case or Celsius (the topic or this post( or Crypto.com or BlockFi or Nexo or many others ppl are choosing to accept the risk in return for anywhere from 2-13% APR on their assets.\n\nIMHO the risk is very high so the return should be higher to accommodate that.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8o3oh5",
                                            "author": "CryptoRevolution_",
                                            "score": 1,
                                            "created_utc": 1652597475.0,
                                            "response": "Yes. But if the return is too high its unsustainable and the exchange has to take greater risks to generate that return. A bit of a vicious circle.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8qd1ai",
                                                    "author": "Unnormally2",
                                                    "score": 2,
                                                    "created_utc": 1652643711.0,
                                                    "response": "All part of doing your research and choosing a platform that is suitable for you.  I want them to be open and honest about the risks they are taking and then I can choose whether I'm willing to participate.  It's as simple as that.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8poawm",
                            "author": "L_Tryptophan",
                            "score": 1,
                            "created_utc": 1652632848.0,
                            "response": "it is required now to disclose this on all exchanges as of recently. bad timing because of the crash that just happened, retail is very dumb though so they will sell thinking a bank run is coming",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8wfpv3",
                            "author": "Gilllestuur",
                            "score": 1,
                            "created_utc": 1652755062.0,
                            "response": "People need to understand the importance of these offline wallets.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8myzy1",
                    "author": "KaiSosceles",
                    "score": 46,
                    "created_utc": 1652573298.0,
                    "response": "This makes way more sense than Coinbase's disclaimer though.\n\nCelsius is very clear that your coins are part of a lending and borrowing service.\n\nCoinbase is a custodian.\n\nThere should be different risks associated with these 2 very different activities.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8n8js6",
                            "author": "kwayzzz",
                            "score": 11,
                            "created_utc": 1652578207.0,
                            "response": "Funny thing is everyone in crypto wants to argue that crypto is not security, until things like this happen and literally every argument is solved by treating it like a security",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8nmm1f",
                                    "author": "One_Psychology_6500",
                                    "score": 11,
                                    "created_utc": 1652585781.0,
                                    "response": "Bitcoin is property. Most crypto tokens are securities.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8p99zz",
                                            "author": "LargeWu",
                                            "score": -2,
                                            "created_utc": 1652626208.0,
                                            "response": "Please explain the what differentiates Bitcoin from any other crypto asset from a legal standpoint.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8pf5s1",
                                                    "author": "RollinRight",
                                                    "score": 7,
                                                    "created_utc": 1652628885.0,
                                                    "response": "It doesn’t pass the Howey test, which is what is used to determine what is and isn’t a security:\n\n1. An investment of money\n2. In a common enterprise\n3. With the expectation of profit\n4. To be derived from the efforts of others",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8pijs6",
                                                            "author": "One_Psychology_6500",
                                                            "score": 3,
                                                            "created_utc": 1652630381.0,
                                                            "response": "This",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8oghau",
                            "author": "majorpickle01",
                            "score": 3,
                            "created_utc": 1652608380.0,
                            "response": "Coinbases disclaimer only lists it as a possibility because there is no legal precedent. It's very likely that as a custodian assets would be protected but they can't say that because there's no legal decision on the issue.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8qt06d",
                                    "author": "Angustony",
                                    "score": 0,
                                    "created_utc": 1652650694.0,
                                    "response": "You don't need to have it tested by legal precedent. They cannot state you are fully protected because you are not fully protected, simple as that. If you were protected they would say so. They don't, they tell you you are not.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8ut41r",
                                            "author": "majorpickle01",
                                            "score": 1,
                                            "created_utc": 1652728240.0,
                                            "response": ">They cannot state you are fully protected because you are not fully protected\n\nYes, because it's not legislated and not ruled on. As soon as something like this goes to court there'd be precedent and they can make a positive or negative claims.  \n\n\nUltimately if they went bankrupt there would be a legal challenge about how to distribute the assets - coinbase making this release is them saying they don't know how that would resolve. It's not no, it's not yes, it's \"we have no idea, so no is a possibility\"",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8vv2gg",
                                                    "author": "Angustony",
                                                    "score": 1,
                                                    "created_utc": 1652744696.0,
                                                    "response": "The definition of bankrupt is not having enough assets to pay your creditors. You can test whatever you like in court, they can't magic up money to pay what they owe. That's what going bankrupt means, they don't have what they owe.\n\nYou do not need a court case to make a rule, if they don't have the funds to pay you, you get nothing. Guess who gets paid first with the remaining assets - it's those owed the most. That's not you and me. That's institutions and whales who can spend millions fighting for it.\n\nNo government payouts in crypto buddy. Trust away if you want, but it's a dumb move. The big boys don't trust at all...",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8wf96n",
                            "author": "yooser931",
                            "score": 1,
                            "created_utc": 1652754824.0,
                            "response": "We better take less risks with hardware wallets right now.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8odpg2",
                    "author": "escape1979uk",
                    "score": 5,
                    "created_utc": 1652605967.0,
                    "response": "I really don't understand why this is news to people... \n\nIf you buy tokens on a centralised exchange and they go belly up, you are a bottom of the list creditor so you're very unlikely to get your coins back \n\nThis isn't a new witchcraft or trickery, it is how consumers are treated in insolvency in basically every industry. \n\nHopefully it's a good life lesson for people to read the small print, because this is just a fact of life. \n\nNot your keys, not your coins. If you don't self custody, your coins are at risk",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8r3h0g",
                            "author": "579555rty",
                            "score": 2,
                            "created_utc": 1652655475.0,
                            "response": "Yeah according to me this is the mai n reason why people are taking the risk.\n\nand I don't think that we can justify this thing as we should not do that wait for long.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8pq2hi",
                    "author": "Cjdergrosse",
                    "score": 4,
                    "created_utc": 1652633618.0,
                    "response": "Just thought I’d share I got my hardware wallet, couldn’t be more pleased.  Very easy, it was CB Pro that was limiting my withdrawals.  Today/tomorrow should finish transferring everything.  \n\nIf any of you have ANY doubts of getting a wallet, don’t.  Go slow, read the instructions, my Ledger Nano S was easy to set up.  \n\nLet the exchanges come and go, my coins are safe.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8vlyya",
                            "author": "alex1northern",
                            "score": 1,
                            "created_utc": 1652740360.0,
                            "response": "Yeah more on that we know that this will be much easy to get as this will be started really kate from what we know.\n\nwe also know that time matters a lot in all these kind of things as well if you know, you know about it.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8n6hfk",
                    "author": "maininshadow",
                    "score": 29,
                    "created_utc": 1652577125.0,
                    "response": "> If Celsius goes down\n\nImagine losing your stack because of the temperature.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8nvz3x",
                            "author": "Zooooooombie",
                            "score": 14,
                            "created_utc": 1652591635.0,
                            "response": "Dad?",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8q1xlo",
                            "author": "C_hase",
                            "score": 4,
                            "created_utc": 1652638765.0,
                            "response": "Speaking of, why is Bitcoin so heavy in the UK? It's 24,000 pounds!",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8n978l",
                            "author": "nmhaas",
                            "score": 0,
                            "created_utc": 1652578552.0,
                            "response": "🤔",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8pcy2r",
                            "author": "AerodynamicCow",
                            "score": 1,
                            "created_utc": 1652627877.0,
                            "response": "Good thing we got global warming tho",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8qsp4g",
                    "author": "Quantumboredom",
                    "score": 3,
                    "created_utc": 1652650559.0,
                    "response": "Ok for once we need to bail them out, because there’s no way I’m switching to fahrenheit!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8nk1iv",
                    "author": "Kno010",
                    "score": 10,
                    "created_utc": 1652584315.0,
                    "response": "How do people still not understand that this is how every centralized crypto company works?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8nkiay",
                            "author": "Deep-Art3195",
                            "score": -4,
                            "created_utc": 1652584578.0,
                            "response": "The intention behind the post was to remind people to remove their coins from exchanges",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8ndqr6",
                    "author": "margalolwut",
                    "score": 15,
                    "created_utc": 1652580899.0,
                    "response": "Some reputable poster should write a guide and pin it on how to remove coins from an exchange.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8ocqb4",
                            "author": "AvengerDr",
                            "score": 9,
                            "created_utc": 1652605137.0,
                            "response": "A guide? On how to find the withdraw button?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8w02lx",
                                    "author": "ghbdtns",
                                    "score": 2,
                                    "created_utc": 1652747198.0,
                                    "response": "Where are you going to withdraw it, you need a guide on creating a wallet for that coin and taking care of the private keys safety. If you can't keep your keys safe and private then you should not withdraw to your wallet",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8p6lqq",
                                    "author": "pwrstrug",
                                    "score": 1,
                                    "created_utc": 1652624975.0,
                                    "response": "I agree it's fucking retarded (and not in the good way) but you'd be surprised how many times I've seen people ask how to get their 50-100k out of a locked Coinbase account. Business people can be kind of dumb like that... they don't have time to do the research.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8oabcj",
                            "author": "zhou010010",
                            "score": 1,
                            "created_utc": 1652603063.0,
                            "response": "Yeah man, we badly need these things in this world lol.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8oa0c1",
                            "author": "shickard",
                            "score": -1,
                            "created_utc": 1652602800.0,
                            "response": "Also which exchanges have this type of \"we take non responsibility\" fine print in their T's & C's\n\nSurely some echanges are fully/partially insured in the event of a bankruptcy",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8qrk17",
                                    "author": "Angustony",
                                    "score": 3,
                                    "created_utc": 1652650064.0,
                                    "response": "When you read the T&C's you find that they all state that it's our risk not theirs. While some are partially insured, it's usually only on fiat balances and definitely not 100% of the balances. There is no such thing as being fully insured against bankruptcy.\n\n With partial insurance, you, me and everyone else with smaller stakes are last in line to receive compensation. As for bankruptcy, crypto exchanges have very few hard assets, no tangible goods, buildings, machinery, raw materials or anything, to sell off to pay creditors, so by definition literally everyone loses out.\n\nProbably best only using exchanges to exchange and only ever holding small amounts on there that you wouldn't mind losing.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8rhtic",
                                            "author": "shickard",
                                            "score": 1,
                                            "created_utc": 1652662491.0,
                                            "response": "Thanks for the detailed response \n\nBitcoin is 75% of my bags and off exchanges, but I'm more hesitant to move around alts",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i8ow82t",
                                    "author": "Beatnik77",
                                    "score": 1,
                                    "created_utc": 1652619683.0,
                                    "response": "Yes they have insurances. \n\n\nAlso all hard wallets have the same disclaimers and many have been hacked in the past.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8qrwxe",
                                            "author": "Angustony",
                                            "score": 1,
                                            "created_utc": 1652650219.0,
                                            "response": "No they haven't. It's simply impossible to hack a cold hard wallet they don't physically have.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8qt8s7",
                                                    "author": "Beatnik77",
                                                    "score": 0,
                                                    "created_utc": 1652650798.0,
                                                    "response": "https://www.forbes.com/sites/kenrapoza/2021/12/28/after-ledger-hack-who-can-you-trust-for-bitcoin-storage/?sh=359897e38404",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8qub2s",
                                                            "author": "Angustony",
                                                            "score": 1,
                                                            "created_utc": 1652651250.0,
                                                            "response": "You should maybe read that properly and research it further. That's a poorly written and misleading piece about a data breach. Not a hardware wallet hack.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8mokpg",
                    "author": "Inevitable_River_509",
                    "score": 37,
                    "created_utc": 1652568322.0,
                    "response": "Take your coins out of the freaking exchanges. No interest percentage is worth the risk.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8nh46m",
                            "author": "vwite",
                            "score": 13,
                            "created_utc": 1652582690.0,
                            "response": "I'd say it's worth the risk for small amounts per exchange, it's not worth the risk if your putting your life savings and absolutely all your money in a single exchange, but if you're diversified it's just like investing a stock that pays \\~6% dividends per year on top of normal growth but it has the risk of going bankrupt so shares could go to zero. You should never put all your money in a single stock but a small amount is worth the risk.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8vzsa5",
                                    "author": "penelopesank1944",
                                    "score": 2,
                                    "created_utc": 1652747054.0,
                                    "response": "I like this idea, we should not put all the eggs in one basket but diversify",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8nj5gv",
                                    "author": "never_safe_for_life",
                                    "score": -4,
                                    "created_utc": 1652583815.0,
                                    "response": "6% on top of a CAGR of over 100% is not worth it imho. I am holding the most pristine asset known to man and all I have to do is not lose it for the next 5-10 years and I’ll have inter generational wealth.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8njqbj",
                                            "author": "vwite",
                                            "score": 8,
                                            "created_utc": 1652584138.0,
                                            "response": "You seem so sure about it when there is no certainty, I hope you don't have everything on Bitcoin and have other assets as well. Nothing is 100% guaranteed, even houses can burn and insurances get denied.\n\nI do have most on my bitcoin out of exchanges though, I was just saying it's worth the risk depending on the amount, just like I have loaned small amounts of USD to other people that repays to me with interest but there is no guarantee they will ever repay it.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8qdev0",
                            "author": "Unnormally2",
                            "score": 1,
                            "created_utc": 1652643878.0,
                            "response": "Only you can determine if it's worth the risk -for you-.  For me, I accept the risks, and I'm careful as to which platforms I use.  There are certainly a lot of shitty platforms out there, but some are worthwhile to use, in my opinion.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8o2inb",
                    "author": "Rtbrosk",
                    "score": 8,
                    "created_utc": 1652596553.0,
                    "response": "no different than a brokerage holding your stock in an account",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8qpl7l",
                            "author": "Angustony",
                            "score": 1,
                            "created_utc": 1652649203.0,
                            "response": "Very different. Brokerages are required by law to insure at least a portion of their customer's property. Crypto exchanges are not.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8riii5",
                                    "author": "Rtbrosk",
                                    "score": 1,
                                    "created_utc": 1652662807.0,
                                    "response": "reddit expert knows more than a licensed broker",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8sxbv7",
                                            "author": "Angustony",
                                            "score": 1,
                                            "created_utc": 1652696510.0,
                                            "response": "You suggesting consumer protection is the same in both cases? Lol.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8mqwsb",
                    "author": "eqleriq",
                    "score": 15,
                    "created_utc": 1652569408.0,
                    "response": "They're not \"your coins.\"\n\nNotice it says \"regain ownership.\"",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8n8lud",
                            "author": "kwayzzz",
                            "score": 2,
                            "created_utc": 1652578238.0,
                            "response": "Pretty much seals the fact that it IS a security",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8myvt3",
                    "author": "Mas113m",
                    "score": 9,
                    "created_utc": 1652573239.0,
                    "response": "Hmmm. \n\nSo, is a Trezor Model One good?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8n0p91",
                            "author": "Savik519",
                            "score": 7,
                            "created_utc": 1652574177.0,
                            "response": "Yes, good choice. Buy directly from the Trezor website",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8nfvap",
                                    "author": "MissBurgerQueen",
                                    "score": 2,
                                    "created_utc": 1652582025.0,
                                    "response": "Is Ledger Nano S ok?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8omf3h",
                                            "author": "Savik519",
                                            "score": 3,
                                            "created_utc": 1652613321.0,
                                            "response": "Yes, ledger and Trezor are the two most common hardware wallets",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i8we1au",
                                            "author": "kommaanda",
                                            "score": 1,
                                            "created_utc": 1652754198.0,
                                            "response": "Never tried that but heard some positive reviews about it.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i8n0wmr",
                                    "author": "Mas113m",
                                    "score": 0,
                                    "created_utc": 1652574283.0,
                                    "response": "Will do. Is Amazon too risky? Thanks.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8n15ia",
                                            "author": "life762",
                                            "score": 5,
                                            "created_utc": 1652574406.0,
                                            "response": " I think so. Get it direct from the manufacturer.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8n2r5o",
                                                    "author": "Mas113m",
                                                    "score": 2,
                                                    "created_utc": 1652575206.0,
                                                    "response": "Ordered directly just now. Thanks!",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8werye",
                                                            "author": "cl071",
                                                            "score": 1,
                                                            "created_utc": 1652754578.0,
                                                            "response": "Damn that's great, good luck for the future and for this device.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8weulr",
                                                                    "author": "Mas113m",
                                                                    "score": 1,
                                                                    "created_utc": 1652754616.0,
                                                                    "response": "thank you!",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i8nzovk",
                                                    "author": "7ddlylE",
                                                    "score": 1,
                                                    "created_utc": 1652594344.0,
                                                    "response": "That's a good advice, we all need to follow if we are buying.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i8n1t1l",
                                            "author": "Savik519",
                                            "score": 5,
                                            "created_utc": 1652574734.0,
                                            "response": "Yes, go straight to the manufacturer",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8n2tk6",
                                                    "author": "Mas113m",
                                                    "score": 2,
                                                    "created_utc": 1652575237.0,
                                                    "response": "Just did. Thanks!",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8o49ga",
                                                            "author": "MrAsim98",
                                                            "score": 2,
                                                            "created_utc": 1652597953.0,
                                                            "response": "I ordered that too, gotta get rid of these exchanges now.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i8wem57",
                                                    "author": "medemskiy",
                                                    "score": 1,
                                                    "created_utc": 1652754496.0,
                                                    "response": "Well most of us should follow your words here, it's important.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i8n295v",
                                            "author": "LoveHateMachine85",
                                            "score": 2,
                                            "created_utc": 1652574957.0,
                                            "response": "With the amount of shady products that come out of Amazon, not worth the couple bucks you may save. Order directly from the manufacturer.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8n302j",
                                                    "author": "Mas113m",
                                                    "score": 2,
                                                    "created_utc": 1652575324.0,
                                                    "response": "That is what I was thinking.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8we1ua",
                                                            "author": "t13018873738",
                                                            "score": 1,
                                                            "created_utc": 1652754205.0,
                                                            "response": "Good to know that you have bought one for yourself.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8werzi",
                                                                    "author": "Mas113m",
                                                                    "score": 1,
                                                                    "created_utc": 1652754578.0,
                                                                    "response": "Shoukd be here in a day or so. Thanks",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i8weha6",
                                                    "author": "samipasta",
                                                    "score": 1,
                                                    "created_utc": 1652754427.0,
                                                    "response": "We better go for the official site, now I got that shit lol.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i8wesb0",
                                            "author": "fromthebark777",
                                            "score": 1,
                                            "created_utc": 1652754583.0,
                                            "response": "Yeah we should avoid amazon for this, buy it directly.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8wf092",
                                                    "author": "Mas113m",
                                                    "score": 1,
                                                    "created_utc": 1652754695.0,
                                                    "response": "That is what I did",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i8wexsy",
                                    "author": "svcorp77",
                                    "score": 1,
                                    "created_utc": 1652754660.0,
                                    "response": "Thanks for the advice, I am going to get one right now.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8wf64s",
                            "author": "steve11205",
                            "score": 1,
                            "created_utc": 1652754781.0,
                            "response": "Yup, that's a good one, you can go for that right now mate.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8ns750",
                    "author": "Rare_Ad9767",
                    "score": 5,
                    "created_utc": 1652589162.0,
                    "response": "well, the APY can't be for free...",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8nhna7",
                    "author": "chk0123456",
                    "score": 14,
                    "created_utc": 1652582983.0,
                    "response": "OP why are you posting dumb shit?\n\nCelsius is a lending platform, they lend the money you deposit. If they somehow lose the money they lent, you obviously are not getting that money back unless they have reserves to cover that loss (which as far as I know they have). If Celsius goes under, it'd be because the money they lent has not been paid back therefore they don't have \"your\" money. If you don't like that, don't give your money to a lending platform lmao and go do something else with your money.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8odkxb",
                            "author": "ChrimsonChin988",
                            "score": 0,
                            "created_utc": 1652605859.0,
                            "response": "Your comment is not much smarter.\n\nCelsius claims they make their borrowers over collateralize by 100%. So in theory, it should be absolutely impossible for Celsius to go under because a borrower goes bankrupt. Unless of course, they are doing other shady shit. Which I guarantee they are as I read their financial filings and to me, it seems their business model is total ass if not for their shit CEL token.\n\nAlso, Celsius isn't even insured against a hack.\n\nBunch of c#nts",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8onsrv",
                                    "author": "chk0123456",
                                    "score": 6,
                                    "created_utc": 1652614360.0,
                                    "response": "First of all, everything I said in my comment is true, nothing is fake news.\n\nIn theory, yes, it should be completely impossible for them to go under, but of course, they do other activities as they've stated such as investing in crypto mining.\n\nWould you mind sharing where you get their financial filings as they're not public because it's a private company?\n\nFireblocks, Celsius custodian, provides insurance on Celsius assets held by them. Of course, deployed assets cannot be insured, you'd be dumb to think that's even a possibility.\n\nDo you have any other lies to spread?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8nkkvu",
                            "author": "Deep-Art3195",
                            "score": -5,
                            "created_utc": 1652584619.0,
                            "response": "You must have had a really bad day!\n\nThe intention behind the post was to remind people to remove their coins from exchanges",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8o41u8",
                                    "author": "quantumCollapse",
                                    "score": 7,
                                    "created_utc": 1652597780.0,
                                    "response": "That's the most cringy comment I've seen in a while. This dude was 100% spitting truth.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8o9ziz",
                                            "author": "Deep-Art3195",
                                            "score": -1,
                                            "created_utc": 1652602781.0,
                                            "response": "You are stupid if you think I am blaming Celsius here. It’s some people who are stupid enough to stake their BTC on such platforms without knowing the due risks involved. Celsius or Coinbase will do what they are supposed to do with these coins if they go under.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8ooozx",
                                                    "author": "chk0123456",
                                                    "score": 2,
                                                    "created_utc": 1652614997.0,
                                                    "response": "I mean, the terms of services are pretty clear and their FAQ explains what they do with your money and the risks involved. If you deposit your money into a lending platform without knowing what a lending company does, I'm sorry but that's on you. If you don't want to take the risk, no one is forcing you to deposit into any exchange or lending platform, literally no one. You can keep your coins in your device and do with them as you will. If you're looking for yields, there's going to be risk involved, always.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i8oikxk",
                                    "author": "RealMercuryRain",
                                    "score": 1,
                                    "created_utc": 1652610190.0,
                                    "response": "Celsius is not an exchange. I hope you know it, right?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8mpb3v",
                    "author": "Savik519",
                    "score": 16,
                    "created_utc": 1652568661.0,
                    "response": "It’s simple. I see a post about taking coins off exchanges and i upvote.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8nze6l",
                    "author": "Rebubula_",
                    "score": 2,
                    "created_utc": 1652594111.0,
                    "response": "I took my coins out when they closed/silenced the reddit. You restrict conversation; you are hiding something",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8o4geh",
                    "author": "BigPlayCrypto",
                    "score": 2,
                    "created_utc": 1652598107.0,
                    "response": "We gotta trust someone right??",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8ox6r8",
                            "author": "Beatnik77",
                            "score": 1,
                            "created_utc": 1652620216.0,
                            "response": "No, the crypto world is all crooks! \n\nDo not buy crypto and hide what you have in your basement! \n\nBuy guns to protect your hard wallets and never go outside!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8o9gr4",
                    "author": "drefze3",
                    "score": 2,
                    "created_utc": 1652602326.0,
                    "response": "Is Blockchain's private key wallet function any better? I see there is an option to transfer from trading accounts.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8octkt",
                    "author": "ChrimsonChin988",
                    "score": 2,
                    "created_utc": 1652605215.0,
                    "response": "Don't trust these fucks.\n\nTheir financial filings from 2020 are publicly available.\n\nWhat I understood from reading them, is that their entire business depends on their own shit token CEL. Which is down 90% from 6 months ago.\n\nThey are lowering interest rates on tokens while the FED is actually increasing interest rates. Does not compute. Ask yourself why",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8op36y",
                    "author": "dorfelsnorf",
                    "score": 2,
                    "created_utc": 1652615269.0,
                    "response": "Yeah? Like this is anything new?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8vl9ug",
                            "author": "bmdqj",
                            "score": 1,
                            "created_utc": 1652740040.0,
                            "response": "I don't think that they are going to find anythinbg new in that lol.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8oqcgp",
                    "author": "bitcoin_barry",
                    "score": 2,
                    "created_utc": 1652616101.0,
                    "response": "What are your rights as a creditor?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8p9x13",
                            "author": "Mostofyouareidiots",
                            "score": 2,
                            "created_utc": 1652626499.0,
                            "response": "The right to get fucked",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8vlam6",
                                    "author": "lag0255",
                                    "score": 1,
                                    "created_utc": 1652740050.0,
                                    "response": "Haha this looks like a lot of people are going to be in same situation lol.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8repzw",
                            "author": "Johnny_jai",
                            "score": 1,
                            "created_utc": 1652661029.0,
                            "response": "It is more like they are good at everything when they start doing it lol.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8osc7v",
                    "author": "Junior-Rise4584",
                    "score": 2,
                    "created_utc": 1652617378.0,
                    "response": "You should think of an exchange as making an unsecured loan against your money. There is a promise to pay back but no guarantee",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8vlkxj",
                            "author": "mnjamm",
                            "score": 1,
                            "created_utc": 1652740180.0,
                            "response": "I don't think that anyone is going to take that risk of doing that lol.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8otfeq",
                    "author": "infinite_dendrite",
                    "score": 2,
                    "created_utc": 1652618053.0,
                    "response": "So were they doing US customers a favor by ending their ability to deposit and earn interest?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8rv3tk",
                            "author": "aaronwebberbc",
                            "score": 1,
                            "created_utc": 1652668628.0,
                            "response": "They can do that but It will be a major problem for them overall.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8mxe8d",
                    "author": "sebikun",
                    "score": 5,
                    "created_utc": 1652572497.0,
                    "response": "Not a fan of nonsense regulation but this needs to get regulated!\n\n\"or otherwise unable to repay\" for example losing the keys in a boating accident or CEO dies with the keys in india?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8n10vr",
                            "author": "dadlif3",
                            "score": 6,
                            "created_utc": 1652574343.0,
                            "response": ">losing the keys in a boating accident or CEO dies with the keys in india?\n\nHey I've seen his one before... it's a classic!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8n26fs",
                                    "author": "wavrunrx",
                                    "score": 1,
                                    "created_utc": 1652574918.0,
                                    "response": "rajasthan by chance ?\nyou can buy your own death certificate there.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8nh3gh",
                                    "author": "SHA256dynasty",
                                    "score": 0,
                                    "created_utc": 1652582679.0,
                                    "response": "what do you mean you've seen this? people losing crypto through centralized platforms is *brand new*",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8nn78v",
                            "author": "togetherwem0m0",
                            "score": 2,
                            "created_utc": 1652586126.0,
                            "response": "It's OK to like regulation. Regulation to keep people from being defrauded is literally what it's there to do",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8nmucx",
                    "author": "BruhMomento0125",
                    "score": 3,
                    "created_utc": 1652585918.0,
                    "response": "Is coinbase wallet a safe place for my crypto?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8odyyl",
                            "author": "allt3r",
                            "score": 4,
                            "created_utc": 1652606200.0,
                            "response": "With Coinbase Wallet (the Android/iOS app) you hold your keys. Still it is a software wallet which is regarded as less secure than a hardware wallet (Ledger, Trezor, Coldcard). What OP is recommending (and rightly so) is to remove your coins from the exchanges where you purchase them, because if they hold it for you they're not yours and in the event of they (the exchange or lending platform, etc.) going under you won't be able to retrieve them not have any legal footing to sue for them, because they're not regulated under the SEC as a securities broker, nor FDIC insured for deposits as a bank.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8vlff5",
                                    "author": "rickdehoop",
                                    "score": 1,
                                    "created_utc": 1652740110.0,
                                    "response": "They are going to deposit it but it will grow and they are going to get a lot of profit as it is normal\n\nmore than that all the banks are at a single side for that purpose which is something weird that I found lol.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8wdd7f",
                            "author": "truczen",
                            "score": 1,
                            "created_utc": 1652753864.0,
                            "response": "Nah mate, you better take your investments out of that wallet if you have invested a lot.\n\nBetter go for any good hardware wallet to secure your coins mate, good luck.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8o4b27",
                            "author": "quantumCollapse",
                            "score": 3,
                            "created_utc": 1652597988.0,
                            "response": "Yes it is, don't pay attention to the crazies",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8vlcmq",
                                    "author": "fingusio",
                                    "score": 1,
                                    "created_utc": 1652740075.0,
                                    "response": "Yeah I am not really caring about them as it is just the starting of doing that.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8qpt4b",
                                    "author": "Angustony",
                                    "score": 0,
                                    "created_utc": 1652649303.0,
                                    "response": "Yes it is. Right up until it isn't. But that's too late.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8nmz9k",
                            "author": "Deep-Art3195",
                            "score": -4,
                            "created_utc": 1652586000.0,
                            "response": "Nope. The whole point of this post is to remind folks to not keep coins on any exchange. No matter how big or small the company is",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8ovw52",
                                    "author": "Beatnik77",
                                    "score": 2,
                                    "created_utc": 1652619498.0,
                                    "response": "It's not an exchange. \n\n\nYou need a high level of knowledge to manipulate your coins out of exchanges. Since you don't seems to know a lot, your coins would be safer in an exchange.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8vlfcw",
                                            "author": "kotumnik",
                                            "score": 4,
                                            "created_utc": 1652740109.0,
                                            "response": "Most of the exchanges are having good level of customers as well.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i8rl49a",
                                    "author": "jjaquanp23",
                                    "score": 1,
                                    "created_utc": 1652664003.0,
                                    "response": "Indeed this is going to be a big company as small companies are good for that matter.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8o4nyh",
                    "author": "SportsTak1992",
                    "score": 3,
                    "created_utc": 1652598274.0,
                    "response": "It's so simple. If Bitcoin succeeds, the few %s you made with these services becomes meaningless. \n\n\nIt's not worth the risk. If you are already assuming the risk of having your money in Bitcoin, assuming it becomes standard, then realize the few sats you'll be getting are irrelevant in the grand scheme. \n\nJust hold your shit on your own, it feel so much better, and obviously, much safer.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8vlloy",
                            "author": "imaxai",
                            "score": 1,
                            "created_utc": 1652740190.0,
                            "response": "It is very normal and safe we had seen that this is very safe and we know about it \n\nmoreover this will be a normal thing to start with more to see if they are going to do something better lol.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8ox0l6",
                            "author": "Beatnik77",
                            "score": 0,
                            "created_utc": 1652620119.0,
                            "response": "Bitcoin cannot succeed without easy way for transactions. \n\nExchanges are the only easy way that exists so far.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8vlixy",
                                    "author": "civandciva",
                                    "score": 2,
                                    "created_utc": 1652740155.0,
                                    "response": "Indeed we had seen that this is the best thing which exists for that matter.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8qpbys",
                                    "author": "Angustony",
                                    "score": 0,
                                    "created_utc": 1652649087.0,
                                    "response": "Well of course. But use exchanges to exchange, not to store.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8phj83",
                    "author": "bitusher",
                    "score": 3,
                    "created_utc": 1652629932.0,
                    "response": "Is Celsius About To Implode?\n\nhttps://www.youtube.com/watch?v=cBiJ_8DSnjQ",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8q44n9",
                            "author": "EricoS1970",
                            "score": 3,
                            "created_utc": 1652639746.0,
                            "response": "Thanks for that !!!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8qjsjy",
                                    "author": "stf2602",
                                    "score": 1,
                                    "created_utc": 1652646696.0,
                                    "response": "Thanks from my side as well since it was a new experience for me lol.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8nfyrv",
                    "author": "MissBurgerQueen",
                    "score": 2,
                    "created_utc": 1652582077.0,
                    "response": "Is Ledger Nano S okay?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8qxdlx",
                            "author": "ellttpool",
                            "score": 2,
                            "created_utc": 1652652609.0,
                            "response": "Yeah it is if you here for the long term as of now.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8nya7u",
                    "author": "Asum_chum",
                    "score": 2,
                    "created_utc": 1652593284.0,
                    "response": "There really needs to be a catchy saying so people know if you don’t have your keys, something something",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8sropm",
                            "author": "Jaseur",
                            "score": 1,
                            "created_utc": 1652691487.0,
                            "response": "Without possession of your keys, you may experience problems accessing your Bitcoin.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8mtkpp",
                    "author": "Baby-Yoda2021",
                    "score": 2,
                    "created_utc": 1652570647.0,
                    "response": "Have they posted something like this from coinbase??",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8qzya7",
                            "author": "KUZMICH350GS",
                            "score": 4,
                            "created_utc": 1652653790.0,
                            "response": "Yeah that kind of same happened to them as it is just about coinbase lol.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8my3q1",
                            "author": "stonksfernothin",
                            "score": 0,
                            "created_utc": 1652572850.0,
                            "response": "Yes they posted something similar but brian Armstrong has said he’s looking into changing their bylaws so that in the event of bankruptcy, you’ll be ok. IMO, I don’t trust Brian Armstrong enough to take him at his word. Hardware wallet or digital wallet your coins now",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8rmrp5",
                                    "author": "Step5060",
                                    "score": 1,
                                    "created_utc": 1652664754.0,
                                    "response": "Exactly! I think that they might be thinking of changing it for the time being as we had seen this smame problem\n\nwe had also seen that some people just take coins as a asset which is not the thing in this market.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8n3syp",
                            "author": "Superuzer",
                            "score": 0,
                            "created_utc": 1652575730.0,
                            "response": "Yes",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8s4s9c",
                                    "author": "greengrass_97",
                                    "score": 1,
                                    "created_utc": 1652674000.0,
                                    "response": "Yeah I think that most of us are going to accept this thing as of now.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8ncnjm",
                    "author": "netwolf420",
                    "score": 2,
                    "created_utc": 1652580321.0,
                    "response": "Centralized crypto finance, eh?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8qj2kl",
                            "author": "demonDDS_bot",
                            "score": 1,
                            "created_utc": 1652646381.0,
                            "response": "Yeah this is a very normal stuff is you ask me to be honest.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8oj20t",
                    "author": "RealMercuryRain",
                    "score": 1,
                    "created_utc": 1652610595.0,
                    "response": "Celsius is not an exchange. It's a cefi. No matter if it's a cefi or defi it's always a risk. Financial operations always imply some level of risks. If you don't want to risk, keep your coins in a cold storage, or, even safer, don't play with crypto at all.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8pcjb4",
                    "author": "bitcoinharambeee",
                    "score": 1,
                    "created_utc": 1652627690.0,
                    "response": "Why t f people still go for it is unbelievable to me. I would rather flush the money in toilet and watch it go rather than putting it in such scams smh",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8qy3je",
                            "author": "dzexod",
                            "score": 1,
                            "created_utc": 1652652931.0,
                            "response": "Yeah you are right these scams are increasing and this is the reason why people are not buying it\n\nand according to me this is the major issue and hinderence in all this process will go on more and more.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8o4uw6",
                    "author": "RouletteSensei",
                    "score": 1,
                    "created_utc": 1652598431.0,
                    "response": "Rules of: Never leave everything on exchangers",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8vlgbs",
                            "author": "mblasterr",
                            "score": 1,
                            "created_utc": 1652740122.0,
                            "response": "It won't be related to everything we actually care about now.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8oe4gn",
                    "author": "rofnacla",
                    "score": 1,
                    "created_utc": 1652606335.0,
                    "response": "Not your keys, not your coins. Those are the most powerful words in bitcoin. All of human history is people guaranteeing they won’t take depositary’s stuff and then taking it. Bitcoin for the 1st time in history requires no trust but if you decide to trust someone with your coins you’re so stupid you almost deserve to get fucked",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8rmec3",
                            "author": "Vodo2014",
                            "score": 1,
                            "created_utc": 1652664584.0,
                            "response": "Yeah to be honest they deserved that stuff if they take that way.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8ondr1",
                    "author": "assinuss",
                    "score": 1,
                    "created_utc": 1652614051.0,
                    "response": "Celsius lends the money you deposit and If they lose the money they lent you are not getting it back.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8vlneb",
                            "author": "gleaoradex",
                            "score": 1,
                            "created_utc": 1652740212.0,
                            "response": "Indeed they are going to get it back if they are going to try, otherwise this will be a major problem for them\n\nand no one is going and take this problem seriosuly as we thought it would be by taht time.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8otlis",
                    "author": "Possible-Ad-7058",
                    "score": 1,
                    "created_utc": 1652618155.0,
                    "response": "We all gunna dieee!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8rk7f7",
                            "author": "Unna92",
                            "score": 3,
                            "created_utc": 1652663575.0,
                            "response": "We all are going to be this much hard as we are now to be honest.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8p0cbs",
                    "author": "lfynt01",
                    "score": 1,
                    "created_utc": 1652621919.0,
                    "response": "If the amount is small then the risk is small but the interest is small too. We will be risking it for a small amount of return.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8qomxc",
                            "author": "dragsome005",
                            "score": 2,
                            "created_utc": 1652648782.0,
                            "response": "Small or big amount does not make any such difference to me as of now.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8p0t0a",
                    "author": "Insanitic",
                    "score": 1,
                    "created_utc": 1652622158.0,
                    "response": "Stupid question but what counts as an exchange? Does keeping mined BTC in nicehash an exchange?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8robee",
                            "author": "itzteknikalbho",
                            "score": 1,
                            "created_utc": 1652665458.0,
                            "response": "Yeah you are right, it is all about the problem in the exchange they are having.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8p1hhx",
                    "author": "LongCryptoInvestor",
                    "score": 1,
                    "created_utc": 1652622504.0,
                    "response": "That’s insane. Though I knew about it.\n\nCan’t use dex due to high fees for few coins. \nAlso I believe Celsius was going to introduce some insurance for stakers",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8rs6iq",
                            "author": "cesslissubestgib",
                            "score": 1,
                            "created_utc": 1652667228.0,
                            "response": "Yeah I think most might be interested in taking it for free for now.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8pcvf0",
                    "author": "LateFig8010",
                    "score": 1,
                    "created_utc": 1652627843.0,
                    "response": "Mmmm it’s almost like crypto isn’t decentralized, at least for most people😂",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8rn0vz",
                            "author": "Phantomtrader1",
                            "score": 1,
                            "created_utc": 1652664869.0,
                            "response": "Most of the people don't even know how to even start it lol.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8prkgs",
                    "author": "3rdDreamer",
                    "score": 1,
                    "created_utc": 1652634263.0,
                    "response": "This will change as legal frameworks evolve.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8vluop",
                            "author": "wytslyts",
                            "score": 4,
                            "created_utc": 1652740305.0,
                            "response": "Yeah all of it will generally go and on since this is what we all are asking for.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8pw1jm",
                    "author": "surviveb",
                    "score": 1,
                    "created_utc": 1652636197.0,
                    "response": "Voyager's USDC is now FDIC insured. Up to 250,000",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8rotcu",
                            "author": "alradko",
                            "score": 2,
                            "created_utc": 1652665681.0,
                            "response": "More like they might be asking for better options than that to be sure.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8q86od",
                    "author": "TheOneNeo99",
                    "score": 1,
                    "created_utc": 1652641542.0,
                    "response": "Is a multi coin wallet on trust wallet safe?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8quqdw",
                            "author": "Dosermen",
                            "score": 1,
                            "created_utc": 1652651439.0,
                            "response": "Yeah it is very safe and this wallet is not going to work as of now to be honest.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8qv66a",
                                    "author": "TheOneNeo99",
                                    "score": 1,
                                    "created_utc": 1652651637.0,
                                    "response": "What wallet is not going to work?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8q88l3",
                    "author": "TheOneNeo99",
                    "score": 1,
                    "created_utc": 1652641565.0,
                    "response": "Is a multi coin wallet on trust wallet safe?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8ri9j2",
                            "author": "lyp8707",
                            "score": 1,
                            "created_utc": 1652662700.0,
                            "response": "No it is not safe this is a very volatile market and all this is a very nornal thing.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8wd8gg",
                    "author": "braham222",
                    "score": 1,
                    "created_utc": 1652753798.0,
                    "response": "We all gotta get one in our life, that's most important for us.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8wdyy2",
                    "author": "jioniukas",
                    "score": 1,
                    "created_utc": 1652754166.0,
                    "response": "Nice to see that people are being positive towards buying wallets.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8weip0",
                    "author": "t6ssitujurikkuja",
                    "score": 1,
                    "created_utc": 1652754446.0,
                    "response": "We need a hardware wallet so bad these days my man.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8wficp",
                    "author": "calvin_onmura",
                    "score": 1,
                    "created_utc": 1652754954.0,
                    "response": "I am glad that I am already using a good hardware one.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8n5hqo",
                    "author": "TastyLaksa",
                    "score": -2,
                    "created_utc": 1652576606.0,
                    "response": "If tether too. And every crypto will be affected by tether",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8owrbv",
                    "author": "Beatnik77",
                    "score": -1,
                    "created_utc": 1652619976.0,
                    "response": "The \"war on exchanges\" among the community is very hurtful. \n\nExchanges are the best options for 90%+ of potential buyers. \n\nHard wallets are not 100% safe either and peer to peer trading is dangerous and complicated.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8p1adc",
                            "author": "MrDopple68",
                            "score": 2,
                            "created_utc": 1652622406.0,
                            "response": "You need to look into the amount of risk these shady outfits are taking, and taking with your coin.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8vmifg",
                                    "author": "JJFxy",
                                    "score": 1,
                                    "created_utc": 1652740608.0,
                                    "response": "Yeah they might be taking a lot of coins and getting the real profit by doing all that.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8vlsqt",
                            "author": "Pgj88",
                            "score": 1,
                            "created_utc": 1652740280.0,
                            "response": "it is still very complicated as I just came to know about it recently as we know.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}