{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ut3ncq",
            "title": "Is insuring your crypto important to you?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/ut3ncq/is_insuring_your_crypto_important_to_you/",
            "author": "BreachInsLuis",
            "created_utc": 1652967548.0,
            "score": 2,
            "num_comments": 20,
            "subreddit": "BitcoinBeginners",
            "selftext": "Looking for your opinion! As decentralized and regulated insurance options start popping up for crypto(i.e. against hacks and scams) both in the US and worldwide, I am curious what your opinion is on the matter. Is it needed? Is it unnecessary? I've seen arguments for both sides but would love to compare a general opinion.\n\nAre there factors when thinking about insuring your crypto? Does the amount you own factor into looking for insurance? For example, the more you own, the more you have to lose. Or for those who see their crypto as a long-term investment, is insurance even a thought for you?\n\nThanks in advance for your help!",
            "stickied": false,
            "comments": [
                {
                    "id": "i979tav",
                    "author": "LunaGuardian",
                    "score": 4,
                    "created_utc": 1652968119.0,
                    "response": "Never considered it necessary. Have many steps to ensure I can't lose it. Hardware wallet + Metal seed plates in a heavy fireproof safe.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i97g6cy",
                    "author": "bitusher",
                    "score": 2,
                    "created_utc": 1652970916.0,
                    "response": "You should never trust insurance on crypto as it rarely pays out",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i980c17",
                    "author": "OneStepAheadApp",
                    "score": 2,
                    "created_utc": 1652979145.0,
                    "response": "Trusting insurance companies is like trusting banks. They are the same breed. Do you really trust banks and bankers?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i978kv0",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1652967549.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i97euqh",
                    "author": "jmg000",
                    "score": 1,
                    "created_utc": 1652970343.0,
                    "response": "Assuming it’s a trustworthy actor, I can’t imagine who would want to underwrite an insurance policy for what your describing unless it’s connected to a broader business.  \n\nThere is no reason for insurance on your BITCOIN if you have invested in yourself relating to learning about Bitcoin self-custody, security, and managing keys / backups.\n\nThat begins with a 1) Single signature HW wallet + Passphrase, then upgrading to 2) Multi-signature wallet, and 3) Controlling a Node.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}