{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "utlr68",
            "title": "How to orange-pill others?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/utlr68/how_to_orangepill_others/",
            "author": "iamanonymous12340",
            "created_utc": 1653022608.0,
            "score": 0,
            "num_comments": 15,
            "subreddit": "Bitcoin",
            "selftext": "I was talking to an older acquaintance of mine the other day. He said he had heard of bitcoin but didn’t know what to make of it. I tried to orange pill him, talked about the 21M limit, decentralization, network effects, etc. I think some of the analogies I used (digital gold) helped but ultimately it was hard for him to get it. “What happens when all the bitcoin are mined? Will there be none left?” “Is there a Bitcoin bank? Do I open an account?” Things like that.\n\nIt’s easy to lose sight of the average person’s level of knowledge when you’re deep in the community. We are so early. What are the best ways you have found to orange pill the people you know?",
            "stickied": false,
            "comments": [
                {
                    "id": "i9akabf",
                    "author": "Raverrevolution",
                    "score": 10,
                    "created_utc": 1653023415.0,
                    "response": "I stopped bothering.  It's a waste of time.\n\nI've given people copies of The Bitcoin Standard and they turn around and buy dogecoin.\n\nDo yourself a favor and use the time more wisely",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9aktlx",
                    "author": "nullama",
                    "score": 5,
                    "created_utc": 1653023792.0,
                    "response": "Whenever someone tells you the bank blocked their card while they were on holidays, you can remind them that they don't actually have full access to their own money.\n\nWith Bitcoin you don't need the permission of anyone to use your own money.\n\nAlso it's designed to increase in purchasing power over time (halvening), while fiat is designed to lose value over time (inflation).",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9awpt9",
                            "author": "Simple_Yam",
                            "score": 2,
                            "created_utc": 1653033220.0,
                            "response": "Halving does not mean that its purchasing power is increasing, only that inflation is reduced.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9baza6",
                                    "author": "nullama",
                                    "score": 1,
                                    "created_utc": 1653044679.0,
                                    "response": "Less new bitcoins for the same amount (or more) of people wanting to get it, so the purchasing power goes higher.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9bej5r",
                                            "author": "Simple_Yam",
                                            "score": 1,
                                            "created_utc": 1653046825.0,
                                            "response": "It's not true. You're thinking that miner selloff is 100% of the traded volume. Even if every miner would sell everything their earn, this volume would still be insignificant. \nThere are $30 million of bitcoin being mined per day and the trading volume is in $billions.\nHalving events barely have any impact on the demand/supply dynamics nowadays.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9alkdv",
                    "author": "sean488",
                    "score": 3,
                    "created_utc": 1653024304.0,
                    "response": "You fail to ask a more basic question. \n\nWhy is it your responsibility to \"orange pill\" anyone?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9alw0m",
                            "author": "iamanonymous12340",
                            "score": 7,
                            "created_utc": 1653024538.0,
                            "response": "It’s not, but I just like explaining Bitcoin to others. And I think if we want it to succeed we need to find ways to communicate its value to the average person",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9aorn8",
                    "author": "savinelli_smoker",
                    "score": 3,
                    "created_utc": 1653026656.0,
                    "response": "Over the years I found that it’s a rather ineffective exercise. The more I try to orange pill someone the more pushback I get. I guess they have all heard Warren Buffett calling it a greater fools’ game and they would just see me as some sort of salesman selling them snake oil. They see their getting into bitcoin would benefit me (because I was “early”) and I have an incentive to promote it. So these days if after some reasonable attempts the person is still unresponsive, I just leave them alone and let them find out, hopefully they will eventually get it. Everyone buys bitcoin at the price they deserve.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ay038",
                    "author": "SirSkittles111",
                    "score": 3,
                    "created_utc": 1653034384.0,
                    "response": "Keep friends/family separate from your finances, it will ultimately be your fault when they panic sell at the first sight of red. Its not worth the stress of that happening\n\nI will tell people about but i will not push it on them like religious nutcases, if they're not interested they're just not interested and i will respect that.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9azlb4",
                    "author": "BitcoinIslandPH",
                    "score": 2,
                    "created_utc": 1653035823.0,
                    "response": "Our team is orange pilling merchants on Boracay island every day.  We are selling them purely on the utility of the rails to bring value into the Philippines.\n\nThey are aware that most online payment systems, gCash, are country specific and this is an international tourist destination.\n\nThey are aware that credit cards take fees, chargeback risk, and have slow final settlement.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9b6kb8",
                    "author": "Generationhodl",
                    "score": 1,
                    "created_utc": 1653041482.0,
                    "response": "Easiest way: Stack until you have plenty of sats. Then buy yourself some nice sportscar with some Sats... Then suddenly everyone will ask you how did you make that money for the car. \n\nMost people are not interested in the technical aspect of bitcoin. They want to make money and get rich. And they don't care about bitcoin UNTIL you have something to show off... \n\nSUDDENLY when they see your nice sportscar they are interested because they see the end result, but they don't give a shit about your whole way until you could afford it.  \nThey will never see all the bear-markets you hodld.\n\nAnd most people who will start to buy bitcoin DON'T have the patience to wait at least 4-8 years for gains, they will crash after 2 years and sell with a loss and then they will blame YOU.\n\nSo as said before, its a waste of time. Only talk to people who are really interested in the technical aspect and who have enough brain cells to invest longterm IF they want.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9bdude",
                    "author": "VariousTransition795",
                    "score": 1,
                    "created_utc": 1653046433.0,
                    "response": "How to orange-pills others?  \nSimple answer: You don't\n\n  \nWhy would you like to impose your ideologies to someone else?\n\nJust do your shit and plebs will follow.\n\n(Keep in mind that plebs will follow your footsteps and not your finger)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9br5xu",
                    "author": "MrQ01",
                    "score": 1,
                    "created_utc": 1653053099.0,
                    "response": "Setting aside your reasoning for talking to these people about Bitcoin (people will be very receptive if its felt you are going around trying to shill people), you be able to either answer, or find the answer to, questions thrown at you. If you feel you've been understandable and they still dont get it, then perhaps they are just not ready (or maybe it's how you are answering but we would need specifics - the ones you've provided are all answerable).",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9bz3zq",
                    "author": "dadlif3",
                    "score": 1,
                    "created_utc": 1653056489.0,
                    "response": "I'll talk about it enthusiastically to anybody who asks, but I'm not going to convince anyone that they need to buy it. They'll end up buying down the road and say \"I wish I had bought when dadlif3 explained it to me\". It took me almost three years to buy from the first time I heard about bitcoin to actually obtain some.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}