{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uwtzvm",
            "title": "Poll: how many people in r/Bitcoin strongly support Austrian economics, how many think it has serious flaws?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uwtzvm/poll_how_many_people_in_rbitcoin_strongly_support/",
            "author": "Admiral_Narcissus",
            "created_utc": 1653407555.0,
            "score": 101,
            "num_comments": 159,
            "subreddit": "Bitcoin",
            "selftext": "And how many folks have mixed views?",
            "stickied": false,
            "comments": [
                {
                    "id": "i9u5jz6",
                    "author": "qepdibpbfessttrud",
                    "score": 31,
                    "created_utc": 1653416862.0,
                    "response": "MMT/Keynsianism is impossible without mafia rule at the gunpoint. Austrians can tell u why every single one fiat money ended in hyperinflation - in principle, mafia positivists can not",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9wfzam",
                            "author": "theamaru",
                            "score": 1,
                            "created_utc": 1653455610.0,
                            "response": "Why did the yen not end in hyperinflation then?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9tjhvb",
                    "author": "SemperBavaria",
                    "score": 41,
                    "created_utc": 1653407798.0,
                    "response": "I support the Austrian economy through regular buying their gasoline",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9um5td",
                            "author": "cryptobog67",
                            "score": 7,
                            "created_utc": 1653423857.0,
                            "response": "Haha. Typical bavarian living near the border. South or north?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9uv0xu",
                                    "author": "SemperBavaria",
                                    "score": 6,
                                    "created_utc": 1653427645.0,
                                    "response": "South 🍻",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9uv5o6",
                            "author": "keep_Playing",
                            "score": 4,
                            "created_utc": 1653427703.0,
                            "response": "making decisions at the margin",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9tok9z",
                    "author": "Second_Maximum",
                    "score": 97,
                    "created_utc": 1653409865.0,
                    "response": "Keynesian economics is just for inflation apologists, the fact that the Austrian school has no representation in government should be enough proof to tell you that.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9umkht",
                            "author": "TownConscious",
                            "score": 0,
                            "created_utc": 1653424027.0,
                            "response": "The actual Austrian govt needs a word",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9uxbg7",
                                    "author": "Second_Maximum",
                                    "score": 15,
                                    "created_utc": 1653428651.0,
                                    "response": "Yes the name is antiquated and no longer represents the Austrian government well but the economic principles are sound as can be.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9urf5v",
                                    "author": "Beta_Delta_Alpha",
                                    "score": 1,
                                    "created_utc": 1653426084.0,
                                    "response": "Can you link to any supporting evidence? I’m intrigued.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9uuytq",
                                            "author": "TownConscious",
                                            "score": 7,
                                            "created_utc": 1653427618.0,
                                            "response": "The word Austrian exists in both.  Also, put another shrimp on the barby!",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9uv30g",
                                                    "author": "Beta_Delta_Alpha",
                                                    "score": -1,
                                                    "created_utc": 1653427670.0,
                                                    "response": "Duuude weeed…",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9v7k8b",
                                            "author": "infopocalypse",
                                            "score": 5,
                                            "created_utc": 1653433253.0,
                                            "response": "Beyond seeing the keynesian theory in practice cause all sorts of pain worldwide in the face of explosive advances in everything?  In the bitcoin standard book it lays out multiple instances ( I don't have them memorized, but I would suggest the book as it's a good read.) where the US and other countries were on a gold standard and had their best economies and science and arts exploded during those times.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9u4w4x",
                    "author": "thefullmcnulty",
                    "score": 30,
                    "created_utc": 1653416584.0,
                    "response": "Keynesian economics is an egregiously flawed theory and that’s where I start. \n\nBitcoin is a viable solution to several of the glaring problems with Keynesian “economics”. \n\nThere is nothing else available I can opt into that actually disintermediates global systems of control which in my opinion are doing grave harm. So I bitcoin.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9v0a9w",
                            "author": "proof_in_pudding",
                            "score": 19,
                            "created_utc": 1653429944.0,
                            "response": "Keynsian economics isn't flawed. It's performing exactly as it's designed - to sell monetary debasement to the public through \"economic stimulus.\"\n\n\"see folks, it's OK that your savings are getting wrecked while the rich get richer, the economy is sooooo stimulated!\"",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9v114g",
                                    "author": "thefullmcnulty",
                                    "score": 8,
                                    "created_utc": 1653430275.0,
                                    "response": "It’s flawed in the sense that it’s not sustainable.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9v1tbk",
                                            "author": "proof_in_pudding",
                                            "score": 8,
                                            "created_utc": 1653430627.0,
                                            "response": "That's true, but I'm saying that it's working as intended.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9v3lcn",
                                                    "author": "thefullmcnulty",
                                                    "score": 8,
                                                    "created_utc": 1653431422.0,
                                                    "response": "Sure, I read you and agree. \n\nMy main contentions with Keynesian economics are that it’s based on forever-expansion in a finite environment and that it’s purely a ruling-class-run trust-based model that is guaranteed to be unfair, corrupt AND create negative externalities. \n\nIt’s the exact type of system humans need to root out. The fact that it can now be supplanted by impartial robot money that can’t be turned off and is secure and open and fair and trust-less and permission-less and global is a dream come true for those who are paying attention and who have done their diligence. \n\nBut you are right in that it’s unfair by design because it gives advantage to the planners / controllers over everyone else. For them it’s working largely as intended, agreed. Fuck them.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9v3rof",
                                                            "author": "proof_in_pudding",
                                                            "score": 3,
                                                            "created_utc": 1653431502.0,
                                                            "response": "Agreed. Fuck them off a light pole if you catch my drift.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9v40o9",
                                                                    "author": "thefullmcnulty",
                                                                    "score": 3,
                                                                    "created_utc": 1653431618.0,
                                                                    "response": "We are winning brethren. The open network is going to continue to destroy their centralized models.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9v4pck",
                                                                            "author": "proof_in_pudding",
                                                                            "score": 3,
                                                                            "created_utc": 1653431931.0,
                                                                            "response": "Totally agree. I'm optimistic that the age of keynsian bullshit is coming to an end.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9tp44k",
                    "author": "turbosecchia",
                    "score": 52,
                    "created_utc": 1653410087.0,
                    "response": "For sure, there is a higher representation of Austrian economics in bitcoin communities than outside. In my experience, people who engage with the ideas of Austrian economics are drawn to gold and bitcoin.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9u5x73",
                            "author": "Maticus",
                            "score": 29,
                            "created_utc": 1653417018.0,
                            "response": "Because when you look into the alternative you realize it's just fucking paper that can be printed away.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9vfu6i",
                                    "author": "dj_destroyer",
                                    "score": 4,
                                    "created_utc": 1653437154.0,
                                    "response": "No person, government, entity, etc. has ever been able to control the printing in the history of mankind. Humans are fallible and will always make the greedy selfish decision at some point. I imagine we will eventually ruin Bitcoin and hardfork into larger supply, why would it be any different this time?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9vi3xl",
                                            "author": "wattzson",
                                            "score": 4,
                                            "created_utc": 1653438257.0,
                                            "response": "Well that's one of the solutions bitcoin provides.... You would have to convince the majority who is already involved in bitcoin to increase the supply which would only be hurting themselves so why would they do it?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9vjps6",
                                                    "author": "dj_destroyer",
                                                    "score": 0,
                                                    "created_utc": 1653439027.0,
                                                    "response": "51% is not impossible to obtain. Time is infinite so there's plenty of opportunity for drastic change. Humans are fallible and the option to change the supply exists.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9vrlkw",
                                                            "author": "Wilynesslessness",
                                                            "score": 2,
                                                            "created_utc": 1653442765.0,
                                                            "response": "51% does not change bitcoin.",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "i9vs37y",
                                                            "author": "masixx",
                                                            "score": 1,
                                                            "created_utc": 1653442990.0,
                                                            "response": "Hundreds if not thousands of forks already exist. You can do one if you like in under 5 minutes. The source is available to anyone. The supply limit is literally a single line to edit.\n\nAnd yet nobody cares about those forks if they don't add value beyond what Bitcoin offers.\n\nWithout support it's not more then the digital equivalent of you writing a number on a piece of paper.\n\nYour opinion is highly cynical. With the same reasoning, 'time is unlimited', you can argue 'anything' will happen. Sure it COULD. Quantum mechanics tell us so. But it's highly unlikely. Even more so because it already happend multiple times and nobody cared.\n\nLife is a probability function we don't understand and only control to some degree. There is no guarantee. Never. If you cannot accept this: why do you even stand up in the morning?",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "i9vr7u3",
                                                            "author": "Maticus",
                                                            "score": 0,
                                                            "created_utc": 1653442584.0,
                                                            "response": "If you increase the supply of Bitcoin, it'll hard fork and the original, capped version would continue to exist so long as there is at least 1 node and 1 miner running that version of the protocol. There is no governance that allows the changing of Bitcoin's code with a simple majority. Bitcoin requires near unanimous consent of nodes accepting a proposed update in order to soft fork Bitcoin's code. \n\nMoreover, Bitcoin's known hard cap and limited supply is its defining characteristic. That along with it's limited block size and proof of work consensus are what make Bitcoin what it is. Change just one of those 3 things and you no longer have Bitcoin, and you're very unlikely going to have a sufficient consensus to change one of those three. The small blocksize was already attempted to be changed but that failed.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9u8qbk",
                    "author": "walloon5",
                    "score": 8,
                    "created_utc": 1653418202.0,
                    "response": "I think Austrian economics is sound\n\nThe combo of Austrian economics, bitcoin, and libertarianism/anarchy/Georgism is going to naturally clash with ...\n\nFiat economists/scammers/Statists and their fiat/guns/war and laws/police/courts/prisons/factories/slavery",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9u529t",
                    "author": "SecondDumbUsername",
                    "score": 19,
                    "created_utc": 1653416655.0,
                    "response": "Austrian economics, or just economics for short.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9uhs40",
                    "author": "thisjustin93",
                    "score": 5,
                    "created_utc": 1653422009.0,
                    "response": "Keynesians are just missionary singing the gospel of the church of the state. Has anyone ever read Keynes work? It’s nothing but incoherent, scrambled thoughts.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9v1oms",
                            "author": "proof_in_pudding",
                            "score": 2,
                            "created_utc": 1653430569.0,
                            "response": "Keynes was also a predatory homosexual. Not saying that there's anything wrong with being gay, but maybe it explains a few things?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9u44l3",
                    "author": "dfunkmedia",
                    "score": 14,
                    "created_utc": 1653416268.0,
                    "response": "I once interviewed Stephen Kinsella, a somewhat prominent Austrian and notable anti-IP activist. Satoshi Institute has republished some of his IP work, and I worked with their creative director while putting together a series of interviews c.2011 about Bitcoin and the rise of the cryptoanarchist. To my great dismay, the actual cryptography and anarchist movement in Bitcoin, and crypto in general, has been completely and totally pushed aside by the rise of retail- a trend that was noticeable in 2017 but an especially prominent theme in 2021.\n\nHowever, as someone who doesn't necessarily agree with the proscribed solutions Austrians offer (completely unregulated free markets tend to concentrate power and then reward concentrated power disproportionately for example) I still fully believe and will defend the core idea that fiat monetary policy and central banking has very much the same effect in practice. As long as central banks can manipulate the money supply, they will concentrate power into their friends hands. To this end, the crypto ideals of decentralization, democratic governance, fair representation, and immutable ledgers have massive implications for resolving those problems. I think in the grand scheme of things however, I'm like a caveman watching an Indo-Iranian hunter fashion a wheel and fix it to a platform to make a chariot and imagining the possibility of humans building spaceships from this technology. It's so infant that currently none of what I hope is possible is yet possible. But the idea that it _might be_ is definitely heartening.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9uygc0",
                            "author": "Second_Maximum",
                            "score": 9,
                            "created_utc": 1653429150.0,
                            "response": "More often than not monopolies are created because the government put in place requirements on the industry in question. In the case that a true monopoly is established without because no other company can compete at the prices offered how is that a problem? If they start to jack up prices a competitor will step in to compete away the excess profits. Certain industry's such as defense materials it makes sense to force diversification but for a lot of others it may just be the best company. With the current style of government a lot of times they try to act tough with regulations that at a surface level appear good for consumers but that hurts only the competition who have less funds for regulatory compliance.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9vgzz7",
                                    "author": "MountainousFog",
                                    "score": 0,
                                    "created_utc": 1653437721.0,
                                    "response": "> If they start to jack up prices a competitor will step in to compete away the excess profits\n\nLol what? The original company will just threaten to lower prices to assure a rival company never achieves profitability and will raise the price after the competitor goes bankrupt.\n\nAfter the new company becomes the first victim, it prevents other businesses from even bothering to try.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9vdbz3",
                            "author": "knut11",
                            "score": 2,
                            "created_utc": 1653435962.0,
                            "response": ">To my great dismay, the actual cryptography and anarchist movement in Bitcoin, and crypto in general, has been completely and totally pushed aside by the rise of retail\n\nIt may seem so. However, those very early adopters, pre 2017, are mostly idealists.\nAnd they will become the richest in the world.\n\nWe still need the retail circus, to gain global momentum.\nI do agree its sad to see so much focus on altcoins. Where most of them are truely worthless.\nIf the brilliant minds behind so many of these projects, focues their efforts on Bitcoin (layer 2 and 3 for example), this rebolution would be far better off.\n\n\n>It's so infant that currently none of what I hope is possible is yet possible. But the idea that it might be is definitely heartening.\n\nParadigmshift tend to happen very gradually, then all at once. The current world reserve currency (usd), seems to be going down the same path as all previous world reserve currencies; hyperinflation and collapse.\n\nBitcoin is the lifeboat. Ready to save humanity from the sinking economical ship. The icebeeg has been hit. But the ship sure hasent broken in two just yet.\n\nRay Dalio describes the state of the world reserve currency quite well;\nhttps://youtu.be/xguam0TKMw8",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9tn9xk",
                    "author": "pixelpoints",
                    "score": 32,
                    "created_utc": 1653409346.0,
                    "response": "In relation to keynes? Keynes theories work well in theory in a perfect world where humans are robots and do everything perfectly.\n\nIn practice humans are stupid and emotional and can't be trusted to operate a monetary system responsibly so Austrian economics it is. \n\nVery exciting time to be alive to see this experiment play out in real time.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9uh43c",
                            "author": "fifaloko",
                            "score": 10,
                            "created_utc": 1653421730.0,
                            "response": "I don’t think Keynes works well in theory I’m more of a Hayek guy myself decentralization is key",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9v0eep",
                            "author": "proof_in_pudding",
                            "score": 5,
                            "created_utc": 1653429994.0,
                            "response": "Keynsian economics is just there to justify monetary debasement to the public. That's all it does.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9ulmmx",
                    "author": "RealPrimaris",
                    "score": 6,
                    "created_utc": 1653423633.0,
                    "response": "Do I believe in Austrian economics? (read: do I believe in objective reality?) yes.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9uwzej",
                            "author": "Jigg3r",
                            "score": 2,
                            "created_utc": 1653428504.0,
                            "response": "Huh? the central tenet of Austrian economics is that objectivity does not exist.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9v0lnl",
                                    "author": "RealPrimaris",
                                    "score": 7,
                                    "created_utc": 1653430084.0,
                                    "response": "I see the confusion here, but no, it’s not based on the idea that objective reality doesn’t exist. Nevertheless, I didn’t mean what you think I did. It’s based roughly on the idea that individual human beings will pursue their subjective interests and valuations, and that the optimal economic and societal arrangement is that of a free market with sound money principles. Don’t get confused by my use of the term “objective reality” here; I’m saying that the tenets of Austrian economics are a mere expression of an objective reality or truth. They are to economics as the laws of physics are to the universe, true and verifiable through observation. This is to say that any Keynesian notions of social engineering and manipulation or central planning are guaranteed to fail as they are predicated on presuppositions and assumptions that are not based in reality. In other words, do I believe in Austrian economics? Yes, I believe in reality as opposed to the fictional fantasy land purveyed by all other economic philosophies.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9v31tf",
                                            "author": "Jigg3r",
                                            "score": 2,
                                            "created_utc": 1653431175.0,
                                            "response": "I was (partly) joking. But still, Austrian economics is often too slippery to have serious arguments about. The “it is what is it is” positioning isn’t always all that useful, but I also don’t think people seriously object to “the economic calculation problem” even if they don’t fetishise market efficiency.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9u6tek",
                    "author": "NYKNYb",
                    "score": 13,
                    "created_utc": 1653417395.0,
                    "response": "Austrian economics is just what happens without a coercive manipulative force in charge.\n\nIt's not something to be pro or against, it is just the natural order of things that happens when humans are left to make their own economic decisions.\n\nAnd yes Bitcoin is steering us towards this ideal.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9vdq1p",
                            "author": "siddartha08",
                            "score": 3,
                            "created_utc": 1653436147.0,
                            "response": "Not true. Governmental or private corporation Austerity. Happens with coercive force as well. Just as coercive to employees and customers as it is to Citizens.\n\nBitcoin will have it's own coercive forces. Thinking it won't is unrealistic",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9vdk6a",
                            "author": "ReasonablyFree",
                            "score": 2,
                            "created_utc": 1653436069.0,
                            "response": "I don’t think you understand what Austrian economics is. It’s not a policy prescription; it’s a set of theories for explaining economic phenomena. Any theory—Austrian, classical, Marxist, Keynesian—is as much about natural order as it is about coercion manipulation.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9tr802",
                    "author": "aizr97",
                    "score": 22,
                    "created_utc": 1653410942.0,
                    "response": "What flaws are you talking about? Cause Austrian economics is all about a free market and leaving people to make their own decisions instead of trying to guess what people want for them, that's what Hayek called the fatal arrogance",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9vdmnu",
                            "author": "knut11",
                            "score": 1,
                            "created_utc": 1653436103.0,
                            "response": "And goverment in so many countries, seem to be ever inflating due to this arrogance.\n\nEveryone cant be working for the goverment!\n\nIn many countries half the employed, work for the state!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9twne7",
                    "author": "Keith_Kong",
                    "score": 24,
                    "created_utc": 1653413167.0,
                    "response": "My largest critique of Austrian Economists (versus the theory itself) is their insistence that a fixed supply currency combined with a free market will just magically solve any potential issues that could arise. They fail to acknowledge prisoner dilemma style situations where profit motivations work against the common good without sufficient trust and cooperation.\n\nI agree that we need a fixed supply global money and I agree that this will enable free markets to *better* allocate capital to projects that will *actually* benefit society and provide for real needs. But there's more work to be done thinking about just what kind of government should sit on top of an Austrian monetary policy.\n\nEvery law is in essence an extension of monetary policy. Speeding tickets are a highly specific law that financially punishes dangerous behavior. If you create a sliding scale fine based on the drivers net worth it can better incentivize all people to drive safely regardless of wealth status. Or should it be based on their yearly salary instead? Or is there second and third order consequences of this we aren't considering?\n\nNo economy is simple enough to claim that the base layer money will function properly. You can easily make laws that over or under punish economies. Imagine a 20% sales tax for example. These rules drastically change the efficiency and real wealth generated by a society and could easily stamp out any benefits of an Austrian monetary policy.\n\nMany Austrians think a complete removal of taxation would solve all of these problems. However, there are efficiencies to be had by some form of group funding mechanisms and without some kind of forced participation you will have altruistic people lifting the weight for selfish people. This first leads to the wrong people gaining wealth (by hoarding and not helping fund public goods) and eventually leads to a collapse of the funding system when trust is destroyed.\n\nNow obviously none of this directly attacks Austrian theory. At most it's a complaint that followers of the theory attribute too much strength to its automatic affect on society. **I would like to see more energy put into presenting actual forms of government that would function well on top of Austrian Economics.**",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9u12v9",
                            "author": "godofleet",
                            "score": 3,
                            "created_utc": 1653414993.0,
                            "response": "Great stuff, ty for sharing.\n\nI think hard money will be huge for humanity, but we're def gonna struggle w/ governance and the true definition of freedom for a long time yet...\n\nGood listen on some similar notes- https://youtu.be/xzBIxqgvEvw",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9ufn5m",
                                    "author": "Keith_Kong",
                                    "score": 3,
                                    "created_utc": 1653421115.0,
                                    "response": "That was a great conversation, I love that podcast. On the flip side, I also really enjoy Robert Breedlove's philosophy and dissection of money (even though I see him as a bit incomplete on the post Austrian Economics governance side of things).\n\nA lot of Libertarians like John Vallis have this \"Governance Islands\" theory and it's probably the best response I've found for governance post Austrian Economics. However, as Peter alludes to in his responses there's a missing game theory analysis for being able to freely choose what governance structure you live under.\n\nSome issues that arise:\n\n1. Those who are self sufficient and wealthy will flock to low taxation governance islands which do not adequately protect the bottom of society. This continues to require altruistic wealthy individuals to remain in islands that do not optimally serve them financially.\n2. High paying jobs will migrate to islands which best support businesses and low taxation will greatly benefit them. This creates a situation where both affluence and the jobs required to generate affluence consolidate and segregate away from the poor.\n3. To avoid increasing taxation in affluent islands, you will see local altruism emerge to maintain infrastructure as to avoid developing a lower class dependent on them. This will create really well run islands of affluence, but will remain exclusionary.\n\nThere are other issues as well I could go into but these are the main game theoretic issues I see with governance islands with open migration. If you can't afford to move into an island, open migration only serves the wealthy.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9u7oix",
                            "author": "qepdibpbfessttrud",
                            "score": 6,
                            "created_utc": 1653417759.0,
                            "response": ">is their insistence that a fixed supply currency combined with a free market will just magically solve any potential issues that could arise\n\nTechnological progress will\n\nSound money just make it faster, but we don't know how fast or slow we can go in principle taking account of all we know and have resources to research and build. How sound money speed up the technological progress? Mental capacity is freed from high time preference survival mode, which then builds on itself. We don't have good AI yet to discard human intelligence\n\n>where profit motivations work against the common good without sufficient trust and cooperation\n\nProfit is impossible without trust and cooperation, it only can be mutual. Reputation is extremely valuable. Modern state-entangled enterprises like oil companies or MIC are closer to mafia than to entrepreneurs\n\n>But there's more work to be done thinking about just what kind of government should sit on top of an Austrian monetary policy\n\nAs powerless as possible\n\n> Many Austrians think a complete removal of taxation would solve all of these problems\n\nLess extortion will lead to better society, less misallocated and wasted resources\n\n> public goods\n\nNo such thing. Your \"public good\" can be my \"public bad\", value scales are ordinal, shifting and often incompatible. Bitcoin is an excellent example of roughest capitalist endeavor",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9ub3t0",
                                    "author": "Keith_Kong",
                                    "score": 5,
                                    "created_utc": 1653419203.0,
                                    "response": ">Profit is impossible without trust and cooperation, it only can be mutual. Reputation is extremely valuable. Modern state-entangled enterprises like oil companies or MIC are closer to mafia than to entrepreneurs\n\nTrust and cooperation is needed for the involved parties of a business for profit. It does not require trust and cooperation with the broader needs of society.\n\nMafia rule is a form of governance. You're kind of making my point that the form of governance on top of any monetary policy will greatly affect how well profit aligns with public good.\n\n>As powerless as possible\n\nThis is where Austrians seem to stop. I'm saying, \"Define what is possible.\"\n\n>Less extortion will lead to better society, less misallocated and wasted resources\n\nThis is generically a true statement but doesn't really address any of the issues surrounding prisoner dilemma situations that require the whole group to solve. Believing that everyone will just understand and agree to everything that is necessary is naive imo.\n\n>No such thing. Your \"public good\" can be my \"public bad\", value scales are ordinal, shifting and often incompatible. Bitcoin is an excellent example of roughest capitalist endeavor\n\nI concede this point in the context of modern day notions of taxation. Some ideas I have that attempt to address this issue and the feeling of extortion that comes from taxation:\n\n1. Have a public voting system where people vote on the tax rate (take the average of what people collectively think the tax rate should be).\n2. You have a say in the tax rate, but once it's established you are still subject to the same rate as everyone else (even if that's more than your specific vote).\n3. The government continues having full control over spending budgets for 90% (somewhat arbitrary number) of tax revenue.\n4. 10% (again, arbitrary) then goes into a fund where private companies or individuals can present plans to build infrastructure, run programs, or argue for increased funding to specific programs already handled by the government (say, education).\n5. Individuals can vote, or delegate their vote to a public figure, for where their portion of that 10% goes specifically.\n6. Over time, slowly decrease the percent going to the government and increase the percent of taxation going to the publicly delegated fund.\n7. Over time, you find out to what degree you need a central government doing the planning and funding decisions. Perhaps they can be eliminated (doubt it very much). Perhaps they are only needed for foreign affairs and the military.\n\n**This is what I mean by providing more than just \"Austrian economics fixes everything.\"** Give me your version of my plan above, or explain how no government or opt in taxation actually works from a game theory perspective.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9v0xj6",
                                            "author": "IgnacioArg",
                                            "score": 1,
                                            "created_utc": 1653430231.0,
                                            "response": "If people could vote on the tax rate, in the long run, the tax rate would trend to 0%",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9v8tcr",
                                                    "author": "Keith_Kong",
                                                    "score": 2,
                                                    "created_utc": 1653433835.0,
                                                    "response": "I think this is your bias showing and not a reflection of reality. There are many many people who support the concept of taxation. Even those who complain about the tax rate often just want to see lower taxes (recognizing the benefit of the general concept).\n\nThe direct ability to vote on the tax rate (and especially the ability to direct some of that capital to specific public goods they support) would only strengthen many peoples confidence and trust in the taxing government because the people would now have a direct financial weapon to punish poor capital allocation.\n\nA few rules I would put in place to stop swings in trust and sentiment from tearing the system apart:\n\n1. You can only vote to increase or decrease the tax rate for each tax bracket.\n2. The tax rate of change per year would be capped to something like 3% to the downside and 6% to the upside (faster to raise tax rate with large agreement, slower to decrease it).\n\nThis would keep governments mostly solvent on existing budget agreements and give them time to turn things around before the people totally strip their budget away. It would also allow people to experience the negative results on society around them (if they exist) as they lower the tax rate giving them a chance to change their mind about lower taxes too far.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9vjetv",
                                                            "author": "IgnacioArg",
                                                            "score": 1,
                                                            "created_utc": 1653438883.0,
                                                            "response": "There would be brackets?!?! And someone could vote what someone in another bracket payed?! That is ludicrous. And I said in the long term, like when gen z is 70 years old and people who grew up with the new system in charge the tax rate would trend to 0%",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9vjfw3",
                                                                    "author": "Paid-Not-Payed-Bot",
                                                                    "score": 2,
                                                                    "created_utc": 1653438897.0,
                                                                    "response": "> another bracket *paid?!* That is\n\nFTFY.\n\nAlthough *payed* exists (the reason why autocorrection didn't help you), it is only correct in:\n\n * Nautical context, when it means to paint a surface, or to cover with something like tar or resin in order to make it waterproof or corrosion-resistant. *The deck is yet to be payed.*\n\n * *Payed out* when letting strings, cables or ropes out, by slacking them. *The rope is payed out! You can pull now.*\n\nUnfortunately, I was unable to find nautical or rope-related words in your comment.\n\n*Beep, boop, I'm a bot*",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9vjvy8",
                                                                            "author": "IgnacioArg",
                                                                            "score": 2,
                                                                            "created_utc": 1653439110.0,
                                                                            "response": "I was obviously talking about sailing",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i9vnkrd",
                                                                                    "author": "Keith_Kong",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653440850.0,
                                                                                    "response": "lol it went after me too.",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "i9vk9gy",
                                                                    "author": "Keith_Kong",
                                                                    "score": 1,
                                                                    "created_utc": 1653439284.0,
                                                                    "response": "Look, there's a lot of rules to be thought through here. Perhaps limits and rules would be needed to ensure you don't just 100% tax higher income folks due to them being a minority (though I don't actually think this would happen). Perhaps you need the same thing with a lower bound to ensure 0% taxes doesn't happen (I don't think so and you haven't actually made the game theory case for why it would so...).\n\nThe main point here was to present a super high level idea as an example for where my current thoughts are–to present an example of what I'm looking for on top of Austrian Economic monetary policy to explain the game theory for how society functions and evolves (especially if the claim is to get rid of taxation all together). I'm not claiming to have solved government in any kind of monolithic way.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9vlw7u",
                                                                            "author": "IgnacioArg",
                                                                            "score": 1,
                                                                            "created_utc": 1653440060.0,
                                                                            "response": "I was not really against the idea if it meant it was a flat tax for all society, if there are brackets I really can’t get behind it. \n\nI believe that if taxation was optional there would be a much bigger discussion around what those taxes would be used for the budget of the country would be front and center of those elections, however there would be so many disparities between the needs and wants of different sections of society that in the end people would rather not pay for some thing they would not use so it would be impossible to agree on a taxation rate. So people would find private market alternatives for the things they need instead of public funding that would result in them only paying for what they need and not for what other people need, and people will always choose to pay less to the government. Even if people thought that there were people in need who would benefit from higher taxes if they had to pay less taxes they could use their spare money to help those people without forcing people who wouldn’t have them to help them. \n\nSorry, English is not my first language.\nBear in mind that I am from Argentina a country which is grossly over taxed and my perspective is very different from people from countries with more reasonable tax rates.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i9vtn2k",
                                                                                    "author": "Keith_Kong",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653443718.0,
                                                                                    "response": ">Sorry, English is not my first language. Bear in mind that I am from Argentina a country which is grossly over taxed and my perspective is very different from people from countries with more reasonable tax rates.\n\nHey no worries I'm always interested in taking in views from other parts of the world, especially countries like Argentina where both the governments monetary policy and the global consequences of the US dollar reserve status weigh down on the economy.\n\n>I was not really against the idea if it meant it was a flat tax for all society, if there are brackets I really can’t get behind it.\n\nI'd be curious to hear more about why this is such a distinguishing factor. Do you see an inherent flaw in taxing wealthier individuals at a higher rate? Or is it the worry that these ratios would become overly regressive given the majority might vote against a minority wealth class?\n\nI actually don't have a strong reason to keep tax brackets so I don't actually mind throwing them out all that much (especially since cheap debt is the largest concern for unfair wealth disparity).\n\n>I believe that if taxation was optional there would be a much bigger discussion around what those taxes would be used for the budget of the country would be front and center of those elections, however there would be so many disparities between the needs and wants of different sections of society that in the end people would rather not pay for some thing they would not use so it would be impossible to agree on a taxation rate.\n\nYou describe here exactly why taxation cannot be optional. Instead, giving people the ability to raise and lower taxation (and therefore funding for the government) would accomplish the same goal (forcing politicians to address how they would optimally deploy tax revenue for public good).\n\n>So people would find private market alternatives for the things they need instead of public funding that would result in them only paying for what they need and not for what other people need, and people will always choose to pay less to the government. Even if people thought that there were people in need who would benefit from higher taxes if they had to pay less taxes they could use their spare money to help those people without forcing people who wouldn’t have them to help them.\n\nThis is exactly why I suggested moving a small (at first) portion of the tax revenue into a separate fund which private companies, institutions, or individuals can apply for funding (or promote extra funding for programs like education). Voters can then specify exactly where their piece of this separate tax fund goes (or they can delegate the decision to a public figure they trust and respect).\n\nYou start off small here, then allow people to vote on expanding or contracting this society delegated funding system. It would function in direct competition with the governments ability to allocate capital. The citizens would then decide which system was working better and give it more of the tax revenue.\n\nSo people can vote on:\n\n1. The tax rate.\n2. The percent of tax revenue going to centralized government versus crowd selected funding of specific programs.\n3. The specific crowd selected programs they want their tax revenue to go towards (assuming others fund the same thing to get it fully funded).\n\nI'm sure there's more to pick apart here–feel free to do so.",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "i9vjk6n",
                                                            "author": "IgnacioArg",
                                                            "score": 1,
                                                            "created_utc": 1653438953.0,
                                                            "response": "I don’t really get what you are proposing though, an arbitrary new tax law? This has nothing to do with Austrian vs Keynes",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9vkyp3",
                                                                    "author": "Keith_Kong",
                                                                    "score": 1,
                                                                    "created_utc": 1653439617.0,
                                                                    "response": "I'm proposing a mechanism by which the society being taxed has a say in the quantity and severity of that tax. The idea being that the complete removal of taxation is *fucking* insane, to put it mildly. So, to the Libertarians/Freedom Maximalists out there claiming \"all taxation is theft\" I propose some kind of collectively selected tax by which you are not merely forced into whatever the state decides is \"the right amount\" (but you are still forced into the societies views on \"the right amount\").\n\nThat's why I'm saying it's an example–an idea floating around in my head that might resonate with the ideals of \"taxation is theft\" without devolving into a simplistic conclusion that society doesn't need forced collective fund building to service projects for the collective good.\n\nSo top level goals:\n\n1. Have a say in the amount of taxation.\n2. Have a say in at least some portion of where that tax revenue goes.\n\nEDIT: I should add, yes to a certain extent this has nothing to do with Austrian economics. If you haven't already I would go back and read where this whole thread started. In my first post I explain that my criticism is largely with Austrian Economists (rather than the theory itself) and their common beliefs around \"taxation is theft\" and their vague notions that we don't need government (or can have some kind of open migration islands of governments that somehow don't impact each other with competing policies that cater to the wealthy).",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9vse0p",
                            "author": "BuyRackTurk",
                            "score": 1,
                            "created_utc": 1653443131.0,
                            "response": "Most of history was done under fixed money supply status. Major changes in money supplies were once in a lifetime events, like discovering new nations or major wars. Prices of staples like bread could be stable over lifetimes.\n\nThe modern concept of governments inflating and popping massive disaster bubbles is, honestly, insane. I can hardly believe anyone could think it is even worth comparing a sound money system with this insanity.\n\n> is their insistence that a fixed supply currency combined with a free market will just magically solve any potential issues that could arise.\n\nWe can clearly see that it will not magically cause the 1000 and one constant problems caused by keynesianism. \n\nLets stop the insanity and go from there.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9w1pvr",
                                    "author": "Keith_Kong",
                                    "score": 2,
                                    "created_utc": 1653447564.0,
                                    "response": "You are coming at my post from the perspective of treating me like a Keynesian apologist and this is causing you to completely miss the point of my arguments. At the very start I was careful to mention this was a critique not of Austrian economics but of the economists themselves, often libertarian in their mindset.\n\nI’m a Bitcoiner for a reason–I believe a fixed supply money is the foundation for a market to be able to respond accurately to price signals in order to meet the true demand for goods and services. I believe saving should be possible without investing. I agree with the general premise that a market can only really be thought about from the perspective of many subjective market participants, though a game theoretic approach to hypothetical individual economic positions is also relevant when analyzing a system or government.\n\nAs for the claim that history has largely been living under a fixed supply currency, I will push back on this a bit. The dollar is not the longest lasting fiat currency because the others were based on sound Austrian fixed supply money. Whether backed by gold or some other means they were all centralized and exploited by various debt schemes. We have never experienced something like Bitcoin as a truly fixed supply currency. I agree that it will fix a lot of bad incentives in the system.\n\nIt’s the libertarians who take Austrian economics and try to claim that truly free markets will fix all bad incentives I take issue with–going as far as to say “all taxation is theft”. If you are in that camp then we are in disagreement and our mission with Bitcoin does not go in the same direction after it’s first leg.\n\nI agree the madness with our current monetary theory is the first issue to focus on with our direct actions, but this does not mean we can just wave our hands and say, “just adopt Bitcoin and get rid of governments and the world will function off the glory of the free market!” Doing so hurts the direct message. We need a vision for the future which solves for the new monetary system rather than just trying to topple the old one.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9w52qa",
                                            "author": "BuyRackTurk",
                                            "score": 1,
                                            "created_utc": 1653449249.0,
                                            "response": "> hypothetical individual economic positions is also relevant when analyzing a system or government.\n\nGiven that government interacts primarily via involuntary methods, I would expect game theoretical models have less direct applicability. It would be like trying to study mechanical design over a car that had been crushed or exploded and no longer functions. Or to put it another way, a game theoretical model of government would reveal that having central government is highly non-optimal for nearly the set of all participants.\n\n> The dollar is not the longest lasting fiat currency because the others were based on sound Austrian fixed supply money.\n\nPaper money is fairly recent. people traded in metal coins and such a few thousand years before it.\n\n> I take issue with–going as far as to say “all taxation is theft”.\n\nYou could try to argue that it is a \"necessary evil\", but tax is very clearly theft in plain english.\n\n> If you are in that camp then we are in disagreement and our mission with Bitcoin does not go in the same direction after it’s first leg.\n\nWell, I would think you dont understand modern taxation if you think so. But regardless, we can still be allies. You will believe taxes will continue just fine, I believe they will become untenable, and we will both accept the final result in either case.\n\n> “just adopt Bitcoin and get rid of governments and the world will function off the glory of the free market!” \n\nIm fine just saying the first part. \"Just adopt bitcoin\"\n\nThe rest can be implied by whatever you believe the economics will lead to.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9wfl7m",
                                                    "author": "Keith_Kong",
                                                    "score": 1,
                                                    "created_utc": 1653455352.0,
                                                    "response": "All of those things I said were in the context of post Bitcoin Standard, not under the current monetary policy of fiat. You again applied it back to a Keynesian government to critique.\n\nI’m not interested in a semantic argument over taxation as theft. We both know the libertarian implication of the statement. And yes it’s necessary in some form. Another person from Argentina has gone back and forth with me much deeper and you can read there to see my exact take on how taxation might work in a more libertarian way (but still be mandatory).\n\nAgreed with just taking the first part: adopt Bitcoin. The whole context of this specific thread was to critique the people who hold the second view.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9uef03",
                    "author": "etmetm",
                    "score": 3,
                    "created_utc": 1653420597.0,
                    "response": "How exactly do you do Keynesian economics with Bitcoin?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9v1kra",
                            "author": "proof_in_pudding",
                            "score": 6,
                            "created_utc": 1653430520.0,
                            "response": "You don't, that's why bitcoin solves a lot of problems.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9vb0r7",
                    "author": "ScamJustice",
                    "score": 3,
                    "created_utc": 1653434878.0,
                    "response": "Im a Marxist",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9w9uuj",
                            "author": "YaBoyLaKroy",
                            "score": 1,
                            "created_utc": 1653451832.0,
                            "response": "they don’t know Marx would actually be very down with bitcoin. no one’s ready for that truth bomb.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9wa244",
                                    "author": "ScamJustice",
                                    "score": 2,
                                    "created_utc": 1653451948.0,
                                    "response": "Im tired of people trying to tell me Marx supported central banks and Keynesian economic policies",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9vrtdc",
                    "author": "BuyRackTurk",
                    "score": 3,
                    "created_utc": 1653442866.0,
                    "response": "Anyone who is into bitcoin supports austrian economics, whether they know it or not. a poll is useless, because they might not even be aware of it.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9vvn6f",
                            "author": "JlloydHodls",
                            "score": 1,
                            "created_utc": 1653444656.0,
                            "response": "👏",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9w2nwl",
                    "author": "cjbrannigan",
                    "score": 3,
                    "created_utc": 1653448031.0,
                    "response": "It’s seriously flawed, I understand the argument, but it’s just another path to corporate feudalism.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9tx2g3",
                    "author": "TheRealSlimyrock",
                    "score": 10,
                    "created_utc": 1653413340.0,
                    "response": "It's the Austrians vs everyone else. Austrian Economics is the only school that makes any sense at all.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9u9pao",
                            "author": "qepdibpbfessttrud",
                            "score": 6,
                            "created_utc": 1653418611.0,
                            "response": "Supply/demand of money. Can't possible be simpler: u print, some time passes and u destroy generations of wealth when the trust cracks",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9u1nkh",
                    "author": "Bapster69420",
                    "score": 2,
                    "created_utc": 1653415229.0,
                    "response": "Austrian economics and the bitcoin standard should breed higher investment efficiency and thought when someone wants to use credit to build something. At the fringes of society growth and risk should go on but if the very fabric and base layer of money is printed via opinion of a person then inefficiencies will not be sufficiently weeded out.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9uk8rp",
                    "author": "butch_cassidy88",
                    "score": 2,
                    "created_utc": 1653423044.0,
                    "response": "I think sometimes fiat spending is necessary for defence, even if it is undesirable. If you’re invaded, for example.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9vnu9s",
                    "author": "whiskers165",
                    "score": 2,
                    "created_utc": 1653440978.0,
                    "response": "step 1: steal manhole cover\n\nstep 2: sell to junkyard\n\nstep 3: buy drugs\n\nstep 4: wait for manhole cover to be replaced, repeat steps\n\n\nAustrian economics in a nutshell",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9vok8o",
                    "author": "cubeeless",
                    "score": 2,
                    "created_utc": 1653441325.0,
                    "response": "I support Bitcoin economics.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9vr8c2",
                    "author": "mark2me2u",
                    "score": 2,
                    "created_utc": 1653442590.0,
                    "response": "I like pretzels. Does this count?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9vte8o",
                    "author": "super_clear-ish",
                    "score": 2,
                    "created_utc": 1653443602.0,
                    "response": "Mixed.\n\nLife is greater than a dichotomy.\n\nHow citizens of the world make universal account for the transfer of goods, services, and risk is complex and deserves more than “this good, that bad” mentality.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9vvxkt",
                            "author": "JlloydHodls",
                            "score": 1,
                            "created_utc": 1653444793.0,
                            "response": "👏",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9vxrga",
                    "author": "maolighter",
                    "score": 2,
                    "created_utc": 1653445657.0,
                    "response": "ITT: people who have not read Keynes. Downvote away lmao",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9vze87",
                    "author": "0x1a3c3e7",
                    "score": 2,
                    "created_utc": 1653446435.0,
                    "response": "I strongly favor **self-sufficiency** through **self-employment** and **homesteading**.  I favor **Laissez-faire** capitalism in **free markets** in which **nothing is banned** and there are **no monopolies**.  The **only regulations** should be for **consumer safety** and **environmental protection** and **codes** for **buildings**, **honesty in advertising**, **hazardous materials handling**, and **food production**.\n\nI haven't found a theory of economics that shares all of these ideas in the same basket.  I'm pretty sure it's not Austrianism.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9tlyqd",
                    "author": "CoinCorner_Sam",
                    "score": 5,
                    "created_utc": 1653408814.0,
                    "response": "Austrian School for sure. The Bitcoin Standard book is a good start.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ty26h",
                    "author": "Leading-Fail-7263",
                    "score": 2,
                    "created_utc": 1653413750.0,
                    "response": "Mixed views. Every school of Economics has tons of flaws. But I'm not convinced by the Austrian economics \"sound money\" principle, that we should have a fixed number of dollars in the economy. That's not an excuse to print money casually, just not sure it's entirely ideal.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9v1bz6",
                            "author": "proof_in_pudding",
                            "score": 4,
                            "created_utc": 1653430410.0,
                            "response": "The biggest problem with giving the government the ability to print money is that it enables war. We would never have seen the wars of the 20th century if they had to paid for through taxation alone.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9u94b9",
                    "author": "oltreil",
                    "score": 4,
                    "created_utc": 1653418366.0,
                    "response": "I prefer something I can understand and makes sense (it's how anybody outside the government manages their finances) to something that literally no one understands. No one understands MMT. \"it worked for some time, let's wait and see\", that's the gist of the sales pitch.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9tslmg",
                    "author": "samlawsteadicam",
                    "score": 2,
                    "created_utc": 1653411508.0,
                    "response": "Strongly support",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9tyrb1",
                    "author": "Gmoneymoney7",
                    "score": 2,
                    "created_utc": 1653414038.0,
                    "response": "I believe that austrian economics is flawed in its stance on negative externalities.\n\nAs an outdoorsman, i know all too well what oil/gas/mining companies will do to secure profits. How do we control these actions without a strong central governance structure?\n\nThe argument that I've heard presented by austrian economists (saifedean) is that people will simply stop spending their money on companies that pollute/degrade the environment, but i'm not so sure, and the stakes are simply too high.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9u9a0v",
                            "author": "qepdibpbfessttrud",
                            "score": 1,
                            "created_utc": 1653418433.0,
                            "response": "> How do we control these actions without a strong central governance structure?\n\nTechnological progress, as always. Doesn't guarantee that u will, but it the best shot u get since first man mastered the Fire\n\nEven if u foreseeing a big problem on the horizon it doesn't give u a right to extort from others\n\n> people will simply stop spending their money on companies that pollute/degrade the environment\n\nWhen their other problems are solved, they start to. Like straw panic in Cali or recent increase in electric cars and solar worldwide. Margins have to occur: living is secured, improving environment is cheap enough. If u don't want to wait for the big rise in prosperity everywhere, u also can do something like carbon capture or better RnD in dams, city/building planning, electrifying the world including molten salt nuclear power and much need revolution in batteries\n\n> the stakes are simply too high\n\nNot everywhere and not for everyone",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9ugcfj",
                            "author": "TheRealSlimyrock",
                            "score": 1,
                            "created_utc": 1653421410.0,
                            "response": "Every big corporation will go to great lengths to secure profit, this isn't just oil & gas.\n\nHow do we control these actions without a strong central governance structure? Seriously? At the end of the day, a strong, central governance structure is just a politician that a big oil & gas executive needs to pay off.  Their laws and regulations don't matter, this just breeds corruption, and anywhere that there are humans, there's corruption.\n\nAnd in a sound money system, your time preference lowers, you think about the future because you're able to save for your future, and you invest in sound companies, ones that won't pollute the environment. The free market will vote w/ their wallets & crap technology like solar panels that didn't pass the market test, wouldn't be subsidized by governments.\n\nA lot in this world can be fixed w/ sound money. And BTW... we're deep into Keynesian country and guess what? Big oil & gas do everything you describe today, except they do it w/ an enormous central government structure in place. You whole argument is a house of cards.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9ttia2",
                    "author": "OutragedAardvark",
                    "score": 1,
                    "created_utc": 1653411875.0,
                    "response": "Serious flaws",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9u9cf7",
                            "author": "qepdibpbfessttrud",
                            "score": 3,
                            "created_utc": 1653418461.0,
                            "response": "Which are?..",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9txhve",
                    "author": "solomonsatoshi",
                    "score": 3,
                    "created_utc": 1653413516.0,
                    "response": "Austrian economics essentially asserts less government is good government...ignoring the warning of Adam Smith-\n\n'People of the same trade seldom meet together, even for merriment and diversion, but the conversation ends in a conspiracy against the public or in some contrivance to raise prices’.\n\nAustrian economics also appears to discount the importance of government power in relation to other competing nation states and their insatiable appetite for resources in the global marketplace.\n\nAustrian economics also appears to lack a mechanism to regulate misuse of resources where the consequences of use of resources are not fully borne by the user of that resource but are instead visited upon others.\n\nThe West which has enjoyed centuries of relative dominance of global resource access due to institutional, military and technological superiority might less appreciate the importance of strong nation state power projection relative to nations who have suffered defeat on the battle field and consequently relative poverty.\n\nThe degree of individual monetary sovereignty that Bitcoin confers might therefore seem unacceptable to China and other autocracies, while to westerners of a libertarian/Austrian viewpoint Bitcoin seems perfectly reasonable and natural.\n\nThe neoliberal monetarist ideology adopted by the west from the 1980s was ostensibly a  form of Austrian Liberalism but since Greenspans endless 'puts' and more generally banking cartel capture of western regulatory integrity, a mongrel hybrid of expedient Monetarist and Keynesian dogma (ie blatant hypocrisy) has been applied to a declining western economic monetary and regulatory system that has not adjusted to changing dynamics of the emerging post industrial digital era, and the rising BRICS nations challenge to US hegemony led by China.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9wdhkq",
                            "author": "Admiral_Narcissus",
                            "score": 1,
                            "created_utc": 1653454008.0,
                            "response": "Very interesting description. Thank you.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9vsmdz",
                            "author": "BuyRackTurk",
                            "score": 1,
                            "created_utc": 1653443242.0,
                            "response": "> but the conversation ends in a conspiracy against the public or in some contrivance to raise prices’.\n\nWithout a goverment to give them regulatory capture or a bank to print them some money thats also right where the conspiracy ends. The conspirators leave empty handed and get back to work being useful to society.\n\nAustrian economics is the **only** branch of economics that heeds Smith's warning.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9tj92e",
                    "author": "Swimming_Ad2716",
                    "score": 1,
                    "created_utc": 1653407696.0,
                    "response": "Serious flaws upvote here.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9tnfnj",
                            "author": "Ok_Aerie3546",
                            "score": 6,
                            "created_utc": 1653409410.0,
                            "response": "What are the flaws though?",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9tngh8",
                            "author": "pink_raya",
                            "score": 1,
                            "created_utc": 1653409419.0,
                            "response": "not surprised, everything is serious in austria, including jokes.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9tsrv1",
                    "author": "solomonsatoshi",
                    "score": -2,
                    "created_utc": 1653411579.0,
                    "response": "If I am not wrong the Keynesian era was preceded by the Liberal era which was based on Austrian free market ideology but led to the Great Depression. At the same time (1930s) the Communists in Russia were appearing to enjoy rapid industrial growth through their central planning Marxist program. Western governments adopted some socialist policies via Keynesian mechanisms creating work schemes and some welfare. This appeared to work and to appease the masses then WW2 occurred and thereafter the world was divided between the Soviet Bloc and the west. Economic theories tend to view the world as a static model whereas reality and technology is constantly changing. Austrian economics sees the free market as ideal but may fail to account for anti-competitive tendencies and the need to regulate them. Communist central planning seemed to work well in a crude early stage of industrialisation but failed to match free markets as technology developed. As we now enter the post industrial digital economy who knows how the various new forces will interact with the various economic model ideologies? Bitcoin seems like it is at least one strand of the developing digital era of algorithmic economic progression. Chinas central command mercantilism has successfully reverse engineered the Wests industrial models and now seeks to reverse engineer if not re engineer completely the global institutional and regulatory protocols and frameworks...the monetary system being the ultimate prize of empire. Whose face is on that coin? To he you pay tax! Ultimately the economic theories which enable the greatest capture of resources and wealth must change with the technology that drives wealth creation. In short stack Sats and hope for the best but also plan for the worst.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9tzg6d",
                            "author": "grayjacanda",
                            "score": 4,
                            "created_utc": 1653414322.0,
                            "response": "You've done some kind of speed read and conflated Austrian economics with general small government ideology.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9u1jx5",
                                    "author": "solomonsatoshi",
                                    "score": 0,
                                    "created_utc": 1653415188.0,
                                    "response": "That was Reagan not me!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9u9j6v",
                            "author": "qepdibpbfessttrud",
                            "score": 2,
                            "created_utc": 1653418540.0,
                            "response": "> If I am not wrong the Keynesian era was preceded by the Liberal era which was based on Austrian free market ideology but led to the Great Depression\n\nGreat Depression had occurred a couple of decades after the merge of State and Money in the US",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9ujvhm",
                                    "author": "solomonsatoshi",
                                    "score": 0,
                                    "created_utc": 1653422887.0,
                                    "response": "Yes but the deregulated capital markets that led up to the Great Depression had been put in place by Liberal politics. Liberal Politics based on Austrian economics. Liberal politics that continued to be in charge until the 1930s. Similar to the neoliberal monetarists who took power in the 1980s but whose policies including market deregulation eventually forced a return to expansionary Keynesian monetary policies.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9utzo6",
                                            "author": "qepdibpbfessttrud",
                                            "score": 2,
                                            "created_utc": 1653427199.0,
                                            "response": "Imposed central bank is not a deregulated capital market, it's an inefficient regulated capital market\n\nWith much more sound money than today govt back then already was pretty heave, debt reached 40% GDP it seems, inefficiency all around. Fiat may forestall busts, but it accumulates them into a future total collapse. Fall of Rome level\n\n> eventually forced a return to expansionary Keynesian monetary policies\n\nIt's a guaranteed political win. Print your promises. FED won't end at the ballot box, no big fiat will is my guess",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9u3ndv",
                    "author": "Festortheinvestor",
                    "score": 1,
                    "created_utc": 1653416065.0,
                    "response": "I don’t like fiat currency and inflation, that is flawed, fatally. \n\nAustrian economics don’t even come into it, if i were to pick any, it would be donut economics by Kate Raworth.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9wekk8",
                            "author": "Admiral_Narcissus",
                            "score": 1,
                            "created_utc": 1653454699.0,
                            "response": "That was a good book",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9u6e16",
                    "author": "AntonNonymous",
                    "score": 1,
                    "created_utc": 1653417216.0,
                    "response": "Australian economics has my portfolio upside down",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9uvr6h",
                    "author": "theslapzone",
                    "score": 1,
                    "created_utc": 1653427966.0,
                    "response": "Both economic theories fail to account for human nature. Both theories think they're accounting for human nature. Humans will never align under any single ideal or philosophy.\n\nThe best we can hope for is moving democratic control as close to those affected by the decisions as possible.\n\nBitcoin it sound money. I think it can help all humans. What humans do it remains to be seen. My guess is it's going to be messy.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9uwoef",
                    "author": "igadjeed",
                    "score": 1,
                    "created_utc": 1653428371.0,
                    "response": " It does not have serious flaws. It is totally useless, a fairy tale",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9uw1yu",
                    "author": "DeterminedToRot",
                    "score": 0,
                    "created_utc": 1653428097.0,
                    "response": "It’s an utter joke. Keynesian is for smarter people. Both are wrong though, Marx nailed it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9tyskq",
                    "author": "tedthizzy",
                    "score": -1,
                    "created_utc": 1653414052.0,
                    "response": "Flawed!\n\nHere's one example from Ludwig Von Mises Human Action: \n\n>Quantitative problems are in the field of human action open to no other elucidation that that by understanding. (p.117-118)  \n...  \nThe entrepreneur is the agency that prevents the persistence of a state of production unsuitable to fill the most urgent wants of the customers in the cheapest way (p.333)\n\nThese are conflicting statements. On the one hand, Mises says quantifying needs is impossible due to subjective valuations. On the other hand, he says doing this is the purpose of entrepreneurship. While it is true there is no real objective measure of aims, it is false that it cannot be quantitatively measured by a prospective entrepreneur. The way to quantify it is to measure the relative subjective importance and satisfaction of each aim across a large population. Statistical methods are the key to predictable innovation. \n\nBut yeah, other than that the theory is sound AFAIK",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ueqcx",
                            "author": "TheRealSlimyrock",
                            "score": 1,
                            "created_utc": 1653420731.0,
                            "response": "Ludwig von Mises was ONE Austrian Economist, he was NOT the school of Austrian Economics. You're painting the whole school with one large brush based off of what you interpret as a contradiction by ONE Austrian Economist. \n\nThat is like saying that all Democrats are stupid because look at Biden, or all Republicans are stupid because look at Trump. By your definition both parties are flawed because of one man in each party. Where in truth both parties are shit, but you get my meaning. \n\nThis isn't a contradiction BTW...",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9v2u7y",
                            "author": "Yorn2",
                            "score": 1,
                            "created_utc": 1653431080.0,
                            "response": "There's not really an inconsistency here. I guess I read the second line you mention as an observation and not a statement of fact.\n\nIn fact, one of the criticisms of Marx that Bohm-Bawerk brought up was this this misunderstanding of the relationship of the cost of labor with regards to subjective valuation.\n\nFor example, the capitalist takes on the risks of bringing a product to market that the consumer either may not want or is not ready for. There may be inconsistent demand, for example, which means that production of a good might not always be worth the cost, either in resources or in labor. But the capitalist takes on this risk in inconsistent demand so that the laborer does not have to. The laborer in exchange gets a consistent wage.\n\nImagine a world where laborers make the same products over and over and never innovate. That's the world that Marx wrote Das Kapital for. He never really truly embraced the idea of [ordinal utility](https://en.wikipedia.org/wiki/Ordinal_utility) which we know humans use as way to determine value.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9ug1a7",
                    "author": "baconcheeseburgarian",
                    "score": 1,
                    "created_utc": 1653421279.0,
                    "response": "The real truth is we need to start evolving past traditional supply/demand and labor based economics and neither system is sustainable over the long term.  Bitcoin is elegant for this system we live in but we need to start thinking about how an economy functions when there is no more need for physical or even intellectual labor.  It's coming around the corner a whole lot faster than we might think.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9uns93",
                    "author": "crinkneck",
                    "score": 1,
                    "created_utc": 1653424538.0,
                    "response": "I am in the Austrian camp, having spent the better part of the last decade reading the big names. Ammous has done a wonderful job bringing it forward and to the Bitcoin community.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9uw847",
                    "author": "Jigg3r",
                    "score": 1,
                    "created_utc": 1653428170.0,
                    "response": "Ah, the Austrian school, where 1 BTC ≠ 1 BTC.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9uwu5r",
                    "author": "lazarus_free",
                    "score": 1,
                    "created_utc": 1653428440.0,
                    "response": "You don't support a branch of economics like a football team. You can take ideas from every branch.\n\nHowever, based on what has happened over the past decades, the Austrian theory of economic cycle explains it much better than keynesian economics.\n\nIt is the only branch of economics that explains how fiscal and mainly monetary stimulus have as a result a miscoordination in the economic agents which get the wrong signals and misallocate capital, which in the end has been allocated to unproductive means while having abandoned other essential areas of the economy.\n\nSound familiar? We are exactly witnessing that.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9uybri",
                    "author": "ReDelleFoche01",
                    "score": 1,
                    "created_utc": 1653429096.0,
                    "response": "I support Austrian economics 100%.\nIt shouldn’t be called “Austrian economics”, it’s just economics deprived of political agendas.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9v1y1s",
                    "author": "TheChoosey1",
                    "score": 1,
                    "created_utc": 1653430686.0,
                    "response": "G'day, mate. Let's put another shrimp on the barbie.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9v2v90",
                    "author": "Zealousideal_Lab537",
                    "score": 1,
                    "created_utc": 1653431093.0,
                    "response": "Keynesian economics is only accepted and used extensively because it fits what governments do, Austrian economics can only work if you take away money out of the state's hands \n\nI don't think any bitcoiner can support anything other than Austrian economics",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9v2xkc",
                    "author": "Basic_Juice_Union",
                    "score": 1,
                    "created_utc": 1653431121.0,
                    "response": "The only \"flaw\" I see with Austrian is that people won't spend as much. I think, environmentally speaking, that's a good thing. People who work for the love of work will get paid. People who don't want to work can stop filling positions and being incompetent, and bs products we don't need can can go to consumer hell. Only the stuff we actually need will be bought and produced",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9v3dfy",
                    "author": "outer_fucking_space",
                    "score": 1,
                    "created_utc": 1653431322.0,
                    "response": "I’m down with it. As long as we have Medicare for all too etc.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9v3dvc",
                    "author": "Vonmises27",
                    "score": 1,
                    "created_utc": 1653431327.0,
                    "response": "I strongly support Austrian economics…. In fact my discord name is the father of the Austrian school of economics!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9v3yc5",
                    "author": "El_Zilcho",
                    "score": 1,
                    "created_utc": 1653431588.0,
                    "response": "Keynesian economics were meant to completely stop the boom bust cycle. Given the fact we are still in boom/bust cycle would convey the fact it failed. All it has achieved is filter what’s left of extractable wealth from the poor to the rich.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9v4yto",
                    "author": "garrypig",
                    "score": 1,
                    "created_utc": 1653432051.0,
                    "response": "No. We need to unite with China, India and Russia against the EU. In my own opinion, you don’t have to agree. Nothing in Europe is truly great.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9v6is0",
                    "author": "infopocalypse",
                    "score": 1,
                    "created_utc": 1653432770.0,
                    "response": "I just refer to Austrian economics as economics. There are still a small % of people clinging onto the lie that inflation is good and necessary, but that number is shrinking.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9v80x1",
                    "author": "jmh300",
                    "score": 1,
                    "created_utc": 1653433466.0,
                    "response": "Keynesian economics let the world recover from one or two issues, like WW2 or the pandemics, avoiding millons to became poor or indigent, with a lot of pernicious long term effects. Austrian economics would ment people starving because is has no solution (and don't care) for extreme circumstances like that (two mention only two). Repeat. With lot of important side effects",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9v84dr",
                    "author": "Mas113m",
                    "score": 1,
                    "created_utc": 1653433511.0,
                    "response": "Well this is reddit, so probably significantly fewer than it should be.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9v9f9t",
                    "author": "rashnull",
                    "score": 1,
                    "created_utc": 1653434123.0,
                    "response": "The mechanics of Austrian economics states that only god, nature, or majority consensus shall allow for the creation or destruction of “money”, not a handful of monkeys who think they know what’s best for us!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9va47d",
                    "author": "gods_loop_hole",
                    "score": 1,
                    "created_utc": 1653434451.0,
                    "response": "As far as I know from what I have heard/read about Austrian economics, I think the biggest flaw it poses is the absence of control. What I mean by this is what if the wealth in a population gets disproportionately distributed in an economy, such as what we are seeing in the Keynesian economics of today. It hasn't offered solution to that scenario, but anyone can feel free to educate me on this.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9vbrtl",
                    "author": "Think_Cat7703",
                    "score": 1,
                    "created_utc": 1653435229.0,
                    "response": "Honestly, I'm kind of Austrian by default as I'm new to economics. The reason is similar to why I'm for proof of work and not for proof of stake. Proof of work and Austrian economics just **seem** like they can be explained clearly, logically and makes sense. Keynesian economics and proof of stake just **seem** intentionally overcomplicated and complex. Keen to hear people's arguments against Austrian economics though.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9vckr1",
                    "author": "superavg",
                    "score": 1,
                    "created_utc": 1653435606.0,
                    "response": "Man wtf even is Australian economics. \n\nI know I don’t trust American economics.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9vd2vs",
                    "author": "vegansandiego",
                    "score": 1,
                    "created_utc": 1653435840.0,
                    "response": "Flawed \nThe inflexibility of Austrian economics makes it completely untenable. You can't realistically have a inflexible supply and all of the human misery that would tolerate if implemented. That being said, there are some points that could be very helpful, such as value matters, and prudent spending/benefits of saving.\nIdeal economic system hasn't been invented since human greed is very difficult to pre-plan for. However, bitcoin could be very useful in a more nuanced decentralized value system. \nNot sure what the value proposition is for most shitcoins.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9vfl1w",
                    "author": "MrMantis765",
                    "score": 1,
                    "created_utc": 1653437032.0,
                    "response": "Like most economic theories, it's a model, and doesn't truly exist in reality, nor will it exist because the world is too nuanced and complicated to be reduced to a a set of narrow axioms. So some ideas are good, and others aren't. Economics as much as it tries to, can never be completely scientific like physics. Human behaviour is not something that can be predicted like physical phenomenon. \n\nAnd the primary flaw of Austrian economics is the assumption that markets can ever be truly free and independent. Government intervention is necessary actually create markets and then uphold justice within them. You can't simply have markets without some kind of government. I'm no Keynesian either by the way. \nI think there are good an bad ideas on both sides and being jingoistic about one or another school is childish. \n\n\nThat said, you have to remember, the Austrian school of economics came about as a result of the circumstances and dialogue at that time, and the world moves on. I'd argue that in addition to the world being too complicated to purely resort to one way of looking at the world such as the Austrian school, or Keynesian economics, the world the Austrian school was responding to, no longer exists.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9vfvux",
                    "author": "ccashdan",
                    "score": 1,
                    "created_utc": 1653437178.0,
                    "response": "I am. It just makes sense. Unlike Keynesian economics which solely realize on government",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9vgc92",
                    "author": "thecoat9",
                    "score": 1,
                    "created_utc": 1653437403.0,
                    "response": "Put me in the mixed views camp I guess, though most of the problems you run into with sound money are problems that bitcoin nullifies.  For instance when the U.S. was on the gold standard with western expansion and a growing economy both in size and in area,  there was a currency shortages in part due to transport issues, but also because of a supply crunch which could not be alleviated by infinite divisibility.  This was how the company scrips and stores came about.  IE people filled the gaps created by backed money with unbacked money.\n\nOf course in modern day with most of us having lived our the majority if not the entirety of our lives on a fiat system where the hidden taxation of inflation makes us feel like hamsters on a tread mill, sound money sounds really good, and even if bitcoin did not solve many of the issues that give rise to unbacked fiat, I'd still be in favor of trying it the other way having lived with and being disappointed with the inflationary unbacked system throughout my life.\n\nI recognize the prior problems with Austrian models, but with better currency that solves the divisibility and transport issues, Austrian models are certainly more sound.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9vi6l5",
                    "author": "JlloydHodls",
                    "score": 1,
                    "created_utc": 1653438293.0,
                    "response": "It only has flaws if you have a fiat way of thinking",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9vjkco",
                    "author": "classysax4",
                    "score": 1,
                    "created_utc": 1653438955.0,
                    "response": "Strong support",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9vlq0k",
                    "author": "Zealousideal_Leg_630",
                    "score": 1,
                    "created_utc": 1653439978.0,
                    "response": "Well, anarcho-capitalists tend to like Austrian economics, if they've ever gained a clue about it. Viva brutal inequality!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9vo2a3",
                    "author": "deefdaffer",
                    "score": 1,
                    "created_utc": 1653441085.0,
                    "response": "I think giving the people money and not centralizing it in the government and banks that become quasi-governmental institutions.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9vrful",
                    "author": "bitcoin_barry",
                    "score": 1,
                    "created_utc": 1653442689.0,
                    "response": "I didn't know much about economics before Bitcoin, but whenever I spoke to my friend who DID study (a bit of) economics, he would raise it as a point to discredit anything I said.\n\nI then studied a bit of economics through a Youtube crash course, understood terminology and was able to understand from his point of view.\n\nIt turns out, that economical views don't necessarily contradict austrian economics, but it does tend to pretend it is following scientific models and any time something doesn't fit, it is human nature.\n\nBeing a technical person myself, Austrian economics makes more sense.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9vvzrl",
                            "author": "JlloydHodls",
                            "score": 1,
                            "created_utc": 1653444823.0,
                            "response": "👏",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9vvvqf",
                    "author": "JlloydHodls",
                    "score": 1,
                    "created_utc": 1653444769.0,
                    "response": "Read the bitcoin standard! It really gets you thinking and you will truly understand bitcoin better, no matter what the media says bitcoin can fix so many problems but everyday people won’t open their eyes for a long time, slowly but surely they will.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9vvxkf",
                    "author": "Successful_Award2850",
                    "score": 1,
                    "created_utc": 1653444793.0,
                    "response": "Love Austrian Econ",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9vzef5",
                    "author": "mantits-",
                    "score": 1,
                    "created_utc": 1653446437.0,
                    "response": "without looking into austrian economics and only hearing Saifedean Ammous talk about it... i like what he says and he makes sense but i dont know enough to debate him otherwise regardless",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9w2evr",
                    "author": "johnnyringo1985",
                    "score": 1,
                    "created_utc": 1653447906.0,
                    "response": "Neither JMK, nor his pupil and American acolyte JKG, ever envisioned a world of permanent and sustained national debt.\n\nThe current federal budget is spending 9% on interest payments. So not to the federal reserve. 9% of today’s federal budget is paying interest to American citizens, banks and foreign countries. How’s that going to end when interest rates increase?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9w776p",
                    "author": "Remarkable-Cat1337",
                    "score": 1,
                    "created_utc": 1653450352.0,
                    "response": "how many bitcoiners belive btc is deflationary? why god",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9wga8e",
                    "author": "HRSteel",
                    "score": 1,
                    "created_utc": 1653455816.0,
                    "response": "Austrian economics is how I found BTC and how I knew it was a great idea. Austrian economics literally made me rich. Even if it didn’t, I’d still support Austrian economics because the logic is sound.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9twsez",
                    "author": "Independent-Snow-129",
                    "score": 0,
                    "created_utc": 1653413224.0,
                    "response": "In my understanding there's nothing to debate against the Austrian economics way.\n\nI would add \" Bitcoin is incomparable \" , there's halving, fix supply and difficulty in bitcoin which rule the *pure/philosophic* value until the last mined bitcoin .\n\nWithout offers and *demand* , bitcoin can value it's own preservation. \"**Incomparable\"**",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uwu02d",
            "title": "The first-ever news article on Bitcoin, published exactly 12 years ago. Seven projects were profiled, only one changed the world",
            "url": "https://www.infoworld.com/article/2627013/open-source-innovation-on-the-cutting-edge.html",
            "author": "CoinCorner_Sam",
            "created_utc": 1653407569.0,
            "score": 15,
            "num_comments": 4,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9tv1r5",
                    "author": "sylsau",
                    "score": 3,
                    "created_utc": 1653412508.0,
                    "response": "And the most interesting thing is that we are still in the early stages of the changes that Bitcoin will bring to the world. The future of Bitcoin will be exceptional.\n\n&#x200B;\n\n>Unlike past attempts at digital currency, there are no dedicated servers managing Bitcoin transactions and no central authority. All of the \"banking\" functions are distributed across individual nodes on the Bitcoin peer-to-peer network.\n\nThis article describes Bitcoin well and does not make negative judgments like other articles from the early years of Bitcoin. The presentation is very honest.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9tm8ca",
                    "author": "coinfeeds-bot",
                    "score": 3,
                    "created_utc": 1653408924.0,
                    "response": "tldr; The open source movement remains a font of innovation to this day, and not just in the commercial sector. Many projects founded by universities, loosely knit communities, and individuals are exploring areas yet to be taken on by mainstream, proprietary software products. Here are just seven examples of exciting new ideas in software that you may be able to buy from proprietary vendors someday, but only get for free from the open source community today.\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9vf1jk",
                    "author": "PRMan99",
                    "score": 1,
                    "created_utc": 1653436775.0,
                    "response": "A couple of the others lasted for a while (kSplice, Unity), but bitcoin is the only one that's still in wide use.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}