{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uxgp8o",
            "title": "I'm wanting to withdraw money from a gambling site (Ignition) and have some questions.",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/uxgp8o/im_wanting_to_withdraw_money_from_a_gambling_site/",
            "author": "directedgraphs",
            "created_utc": 1653483147.0,
            "score": 4,
            "num_comments": 19,
            "subreddit": "BitcoinBeginners",
            "selftext": "When talking to support, they said that I need to have a wallet and then I can transfer money from that wallet to coinbase. So, I need something like blockchain and then I can send it to coinbase? Is this normal? Secondarily, I've heard bad things about blockchain, so I'm wondering if it's a good option or not.\n\nWhat else do I need in order to get my bitcoin to my coinbase account correctly? There was a warning on Coinbase that said if my thing is setup incorrectly, I'll lose my crypto. I want to make sure that everything is good and ready to receive bitcoin.\n\nLastly, suppose I withdraw from Ignition $1000 in BTC, and it takes 2 days to get to my account. Within those 2 days, BTC crashes and loses 15% value. I've lost that 15% value? Further more, once I've gotten it into my coinbase wallet and withdraw it to my bank account, suppose it drops another 15%. Am I losing yet another 15%?",
            "stickied": false,
            "comments": [
                {
                    "id": "i9y55sa",
                    "author": "igadjeed",
                    "score": 2,
                    "created_utc": 1653493676.0,
                    "response": "Bitcoin wallet apps are free  \nhttps://bitcoin.org/en/choose-your-wallet  \n\nDo not use the blockchain.com wallet. It has a terrible reputation  \n\nDo not send Bitcoin from a gambling site to a Coinbase account. Coinbase has a reputation for playing the policeman, enforcing USA laws against Internet gambling\n\n> it takes 2 days  \n> loses 15%  \n> drops another 15%\n\nYou're indulging in \"what if\" anxiety  \n\nWithdrawing Bitcoin to your wallet, depositing Bitcoin to your Coinbase account, selling on Coinbase, withdrawing dollars to your bank account, can be done in less than 10 minutes. If it takes you more than one hour, you're pressing the wrong buttons",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9xjzzc",
                    "author": "BTCMachineElf",
                    "score": 0,
                    "created_utc": 1653484706.0,
                    "response": "If you want to move it to coinbase, in coinbase make a bitcoin deposit request and they will give you an address. On Ignition, withdraw funds to that address. It will move to your coinbase account. It shouldn't take more than 30 minutes to be there.\n\nBut I would recommend holding onto that bitcoin and researching what it is about. Yes, it might drop 15%. It might not. But over the next 2-3 years it's likely to go up and be worth a lot more.\n\nYou'd certainly do better hodling bitcoin than you would gambling.\n\nIf you do decide to hodl, create a bitcoin phone wallet using Blockstream Green or Bluewallet, write down the 24 words and keep them safe, and withdraw the funds there. Don't keep them on Coinbase.\n\n&#x200B;\n\n>BTC crashes and loses 15% value. I've lost that 15% value? Further more, once I've gotten it into my coinbase wallet and withdraw it to my bank account, suppose it drops another 15%. Am I losing yet another 15%?\n\nThink of an amount of bitcoin as a chunk of gold. $1000 is about 0.034 bitcoin, and 0.54oz of gold currently. Just like the gold, that amount of bitcoin will not change as you hold it.\n\nIf the price goes down 15% and then you sell it, then yes, you lost 15%. After you exchange it for USD, even if still on Coinbase, the amount of USD you have will not change with the price of bitcoin.\n\n>I've heard bad things about blockchain, so I'm wondering if it's a good option or not.\n\nThey are a scammy company, known to freeze user accounts and yet is a favorite among scammers. Do NOT use their products or services.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ygcxp",
                            "author": "walletsworth616",
                            "score": 0,
                            "created_utc": 1653498030.0,
                            "response": "“You would certainly do better hodling btc than gambling.” What’s your basis for this statement? How long should they hodl to show more profit than they could potentially make playing poker? You advice is a blanket statement with zero facts behind it.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9ykfpm",
                                    "author": "BTCMachineElf",
                                    "score": 1,
                                    "created_utc": 1653499613.0,
                                    "response": "In gambling, in the long run, the house always wins.\n\nIn bitcoin, by it's track record, everyone who holds for \\~3 years wins.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9ylxef",
                                            "author": "walletsworth616",
                                            "score": 1,
                                            "created_utc": 1653500198.0,
                                            "response": "Not a house in poker other than rake so your typical argument of the house always wins doesn’t apply here",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9ym4m8",
                                                    "author": "directedgraphs",
                                                    "score": 0,
                                                    "created_utc": 1653500276.0,
                                                    "response": "yup yup. Just remember kids \"higher rake is better for players\" ;)",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9ym8bs",
                                                            "author": "walletsworth616",
                                                            "score": 2,
                                                            "created_utc": 1653500317.0,
                                                            "response": "Stfu Daniel",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9ymiau",
                                                                    "author": "directedgraphs",
                                                                    "score": 1,
                                                                    "created_utc": 1653500425.0,
                                                                    "response": "Shit my alt has been found out",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9yn18b",
                                                                            "author": "walletsworth616",
                                                                            "score": 1,
                                                                            "created_utc": 1653500630.0,
                                                                            "response": "All good, spent all that time learning to read others you never spent the time to disguise yourself",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "i9ymic5",
                                                                    "author": "walletsworth616",
                                                                    "score": 1,
                                                                    "created_utc": 1653500425.0,
                                                                    "response": "But to actually answer your post, btc cash outs always took ~47 minutes from request to my blockchain account, then I’d transfer to cashapp/sell btc/immediately have access to cash out within 50ish minutes. Also never had a single issue with blockchain and as far as rate when you cash out you are guaranteed that current btc rate when cash out is finalized",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9yle5k",
                                            "author": "directedgraphs",
                                            "score": 0,
                                            "created_utc": 1653499989.0,
                                            "response": ">In gambling, in the long run, the house always wins.\n\nObjectively untrue in poker. If one played perfect GTO, the longer that player plays, they are mathematically guaranteed to be up money. \n\nA player cannot play perfect GTO, but that doesn't matter.\n\nPoker is not roulette or blackjack (if one plays blackjack without counting cards). There is an extremely advanced, very detailed statistical system to play poker. GTO in poker is very advanced.\n\nThe math behind poker is clear and obviously objective. One stands to make an extraordinary amount of money playing poker if one is disciplined enough to study and practice the math and utilizes proper bankroll management.\n\nAs for your first comment, appreciate it. :)",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9xguam",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653483147.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}