{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uuqj5a",
            "title": "Lagarde on cryptocurrencies",
            "url": "https://twitter.com/i/status/1528048331942989824",
            "author": "xentagz",
            "created_utc": 1653150234.0,
            "score": 1,
            "num_comments": 0,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uuqkz4",
            "title": "Save vs Spend Bitcoin",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uuqkz4/save_vs_spend_bitcoin/",
            "author": "Boe_Ning",
            "created_utc": 1653150396.0,
            "score": 22,
            "num_comments": 27,
            "subreddit": "Bitcoin",
            "selftext": "I see alot of discussion on here about holding for capital gains vs. spending for increased utilization and adoption.\n\nIf you can do both, you should.  I have my Bitcoin savings held with a cold wallet, but I started keeping a small amount of Bitcoin in Strike to spend on every-day purchases when possible.\n\nWhenever I visit a store, service provider, or need to make a payment of any kind, I ask if they accept bitcoin and am prepared to pay via Strike.  It's opened the door for conversations about Bitcoin along the way, too.\n\nIf you can save and spend, do both!",
            "stickied": false,
            "comments": [
                {
                    "id": "i9gsefz",
                    "author": "BTCMachineElf",
                    "score": 5,
                    "created_utc": 1653151075.0,
                    "response": "We all gotta spend anyways. May as well convert some spending money to bitcoin and use where applicable.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9gsz70",
                            "author": "Boe_Ning",
                            "score": 3,
                            "created_utc": 1653151335.0,
                            "response": "Exactly",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9grffe",
                    "author": "Nada_Lives",
                    "score": 5,
                    "created_utc": 1653150629.0,
                    "response": "Good on you!\n\nYou can also ask if they participate in the circular economy by paying their people and suppliers with Bitcoin, or if they merely dump it for fiat.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9gsh29",
                    "author": "lordsamadhi",
                    "score": 3,
                    "created_utc": 1653151107.0,
                    "response": "Yup, same here.  I have a Lightning node ready to pay from and always looking for opportunities to do so.  Still stacking sats in a separate hardware wallet as well.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9gr1m2",
                    "author": "chilidawger",
                    "score": 2,
                    "created_utc": 1653150452.0,
                    "response": "I dig it",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9grt5f",
                    "author": "redhtbassplyr",
                    "score": 1,
                    "created_utc": 1653150807.0,
                    "response": "I only split use & saving with larger purchases. Every purchase no matter how small the amount is a taxable event so It just makes tax season the subsequent year that much more difficult an expensive if using programs with having more transactions. It also makes your risk of making an error go up with having to calculate all these capital gains and potentially capital losses depending on how the markets moving and at the time of your purchases of Bitcoin originally. \n\nI'm not familiar with Strike but does it give you 1099 pds or csv spreadsheets or what? Or how do you do your taxes with it and where are you buying the Bitcoin on a different exchange or do you buy through Strike? If it communicates with another exchange and you're loading it into it then that even is more difficult with taxes.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9gwu5m",
                            "author": "Imaginary-Friendship",
                            "score": 1,
                            "created_utc": 1653153087.0,
                            "response": "Strike allows you to pay over Lightning using fiat so it’s not a taxable event. Look into LVL if you want to spend bitcoin and get a tax report at end of year.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9gy21l",
                                    "author": "redhtbassplyr",
                                    "score": 1,
                                    "created_utc": 1653153643.0,
                                    "response": ">Strike allows you to pay over Lightning using fiat\n\nSo if hypothetically you go spend $50 at a department store and it's using your Bitcoin but paying with Fiat where did the Bitcoin come from and where was it purchased from? Wouldn't you have to load up the account from somewhere where it was Bitcoin and are you not spending the Bitcoin at some point at least? Or is this where LVL comes in? I looked at their website but It doesn't really answer the question.\n\nWould you have 0.001692(50$ worth currently) less Bitcoin on a wallet somewhere?\n\nWhether you're converting to Fiat or paying for a product in Bitcoin both are taxable events, so I still don't understand. So what is the process next year if you use Strike and bought let's say bought $5,000 worth of goods within 50 transactions in regards to filing taxes?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9gyuhp",
                                            "author": "senfmeister",
                                            "score": 1,
                                            "created_utc": 1653153995.0,
                                            "response": ">So if hypothetically you go spend $50 at a department store and it's using your Bitcoin but paying with Fiat where did the Bitcoin come from and where was it purchased from?\n\nYou hold dollars with Strike, and you spend dollars with Strike. They reduce your dollar balance and send the market value in sats. They're the ones doing a dollar to bitcoin or bitcoin to dollar conversion, and thus have any tax consequences.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9gzdhi",
                                                    "author": "redhtbassplyr",
                                                    "score": 1,
                                                    "created_utc": 1653154233.0,
                                                    "response": "Okay making more sense. But what if you already own Bitcoin elsewhere like I do. I have plenty to use for spending and saving, but the moment I were to transfer any of it into Strike from where it exists currently it would then be a taxable event. Would this only work with buying Bitcoin directly through Strike then?\n\nOr would I be able to use my existing Bitcoin somehow without a capital gain tax?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9h07rx",
                                                            "author": "senfmeister",
                                                            "score": 2,
                                                            "created_utc": 1653154626.0,
                                                            "response": "No. Strike isn't a way to spend your existing sats without capital gains. That's not possible. It's a way to spend dollars and the receiver gets sats without complicating your (the sender's) taxes. \n\nYou can also buy Bitcoin on Strike, but sending any Bitcoin you've purchased there to pay for something is the same kind of taxable event as spending Bitcoin you already have.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9h0t5o",
                                                                    "author": "redhtbassplyr",
                                                                    "score": 1,
                                                                    "created_utc": 1653154895.0,
                                                                    "response": ">No. Strike isn't a way to spend your existing sats without capital gains. That's not possible.\n\nThat's what I was thinking, but yeah in this case I go back to my first comment and that's why I keep it contained to larger purchases. I have to calculate all those capital gains at the end of the year and it gets crazy. I started hiring a CPA 3 years ago because it was just too much for me to go through, but still I'm not trying to make it anymore difficult for her as then she'll probably want to charge me more money. The amount of money I had to start paying for crypto tax programs though with the amount of transactions and taxable events became more than the cost of hiring a CPA so what was the point and even doing it myself at that point you know?",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9h5x0o",
                                                                            "author": "Imaginary-Friendship",
                                                                            "score": 2,
                                                                            "created_utc": 1653157277.0,
                                                                            "response": "If you are no longer DCA’ing into bitcoin then, yeah, there’s not a good way I know of that’ll track your cap gains in a smooth way.\n\nIf you are DCA’ing then just use Strike to hold some of the fiat in anticipation of spending it via lightning (that’s how I do it). Sure, the fiat will sit there as fiat, but with recent dip in price that doesn’t seem to be too big of a deal (I usually only would have a few days worth of fiat in Strike anyway).\n\nIf you want to hold it as Bitcoin but spend as fiat then LVL is good for that as it tracks the cap gains for you. Only bummer with LVL (as far as I know) is that you can’t spend the bitcoin at retail and have the cap gains calculated - it only does the tracking between btc/fiat conversion. \n\nLVL doesn’t really help in the “circular economy“ situation, I just mention it since it seems like it‘s a possible solution for someone that is #getOnZero - they are also working on a new beta tool, so maybe that would track cap gains on bitcoin transactions (idk)?\n\nMaybe someone will build a better tool for tracking cap gains - that’d be slick. I’d love to see a tool that would do that with a self-custody wallet. It’d be cool to have a wallet/tool that would do some kind of “tax loss harvesting” letting you know when to spend your bitcoin or not, for example, to offset previous gains.\n\nAnyway, my “big” stack just stays where it is until I’m FIRE, btc tax treatment changes, or I move to country without cap gains on btc. But, I do want to get the circular economy thing going so Strike (using fiat) is a great way to be part of that, IMO.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i9h8o6g",
                                                                                    "author": "redhtbassplyr",
                                                                                    "score": 0,
                                                                                    "created_utc": 1653158603.0,
                                                                                    "response": ">If you are DCA’ing then just use Strike to hold some of the fiat in anticipation of spending it via lightning\n\nI am but I don't want to just do something to do something if it has no financial advantage to me. I have a lot going on with a newborn baby amongst a million other things and such and I don't have the time patience or will to just take extra steps just because my time is precious. \n\nAlso I try to make my money work for me and almost exclusively use credit cards for the advantage of rewards with paying off balances monthly. \n\nI do hope the space matures though and more tools do become available for tax calculations as it really is annoying. For now I'll just stick to larger purchases if anything even though I don't really anticipate any large purchases with Bitcoin in the foreseeable future. I might use some for a piece of property here in another 3-5 years or so but can't think of anything prior to that. Most of my holdings are just that holdings for my retirement and for my kids. Not trying to spend too much but just enough to responsibly take some profits every now and then. \n\nThis is an example of my only purchase last year. Coming from my different username that I use to post things.\n\nhttps://www.reddit.com/r/Bitcoin/comments/nso9mq/its_no_lambo_but_it_was_purchased_with_bitcoin/?utm_medium=android_app&utm_source=share",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i9hfgt6",
                                                                                            "author": "senfmeister",
                                                                                            "score": 1,
                                                                                            "created_utc": 1653161915.0,
                                                                                            "response": ">I am but I don't want to just do something to do something if it has no financial advantage to me.\n\nYou can fund Moon cards with dollars from Strike and get 5% back. You're restricted to paying merchants in the US with the cards if that's a dealbreaker. You can add them to Apple/Google Pay to use them in-person, too.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9h2wkq",
                    "author": "n8dahwgg",
                    "score": 1,
                    "created_utc": 1653155855.0,
                    "response": "Spend and replace",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9hc49k",
                    "author": "roxi0n",
                    "score": 1,
                    "created_utc": 1653160276.0,
                    "response": "It makes no sense for me to sell Bitcoin right now, since I have invested more usdt in it than I will get from selling it now.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9hfdyn",
                            "author": "Boe_Ning",
                            "score": 1,
                            "created_utc": 1653161876.0,
                            "response": "I think you're missing the point of the post.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9hcs7y",
                    "author": "Aggressive-Collar882",
                    "score": 1,
                    "created_utc": 1653160602.0,
                    "response": "Investing is a way to set aside money while you are busy with life and have that money work for you so that you can fully reap the rewards of your labor in the future. Invest wisely.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9hf9i3",
                            "author": "Boe_Ning",
                            "score": 1,
                            "created_utc": 1653161815.0,
                            "response": "How is your definition of \"investing\" relevant to this post?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9hibo0",
                    "author": "AlphaGainzzz",
                    "score": 1,
                    "created_utc": 1653163332.0,
                    "response": "I agree fully, this is what I do as well. Keep most in cold storage but have some handy to spend",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9hk2mb",
                    "author": "DudeIncogneto",
                    "score": 1,
                    "created_utc": 1653164195.0,
                    "response": "I agree, if the option is available to purchase or donate with bitcoin I usually choose that option.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9gs9tt",
                    "author": "Ok-Imagination-7014",
                    "score": 0,
                    "created_utc": 1653151016.0,
                    "response": "I think there are two phases. We are in the holding phase. Then when btc get adopted and become closer to “the standard” of you will then that’s when spending of the btc will occur. But that’s just my opinion and opinions are like assholes everyone has one",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9gtd3d",
                            "author": "Boe_Ning",
                            "score": 3,
                            "created_utc": 1653151512.0,
                            "response": "Adoption doesn't happen by itself - increased utilization is required to get to your second phase. Help drive adoption by keeping some spending money in BTC within a Lightning wallet.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9h8y7e",
                                    "author": "Ok-Imagination-7014",
                                    "score": 1,
                                    "created_utc": 1653158738.0,
                                    "response": "Good point I’ll shut up lol",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "id": "uuqmb1",
            "title": "Just a friendly reminder that tomorrow is International Bitcoin Pizza Day!",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uuqmb1/just_a_friendly_reminder_that_tomorrow_is/",
            "author": "hashe121",
            "created_utc": 1653150512.0,
            "score": 15,
            "num_comments": 4,
            "subreddit": "Bitcoin",
            "selftext": "The only red thing that you should be thinking about tomorrow is the added tomato sauce!  \n\n\nEnjoy!",
            "stickied": false,
            "comments": [
                {
                    "id": "i9gyawm",
                    "author": "senfmeister",
                    "score": 3,
                    "created_utc": 1653153751.0,
                    "response": "[ln.pizza](https://ln.pizza) is handy to help celebrate",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9hsttw",
                            "author": "VeryKnave",
                            "score": 1,
                            "created_utc": 1653168599.0,
                            "response": "US only :(",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9hp446",
                    "author": "Vipu2",
                    "score": 1,
                    "created_utc": 1653166704.0,
                    "response": "Finally, was waiting whole month to get my first pizza on btc pizza day (been in btc since 2021)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9i0t7y",
                    "author": "bitroll",
                    "score": 1,
                    "created_utc": 1653172733.0,
                    "response": "I used to celebrate this day, but now I can't even find a way to order a pizza with btc. I know, it was mostly bitpay, but better than nothing. \nThings are going backwards, the places that took bitcoin in the past years stop doing so and no new ones appear. The only way now is buying giftcards. What's next, in a few years, asking on a forum whether someone will buy me 2 pizzas for 10,000 satoshis? (I'm still bullish on the price)",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}