{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "utg0iy",
            "title": "I feel a bit sad after an argument in r/Buttcoin. Any advice welcome.",
            "url": "https://www.reddit.com/r/Bitcoin/comments/utg0iy/i_feel_a_bit_sad_after_an_argument_in_rbuttcoin/",
            "author": "seaklate",
            "created_utc": 1653002920.0,
            "score": 9,
            "num_comments": 72,
            "subreddit": "Bitcoin",
            "selftext": "I am more or less new to reddit and never had a negative experience here. It was a bit naive to think a discussion with the Buttcoiners would have a positive outcome.\n\nWell... it ended in an endless discussion which ultimately ended in kind of personal attacks.\n\nNow I feel kind of sad and can honestly not understand why people over there think they are so reflected and know what they are talking about. I can understand that it like two opposites coming together, but am I really so blind to not understand what they are hating about? It feels like for them everything related to \"blockchain\" is the same. Bitcoin is the biggest scam and a disease. Everyone is a \"moonboy\".\n\nPlease see the tragedy at: https://www.reddit.com/r/Buttcoin/comments/usuvvf/hahah_hahahahahahahaha/?utm_medium=android_app&utm_source=share\n\nPlease be so kind to not put more hat on me if you think I am too tearful here. I am already confused with a bitter feeling of \"internet hate discussion\".\nI would be happy to see your personal point of view on this dynamics.",
            "stickied": false,
            "comments": [
                {
                    "id": "i99iuf0",
                    "author": "GLCstaked",
                    "score": 44,
                    "created_utc": 1653003430.0,
                    "response": "Copying what I posted recently, on another thread. It will help you better understand what buttcoin is about.\n\n\"Yes, I've followed for years, I find it fascinating, it's so obvious that at the core is bitterness of having missed out in some way. Bitcoin and crypto are voluntary networks, you choose to participate and if not just ignore it.\n\nI've never liked football, I kind of hate it. I cant imagine joining a community of other football haters to talk daily, comment, and make content. In order to keep up I have to watch football matches, keep up to date with the scores, read the latest football news. And talk about it with my fellow football haters, all the while believing (wishing) that world will wake up and realize how stupid football is and it will eventually go away to zero.\"",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i99oigw",
                            "author": "Bkokane",
                            "score": 21,
                            "created_utc": 1653006325.0,
                            "response": "I got banned for pointing this out to them haha. The football analogy is spot on 👌",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i99jj1l",
                            "author": "seaklate",
                            "score": 11,
                            "created_utc": 1653003778.0,
                            "response": "Amazingly ironic what you wrote there. I also thought that it is very strange they spend so much time and effort to hate on something so unimportant like BTC.\nBut then, they do not differentiate between anything in this space. What tf has BTC to do with any soandso nft? The hate is strong there.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i99qclv",
                            "author": "j_kPoV",
                            "score": 7,
                            "created_utc": 1653007256.0,
                            "response": "That’s a great analogy actually, well said!",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9ab3ka",
                            "author": "drrgrr123",
                            "score": 5,
                            "created_utc": 1653017703.0,
                            "response": "It goes the other way around too. \n\nIf there was a anti football sub, why would you go there to argue about why you think it's a great sport? Just leave them alone.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9aayng",
                            "author": "theplushpairing",
                            "score": 2,
                            "created_utc": 1653017629.0,
                            "response": "Bravo!",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9apb1p",
                            "author": "JeremyLinForever",
                            "score": 1,
                            "created_utc": 1653027062.0,
                            "response": "Well, football never gave people the chance at life changing amounts of financial freedom. So naturally, those who are in the buttcoin sub in my opinion are the ones who are the most self destructive. I kind of feel bad for them and their mental health to be honest.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9aqc0j",
                            "author": "mfitzp",
                            "score": 1,
                            "created_utc": 1653027848.0,
                            "response": "This analogy only works if football is a scam.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i99i3d9",
                    "author": "Nada_Lives",
                    "score": 18,
                    "created_utc": 1653003051.0,
                    "response": "Don't go there?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i99i61d",
                            "author": "seaklate",
                            "score": 7,
                            "created_utc": 1653003089.0,
                            "response": "I will never do so again. I should have known better.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9ab1wg",
                                    "author": "theplushpairing",
                                    "score": 5,
                                    "created_utc": 1653017678.0,
                                    "response": "The crappy part is reddit keeps suggesting posts from there because it’s “about crypto”",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i99ijlr",
                            "author": "ducasaurus",
                            "score": 5,
                            "created_utc": 1653003278.0,
                            "response": "Yeah, don't feed the trolls.  \nIndifference is the best reaction towards that crowd.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9ags1q",
                                    "author": "Nada_Lives",
                                    "score": 2,
                                    "created_utc": 1653021093.0,
                                    "response": "Works on fiat promotions too!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9ag49n",
                            "author": "rqzerp",
                            "score": 2,
                            "created_utc": 1653020674.0,
                            "response": "Honestly the best answer. Why go there in the first place. Honestly, sometimes I look at their posts to laugh at how dumb they are but I wouldn't want to talk to them.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i99i64k",
                    "author": "GetRichOrDieTryinnn",
                    "score": 34,
                    "created_utc": 1653003090.0,
                    "response": "Relax bro, welcome to the club.\nI got downvoted thousands from those morons and today, after I left the sub page, I got banned and the mod message to me was “fuck off”.\n\nThey have a deep hate in them because they missed out and have the dumbest arguments yet they are amazing at gaslighting.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i99rwr5",
                            "author": "konokonohamaru",
                            "score": 16,
                            "created_utc": 1653008036.0,
                            "response": "Any community that defines itself by what it's against and not what it's for is bound to be full of hate.\n\nShake the dust off your feet and move on.  You've made your argument and they can either take it or leave it.  Who knows, maybe you opened some lurker's eyes.  Life's too short to bother with trying to convince the blind",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i99lukg",
                            "author": "seaklate",
                            "score": 8,
                            "created_utc": 1653004967.0,
                            "response": "This is what my impression was. A strange anti cult that acts like friendly guy trying to prevent others from losing on another shitcoin project but without any good intentions.\n\nThe \"f off\" says a lot.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i99k3k1",
                            "author": "Keith_Kong",
                            "score": 7,
                            "created_utc": 1653004066.0,
                            "response": "Talking to them feels like running into a Scientologist… nothing but pure frustration and annoyance can emerge.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i99kxdi",
                    "author": "bitcoin_islander",
                    "score": 6,
                    "created_utc": 1653004493.0,
                    "response": "Dont feed the trolls. Everyone buys bitcoin at the price they deserve. I bought my first bitcoin at $1K but heard about it when it first reached par with the dollar in 2011. Did that make me a bitter buttcoiner? Nope.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ab7dx",
                            "author": "theplushpairing",
                            "score": 3,
                            "created_utc": 1653017762.0,
                            "response": "I remember reading about in 2012 or 2014 going to $400 and I was like “welp I missed the boat”… now I just bought my first at $30k",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9aqu2j",
                                    "author": "bitcoin_islander",
                                    "score": 1,
                                    "created_utc": 1653028245.0,
                                    "response": "Yup, feels bad but oh well. Some people won't buy till $1m bitcoin.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i99nvqv",
                    "author": "Bkokane",
                    "score": 7,
                    "created_utc": 1653006007.0,
                    "response": "You ever watch Spider-Man? You know the guy that works at the Daily Bugle newspaper, J. Jonah Jameson? And no matter what Spider-Man does, good or bad, he spins it that Spider-Man is a criminal, a menace to society and needs to be stopped? That’s r/Buttcoin.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i99ow0f",
                    "author": "MaximumStudent1839",
                    "score": 5,
                    "created_utc": 1653006516.0,
                    "response": "A lot of buttcoiners are just buy-high-sell-low burnouts. You can’t convince low IQ bitter folks. So don’t waste your time.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i99n4hf",
                    "author": "ADMIN",
                    "score": 5,
                    "created_utc": 1653005618.0,
                    "response": "The last few years have opened my eyes to just how stupid most people are. Try to not let it get you down OP. You’ll be rewarded for thinking differently eventually. You just can’t help these people unfortunately.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i99imal",
                    "author": "kevm0",
                    "score": 8,
                    "created_utc": 1653003316.0,
                    "response": "Close your eyes and imagine a world in which no matter how sound your reasoning is, there are those who will oppose it vehemently and to the point of mania. Now open your eyes. You are in that world. Shake it off. Your argument was sound, at the end of the day that’s all you can do. Typically the more low brow the discussion becomes it’s that side’s way of saying I have nothing left to resort to but anger and insult. You have won this exchange.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i99j5vj",
                            "author": "seaklate",
                            "score": 6,
                            "created_utc": 1653003592.0,
                            "response": "Thank you for this opinion. It feels good to have a reference that at least someone wants to understand what I wrote there.\nI understand, I feel so strange due to the disturbance of my strong believe, but I really found their arguements unfair, beside from one excemption. It was illusional to think I could I could make someone think about the basic ideas working within BTC.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i99j3vb",
                    "author": "WritingFun8769",
                    "score": 3,
                    "created_utc": 1653003564.0,
                    "response": "go read some commentary from satoshi or hal or something and relax. there were people adamantly against the internet, just remember that.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i99kr3e",
                            "author": "seaklate",
                            "score": 1,
                            "created_utc": 1653004402.0,
                            "response": "This is some high quality advice for even higher quality content:)",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i99k0ze",
                    "author": "solomonsatoshi",
                    "score": 3,
                    "created_utc": 1653004029.0,
                    "response": "Remember always that when trolls resort to personal attacks rather than addressing the facts and issues raised they are admitting they cannot cope with and respond convincingly to those facts and issues.\n\nThey therefore concede defeat in terms of a respectful sound logical and reasoned contest of ideas. They are sad deluded trolls. Pity them. They are diseased.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i99k19u",
                    "author": "vitalyevodin",
                    "score": 3,
                    "created_utc": 1653004033.0,
                    "response": "they feel like older brother that thinks he always right regardless how smart you talk he just always knows some tricks to make you feel wrong or continue overthinking",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i99kvdn",
                    "author": "NiceDoctorBeam",
                    "score": 3,
                    "created_utc": 1653004464.0,
                    "response": "You'll be okay pretty soon.  \n\nSomething I've learned about trolls: They want to hurt people.  \n\nThey want to hurt somebody, any way they can.  They are fucked up, as in, mentally ill.  \n\nThey'll give dangerous advice in a fitness discussion, hoping to encourage a stranger to physically harm themself.  That is sick.  \n\nSame thing for nutrition, medical advice.  \n\nThey'll use any opportunity to hurt someone's feelings.  Or, they'll try to get somebody to become upset, frustrated, angry.  \n\nThey also like to try to get people to do things to harm themself financially.    \n\nThey'll lie, lie, lie.  You can catch them in their lies, they really won't care.  \n\nRemember: those people are mentally ill.  They almost certainly have brain damage from blunt force trauma - somebody hit them in the head when they were little, or they had an accident - or they've damaged their brains with drugs toxic chemicals.  Feel bad for them.  If you could see the scars on their brains, you'd feel bad for them.  Be glad you're not somehow related to them, or that they're not your boss or coworker or neighbor.  Be glad you're not one of them.  \n\nI've discovered ways to make them upset, but it's not worth the time.  And, if you really get under their skin and you ever get doxxed, you could find yourself in physical danger.  And if they know/think you have Bitcoin, even worse.  \n\nBest thing is to learn to routinely be happy for everything.  Be happy for nice, warm, sunny days.  Be glad for cold, stormy days.  Lots of things happen to us - look for the lessons.  I like to go for a walk in the evening/afternoon and ask, \"What did I learn?\"",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i99lidg",
                            "author": "seaklate",
                            "score": 1,
                            "created_utc": 1653004794.0,
                            "response": "You know, it really helps to read that I am not alone im my desperate attempts to get behind all that. I of course understand that opinions can be diffenerent but this experience was a bit different. In the end I even became way more unfriendly that I wanted to, but I feld a bit overwhelmed to be honest.\n\nI might integrate this lesson and probably try to step aside from reddit a bit. I think it is a source of doubt lately. But be sure, your helping words were heard:)",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i99o4yr",
                                    "author": "NiceDoctorBeam",
                                    "score": 2,
                                    "created_utc": 1653006133.0,
                                    "response": "Yes.  \n\nThey are cowards; they like to gang up.  \n\nThey really don't care about what is actually true.  \n\nFacts only mean something when they can use a fact against you.  Same with logic.  \n\nThey pretend to be happy, laughing out loud, well off, getting lots of great sex...  They aren't.  In real life, they're miserable, and lonely.\n\nSome of them have been at it a long time, and they're very good at being a troll.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i99o5p3",
                    "author": "KMan471",
                    "score": 3,
                    "created_utc": 1653006143.0,
                    "response": "Insults, attacks, and cheap shots are the tools of a mind, running empty on ideas.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i99p8zl",
                    "author": "kidcoodie",
                    "score": 3,
                    "created_utc": 1653006701.0,
                    "response": "That sub is cancerous as fuck. They may dislike Bitcoin, which is fine. They’re allowed to. But Jesus they are hateful people, they love watching people suffer. They literally created a sub designed to hate on other people. That says a lot about them.\n\nI lurk there a lot and nobody really wants to have a discussion. If you’re not against Bitcoin, they go for the throat. It’s funny they call us cultists, but they exhibit the same behavior as a collective in that sub.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i99v06n",
                    "author": "Namkab",
                    "score": 3,
                    "created_utc": 1653009567.0,
                    "response": "I think of it like this. They literally have nothing better to do with their time than to hate on something they could simply ignore. Not the brightest thought process. It's like walking into a golf tournament and going \"you guys are all dumb for playing golf\" when you could simply ignore the golf tournament. Probably oversimplified but I don't spend my time hating and I have to wonder why some people have nothing better to do than to dwell and hate on something another person is doing.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9a65cw",
                    "author": "Mallardshead",
                    "score": 3,
                    "created_utc": 1653015051.0,
                    "response": "I was kicked off after one post. Really got under their skin playing a guy that listened to his professor when BTC was $5k. Worked through the mainstream talking points dismantling each one. I included pictures of current living situation versus opportunity cost living standards which sent them apoplectic",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ajhgo",
                    "author": "TheHipHouse",
                    "score": 3,
                    "created_utc": 1653022863.0,
                    "response": "They want it to go to 0 because they don’t have the confidence to get into crypto. They are followers not leaders",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i99jq8o",
                    "author": "SirSkittles111",
                    "score": 5,
                    "created_utc": 1653003879.0,
                    "response": "Who gives a shit what the future lower class people have to say, they were given plenty of time to readjust their opinions, by the time they realise they were wrong its already too late.\n\nI occasionally go to that sub to laugh at the room temperature IQ people in there, dont take anything they say to heart.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i99k5p0",
                            "author": "seaklate",
                            "score": 1,
                            "created_utc": 1653004096.0,
                            "response": "This adresses a good point, I think.\nI see a good chance that the existing system and society will fail to adopt or allow BTC to be there for them. But IMHO it is a completely different thing to see something prevail through history or the see the potential for it to do so and serve for the greater good... isn't it?\n\nIn the end they might be laughing and will never know better.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i99nc8p",
                    "author": "Regret-Select",
                    "score": 2,
                    "created_utc": 1653005729.0,
                    "response": "Seems like a group dedicated to puts on bitcoin\n\nIsn't that their objective after all?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i99qluq",
                    "author": "Stocksugardaddy",
                    "score": 2,
                    "created_utc": 1653007387.0,
                    "response": "\"don't argue with fools\".",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9aj68g",
                            "author": "kevinono",
                            "score": 2,
                            "created_utc": 1653022652.0,
                            "response": "...they will win with experience",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i99wvoq",
                    "author": "No-Lemon-2287",
                    "score": 2,
                    "created_utc": 1653010475.0,
                    "response": "One of their main arguments is bitcoin’s waste of energy, which is hilariously ironic.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i99xeid",
                    "author": "turick",
                    "score": 2,
                    "created_utc": 1653010726.0,
                    "response": "Research stoacism. You'll never be able to control faceless assholes on the internet. And you aren't obligated to reply to everyone who replies to you. Remove your personal feelings and emotions from reddit. Limit yourself to a single comment at all times  and never get in a tit-for-tat, in-depth argument with anyone. Speak your mind, then walk away.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i99y75p",
                    "author": "life762",
                    "score": 2,
                    "created_utc": 1653011111.0,
                    "response": "Just take solace in the fact that those weenies will always stay poor.\n\nPity them.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i99yjr7",
                    "author": "Jazzlike-Lion2969",
                    "score": 2,
                    "created_utc": 1653011282.0,
                    "response": "I went down the tulip rabbit hole with them… got nowhere. They just kept saying it’s a bubble, you don’t know how bubbles work etc.\nI’ve been in the stock market since the 90s. So, I am familiar with bubbles.\nThey are the minority. The Reddit and other crypto Reddits have 10 times the members. \nThey just don’t get it",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i99yudd",
                    "author": "arbalest_22",
                    "score": 2,
                    "created_utc": 1653011422.0,
                    "response": "They are all self hating losers they can’t help it. lol",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9a6oyj",
                    "author": "ndgoLiberty",
                    "score": 2,
                    "created_utc": 1653015332.0,
                    "response": "Don’t even try. Their world is based in a strange reality where bitcoin is just another “cRyPtOe” it isn’t. Heck bitcoin demonetizes gold. It’s not on the same level that buttcoiners think it is.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9a8gmf",
                    "author": "Environmental_Ring93",
                    "score": 2,
                    "created_utc": 1653016260.0,
                    "response": "I went to the doctor and told him I had broken a bone in two places- \n\nHe said - “better stay away from those places!”",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9a9ano",
                    "author": "VPNApe",
                    "score": 2,
                    "created_utc": 1653016717.0,
                    "response": "I actually got very interested in buttcoin when I heard what it was all about. \n\nIt didn't look to me like they could come up with a coherent bear case for Bitcoin which is something I really would've liked to have read. Instead, I found that 99% of the sub is either making fun of price swings, shit coins, or monkey jpeg nft's.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9acwh8",
                    "author": "bobbyv137",
                    "score": 2,
                    "created_utc": 1653018730.0,
                    "response": "If the wider markets crash and BTC goes well below $20k as many are predicting, you can bet some of them will be buying in for the first time.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ag1yk",
                    "author": "deadweight999",
                    "score": 2,
                    "created_utc": 1653020633.0,
                    "response": "fl@m3 w@rz",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ahi62",
                    "author": "ashareah",
                    "score": 2,
                    "created_utc": 1653021557.0,
                    "response": "Intersting sub, better than a single echo chamber. It helps to see different opinions.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ajomh",
                    "author": "jonesmatty",
                    "score": 2,
                    "created_utc": 1653022997.0,
                    "response": "I went to /u/Fedcoin to talk to them about a money that is for the people and they all got mean and hateful at me. They think I'm nuts that people can have and manage their own money.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9akxb1",
                    "author": "SoupyAT",
                    "score": 2,
                    "created_utc": 1653023863.0,
                    "response": "Reality is the same would happen if they came here. Are you also new to the internet?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9alnli",
                    "author": "BTCMachineElf",
                    "score": 2,
                    "created_utc": 1653024368.0,
                    "response": "Buttcoiners are not there to discuss the ins and outs of bitcoin. They're there because they actively hate it on a personal level. It is emotional for them.\n\nSo no matter how reasoned you are, if you dissent to their opinion, you will get hit by that emotion.\n\nSomeone who didn't care wouldn't be there. They care *a lot*. In the opposite direction. They really really want us to fail. \n\nDon't take it personally. Don't be like them.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9am3t0",
                    "author": "JessicaMango1444",
                    "score": 2,
                    "created_utc": 1653024695.0,
                    "response": "There is nothing stopping those people from being someone's employees, professionally confusing the story around crypto.\nThey post and comment every single day, reliably, with hours of activity that amount to a full time job.\nPersonal attacks is one of the [tactics](https://www.reddit.com/r/Superstonk/comments/mulstf/cointelpro_techniques_for_dilution_misdirection/) used by disinformation agents online. \n\nI pointed out the regularity of some user's content (7-12 posts, 30-50 comments a day, every day) and was banned from that sub lol\n\nSeriously memorise that list and you'll start to see these types of behaviours in many reddit accounts, particularly in finance related forums, and particular from accounts with many hundreds of hours of activity logged.\nIt sucks that the internet is like this now, but the more people know about it, the harder it will become to spread disinformation online. \n\n(To be clear I don't believe every user on buttcoin is paid, that would be unreasonable, but the most prolific contributors may well be. Could easily be hired by some mundane ad company to send people to 3rd party sites all day, not some overarching shady scheme from the world bank)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9am8eb",
                    "author": "osogordo",
                    "score": 2,
                    "created_utc": 1653024789.0,
                    "response": "Back in 1995, many people thought that the Internet would be just a fad, even  smart people like [Bill Gates](https://www.inc.com/tess-townsend/what-bill-gates-got-wrong-about-the-internet-in-the-1990s.html) and [Clifford Stoll](https://www.newsweek.com/clifford-stoll-why-web-wont-be-nirvana-185306).\n\nWhen you're still at an early phase, you have a lot more detractors.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9amkpe",
                    "author": "deadontheinternet",
                    "score": 1,
                    "created_utc": 1653025032.0,
                    "response": "Bro just look at the average amount of active users there vs here. If it wasn’t for this sub that one wouldn’t even exist, the mods here will delete anything at the first mention of a shitcoin they should do the same with any mention of buttcoin. This sub and (no offense) posts like these are the #1 way anyone even finds out about that sub. If we stop giving that shit attention it will cease to exist\n\nEdit: I recently came across another sub antinatalism, for people who are completely against anyone having kids. This sub is essentially the exact same thing as buttcoin. A complete waste of time. It’s like you’re against this? Ok?... great? You really think it’s ever going to stop? You’re wasting a huge amount of energy hating something that the majority of people wont care about no matter how loud you are about it",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9andhx",
                    "author": "wintermute-89",
                    "score": 1,
                    "created_utc": 1653025616.0,
                    "response": "the irony is, I keep getting post suggestions from there.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9antei",
                    "author": "wwmore11",
                    "score": 1,
                    "created_utc": 1653025942.0,
                    "response": "Buttcoin is a lost cause. Time better spent talking in economic subs where actual intelligent debate and education can take place. Buttcoin lights up anytime bitcoin takes a beating, and fishes for any excuse why it’s upward momentum is a farce when it’s in a bull run. Most members act like they know everything and are 100% certain that bitcoin will fail. The sub has existed for ELEVEN years. Let that sink in a bit. Bitcoin traded at sub $10. They’ve been screaming about it’s inevitable failure for that long. They pay no mind to the adoption and development of the infrastructure for usage of cryptocurrencies, especially bitcoin, nor the rapid attraction of investment money into the space. Many are still stuck on the “criminal” use rhetoric of 7 years ago. It’s a boring, tired, and sad sub of scared fools who mostly are bitter because they’ve wasted away opportunity on the sidelines playing it safe. They refuse to admit that while bitcoin and blockchain are highly speculative, and very much still in a proof of concept phase of adoption, that they could be wrong. How could they be wrong? Because unfortunately for them, no matter how much they scream, the more people that choose to take a chance on bitcoin, the harder it will be to unravel its existence. The future is unknown, bitcoin certainly could fail, but the past eleven years have shown that sub is truly a haven for sore losers.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9aqglx",
                    "author": "zfride",
                    "score": 1,
                    "created_utc": 1653027948.0,
                    "response": "... I mean ... they call themselves BUTTcoiner lol ...",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ar3ki",
                    "author": "BusinessBreakfast3",
                    "score": 1,
                    "created_utc": 1653028453.0,
                    "response": "Your arguments were great. \n\nDon't debate people on their turf.\n\nYour \"Remind Me\" (the 10 year one) is enough.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i99ru9g",
                    "author": "soundssarcastic",
                    "score": 2,
                    "created_utc": 1653008001.0,
                    "response": "\"I went somewhere they were going to ridicule me and am upset that I was ridiculed\" is peak reddit.\n\n Good luck irl",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9aoywy",
                    "author": "Zahpow",
                    "score": 1,
                    "created_utc": 1653026804.0,
                    "response": "First of all, if you want to discuss something it is better to use a thread that is actually about.. Something. You hijacked a meme to soapbox, you would probably have been better off starting your own post dedicated towards it. \n\nSecond, the literal first thing you say is calling us dogmatic idiots. If you want to actually debate in a space hostile to your opinion, maybe a polemic approach is not the way to go? \n\nThirdly, avoid screeds. It is very difficult to respond to rants and you are doing yourself a disservice when you allow the opposition to just pick the easiest thing you just said and reply to that. \n\nHope that helps!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ar7vg",
                    "author": "dlq84",
                    "score": 1,
                    "created_utc": 1653028546.0,
                    "response": "They are sad people with nothing going on in their lives, so they spend all their time being negative and circlejerking.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9arec2",
                    "author": "ThatGuy168",
                    "score": 1,
                    "created_utc": 1653028688.0,
                    "response": "Had no idea buttcoin was thing that’s kind of funny, either way wider btc adoption is close to inevitable and the endeavours of the buttcoin sun just spread the word",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "utfs0q",
            "title": "The Modern Financial System that Prints and Manages Our Money is a Debt-Based Pyramid Scheme and an Investment-Based Ponzi Scheme With Extra Steps",
            "url": "https://medium.com/coinmonks/the-modern-financial-system-is-a-debt-based-pyramid-scheme-and-an-investment-based-ponzi-scheme-e37c4154b9",
            "author": "ThrowAwaydntopnddins",
            "created_utc": 1653002177.0,
            "score": 62,
            "num_comments": 8,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i99qgc0",
                    "author": "ThrowAwaydntopnddins",
                    "score": 8,
                    "created_utc": 1653007309.0,
                    "response": "Start of the article summarizing what it goes through: \n\n>After a couple of years of studying ₿itcoin and the US Dollar that I was raised to trust like it was some faceless god, I eventually started valuing everything in Bitcoin’s Satoshis instead of the US Dollar.\r  \n\r  \nThe biggest reason wasn’t because of Bitcoin either. It was the US dollar’s system that did it to me. Once I learned what the system was and how it functioned, I could no longer value anything in dollars after realizing how fast they were exponentially losing value.  \n>  \n>The US dollar is a system that is burning up its own value with every new dollar that is digitally issued and shoved into the bank accounts of the top 1% of the world. It is shoved into their accounts whenever they need to get a new bank bailout loan or corporate bond loan.  \n>  \n>They then take that new money and freeze it into their own portfolio’s asset holdings. Jumping ship from the dollar while the loan/money printing process that got them those dollars, melts away the buying power of everyone else’s US Dollar savings.  \n>  \n>This process leaves almost none of that newly printed money liquidity to trickle down to those at the bottom that are relying on the dollar.  \n>  \n>Dollars that are perpetually being devalued thanks to the digital printing of trillions of new dollars, trillions of new dollars that are issued through loans acquired by the top 1% for their asset hoarding greed.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i99jq0x",
                    "author": "Dry-Cardiologist2187",
                    "score": 3,
                    "created_utc": 1653003875.0,
                    "response": "the real question is is it going to collapse before Tether collapses or not?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9a00wn",
                    "author": "coinfeeds-bot",
                    "score": 2,
                    "created_utc": 1653012004.0,
                    "response": "tldr; The US dollar is a system that is burning up its own value with every new dollar that is digitally issued and shoved into the bank accounts of the top 1% of the world. This process leaves almost none of that newly printed money liquidity to trickle down to those at the bottom that are relying on the dollar. The government is often forced to give out massive corporate loans that cause the printing of new money.\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i99kasq",
                    "author": "MiguelLancaster",
                    "score": -1,
                    "created_utc": 1653004167.0,
                    "response": "anyone can publish on Medium and goddamn does it sure show",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i99q639",
                            "author": "ThrowAwaydntopnddins",
                            "score": 7,
                            "created_utc": 1653007165.0,
                            "response": "This writer's article was also published on teh Nasdaq, with sources to back up their claims: \n\nhttps://www.nasdaq.com/articles/bitcoin-fixes-the-modern-fiat-ponzi-scheme-2021-09-14",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9aquyu",
                    "author": "NearbyTurnover",
                    "score": 1,
                    "created_utc": 1653028265.0,
                    "response": "Like taxes.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9bihfs",
                    "author": "feyyd",
                    "score": 1,
                    "created_utc": 1653048946.0,
                    "response": "Even if BTC fails, it has educated so many people on how irresponsible fiat is, and is starting to expose how dangerous economic policy has been the last 100 years.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "utfx93",
            "title": "From the 1970s through 2000s under CEOs Bill Gates and Steve Ballmer, Microsoft viewed the community creation and sharing of communal code, later to be known as free and open source software, as a threat to its business, and both executives spoke negatively against it",
            "url": "https://en.wikipedia.org/wiki/Microsoft_and_open_source",
            "author": "hyperinflationUSA",
            "created_utc": 1653002625.0,
            "score": 64,
            "num_comments": 8,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i99hk7f",
                    "author": "hyperinflationUSA",
                    "score": 7,
                    "created_utc": 1653002781.0,
                    "response": "banks rn against bitcoin\n\nbill gates rn talking shit on bitcoin",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9bdu8p",
                            "author": "Quiet-Curve9919",
                            "score": 1,
                            "created_utc": 1653046431.0,
                            "response": "He is a creep.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9agssk",
                    "author": "tradone",
                    "score": 6,
                    "created_utc": 1653021106.0,
                    "response": "Is that why he doesnt open source his time in Epstein island?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i99y2e3",
                    "author": "ralphyb0b",
                    "score": 2,
                    "created_utc": 1653011047.0,
                    "response": "They even made a crappy movie about it with Tim Robbins playing a pseudo Bill Gates.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9b96a8",
                    "author": "OtherDetective",
                    "score": 2,
                    "created_utc": 1653043521.0,
                    "response": "Bill Gates name is ruined. Nobody really looks up to him.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ayg07",
                    "author": "infopocalypse",
                    "score": 1,
                    "created_utc": 1653034789.0,
                    "response": "Well, they are shitty humans, so them being against open source doesn't surprise me.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9b3tip",
                    "author": "po00on",
                    "score": 1,
                    "created_utc": 1653039293.0,
                    "response": "Bill Gates is a business man. First and foremost.The idea that once you obtain a certain amount of money, you automatically become a saint, is the stuff of fairy tales, or very expensive marketing / PR departments....",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9bkivb",
                    "author": "sonicode",
                    "score": 1,
                    "created_utc": 1653049982.0,
                    "response": "I remember.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}