{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uxuvvc",
            "title": "Never go all in! Always dollar cost average. Always have more fiat to deploy!",
            "url": "https://i.redd.it/jwx74k3rpp191.jpg",
            "author": "No_Lychee2245",
            "created_utc": 1653523823.0,
            "score": 1,
            "num_comments": 1,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "ia06uke",
                    "author": "freddiemack1",
                    "score": 1,
                    "created_utc": 1653524368.0,
                    "response": "Been buying the dip since November. Fiat gone since March",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uxuy5u",
            "title": "Questions about true widespread adoption and security? (in the sense of loss/fraud)",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uxuy5u/questions_about_true_widespread_adoption_and/",
            "author": "Vegas1997",
            "created_utc": 1653524023.0,
            "score": 2,
            "num_comments": 4,
            "subreddit": "Bitcoin",
            "selftext": "I am loving the technology and positive concepts behind use of Bitcoin. I really do think that it has a bright future and am excited to see where it’ll go and how/to what degree it’ll get widely incorporated into societies around the world.\n\nA couple of questions have crept up in my mind when thinking about the possible barriers for bitcoin’s success. I just wanted to ask your thoughts about it.\n\n1. To what degree of adoption and daily regular use by the general public would need to be achieved? My impression is that the vast majority of people who buy Bitcoin are treating it like an investment and are not really adopting it for it’s true original intended purpose/use as a currency. I think we CAN (and some of us DO) use it as a currency. But I think that the majority of people are just investing in it as stored value. And we’re just kinda passing the responsibility of adopting it as a currency to others or drawing hypotheticals about “the future” and hypothesizing that the majority of people in the future will start using it as currency. But it just feels like the vast majority of bitcoin holders aren’t spending it or utilizing it as currency. What are the steps to achieve that or promote more widespread utility? Do we as investors share a big responsibility in trying to use Bitcoin as currency?\n\n2. In an ideal perfect world there won’t be any situations where theft happens. But the truth is that it can certainly happen (and will happen to some people). Are there any ways to protect against loss or fraud? It seems like a double edged sword: your cold storage wallet is extremely secure, but if it somehow gets compromised- your bitcoins are just completely gone with no way to get them back. Sure we need to stress the importance of always protecting our keys, and ideally the keys will never be compromised. But what if it does get compromised? Is it really that smart to have you life savings in a variety of wallets that can be potentially wiped clean with no recourse for recovery of the stolen bitcoins? Or do you think there will be an establishment of “bitcoin” banks in a way that offer certain deferment of responsibility, guarantees, with protections, insurance or security? Doesn’t that just become the same concept of current traditional banks that we have now for our fiat currency?\n\nAppreciate any insight you guys can offer me. Looking forward to seeing where bitcoin goes in its journey!",
            "stickied": false,
            "comments": [
                {
                    "id": "ia0e86z",
                    "author": "NiceDoctorBeam",
                    "score": 1,
                    "created_utc": 1653527807.0,
                    "response": "> To what degree of adoption and daily regular use by the general public would need to be achieved?  \n\n...*about tree fiddy*...  \n\n> \n> My impression is that the vast majority of people who buy Bitcoin are \ntreating it like an investment and are not really adopting it for it’s true original intended purpose  \n\nYou're very fortunate to live in a first-world country with a more-or-less functioning banking system / economy.  Travel to, say, Argentina or Colombia or Venezuela, or many parts of Africa...  Look at El Salvador.  See how they're using it there.  \n\n> \n> use it as a currency  \n\nLightning network.  Second layers technologies.  \n\n> \n> My impression is... I think... But I think... it just feels like...  \n\nYour thoughts and feelings are based upon your lack of understanding.  You \"feel\" like you understand it, but your understanding is not correct in places, and has some big \"holes\" in other places.  \n\n> \n> there won’t be any situations where theft happens. But the truth is that it can certainly happen  \n\nInflation is caused by \"money printing\".  \n\"Money printing is theft.\"  \nThere's your big heist - we're all being robbed by the small \"money printer\" gang.  \n\nI can't stop those thieves from debasing my government's currency, but I know that when my private keys are properly stored, nobody can confiscate or steal my Bitcoin, nor can they debase it to rob me. This is not hypothetical; this is very real.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia09o05",
                    "author": "Jetjones",
                    "score": 1,
                    "created_utc": 1653525693.0,
                    "response": "BTC is used as payment everyday around the globe. Some decide to treat it as an investment and there’s nothing wrong with that, there’s plenty satoshis to go around and be used however the user wants to. I would buy with BTC if it was more accessible. I do my part and accept it as payment for my services.\n\nAs for security.. The only way for your keys to be compromised is if you’re not vigilant and click on links you shouldn’t. There’s scams with fiat as well, just don’t be stupid. Irreversible transactions is one of the perks of crypto imo. As adoption grows, more security means are going to emerge but it is most likely that common folks will keep their coins on non custodial wallets such as exchanged or whatever so their coins are « insured ». This is not how it’s meant to be but then again, it’s a free market and you do whatever you feel confident with. I know for a fact nobody can take my coins because I use a hardware wallet and everybody should do the same.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia0fijm",
                    "author": "Independent-Snow-129",
                    "score": 1,
                    "created_utc": 1653528384.0,
                    "response": "1 : Public debt and gasoline are at an all time high, gold close to it .  Last time natural gas and oil moved at this price range was in 2007, therefor most individuals have no money to spend and struggle with the increase in prices .  In conclusion, If you believe in bitcoin , Its a great time to use the store of value characteristics !\n\n2: You can diversify your risk and If you really don't trust your capacity and desire an old fashion type bank , there's the possibility of using multisig where you could decide a plan with your \"bank\". Really you want to make it so new generations learn the core concept of **don't trust, verify !**     I don't think they'll accept the same bull\\*\\*\\* this time, and won't let anyone or institutions have full control of any bitcoin if you don't own it.\n\n( **Not financial advice**, humble opinion from a Electrophorus electricus)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia0h4ld",
                    "author": "hyperinflationUSA",
                    "score": 1,
                    "created_utc": 1653529129.0,
                    "response": "yes hello this is dog",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}