{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "v0bzni",
            "title": "Tax loss harvesting",
            "url": "https://www.reddit.com/r/Bitcoin/comments/v0bzni/tax_loss_harvesting/",
            "author": "UnusualEconomist7608",
            "created_utc": 1653833447.0,
            "score": 3,
            "num_comments": 2,
            "subreddit": "Bitcoin",
            "selftext": "Sorry if this is a little tricky.\n\nSay I bought 100 shitcoins at 5 dollars and now the price is at 1 dollar. I already have 90 coins in my hardware wallet and 10 coins on the exchange. Can I just Sell this batch of 10 coins, ten times. So sell 10 coins, buy 10 coins. Sell 10 coins buy 10 coins. A total of 10 times, to take advantage of the tax loss harvesting. Or do I have to bring all 100 coins back to the exchange to do this.",
            "stickied": false,
            "comments": [
                {
                    "id": "iafgdsv",
                    "author": "Idreadme",
                    "score": 1,
                    "created_utc": 1653833671.0,
                    "response": "🤫",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iafgu9p",
                    "author": "No-Arugula-1045",
                    "score": 1,
                    "created_utc": 1653833903.0,
                    "response": "Tax loss harvesting allows you to claim losses on your taxes. It’s based on the difference between the purchase price and the sale price so to get it, you must show a loss on a particular investment. If you sell 10 coins and buy 10 more, you changed the purchase price so no tax harvesting would be possible on the second set of 10.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "v0c23w",
            "title": "Bill Gates said he doesn't invest on Cryptocurrency",
            "url": "https://www.reddit.com/r/Bitcoin/comments/v0c23w/bill_gates_said_he_doesnt_invest_on_cryptocurrency/",
            "author": "ChangeBusy8011",
            "created_utc": 1653833666.0,
            "score": 0,
            "num_comments": 15,
            "subreddit": "Bitcoin",
            "selftext": "Bill Gates said he doesn't invest in cryptocurrency because he likes investing in things with \"valuable output.\"",
            "stickied": false,
            "comments": [
                {
                    "id": "iafi4zo",
                    "author": "ou81tooya",
                    "score": 5,
                    "created_utc": 1653834554.0,
                    "response": "If I at one time was the richest man in the world. I also wouldn't give a shit about investing anymore.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iafi96w",
                            "author": "ChangeBusy8011",
                            "score": -1,
                            "created_utc": 1653834612.0,
                            "response": "So true",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iafgpdg",
                    "author": "NiceDoctorBeam",
                    "score": 5,
                    "created_utc": 1653833835.0,
                    "response": "So?  \n\nI don't worship billionaires.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iafj6sa",
                    "author": "StoicTechInvestor",
                    "score": 2,
                    "created_utc": 1653835073.0,
                    "response": "Microsoft does though...",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iafgqqu",
                    "author": "Der_Teufel666",
                    "score": 2,
                    "created_utc": 1653833853.0,
                    "response": "Who cares about that pedophile?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iafgxxj",
                            "author": "ChangeBusy8011",
                            "score": -1,
                            "created_utc": 1653833956.0,
                            "response": "I guess\nNobody",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iafidc9",
                    "author": "Academic-Daikon-8662",
                    "score": 0,
                    "created_utc": 1653834670.0,
                    "response": "Pregnant pedophile man says thing that is meaningless. Bitcoin and no one cares.🫃",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iafijrh",
                            "author": "ChangeBusy8011",
                            "score": 0,
                            "created_utc": 1653834758.0,
                            "response": "🤔🤐",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iafhytm",
                    "author": "KMan471",
                    "score": 1,
                    "created_utc": 1653834470.0,
                    "response": "Who cares?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iafpddp",
                    "author": "Fitness_Accountant21",
                    "score": 1,
                    "created_utc": 1653837863.0,
                    "response": "Bill Gates eats pants",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iafpncj",
                            "author": "Fitness_Accountant21",
                            "score": 1,
                            "created_utc": 1653837993.0,
                            "response": "He also eats soy for breakfast, lunch, and dinner. \n\nAs a rule, I don't listen to or follow anyone who was the physiognomy of soyboy.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iafry5h",
                    "author": "MrQ01",
                    "score": 1,
                    "created_utc": 1653839032.0,
                    "response": "Wow OP, when did this exclusive news come out?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iafstzp",
                    "author": "Glad_Morning",
                    "score": 1,
                    "created_utc": 1653839426.0,
                    "response": "Cause he has no control",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaftnj7",
                    "author": "_k182",
                    "score": 1,
                    "created_utc": 1653839799.0,
                    "response": "Whos bill gates",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "v0c5fi",
            "title": "When countries adapt a Central Bank Digital Currency what happens to BTC?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/v0c5fi/when_countries_adapt_a_central_bank_digital/",
            "author": "RedditSucksss1",
            "created_utc": 1653833958.0,
            "score": 1,
            "num_comments": 13,
            "subreddit": "Bitcoin",
            "selftext": "It is only a matter of time before countries introduce there own Central Bank Digital Currency so what will happen to BTC? I think as long as lighting payments are more prevalent by that time then BTC will be a strong 2nd currency. Thoughts?",
            "stickied": false,
            "comments": [
                {
                    "id": "iafmsr8",
                    "author": "ts_wrathchild",
                    "score": 7,
                    "created_utc": 1653836703.0,
                    "response": "Bitcoin doesn’t care what governments think. It will exist and thrive, even in the face of harsh regulations and crackdowns. It will never be illegal to run a BTC node because that idea is, frankly, ridiculous…not to mention impossible to enforce.\n\nAs such, the network cannot be taken down. There aren’t many options as far as taking away on-ramp and off-ramps, despite what many people might think.\n\nThis is why you see BTC in the number one spot on all charts. It’s actual sovereign cash with value, unlike anything else in the list.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iafw28l",
                            "author": "solomonsatoshi",
                            "score": 1,
                            "created_utc": 1653840847.0,
                            "response": "Except that China has banned MoE use of Bitcoin and most of S.E. Asia has too under pressure from their largest trading partner...China.\n\nChina which has already developed and is introducing its CBDC (DCEP) as a direct and deliberate challenge to the USDs global monetary system hegemony.\n\nUSD vs DCEP vs BTC",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iafyyo3",
                                    "author": "ts_wrathchild",
                                    "score": 1,
                                    "created_utc": 1653842128.0,
                                    "response": "Again, Bitcoin doesn’t care what a country or state thinks. Bans are paper. Enforcement is an entirely different beast.\n\nDo you believe “the people” of China don’t have access to the Bitcoin network?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iafhwfs",
                    "author": "KMan471",
                    "score": 3,
                    "created_utc": 1653834436.0,
                    "response": "They will block the on and off ramps. Tough choice will have to be made. Either live in their system, or live completely out of their system in extreme discomfort.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaftyrb",
                            "author": "Nada_Lives",
                            "score": 1,
                            "created_utc": 1653839941.0,
                            "response": "Anyone here notice the rising difficulty of their Bitcoin transactions into/out of the fiat system? With fully electronic CBDCs, it's only going to get worse. Count on it.\n\nYour choice all along has been to either just go along, or to walk away from fiat entirely. Reality sometimes sucks, but now at least you have a choice.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iafkmf8",
                    "author": "uneasyadventurer1769",
                    "score": 3,
                    "created_utc": 1653835731.0,
                    "response": "It is not a currency, it is a store of value IMO. Like gold. I think nothing will happen to BTC, but stablecoins will die.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iafwdf1",
                            "author": "solomonsatoshi",
                            "score": 1,
                            "created_utc": 1653840984.0,
                            "response": "Have you heard of El Salvador and the Lightening Network?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iafoj83",
                    "author": "meatismoydelicious",
                    "score": 3,
                    "created_utc": 1653837484.0,
                    "response": "I think it will create more faith in the prospect of DCs and cause many to learn about them, thus driving up BTCs value as more and more become educated about it's potential and the state's inability to create a better mechanism.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iafr0n5",
                    "author": "Halo22B",
                    "score": 1,
                    "created_utc": 1653838618.0,
                    "response": "Government's with CBDCs will start using them as a mechanism to control dissent and coerce \"acceptable\" behaviour. More and more normies will wake up to the fact that government is not their friend and will look to escape the CBDC trap.\nBTC is that escape hatch.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iafrhjv",
                    "author": "effexzi",
                    "score": 1,
                    "created_utc": 1653838826.0,
                    "response": "Nothing will happen; bitcoin doesn't care.\n\nIf you happen to get the cbdc and need some btc, make sure there's no digital trail between your cbdc sale and the btc purchase. Then hodl.\n\nCheers.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iafrpq8",
                    "author": "MrQ01",
                    "score": 1,
                    "created_utc": 1653838927.0,
                    "response": "Technically nothing - they have nothing to do with each other.\n\nIn actuality, as long as the government will push out red herring narrative  that Bitcoin is nothing more than just \"magic internet money\", it will use this to then say that a CBDC makes BTC redundant. This is the same line of why their pushing for PoS: there's a reliance on the public not knowing any better.\n\nThere's nothing a CBDC adds for the government's stance on BTC that can't already be done right now without a CBDC. However, the above will certainly amp up the FUD factor.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iafu2cl",
                    "author": "mr_flibble_oz",
                    "score": 1,
                    "created_utc": 1653839986.0,
                    "response": "The only issue I see is CBDC can be programmed to allow you to buy certain things and deny you purchasing other things. If Bitcoin is on the deny list, it will be harder to buy Bitcoin and escape the CBDC nightmare",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iafxhgc",
                    "author": "Sufficient_Tooth_949",
                    "score": 1,
                    "created_utc": 1653841469.0,
                    "response": "Cbdc is just a form of a digital dollar like in your bank it's still subject to inflation...it's still not decentralized, it's easy for the government to track your every purchase or block your account access....\n\nBitcoin still has PLENTY of purpose if cbdc was adopted worldwide and personally I think cbdc adoption is inevitable and it will only strengthen Bitcoin",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "v0c5i0",
            "title": "When is inflation a good thing?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/v0c5i0/when_is_inflation_a_good_thing/",
            "author": "Acceptable-Risks",
            "created_utc": 1653833964.0,
            "score": 35,
            "num_comments": 193,
            "subreddit": "Bitcoin",
            "selftext": "Recently while discussing bitcoin I've come across several individuals who say inflation is good for an economy. I cannot get an argument out of these people for why it would be a good thing, they seem to have been taught it was good and hold that belief without really knowing why. \n\n\nSomeone play devil's advocate for me and tell me the best argument for why inflation is good. I can't think of any reason it would be good and am blown away by the fact some people think it's good. Until recently I'd not met anyone who thought it was a good thing. \n\n\nOf course my rebuttal is always about how inflation means reckless gov debt and it devalues the currency, but I'm wondering if there is a better argument from my point of view. \n\n\nWhat do you guys say?",
            "stickied": false,
            "comments": [
                {
                    "id": "iafqmv8",
                    "author": "MrQ01",
                    "score": 38,
                    "created_utc": 1653838445.0,
                    "response": "Playing devil's advocate (this is NOT my opinion that these are good things)\n\n* Awareness of a depreciating currency therefore discourages saving and instead encourages people to consume their wealth. This brings money back into the economy as opposed to \"being under the bed\". There's also directly investing in companies or ventures which also help the economy grow. So from a Keynesian perspective, inflation helps the economy via enabling investors and spenders, and punishing savers.\n* For some reason, this argument is doing the rounds but.... lending is often created via the banks printing extra money rather than using a source of existing money. Without this, the only way to get funds would be directly taking from somewhere else and so requiring their compliance to do so (if you can't directly force them).\n* In extreme cases, the government might just want to distribute wealth. Printing money is the easiest way of doing this, because not many people know how money works. People certainly know how raising taxes work, which would be how the government would distribute wealth in a zero-inflation environment, and would be far more hostile towards this than printing money.\n\nAgain for the record - I don't believe the arguments above are either beneficial or without flaws: I don't believe in Keynesian arguments such as the above and have rebuttals to this. But simply pretending such arguments aren't in circulation does nobody any favours.\n\nBy the way OP, if your associates are arguing for the benefits of inflation without being able to say why they think so, you should either insist they go and find out, or else end the discussion. Don't even try to argue against them when the ball in on their court.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iafrg9j",
                            "author": "Acceptable-Risks",
                            "score": 3,
                            "created_utc": 1653838811.0,
                            "response": "These are well thought out arguments for the pro inflation side. Thank you for this input. If you've got the time would you mind going back through those and sharing your rebuttals from the anti inflation point of view also? You've given the most detailed response so far and I think this comment could be bemeficial to a lot of us.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iaftz3w",
                                    "author": "breakup7532",
                                    "score": 11,
                                    "created_utc": 1653839946.0,
                                    "response": "to make it short (not OP)\n\n1 - you have to have a first principles belief that savers _should_ be punished. if you dont hold this first principle, you can argue against this point. you can argue that this _artificial_ manipulation is against the natural state, which MUST create risk\n\n2 & 3 - you have to have a first principles belief that the government _should_ intervene and pick winners and losers and that they do know what is best for us.\n\nFew people hold #1 as a first principle. Many do believe in the first principles of 2 & 3, so socliast-minded people may have good reason to appreciate fiat currency.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iafzd1i",
                                            "author": "Swole_Bodry",
                                            "score": 11,
                                            "created_utc": 1653842307.0,
                                            "response": "The central bank wants to manipulate our behavior to produce desirable outcomes, and as the central banks techniques improve, this essentially results in the Fed\n increasing its grasp over our behavior. Changing our environment to fundamentally change what is rational or irrational. \n\nI don’t care what benefits a low inflation rate has on the macro economy. No one party should have that much influence over human behavior. If anything, a deflationary currency might be desirable, as incentivizing saving over consuming, although harming economic growth, prevents overconsumption and the destruction of our planet",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iafzlkx",
                                                    "author": "breakup7532",
                                                    "score": 1,
                                                    "created_utc": 1653842414.0,
                                                    "response": "correct. so creepy",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "iafwev6",
                                            "author": "Acceptable-Risks",
                                            "score": 4,
                                            "created_utc": 1653841001.0,
                                            "response": "In fact I've noticed exactly what you've said. Many people who consider themselves progressive or politically left are in favor of authoritarian structure and they do believe a centralized authority is a good thing. I've found a lot of this, and therefore they do not like bitcoin because it would eliminate the need for the central authority. \n\n\nI've also noticed on the political right a type of nationalism that says \"I want the dollar to be strong and screw everything else.\" So this crowd hates bitcoin because they think it's their patriotic duty to the USA to hate bitcoin. \n\n\nI'm not sure how people think in other countries but this is what I've noticed in the USA.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iah9i4s",
                                                    "author": "Arde1001",
                                                    "score": 1,
                                                    "created_utc": 1653864275.0,
                                                    "response": "Honestly you can just say authoritarians oppose bitcoin, since libertarian viewpoints are shared in the left and right equally.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "iag2pbe",
                                            "author": "MrQ01",
                                            "score": 2,
                                            "created_utc": 1653843814.0,
                                            "response": "Thank you for adding to my points.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "iagdx1h",
                            "author": "nowitsalllgone",
                            "score": 1,
                            "created_utc": 1653848965.0,
                            "response": "> you should either insist they go and find out, or else end the discussion\n\nIf I ask someone why they think something is good and they don't know the answer, sometimes I will say something like, \"One time I read some stuff on the internet where a guy said that he likes X because of Y and Z. What do you think of that?\"\n\nThis technique lets you keep the conversation going and gives your interlocutor an opportunity to see flaws in some of the arguments. They even sometimes say \"Well I don't agree with that argument for X but I've heard better ones.\" I think this is a good technique because it gets the other guy \"on your side\" on at least one item and it may prompt them to think of an argument they like better. Or, if they like the argument you presented, you can then tell them why you think it is flawed, which is also good (in my opinion).",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iaglcen",
                            "author": "Dullfig",
                            "score": 1,
                            "created_utc": 1653852436.0,
                            "response": "People that save their money to build a business don't do it due to inflation. It's called ambition and predates inflation.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iagmfe6",
                                    "author": "MrQ01",
                                    "score": 2,
                                    "created_utc": 1653852943.0,
                                    "response": "Like I say - these are not MY personal arguments. I don't believe inflation is a good thing.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "iah13o6",
                                    "author": "Nonthares",
                                    "score": 1,
                                    "created_utc": 1653860046.0,
                                    "response": "In this context that's not saving. You might bank some money for a while, but then you're spending it on business expenses.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iaflsnd",
                    "author": "Psylux707",
                    "score": 7,
                    "created_utc": 1653836257.0,
                    "response": "If the real growth rate of an economy is ~1% but with inflation it's 5% (nominal).  The higher nominal growth rate spurs economic development moreso then the real growth rate. Or more people are better off living in the higher nominal growth rate economy as the economic control has been moved away from the free market to the government (central banker technocrats control the interest rates and government largess enables losers to be winners).  \n\nOf course, it's nonsense that results in malinvestment but that's the crux of the progressive argument",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iafmn4x",
                            "author": "Acceptable-Risks",
                            "score": 2,
                            "created_utc": 1653836635.0,
                            "response": "It takes some very good mental gymnastics to think that sounds like a good idea. Thank you for presenting the argument clearly. It helps me understand the view someone may come from.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iafmzj4",
                                    "author": "breakup7532",
                                    "score": 4,
                                    "created_utc": 1653836787.0,
                                    "response": "its insulting to believe people arent naturally smart enough to understand the current system is no bueno.\n\ni think its a testament to how badly we fail students in financial literacy/education.\n\nits not _that_ complicated of a system, and it immediately gives off bad vibes when explained honestly lol",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iafp694",
                                            "author": "Acceptable-Risks",
                                            "score": 7,
                                            "created_utc": 1653837771.0,
                                            "response": "I'm right there with you on that one. I get so frustrated talking to people because it quickly becomes obvious they are not educated on what fiat currency is. Especially people who are anti establishment or progressive, and yet don't understand how we are enslaved by bankers and governments. Blows my mind.\n\n\nI dont think the lack of financial education is an accident. How do you create slaves and keep them stupid? Withhold education. That's exactly what slave owners did all throughout history and continue to do today in areas where slavery still exists.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iafwpdx",
                                                    "author": "NumberWonTwice",
                                                    "score": 5,
                                                    "created_utc": 1653841132.0,
                                                    "response": "I’m glad these discussions are happening.  I only started teaching myself finance and diving into self improvement in my late twenties early thirties…all thoughts lead back to primary education, and even college…the essentials are not taught, and curriculums are controlled by teachers unions and the gov…it’s absolutely by design.  Maybe they will start censoring these discussions as misinformation some day.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iafv0xw",
                    "author": "JollySno",
                    "score": 7,
                    "created_utc": 1653840398.0,
                    "response": "It becomes easier to service your debt.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iafv8dv",
                            "author": "Acceptable-Risks",
                            "score": 5,
                            "created_utc": 1653840487.0,
                            "response": "Print more money to pay debt? Is that what you're saying?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iafw7ki",
                                    "author": "JollySno",
                                    "score": 5,
                                    "created_utc": 1653840912.0,
                                    "response": "No, I’m talking about the definition of inflation, the reduction in purchasing power, so theoretically you should be able to earn more when the money reduces its value, so it’s easier to repay your debt.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iafymhj",
                                            "author": "Acceptable-Risks",
                                            "score": 1,
                                            "created_utc": 1653841977.0,
                                            "response": "Ah OK. Got it.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "iagi8ft",
                                    "author": "Fair-Pool-5155",
                                    "score": 1,
                                    "created_utc": 1653850986.0,
                                    "response": "Look at it in the simplest manner. If there is one big cake inside the country - representing the value held inside that country. There are a total of 100money inside that same country. The people inside the country use the 100 to purchase pieces if that cake. Print +20min et (inflation) - the cake didn’t get bigger - the person who used to pay 10 money for a large piece of the cake got a “salary rise” thinks he is wealthier, however he simply pays 12 for the same piece of cake - the cake never got any bigger. An important mistake many make is to think that the National banks are National meaning fully owned by the state and thus “by the people” - wrong, National banks are on shares and owned but a little group of other banks insurance companies who live up to some strongly limited acceptance criteria to allow them to own shares in the National Bank. The National bank supplies (lend our liquidity) money to the banks (who just happen to own part of their own product/liquidity supply line..). In turn example the European Central Bank (also on private ownership) who sits as another umbrella across European national banks, prints money ie increases money supply into the national banks, same system now across Europe / euro zone. Ask yourself - in which business do you produce a product like a “100,- euro bill” fundamentally a piece of paper with a purchasing power of “100,-“ at the cost of let’s call  it 0,80 cents and it is “durable”. The banks thus produce their own product “money” ie liquidity to sell into the market as loans - at a fraction of its purchasing value. No other business like that exists on the planet earth.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iaha7br",
                                            "author": "JollySno",
                                            "score": 1,
                                            "created_utc": 1653864636.0,
                                            "response": "That would be logical, but that’s not called inflation. There’s other ways money loses its value. Not sure why nearly everyone here doesn’t understand inflation.\n\nMaybe the term we’re looking for is debasement.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iafi3vv",
                    "author": "Ithinkwereparkedman",
                    "score": 9,
                    "created_utc": 1653834539.0,
                    "response": "An economy where inflation exists but offers options to beat inflation is far more attractive to use/spend within as people don't think they're spending a scarce asset.\n\nDeflation makes people horde and not want to spend/use, as the asset they're spending is getting rarer all the time.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iafiwx9",
                            "author": "breakup7532",
                            "score": 7,
                            "created_utc": 1653834940.0,
                            "response": "Horde is an extreme.\n\nDeflationary money makes society more conservative is a more fair way to put it.\n\nInflationary money makes society more aggressive for growth. Which is more risky.\n\nThere will always be a base level demand for goods and services, since we have basic needs.\n\nIt really annoys me that economists whitewash conservative as bad and aggressive risky growth mindset and strictly good",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iafk0i9",
                                    "author": "Acceptable-Risks",
                                    "score": 5,
                                    "created_utc": 1653835456.0,
                                    "response": "What are we doing with BTC? We're hodling right? He makes a good argument. Is there another way to overcome that argument besides shifting it to a matter of opinion on whether or not fiscal conservativism is the best method?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iafkjpn",
                                            "author": "breakup7532",
                                            "score": 4,
                                            "created_utc": 1653835699.0,
                                            "response": "I would argue you are holding it now because you don't see any viable superior investments to cash (bitcoin). Because we believe the economy is unhealthy.\n\nPersonally tho, and I think most bitcoiners should realize this, is that AFTER hyperbitcoinization, you should invest in profitable businesses.\n\nThe quality threshold for that investment will likely be of higher value because u will seriously consider the value of letting go of your money.\n\nSo I believe that in a BTC world, you'll have less speculation, ultimately slower growth, but way less actual economic volatility and overall less suffering",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iafnd0n",
                                                    "author": "Acceptable-Risks",
                                                    "score": 1,
                                                    "created_utc": 1653836958.0,
                                                    "response": "Agreed. Those of us who are early adopters have a responsibility to the rest of humanity. We are to participate in the decentralization of bitcoin by spending it.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iah0tk3",
                                                            "author": "eqleriq",
                                                            "score": 2,
                                                            "created_utc": 1653859909.0,
                                                            "response": "that logic is flawed as spending it just allows corporations to accumulate it. \n\nthe REAL participation are *people* offering goods and services for direct bitcoin payment.\n\nAnd those options are STILL pretty wacky and require trust since once the BTC is sent, that's that. Anything else requires an oracle/trust and that flaw is one of the main problems with fiat.\n\nThis myth of spending it as some sort of prod is silly since unless you're mining there is already a buyer/seller relationship established",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "iafjmhu",
                                    "author": "Ithinkwereparkedman",
                                    "score": 5,
                                    "created_utc": 1653835280.0,
                                    "response": "I appreciate your point, my personal opinion is I'd much prefer an inflationary model, with multiple ways of beating inflation, which allows for large growth than a deflationary model where growth is limited, if not stagnated due to the conservative nature of the spending within the system.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iafk1eg",
                                            "author": "breakup7532",
                                            "score": 2,
                                            "created_utc": 1653835467.0,
                                            "response": " 🤝 we disagree on first principles and dis is okay",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "iagzuaz",
                                    "author": "eqleriq",
                                    "score": 2,
                                    "created_utc": 1653859421.0,
                                    "response": "you say this is an extreme yet 4 of my frontpage posts are encouraging not buying anything because bitcoin frugality is proper",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iafpgpg",
                    "author": "barnei",
                    "score": 8,
                    "created_utc": 1653837907.0,
                    "response": "With deflation prices of goods and services will drop. Therefore people will wait to buy large items - cars houses etc. Why buy now if in a year it will be cheaper? \n\nWith inflation, prices are likely to increase, so people want to buy now rather than later.\n\nBasically it keeps people spending and buying things. \n\nOr that's what the economists say anyway. My own view is I'm to stupid too really know all the nuances of it so don't attack me as I don't really know.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iafqxc8",
                            "author": "Acceptable-Risks",
                            "score": 8,
                            "created_utc": 1653838577.0,
                            "response": "No I won't attack you, I'm thankful for your input. You've just described fiscal conservativism vs aggression. \n\n\nThe big issue to think about is why would an economy need to expand fast? Why wouldn't conservative growth and stability be the best option? In my opinion it is....and the only reason an economy would need to grow fast and keep people spending is if it must make up for reckless spending of a government that is too large for its pants. It is more beneficial for the people to see the value of their money increase over time and the cost of goods and services decrease.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iafwtw8",
                                    "author": "bowie9191",
                                    "score": 4,
                                    "created_utc": 1653841186.0,
                                    "response": "It’s not even growth as well.. it’s all an increase. We measure growth through gdp but the issue is that gdp is aggregated revenue NOT of profit. Because we have this obsession with “growth” (which is not actual growth, just increases), you ultimately encourage short term high of consumption at the expense of the long term ability to produce what we might like to produce. Think of a farmer eating seed rather than planting it. His consumption increases, but eventually he loses ability to consume at all.. Hence why we keep consuming more but paradoxically it’s getting harder and harder to keep doing so. GDP keeps climbing while median measures of income, net financial wealth goes sideways and even down.. like cmon people",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iafhbbt",
                    "author": "NiceDoctorBeam",
                    "score": 20,
                    "created_utc": 1653834139.0,
                    "response": "It's only a good thing when you are the \"money printer\" or a close crony of the \"money printers\", aka, Cantillonaire.  \n\nLook up \"Cantillon effect\".  \n\nFor everybody else, they get robbed by inflation.  Inflation is a form of theft.  Who benefits from theft?  The thief and his drug dealer.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iafxdfz",
                            "author": "Spl00ky",
                            "score": 0,
                            "created_utc": 1653841420.0,
                            "response": "That's why you invest your money. Inflation nudges you to invest in assets or in yourself i.e. paying to learn new skills to increase your income. Inflation therefore helps to prevent laziness.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iag3o91",
                                    "author": "kimsabok",
                                    "score": 3,
                                    "created_utc": 1653844247.0,
                                    "response": "Should i let a lion loose in an urban setting too, to prevent lazy people simply walking around and going about their daily lives?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iag4co8",
                                            "author": "Spl00ky",
                                            "score": 2,
                                            "created_utc": 1653844555.0,
                                            "response": " If I could just hold cash and make money off it, then there is very little incentive to invest it in anything. No work needs to be done researching or spending time improving myself.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iag4uuo",
                                                    "author": "kimsabok",
                                                    "score": 3,
                                                    "created_utc": 1653844787.0,
                                                    "response": "Yeah i know. Imagine if there was no lion roaming the streets. People could just be going about their daily lives, not looking to improve their fitness and sprinting abilities. No work would need to be done, no one improving themselves.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iag5a6z",
                                                            "author": "Spl00ky",
                                                            "score": 1,
                                                            "created_utc": 1653844977.0,
                                                            "response": "There is nothing wrong with saving nothing but cash, just don't expect a return off it.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "iag5prb",
                                                                    "author": "kimsabok",
                                                                    "score": 3,
                                                                    "created_utc": 1653845175.0,
                                                                    "response": "Theres nothing wrong with walking either. Just dont expect to have all your limbs after a lion is let loose in the city.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "iag92eh",
                                                                            "author": "Floooge",
                                                                            "score": 2,
                                                                            "created_utc": 1653846712.0,
                                                                            "response": "Could you clarify your point? I’m a bit lost",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "iagvnd8",
                                                                                    "author": "lib3rty47",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653857360.0,
                                                                                    "response": "He is saying a deflationary environment doesn't solve hunger, shelter, security or human greed. People still need those things. People will still spend.\n\na deflationary environment would create a less wasteful world because a person would only trade their hard money for something that they value/need more of. The shitty wasteful businesses would either have to drop prices, reinnovate or die off. \n\nInstead, inflation helps shitty wasteful companies exist cause money is cheap so crappy products get more expensive, more wasteful, less reason to be innovative. The consumption is artificial because money is being pumped in dead companies that shouldn't exist.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "iahaitu",
                                                                                            "author": "Spl00ky",
                                                                                            "score": 1,
                                                                                            "created_utc": 1653864802.0,
                                                                                            "response": "Bro, if businesses die off whether they are \"shitty\" then where would all the people who want to work go?\n\nYou're completely ignoring that inflation affects all businesses equally and thus, businesses must innovate or have competition eat away at their profits. The current capitalist system is already harsh on businesses that fail to generate profits and bad companies are punished. You already see this reflected in a company's stock price. Look at Microstrategy. It's a terribly run business with declining revenues for the past several years.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "id": "iahad7n",
                                                                            "author": "Spl00ky",
                                                                            "score": 1,
                                                                            "created_utc": 1653864721.0,
                                                                            "response": "Right because a lion let loose in a city is equivalent to the nudge of inflation.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "iagili6",
                                    "author": "NiceDoctorBeam",
                                    "score": 1,
                                    "created_utc": 1653851152.0,
                                    "response": "Investing means accepting an amount of **risk**.  People should not be forced to gamble just to try to hold onto the wealth they have earned, especially when it is not necessary.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iah99h1",
                                            "author": "Spl00ky",
                                            "score": 1,
                                            "created_utc": 1653864151.0,
                                            "response": "There has to be some risk, otherwise, no one would bother taking risk if they just hold cash.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "iafhl24",
                            "author": "Acceptable-Risks",
                            "score": 0,
                            "created_utc": 1653834275.0,
                            "response": "Agreed. I am aware of the Cantillon effect. POS consensus anyone??",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iafigz7",
                                    "author": "breakup7532",
                                    "score": 1,
                                    "created_utc": 1653834721.0,
                                    "response": "This is not what a keynesian would tell you the benefit of inflation is to be fair.\n\nThis is pretty obv a critique of inflation lol",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iafnoj1",
                                            "author": "NiceDoctorBeam",
                                            "score": 3,
                                            "created_utc": 1653837104.0,
                                            "response": "Keynesians are idiots.  They're just plain wrong.  Even worse, what they've been advocating has cause harm to a large number of people.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iafhm3a",
                    "author": "breakup7532",
                    "score": 10,
                    "created_utc": 1653834290.0,
                    "response": "It's not and it's just lazy economics.\n\nInflation is a good thing if you believe that humans are so stupid that they must be artificially shielded from volatility. \n\nSo if you want $1 to always equal same amount of purchase power, but you also want to increase global GDP, you'll have to \"inflate\" the currency \n\nWhich I disagree that money needs to be an elastic ruler lol so stupid.\n\nMoney should be the total sum of GDP. If GDP goes up, value of money should be higher and things should cost a smaller piece of money\n\nIf GDP goes down, value of money should be less and things should cost a larger piece of money since we have less things\n\nFiat economists are whacky",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iafic7a",
                            "author": "breakup7532",
                            "score": 9,
                            "created_utc": 1653834654.0,
                            "response": "To play more devils advocate, since the replies are not really diving into anything specific\n\n\"More dollars translates to more spending, which equates to more aggregated demand. More demand, in turn, triggers more production to meet that demand.\"\n\nYou see how this is actually very risky and creates boom and bust cycles.\n\nInflation is good because it makes number go up harder. Well it also makes number go down harder when numbers stop going up.\n\nIn sound money world, the value of money itself helps to dampen the cycles. Keynesian growth mongers HATE this",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iafpuyo",
                                    "author": "NiceDoctorBeam",
                                    "score": 9,
                                    "created_utc": 1653838088.0,
                                    "response": "They debase the currency, it takes more currency units to buy that same loaf of bread, and you call that \"more spending\".  \n\nNo.  It's theft.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iafxm87",
                                            "author": "Spl00ky",
                                            "score": 1,
                                            "created_utc": 1653841526.0,
                                            "response": "Why have salaries gone up over time? Moreover, you're ignoring improvement in agriculture and production which have deflationary effects on prices.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iag3ew9",
                                                    "author": "breakup7532",
                                                    "score": 2,
                                                    "created_utc": 1653844130.0,
                                                    "response": "because of new monetary supply. prices and salaries should drop over time with more progress as you mentioned, and growth should slow if you have a deflationary currency.\n\njust depends on if u want to live in a low-growth environment (which I believe is more natural) or believe it is safe to artificially stimulate\n\nwe will have to agree to disagree",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iag48pn",
                                                            "author": "Spl00ky",
                                                            "score": 1,
                                                            "created_utc": 1653844505.0,
                                                            "response": "Most of the artificial stimulation has come after the fact of serious financial or non-finance related events. For example, if an asteroid struck a major city in the USA, would it not make sense to help the country try to repair itself from it?\n\n Of course, if growth slows, the population is still going to be 7.9 billion. Tell me then what everyone is going to do for a living if businesses shutdown because growth is no longer a concern.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "iag55vf",
                                                                    "author": "breakup7532",
                                                                    "score": 2,
                                                                    "created_utc": 1653844922.0,
                                                                    "response": "so without central banking, ill have no motivation to help my neighbor..? what if i... like them? lol\n\nand like.. obviously if a city got wiped our from an asteroid, growth SHOULD slow down lol we got frickin hit by an asteroid!",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "iag5khw",
                                                                            "author": "Spl00ky",
                                                                            "score": 1,
                                                                            "created_utc": 1653845109.0,
                                                                            "response": "Ah so now we can see with bitcoin we could have a nice communist state where everyone helps each other out with nothing expected in return.\n\nYou missed the point, obviously yes growth would slow down, but would it make sense to do nothing to help stimulate the economy again to get it back on track?",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "iag64zc",
                                                                                    "author": "breakup7532",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653845368.0,
                                                                                    "response": "Communism - \"a society in which all property is publicly owned\"\n\nbeing a nice person is not communism.\n\nhave u never done anything for somebody else from the goodness of ur heart? can u not relate to that? if not.. maybe you have ASPD\n\ni am arguing you dont NEED to stimulate it. humans will thrive and figure a way out. without a government forcing it to happen.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "iag7cv3",
                                                                                            "author": "Spl00ky",
                                                                                            "score": 1,
                                                                                            "created_utc": 1653845929.0,
                                                                                            "response": "You're forgetting the key concept of communism is that the state eventually \"withers away\". \n\nThis is not argument about being nice or not. It's a simple economic concept of supply and demand paired with time and effort. A person is not going to spend hundreds of thousands of dollars along with time and effort on med school to become a doctor and barely get paid anything. Sure, they also have the satisfaction of helping others, but they are still doing it for money to pay for their education. \n\nInflation affects not only consumers, but also businesses equally. Thus, businesses combat inflation by creating new products and services that consumers will buy. This naturally creates healthy competition and a net positive overall.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "iafxke4",
                            "author": "Spl00ky",
                            "score": 3,
                            "created_utc": 1653841505.0,
                            "response": "You ignore population growth and economic expansion. A fixed supply currency makes it very difficult to accommodate these.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iafzdyz",
                                    "author": "breakup7532",
                                    "score": 2,
                                    "created_utc": 1653842319.0,
                                    "response": "population cannot grow forever, and neither can the econonomy.\n\nits very.. ideal to believe population can grow forever.\n\neventually people start to die.\n\nhumans are animals, and animals have cyclic populations. to believe humans are immune to that is unnatural",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iag03p0",
                                            "author": "Spl00ky",
                                            "score": 1,
                                            "created_utc": 1653842640.0,
                                            "response": "The population is projected to reach 10.9 billion by 2100. Of course a number of assumptions have to be made. But for the most part, technology should allow humans to live longer and the 4th industrial revolution and subsequent revolutions should allow for goods and services to be produced to support larger populations.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iag9hh8",
                                                    "author": "Floooge",
                                                    "score": 1,
                                                    "created_utc": 1653846907.0,
                                                    "response": "What’s the 4th revolution? Technology as in I.T.?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iah9pgy",
                                                            "author": "Spl00ky",
                                                            "score": 1,
                                                            "created_utc": 1653864381.0,
                                                            "response": "AI, advanced robotics, perhaps blockchain allowing production to becoming more efficient.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "iag4mgw",
                                    "author": "Iguana_The_Wise",
                                    "score": 2,
                                    "created_utc": 1653844682.0,
                                    "response": "Nonsense. \n\nAs long as the fixed supply currency is sufficiently divisible, it can accommodate all the growth without any problems.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iag5ru9",
                                            "author": "Spl00ky",
                                            "score": -1,
                                            "created_utc": 1653845201.0,
                                            "response": "Divide to infinity. Sounds like inflation",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iag74w0",
                                                    "author": "Iguana_The_Wise",
                                                    "score": 2,
                                                    "created_utc": 1653845828.0,
                                                    "response": "You can't be serious.\n\nI refuse to believe you're being serious.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iag7fxo",
                                                            "author": "Spl00ky",
                                                            "score": -1,
                                                            "created_utc": 1653845968.0,
                                                            "response": "If there is no limit to divisibility then what difference does it make? Bitcoin works as intended right now  precisely because it has a fixed supply and limit to divisibility. Violating that would be the anti-thesis of bitcoin's purpose.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "iagbjxn",
                                                                    "author": "Iguana_The_Wise",
                                                                    "score": 3,
                                                                    "created_utc": 1653847861.0,
                                                                    "response": "Making tiny gold coins of 1/10000 oz size is not the same as increasing the gold supply.\n\nIf the Bitcoin protocol is changed to add 25 decimal zeros, my purchasing power remains the same. It is not diluted as it is when adding more supply.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "iah9jn2",
                                                                            "author": "Spl00ky",
                                                                            "score": 1,
                                                                            "created_utc": 1653864297.0,
                                                                            "response": "That's because gold is continually mined and has no known hard fixed limit.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "iagf2f9",
                                                                    "author": "the-jade-rabbit",
                                                                    "score": 1,
                                                                    "created_utc": 1653849506.0,
                                                                    "response": "Iguana the wise is right about this one. Think about it carefully.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "iah9dnm",
                                                                            "author": "Spl00ky",
                                                                            "score": 1,
                                                                            "created_utc": 1653864211.0,
                                                                            "response": "Um no. There is a fixed supply and bitcoin can only be divided to a certain amount. Anything else is contrary to bitcoin's purpose.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iafhe3b",
                    "author": "-send_me_bitcoin-",
                    "score": 6,
                    "created_utc": 1653834177.0,
                    "response": "Have you ever actually read about it or does your entire understanding of economics come from gut feelings?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iafho22",
                            "author": "Acceptable-Risks",
                            "score": 1,
                            "created_utc": 1653834318.0,
                            "response": "Are you asking me or is that your reply you'd give to someone who says inflation is good?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iafusgg",
                    "author": "PieH34d",
                    "score": 4,
                    "created_utc": 1653840299.0,
                    "response": "With a deflationnary money, nobody wants to spend anything, which drives recession.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iafv0du",
                            "author": "Acceptable-Risks",
                            "score": 4,
                            "created_utc": 1653840391.0,
                            "response": "People have basic needs and utilities etc...",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iafxx59",
                                    "author": "Spl00ky",
                                    "score": 6,
                                    "created_utc": 1653841661.0,
                                    "response": "Consumerism drives innovation. Corporations are motivated to create new ways to get you to spend your money on their products which ideally improve your life. Not everyone wants to live like a peasant.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iag3pfh",
                                            "author": "breakup7532",
                                            "score": 3,
                                            "created_utc": 1653844262.0,
                                            "response": "neanderthals did not invent spears and hunting tools for consumerism lol\n\nhumans are naturally driven to innovate already",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iag4pds",
                                                    "author": "Spl00ky",
                                                    "score": 1,
                                                    "created_utc": 1653844718.0,
                                                    "response": "Ah yes because we ought to go back to a more primitive state. Sounds like you want communism. Don't worry man, people definitely will help you out for nothing in return.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iag511n",
                                                            "author": "breakup7532",
                                                            "score": 2,
                                                            "created_utc": 1653844862.0,
                                                            "response": "im literally advocating for radical free market capitalism, and you are arguing for central banking.\n\nsir, ur objectively closer to communism than me.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "iag5h8b",
                                                                    "author": "Spl00ky",
                                                                    "score": 1,
                                                                    "created_utc": 1653845067.0,
                                                                    "response": "You literally just said humans want to innovate for the sake of innovation with no motivation to do so other than to help out people. If one neanderthal made a better spear, he could then leverage that to sell for other goods, he is not going to give it away just because he is nice.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "iag5ro9",
                                                                            "author": "breakup7532",
                                                                            "score": 3,
                                                                            "created_utc": 1653845199.0,
                                                                            "response": "bro neanderthals didnt even have the social concept of markets..\n\nif someone in my tribe made a spear, hes gonna teach me how to use it so we can improve our odds of a successful hunt, and improve the entire tribes survival odds.\n\nhumans are social creatures, and those who act for strictly selfish motivation are not in a natural state. they are called psychopaths. or someoen with anti-social personality disorder.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "iag63cb",
                                                                                    "author": "Spl00ky",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653845347.0,
                                                                                    "response": "As far as I'm aware, neanderthals pretty much lived in tribes and would have considered other tribes to be potential threats.  \n\n Still sounding like communism to me. I'm just going to spend all this time and effort and new skills and still get treated and paid the same as someone who doesn't have the same talent or effort than me.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "iag6fow",
                                                                                            "author": "breakup7532",
                                                                                            "score": 2,
                                                                                            "created_utc": 1653845505.0,
                                                                                            "response": "you seem to be conflating any degree of sharing/kinship as communism.\n\ncommunism means the state enforces everyone sharing everything.\n\nin your family, you are communist, no? or at least a healthy family relationship should feel somewhat communist within the family.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "iafxpkn",
                                    "author": "Schlongzz",
                                    "score": 4,
                                    "created_utc": 1653841568.0,
                                    "response": "Just think about it. If your money is constantly becoming more valuable why would you want to spend it? It’s not even that hard to grasp. You would be reluctant to spend it ever. Also, why would you wanna borrow money today if you have to repay it later when it costs more?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iag1rok",
                                            "author": "Xpoint233",
                                            "score": 3,
                                            "created_utc": 1653843394.0,
                                            "response": " because you can just live off the interest.\nif you had 10mil that made you 500k a year would you not spend money?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iag3lco",
                                                    "author": "breakup7532",
                                                    "score": 1,
                                                    "created_utc": 1653844210.0,
                                                    "response": "sir have u eaten a bitcoin? delicious, and calorie-gluten-sugar-fat free!",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iag55vz",
                                                            "author": "Xpoint233",
                                                            "score": 1,
                                                            "created_utc": 1653844923.0,
                                                            "response": "Well no I haven't, what's the point?",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "iag5err",
                                                                    "author": "breakup7532",
                                                                    "score": 1,
                                                                    "created_utc": 1653845035.0,
                                                                    "response": "im agreeing with u that is ridiculous to imply humans wont spend money because BTC price might go up.\n\nbitcoin is, in fact, not a good source of nutrition.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "iah2dos",
                                            "author": "Nonthares",
                                            "score": 1,
                                            "created_utc": 1653860674.0,
                                            "response": "What else is the lesson of pizza day other than, \"that guy could have been rich had he not bought a pizza years ago?\"",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "iafv6vp",
                                    "author": "PieH34d",
                                    "score": 1,
                                    "created_utc": 1653840469.0,
                                    "response": "Yes, and they mostly have not basic needs.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "iag4zve",
                            "author": "Iguana_The_Wise",
                            "score": 2,
                            "created_utc": 1653844847.0,
                            "response": "Absolute nonsense.\n\nPeople will still want to play video games, travel the world and eat in restaurants under a Bitcoin standard.\n\nThey will simply be more smart with their spending and they will be more motivated to save money, which is a good thing for humanity.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iafvw27",
                    "author": "procabiak",
                    "score": 6,
                    "created_utc": 1653840771.0,
                    "response": "Think of inflation as a \"stablecoin algorithm\" for goods and services. Hypothetical scenario: the world population is 1b people in the world that buys 1b chickens a day, and an average price of chickens is $10. The money supply is $10b.\n\nIf population grows to 2b, that $10b is now divided among them too, so everybody can now only afford half a chicken if price is $10. Demand has increased by 100%. Since the supply of chickens is still 1b, the price of chicken is gunna go up because of increased demand. Basically if it goes to $20, it's because now only half of the population can afford it (some people will have the $20 and the other half has $0) OR the entire population can now afford half chickens for the $10 price tag and you see \"shrinkflation\" happen (talking at a high level, not accounting for corporate greed). Similarly on the expanding production of chicken to 2b, if the population doesn't grow past 1b, then there's just too much chicken. Price goes down, eventually people can now buy 2 chickens for $10.\n\nCentral banks can't control the farms or population growth, but they CAN control the money. To keep the price of chickens at roughly $10, they will need to inject $10b more in the first scenario, or contract the supply of money by 50% in the 2nd scenario. These examples are very wild \"swings\", economy doesn't change like that.\n\nThe central banks adopted a 3% target rate because it roughly coincides with (give or take) population growth rates (~1.5%) and produce growth targets (2~3%). This is why the general consensus of \"3%\" is considered good. We are either always pumping out more shit to buy, or we are shitting out more babies.\n\nThe Bitcoin model is simple. We don't *need* the bank for stability - the price should reflect the demand and supply, period, and *market incentives* should already drive prices down. In the first scenario, when the population goes up by 100%, everybody has less Bitcoin going around, the price of chickens will go up and now the same money can only buy half a chicken. People will see you can make more money in chickens, so they'll produce more, which returns the price back down. When the population growth is 1.5% and gdp is 3% a year, price of everything should drop by 1.5% a year for everyone to have enough Bitcoins to buy enough goods and entice people to spend. You will also earn 1.5% less Bitcoin every year, but saving it means it'll be worth more tomorrow than it does today.\n\nIt's perfect money.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iag5ssh",
                            "author": "joesus-christ",
                            "score": 2,
                            "created_utc": 1653845212.0,
                            "response": "This response made me think of that Justin Timberlake movie \"In Time\" where each person born creates more supply and uses it until they die, theoretically creating a fairly nice inflation:population ratio... but then it all goes tits-up because the rich know how to get their hands on more of it, which means the poor die out but their supply is still in the hands of the rich.\n\nNothing more to say, just made me think of it.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iafz5oj",
                            "author": "Acceptable-Risks",
                            "score": 1,
                            "created_utc": 1653842216.0,
                            "response": "Great explanation. Thank you.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iag3ui3",
                            "author": "breakup7532",
                            "score": 1,
                            "created_utc": 1653844326.0,
                            "response": "amazing sir",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iagsq93",
                            "author": "instakin",
                            "score": 1,
                            "created_utc": 1653855933.0,
                            "response": "> Central banks can't control the farms or population growth, but they CAN control the money. To keep the price of chickens at roughly $10, they will need to inject $10b more in the first scenario, or contract the supply of money by 50% in the 2nd scenario.\n\nUgh. I hate it.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iafhp8f",
                    "author": "Academic-Daikon-8662",
                    "score": 6,
                    "created_utc": 1653834334.0,
                    "response": "Never, debasment of currencies is never a good thing, it leads to wars, and needless death.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iagqp65",
                            "author": "squareOfTwo",
                            "score": 1,
                            "created_utc": 1653854952.0,
                            "response": "why do you think that governments don't like death? \"To war my little parts, to war, fight for me for oil!\"",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iafs0ir",
                    "author": "sheltojb",
                    "score": 3,
                    "created_utc": 1653839061.0,
                    "response": "A little bit of inflation is a good thing because it keeps money moving.  In any large population of people, there will be some subset of people who emerge as being exceptionally good at amassing money.  History has shown that they need motivation to spend it, else they'll just hoard it.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iafsr7v",
                            "author": "Acceptable-Risks",
                            "score": 3,
                            "created_utc": 1653839393.0,
                            "response": "Ok. Do we have alternative means of inspiring people to spend besides punishing them for saving through devaluation?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iafucdt",
                                    "author": "breakup7532",
                                    "score": 4,
                                    "created_utc": 1653840110.0,
                                    "response": "biology hooked us up with this feeling called boredom. and a buncha horemones that give us a drive to reproduce, recreate and innovate.\n\nits laughable to believe humans would not evolve without central banking. i dont think the neanderthals had central banking lmao",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "iag5a6w",
                                    "author": "jp90230",
                                    "score": 5,
                                    "created_utc": 1653844977.0,
                                    "response": "Savings is worst thing as it stops money movement. Prosperous economies are created through lending and borrowing, its a flywheel that creates jobs, builds cities/infrastructure , creates incentives to drive innovation and creativity. \n\nif there is zero inflation, banks and private investors will have no incentives to lend and will kill the economy immediately.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "iag5kgb",
                                    "author": "sheltojb",
                                    "score": 1,
                                    "created_utc": 1653845108.0,
                                    "response": "There are several options to keep money moving.  Taxation for example.  But in general you'll find all of those options get resisted mightily because the hoarding instinct is a pretty basic one.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "iagubtc",
                            "author": "instakin",
                            "score": 1,
                            "created_utc": 1653856719.0,
                            "response": "> there will be some subset of people who emerge as being exceptionally good at amassing money.\n\nIt helps if you are the one with first dibs on the new, inflated money supply at the deflated levels.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iag0zvb",
                    "author": "LanguageRadiant7420",
                    "score": 4,
                    "created_utc": 1653843043.0,
                    "response": "Take a few economics courses my man. Plenty of reasons inflation can be beneficial.\n\nI would say the leading reason inflation is sometimes necessary is when the US dollar becomes too strong compared to other currencies. What happens next is we become too expensive to buy from, then imports go way up while exports go way down. No one will buy from us and then the US job market suffers.\n\nSometimes it benefits countries to intentionally weaken their dollar.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iagakda",
                            "author": "Iguana_The_Wise",
                            "score": 3,
                            "created_utc": 1653847403.0,
                            "response": "No offense but this type of mental gymnastics is what economists and central bankers have done for decades in order to justify theft by inflation.\n\nThere are always 2 sides to the equation. The downside in exports if offset by the increase in purchasing power of Americans. The prices of everything, including production costs, go down as well.\n\nOn the other hand, when you intentionally weaken the dollar, you're stealing purchase power from people. You're affecting those workers living paycheck to paycheck, while enriching those closest to the money printer.\n\nNot everything is about the number of jobs. Several decades ago the man of the family earned enough to provide for everyone. Now both husband and wife need to have a job to meet the family needs.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iag1ttg",
                            "author": "Acceptable-Risks",
                            "score": 2,
                            "created_utc": 1653843420.0,
                            "response": "Isn't that just basic economics though? If the demand is dripping because our currency is strong, shouldn't we see prices decrease so the demand will increase again? \n\n\nI dont see why inflation is necessary in that scenario. If the dollar is strong and pur economy is booming, naturally it should follow that things can become less expensive and more abundant.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iag2d4t",
                                    "author": "LanguageRadiant7420",
                                    "score": 1,
                                    "created_utc": 1653843662.0,
                                    "response": "You are completely missing the point here. If our dollar is TOO strong then we will enter a trade deficit with every country. This would be catastrophic for the American worker.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iag3vj7",
                                            "author": "Acceptable-Risks",
                                            "score": 3,
                                            "created_utc": 1653844339.0,
                                            "response": "The way I see it that is a great case for equalizing things with a Bitcoin standard and ending the fiat standard. Of course local areas could have their own form of a cash type currency for local interaction. But with a bitcoin standard we wouldn't need to be concerned with what you're talking about.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iag5lf7",
                                                    "author": "LanguageRadiant7420",
                                                    "score": 0,
                                                    "created_utc": 1653845120.0,
                                                    "response": "Incorrect. It is clear at this point that you have no actual understanding of how economics works and are just spouting things out about bitcoin so…. Have a good one.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iafz0kw",
                    "author": "Jezzes",
                    "score": 2,
                    "created_utc": 1653842152.0,
                    "response": "They believe in keynesian economics.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iag3l74",
                    "author": "fresheneesz",
                    "score": 2,
                    "created_utc": 1653844208.0,
                    "response": "Those who say inflation is a good thing think:\n\n* It stabilizes prices (\"look how much more stable prices are today than when we had a gold standard\").\n* It \"encourages investing\" so that people don't \"hoard\" their money and instead \"put that money to work\".\n* It gives a lever for the central bank to \"help\" the economy in troubled times. \n\nUnfortunately, they're horribly misinformed:\n\n* Prices were were actually [a lot more stable](https://www.forbes.com/sites/nathanlewis/2016/03/03/the-myth-of-price-instability-during-the-gold-standard-era/?sh=2bd3fb94568f) when we had a gold standard, not only because prices didn't continuously increase, but because the market wasn't manipulated by central bankers and fiat had a physical connection to the real world. \n  * Another thing often said related to this is the frequency of banking panics was higher. This is true, but A. they fixed the symptom but not the problem, and B. the fix has nothing to do with money printing. The fix is the FDIC which insures people's money so no panic is ever necessary. People will get their money regardless of whether the bank fails or not. Therefore people don't need to run the bank anymore. Even if we were on a gold standard, the existence of the FDIC would mean bank panics would be far rarer. These panics often came on the heels of recessions. Of course we don't want more recessions, however recessions actually serve an important economic role: they get people to reevaluate where they're investing their money and what they're spending their money on. They serve as moments where people are moving their money from inefficient activities to more efficient activities. Recessions are economic restructuring. Do we really want to do that less often? If we artificially prevent recessions from happening, we can do this by incentivizing the inefficient behavior that would otherwise lose money and cause a recession. We should *want* to eliminate that inefficient behavior, the problem is doing it basically requires a recession. Recessions are like an immune system response - it sucks when you're experiencing it, but ultimately its usually good for your body (because it helps you not die).\n* People for some reason think \"hoarding money\" is a bad thing, even tho the same people almost always think saving money in a 401k for your future is a good thing. People think that buying stocks somehow means you're helping the economy. You're not. The purpose of the stock market is a resource allocation tool.  People blindly throwing money into index funds without thinking about what companies actually need money and are likely to be profitable, does absolutly nothing to intelligently allocate resources - in fact its more of a random allocation of resources that results in inefficient allocation. Who would have thought that giving people with no economic literacy no other choice than to put their life savings into the stock market would be bad for the economy? The fact is money is not \"put to work\". The more money floating around in the economy, the less its worth. So if you have $1 trillion of smart money invested by investors who do substantial research on how to best allocate their money, and then you have $1 trillion of dumb money that just wants to put it \"in the stock market\" without putting any effort into researching where it should go, that waters down the market, making the $1 trillion of smart money half as effective. Money is a zero sum game in that way.\n* I recently wrote [a long shpeal](https://www.reddit.com/r/Bitcoin/comments/uy60yi/this_feels_like_it_belongs_here/ia2x6sv/) about why central banks don't and can't actually \"help\" the economy by providing \"economic stimulus\". So read it there, but the main points are:\n  * Price signals in the market take 6 months - 7 years (give or take a few years) to propagate and take full effect. Different signals take different lengths of time to propagate. \n  * The central bank has no special power of predicting the economy and certainly can't predict anywhere near a year out, much less 7 years.\n  * Because of this, any action the central bank takes will likely result in not actually preventing much recession, will likely result in an overheated economy once the recession is over which will hasten the next recession and make it worse than the one before it. Also, as I said above, recessions are not strictly a bad thing - they're an immune system response to a bad thing: growing systemic inefficiency. Central banks are bringing dirty stone tools to the surgeon's table.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaghlc6",
                    "author": "-spooky_ghost",
                    "score": 2,
                    "created_utc": 1653850686.0,
                    "response": "a basic argument i always hear is you should inflate money supply because otherwise people will just hodl their cash and not spend it.\n\n&#x200B;\n\ninflating the money supply means your money can buy you x% less good and services each year (assuming your income is the same every year)  for this reason it incentivises people to spend / invest their money rather than save it. The reason you want people to consume and spend / invest all their money is so you can keep innovating / making better & new stuff.\n\n&#x200B;\n\nIt is of the opinion that if you didn't inflate money people wont spend their money , the economy will slow and we will innovate slower etc. The example i always hear is if a TV costs £1000 and you know next year it will be £500 then the next year it would be £200 you would just save your money because your purchasing power is growing. i.e if you wait a year you can now buy 2 TV's instead of 1  \n\n\npersonally i call bullshit on this point of view as literally no one iv ever talked to says they spend their money because it's being inflated away. They spend for a whole host of reasons like want cool / shiny shit, they want to be entertained, want the newest technology, want the newest iphone, want expensive cloths to show off, want status items etc. Hell most of the people iv asked this question to before don't even know what inflation is / means / does or what its purpose is for. People will always want to buy shit they my just buy less useless shit. i think this argument is used a lot because it does actually make a lot of sense, however it is a gross generalisation and is a bit of a catch all argument because it is logical and is hard to argue unless you understand economy really really well (which i don't btw this is just the ramblings of someone that reads alot).\n\n&#x200B;\n\nPeople often argue that bitcoin is the perfect example of why inflation is good. because they say people HODL it because they assume itll be worth more in the future. However, id argue that   \n\n\n1. bitcoin is inflationary by about 1.7% a year Atm and will be inflationary until 2140 bitcoin isn't deflationary it just simply has a hard cap. \n2. its super hard to buy anything with bitcoin especially at physical POS as bearly anyone accepts it and card takes 2 seconds.  \n\n3.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iah7z8p",
                    "author": "sciencetaco",
                    "score": 2,
                    "created_utc": 1653863493.0,
                    "response": "Do people not realize that bitcoin has a current inflation rate of 1.7%? New Bitcoin are being printed (mined) every 10 minutes. \n\nIt's not about inflation vs no inflation. It's about removing central control. It really doesn't matter if it's inflationary or not. As long as it's predictable and untouchable.\n\nI'm sure that if Satoshi had set a constant supply rate then people would be gushing over that instead.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iahdlsf",
                            "author": "BitcoinUser263895",
                            "score": 1,
                            "created_utc": 1653866418.0,
                            "response": "> Do people not realize that bitcoin has a current inflation rate of 1.7%? \n\nHad a guy engaging in some kind of ridiculous \"debate\" thread the other day. \n\nHis contention was that the inflation rate for Bitcoin was 100% because the price had gone down. ;D\n\nAnd this is probably about as far as I can be bothered scrolling into this post lol",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iafx9cv",
                    "author": "Spl00ky",
                    "score": 2,
                    "created_utc": 1653841370.0,
                    "response": "Controlled inflation is a good thing which would be a monetarist viewpoint developed by Milton Friedman. A fixed supply would bring too much uncertainty. Imagine a large portion of bitcoin is lost because an individual or government lost access to it. This would have an effect on pricing as the supply is materially affected. I'm not sure how businesses would adapt.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaflgmc",
                    "author": "Dormage",
                    "score": 2,
                    "created_utc": 1653836105.0,
                    "response": "Its good for funding things the people would not want to.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iafmwf7",
                            "author": "Acceptable-Risks",
                            "score": 3,
                            "created_utc": 1653836748.0,
                            "response": "Like gender studies in the middle east? Apparently the US gave billions of dollars to a country in the middle east for \"gender studies\" back in 2020 when they printed all the \"free\" money. I doubt we would have approved that had we a say in it.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iafoqgg",
                                    "author": "skinny_chum",
                                    "score": 1,
                                    "created_utc": 1653837575.0,
                                    "response": "Uh… sure? Or like any of the millions of innocent people killed over there between 2001-2021. I would have liked to of not paid for that.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iafpneh",
                                            "author": "Acceptable-Risks",
                                            "score": 1,
                                            "created_utc": 1653837993.0,
                                            "response": "Exactly why proof of war (the backing of the fiat system) is garbage.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "iafpgj0",
                                    "author": "Dormage",
                                    "score": 1,
                                    "created_utc": 1653837904.0,
                                    "response": "Yes like those I guess. And you know, the hadron collider, and the war in Avganistan, Iraq, Syiria, et al.\n\nStuff like that where you cant convince people to part with their wealth so you can fund them. So you chose to burden the future generations not yet born with a debt they cant ever repay just so you can have your project.\n\nTheres good and bad. I know most people wouldnt fund the hadron collider because they dont understand the importanc of such discovery may have on future generations. We cant promise anything but we must try regardless.\n\nOn the other hand we fund a tonne of stupid ideas that do not benefit humanity in no way shape or form. \n\nBut regardless of how we may feel about specific projects mentioned, creating money through debt is  the most efficient tool to fund anything and not have to pay it back.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iafqc5e",
                                            "author": "Acceptable-Risks",
                                            "score": 1,
                                            "created_utc": 1653838310.0,
                                            "response": "Indeed it is efficient for that purpose.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iafu1dq",
                                                    "author": "solomonsatoshi",
                                                    "score": 1,
                                                    "created_utc": 1653839974.0,
                                                    "response": "Wrong- debasement is paid for by everyone through inflation.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iafvfho",
                                                            "author": "Acceptable-Risks",
                                                            "score": 1,
                                                            "created_utc": 1653840572.0,
                                                            "response": "Right, but you get what they're saying. For the people at the top its the best way to get what they want and be able to pass the bill on to someone else.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "iag0gxl",
                                                                    "author": "solomonsatoshi",
                                                                    "score": 2,
                                                                    "created_utc": 1653842805.0,
                                                                    "response": "Yes it is an efficient and expedient form of theft and a significant undermining of trust in democracy.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "iaftwyi",
                                            "author": "solomonsatoshi",
                                            "score": 1,
                                            "created_utc": 1653839919.0,
                                            "response": ">But regardless of how we may feel about specific projects mentioned, creating money through debt is  the most efficient tool to fund anything and not have to pay it back.\n\nWrong. \n\nFiat debasement is paid for by everyone through inflation.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iafudh0",
                                                    "author": "Dormage",
                                                    "score": 1,
                                                    "created_utc": 1653840122.0,
                                                    "response": "Facepalm moment.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "iafqw8t",
                            "author": "metal_bassoonist",
                            "score": 1,
                            "created_utc": 1653838563.0,
                            "response": "I thought that was taxes.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iafrgyf",
                                    "author": "Dormage",
                                    "score": 0,
                                    "created_utc": 1653838819.0,
                                    "response": "Yeah, they were, but then we get greedy, spend more then we have because we want more and more. Ecentually taxes arent sufficient so we print.\n\nAlso, some of these projects cost so mucu it would take years of saving tax money to fund.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iafryx7",
                                            "author": "metal_bassoonist",
                                            "score": 2,
                                            "created_utc": 1653839041.0,
                                            "response": "I just mean in principle. If they were honest, if they needed more funding, they'd raise taxes instead of sneaking in their pay through inflation, which most people don't understand is covert theft.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iafs4s4",
                                                    "author": "Dormage",
                                                    "score": 1,
                                                    "created_utc": 1653839113.0,
                                                    "response": "Yup, but that takes convincing and people notice. Printing is much easer ;)",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iafs7bk",
                                                            "author": "metal_bassoonist",
                                                            "score": 1,
                                                            "created_utc": 1653839145.0,
                                                            "response": "Aye. There's the rub 😌",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "iafu9bu",
                                                            "author": "solomonsatoshi",
                                                            "score": 1,
                                                            "created_utc": 1653840072.0,
                                                            "response": "You just abandoned a fundamental premise of democracy - are you sure you want to continue with that? Hows it working for you so far?\n\nUSD vs DCEP Vs BTC",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "iafusd8",
                                                                    "author": "Dormage",
                                                                    "score": 1,
                                                                    "created_utc": 1653840298.0,
                                                                    "response": "Continue with discussing ideas on the internet? Maybe, depends on the ability of the counterparty to have an argumented discussion.\n\nI do not have any money to invest. I do not care about your punny grudges between currencies, Bitcoin and the NFT bullshit. \n\nSo, I couldnt give a crap about the moral winner in any of these. I am interested in potencially finding a better system then this one.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iafyt1c",
                    "author": "recessiontime",
                    "score": 1,
                    "created_utc": 1653842059.0,
                    "response": "I've talked to many of my leftist friends about this. Their arguments are basically the following:\n\n1) without inflation my house price doesn't go up!\n2) inflation causes spending which prevents great depressions. \n\nAlso a world without money printer is also a world without unconstrained welfare, warfare and underwater basket weaving gender study degrees. Can't have that. A lot of them work in professions where the government money printer is their primary customer (like medicine).",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iag02fu",
                            "author": "Acceptable-Risks",
                            "score": 1,
                            "created_utc": 1653842624.0,
                            "response": "Pretty interesting to think about how quickly the sandbags and unnecessary weights of society would fall off if we had a hard money standard.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iag0bxy",
                                    "author": "recessiontime",
                                    "score": 2,
                                    "created_utc": 1653842743.0,
                                    "response": "That would be a world with Consequences (can't have that, oh no no no no no...)",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iag3xsi",
                    "author": "jp90230",
                    "score": 1,
                    "created_utc": 1653844369.0,
                    "response": "No inflation, money movement stops, economy dies. simple as that. money movement is like blood flowing in your body. \n\nit doesn’t matter how much blood in body, the moment it stops flowing, you are dead.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iafjosl",
                    "author": "Gwsb1",
                    "score": 1,
                    "created_utc": 1653835308.0,
                    "response": "Define \"good thing\" . If you work at a job for someone else,  it's never a good thing. \n\nIf you are a rich guy who owns a shit load of hard assets, it's great. Hard asset prices go up and down, but never down a far as they went up. \n\nBill Gates is buying up as much farm land as he can.  You think he knows something?  Warren Buffett owns Burlington Northern,  who has the largest coal reserves in America. And is the largest shareholder in Oxy Pete. You think he knows something? \n\nBuy a house at 100k borrow 90k. House goes to 150k . Put 5x profit in your pocket.  Trick is to know WHEN to buy. \n\nYou work for 50k a year.  Boss gives you a3% raise and tells you he is doing you a favor. Inflation at 6%. You are well and truly fucked. Is Bill Gates fucked?  Is Warren Buffett fucked? Of course not. Who has the ear of the pols in Wash? Not you at 50k  year. Bend over Bob , and no lube this time.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iafpyi2",
                            "author": "Acceptable-Risks",
                            "score": 2,
                            "created_utc": 1653838133.0,
                            "response": "When I've come across people who believe inflation is \"good\" they are claiming the economy is in better condition and more stable with inflation.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iag6ndl",
                                    "author": "Gwsb1",
                                    "score": 1,
                                    "created_utc": 1653845604.0,
                                    "response": "1-2 % a year is ok. More robs your purchasing power so fast is scary.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iaflvlp",
                    "author": "ItsPushOver",
                    "score": 1,
                    "created_utc": 1653836295.0,
                    "response": "It's better to save when interest is up and loan/spend when interest is down. If you are a poor none of it will matter though ha ha ha",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iafrn5j",
                    "author": "BusinessBreakfast3",
                    "score": 1,
                    "created_utc": 1653838895.0,
                    "response": "When you hold Bitcoin",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iafrrtc",
                    "author": "ojdidntdoit4",
                    "score": 1,
                    "created_utc": 1653838952.0,
                    "response": "while the moneys getting printed. then never after",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iafsxws",
                    "author": "MannerSweet",
                    "score": 1,
                    "created_utc": 1653839474.0,
                    "response": "When the government needs to raise capital to pay for their agenda",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iafthnd",
                    "author": "Sealobo",
                    "score": 1,
                    "created_utc": 1653839725.0,
                    "response": "Inflation has been incredibly good to people with quality hard assets.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iafz4ys",
                    "author": "HeatSeekingPanther",
                    "score": 1,
                    "created_utc": 1653842207.0,
                    "response": "Well it's certainly critical for initially distributing a money supply throughout a society, even satoshi knew that.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iafzhjl",
                            "author": "Acceptable-Risks",
                            "score": 2,
                            "created_utc": 1653842363.0,
                            "response": "The one example nobody can really argue against. We have to get the supply out and circulating. But is that inflation necessarily or is that the distribution and discovery of the currency? I'm not sure.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iagpzyf",
                                    "author": "HeatSeekingPanther",
                                    "score": 1,
                                    "created_utc": 1653854623.0,
                                    "response": "I’ve never really thought about it as discovery, but in a way it is. Especially because that discovery process requires work. \n\nUnder that framework you could view supply discovery and supply inflation as different mechanisms. \n\nBut, from a first principles view they are functionally doing the same thing : increasing the money supply.\n\nSome people argue that inflation is a good thing because it incentivizes consumption, and consumption creates a healthy economy. I think this view is deeply flawed because it misunderstands that money itself is not valuable - it is the things money can buy you. People have plenty of incentive to use money to better their lives or simply to live without inflation.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iag07qo",
                    "author": "BatKunRises23",
                    "score": 1,
                    "created_utc": 1653842690.0,
                    "response": "When your currency has become deflated and you need to make exported goods look nice for trade.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iag1e3n",
                    "author": "ryachart",
                    "score": 1,
                    "created_utc": 1653843222.0,
                    "response": "It’s a good thing when you don’t hold the inflating currency and other people do.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iag2k9l",
                    "author": "BitFunky1990",
                    "score": 1,
                    "created_utc": 1653843750.0,
                    "response": "The argument is that it accelerates the velocity of money. If money is losing value (inflation), people will spend it more readily, thus increasing commerce, and theoretically making everybody “richer”. Of course, this is incorrect. What’s funny is a common example used is that of purchasing a TV. If TVs are rapidly declining in cost, then you won’t buy one today, you’ll buy one tomorrow. Or next month or next year. At least that’s the argument. But this commonly used example is false on its face, because TVs ARE rapidly declining in cost. What actually happens is they become so cheap that people just buy them when they need one, and as soon as it breaks, they buy another. Or if they want a second TV, they immediately buy it.\n\nRead “The Price of Tomorrow” by Jeff Booth. Or watch his interview with Scott Melker on the Wolf of All Streets podcast (available on YouTube and elsewhere). Excellent discussion on the topic.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iag30qe",
                    "author": "MasterDebater100",
                    "score": 1,
                    "created_utc": 1653843957.0,
                    "response": "The answer is really pretty obvious when you think about it...  inflation is a good thing for anyone that has more debt than savings.  With inflation, your debt is worth less and less as time goes on.  Imagine if it were the opposite and you're debt increased in value -  it would be nearly impossible to recover.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iag3iab",
                    "author": "Iguana_The_Wise",
                    "score": 1,
                    "created_utc": 1653844170.0,
                    "response": "Prices going up is never a good thing.\n\nThere are no arguments for why it would be good.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iag3jon",
                    "author": "omya123",
                    "score": 1,
                    "created_utc": 1653844188.0,
                    "response": "inflation is a good thing if you have gold, real estate and bitcoin",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iag3xkt",
                    "author": "darkmarke82",
                    "score": 1,
                    "created_utc": 1653844366.0,
                    "response": "Inflation is good because it keeps consumers spending. I don’t mean that in a weird way like forcing behavior, but what I mean is that if you always think prices are going to go down over time (deflation) then it constrains spending. Which at the individual level is better since it allows people to spend when they want without an external pressure - but in terms of overall economies it’s difficult because it leads to a whole economy of cashed up consumers who don’t spend and it slows growth. \n\nThe classic example is japan. For the past 30 years Country has been battling to try and get inflation back and to shift the mindset of consumers who have all of their money “under the tatami mat” essentially meaning it is out of circulation and not d being “productive”",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iag6096",
                    "author": "Aggressive-Sort-3062",
                    "score": 1,
                    "created_utc": 1653845308.0,
                    "response": "When people consume so much that it's depleting all our ressources, and destroying our planet.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iag62lg",
                    "author": "gautm939",
                    "score": 1,
                    "created_utc": 1653845337.0,
                    "response": "Inflation forces rich people to spend money \nI think this is enough",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iag6jzc",
                    "author": "Maleficent-Camel2849",
                    "score": 1,
                    "created_utc": 1653845561.0,
                    "response": "wow I‘m impressed by the good answers here!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iag7k9t",
                    "author": "FakeFeels",
                    "score": 1,
                    "created_utc": 1653846024.0,
                    "response": "When you sell something out of the ground.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iag9fsw",
                    "author": "PerformanceVarious45",
                    "score": 1,
                    "created_utc": 1653846886.0,
                    "response": "Money printing is not the only thing that causes inflation.\n\nIt can also be created in a free market by demand for essential goods or services not being met. Typically this type of inflation is good because it creates entrepreneurs and jobs.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaga99o",
                    "author": "senditFrmU2M",
                    "score": 1,
                    "created_utc": 1653847261.0,
                    "response": "For the rich who have properties.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iagaf3j",
                    "author": "havoc414",
                    "score": 1,
                    "created_utc": 1653847335.0,
                    "response": "Well if the gouvernemt create money/inflate their currency to give to the poor it would be a good thing but what is actually happening is rich getting richer because they use it to their adventage loaning more at low interest rate.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iagbp00",
                    "author": "tito_807",
                    "score": 1,
                    "created_utc": 1653847927.0,
                    "response": "Inflation is suppose to be a tool to fight sleeping money. In reality it destroy saving from the average worker and not for the rich who own asset which are kind of protected from inflation.\n\nSo it's a tool that destroy the capacity from middle class to do any kind of project involving saving money.\n\nBUT, an economy based on a deflationary asset is not a good solution either.\n\nBecause it will give the advantage to the rich who can save money indefinitely while the middle class will struggle to do it. So again, rich getting richer, money giving you more money. This is not a good thing.\n\nSaved money should'nt be a risk free way to make money.\n\n&#x200B;\n\nA solution could be an automatic taxe base on how much time your money have not been used in the economy.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iagbshq",
                    "author": "zachmoe",
                    "score": 1,
                    "created_utc": 1653847971.0,
                    "response": "Everyone likes inflation.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iagcpte",
                    "author": "priapic_green_dildo",
                    "score": 1,
                    "created_utc": 1653848402.0,
                    "response": "Basically I see inflation the same way as taking debt. It's a way of bringing future wealth today. It can indeed be good as a way of bootstrapping and leveraging future productivity.\n\nThe trouble is that it has to be short term to be sustainable otherwise you get the absurdity of needing exponential growth in a world with either  fixed or linear growth resources",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iage4v4",
                    "author": "AskALettuce",
                    "score": 1,
                    "created_utc": 1653849067.0,
                    "response": "A little bit of inflation is good, a lot of it is bad.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iagg9xn",
                    "author": "Asum_chum",
                    "score": 1,
                    "created_utc": 1653850067.0,
                    "response": "Balloons.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iagje4g",
                    "author": "angrysatoshi",
                    "score": 1,
                    "created_utc": 1653851524.0,
                    "response": "It’s not unless you voted for Biden and believe the shit he says",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iagkkao",
                    "author": "LegEnvironmental4074",
                    "score": 1,
                    "created_utc": 1653852067.0,
                    "response": "When it comes to debt (which is how modern sovereigns are designed to run/grow), inflation makes it easier to service old debt.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iagktx7",
                    "author": "JKilla1288",
                    "score": 1,
                    "created_utc": 1653852193.0,
                    "response": "I'd say most of those people watch news like CNN MSNBC and the like. Since the guy they are extremely biased towards is president they spin the inflation into being a good thing so people don't blame Joe Biden. If you don't watch these channels try giving it a shot and you'll see what I mean",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iagl6yx",
                    "author": "Dullfig",
                    "score": 1,
                    "created_utc": 1653852363.0,
                    "response": "Never.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iagmb4i",
                    "author": "Vinnypaperhands",
                    "score": 1,
                    "created_utc": 1653852888.0,
                    "response": "That's the cool thing about Inflation.... It's not",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iagonlo",
                    "author": "Canadian-idiot89",
                    "score": 1,
                    "created_utc": 1653853987.0,
                    "response": "The only time it’s acceptable is when the circulating supply isn’t liquid enough to facilitate commerce. \n\nBTC may have this problem. It’s the only problem a deflationary currency might have.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iagp9yy",
                    "author": "squareOfTwo",
                    "score": 1,
                    "created_utc": 1653854284.0,
                    "response": "Interesting point. Here is a thought experiment of a world where everything is based on a deflationary money supply. Maybe this is all dog$§17 so take it with a truckload of salt.\n\n&#x200B;\n\nLets say the game is played in cycles. So anyone can choose any action with their money between cycles.\n\nLets say entityA has 1.0 units of money.  Lets just say that entityA is like a goverment which gives people money based on unconditional basic income, but it only gives a fraction of the remaining money it has to the people, lets say X=0.01. Lets say it gives only 0.01 part of that to the people. So everybody gets on the first round 1.0\\*X\\*Y = 0.001 units. Next round it will be less because entityA will have less money because it gave it away.\n\nLets also assume that people are free to exchange money based on needs etc. with other people, or just \"gift\" money etc. Other people may lend their money to other people for a small fee they give back etc.\n\n&#x200B;\n\nNow the one of the interesting things which will happen is the problem on how people should price wares. In the first few rounds they will adapt the price quickly upwards because they can sell one unit for more money because others have more money to spent because entityA gave them a lot of money.\n\nBut after a lot of rounds this changes when entityA doesn't give much money in each round (it approaches 0.0 because entityA is out of money).\n\nSo then the only way for people to make money is to exchange something with others for money.\n\nIn the end money will accumulate at the people who do the most for everybody because they pull more from others than what they have to pay for costs.\n\nIn other words, it's a zero sum game [https://en.wikipedia.org/wiki/Zero-sum\\_game](https://en.wikipedia.org/wiki/Zero-sum_game) , there is no one which can have more than 1.0 units of money and the sum of the money everyone has is always 1.0\n\n&#x200B;\n\nNote also that everybody has to do something to have a lot of money. There is no \"free ride\" on your money which makes a passive return without doing anything actively like it's the case in the current inflationary system(s).\n\n&#x200B;\n\nNow the same game can be done just with inflation and people close the the \"money printers\". One will probably get a \"unfair\" system where a entity with X money gets X\\*0.1 money by doing nothing just from the \"money printers\" in each cycle. Of course entities have to pay for stuff, which means that the ration of the outflow to X depends on X. That's exactly what we see today where entities such as big companies can get cheaper money just because they are bigger and closer to the money printer.\n\n&#x200B;\n\nGood thing is that these things can be simulated with models of the decision making of the entities involved, etc. .",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iagpp0c",
                    "author": "rawrvitar",
                    "score": 1,
                    "created_utc": 1653854478.0,
                    "response": "The issue is complex because loans taken by business are in nominal terms. So in deflationary economies businesses have to sell more goods for less making it harder to pay back the loan. E.g., If I borrow $1M for inventory, and there’s a deflation rate of 1% (the price I can sell my goods at declines by 1%), then I can’t pay back my loan unless my profit margin was larger than 1%. Supposing I had a profit margin of 1% on my $1M of inventory, I could sell the entire stock for $1,010,000. If there’s 1% deflation on the value of my inventory I can now only liquidate the inventory for $1M and payback my loan with no profit. \n\nMild Inflationary regimes and mild deflationary regimes both are workable, but they do benefit different folk. Ultimately mild inflationary regimes benefit producers and businesses, while mild deflationary regimes benefit savers and consumers. And it’s a political choice of which group you want to privilege. \n\nOf course once you get above mild inflation or mild deflation it seems like everyone’s screwed.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iagq29s",
                    "author": "shosuko",
                    "score": 1,
                    "created_utc": 1653854653.0,
                    "response": "Why is inflation good - ?\n\n1) The population is expanding, and more money is needed for more population.  If $1000,000 is good for 1000 people, then we'll want $2000,000 for 2000 people.  The population in USA is raising approx 1% per year, we want at least 1% inflation.\n\n2) Devaluing stagnant money.  This is one of the main things you can \\*see\\* happen with BTC.  As people expect BTC to continually be worth more, people resist selling it.  This creates a type of horde economy - which can look good, because scarcity drives up value - but in practice fails as a currency.  You have to spend money if you want an economy to function, so you've got to incentivize that through depreciation.\n\nRampant inflation is bad though.  While we should generally print more money each year, using inflation as an answer for failing to balance the government's budget or to \"stimulate the economy\" can be really hurtful.  We're seeing it now.  The last two years inflation has spiked pretty hard - which is a result of about a decade of deficit spending to try to avoid any type of recession / depression.  Suddenly rent is up to $2000 a month and $15 an hour is a garbage wage.  At a steady 5% inflation the value of money drops by half in 35 years, at 7% it drops in half in only 10.  Its an exponential problem, you don't wanna calculate what 10-12% inflation would mean...\n\nEven though a tendency towards inflation is good, BTC and crypto are good too - they hold real value, like being able to digitally transfer real wealth and provide a decentralized network that allows people to move money without interference of governments.  BTC is not likely to displace the dollar, but as long as it can stick around I don't see any reason it won't remain a useful store of value.  It just won't be a real currency you swipe every day.\n\nThis is part of why many newer crypto are exploring a tendency towards inflation.  If you want to actually replace the dollar you have to give people both trust that it will hold value, but not inhibit spending.  It has to become mundane.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iagq49t",
                    "author": "koyoteshinigami",
                    "score": 1,
                    "created_utc": 1653854679.0,
                    "response": "the same people who believe inflation is good for the poor, also believes that printing trillions upon trillions of dollars has no effect on the economy. which both the don and sleepy have done",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iagstur",
                    "author": "qr52",
                    "score": 1,
                    "created_utc": 1653855982.0,
                    "response": "Never.  It's a scam.  The whole thing is.  It's a narrative put out by those that create money.  \n\nIn a bitcoin world, everything gets cheaper.  You feel richer, you spend more and get more and those that get your bitcoin get more value over time and spend more as prices get cheaper.  \n\nEverything is in reverse and ALL THAT DO WORK are rewarded.  The bankers DO NOT WANT everyone to benefit.  They want to maintain a system where they create money and get EXTREMELY wealthy while everyone else begs for their money.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iagw82o",
                    "author": "Procrastinatenow7",
                    "score": 1,
                    "created_utc": 1653857642.0,
                    "response": "It’s good for debt. Pay less tomorrow for what you borrow today",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iagz5x7",
                            "author": "Appeltaartlekker",
                            "score": 1,
                            "created_utc": 1653859082.0,
                            "response": "This is the answer.  It encourages peepz to invest  , not to save up. Unfortunately",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iah0ag3",
                    "author": "eqleriq",
                    "score": 1,
                    "created_utc": 1653859645.0,
                    "response": "inflation is just a balancing, just as deflation is. so to counter your \"why is it good\" question first determine that neither is deflation and the goal is balance.\n\nthe problem with inflation is the methods of beating it are reserved by the rich elites.\n\nsome people here like to pretend inflation is some sort of proactivity, when it is reactivity.\n\nbut anyway the tldr is inflation increases flow while deflation halts it. it's that simple. you want a sweet spot but that just creates wealth gaps.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iah1kza",
                    "author": "rudebwoy100",
                    "score": 1,
                    "created_utc": 1653860281.0,
                    "response": "If your salary increases 2 folds that's income inflation and it's definitely a good thing, same with asset appreciation.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iah3iah",
                    "author": "BHN1618",
                    "score": 1,
                    "created_utc": 1653861230.0,
                    "response": "Our economy runs in debt and without inflation you'll likely have deflation (very hard to stay at zero). Deflation means that a loan, like a mortgage, costs more in a year than it does today. You may never be able to repay it back and ultimately banks will not give out loans to people or businesses.\nThe keynsean argument is that the economy slows down but in reality it gives the govt power to finance things the people don't want by a roundabout way.\n\nThe more logical argument imo is that the economy will be a lot more efficient and loans will only be given under stricter conditions which will lead to a much better system where we don't over invest when money is cheap and then under invest when it's expensive and have these bipolar business cycles.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iahb7i9",
                    "author": "yrathore",
                    "score": 1,
                    "created_utc": 1653865161.0,
                    "response": "The money supply is inflated in the hope/expectation that the economy will grow. Why share the same pie when you can have an ever growing pie. \nMoney supply is inflated when new money is printed. New money is printed to provide credit. The easier it is to get credit and lower the interest rate, more people will borrow and use it to produce value either directly (creating goods and services) or indirectly (consuming goods and services). That is how it should work in theory. However this system gives unlimited power to those why are closest to the printer. It also makes it easier to continue getting easy credit without creating much value. Governments can and have misused it to fund their unnecessary expenditures, including war, and to essentially steal from those who save.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaheo9p",
                    "author": "Quick_Job8671",
                    "score": 1,
                    "created_utc": 1653866986.0,
                    "response": "A man buys a horse for $60. He sells the horse for $70. He then buys the horse back for $80. And he sells the horse again for $90. In the end, how much money did the man make or lose? Or did he break even?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iag73ro",
                    "author": "road22",
                    "score": 0,
                    "created_utc": 1653845813.0,
                    "response": "The money supply must increase as economy grows with more goods and services.  If the money supply did not grow then the currency would become more valuable and would have deflation (prices go down).\n\nImagine a world with constant economic growth (more goods and services) and the money supply is constant.  Would be constant deflation and there is a point where you could not break a penny in half.  Bitcoin fixes this because 1 btc can be broken down to infinity.\n\nGovernments hate deflation because bonds go negative and borrowing money is non existent.  If nobody could borrow to buy a home or car, we would be in the dark ages.\n\nToo much inflation is a really bad thing.  When it gets out of hand the currency becomes worthless and holders of the currency drop it like a hot potato.  Nobody can borrow because interest rates cannot keep up with inflation.  Governments have so much debt they cannot stop printing money which makes it even worse.   Bitcoin fixes this also because there is a limited amount.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}