{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "v18043",
            "title": "Could central banks stabilize their fiat by buying bitcoin?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/v18043/could_central_banks_stabilize_their_fiat_by/",
            "author": "Bedroom-Eastern",
            "created_utc": 1653939430.0,
            "score": 4,
            "num_comments": 6,
            "subreddit": "Bitcoin",
            "selftext": "Is there any chance a central bank could do something like this?\nOr would it just heat up inflation as the central bank would increase the supply of their fiat?\nEven if inflation went up, at that point they already got some bitcoin which eventually go up even further as most of us believe in bitcoin and its long term adoption.",
            "stickied": false,
            "comments": [
                {
                    "id": "iakxahr",
                    "author": "5tu",
                    "score": 4,
                    "created_utc": 1653940361.0,
                    "response": "History seems to indicate counties/central banks will buy commodities and currencies outside of their nation to stop hyperinflation.  Eg a country may choose to recreate their currency with a peg to say USD.\n\nThe idea is piggybacking on something that retains perceived value by others. Cryptocurrency like bitcoin have global value, so yes, its almost inevitable countries will need to include some in their central bank reserves because its easier and safer to store and transfer than physical representative value like gold.\n\nNations are likely going to do this slowly and quietly because they get better value than announcing it.\n\nPeople who say gold is the way forward in hard times remind me of those people who said the internet is great but it cant replace high street banks because we need to get our bank notes out at some point :)",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaky5iv",
                            "author": "NiceDoctorBeam",
                            "score": 2,
                            "created_utc": 1653940769.0,
                            "response": "But a central bank could stabilize its currency by turning off the \"money printer\".  They're not interested in stabilizing their currencies.  \n\nThey once *claimed* to back their currencies with gold, but they were lying and printing more notes than they had gold to cover.  They'd do the exact same with Bitcoin.  There is no reason to trust any central banker, in fact, there are plenty of valid reasons to NOT trust them, ever, for anything.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iakzdfv",
                    "author": "WritingFun8769",
                    "score": 2,
                    "created_utc": 1653941351.0,
                    "response": "if they stabilized their currencies, their economics would collapse. they’re going to try to manipulate the economy as best they can, like a top that’s spinning out of control; they can shift it for some time, but eventually it will fall.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ial845f",
                    "author": "Rtbrosk",
                    "score": 1,
                    "created_utc": 1653945519.0,
                    "response": "they can print at will......whats not stable",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ialot6j",
                    "author": "Ok_Aerie3546",
                    "score": 1,
                    "created_utc": 1653953939.0,
                    "response": "Like Do Kwon did?😂😂😂",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iakvhfs",
                    "author": "NiceDoctorBeam",
                    "score": 0,
                    "created_utc": 1653939514.0,
                    "response": "No.  Not for long.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}