{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uxct4q",
            "title": "On Bitcoin and common FUD",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/uxct4q/on_bitcoin_and_common_fud/",
            "author": "cryptoundead",
            "created_utc": 1653467444.0,
            "score": 2,
            "num_comments": 2,
            "subreddit": "BitcoinBeginners",
            "selftext": "I hear a lot of FUD in the mainstream media about Bitcoin being this risky zero-sum ponzi scheme. Bitcoin has no value, it's rat poison squared, you all know the lines, we all heard it.\n\nI undestood Bitcoin in the first second after hearing about it, why? The first place I heard about Bitcoin was on a private torrent site, where they accepted bitcoin donations. Everything made sense immediately.\n\nThere is nothing innovative about blockchain. The term cryptocurrency is more of a buzz word and a gimmick at this point, the decentralized technology behind the blockchain existed way before Bitcoin came around.\n\nBlockchain innovation is in it being used for wealth and value transfer. It's a long proven secure way of storing data. It has been around for many many years yet some people struggle to understand it to this day.\n\nWe know for a fact it cannot be stopped - they tried, not just for Bitcoin, but all the private and public torrent sites out there. They seize their domain names and the next day you find another 20 proxy domains for the same website.\n\nIf you think that has no value, then I don't know what else to say.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9wux5p",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653467445.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9wv5u2",
                    "author": "BTCMachineElf",
                    "score": 1,
                    "created_utc": 1653467662.0,
                    "response": "Nice post, but it belongs in r/bitcoin, not r/bitcoinbeginners, as this sub rule #1 is that posts must be questions.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}