{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uqo0p4",
            "title": "Bitcoin vs physical money",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uqo0p4/bitcoin_vs_physical_money/",
            "author": "BJJ_M_A",
            "created_utc": 1652676903.0,
            "score": 5,
            "num_comments": 7,
            "subreddit": "Bitcoin",
            "selftext": "A lot of people believe BTC will replace fiat. Personally I think it will become a secondary currency which is accepted alongside fiat where people can choose between using the 2. All that aside, if BTC is to replace fiat, how would the issue of physical money be addressed.\n\nBTC may be all good if you want to buy a new Macbook online, but how would someone in the back ass of nowhere with little to no access to the internet make payments at their local convenience store for example. \n\nOne solution I’ve thought of and heard floating around is similar to how gold backed currencies would operate. E.g. credit (such as a note for X amounts of sats) is issued which people can exchange. However, this obviously falls into the same pitfalls as current currencies And elimiates the point of BTC.\n\n1-You would have to trust some entity to honour that credit\n\n2- You would have to trust that said entity doesn‘t just issue more credit than they can honour\n\n3- The transfer of that money would be offline, therefore wouldn’t be logged completely on the blockchain (E.g. if I give person X 1BTC, and person X redeems his credit. The BTC would essentially just show as going from the entity which issues credit to person X without me involved at all). (This isn’t really that big of an issue, similar is/can be done with hardware wallets I guess)\n\n&#x200B;\n\nThe only possible solution I can think of which addresses some of the above issues  is as follows:\n\nEach person has their own BTC address from which they can issue credit. How can this be done? BTC ‘bank’ companies could start up which allow individuals to issue credit based on said individuals own BTC holdings. The BTC for which credit is issued for cannot be used by the owner unless they cash in their issued credit. The company would manage the settlement of cashing in credit. How can this be viable / profitable for the company? The company could charge a % fee on the amount of BTC they are issueing physical credit for. E.g. you want 1 BTC in physical credit notes, the company charges 0.1% (or however much) on your BTC to do so. Said company could set up branches just like banks to help people make accounts and do business. Of course, the pitfalls are once again somewhat similar, just now similar to banks. You have to trust the company not to squander your BTC, or use it, or even go bankrupt.\n\n&#x200B;\n\nApologies if this sounds stupid, I am pretty new to crypto so my understanding isn’t 100% good at all.\n\n&#x200B;\n\nAny more suggestions / alternatives?\n\n&#x200B;\n\nTLDR - How can BTC replace physical cash?",
            "stickied": false,
            "comments": [
                {
                    "id": "i8sbg36",
                    "author": "DavidKens",
                    "score": 2,
                    "created_utc": 1652678214.0,
                    "response": "It’s a creative idea, but I think the answer is that the cash we have today will stick around partly to solve this exact problem. It might become the only point of fiat. \n\nThe original point of fiat was to be the most reliable version of exactly what you’re describing.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8sbh5k",
                    "author": "ndgoLiberty",
                    "score": 1,
                    "created_utc": 1652678234.0,
                    "response": "In 5 years cash won't exist. So why try to replace a dying payment method. Plastic is still king make a plastic bitcoin card.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8sch8p",
                    "author": "burningETH",
                    "score": 1,
                    "created_utc": 1652678924.0,
                    "response": "fiat go down. bitcoin go up",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8seary",
                    "author": "GrabOk460",
                    "score": 1,
                    "created_utc": 1652680228.0,
                    "response": "It’ll never replace fiat. It’s a neat idea, but it’ll never happen.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8sm17j",
                    "author": "magneticman245",
                    "score": 1,
                    "created_utc": 1652686396.0,
                    "response": "Something to consider is there are already ways to give bitcoin \"physically\", using a product like Opendime. It's a secure usb stick that holds a private key which can't be seen unless you physically break the device. You can send bitcoin to the address on the stick, and then the stick can be passed around until someone breaks it to access the private key and moves the coins to their own wallet. In a few years I reckon there will be a lot more options for this sort of thing too, which could be used alongside fiat cash.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8smf2a",
                    "author": "Lolfcklol",
                    "score": 1,
                    "created_utc": 1652686737.0,
                    "response": "Maybe people will adopt a similar mentality like they allegedly did way back when, with gold-silver\n\nGold-Btc- store of wealth or larger purchased\n\nSilver-fiat- day to day transactions\n\nWho knows what the future holds. Thats the fun part",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}