{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "v10479",
            "title": "Sums up pretty much 70% of the reactions and people",
            "url": "https://www.reddit.com/r/Bitcoin/comments/v10479/sums_up_pretty_much_70_of_the_reactions_and_people/",
            "author": "johny_banana",
            "created_utc": 1653916972.0,
            "score": 3,
            "num_comments": 1,
            "subreddit": "Bitcoin",
            "selftext": "Just gonna drop this info here including the comments. He even invited me to chat. \n\nhttps://preview.redd.it/l72q5efo6m291.jpg?width=913&format=pjpg&auto=webp&s=c555fd6fcc319f1d64272c4137bb2eaf8f0f256d",
            "stickied": false,
            "comments": [
                {
                    "id": "iajman8",
                    "author": "RunKlutzy5350",
                    "score": 1,
                    "created_utc": 1653918868.0,
                    "response": "I’d chat with him, ask him about how his poops are and recommend a coin based on this information.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "v10exc",
            "title": "What are the best ways to explain Bitcoin to children?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/v10exc/what_are_the_best_ways_to_explain_bitcoin_to/",
            "author": "coincorner",
            "created_utc": 1653917905.0,
            "score": 8,
            "num_comments": 49,
            "subreddit": "Bitcoin",
            "selftext": "Last week I went into a local primary school to talk to Year 6 (age 10-11) students about Bitcoin. I showed them a chart of how the price of a Freddo chocolate bar has changed over time and they were appalled to find out that they were paying three times as much as I had at their age! When I asked them why they thought the price had gone up, they came up with a range of sensible answers relating to supply and demand - and one of them even volunteered that there is more money now than in the past. It was a great \"hook\" to introduce Bitcoin and why its fixed supply is important. \n\nI'm hoping to do more school sessions and I'd love to hear about your experience explaining Bitcoin to children. What works? What doesn't? Do you have any effective analogies / activities / games to get them thinking along the right lines?\n\nThanks!\n\nMSW - Data Analyst at [CoinCorner](https://www.coincorner.com/)\n\n(P.S. Why not set up a DCA and [Buy Bitcoin](https://www.coincorner.com/Bitcoin-Auto-Buy) regularly without worrying about the price?!)",
            "stickied": false,
            "comments": [
                {
                    "id": "iajml6k",
                    "author": "NiceDoctorBeam",
                    "score": 28,
                    "created_utc": 1653919017.0,
                    "response": "You play the board game \"Monopoly\" with them.  You are the banker.  You, and you alone get to reach into the money supply and pull out $500 and/or $100 bills at will, then give them to yourself or your \"friend\".  \n\nWhen the other children complain that it isn't fair, you explain that THIS is how \"money\" works in real life, and YES, it is NOT fair (the kids are right).  \n\nThen you ask them, \"Would it be fair if a computer kept track?  A very specially designed computer such that nobody could ever cheat...\"",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iajn1aa",
                            "author": "coincorner",
                            "score": 12,
                            "created_utc": 1653919246.0,
                            "response": "Oh! I like this one! \n\nTriggering that feeling of injustice is likely to be more effective than a purely intellectual appeal :)",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iajozvc",
                                    "author": "NiceDoctorBeam",
                                    "score": 8,
                                    "created_utc": 1653920220.0,
                                    "response": "It's a lesson they'll never forget.  \n\nA quicker version, if the kids/people are old enough, play poker with them.  Get one of those chip holder things.  Deal the same amount to each person.  Explain to them that you are the Central Banker.  Make that clear.  Then put a real $100 bill up as the prize for the winner.  Remember: You and you alone have access to the plastic thing with the rest of the chips.  \n\nStart playing poker.  Feel free to dip into the extra chips any time you feel like it, to raise the pot.  The idea is, you don't want to lose your real $100 bill.  \n\nWhen the other contestants complain, explain to them that as the Central Banker it is your job and duty:  \n* to inject liquidity into the system  \n* to provide 'necessary' inflation  \n* to stimulate the economy  \n* to prevent deflation  \n\nWhen they call your bluff, CALMLY inform them that this is EXACTLY how their own financial system actually works.  They should be *used to it* by now.  It's never bothered them before.  Why make such a fuss now?  \n\nThen mention the special computer...  Wouldn't that be a better system?   \"Well, that's exactly what Bitcoin is.\"",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "iak270g",
                                    "author": "bitcoin_barry",
                                    "score": 2,
                                    "created_utc": 1653926324.0,
                                    "response": "Don't do this. It is clearly manipulative and I'd be surprised if you don't get thrown out of the school and told never to talk to kids again.\n\nDiscussions are fine, and allowing kids to express their questions and answers is always good.\n\nI actually don't think presenting bitcoin as the answer to anything is right. You're giving answers instead of allowing minds to explore and self-learn.\n\nDon't have the goal of orange pilling kids, that's almost immoral in my opinion, do set a spark.\n\nIntroduce Bitcoin for sure, don't introduce it as a solution to anything and maybe even disclaimer that not many people understand all the complexities of money and inflation, that it is a long and difficult thing to explain etc.\n\nI don't know, I just feel like witnessing this sort of what I can only describe as an intentional radicalisation would concern me even if it were pro bitcoin (considering I'm pro Bitcoin).",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iak38m2",
                                            "author": "ericdh8",
                                            "score": 2,
                                            "created_utc": 1653926787.0,
                                            "response": "But this is what is being done to the masses of our future leaders and has been done for generations.  Its time… flip the script.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iak3qka",
                                                    "author": "bitcoin_barry",
                                                    "score": 1,
                                                    "created_utc": 1653927008.0,
                                                    "response": "Well, it's for their own reputation that they shouldn't do this. That and any backfire will ultimately affect the kids.\n\nAlso just because someone is brain washing, doesn't mean we fix it by counter brainwashing.\n\nWe gotta teach due diligence and critical thinking.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iak4s7u",
                                                            "author": "ericdh8",
                                                            "score": 1,
                                                            "created_utc": 1653927470.0,
                                                            "response": "Do you honestly believe in the age of information and instant gratification you got a shot at holding their attention for 10 mins to teach DD?  Parents should be teaching this anyways not just schools.  It’s much easier to hand them an iPad or PS5 than spend 30mins a week on the economic impact of endless money printing.  Wanna make a change?  Volunteer for Jr. Achievement and go see for yourself.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "iaju8bt",
                            "author": "unchima",
                            "score": 4,
                            "created_utc": 1653922706.0,
                            "response": "Thing is even monopoly has universal basic income just to keep it going....",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iak9995",
                            "author": "Sleevelezz",
                            "score": 1,
                            "created_utc": 1653929430.0,
                            "response": "That's a really good one m8",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iakc8z7",
                            "author": "horsecyack",
                            "score": 1,
                            "created_utc": 1653930751.0,
                            "response": "Just teach the kids to cheat bro no special computer needed",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "iajsczt",
                            "author": "yolodogewtf",
                            "score": -3,
                            "created_utc": 1653921829.0,
                            "response": "Lol countries will assume massive debt in BTC just like they did with gold \n\nSorry to burst your bubble",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iajvgue",
                                    "author": "NiceDoctorBeam",
                                    "score": 4,
                                    "created_utc": 1653923277.0,
                                    "response": "Unlike fiat currency, Bitcoin cannot be created from thin air, backed by nothing via a few button clicks on a central bank's computer.  \n\n\nIntro: The Trust Machine (22 min):  \nhttps://www.youtube.com/watch?v=ZKwqNgG-Sv4\n\nSaylor Explains:  \nhttps://www.reddit.com/r/Bitcoin/comments/s54g8x/send_this_to_your_contacts_interested_in_bitcoin/\n\nRead: \"The Bitcoin Standard,\" by S. Ammous",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iajlw6l",
                    "author": "RunKlutzy5350",
                    "score": 5,
                    "created_utc": 1653918660.0,
                    "response": "The only way to teach kids about BTC is to teach them what money is, then teach them what it means to be fiat, then highlight the downfall of infinite printing and inflation (the hardest part) then introduce Bitcoin and highlight the macro monetary benefits of it and limited technological overview. \n\nThen send them on their Marry way to figure it out for themselves. \n\nShow them the BTC coin logo they will be all ears.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iajun0y",
                    "author": "gorilla--",
                    "score": 5,
                    "created_utc": 1653922894.0,
                    "response": "Internet money",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iak4gsk",
                            "author": "CoinCorner_Sam",
                            "score": 1,
                            "created_utc": 1653927329.0,
                            "response": "*Magic internet money.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iajvt2z",
                    "author": "the_last_grabow",
                    "score": 4,
                    "created_utc": 1653923435.0,
                    "response": "It's money on the internet that is verified by computers, not governments or banks.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iajqx5n",
                    "author": "Praxxtice",
                    "score": 2,
                    "created_utc": 1653921147.0,
                    "response": "Legos.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iajzld2",
                            "author": "coincorner",
                            "score": 2,
                            "created_utc": 1653925160.0,
                            "response": "Enough said!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iajv76f",
                    "author": "MrFatwa",
                    "score": 2,
                    "created_utc": 1653923151.0,
                    "response": "There is a rich greedy man that wants to control the value of the coins in your piggy bank, and how you spend them.\n\nThe rich greedy man loses some his powers when you instead use Bitcoin in your piggybank.\n\nWith Bitcoin, your piggy bank belongs to you, and nobody can ever steal it or take it from you (including your dad).\n\nIts quite likely your Bitcoin piggybank will be worth much more as you get older, whereas your money coins will be worth less as you get older.\n\nAlso, Bitcoin could go to zero, that is the risk....and stay away from 20x derivative trading kid.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iajzu48",
                            "author": "coincorner",
                            "score": 0,
                            "created_utc": 1653925268.0,
                            "response": "One kid asked me about NFTs. I made sure to give my most disparaging look.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iajy4e5",
                    "author": "Fun_Bad_8860",
                    "score": 2,
                    "created_utc": 1653924495.0,
                    "response": "Just show them how fiat money works. They are clever they will check that this system is shit",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iajz7vx",
                    "author": "deepspacestudios",
                    "score": 2,
                    "created_utc": 1653924990.0,
                    "response": "Just explain what fed is doing. Your child will suddenly ask you a question which is starting like “dad, why dont you do sth like..” When you heard that just say yes we have btc .",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iak45dn",
                    "author": "BashCo",
                    "score": 2,
                    "created_utc": 1653927190.0,
                    "response": "Michael Caras [@thebitcoinrabbi](https://twitter.com/thebitcoinrabbi) wrote a children's book about Bitcoin.\n\n[Bitcoin Money: A Tale of Bitville Discovering Good Money](https://www.amazon.com/Bitcoin-Money-Tale-Bitville-Discovering/dp/0578490676/)\n\n\nAlso, random Duck Tales clip: https://www.youtube.com/watch?v=t_LWQQrpSc4",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iak8ypc",
                    "author": "PV3T",
                    "score": 2,
                    "created_utc": 1653929301.0,
                    "response": "Children are no more stupid than adults and may understand the essence of Bitcoin much faster.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iakiumu",
                    "author": "clickworker2019",
                    "score": 1,
                    "created_utc": 1653933694.0,
                    "response": "Children shouldn't have to worry about bitcoins.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaju0cu",
                    "author": "Apelcina",
                    "score": 4,
                    "created_utc": 1653922600.0,
                    "response": "Put a chocolate close to their mouth then shove a Bitcoin in it",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iajzph4",
                            "author": "coincorner",
                            "score": 1,
                            "created_utc": 1653925211.0,
                            "response": "Visceral.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iajrwki",
                    "author": "NotPresidentChump",
                    "score": 2,
                    "created_utc": 1653921615.0,
                    "response": "I have coin. I have a computer Bit. Uh! Bit-coin!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iak73qm",
                    "author": "Nyanzerfaust",
                    "score": 2,
                    "created_utc": 1653928479.0,
                    "response": "You don't",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iajkl40",
                    "author": "One_Landscape541",
                    "score": -2,
                    "created_utc": 1653917983.0,
                    "response": "Why would you ever explain bitcoin to a child?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iajl9qn",
                            "author": "Makaveli_is_back",
                            "score": 8,
                            "created_utc": 1653918340.0,
                            "response": "Why wouldn’t you they already explain money to them in school",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iajly9d",
                                    "author": "coincorner",
                                    "score": 3,
                                    "created_utc": 1653918690.0,
                                    "response": "I think part of the problem is that basic financial education in most schools is pretty useless (at least in my part of the world)!",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iajn759",
                                            "author": "Makaveli_is_back",
                                            "score": 3,
                                            "created_utc": 1653919326.0,
                                            "response": "In the U.S you only really learn the amount like what a dollar is what a quarter is etc… but they should teach more than that like credit scores, banking, and investing but anything that’s not on the sat or act don’t get taught which is terrible. I’m glad my parents taught me about credit scores and investing. it’s sad meeting an 18 or 20 year old that has no knowledge of what an impact is to not have a good credit score or not having knowledge about investing.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iak2t14",
                                                    "author": "bitcoin_barry",
                                                    "score": 1,
                                                    "created_utc": 1653926595.0,
                                                    "response": "To be honest, maybe that's all that needs to be taught about bitcoin too.\n\nEven go as far as to describe products in bitcoin like \"a bottle of milk costs 1234 sats\".\n\nIt's inception, they'll get to the -- Bitcoin preserves value compared to the dollar -- all by themselves.\n\nFunny thing is, when we learn money without the whole \"everything is credit\" part, we are basically learning hard money... We are learning Bitcoin and if both are on mind, it's easy to see which is really money and which is not.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "iajn8n9",
                                            "author": "Bapster69420",
                                            "score": 3,
                                            "created_utc": 1653919347.0,
                                            "response": "I think about this often. How do we have sophisticated education in schools when it comes to science, math, literature etc but not provide real insight to money, pretty much the first things on everyone’s mind all the time? I think society or governments designed it this way to keep people dumb.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "iajmw78",
                                    "author": "NiceDoctorBeam",
                                    "score": 3,
                                    "created_utc": 1653919175.0,
                                    "response": "I never had \"money\" explained to me in any school.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iajtrjq",
                                            "author": "Makaveli_is_back",
                                            "score": 1,
                                            "created_utc": 1653922486.0,
                                            "response": "Well I did in second grade I’m 26 idk how old you are",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "iajmcaa",
                                    "author": "One_Landscape541",
                                    "score": 0,
                                    "created_utc": 1653918892.0,
                                    "response": "10 years old…",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "iajy75o",
                            "author": "AskALettuce",
                            "score": 3,
                            "created_utc": 1653924530.0,
                            "response": "Why wouldn't you explain to a child?\n\nDo you understand the concept of \"school\"?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iak9sab",
                                    "author": "One_Landscape541",
                                    "score": 2,
                                    "created_utc": 1653929663.0,
                                    "response": "Half our children can’t read, i think we have more pressing issues",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iakngwq",
                                            "author": "AskALettuce",
                                            "score": 1,
                                            "created_utc": 1653935773.0,
                                            "response": "Half our adults can't think, teaching children to would be a good start.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "iajmzze",
                            "author": "NiceDoctorBeam",
                            "score": 1,
                            "created_utc": 1653919228.0,
                            "response": "Why would you ever explain *anything* to a child?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iak3d4y",
                    "author": "bitcoin_barry",
                    "score": 1,
                    "created_utc": 1653926843.0,
                    "response": "If you have many days, bake it into some entrepreneur side project.\n\nKids come up with ideas, you give them coupons to buy resources and build their business, others come up with more ideas, at some point let's see if people realise that their costs of living goes up over time.\n\nThen do it again with a fixed supply.\n\nMake sure people have certain commitments: everyone gotta eat, everyone gotta have a hobby if they can afford it and if not, make a non-financial penalty?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iakc2mw",
                    "author": "horsecyack",
                    "score": 1,
                    "created_utc": 1653930671.0,
                    "response": "1 cheerio + 1 cheerio = 3 cheerio",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iakd2la",
                    "author": "MGTOW_and_Bitcoin",
                    "score": 1,
                    "created_utc": 1653931113.0,
                    "response": "Children do not struggle with Bitcoin as much as adults who have normalized many of the market fetishes associated with fiat currency.\n\nIf they're old enough to understand why sand could not work as money and they're already spending much of their time online buying digital assets for their characters the youth are not going to struggle",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iakmw3e",
                    "author": "maininshadow",
                    "score": 1,
                    "created_utc": 1653935514.0,
                    "response": "Make them mow the lawn for a few sats.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iakni1u",
                    "author": "killzenth",
                    "score": 1,
                    "created_utc": 1653935787.0,
                    "response": "Is a code than costs a lot of energy to compute so people change it for money to pay the energy bills and the computer usage plus an extra for groceries and nice things.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaknxrq",
                            "author": "killzenth",
                            "score": 1,
                            "created_utc": 1653935990.0,
                            "response": "Btw you had the worse way possible to explain it to 6yo. I would have painted yellow a paper or brought one of those bitcoin penny and show it to them and makes them think you can give it for for dollars and the more you do it the more value it gets",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iajp31t",
                    "author": "Whatwhat0420",
                    "score": -2,
                    "created_utc": 1653920263.0,
                    "response": "I blew your college fund but had your best interests at heart",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}