{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uyjnsm",
            "title": "Here in the south of the U.K I'm getting fed up of seeing nationally the ignorance towards cryptocurrency and blockchain tech. I'm sure some of you share my frustration, it's knowledge I've never said 'hey man dump 200 into BTC' merely said research it, but many don't. Is mass adoption real?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uyjnsm/here_in_the_south_of_the_uk_im_getting_fed_up_of/",
            "author": "One-Dependent4376",
            "created_utc": 1653605196.0,
            "score": 13,
            "num_comments": 20,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "ia4ke74",
                    "author": "anotherbrckinTH3Wall",
                    "score": 8,
                    "created_utc": 1653606346.0,
                    "response": "If your expectations are not being met, I’d it maybe time to review your expectations?\n\nI am patient, I’m not in a rush, I think it’s inevitable. \nWhen I first got into Bitcoin I was hoping and expecting it to take off to the moon. I did some research and tempered my expectations. \n\nI know more people now that are into bitcoin than I did 2 years ago, but I’ve also stopped trying to explain it to people, if they don’t get it, I do r have the time to explain it to them.\n\nI think we are still relatively early, and I believe I. Bitcoin, it’s use, and as a tool for financial liberation",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia610x4",
                    "author": "NYKNYb",
                    "score": 3,
                    "created_utc": 1653635931.0,
                    "response": "*\"cryptocurrency and blockchain tech\"*\n\nCheck your own ignorance. \"Crypto\" is an attack on Bitcoin. Blockchain is a technology that only applies to Bitcoin.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia6bs3q",
                            "author": "CallingVoid",
                            "score": 5,
                            "created_utc": 1653645567.0,
                            "response": "Blockchain technology is itself such a loaded phrase, it implies that blockchain is what is special.\n\nYou could call it list technology. Our crypto shitcoin uses ***list technology*** and therefore is secure. It's ridiculous.\n\nBitcoin's blockchain works because proof of work makes it nigh on impossible to attack. Bitcoin's implementation of proof of work is the true innovation, and nobody can copy it because to do so would require billions of dollars of ASICs and billions of dollars of electricity, with miners spread out all over the world, held to account by a global network of thousands of nodes run by enthusiastic individuals.\n\nShitcoins cannot do this. So they are inherently weak and vulnerable, I think if people knew just how vulnerable they truly were then they would absolutely shit their pants.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia4ytvg",
                    "author": "pinshot1",
                    "score": 3,
                    "created_utc": 1653613360.0,
                    "response": "Don’t tell them. Just let them watch you get yours. They will be very jealous.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia5y3e8",
                    "author": "iammasvidal",
                    "score": 3,
                    "created_utc": 1653633515.0,
                    "response": "Im that area too and feel the same way.\n\nI want real people I can talk to about it without sounding like a loon. \n\nWe must just be so early still.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia6cr6c",
                            "author": "LuKeNuKuM",
                            "score": 2,
                            "created_utc": 1653646386.0,
                            "response": "Hah, yeah it's annoying. Once you've caught the bug you want to talk about it but you're right most people just think you're a nutter.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia6bs14",
                    "author": "Lornd",
                    "score": 3,
                    "created_utc": 1653645565.0,
                    "response": "I think inflation really is the catalyst for change in this area although hopefully people stay away from “crypto”.  People can afford to be ignorant of government monetary policy when inflation of consumer prices is 2%.  When it’s trending towards 10% they can’t. \n\nThere are many people in UK and in the western world generally that have never experienced high inflation in their adult life including myself. They trust in the government’s ability to solve it.  For now…\n\nPeople in the rest of the world are far more aware of government monetary mismanagement, they have been living through it for their entire lives.  They see the uses of bitcoin and other hard assets because their local currencies cannot retain value in the short term never mind the medium or long term. \n\nThe erosion of trust in government economic policy is a one way street in a highly inflationary environment.  People will inevitably be forced to educate themselves on hard assets.  Those who do some basic research will settle on traditional hard assets like gold. Those who choose to venture down the bitcoin rabbit hole will store at least some of their wealth in bitcoin.  Ultimately my speculation is that Bitcoin maximalism is the end result.  The only question is how long it takes.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia6ffp8",
                    "author": "Eyonizback",
                    "score": 2,
                    "created_utc": 1653648511.0,
                    "response": "We need to recruit more people, keep telling more people to buy in.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia4pt86",
                    "author": "Hedgetrimmer10",
                    "score": 2,
                    "created_utc": 1653608942.0,
                    "response": "It is real and it is being suppressed so that institutions can gobble up as much as they can possibly get their hands on.  Diamond hands on my friend.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia5wzvr",
                    "author": "kDelta",
                    "score": 1,
                    "created_utc": 1653632671.0,
                    "response": "People in the south of the UK are pretty dumb and voted to flush their economy down the toilet because some fraudsters told them to. I'd hardly expect them to know much about anything to be honest.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia54o8u",
                    "author": "Mallardshead",
                    "score": -1,
                    "created_utc": 1653616213.0,
                    "response": "Hyperinflation is coming. The USD is trapped. We'll see one more gasp up in markets before then. China is going into Taiwan maybe Christmas or New Year's. Turkish Lira is going hyper first. Destabilization there. All hell will break loose 2023.\n\nEurope: Food. Bitcoin. Bicycle.\n\nUS: Food. Bitcoin. Guns. Bicycle\n\nKudos if you buy a small gasoline syphon, get antibiotics, and water purification as well",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia6dz17",
                            "author": "Eyonizback",
                            "score": 1,
                            "created_utc": 1653647388.0,
                            "response": "Jesus you think world is ending",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia6gk5b",
                                    "author": "Mallardshead",
                                    "score": 2,
                                    "created_utc": 1653649322.0,
                                    "response": "Not this year. It will appear that way next year however.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia4pcxy",
                    "author": "JSammut29",
                    "score": 1,
                    "created_utc": 1653608720.0,
                    "response": "Maybe Chelsea can get a crypto sponsor and they can buy a NFT. Lol",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia605d9",
                    "author": "Bitcoin__Hodler",
                    "score": 1,
                    "created_utc": 1653635183.0,
                    "response": "be happy that you can invest at such low prices",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia93g9d",
                    "author": "igadjeed",
                    "score": 1,
                    "created_utc": 1653693530.0,
                    "response": "> Is mass adoption real?\n\nAdoption is real  \nMass adoption is not real",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia6m6m7",
                    "author": "Public-Gap4804",
                    "score": 0,
                    "created_utc": 1653653031.0,
                    "response": "this is the country who voted to leave eu, what do you expect?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia7100f",
                            "author": "OldMercenary",
                            "score": 1,
                            "created_utc": 1653660553.0,
                            "response": "More will follow.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}