{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "txl55k",
            "title": "If the US had a CBDC at its founding, blacks and women would still not be able to vote, homosexuality would still be illegal, and we'd still be under prohibition.",
            "url": "https://www.reddit.com/r/Bitcoin/comments/txl55k/if_the_us_had_a_cbdc_at_its_founding_blacks_and/",
            "author": "proph3tsix",
            "created_utc": 1649248480.0,
            "score": 12,
            "num_comments": 53,
            "subreddit": "Bitcoin",
            "selftext": "A CBDC \"freezes\" political moral progress, because it allows those in power to crush the tiniest of protests.\n\n[thank you kind stranger for the gold!]",
            "stickied": false,
            "comments": [
                {
                    "id": "i3mbrsp",
                    "author": "anajoy666",
                    "score": 14,
                    "created_utc": 1649249755.0,
                    "response": "You can’t have political freedom without financial freedom. One of Mises’ six lessons.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i3po6u0",
                    "author": "MarcusCryptus",
                    "score": 2,
                    "created_utc": 1649298465.0,
                    "response": "This isa wild take and demonstrates a deep understanding of these issues at the time of the founding of the US.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i3mifog",
                    "author": "Vegetaman916",
                    "score": 4,
                    "created_utc": 1649252753.0,
                    "response": "The real awesome thing about money in any form is that you don't have to use it if you don't want to. My neighbor pretty much pays for everything in heroin, lol.\n\nI don't plan on using CBDCs. Problem solved.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i3mll27",
                            "author": "anajoy666",
                            "score": 2,
                            "created_utc": 1649254071.0,
                            "response": "That’s not true, the government can force business to accept its currency and us to pay taxes with it.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i3my55x",
                                    "author": "proph3tsix",
                                    "score": 3,
                                    "created_utc": 1649259059.0,
                                    "response": "And in turns force (incentivize) them to pay employees with it.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i3mxwj1",
                            "author": "proph3tsix",
                            "score": 1,
                            "created_utc": 1649258967.0,
                            "response": "I assume you are in an extremely small minority. Most people draw a paycheck from employment, which, if paid in CBDC, marks the beginning of the end of their ability to use money as they wish.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i3neez7",
                                    "author": "Vegetaman916",
                                    "score": 1,
                                    "created_utc": 1649265232.0,
                                    "response": "Convert it to something else, then. Amish stores won't take it. Beach bars in the Caribbean won't take it. Cabbies in Tijuana won't take it.\n\nIt's just a currency like any other. Convert it. Buy gold. Buy a barrel of oil and sell it for roubles if you like.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i3neeh9",
                                    "author": "Vegetaman916",
                                    "score": 0,
                                    "created_utc": 1649265227.0,
                                    "response": "Convert it to something else, then. Amish stores won't take it. Beach bars in the Caribbean won't take it. Cabbies in Tijuana won't take it.\n\nIt's just a currency like any other. Convert it. Buy gold. Buy a barrel of oil and sell it for roubles if you like.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i3pvwkr",
                                            "author": "proph3tsix",
                                            "score": 1,
                                            "created_utc": 1649302316.0,
                                            "response": "I don't think you know what a CBDC is? You can only convert a CBDC into what the issuer ALLOWS it to be converted into.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i3mrj80",
                    "author": "wadejohn",
                    "score": 3,
                    "created_utc": 1649256474.0,
                    "response": "If ‘they’ wanted to exert that much control over your life they already have 1000 ways to do it easily.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i3mxdbd",
                            "author": "proph3tsix",
                            "score": 4,
                            "created_utc": 1649258763.0,
                            "response": "So what's one more, am I right? /s\n\nIf you're suggesting that a CBDC isn't an immense threat to human sovereignty, then I don't know what you're doing in this sub? One of the central reasons for Bitcoin is personal financial sovereignty, and a CBDC is completely antithetical to that.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i3n1nxe",
                            "author": "anajoy666",
                            "score": 0,
                            "created_utc": 1649260408.0,
                            "response": "Politicians want to exert as much control over your life as possible. All governments naturally tend to authoritarianism.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i3mmi1w",
                    "author": "Knerd5",
                    "score": 2,
                    "created_utc": 1649254449.0,
                    "response": "Terrible take and also 100% conjecture. These are the types of posts that make the bitcoin community look stupid.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i3n0hdx",
                            "author": "anajoy666",
                            "score": 4,
                            "created_utc": 1649259960.0,
                            "response": "It’s not a conjecture, all major social changes (french revolution, universal suffrage, civil rights, current lgbtqaihjkll) came about through individual initiative and economic pressure/demand. Those things would never have been gifted by a benevolent dictator or come about through “historical necessity”.  Just look at actual socialist counties and more generally dictatorships and see how far behind they are.\n\nWhether you agree with these movements or not, OP’s post is how we sell bitcoin to the people who would otherwise fall for environment  concern trolls.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i3n3fmr",
                                    "author": "Knerd5",
                                    "score": 0,
                                    "created_utc": 1649261077.0,
                                    "response": "If you think a CBDC would have stopped any of those things, then you clearly don’t understand the definition of revolution.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i3n5epi",
                                            "author": "anajoy666",
                                            "score": 1,
                                            "created_utc": 1649261828.0,
                                            "response": "Just look at countries where the government controls large parts of the economy. Political dissident? Either you lose your job or is sent to Siberia.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i3n6c84",
                                                    "author": "Knerd5",
                                                    "score": 3,
                                                    "created_utc": 1649262177.0,
                                                    "response": "Welcome to life? In America we have the luxury of corporations controlling a massive segment of the economy where they set the rules and are UNELECTED. Best part, they fund our politicians to allow this unabated. CBDC’s ain’t gonna change that and neither is anyone whining about it.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i3n8gvh",
                                                            "author": "anajoy666",
                                                            "score": 2,
                                                            "created_utc": 1649263013.0,
                                                            "response": "You might not like some or all corporations but they are absolutely not the same as the government. For how terrible you think America is, compare it to Venezuela, China or Argentina where those corporations are controlled by the government.\n\nCBDC are one more tool the government can use to exert control. And yes, lobbying against it can change things the same way it has in the past and this is kinda the point of the thread.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i3n8x23",
                                                                    "author": "Knerd5",
                                                                    "score": 2,
                                                                    "created_utc": 1649263182.0,
                                                                    "response": "The government and corporations do whatever they want. You thinking they can be lobbied by citizens is ADORABLE.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i3nahqg",
                                                                            "author": "anajoy666",
                                                                            "score": 2,
                                                                            "created_utc": 1649263773.0,
                                                                            "response": "Governments and corporations are organizations of people so what you said already doesn’t make much sense.\n\nAnyways: not true as I’ve shown above. Compare the political autonomy someone has in America vs Venezuela. CBDCs are one more step towards Venezuela.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i3pvlcr",
                                            "author": "proph3tsix",
                                            "score": 1,
                                            "created_utc": 1649302152.0,
                                            "response": "If you think a CBDC would NOT have stopped any of those things, then you clearly don't understand the definition of a CBDC.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i3mwvpk",
                            "author": "proph3tsix",
                            "score": 3,
                            "created_utc": 1649258573.0,
                            "response": "The statement that this post makes the Bitcoin Community looks stupid is also 100% conjecture.\n\nA CBDC would be pivotal to the realization of any truly Orwellian nightmare. It represents an almost infinite ability to manipulate the masses. Organized protests (while infrastructure holds) will become a thing of the past.\n\nIf you believe we could have achieved many of the rights minorities enjoy today without the slightest protest, then THAT would be conjecture.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i3n863w",
                                    "author": "spottypot",
                                    "score": 3,
                                    "created_utc": 1649262901.0,
                                    "response": "Next time you respond to someone with such a well thought out response leave out he \"I'm not sure what rock your been living under\" part.  It brings you down to the level of the person that said your post makes us look stupid.  Take the high ground.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i3pvnjk",
                                            "author": "proph3tsix",
                                            "score": 1,
                                            "created_utc": 1649302184.0,
                                            "response": "You're absolutely right. Thanks for the critique!",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i3n1dq4",
                                    "author": "Knerd5",
                                    "score": -2,
                                    "created_utc": 1649260301.0,
                                    "response": "You’re using the word would when you should be using the word could. Many of us do not have the same persecution complex that you do.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i3mjzw2",
                    "author": "Guswanicarbohydrate",
                    "score": 1,
                    "created_utc": 1649253419.0,
                    "response": "We would all be slaves, that is, literal property of other men.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i3miqvj",
                    "author": "Marcion_Sinope",
                    "score": 0,
                    "created_utc": 1649252888.0,
                    "response": "These aren't the examples you're looking for.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i3mylml",
                            "author": "proph3tsix",
                            "score": 3,
                            "created_utc": 1649259237.0,
                            "response": "As was recently demonstrated in Canada, a government's ability to turn off its citizens access to money yields almost infinite opportunity for manipulation.\n\nSo, unless you're suggesting that we could have achieved many of the rights minorities enjoy today without protest, then I'm afraid these make fine examples.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i3n1ebr",
                            "author": "anajoy666",
                            "score": 2,
                            "created_utc": 1649260307.0,
                            "response": "The set of people that care a lot about minority rights greatly overlaps with the set of people who fall for environment concern trolls. OP’s point can be very useful.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i3n42nd",
                    "author": "unfuckingstopped",
                    "score": 0,
                    "created_utc": 1649261318.0,
                    "response": "you're just saying stuff. try backing it up with arguments.  if cbdcs existed then, bitcoin would also have been invented, and cbdcs would immediately stop having power. like now. they won't work. govt won't win. \n\nand your idea of rights is weird. your rights don't come from government.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i3n6i40",
                            "author": "anajoy666",
                            "score": 3,
                            "created_utc": 1649262236.0,
                            "response": "CBDC are one more tool for economic control. Definitely something to be concerned about.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i3mmh8b",
                    "author": "solomonsatoshi",
                    "score": 1,
                    "created_utc": 1649254439.0,
                    "response": "USD vs DCEP vs BTC",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i3n9j4i",
                    "author": "food_dudes_",
                    "score": 1,
                    "created_utc": 1649263414.0,
                    "response": "I’d wager a sizable number of people on this sub would be quite happy about all that, except maybe prohibition 🤡🤡",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i3n9lcf",
                    "author": "Dr-Slay",
                    "score": 0,
                    "created_utc": 1649263438.0,
                    "response": "Agreed, pretty much - caveat about the concept of \"moral progress\" in a breeding environment, but I'll table that for sake of a conversation.\n\nThe main problem with posting this here is that most on this subreddit are probably not capable of caring about the problem.\n\nMost hardcore BTC hodlers are probably of the  Ayn Rand \"libertarian\" conservative  confusion, who has no capacity to understand basic causal relationships when it comes to human so-called economic activity beyond a certain point.  They  understand supply and demand quite well.  They get stuck on aspects like this and progress no further.\n\nThey don't care about minorities and civil rights, all they care about is fitness signalling via BTC (or gold, or cars, or trophy wives, children, etc.).     They do not know how economies actually work - when they do manage to work (and they don't always work) - and point to the effects of their own disruption as evidence that some economic models don't work.   LIke kicking over a sand-castle every time someone tries to build it, and then claiming \"sandcastles don't work\"\n\nThis tragic kind of stupidity is how they always want to defund beneficial government programs and avoid taxes (yet call the police or fire dept when in need) - and granted, most government gets corrupted  - problem is it's corrupted by these clowns, who then point to the effects of their own corruption as evidence \"government don't work, bruh.\"   It's mostly stupidity, not malice.\n\nSo they want to support a system that creates a hoarding of wealth.  Here, on this sub, they (generally) *feel like* BTC will enable them to do this (BTC will perform spectacularly against fiat no doubt -  it's foolish not to grab as much of it as you can -  but it will not eliminate fiat, and cannot solve this problem).\n\nIf people have less money to spend less money gets circulated throughout the economy.  I'd encourage the conservative liberarian  who wants to try to understand this to think of it like a circulatory system.  Nutrient-rich blood coagulated in a few places and not circulating freely will kill the entire thing.\n\nMost people end up with less \"disposable income\" so they can't support the very economy the \"neo-libertarian\" conservative who has gotten lucky enough to hoard has thrived off of, let alone one that might be better for everyone.\n\nIt's hard to let go of a religious belief like that.  Especially when your ego is all tied up in how much \"better\" you feel like you are than the average person.\n\nNot saying BTC is bad, not saying government is good.  Ultimately it's all \"bad\" in  that sentience is hell and there is no escape.   There are just smarter and dumber ways of dealing with that predicament.\n\nBTC is enormously useful, but it cannot fix this problem without being distributed more evenly.  And that is NEVER going to happen.\n\nCorrupted governments will very probably use CBDCs to tighten the hoarding-funded oligarch/plutocrat fist.   Fully agreed there.\n\nI know what I write will get downvoted here.  Don't care.\n\nI use BTC because it cannot be confiscated if stored properly, and its use cannot be easily censored.\n\nIf used optimally it could reduce prices of everything and decrease production of useless and environmentally harmful products.  But that is unlikely.\n\nOther than that, it's no better than any other medium of exchange.  In some ways it's worse.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i3nd8p6",
                            "author": "anajoy666",
                            "score": 1,
                            "created_utc": 1649264792.0,
                            "response": "A wall of text with no data and a veiled “it was not real socialism” lost in the middle. You are in no position to speak of Ayn Rand liberteens.\n\n>and point to the effects of their own disruption as evidence that some economic models don’t work\n\nCentral planning is a disaster pal, no amount of mental gymnastics will change that.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i3nlkug",
                                    "author": "Dr-Slay",
                                    "score": 1,
                                    "created_utc": 1649267876.0,
                                    "response": "That's a straw man.  \n\nWould you like to try and engage with something I actually wrote?\n\n\\>>Central planning is a disaster \n\nDepends on the plan and the context.  If the plan is to destroy sand castles every time someone tries to build one, and building them is an improvement -  yeah it's a disaster.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i3nx8i9",
                                            "author": "anajoy666",
                                            "score": 1,
                                            "created_utc": 1649272208.0,
                                            "response": "There is no way to engage because you didn't actually say anything of substance. It's an wall of text with no data and to be honest I suspect any argument will be met with evasive walls of text.\n\nJust look at the indexes of economic freedom and which countries are at the top and which are at the bottom. Plot them against corruption indexes, freedom of speech/press indexes, HDI, percentage of the population in poverty, social mobility indexes . It's just a matter of sound economic policy and statistics.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i3nzo9j",
                                                    "author": "Dr-Slay",
                                                    "score": 1,
                                                    "created_utc": 1649273098.0,
                                                    "response": "Cooked books aren't facts about the world.  \n\nAnyone can make any statistic look \"good\" when moving poverty lines, and engaging in other sampling biases.\n\nYou're running from the argument I made which is based on *non-contradiction*  as well as data.\n\nBut you'll just run from any sources I cite too.  Because you don't have a counterargument (there isn't a sound one, I've looked for decades).\n\nIf you're too offended by what I wrote to engage with all of it, try this core part, a little more clearly:\n\n*I'd encourage the conservative liberarian who wants to try to understand this to think of it like THEIR OWN circulatory system. Nutrient-rich blood coagulated in a few places and not circulating freely will kill you.*\r  \n\r  \n*From metaphor back to the economic problem:*\n\n*Most people end up with less \"disposable income\" so they can't support the very economy the \"neo-libertarian\" conservative who has gotten lucky enough to hoard has thrived off of, let alone one that might be better for everyone.*\n\nHere are some data:\n\n[https://www.brookings.edu/opinions/capitalism-is-failing-people-want-a-job-with-a-decent-wage-why-is-that-so-hard/](https://www.brookings.edu/opinions/capitalism-is-failing-people-want-a-job-with-a-decent-wage-why-is-that-so-hard/)\n\nAnd a debunk on your psychotic claim:\n\n[https://www.youtube.com/watch?v=k79wCaFgU40](https://www.youtube.com/watch?v=k79wCaFgU40)\n\nI'm not a member of any economism religion.\n\nI'm trying to help all you natalists deal with your problems.  You're too stupid to refrain from breeding, and for now I can't stop you.  Next best on the levels of damage mitigation is to advocate for the least destructive, and least *stupid*  way of managing the fallout.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i3o1y2i",
                                                            "author": "anajoy666",
                                                            "score": 1,
                                                            "created_utc": 1649273940.0,
                                                            "response": "I can't tell if it's AI generated, copy pasta or both. You didn't provide any real sources nor did you make any concise argument.\n\n>Anyone can make any statistic look \"good\" when moving poverty lines, and engaging in other sampling biases.\n\nJust so you know the poverty line is actually raised every now and then, not lowered.\n\n>I'd encourage the conservative liberarian who wants to try to understand this to think of it like THEIR OWN circulatory system. Nutrient-rich blood coagulated in a few places and not circulating freely will kill you.\n\nLMFAO WTF IS THIS \"don't trust statistcs bro listen to your body my gym buddy does this and he benches 1000lb 100x100 natty full RM here take this random youtube video with no data and a random blog\"\n\n>And a debunk on your psychotic claim:\n\nWhy are you calling me psychotic?\n\n>I'm not a member of any economism religion.\n>I'm trying to help all you natalists deal with your problems. You're too stupid to refrain from breeding, and for now I can't stop you. Next best on the levels of damage mitigation is to advocate for the least destructive, and least stupid way of managing the fallout.\n\nOh I get it you o are projecting your own mental illness. Take your meds.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i3o2r8r",
                                                                    "author": "Dr-Slay",
                                                                    "score": 1,
                                                                    "created_utc": 1649274234.0,
                                                                    "response": "You didn't even look at the information.  It already addresses all this, and of course now because clearly you *aren't engaging honestly, and have no argument: - the classic \"argue the arguer\" ad hominem of the defeated interlocutor:*\n\n*>>*mental illness\n\nBwa ha ha ha\n\nYes, your responses are a psychotic defense of an extinction bound pattern of behavior.\n\nWhen you can engage with what I've written and the data I linked to, we can continue this conversation.  Any other evasive responses are a waste of your time.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i3o4i7g",
                                                                            "author": "anajoy666",
                                                                            "score": 1,
                                                                            "created_utc": 1649274870.0,
                                                                            "response": "You didn't link to data. It's literally an youtube video and a blog with random charts and a marxist fairy tale.\n\nI don't have infinite time to review every schizophrenic delusion I come across online, link reputable peer reviewed sources and you get a better reply.\n\nYou mentioned in your first comment that you always get down voted, maybe now you know why.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i3o60b1",
                                                                                    "author": "Dr-Slay",
                                                                                    "score": 1,
                                                                                    "created_utc": 1649275409.0,
                                                                                    "response": "Bwa ha ha - you still can't engage at all.    \nYes, those are data.  In the blog are *sources.*\n\nFor the youtube video *there are sources linked in the description.*  \nLOL - you didn't even look at them.  You certainly aren't engaging with *the data.*\n\nYou are the one who has made bald assertions with NO (zero) data.  \n\n\\>>>ou mentioned in your first comment that you always get down voted\n\nNo.  Read what I wrote.  That is not what I wrote. \n\nBwa ha ha - with the level of indoctrination you're suffering, it's no wonder your religious convictions are confounding your ability to think.  At all.\n\nLast chance to engage with what I've written, rather than a straw man or an ad hominem.  If you quadruple down, I will simply stop replying to you.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i3oae0k",
                                                                                            "author": "anajoy666",
                                                                                            "score": 1,
                                                                                            "created_utc": 1649277023.0,
                                                                                            "response": "It's not \"data\". It's a random chart. A chart on it's own tells you very little.\n\nThe share of labor in the output is decreasing. So what? Productivity is increasing. This is good.\n\nThe income of the top 5th percentile increased compared to 20 years ago. So what? Technology is very productive and working in tech pays well.\n\nIf the guy wanted to make a case for his marxist delusions he should have started by making a scatter plot and calculating the correlation between the variables. Then concisely formulate a hypothesis and  test it. But he didn't, because he doesn't want to make a case for it, because he knows there is no case to be made. He wants to write a fairy tale that appeals to the emotions of his readers and throws some random charts in the middle to make it look legitimate.\n\nI, on the other hand, referenced you to reliable data. You can even pick the sources! You can source HDI from the world bank or the UN and the result will be the same. But no, \"this is the economistic religion we can't trust statistics listen to your body\". This is why you don't get good replies.\n\nI'm not watching the video. A youtube video is not a valid source of information unless it's a lecture from an university, plus it's too long and I have other things to do.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i3og7qt",
                    "author": "igadjeed",
                    "score": 0,
                    "created_utc": 1649279193.0,
                    "response": "Not relevant to Bitcoin",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i3pvqmp",
                            "author": "proph3tsix",
                            "score": 0,
                            "created_utc": 1649302228.0,
                            "response": "Bitcoin exists to save us from CBDCs.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}