{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "unsgqh",
            "title": "Will moving bitcoin off Coinbase trigger any taxes?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/unsgqh/will_moving_bitcoin_off_coinbase_trigger_any_taxes/",
            "author": "cryptogato",
            "created_utc": 1652328794.0,
            "score": 2,
            "num_comments": 20,
            "subreddit": "BitcoinBeginners",
            "selftext": "If I want to move all my bitcoin off Coinbase into another wallet, will I have to pay taxes? I still have gains. I am not selling…simply transferring. \n\n\nWill this trigger any notices to the IRS?",
            "stickied": false,
            "comments": [
                {
                    "id": "i8a22lh",
                    "author": "cheezball_",
                    "score": 2,
                    "created_utc": 1652329320.0,
                    "response": "I don't think it would, If you somehow get audited its easy to say that there were no capital gains/losses",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8amoyl",
                    "author": "bitusher",
                    "score": 2,
                    "created_utc": 1652344676.0,
                    "response": "Buying bitcoin with fiat or moving bitcoin are both **not taxable events** in the USA \n\nFor the US, if you sell, trade for another asset, or spend it becomes a taxable event. One reason, of many, why day trading is a nightmare. \n**Yes, Every single trade on an exchange is a taxable event besides initially buying Bitcoin!**\nNow this has several implications. Day trading becomes tax nightmare because every transaction is a taxable event. So someone that daytrades or invests in altcoins may be forced to use specialized software or hire an accountant for thousands of dollars and someone that just makes an occasional purchase of Bitcoin and withdraws it has a much easier task of calculated any taxes especially if they don't make large purchases giving them an excuse to simply not report. Not the same if you are daytrading on exchanges , especially if you have made over 200 trades in a year.\n\nAlso there is a distinction between short term and long term capital gains taxes so its much wiser to not sell your BTC for at least 1 year so at worst you have to pay the much lower long term capital gains -\n\nLook at this chart -\n\nhttps://www.fool.com/investing/2021-capital-gains-tax-rates-and-how-to-minimize-t/\nTL;DR - most people will need to pay 15% in the USA for selling BTC after a year.\n\n**Buy Bitcoin , record the price you bought it for and the date in a spreadsheet and wait at least 1 year before selling it or taking profits so if you do decide to pay taxes on profits you are at least in the lower tax category of long term capital gains.**\n\nMany people do not pay taxes when they spend BTC or sell it in person for cash but if you sell on any exchange like coinbase in the future , buy a car, boat, atv, house , land with Bitcoin , you better pay your taxes\n\nExamples - \n\n**Example 1 legal**: Say you bought 10 BTC for 1k USD each and want to sell them over a year later. Those BTC are now worth 10k each so you have a realized profit of 90k USD, thus your taxable income is now 90k if you have no other income. This would means you are in the 15% tax bracket thus are subject to 13,500 USD in taxes on the profit - deductions and writeoffs. So lets say with your writeoffs and deductions you now have to pay 6.5k in taxes , leaving you with 83,500 USD to put a down payment on a home.\n\n**Example 2 legal** - You have 10 BTC purchased or mined at 1k each when you received them. This is now worth 100k USD. You wait a year to sell them and never sell more than the amount where your total income exceeds 39,375 usd per year and than file your taxes where you pay none due to being in the first capital gains bracket **if you have no other sources of income as you state** . This will take several years or much longer(as btc continues to appreciate) to slowly sell off your bitcoin\n\n\n**Example 3 technically illegal**  - You have 10 BTC purchased or mined at 1k each when you received them. This is now worth 100k USD. You decide to use your reported income from your occupation to buy a home and keep the BTC spending separate on other items. You slowly spend your BTC on amazon, plane trips, hotels, selling small amounts in person or in atms without ID , restaurants in a private manner(personal wallet that you control private keys and you have done the minimum to wash the BTC). Technically you need to report taxes on every tx , but since you are not day trading the exchange you bought the BTC from does not report you and it is unenforceable for the IRS to even know you are spending those BTC. Since you are not buying large items registered to your identity you are also not targeted as well.\n\nHere are other ways people avoid taxes -\n\nspend btc directly for non registered items –technically illegal if you don’t pay taxes but difficult to enforce\n\nsell at 2 way atms without ID (coinatmradar.com) –technically illegal if you don’t pay taxes but difficult to enforce\n\n\nsell p2p with others–technically illegal if you don’t pay taxes but difficult to enforce\n\n\nsell on a DEX like BISQ–technically illegal if you don’t pay taxes but difficult to enforce\n\n\nSell the minimum in a country like the USA where you can get in the 0% long term cap gains rate - legal\n\nKeep the btc as collateral and take on debt that is not taxable - legal\n\nGift bitcoin with a gift tax exemption - legal\n\nDonate bitcoin to charities - legal\n\n\nFor countries like the USA you can use any accounting method as long as you are consistent\n\nIf you were to use FIFO(first in , first out) it would look like this\n\nBuy 1- 0.12 BTC @ 1000 USD\n\nBuy 2 - 0.5 BTC @ 3540 USD\n\nBuy 3 - 0.025 @ 4512 USD\n\nBuy 4 - 0.0054 @ 8004 USD\n\nSay you decide to sell 0.5 BTC for fiat(USD) when Bitcoin is valued at 40k usd\nThis would mean you would take your first in 2 purchases\n\n0.12x40k = 4,800 usd in value - 120 initial purchase price = 4680 in profit\n\n0.38 btc x 40k = 15,200 - original purchase rate of 0.38 (1345.2) = 13,854.2 profit\n\nTotal taxable profit = 18,534.8 usd\n\nIf its over a year , you are looking at the lower long term cap gains ... most people this would be 15% so you pay 2,780.22 usd in taxes if you decide to pay them\nIf under a year you will have the much higher ordinary tax rate (22-40% for most people)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8a155w",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1652328794.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8a37ea",
                    "author": "TendieTrades",
                    "score": 1,
                    "created_utc": 1652330003.0,
                    "response": "Not a gain or loss until you sell.  However that’s stocks, which I know more about. I’m curious about the correct answer on this as well.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8acly6",
                    "author": "ApplicationNo5082",
                    "score": 1,
                    "created_utc": 1652336333.0,
                    "response": "It doesn't have to do so",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8a4z1i",
                    "author": "ndgoLiberty",
                    "score": 0,
                    "created_utc": 1652331099.0,
                    "response": "If they bother you just send them a picture of your coldcard",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "upvazk",
            "title": "Is buying bitcoin on paypal reliable?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/upvazk/is_buying_bitcoin_on_paypal_reliable/",
            "author": "KeyboardFromElbaf",
            "created_utc": 1652578510.0,
            "score": 12,
            "num_comments": 43,
            "subreddit": "BitcoinBeginners",
            "selftext": "PP now sells bitcoin, and since I already have an account set up this seems like the absolute easiest least confusing way to get into it. Is this a good way? I'd like to buy into the dip",
            "stickied": false,
            "comments": [
                {
                    "id": "i8nckor",
                    "author": "DarthBen_in_Chicago",
                    "score": 19,
                    "created_utc": 1652580283.0,
                    "response": "I just read PayPal’s terms on crypto and I would not because you cannot transfer it to your wallet. To me that means you are buying “receipts” for bitcoin. \n\n**Can I transfer crypto into and out of PayPal?**\n\nCurrently, you can only hold the crypto that you buy on PayPal in your account. Additionally, the crypto in your account cannot be transferred to other accounts on or off PayPal.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8nqikw",
                    "author": "Greenery_Financial",
                    "score": 6,
                    "created_utc": 1652588115.0,
                    "response": "I'd say PayPal is horrible for buying bitcoin as the fees are high and there's many other issues with it (no withdraws, high spreads, potentially 'not real bitcoin,' etc) - I'd say either do it visa kraken/gemini/coinbase or just buy grayscales bitcoin trust or similar if you have a brokerage account.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8nlujv",
                    "author": "kuzkokronk",
                    "score": 6,
                    "created_utc": 1652585347.0,
                    "response": "If you want super easy to use interface and low-ish fees, Cash App is a great way to buy Bitcoin in the USA. And you can transfer your bitcoin to your own personal wallet at any time.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8q8tpq",
                            "author": "lawsattract",
                            "score": 1,
                            "created_utc": 1652641828.0,
                            "response": "I wouldn’t say cash app has low fees, they charge a fee for everything you do and each one varies on how much you put in.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8o8mcz",
                    "author": "Background_Gur7470",
                    "score": 4,
                    "created_utc": 1652601613.0,
                    "response": "PayPal acts as a custodian service which means that they hold the private keys to your coins. This goes against everything they say in the crypto currency community.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8o57hy",
                    "author": "comfyggs",
                    "score": 3,
                    "created_utc": 1652598723.0,
                    "response": "No",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8oed6n",
                    "author": "igadjeed",
                    "score": 3,
                    "created_utc": 1652606540.0,
                    "response": "> PP now sells bitcoin\n\nPayPal sells fake Bitcoin",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8oxsop",
                    "author": "PrPro1097",
                    "score": 3,
                    "created_utc": 1652620559.0,
                    "response": "No",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8u8b8x",
                    "author": "azraelle_178",
                    "score": 3,
                    "created_utc": 1652719926.0,
                    "response": "If you live in Canada, I suggest you buy it on Netcoins. It's much easier to buy any coins including btc cause it has low cost fees and it's high secured. I think paypal has higher fees though. Hope this helps!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8pgefz",
                    "author": "cryptochill",
                    "score": 2,
                    "created_utc": 1652629433.0,
                    "response": "People are really crapping on Paypal. But that's not entirely fair. This is the Bitcoin for Beginners subreddit after all. And Paypal isn't that bad for beginners to use.\n\nI'll start with what's bad about PayPal. When you buy Bitcoin with PayPal, you're not *really* buying that Bitcoin. You can't remove that Bitcoin from your PayPal account and put it on a private wallet. What they do is say that your account now has fewer fiat dollars and X amount of Bitcoin. But you don't actually own the Bitcoin. You basically have a guarantee from PayPal that you do. The Bitcoin community really hates that because one of the things we love the most about Bitcoin is that you can move it around as you please with no gatekeepers. The Bitcoin community is generally strongly against any situation where you aren't in direct control over your Bitcoins (and other cryptos). That's why people push hard for people to get private wallets and hold their cryptos there. Between you not really owning your Bitcoin and having to rely on a 3rd party to access it, the crypto community really hates PayPal for buying cryptos. The same goes for Robinhood, etc.\n\nNow, here is the advantage of using PayPal if you are just starting out. Depending on how comfortable you are with technology and jumping into a new way of managing your money, PayPal is very user friendly and very forgiving. If you are fully controlling your Bitcoins and you make a mistake and that money is gone, it's gone forever and you're never getting it back. PayPal is a really user friendly way of sticking your toe in the water of the cryptocurrency world. But once you start understanding things better, I'd move away from it as soon as you are comfortable. There are much better platforms.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8x80k0",
                            "author": "Far-Contest-7871",
                            "score": 2,
                            "created_utc": 1652774831.0,
                            "response": "I appreciate this just happened to be bored while late at night and decided to just try bitcoin for the very first time and let me just say I ain't the sharpest tool in the shed so I was just gonna throw a dollar in and see how that goes",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8xw64t",
                                    "author": "cryptochill",
                                    "score": 1,
                                    "created_utc": 1652792537.0,
                                    "response": "I hope it's a fun experience for you",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8n94iu",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1652578511.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8py22n",
                    "author": "scberg77",
                    "score": 1,
                    "created_utc": 1652637073.0,
                    "response": "You dont actually own the Bitcoin you buy from pay pal or robinhood. \nGet a coinbase account. Its easy.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8tyxmz",
                    "author": "scarface2069",
                    "score": 1,
                    "created_utc": 1652716168.0,
                    "response": "Not really since you can't send the asset to your wallet, best option is to buy crypto from an exchange like Netcoins if you're Canadian",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8u2x1k",
                    "author": "never-give-up-every1",
                    "score": 1,
                    "created_utc": 1652717784.0,
                    "response": "No",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "upv9vr",
            "title": "Best miner for super cheap energy?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/upv9vr/best_miner_for_super_cheap_energy/",
            "author": "AtticFinch",
            "created_utc": 1652578404.0,
            "score": 6,
            "num_comments": 27,
            "subreddit": "BitcoinBeginners",
            "selftext": "A buddy and I have a plan to acquire incredibly cheap energy, less than $0.01 / kWh, but with occasional downtime. I’m fairly new crypto-mining. Which ASICS do you all recommend when energy efficiency isn’t a factor but hashrate is through the roof?",
            "stickied": false,
            "comments": [
                {
                    "id": "i8n8x95",
                    "author": "AutoModerator",
                    "score": 2,
                    "created_utc": 1652578405.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8nmbkh",
                    "author": "ndgoLiberty",
                    "score": 2,
                    "created_utc": 1652585618.0,
                    "response": "S19 Pro\nActually no just all variants of the S19\nM30S++\nM30S+",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8o0cdp",
                            "author": "AtticFinch",
                            "score": 1,
                            "created_utc": 1652594839.0,
                            "response": "Thank you!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8s4a12",
                    "author": "BTCMachineElf",
                    "score": 1,
                    "created_utc": 1652673696.0,
                    "response": "Mining is not really a beginner topic. Try r/bitcoinmining for more thurough advice.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8xbbnt",
                    "author": "henglongminerresell",
                    "score": 1,
                    "created_utc": 1652777909.0,
                    "response": "可以考虑我们的现货S9 和 whatsminer M5",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ozrdd",
                    "author": "miamiair92",
                    "score": 0,
                    "created_utc": 1652621615.0,
                    "response": "Don’t steal electricity, just saying people always get caught .",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8q7kh1",
                            "author": "AtticFinch",
                            "score": 1,
                            "created_utc": 1652641266.0,
                            "response": "Thank you for the warning! I wouldn’t steal it, that’s not my plan.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}