{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ut7nc5",
            "title": "Beginner TA?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/ut7nc5/beginner_ta/",
            "author": "i-Yuno",
            "created_utc": 1652978877.0,
            "score": 0,
            "num_comments": 6,
            "subreddit": "Bitcoin",
            "selftext": "Is anyone using something simple as 2 different EMA for buy/sell signals? I found someone recommending a cross from 30 day EMA over 60 days as buy and 60 over 30 as sell signal. (Last sell was April 16)\n\nBacktesting this strat seemed to work out, but can it be this easy? What are the risks in doing so vs. Just dca&hodl?\n\nAlso, does somebody know a good resource to read on about TA fundamentals?",
            "stickied": false,
            "comments": [
                {
                    "id": "i97zymr",
                    "author": "cannaboz",
                    "score": 1,
                    "created_utc": 1652978998.0,
                    "response": "EMA’s don’t work they are a lagging indicator. Chart champions have good material on TA",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i980ru6",
                            "author": "i-Yuno",
                            "score": 1,
                            "created_utc": 1652979322.0,
                            "response": "Will check them out. Ty",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i980fxs",
                    "author": "NiceDoctorBeam",
                    "score": 1,
                    "created_utc": 1652979189.0,
                    "response": "A financial mentor taught me about TA, back in 1987.\n\nTA is bullshit.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i981f1z",
                            "author": "i-Yuno",
                            "score": 1,
                            "created_utc": 1652979580.0,
                            "response": "My zodiac is poor with gullible ascendant.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i983rjl",
                    "author": "stoic_goat_",
                    "score": 1,
                    "created_utc": 1652980525.0,
                    "response": "I would say start with learning how to recognize candle patterns and how to analyze trade volume.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i987lyg",
                    "author": "ETAVEGAMING",
                    "score": 1,
                    "created_utc": 1652982065.0,
                    "response": "If you know how to play musical chairs, you can do TA.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ut7sps",
            "title": "Bitcoin payments on the Lightning Network with Strike's Jack Mallers",
            "url": "https://www.youtube.com/watch?v=MD47Ox7u2oY",
            "author": "arahaya",
            "created_utc": 1652979287.0,
            "score": 35,
            "num_comments": 8,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9836ch",
                    "author": "Msim300",
                    "score": 1,
                    "created_utc": 1652980286.0,
                    "response": "The Strike story is great, but don't expect to get any help from a person if anything goes wrong.  They make banks look helpful and courteous.   3 days to open an account if you are lucky.  If you run into the same issues I did take a look at Swan.  Similar idea if you want to stack sats.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i985i0n",
                            "author": "hattiesbergnerd",
                            "score": 4,
                            "created_utc": 1652981216.0,
                            "response": "I’ve had same day help (and resolution) from their reps the two times I’ve requested it. Just to provide another data point.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i987jxe",
                                    "author": "Msim300",
                                    "score": 1,
                                    "created_utc": 1652982043.0,
                                    "response": "That's good to hear.  I might give it another try if Swan doesn't build an app soon.  I may have just had two bad \"reps\" and got unlucky.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i989qmx",
                            "author": "garowedre-68abe4",
                            "score": 2,
                            "created_utc": 1652982918.0,
                            "response": "I got help from Strike. It was quick too.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i98ig95",
                            "author": "knuF",
                            "score": 1,
                            "created_utc": 1652986487.0,
                            "response": "I love Swan. I wished their fees were lower.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i996x5i",
                            "author": "justing1319",
                            "score": 1,
                            "created_utc": 1652997615.0,
                            "response": "It was a solid week for me to get setup and support couldn’t tell me anything but “wait”. As soon as my deposit settled I sent it right back out. I don’t have time for that bs.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i997tv6",
                                    "author": "Msim300",
                                    "score": 2,
                                    "created_utc": 1652998030.0,
                                    "response": "Same here.  If you can't get small transactions right what happens when it isn't small.  I'm sure they have some good and some bad people there like all companies, but like you said I don't have time for them to match me with the good one.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9awey6",
                    "author": "ActionParticular7697",
                    "score": 1,
                    "created_utc": 1653032949.0,
                    "response": "This has to be one of the better jack's interviews. The future of crypto payments in bright and coming fast.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ut7ruk",
            "title": "“There is an infinite amount of cash at the Federal Reserve.” -Neel Kashkari President of the Federal Reserve Minneapolis",
            "url": "https://i.imgur.com/fFURKgc.jpg",
            "author": "thefullmcnulty",
            "created_utc": 1652979223.0,
            "score": 421,
            "num_comments": 84,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i982lqf",
                    "author": "BigDeezerrr",
                    "score": 79,
                    "created_utc": 1652980054.0,
                    "response": "I've seen political pundits argue it's all debt we owe to ourselves so it doesn't matter. I don't get this argument at all. Why am I paying any taxes if debt doesn't matter and we can simply wipe it from the books and generate unlimited value from nothing?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i984wkb",
                            "author": "thefullmcnulty",
                            "score": 76,
                            "created_utc": 1652980976.0,
                            "response": "The MMT thesis is a massive unsustainable delusion and runs contrary to all fundamental principles of money and thermodynamics. \n\nProof-of-Work is essential for a sustainable and useful money. Money is not debt. Money can’t be created to ♾ and maintain trust / value over time. \n\n“[Fiat] money eventually returns to its intrinsic value - zero.” -Voltaire",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i98m884",
                                    "author": "Dullfig",
                                    "score": 34,
                                    "created_utc": 1652988022.0,
                                    "response": "The gold standard was a proof-of-work. You had to dig it up, smelt it, etc.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i98nd9y",
                                            "author": "thefullmcnulty",
                                            "score": 42,
                                            "created_utc": 1652988482.0,
                                            "response": "Yep, any gold that sat in a safe or vault *was* inherently Proof-of-Work. It had to be mined, processed and spent into circulation organically. \n\nGold could not be created at-will by anyone and thus was a perfect neutral standard to represent human economic productivity.\n\nUnfortunately gold is hard to move, expensive to store, and easy to centralize / confiscate / rehypothecate. Bitcoin has emerged to fix gold’s shortcomings and give humans a global sound money option again.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i98qb6i",
                                                    "author": "lordsamadhi",
                                                    "score": 22,
                                                    "created_utc": 1652989701.0,
                                                    "response": "Exactly.\n\nI can't believe people still don't understand this basic stuff.  Sure, I'm biased because of my daily echo-chamber of Bitcoin podcasts and reading materials.\n\nBut with the current price drop and everyone panicking, I feel as though I have a super-power in knowing that Bitcoin hasn't even started its massive run-up and adoption yet.  I feel this way because the average people still say the dumbest stuff about gold, fiat, and bitcoin.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i98s625",
                                                            "author": "thefullmcnulty",
                                                            "score": 12,
                                                            "created_utc": 1652990460.0,
                                                            "response": "We have an information-advantage. I want so badly to share this asymmetric advantage with the people I care about but (mostly) their minds will not accept the new information. No matter how credible and verifiable it is. It’s a bizarre phenomenon to witness in real time. \n\nThe vast majority are in the dark and they subconsciously hate that fact. They know they don’t actually understand these things so they cling to the narratives they’re given (by guys like Neel) in attempt to feel control and reassurance. \n\nThey’re burying their heads ever-deeper in the sands of denial. It will not end well.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i98rm1f",
                                                    "author": "Dullfig",
                                                    "score": 2,
                                                    "created_utc": 1652990232.0,
                                                    "response": "Will there always be a need for actual cash, or am I being a boomer? It seems to me that paper money backed by bitcoin might be useful.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i98tbwv",
                                                            "author": "thefullmcnulty",
                                                            "score": 4,
                                                            "created_utc": 1652990937.0,
                                                            "response": "I agree that physical money is useful in many regards. Bitcoin pegged paper is an experiment I think will be tried somewhere.\n\nHave you heard of “open dime”?\n\nI’d love it if silver was the new physical money and bitcoin was the global reserve currency of the modern economy. Not sure how practical using silver would be but I’m a fan of precious metals aka Proof-of-Work as well.",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "i9aoxvy",
                                                            "author": "r1chard3",
                                                            "score": 1,
                                                            "created_utc": 1653026781.0,
                                                            "response": "I saw a video of people in a market in El Salvador buying stuff with bitcoin. They were just sending coin over to the shopkeeper’s phone.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i99rkg8",
                                                    "author": "bonafidebob",
                                                    "score": -4,
                                                    "created_utc": 1653007866.0,
                                                    "response": "> Yep, any gold that sat in a safe or vault *was* inherently Proof-of-Work. \n\nWow.  That statement is almost *criminally* misleading.\n\nNo proof of ***anything*** was required to trade gold — no global consensus, no network bandwidth, no energy expended.  Nothing other than two people and some gold.\n\nCrypto is the exact opposite.  No actual work is required to *create* it, it’s just numbers.  The work is consumed every. single. time. it changes ownership.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9ccz81",
                                    "author": "Jub-n-Jub",
                                    "score": 2,
                                    "created_utc": 1653062025.0,
                                    "response": "MMT is the ultimate kick the can down the road economic \"strategy.\" Insanity.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9cn0br",
                                            "author": "thefullmcnulty",
                                            "score": 2,
                                            "created_utc": 1653065958.0,
                                            "response": "Dude it’s so pathetic they teach this in American universities like it’s a legitimate system. \n\n“The core tenet of MMT is just make believe that doing something unsustainable will work forever….”\n\nMMT is a gleaming testament to clown world.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i98seza",
                                    "author": "randompittuser",
                                    "score": 4,
                                    "created_utc": 1652990562.0,
                                    "response": "I'm not saying MMT is sustainable, but it's not impractical when you control the world's reserve currency. Our current predicament is not due to MMT principles, it's due to a lack of adherence to those principles. Specifically, it's fine if you need to recapitalize your consumers through handouts, debt forgiveness, whatever.. but if you don't recoup that money from somewhere else (i.e. higher taxes on the wealthy, higher interest rates, etc), then you're going to cause massive inflation. Well, Trump & Biden did the handout thing, but the Senate couldn't agree on the human infra bill, which would have raised taxes for earners making over $400k. Most of the world is on board with a minimum corporate tax, but neither has that coalesced. \n\nGiven I'm in a Bitcoin sub, I figure I'll be downvoted, but that's just how it is.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i98vj4b",
                                            "author": "thefullmcnulty",
                                            "score": 3,
                                            "created_utc": 1652991960.0,
                                            "response": "If it’s not sustainable then what good is it long-term? \n\nBitcoin is technically the best monetary option humans have ever had and as such it should be seen as the pivot / replacement. \n\nBitcoin is sustainable (anti-fragile), trust-less, permission-less, global, distributed (indestructible), open, and programatic (fair). It’s a well engineered-solution that always works and disintermediates corruption. \n\nWhy do mental gymnastics trying to float a system that is always sinking due to its own fatal flaws when there is a superior system that works and is open to all? \n\nThis is the transition period. I don’t want a massive collapse of legacy systems today because the vast majority of the world would be absolutely fucked. But over the next decade (or so) I see bitcoin continuing to develop / strengthen / be adopted while legacy systems continue to break / lose trust. \n\nBitcoin is the life raft and without it humanity would be in serious trouble (imo).",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i99ta6w",
                                                    "author": "randompittuser",
                                                    "score": 4,
                                                    "created_utc": 1653008718.0,
                                                    "response": "What are you proposing? There's no real meat in anything you said here. This is what I took from your comments:\n\n* Bitcoin is a solution/replacement (to/for what? Fiat currency?)\n* Bitcoin is a superior system (What are you implying? That bitcoin will replace the Federal Reserve as an entity? MMT?)\n* We're in a transition period (again, to what?)\n* Bitcoin is a \"life raft\" (this is just pure fluff)\n\nLook, I believe in Bitcoin's revolutionary usefulness. I wouldn't be in this sub if I didn't. IMO it has the potential to become the global reserve currency that Keynes imagined. But it's sometimes difficult to watch people in this sub go around jerking each other off with these fantastical ideas about how Bitcoin will save everyone from financial tyranny through decentralization.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9dt8o0",
                                                            "author": "thefullmcnulty",
                                                            "score": 0,
                                                            "created_utc": 1653084975.0,
                                                            "response": "Bitcoin is a replacement for a large majority of finance and is the most technically proficient ledger technology ever invented. Darin Feinstein estimates [all important records will live on bitcoin eventually because it’s the best record keeping system ever invented](https://youtu.be/hv34SPq4y_M). Not to be taken lightly from a person of his accomplishments / credentials. \n\nRecords of value underpin the entire world, as Darin also outlines in the link above. The fact that bitcoin is a superior technical solution for the ledgers of the world provides a good clue that the network and technology will replace much of global finance on a decade(s) timeline. Humans use better technology and this has been seen over and over throughout history. The genie can’t be kept in the bottle. \n\nThese realities justify my claims in that they’re plausible (not guaranteed) and the current trajectory of the network is on pace to replace many important elements of finance / accounting / SoV / medium of exchange / unit of account as well as bonds and global collateral. \n\nIt’s hard to write response that gets too granular to start. I’m not writing research papers and I could elaborate extensively on every point made. I find it better to start from a high level then get more granular if the conversation goes there. \n\nAlso, I’m just an informed enthusiast. I can’t predict everything and I can’t see every angle. There are a lot of things happening in bitcoin I’m not privy to and a lot of things I miss or skip. This thing is such a robust swarm of development and adoption it’s hard to comprehend, let alone communicate.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i994w5g",
                                                    "author": "OdoIcontradictmyself",
                                                    "score": 0,
                                                    "created_utc": 1652996692.0,
                                                    "response": "All of your comments in this thread are so on point. We need more communication like this. Thank you.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i99lapj",
                                                            "author": "thefullmcnulty",
                                                            "score": 2,
                                                            "created_utc": 1653004682.0,
                                                            "response": "Really beautiful how this whole ecosystem is being built by a bunch of people all over the world without any coordination. Bitcoin is the Schelling point of value + economic freedom. \n\nUsing the network, research +  communicating ideas I find important / interesting and running a full node is what I can contribute now. When I started in bitcoin I knew nothing and who knows where I’ll be in 10 years. It’s been a fun journey. \n\nDefinitely highly motivated to keep learning about bitcoin and keep increasing the role the network plays in my life.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i989xxw",
                            "author": "MaximumStudent1839",
                            "score": 10,
                            "created_utc": 1652983001.0,
                            "response": ">Why am I paying any taxes if debt doesn't matter\n\nWhat they mean is the debt is owned domestically so it can be solved domestically.  In other words, if you raise domestic taxes high enough, the debt can be paid off.\n\n>we can simply wipe it from the books and generate unlimited value from nothing?\n\nYou can't wipe it from the books because debts are assets of private American individuals, i.e. bondholders. Bondholders have legal protection and political power to prevent the Federal government from wiping out those debts.\n\nA lot of problems within America can be solved. But they are not because it often involves some sort of redistributive politics. No one wants to sacrifice their assets for the public good. But everyone is eager to ransack the Treasury for more free assets and money.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i98bi75",
                                    "author": "thefullmcnulty",
                                    "score": 4,
                                    "created_utc": 1652983640.0,
                                    "response": "Federal liabilities cannot be solved with taxation. [Debt per citizen](https://www.justfacts.com/nationaldebt.asp) is $91,398 per person including every child, elder, prisoner and disabled person in the United States. This is *not including* the additional [15.84 Trillion in consumer debt](https://www.newyorkfed.org/newsevents/news/research/2022/20220510) Americans owe. \n\nThere is no way that US federal liabilities can ever be repaid via taxation, period. \n\nInstead the Fed is going to attempt to inflate their way out of the debt.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i98ckvw",
                                            "author": "MaximumStudent1839",
                                            "score": 3,
                                            "created_utc": 1652984082.0,
                                            "response": ">There is no way that US federal liabilities can ever be repaid via taxation, period.\n\nYou can if you implement a wealth tax. Again, the majority of Federal bondholders are American citizens. Obviously, if you can tax your creditors, then you can pay your debt away as long as you are taxing them more than you are paying back in interest. That mechanism becomes possible once you implement a wealth tax.\n\n>Instead the Fed is going to attempt to inflate their way out of the debt.\n\nYou can only inflate the real value away, not the nominal. In the end, the Fed still has to raise more dollars in taxes even though dollars become worth less.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i98dm0x",
                                                    "author": "thefullmcnulty",
                                                    "score": 3,
                                                    "created_utc": 1652984507.0,
                                                    "response": "Most wealth is held in assets / equities and isn’t even close to what’s needed to unfuck this MMT cesspool. \n\nIf people like Musk / Bezos were forced to liquidate most of their equity it would wreak havoc on markets and irreparably destroy trust in the systems. \n\nRegardless, the math does not work. Forcing the hyper-wealthy to redistribute would be disastrous and still nominally inadequate to offset federal liabilities. \n\n>\tinflate the real value away, not the nominal\n\nThis is their only chance to not default and they know it. They are attempting to do this now because otherwise they just have to accept defeat.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i98g27a",
                                                            "author": "MaximumStudent1839",
                                                            "score": 4,
                                                            "created_utc": 1652985514.0,
                                                            "response": "Again, US citizens are the majority bondholders. How much the US treasury owes is how many bonds are issued. We don't even need to involve equity. If the Federal govt just confiscate all bonds from US citizens, much of the debt would disappear. Whether that is a good idea or not is another debate. But the point is the US Federal debt is within the Federal government's control to solve if it has the political willpower.\n\n>This is their only chance to not default and they know it. They are attempting to do this now because otherwise they just have to accept defeat.\n\nAgain, they still got their nominal obligations. They can't inflate that away. They can't escape raising taxes. \n\n>Forcing the hyper-wealthy to redistribute would be disastrous and still nominally inadequate to offset federal liabilities.\n\nYou have a very narrow idea about redistribution. Redistribution can mean taking privileges away from the military-industrial complex. Cutting those fuckers out means much fewer expenses on the Federal budget. When you lower expenses, it is easier to balance the books. Redistribution isn't just taking away from the hyper-wealthy. It is also about cutting off bloated \"welfare\" programs, yes a lot of the defense budget is corporate welfare.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i99nkd7",
                                                                    "author": "HearMeSpeakAsIWill",
                                                                    "score": 3,
                                                                    "created_utc": 1653005847.0,
                                                                    "response": "> If the Federal govt just confiscate all bonds from US citizens, much of the debt would disappear. \n\nThe bonds are the debt. Yes, obviously if you confiscate them the debt \"disappears\". Or you could simply declare them worthless and irredeemable. In other words, \"I ain't paying this debt back, what are you going to do about it?\" I suppose that could be considered a way of \"getting rid\" of your debt, but it does it in a manner that breaks all faith in the economic order and causes a total system collapse. This is not a helpful suggestion. All they need is \"political willpower\"? The political willpower to implode like Weimar Germany, you mean?",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i99woxi",
                                                                            "author": "MaximumStudent1839",
                                                                            "score": 0,
                                                                            "created_utc": 1653010385.0,
                                                                            "response": ">In other words, \"I ain't paying this debt back, what are you going to do about it?\"\n\nIt is different because you can pay it back via taxing the bondholders.\n\n>but it does it in a manner that breaks all faith in the economic order and causes a total system collapse.\n\nRead what I said.\n\n>Whether that is a good idea or not is another debate.\n\nThe key point is the Federal deficit is within the Federal government's control.\n\n>All they need is \"political willpower\"? The political willpower to implode like Weimar Germany, you mean?\n\nWhy don't you read? I gave examples like the political will to ax corporate welfare to the military-industrial complex. Or implement a wealth tax.\n\nWeimar Germany is an extremely bad example. No one used the Deutschmark as the reserve back then. Debts were denominated in pounds sterling. Now debts are denominated in US dollars. It is really an apple vs orange comparison.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "i98hcn6",
                                                                    "author": "thefullmcnulty",
                                                                    "score": 4,
                                                                    "created_utc": 1652986041.0,
                                                                    "response": "You specifically said a wealth tax was the way out. Simple arithmetic shows that’s wrong.\n\nNominal debt will only increase and the only (slim) chance it could ever be serviced in a meaningful way is by inflating the value of the currency away, which is being done. But it will never be enough. The currency will break before the debt is tenable. \n\nYou’re an apologist for a dishonest and unsustainable system that is ravaging the world and ruining lives. You’re doing mental gymnastics and suggesting wealth redistribution from the most productive members of society to repay the debts of the imperial army misadventures, big bank bailouts, fossil fuel and big pharma subsidies and the prison industrial complex. It’s totally misguided and delusional.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i98avr2",
                                    "author": "BigDeezerrr",
                                    "score": 1,
                                    "created_utc": 1652983383.0,
                                    "response": "The phrase \"wipe it from the books\" was specifically used in the debate I was referencing.\n\nI still don't get how it works if the debt will never be paid and increases forever towards infinity. Just the fact that it could theoretically be paid even though it's widely acknowledged it will never be paid it what holds it all together?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i98cfb9",
                                            "author": "thefullmcnulty",
                                            "score": 2,
                                            "created_utc": 1652984018.0,
                                            "response": "It’s big lie that it’ll ever be repaid. The liabilities of the United States are too large now. Servicing the debt is all they can do. \n\nRealistically the debt will be written off in a giant debt jubilee / currency “reform”. My guess is when the currency loses total global trust / value the powers that be will pivot to a CBDC and just keep on with the same model.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i98d2uv",
                                            "author": "MaximumStudent1839",
                                            "score": 0,
                                            "created_utc": 1652984289.0,
                                            "response": ">I still don't get how it works if the debt will never be paid and increases forever towards infinity. Just the fact that it could theoretically be paid even though it's widely acknowledged it will never be paid it what holds it all together?\n\nYou have just discovered the US economy is ONE BIG PONZI SCHEME. The old people accumulate the debt and they leave it for the younger generation to pay off. As long as the US population breeds enough younglings to pay off older generations' debts, the engine will keep going. Debts are always paid - just not by the one who accumulated it.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i98rj6o",
                                    "author": "soooofa_king",
                                    "score": 1,
                                    "created_utc": 1652990200.0,
                                    "response": ">But everyone is eager to ransack the Treasury for more free assets and money.\n\nEspecially the people that keep causing the problems in the first place.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i99atxf",
                            "author": "Dazzling_Marzipan474",
                            "score": 2,
                            "created_utc": 1652999451.0,
                            "response": "To keep us poor and stop us from buying more BTC",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i99w2jj",
                            "author": "blaze1234",
                            "score": 2,
                            "created_utc": 1653010083.0,
                            "response": "Taxes are how they create the demand for the money they generate",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9c38cs",
                            "author": "SaintGloopyNoops",
                            "score": 2,
                            "created_utc": 1653058149.0,
                            "response": "Because only the wealthy benefit from this system. Socialism for the wealthy, harsh capitalism for the rest of us. Just watched 'the G word' with Adam conover on Netflix, the money episode shows how corrupt it all is. They just wipe out debt for banks with a keystroke.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i98n98s",
                            "author": "Crazyshark22",
                            "score": 1,
                            "created_utc": 1652988436.0,
                            "response": "We can't because in real world there are limited amount of resources. We value our currency on strength of its purchasing power. What would be the point to be a millionaire if same thing happened to dollar as it did to Venezuelan bolivar. We would all be poor millionaires struggling to get by and afford food, electricity and fuel.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9a80oy",
                            "author": "Zephos65",
                            "score": 1,
                            "created_utc": 1653016022.0,
                            "response": "Well behavioral economics suggests that you raise taxes to slow down an economy (take cash out of flow) and spend on public goods and services when you want the economy to speed up.\n\nYou're paying taxes so that there isn't too much cash in the system",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9azlve",
                            "author": "Bitcoin__Hodler",
                            "score": 1,
                            "created_utc": 1653035837.0,
                            "response": "most of the US debt is loaned to other countries and pension funds.\ntechnically you could just print it and you are done but you would destroy your currency at the moment you do that.\n\nhttps://en.wikipedia.org/wiki/Trillion-dollar_coin",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9dfc20",
                            "author": "1UazZNfbWi",
                            "score": 1,
                            "created_utc": 1653078537.0,
                            "response": "It's true the citizenry owes it to itself, however the citizenry that ends up paying it back is not the same citizenry that received it, so it is fraud against the future.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9ads9r",
                            "author": "lkopfer",
                            "score": 0,
                            "created_utc": 1653019257.0,
                            "response": "The main problem with Bitcoin subs is that they have completely forgotten why the USD reigns supreme and the currency of the world! Could the us gov. Print money to infinity and erase debts yes they could, the reason why the dollar doesn’t  plummet overnight because of this reality is because the vast  majority of people and institutions believe that the fed will not do that and are correct in their belief  because in America the government is ran by the rich and is one of the most successful capitalistic societies of all time. Essentially we have cash and hold value in cash because we believe in that basic fact staying true as it has for a 100+ years and likely will for a 100+ more because there isn’t anything showing they would do otherwise. Now Bitcoin doomsday anti fiat people do not believe in the us gov. Which is absolutely their right. But ironically if the USD did crash because people lost faith in us economy and it’s future, then Bitcoin would also be worth nothing because people would resort back to a “real” value currency such as a commodity or something backed by a commodity that has some sort of tangible value. Bitcoin doesn’t really have any tangible value and is purely relying on people to prop up its value with fiat. It’s quite literally propped up by the thing pro Bitcoin people hate, fiat currency! The reality is if fiat currency were to disappear what is your Bitcoin worth in trade? Nothing!! Bitcoin is only worth anything because people can sell it for the thing that they can actually sell said Bitcoin for and that is cash!. Unless ofc u are able to find someone who wants to buy blocks of meaningless code in which they are able to do nothing with.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9cdv3k",
                                    "author": "BigDeezerrr",
                                    "score": 1,
                                    "created_utc": 1653062374.0,
                                    "response": "The fiat experiment is only ~50 years old and the value of the dollar has plummeted over that time. I don't have enough evidence to convince me it can last another 100 years. People act like the current system has been stable for 100s of years when it's actually quite a new experiment.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9rjz4w",
                                            "author": "lkopfer",
                                            "score": 1,
                                            "created_utc": 1653362001.0,
                                            "response": "Only 50 years 😂. So your confident in Bitcoin which has only been around for arguably 20 years? Again the concept isn’t really difficult to understand or questionable with fiat. Your trusting the US dollar because u trust in the Us economy and its belief to always put capitalism/economy first, which I personally am a firm believer it always will do as it is ingrained In the American culture.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9cpzyh",
                                    "author": "freelee33",
                                    "score": 1,
                                    "created_utc": 1653067158.0,
                                    "response": "You can already live on a Bitcoin standard in Florida so I'm not exactly sure what you're talking about",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9rk4hu",
                                            "author": "lkopfer",
                                            "score": 1,
                                            "created_utc": 1653362083.0,
                                            "response": "Really? How’s that? Your employer is paid in Bitcoin? They pay u from said Bitcoin they make? U buy everything in Bitcoin? At no point in time there is a transaction involving USD? I find that hard to believe…",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9rldyq",
                                                    "author": "freelee33",
                                                    "score": 1,
                                                    "created_utc": 1653362764.0,
                                                    "response": "Yes and soon even pay your taxes in Bitcoin\n\nhttps://www.businesstoday.in/crypto/story/florida-governor-says-state-open-to-accepting-taxes-in-crypto-from-businesses-327168-2022-03-24",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9rmuzb",
                                                            "author": "lkopfer",
                                                            "score": 1,
                                                            "created_utc": 1653363603.0,
                                                            "response": "And if the USD crashes and is worth nothing how will they evaluate the price of Bitcoin?😂the entire point of Bitcoin is it’s supposed to be a decentralized currency but how will they evaluate the price of the currency if their is not a centralized entity to back it? Do u understand what I’m saying? This is why no company will ever accept it for any reason other then to cash into USD. If I say I value Bitcoin at $5 but the us government values it at a different amount how do we determine discrepancies in what I pay my taxes? This is part of the reason why Bitcoin fluctuates so much in value, because there is not entity backing the value.  I personally believe bitcoins value closely follows the stock markets as people treat it like an investment that they can cash in and out of not hold. The whole decentralized idea of Bitcoin is great as long as your operating under the assumption that the USD will fail some day. How in Florida do they determine at establishments what a Bitcoin is worth may I ask?",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9rnbp2",
                                                                    "author": "freelee33",
                                                                    "score": 1,
                                                                    "created_utc": 1653363876.0,
                                                                    "response": "Wow sorry it looks like I hit a nerve I was just alerting you to the facts in Florida. I plan on moving my business there as soon as it is legal to pay taxes in Bitcoin. This way I myself will be on a complete Bitcoin standard I will only accept Bitcoin from clients and I will only transact with others in Bitcoin and than last but not least I will pay my taxes in Bitcoin never touching a stinky fiat thingy ever again",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9rnn1g",
                                                                            "author": "lkopfer",
                                                                            "score": 1,
                                                                            "created_utc": 1653364062.0,
                                                                            "response": "No nerve touched I just don’t think u understand that Bitcoin has fallen into the same hole that every currency in the world has fallen into in that it’s value is based off the USD. So while u may not even realize that your Bitcoin is still very much so being valued on the USD. How r u going to determine how much Bitcoin to charge? I seem to have hit a nerve because your ignoring that question 😂 my guess is your going to do what everyone does and look at how much USD your Bitcoin is worth and operate under that🤦‍♂️which is essentially using USD with extra steps 😂",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i9ror0e",
                                                                                    "author": "freelee33",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653364729.0,
                                                                                    "response": "You do whatever you want to do and I'll do whatever I want to do. If you choose the fiat world I wish you the best I'm choosing the other way as soon as its possible in the United States I don't know what else to say.",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i98gjir",
                    "author": "KazeFantasia",
                    "score": 6,
                    "created_utc": 1652985711.0,
                    "response": "That’s not the solution, that’s the problem",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i98is1t",
                    "author": "BookMobil3",
                    "score": 5,
                    "created_utc": 1652986622.0,
                    "response": "He said the quiet part out loud",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i98aoe9",
                    "author": "TheGreatTravisty",
                    "score": 12,
                    "created_utc": 1652983299.0,
                    "response": "If anyone wants a GREAT book to read on this topic, I suggest “The creature from Jekyll Island.” It’s about how the Federal Reserve was created, why, and how it operates, and how Fiat is created out of thin air……it’s what made me look for an alternative and ended up in Bitcoin",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i98bmar",
                            "author": "thefullmcnulty",
                            "score": 3,
                            "created_utc": 1652983687.0,
                            "response": "Thanks for the rec",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i986hlx",
                    "author": "stickitinthereass100",
                    "score": 5,
                    "created_utc": 1652981618.0,
                    "response": "Good I'll be withdrawing s substantial amount in the near future. Asshole.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i98u02d",
                    "author": "Particular-Leopard34",
                    "score": 4,
                    "created_utc": 1652991216.0,
                    "response": "Same attitude my neighbor took in 2004-2007.  Maxed out his refi and bought boats, cars, hookers and blow.  In 2008 he had no boats, car, hookers, blow, or wife.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i98ud4t",
                            "author": "thefullmcnulty",
                            "score": 3,
                            "created_utc": 1652991365.0,
                            "response": "Magical free energy schemes alway end in rubble.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i998l2d",
                    "author": "SunRev",
                    "score": 5,
                    "created_utc": 1652998382.0,
                    "response": "The purpose of taxes is to shape our behavior. The government doesn't need our money since they can just make it from thin air.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i987hp3",
                    "author": "RumPepsi",
                    "score": 7,
                    "created_utc": 1652982019.0,
                    "response": "Yup, printing money out of nothing and lending it to us. Priceless.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i98pwk5",
                            "author": "RexMic",
                            "score": 3,
                            "created_utc": 1652989535.0,
                            "response": "Its like slavery but with extra steps.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i98g1sj",
                    "author": "a_stonk_a_day",
                    "score": 2,
                    "created_utc": 1652985509.0,
                    "response": "hoping they pull another one of these again soon <3",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i98hdu8",
                            "author": "thefullmcnulty",
                            "score": 1,
                            "created_utc": 1652986054.0,
                            "response": "It’s coming.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i98kjpb",
                    "author": "kcolgeis",
                    "score": 2,
                    "created_utc": 1652987341.0,
                    "response": "They spelled paper wrong.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i98ldoe",
                    "author": "saucedonkey",
                    "score": 2,
                    "created_utc": 1652987680.0,
                    "response": "That’s great for bitcoin. The gate is open and the horses are already out.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i98rpix",
                    "author": "Gallirium",
                    "score": 2,
                    "created_utc": 1652990272.0,
                    "response": "“You don’t need to, your money is losing value either way.”",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i98vx84",
                    "author": "vkashen",
                    "score": 2,
                    "created_utc": 1652992527.0,
                    "response": "There's an infinite amount of cash in Zimbabwe too.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i99ghgy",
                    "author": "sebikun",
                    "score": 2,
                    "created_utc": 1653002239.0,
                    "response": "This makes it so much better 😆🤦🏼",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9a0dcj",
                    "author": "PReasy319",
                    "score": 2,
                    "created_utc": 1653012175.0,
                    "response": "That. Is. The *PROBLEM*.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i98avku",
                    "author": "Keith_Kong",
                    "score": 3,
                    "created_utc": 1652983381.0,
                    "response": "\"No need to worry, the number in your bank account is meaningless.\"",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i98fd7g",
                            "author": "thefullmcnulty",
                            "score": 3,
                            "created_utc": 1652985227.0,
                            "response": "🎯",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i98f60s",
                    "author": "BeemanIT",
                    "score": 3,
                    "created_utc": 1652985145.0,
                    "response": "How about I write \"I owe you\" for all your physical assets and once everything is in my name I say those \"I owe you\" aren't worth anything.\n\nIn the real world the \"I owe you\" is really the federal reserve note which will soon be worth nothing.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i984d9r",
                    "author": "dragonstalking",
                    "score": 2,
                    "created_utc": 1652980767.0,
                    "response": "What a fucking crook answer",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i98508y",
                            "author": "thefullmcnulty",
                            "score": 7,
                            "created_utc": 1652981018.0,
                            "response": "Don’t worry, it’s all under control. Go back to work.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i980ver",
                    "author": "thefullmcnulty",
                    "score": 1,
                    "created_utc": 1652979362.0,
                    "response": "This post is for all of the people in this sub who *demanded* that there just couldn’t be an infinite currency supply. \n\nYou were all wrong according to Neel Kashkari, President of Minneapolis’ Federal Reserve Bank. Exactly as I stated - currency supply is effectively infinite *as needed.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9a24kf",
                    "author": "sudomatrix",
                    "score": 1,
                    "created_utc": 1653013044.0,
                    "response": "If there is an infinite amount of cash, then \\*MY\\* dollar is worth 1/infinity.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ai59g",
                    "author": "Thats_Capricorn_isit",
                    "score": 1,
                    "created_utc": 1653021966.0,
                    "response": "This is true because of the concept of Monetary Sovereignty. The Nations and countries  that have gone bankrupt over the past few decades lacked any ability to dictate its own monetary policy, ie were not monetarily sovereign. The US does not have that issue , so no one can force it into bankruptcy. It prints the money it needs. However it only has this ability at the Federal level. States , cities , towns and individuals are not monetarily sovereign entities",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ajqpu",
                    "author": "dsmlegend",
                    "score": 1,
                    "created_utc": 1653023038.0,
                    "response": "Say whaaaaaaaaat! Why they been holding out on us?! I'm pretty sure infinity divided by 7 billion is at least a million dollars each. Maybe more!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9b8qnv",
                    "author": "Nine-Planets",
                    "score": 1,
                    "created_utc": 1653043197.0,
                    "response": "The way this country does it. You pay tax and the government uses your tax dollars to provide services and infrastructure. \n\nExcept, no. \n\nThe US Government has borrowed an unimaginable amount of money to give away to defense contractors and anyone who gives congress people political donations, usually micro-pennies to the dollar. Your taxes just keep the US from going into default as they pay the interest of that debt.\n\nEvery year the service to the US National Debt takes a few more days of the total taxes collected for the calendar year to cover. Anyone with math skills should be able to understand, someday in the not too distant future, the interest on the debt will take all of the taxes collected for the entire year to pay. At that point we'll probably get a few extra years whilst they juggle the books and borrow even more money to pay the interest At some point the spend-and-tax system will fail when China, who has more dollars than they know what to do with, will dump them onto the market for a fraction of a what they were worth, and you can easily see how this spiral will end up plunging the country into a financial total meltdown. China will defeat us without a weapon. They will watch us spend ourselves to death. While they have full authoritative control over their own people.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9b8u31",
                            "author": "Nine-Planets",
                            "score": 1,
                            "created_utc": 1653043265.0,
                            "response": "I forgot to add the debt clock - https://www.usdebtclock.org/index.html",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9bzp7x",
                    "author": "Jpandjcfol",
                    "score": 1,
                    "created_utc": 1653056728.0,
                    "response": "Not everything that is finite has value. But more importantly: nothing that is infinite will ever have lasting value…",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9c23eh",
                    "author": "ivgur",
                    "score": 1,
                    "created_utc": 1653057695.0,
                    "response": "nothing new really",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ctn0w",
                    "author": "kingmessi30",
                    "score": 1,
                    "created_utc": 1653068642.0,
                    "response": "Is there a shortage of ink ?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9cuboy",
                            "author": "thefullmcnulty",
                            "score": 1,
                            "created_utc": 1653068931.0,
                            "response": "Never a shortage of bits to append their ledgers",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i986l1f",
                    "author": "TiredOldGrunt412",
                    "score": -4,
                    "created_utc": 1652981656.0,
                    "response": "Wrong... There's an infinite supply of taxpayer money at the federal reserve.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i987k3b",
                            "author": "thefullmcnulty",
                            "score": 3,
                            "created_utc": 1652982045.0,
                            "response": "They are not using taxpayer money. They just create it out of thin air as needed.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}