{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uwjvx9",
            "title": "What is bitcoin and how does it work",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uwjvx9/what_is_bitcoin_and_how_does_it_work/",
            "author": "hellwrap",
            "created_utc": 1653371391.0,
            "score": 1,
            "num_comments": 0,
            "subreddit": "Bitcoin",
            "selftext": " Bitcoin is a type of digital cryptocurrency that is fully decentralized, that is, bitcoin cannot be controlled by the government of any country or any person.\n\nSatoshi Nakamoto started Bitcoin in 2008, but to date, no one knows who Satoshi Nakamoto is, or what it looks like.\n\nThe price of bitcoin in 2008 was about 0.20 cents, but if you look at the price of bitcoin now, it is about 29,359 dollars.\n\nMaybe bitcoin will become a primary means of transactions in the future, if you ask the experts about bitcoin, then everyone trusts bitcoin, but some veteran investors still consider bitcoin a useless investment.\n\n**How does Bitcoin Works?**\n\nEvery bitcoin in the world is basically a type of computer file that is stored in a ‘digital wallet’ app on any smartphone or computer.\n\nAnyone can send any number of bitcoins to your digital wallet anytime and anywhere, and you can send any number of bitcoins to other people anytime and anywhere.\n\nEvery single bitcoin transaction is recorded on a public list called the blockchain.\n\nThis makes it possible to trace the history of bitcoin to prevent people from spending coins they don’t already have, making copies, or undoing transactions.",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uwjtg8",
            "title": "How many confirmations needed to send recently recieved BTC",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uwjtg8/how_many_confirmations_needed_to_send_recently/",
            "author": "Pleasant-Paper-5968",
            "created_utc": 1653371144.0,
            "score": 1,
            "num_comments": 6,
            "subreddit": "Bitcoin",
            "selftext": "Sorry if this is a noob question, I have tried searching around for an answer but haven't been able to find one. \n\nIf I have recently had BTC transferred into my Electrum wallet, how many confirmations do I need that transfer to have before I can then send that BTC on to someone else? Do I have to wait for all 6 bedore I send to another wallet? Or is even just 1 enough?\n\nI am new to crypto. And answers would be greatly appreciated.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9rydx0",
                    "author": "SomeBrokeChump",
                    "score": 1,
                    "created_utc": 1653371198.0,
                    "response": "Just 1 confirmation.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ryeh9",
                    "author": "88eth",
                    "score": 1,
                    "created_utc": 1653371210.0,
                    "response": "You can send the Bitcoin out even before the original transaction is confirmed. Theres also an option to turn that on or off in Electrum.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ryj0s",
                    "author": "MCHappster1",
                    "score": 1,
                    "created_utc": 1653371308.0,
                    "response": "I’m not 100% sure but I think if you make multiple transactions in the same block they would all be confirmed together? Like if you made 10 payments in the ~10min block time they would be all confirmed when that block gets confirmed enough.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9s2r9w",
                    "author": "igadjeed",
                    "score": 1,
                    "created_utc": 1653374683.0,
                    "response": "You can spend a recently received coin before confirmation. Your transaction can not be confirmed before its parent, but they can be confirmed in the same block",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9s6zuq",
                    "author": "Pleasant-Paper-5968",
                    "score": 1,
                    "created_utc": 1653378387.0,
                    "response": "Cool thanks for the replies everyone :)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9rzazw",
                    "author": "ndgoLiberty",
                    "score": 0,
                    "created_utc": 1653371906.0,
                    "response": "Exchanges will wait for however many confirmations they feel like requiring. After all your bitcoin are their bitcoin on exchange.\n\nOn your own wallet you can send as soon as the funds hit your wallet. So I guess that’s 1 confirmation but really it’s just very first block that transaction was included in.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}