{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "usga74",
            "title": "ASIC miner for beginner",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/usga74/asic_miner_for_beginner/",
            "author": "Jealous_Profile7509",
            "created_utc": 1652889819.0,
            "score": 16,
            "num_comments": 45,
            "subreddit": "BitcoinBeginners",
            "selftext": "So I am pretty new to Bitcoin and I am looking to see about starting to mine one a small scale. I am not in it to get rich quick I am just hoping to buy an ASIC miner that will return some level of a profit in the long-term so I can accumulate more Bitcoin. I recently came into a small amount of fiat capital as a result of a workers compensation settlement and have been looking into ASIC mining machines. I was just hoping for some suggestions here as to what kind of ASIC miner you would recommend to start off for this purpose. I have heard that Antminer may be a quality product for this purpose but there are many variations and price ranges that I have seen online. I am not looking to break the bank and trying to see if there are any viable options that may be in the 1k-2k price range (depending on what I can get my wife on board with). Any advice or suggestions would be greatly appreciated. Thank you.",
            "stickied": false,
            "comments": [
                {
                    "id": "i93g2jo",
                    "author": "PeacefullyFighting",
                    "score": 7,
                    "created_utc": 1652893788.0,
                    "response": "Check your electricity cost before anything else. It's the determining factor for profits. It's why I don't own one, my electricity costs ~.14/kwh and would have to have the newest miner to see any profits and ROI would be 10+ years. The miner won't last that long. \n\nSmall time mining is difficult because it's easy to get corporate level funding that allows someone to get the best electricity prices in the country or world by building a custom mining warehouse, possibly negotiating an even better rate or a tax discount from the local government when you can show almost guaranteed returns.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i94519h",
                    "author": "FieserKiller",
                    "score": 4,
                    "created_utc": 1652903909.0,
                    "response": "depends on your power costs. Iy you have <5ct/kwh power an antminer S9 will be profitable and costs less then $500 noadays. If you pay >10ct/kwh you need the latest S19 to break even which is \\~$10k.  \nAnother aspect of home mining is: use that heat. IF you heat your home with electrycity anyway - do it with miners! same power costs but you get free bitcoin :D Only down side is you need to think of a smart setup to harvest the heat for your home while keeping the noise away.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9atom9",
                    "author": "nullama",
                    "score": 2,
                    "created_utc": 1653030553.0,
                    "response": "[I would say this is the best device you can buy right now in your situation](https://shop.futurebit.io/products/pre-order-apollo-btc-a-bitcoin-asic-miner-and-desktop-class-computer-running-a-full-node-and-much-more-batch-1-ships-in-late-april-to-may?variant=33404796928099).\n\nThe Apllo BTC is not very expensive, it's quiet, and you can learn a lot from it. It can mine a few sats, that's for sure, but it won't make you a millionaire.\n\nIt's a great starting point for you to decide if you want to deal with noisy and hot machines. This one can be tuned down to mine in almost complete silence (with lower hashrate of course), or at turbo with a lot of noise, but double or triple the hashrate.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9bwrcg",
                            "author": "Jealous_Profile7509",
                            "score": 1,
                            "created_utc": 1653055513.0,
                            "response": "Thank you that looks really Intriguing. Looks like they are sold out for awhile.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9383mj",
                    "author": "subduderecords",
                    "score": 4,
                    "created_utc": 1652890602.0,
                    "response": "Uh, brother unless you've got tens of thousands of dollars to spend on multiple ASICs, you won't find one that will return any kind of meaningful profit. It's just not there unless you have the capital to run a mining farm. Now if you want to mine just to get some partial BTC every few days...then get a Bitmain S9 on ebay.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i938zv3",
                            "author": "Jealous_Profile7509",
                            "score": 2,
                            "created_utc": 1652890962.0,
                            "response": "Yea man I’ll be honest I have not researched this super extensively as I am still new and getting acquainted with the process. I have watched some YouTube videos with single machine miners and reporting a profit of like $7-$13 a day (which they don’t qualify the hours of operation there so I’m sure that is something to factor in). I definitely don’t have the expectation of massive daily profits and I am alright with a slow burn accumulation process. Thank you for your suggestion I will definitely check that out!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i94ra4y",
                                    "author": "Luxuriosa_Vayne",
                                    "score": 4,
                                    "created_utc": 1652913309.0,
                                    "response": "you're better off buying bitcoin with those 7-13 dollars a day and holding",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i93a0m6",
                                    "author": "thadpole",
                                    "score": 3,
                                    "created_utc": 1652891373.0,
                                    "response": "You are talking about acquiring a machine that costs $10k+ in addition to $5-10/day in electricity to run. Miners have access to bulk discounts and cheap electricity. You are exposing yourself to more risks of the machine failing, which is far more likely than bitcoin failing.\n\nMining \"for fun\" or as a hobby is long gone. This is a capital intensive business with billions of  dollars in venture capital that can afford to go deep into debt to squeeze the margins out of mining. You do not.\n\nIf you want to assist the network, run a node and hold bitcoin. You will have more of an impact and profit yourself.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i93ag3u",
                                            "author": "Jealous_Profile7509",
                                            "score": 2,
                                            "created_utc": 1652891547.0,
                                            "response": "Thank you for your advice. I am sorry if this is a stupid question but what does running a node involve?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i93edu9",
                                                    "author": "thadpole",
                                                    "score": 2,
                                                    "created_utc": 1652893115.0,
                                                    "response": "Downloading the blockchain in its entirety (300gb~) and validate incoming transactions",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9367dy",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1652889820.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i94lmq2",
                    "author": "cryptokadog710",
                    "score": 1,
                    "created_utc": 1652910835.0,
                    "response": "Be prepared for high ass electric bills...been there playing around with an s9 I got for $100 a few years ago...good luck",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i95dw0q",
                    "author": "uggh_him_again",
                    "score": 1,
                    "created_utc": 1652923895.0,
                    "response": "I have five  s19 I’ll sell yeah.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i95slyv",
                    "author": "cpjr48",
                    "score": 1,
                    "created_utc": 1652931094.0,
                    "response": "As a hobby in your price range, and to learn about SHA-256 mining consider Gekko Science Compac F kit from Bitcoinmerchant or FutureBit Apollo BTC.  Go to Bitcoin Forum and research this first.  These are in very limited supply and you must sign up and wait to get them.  If your electricity cost is free, these may return your investment in 20 to 50 years.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9atvk6",
                            "author": "nullama",
                            "score": 1,
                            "created_utc": 1653030720.0,
                            "response": "The Compac Fs are great, but are a bit more advanced, because for starters you need to provide your own fan, and a special USB hub that delivers more than 3A per port, which are rare(not even the one in bitcoinmerch is capable of doing it). They are expensive as well per TH/s.\n\nThe Apollo comes ready to use and it's cheaper per TH/s.\n\nI have both and they work great, but for a beginner I would go for the Apollo.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i96o9p1",
                    "author": "igadjeed",
                    "score": 1,
                    "created_utc": 1652955381.0,
                    "response": "> are any viable options that may be in the 1k-2k price range\n\nOnly if you want to mine at a loss",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}