{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ux7d8q",
            "title": "Bitcoin or college ?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/ux7d8q/bitcoin_or_college/",
            "author": "SweetCoffee120",
            "created_utc": 1653445913.0,
            "score": 0,
            "num_comments": 342,
            "subreddit": "Bitcoin",
            "selftext": "Hello, I am living in france where the total cost of university is 500€. I was planning on studying computer science, but I see my bitcoin holdings erode little by little as time passes because of necessary purchases. If I go to college I assume my parents would be able to pay for my food and appartment rent but I am worried they ask me to pay it with my own money, have less money to give me because of the devaluation of their wages with inflation or I could simply need to spend my bitcoin to buy other necessary things on my own thus loosing a huge portion of my btc.\n\nAlso I see the price of bitcoin that low and the possible bear market so to me it looks like a huge opportunity to buy since I am bullish long-term and think we will hit at least 140.000 USD per coin in 3 years. So working and saving most of my income in bitcoin could generate a lot.\n\nSo in your opinion is it a good idea to work and maybe self-study or get a degree later rather than missing that bitcoin opportunity and maybe loose some and starting university right now ? I am 19 yo\n\nEdit: I will do uni for a year at least and try to find a job on the side, thank you for your comments !",
            "stickied": false,
            "comments": [
                {
                    "id": "i9vzgy4",
                    "author": "BackInTheDay23",
                    "score": 124,
                    "created_utc": 1653446470.0,
                    "response": "I'd pick College. I love Bitcoin, but education is far more important. If you finish college and get a good job then you'll have more money to buy Bitcoin.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9wpwu4",
                            "author": "yusupan777",
                            "score": 1,
                            "created_utc": 1653463014.0,
                            "response": "True, we all love the bitcoin, but picking ahead of the education is not the wise decision.\n\nI would say try to put some pocket money on the weekly or monthly base in the bitcoin.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9w08fz",
                            "author": "SweetCoffee120",
                            "score": -46,
                            "created_utc": 1653446838.0,
                            "response": "Yes sure but if it reaches 140k which I think it will I will have less than if I start working now",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9w0x4e",
                                    "author": "BackInTheDay23",
                                    "score": 35,
                                    "created_utc": 1653447170.0,
                                    "response": "That is a stupid prediction.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9z03sf",
                                            "author": "Vad80",
                                            "score": 2,
                                            "created_utc": 1653505777.0,
                                            "response": "No one knows the exact price for the future for sure.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i9w1i2q",
                                            "author": "SweetCoffee120",
                                            "score": -31,
                                            "created_utc": 1653447454.0,
                                            "response": "Why is it so ? You think it will be worth less ? I have reasons behind, I have studied Bitcoin a lot",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9w26gf",
                                                    "author": "sangderenard",
                                                    "score": 32,
                                                    "created_utc": 1653447791.0,
                                                    "response": "If you think you can predict a market you need to go to college instead of spending the money on an investment",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9xbys8",
                                                            "author": "t6ssitujurikkuja",
                                                            "score": 1,
                                                            "created_utc": 1653480503.0,
                                                            "response": "I have seen many giant of the market, but even they can't predict the exact price for the market.\n\nAll they can do is the guessing and hope,but getting the 100% is not possible.",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "i9w2gh7",
                                                            "author": "SweetCoffee120",
                                                            "score": -24,
                                                            "created_utc": 1653447928.0,
                                                            "response": "You didn't understood, I did not say it will be 140k exactly, I said it will be at least 140k in my opinion, I think it has a high chance. I know I can't predict numbers",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9w2s3s",
                                                                    "author": "sangderenard",
                                                                    "score": 39,
                                                                    "created_utc": 1653448092.0,
                                                                    "response": "oh I'm sorry I misunderstood, let me try again. If you think you can predict a market you need to go to college instead of spending the money on an investment",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9x64op",
                                                                            "author": "justwalk37",
                                                                            "score": 1,
                                                                            "created_utc": 1653476862.0,
                                                                            "response": "You can always cut your pocket money to buy some bitcoin.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        },
                                                                        {
                                                                            "id": "i9w31wr",
                                                                            "author": "SweetCoffee120",
                                                                            "score": -4,
                                                                            "created_utc": 1653448230.0,
                                                                            "response": ">oh I'm sorry I misunderstood, let me try again. If you think you can predict a market you need to go to college instead of spending the money on an investment\n\nWhy I don't understand ?",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i9w3quf",
                                                                                    "author": "sangderenard",
                                                                                    "score": 17,
                                                                                    "created_utc": 1653448585.0,
                                                                                    "response": "Depending on the college, depending on the person, depending on a lot of things - this is not financial or educational or menial advice - college is about being exposed to thoughts and people, developing humility, and learning to work hard long past the point that things stop being easy and start feeling hopeless. It's about these things to the point that if it is too easy you cheat yourself out of the lessons therein. It's about doing these things in a way that liberates your mind and allows you to think in new ways.\n\nThinking bitcoin will reach $140k is a guess, and if it ends up true, nobody who guesses it will have been right for their confidence in it. The fact that a guess ends up correct does not mean that it was safe to have acted on. If I say to you, I will not be hit by cars, I will run out across the road with my eyes shut, I am not skilled or insightful if I do not die, I am lucky.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i9w8zug",
                                                                                            "author": "LouisKI",
                                                                                            "score": 4,
                                                                                            "created_utc": 1653451352.0,
                                                                                            "response": "Didn't expect to see such a smart answer to such a dumb post. Thumbs up",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        },
                                                                                        {
                                                                                            "id": "i9w4kym",
                                                                                            "author": "SweetCoffee120",
                                                                                            "score": -2,
                                                                                            "created_utc": 1653449002.0,
                                                                                            "response": "Sure but I think it has a high probability, so it seems maybe a good decision probabilistically + the university I can go to is a small non prestigious university",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        },
                                                                                        {
                                                                                            "id": "i9wxxch",
                                                                                            "author": "Verticalnevis763",
                                                                                            "score": 1,
                                                                                            "created_utc": 1653470199.0,
                                                                                            "response": "I think even the billionaire sons goes to college, because we all know education is the must thing.\n\nI am investing in the bitcoin but still going to the office because we all know bitcoin is a not fixed guarantee.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "id": "i9wckin",
                                                                                    "author": "kidcoodie",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653453445.0,
                                                                                    "response": "You don’t have a crystal ball. What if you go with your strategy, it DOESNT go to “at least 140k”, or even goes lower than it is now? Then you have wasted your time waiting for gains that haven’t come with zero education. I think you’re making a stupid bet. \n\nJust go to college, buy as much Bitcoin as you’re able to currently, buy and dollar cost average while you get educated, and you will be better off in the long run.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i9x2gkz",
                                                                                            "author": "Backbelabour265",
                                                                                            "score": 1,
                                                                                            "created_utc": 1653474098.0,
                                                                                            "response": "No one knows the future, we are making the prediction on the base of the past.\n\nAccording to that we were suppose to get the april month of the bull but we know how it turns out this time.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "id": "i9x14re",
                                                                                    "author": "Johnny_jai",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653473006.0,
                                                                                    "response": "Buddy education is a must thing, trust me telling you with experience.",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "i9wzw1j",
                                                                    "author": "rm44377",
                                                                    "score": 1,
                                                                    "created_utc": 1653471943.0,
                                                                    "response": "yes we all know bitcoin will hit 140k mark in the future but you need to do study is well.\n\nIt's like you are putting all your egg in a single basket, what if something really bad happen to the btc?",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i9w2gqg",
                                                    "author": "Black_Labs_Matter69",
                                                    "score": 1,
                                                    "created_utc": 1653447932.0,
                                                    "response": "Here’s an idea. I joined the military. Paid for my college and gave me $2600 a month while I attended college to pay for rent and food. While I was serving I earned money and saved it. Got out bought a house and got a good job with my experience in the military and degree. More money for bitcoin. Instead of living off your parents why not earn it yourself?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9z6s4f",
                                                            "author": "8bhrcpr",
                                                            "score": 3,
                                                            "created_utc": 1653508466.0,
                                                            "response": "That's a great thing you are doing good, earning while study.",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "i9w4o8o",
                                                            "author": "SweetCoffee120",
                                                            "score": 0,
                                                            "created_utc": 1653449048.0,
                                                            "response": "Sounds great, I will look to see if I can do that in my country",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9xfix9",
                                                                    "author": "astraytuck",
                                                                    "score": 1,
                                                                    "created_utc": 1653482470.0,
                                                                    "response": "Try to get some part time job for the investment in the bitcoin.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i9w2cxo",
                                                    "author": "BackInTheDay23",
                                                    "score": 1,
                                                    "created_utc": 1653447880.0,
                                                    "response": "You cold have a degree in Bitcoinomics and still not be able to accurately make a prediction. It's really not worth losing college over this. It seems to me like you already made your decision anyway.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9y3svr",
                                                            "author": "adamantftf",
                                                            "score": 1,
                                                            "created_utc": 1653493141.0,
                                                            "response": "No one ever had made the exact prediction for the crypto market.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i9yhfe5",
                                                    "author": "hoangnd1",
                                                    "score": 1,
                                                    "created_utc": 1653498447.0,
                                                    "response": "It's not like that mate, but no one knows the future and no one knows what will the actual price of the bitcoin in the future.\n\nMay be we hit the 100k mark or may be hit the 10k is well, so the possibility are limitless.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9w2wy6",
                                    "author": "Happy_Arthur_Fleck",
                                    "score": 5,
                                    "created_utc": 1653448161.0,
                                    "response": "it doesn't matter, it's just FOMO. You can invest on other stuff, right now, imo the best investment that you can do is your education.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9wsh64",
                                            "author": "Epizoicegyptian582",
                                            "score": 1,
                                            "created_utc": 1653465239.0,
                                            "response": "You can do the investment in later half of your life, but never gonna get the time for the education in future.\n\nCollege life is a new experience and i would say we all need to experience that in our life.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9zf1oz",
                                    "author": "YMFwJJe",
                                    "score": 1,
                                    "created_utc": 1653511828.0,
                                    "response": "You can always put the small small fund rather than putting the fee.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9w395j",
                    "author": "Grandsinge",
                    "score": 11,
                    "created_utc": 1653448331.0,
                    "response": "When you ask a question like this on an internet forum you're going to get all sorts of answers. There are people who didn't get a degree who work their asses off and make $$$, own a business, or are otherwise successful. There are college graduates, who worked their asses off, burn out, and end up bouncing job to job and drowning in college debt. \n\n\nFind something you're passionate about and get really fucking good at it and then find a way to get paid for it. For me college provided the framework and connections to do that. However, I realize that's not the only way. That said, my years in college were a hell of a lot of fun and I wouldn't have done it differently. Also, buy bitcoin. Perhaps just a little now and then more when you have a steady income.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9w44oq",
                            "author": "SweetCoffee120",
                            "score": 1,
                            "created_utc": 1653448780.0,
                            "response": "Thank you for your view, it makes sense to me !",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9zevmc",
                                    "author": "PutnikAda",
                                    "score": 1,
                                    "created_utc": 1653511759.0,
                                    "response": "I am just hoping that in the end you make good decision for yourself.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9x2kwx",
                            "author": "xpureblitz",
                            "score": 1,
                            "created_utc": 1653474194.0,
                            "response": "True, internet is the place you need to take that kind of the advice. This is one of the best decision of anyone life.\n\nHe should sit with his parents and try to tell the whole plan and then decide afterward.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9vzx56",
                    "author": "nullama",
                    "score": 15,
                    "created_utc": 1653446686.0,
                    "response": "You can get most of the education in computer science for free, lectures from top universities and courses of computer science are available for free. Also, if you're good, no one will care about where you studied, I think this is kinda unique in computer science.\n\nHaving said that, I think university provides a huge value. You will meet a lot of different, interesting people, you will be surrounded with smart, creative, and awesome people, all in the same place. You will have access to professors who might be able to guide and help you, even after you graduate. You will have access to a great community, you will be pushed to learn more, etc. Also, in extreme cases, having a degree will help you, for example if you're planning to move abroad and you need to apply for a visa, certain countries value more your application if you have a degree, and of course it's socially much better appreciated than not having it.\n\nIf I were you I would at least go to college for a year, and see how it goes. And focus on the people and experiences, not that much in the lessons, since you can learn that by yourself at any time.\n\nBitcoin is money in the end, so just get a part time job if you really want to invest and buy a bit with the money you get. Also, try working for Bitcoin directly, help your mates at college and ask for a few sats.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9w0y50",
                            "author": "SweetCoffee120",
                            "score": 2,
                            "created_utc": 1653447184.0,
                            "response": "Thank you for your reply, it is a very great idea I think to do at least one year, try to work part time and see how it goes. I will think I will do that",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9wamu8",
                                    "author": "1800smellya",
                                    "score": 1,
                                    "created_utc": 1653452283.0,
                                    "response": "What this poster said 💯",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9wmtb6",
                                    "author": "Worried-Taro2437",
                                    "score": 1,
                                    "created_utc": 1653460514.0,
                                    "response": "Sacrifice the time needed, go to university, also do a side job, it will worth the effort. Buy btc when you can. Try and meet people as much as possible. All will be well. In 10 years, you will be laughing at this post.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9xr1sw",
                                    "author": "Martin77Punk",
                                    "score": 1,
                                    "created_utc": 1653487918.0,
                                    "response": "Yes, that's the way try to do some part time work for the bitcoin.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9wt7f4",
                            "author": "sermih1",
                            "score": 1,
                            "created_utc": 1653465887.0,
                            "response": "True, leaving the education behind is not a wise decision at all, yes you can get the degree from the online course as there are many out there.\n\nBut he surely gonna miss the chance of experiencing the best time of his life.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9vz5sl",
                    "author": "Alesi42",
                    "score": 30,
                    "created_utc": 1653446321.0,
                    "response": "Invest in yourself first. Get an education.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9vzgme",
                            "author": "SweetCoffee120",
                            "score": 5,
                            "created_utc": 1653446466.0,
                            "response": "But couldn't I self study with this https://github.com/ossu/computer-science and be fine ?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9w08mi",
                                    "author": "Ok_Aerie3546",
                                    "score": 13,
                                    "created_utc": 1653446840.0,
                                    "response": "A lot of jobs just want an applicant with a degree. A college degree makes it easier to earn more later, and consequently to buy more bitcoin.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9y8vtm",
                                            "author": "lightsofray",
                                            "score": 1,
                                            "created_utc": 1653495132.0,
                                            "response": "College degree always going to give you a better company than the online course.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9wb0ty",
                                    "author": "EgonHorsePuncher",
                                    "score": 3,
                                    "created_utc": 1653452502.0,
                                    "response": "Hm... didn't know about this resource.   \nGonna start using it as well now in learning python. o/  \n\n\nBut a lot of what people are saying here lines up, degrees help open doors. You certainly could sneak in with proof of competency during the interview process, but a lot of folks won't have you get to that point without a degree first.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9zd4s1",
                                            "author": "fontas3",
                                            "score": 1,
                                            "created_utc": 1653511036.0,
                                            "response": "Yes, for big companies you need to have degree to open the door of those companies.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9w978u",
                                    "author": "LouisKI",
                                    "score": 4,
                                    "created_utc": 1653451467.0,
                                    "response": "I highly doubt your capacity of self learning that entire course if you're asking whether you should give up higher education to buy bitcoin.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9yh8sj",
                                            "author": "ourielb003",
                                            "score": 3,
                                            "created_utc": 1653498375.0,
                                            "response": "Trust once you enter in the bitcoin market, there is very little you gonna after that.\n\nSince i came here in the market, i hardly get the time to spend with the family or friend.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9w0akw",
                                    "author": "castorfromtheva",
                                    "score": 3,
                                    "created_utc": 1653446866.0,
                                    "response": "Likely not in a world based on paper certificate shit. Unless you find other ways to prove yourself.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9w109x",
                                            "author": "SweetCoffee120",
                                            "score": 3,
                                            "created_utc": 1653447213.0,
                                            "response": "Yes I see, it's a problem indeed",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9zew59",
                                                    "author": "treyminer",
                                                    "score": 1,
                                                    "created_utc": 1653511764.0,
                                                    "response": "So, what are the idea you have in your mind along with bitcoin?",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9yx692",
                                            "author": "kaminsllc",
                                            "score": 1,
                                            "created_utc": 1653504604.0,
                                            "response": "But if are living in a time, when we need to have a paper certificate.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9w1kqw",
                                    "author": "Asmodiar_",
                                    "score": 3,
                                    "created_utc": 1653447492.0,
                                    "response": "Yes, probably. \n\nLearn to code erc-20 smart contracts do some sexy 1155 NFTs and write your own ticket 🤷\n\nAfter your first job - nobody asks about where you went to school.\n\nIf you can go to Oxford or Harvard or similar - it's the connections that are more important than the learning.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9w3u34",
                                            "author": "SweetCoffee120",
                                            "score": 2,
                                            "created_utc": 1653448630.0,
                                            "response": "Lol it's a small french university in the countryside, not very prestigious !",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9x2raz",
                                                    "author": "thriceSpotweld",
                                                    "score": 0,
                                                    "created_utc": 1653474334.0,
                                                    "response": "So, are your parents are cool with that? of you not going the university?",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9wv5wh",
                                            "author": "rjmalolot",
                                            "score": 2,
                                            "created_utc": 1653467663.0,
                                            "response": "There are many way to earn on the internet if anyone is smart enough .",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9z5k98",
                                    "author": "xacx2as32f1a65sa",
                                    "score": 1,
                                    "created_utc": 1653507979.0,
                                    "response": "So what will you do in your free time? ANy part time job?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9wwijs",
                            "author": "piszpunta",
                            "score": 1,
                            "created_utc": 1653468912.0,
                            "response": "The more you invest in yourself the better return you will get in future.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9w2g8u",
                    "author": "LocknessMonster350",
                    "score": 19,
                    "created_utc": 1653447925.0,
                    "response": "how many of these people saying “you can get a cs education online” actually work as software engineers? I make insane amounts of money and my degree was totally worth it, but if you don’t want to invest in yourself and would rather have your future rely on speculative markets, go ahead",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9w2wud",
                            "author": "SweetCoffee120",
                            "score": 1,
                            "created_utc": 1653448160.0,
                            "response": "Nothing is 100% sure in life, even a diploma",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9w8jac",
                                    "author": "PrimalFinance",
                                    "score": 4,
                                    "created_utc": 1653451101.0,
                                    "response": "🤣 he says that while predicting Bitcoin will go to 140k.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9wayi1",
                                            "author": "SweetCoffee120",
                                            "score": 1,
                                            "created_utc": 1653452465.0,
                                            "response": "200% a year, what about that sir ? Trading volume increasing 50% a year, countries adopting it as legal tender",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9wmd9c",
                                                    "author": "-_-Zuko",
                                                    "score": 2,
                                                    "created_utc": 1653460169.0,
                                                    "response": "If you believe in btc that much, then set aside a portion of your yearly gross income to invest in it. Dont waste your time shoving this information down people’s throats. You’ve got better things to do—like stacking.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i9yvvke",
                                                    "author": "Moonkeyfoxking",
                                                    "score": 1,
                                                    "created_utc": 1653504096.0,
                                                    "response": "I think we not gonna get that much of profit in  year from now on.\n\nWith the market cap increasing with time, it's very hard to get the profit like we get in the past.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9ywhmt",
                                                            "author": "SweetCoffee120",
                                                            "score": 1,
                                                            "created_utc": 1653504337.0,
                                                            "response": "Yeah I also think we will have a bearish year",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9wsm5b",
                                            "author": "priman2005",
                                            "score": 1,
                                            "created_utc": 1653465364.0,
                                            "response": "I think we all know we gonna get that, but no one know when?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9wvd37",
                                                    "author": "PrimalFinance",
                                                    "score": 1,
                                                    "created_utc": 1653467846.0,
                                                    "response": "Exactly. I don't doubt it will get there some day. But it could be 1 year or 5 years. And in regards to the original post, all that waiting around is not worth it when you can get something for certain.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9w3ysg",
                                    "author": "LocknessMonster350",
                                    "score": 8,
                                    "created_utc": 1653448697.0,
                                    "response": "just say you don’t want to do the work for university, and would rather gamble on highly speculative internet money",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9w4x32",
                                            "author": "SweetCoffee120",
                                            "score": 1,
                                            "created_utc": 1653449174.0,
                                            "response": "No I am ready to work that's not an issue and I don't gamble, I take this trade seriously",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9w8hgq",
                                                    "author": "FrugalityPays",
                                                    "score": 9,
                                                    "created_utc": 1653451073.0,
                                                    "response": "You’re not here asking questions in good faith. You’re looking for confirmation bias and anecdotes about ‘I’m successful and didn’t need college’ or the absolute worst, ‘the richest people in the world dropped out of college, it’s useless!’ \n\nThe plural for anecdote is not data. \n\nYou have an opportunity to go school for virtually nothing and study one of the most in demand and high paying degrees that will get you more involved with all the cool stuff crypto can do and exponentially increase your income and holdings. It’s a no brained if you step back for a moment.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9waeps",
                                                            "author": "SweetCoffee120",
                                                            "score": 2,
                                                            "created_utc": 1653452149.0,
                                                            "response": "I am just trying to confront my thoughts by hearing what people think. The data is that bitcoin trading volume increases aprox. 50% every year and more and more people use it so I thought maybe it would be wiser to work and study later on.  \n\n\nI don't think I am successful or anything, I am just starting in life",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9wgl99",
                                                                    "author": "FrugalityPays",
                                                                    "score": 1,
                                                                    "created_utc": 1653456018.0,
                                                                    "response": "Totally get it and being 19 is weird, fun, and fucking hard (at least it can seem that when nothing is certain)! \n\nIf I can offer some perspective…you’re looking at the next four years and figuring out if a degree will be worth more or less than Bitcoin. Overall, Bitcoin will probably win at four years. Zoom out to ten years though and I’d wager that the CS degree + Bitcoin would be FAR more interesting and lucrative. \n\nIf you’re 19 and into Bitcoin and comp sci, you’re likely going to do pretty well Financially. The people, projects, and opportunities you’re exposed to are only expanded by getting the degree.\n\nWhatever your choice, good luck and have fun with it!",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9wl5hs",
                                                                            "author": "SweetCoffee120",
                                                                            "score": 2,
                                                                            "created_utc": 1653459239.0,
                                                                            "response": "Indeed I think it is the best choice",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        },
                                                                        {
                                                                            "id": "i9xum9f",
                                                                            "author": "iamnotyou50",
                                                                            "score": 2,
                                                                            "created_utc": 1653489423.0,
                                                                            "response": "I think he has enough life ahead to do the earning but will never gonna get the second chance for the college.\n\nThis is the best time for a teenager life and they should experience that.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i9yn40e",
                                                                                    "author": "FrugalityPays",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653500659.0,
                                                                                    "response": "Totally! 19-23/4 is a golden age to have fun without real responsibilities or obligations. Just make sure SOMETHING is consistently moving in the direction of being a better human for the coming decades.",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "i9ypo8h",
                                                                    "author": "KUZMICH350GS",
                                                                    "score": 1,
                                                                    "created_utc": 1653501662.0,
                                                                    "response": "I think bitcoin is always a worth taking risk but not over the education.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "i9wwipc",
                                                            "author": "holdorsellbtc",
                                                            "score": 1,
                                                            "created_utc": 1653468916.0,
                                                            "response": "I think OP made his mind quite clear that bitcoin is the thing.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i9w8nfw",
                                                    "author": "ClutchSwaggyG",
                                                    "score": -1,
                                                    "created_utc": 1653451168.0,
                                                    "response": "Don’t listen to this fiat maximalist",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9wapaf",
                                                            "author": "SweetCoffee120",
                                                            "score": 2,
                                                            "created_utc": 1653452321.0,
                                                            "response": "lmao, based",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "i9wv3so",
                                                            "author": "lestatgyry",
                                                            "score": 1,
                                                            "created_utc": 1653467612.0,
                                                            "response": "But you need fiat in the first hand to put the money in the btc.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i9w8s5j",
                                                    "author": "ClutchSwaggyG",
                                                    "score": 1,
                                                    "created_utc": 1653451241.0,
                                                    "response": "Tu peux pas étudier et travailler en même temps?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9waip3",
                                                            "author": "SweetCoffee120",
                                                            "score": 1,
                                                            "created_utc": 1653452215.0,
                                                            "response": "Si je pense essayer de faire ca et si je trouve pas ou je réussis pas les partiels je vais bosser je pense",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i9w9shl",
                                                    "author": "Independent-Snow-129",
                                                    "score": 1,
                                                    "created_utc": 1653451795.0,
                                                    "response": "If your only reason to stay home is because you can buy more bitcoin with the expectation of gaining more fiat  , then this is super silly !  Its all a question of **time, don't lose it.**\n\n**For example , I believe others are actually a burden to my advancement and being alone gives me more valued time ! If it was legal I'd be way below underground with my own renewable energy , underground internet relays and books**  !\n\nIf you think this is anti-social and weird , go work as a software engineer for some *insane* amount, your degree will be totally worth it  !",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9xm9wu",
                                                            "author": "assaeva",
                                                            "score": 2,
                                                            "created_utc": 1653485775.0,
                                                            "response": "My only question is that what if he need some fiat for some thing, then what will be his next move?\n\nTake the money out of the bitcoin, but what if we are in the bear market at that time.?",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9xrw3j",
                                                                    "author": "Independent-Snow-129",
                                                                    "score": 1,
                                                                    "created_utc": 1653488279.0,
                                                                    "response": "Find a job, *or* create ?\n\nTimelock the bitcoin's.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "i9waw77",
                                                            "author": "SweetCoffee120",
                                                            "score": -1,
                                                            "created_utc": 1653452430.0,
                                                            "response": "I don't care about fiat, I care about purchasing power",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9xld1h",
                                                                    "author": "didichello07",
                                                                    "score": 1,
                                                                    "created_utc": 1653485342.0,
                                                                    "response": "So this is the limit you wanna put in the bitcoin for future?",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9xv7ps",
                                                                            "author": "SweetCoffee120",
                                                                            "score": 1,
                                                                            "created_utc": 1653489670.0,
                                                                            "response": "I don't understand, you mean do I think it will only stay an alternate currency and not go beyond that ? I think it will become one of the major currencies in the future along with the current fiat currencies and will get adopted as legal tender in more and more countries because of its economics and I think it will stay the leader in the crypto market because it's the most reliable, it can be improved and has the first mover advantage. Also not ICO has been done we can trace every bitcoin to legitimate mining that has been acquired and to me mining to get it is more legitimate than ICO for it being money",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i9wm9lo",
                                                    "author": "LocknessMonster350",
                                                    "score": 1,
                                                    "created_utc": 1653460089.0,
                                                    "response": "there’s other majors than cs. maybe you’re more interested in finance or economics. plenty of opportunities there, maybe even crypto opportunities",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i9yfcpq",
                                                    "author": "SublimedLather14",
                                                    "score": 1,
                                                    "created_utc": 1653497644.0,
                                                    "response": "Why not you try to do a job parttime while doing the degree?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9ygm1p",
                                                            "author": "SweetCoffee120",
                                                            "score": 1,
                                                            "created_utc": 1653498129.0,
                                                            "response": "It is what I plan to do",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9ywrfz",
                                            "author": "ffeng271",
                                            "score": 1,
                                            "created_utc": 1653504444.0,
                                            "response": "You can always do the gambling by earning some money from part time job.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9xwcp1",
                                    "author": "TBone_Tyndall",
                                    "score": 1,
                                    "created_utc": 1653490134.0,
                                    "response": "True, nothing in the life is the guarantee that it will come out good.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9x1rxy",
                            "author": "acutelydetonate721",
                            "score": 1,
                            "created_utc": 1653473549.0,
                            "response": "We all have different types of interest in our life, and try to follow that.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9w4mts",
                    "author": "sittingstillisfun",
                    "score": 5,
                    "created_utc": 1653449028.0,
                    "response": "I can’t even imagine having the opportunity to go to university for 500 euros. That’s absolutely incredible and you should not let it pass you by.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9xmr33",
                            "author": "djonesind",
                            "score": 2,
                            "created_utc": 1653485998.0,
                            "response": "True, that time will never gonna come back in the future.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9w5524",
                            "author": "SweetCoffee120",
                            "score": 0,
                            "created_utc": 1653449280.0,
                            "response": "Sure we can be thankful for that, though people earn less than in USA and pay it later with taxes and inflation",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9w9gjw",
                                    "author": "sittingstillisfun",
                                    "score": 1,
                                    "created_utc": 1653451607.0,
                                    "response": "I’m not from the USA.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9ylkzs",
                                    "author": "louisguidon",
                                    "score": 1,
                                    "created_utc": 1653500064.0,
                                    "response": "But you will also pay the tax if you earn in the crypto.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9ylw0d",
                                            "author": "SweetCoffee120",
                                            "score": 1,
                                            "created_utc": 1653500183.0,
                                            "response": "You can hold it and move to another country to become tax resident of this other country to sell it without tax. For instance Portugal I believe",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9w49jt",
                    "author": "Thatonebagel",
                    "score": 4,
                    "created_utc": 1653448845.0,
                    "response": "Once you start working you will not want to go back to school. Get it over with or regret not doing it for years to come. Even if it does hit those numbers, even if you invest 50K and it goes 10x, while truly life changing money, it is not enough to retire on. Not really and def not at 22. So then what? You will still have to earn money to support yourself and getting a not shitty job that pays decently is a lot easier with a college degree.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9w5add",
                            "author": "SweetCoffee120",
                            "score": 1,
                            "created_utc": 1653449353.0,
                            "response": "Yes sure but if you have that kind of money you can afford the best universities and work only on what matters to you, create a company...",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9wzdgn",
                                    "author": "BennyBvB",
                                    "score": 1,
                                    "created_utc": 1653471489.0,
                                    "response": "If you have that much of money, why you want to make more?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9y4fbr",
                            "author": "mred_btce",
                            "score": 1,
                            "created_utc": 1653493385.0,
                            "response": "True, once you enter in the world of the money, then there will be no turning back.\n\nSo better to college thing before coming in here, you will get the enough chances with that.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9vzog6",
                    "author": "Physical_Hawk_2918",
                    "score": 9,
                    "created_utc": 1653446569.0,
                    "response": "Bro… go to college computer science majors making 100k/yr fresh out of college",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9w05st",
                            "author": "SweetCoffee120",
                            "score": -4,
                            "created_utc": 1653446803.0,
                            "response": "Sure but in France the top is like 30000 yearly out of college because we have low wages compared to USA",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9w9c2l",
                                    "author": "FrugalityPays",
                                    "score": 3,
                                    "created_utc": 1653451541.0,
                                    "response": "Remote jobs are easier to get now and multiple languages is a huge plus",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9yxyly",
                                            "author": "mapes911",
                                            "score": 1,
                                            "created_utc": 1653504917.0,
                                            "response": "What is the other language you think is the advantage to have?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9yynny",
                                                    "author": "FrugalityPays",
                                                    "score": 1,
                                                    "created_utc": 1653505197.0,
                                                    "response": "Expanded group of people you can potentially work with.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9wuq76",
                                    "author": "cryptovist",
                                    "score": 1,
                                    "created_utc": 1653467265.0,
                                    "response": "Well the wage in France may be low, but 30k sounds a little very low, have you checked wages an Glassdoor? In Germany I would say 45k is the lowest after a decent bachelor and some experience, top is around 60 to 65k.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9x8ee8",
                                            "author": "calculateHash",
                                            "score": 1,
                                            "created_utc": 1653478368.0,
                                            "response": "He said fresh out of college. Not with some experience. Ofc it gets exponentially higher with even little experience in software development in 5 years I doubled my liquid salary pretty much and here tax brackets are harsh.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9x9073",
                                                    "author": "cryptovist",
                                                    "score": 1,
                                                    "created_utc": 1653478747.0,
                                                    "response": "I too was talking about fresh out of college salary, do not see anyone working for under 45 k!",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9x82cq",
                                    "author": "cjbrannigan",
                                    "score": 1,
                                    "created_utc": 1653478149.0,
                                    "response": "30,000€ is like 60,000 USD.  Not a bad start,  plus cost of living is heavily subsidized in France.  That’s where your high taxes go.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9xdr0g",
                                            "author": "SweetCoffee120",
                                            "score": 1,
                                            "created_utc": 1653481507.0,
                                            "response": "It is 32000 USD aprox.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9zeuyx",
                                    "author": "tough2beat",
                                    "score": 1,
                                    "created_utc": 1653511751.0,
                                    "response": "But then you will have the more money to buy the bitcoin.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9wytn4",
                            "author": "Reverend_Cashman",
                            "score": 1,
                            "created_utc": 1653470999.0,
                            "response": "College campus is also very cheap in France. If if you were in the states I’d say buy BTC instead. You can easily make that sort of money on the side, go to college if you want to.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9z0sw7",
                            "author": "Marinesport",
                            "score": 1,
                            "created_utc": 1653506060.0,
                            "response": "But there is no guarantee that we will get that kind of the job.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9w3tor",
                    "author": "mgd09292007",
                    "score": 3,
                    "created_utc": 1653448625.0,
                    "response": "College.  Open doors to your future instead of putting all of your eggs in one basket.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9xsd1x",
                            "author": "brentjenkins1",
                            "score": 1,
                            "created_utc": 1653488475.0,
                            "response": "After getting the degree you will have multiple options for you, no just the investment.\n\nYou can start any start up  and do some fine job is well along with you can invest in the bitcoin is well.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9w505t",
                            "author": "SweetCoffee120",
                            "score": 0,
                            "created_utc": 1653449216.0,
                            "response": "Yeah that's the main issue, it can always go wrong, the probability is never zero",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9xf9ch",
                                    "author": "Madeinwood",
                                    "score": 2,
                                    "created_utc": 1653482331.0,
                                    "response": "But having more than one option under your sleeve is better choice.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9wb2im",
                                    "author": "mgd09292007",
                                    "score": 1,
                                    "created_utc": 1653452529.0,
                                    "response": "I recommend investing in yourself with something you love because if you are doing a job that makes you happy for the rest of your career, that is worth a lot.  Don't just pick a path because someone told you it will make you money.  You can make money in any path in life if you want....but you will most likely spend 1/3 of your young life working 8 hours a day or more. If those 8 hours are miserable then it's whats the point. :)",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9w7ifj",
                    "author": "soomld",
                    "score": 3,
                    "created_utc": 1653450525.0,
                    "response": "Investing in yourself provides better returns long term.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9yqqkh",
                            "author": "gabani194",
                            "score": 1,
                            "created_utc": 1653502079.0,
                            "response": "Investing in yourself will open the limitless doors for you.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9w8o2a",
                    "author": "fuzzyduck88",
                    "score": 3,
                    "created_utc": 1653451178.0,
                    "response": "This man knows “yolo”.\n\nAll jokes aside tho, go to college. We are all bullish on bitcoin but realistically you must consider “what if”…. What if Bitcoin doesn’t go back up? \n\nAgain, we are all bullish and assume it will but don’t bet your future on it.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9wbau9",
                            "author": "SweetCoffee120",
                            "score": 1,
                            "created_utc": 1653452665.0,
                            "response": "But I can always study later on if it don't go back up",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9wbhyj",
                                    "author": "fuzzyduck88",
                                    "score": 1,
                                    "created_utc": 1653452785.0,
                                    "response": "True. This is the definition of “fomo” though.\n\nI like and respect that you’re thinking it through. I suppose it comes down to risk tolerance and if you’re prepared to put your life on hold for a few years if it doesn’t work out. \n\nWe have seen the stories of how people put their life savings in btc and became millionaires, fair play to them, but unfortunately we’ve also seen the stories of how people fucked up their lives making the wrong decisions. \n\nGood luck with whatever you chose - update us, because this is one I’d certainly look back on in 2/3 years!",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9wdbh3",
                                            "author": "SweetCoffee120",
                                            "score": 2,
                                            "created_utc": 1653453902.0,
                                            "response": "Sure ! I think I will try to do university",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9xiqis",
                                                    "author": "janick999",
                                                    "score": 1,
                                                    "created_utc": 1653484092.0,
                                                    "response": "Then i would say you are thinking good, best of luck for your future.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9x66we",
                                            "author": "Visiblyfollow419",
                                            "score": 1,
                                            "created_utc": 1653476905.0,
                                            "response": "I think we all need to take a decision for our self, and need to take what we feels is good for us.\n\nBut this is my personal opinion i will go to college and then try to do some part time job for the bitcoin.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9yeldw",
                                    "author": "CrazyDecatur618",
                                    "score": 1,
                                    "created_utc": 1653497351.0,
                                    "response": "But you never gonna enjoy that teenager college life fun.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9w4p0l",
                    "author": "Legonitsyn",
                    "score": 2,
                    "created_utc": 1653449059.0,
                    "response": "Another option is to do the free but get certs however you can.  However, it is helpful to be in the right place to meet the right people.  That may or may not be a French Uni.  It has been said that anyone with skill can get a good gig right now.  4 years spent in school may prevent you from grabbing present day opportunities, but it may also enable other opportunities now or later.   Where is all the dev work being done is Europe?\n\nBTC should not be calculated in the above equation.  Stack what you can.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9w64pf",
                            "author": "SweetCoffee120",
                            "score": 1,
                            "created_utc": 1653449791.0,
                            "response": "Yes getting certifications would be great, I have already a web dev certification that I got after 8 months of online courses. Most of the dev is done in Paris",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9xtghh",
                                    "author": "fokrivers",
                                    "score": 1,
                                    "created_utc": 1653488937.0,
                                    "response": "I think then you know the real value of the certificate in the corporate world.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9wrrls",
                            "author": "japps73",
                            "score": 1,
                            "created_utc": 1653464607.0,
                            "response": "We can always buy bitcoin in the small part with the small funds.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9w7r4g",
                    "author": "jordorama",
                    "score": 2,
                    "created_utc": 1653450657.0,
                    "response": "I went to university for Software Engineering. Had a great time and made a ton of friends and connections. Came out with a 60k a year salary. \n\nDuring school me and some buddies created a startup. It didn't pan out but the experience got me my future jobs.\n\nSchools more than just a piece of paper. You can do it yourself but it requires a lot of discipline. If I were to change anything, I'd do a 2 year collage program instead of a 4 year major. \n\nI say invest in yourself. There will be more bear markets and opportunities to invest and it's better when you don't have to use food stamps",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9y3ljq",
                            "author": "smeijeri",
                            "score": 1,
                            "created_utc": 1653493059.0,
                            "response": "This is i am trying to say, sometime it's not about the money in the life.\n\nYou need to explore some thing is well, like making new friends and exploring the new adventures with them is well.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9w8u82",
                    "author": "Terhonator",
                    "score": 2,
                    "created_utc": 1653451270.0,
                    "response": "I recommend to study some practional profession. For example electrician or plumber can make really good money.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9w9ltu",
                            "author": "fuzzyduck88",
                            "score": 1,
                            "created_utc": 1653451691.0,
                            "response": "Them trades are very underrated. \nYou would make a killing being an electrician these days. They can literally charge what they like.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9xjqiq",
                                    "author": "wqj911",
                                    "score": 4,
                                    "created_utc": 1653484582.0,
                                    "response": "I know the price i paid for a electrician when they visit my place.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9xthcu",
                            "author": "mrhieu1995",
                            "score": 1,
                            "created_utc": 1653488947.0,
                            "response": "You just need to enjoy the work you are doing, and you will make money.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9w96k7",
                    "author": "Gmoneymoney7",
                    "score": 2,
                    "created_utc": 1653451457.0,
                    "response": "Bro college is only 500euros a year?\n\nGo to college, get cs degree, pick up a job on the side to stack more sats, graduate college make bank stack more sats.\n\nMeanwhile get jacked, date qt3.14 french girls, network and meet cool peeps that u wouldnt have the chance outside of university. College is so damn fun.\n\nU dont need college to make good money, but if ur asking internet strangers for advice you probably arent the self starter type to pull that off in the first place.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9wbfjy",
                            "author": "SweetCoffee120",
                            "score": 2,
                            "created_utc": 1653452745.0,
                            "response": "Yes I think I will try to find a job on the side on try uni",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9x9k8s",
                                    "author": "tttrrr356",
                                    "score": 2,
                                    "created_utc": 1653479087.0,
                                    "response": "That sound more a better choice than leaving the collage.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9wpn1y",
                            "author": "furtherChoke977",
                            "score": 1,
                            "created_utc": 1653462783.0,
                            "response": "It's not about the fee, its a life time experience that you will never gonna get later in your life.\n\nDate girl, make new friend may be some of them from the outside of the country and try to learn there tradition.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9wrdp8",
                    "author": "gohhan",
                    "score": 2,
                    "created_utc": 1653464262.0,
                    "response": "Please study. It will provide a job for you",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9wsbra",
                    "author": "akuznetsov2",
                    "score": 2,
                    "created_utc": 1653465100.0,
                    "response": "I think you should pick the college buddy before anything else.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9w0hu1",
                    "author": "angrysatoshi",
                    "score": 6,
                    "created_utc": 1653446964.0,
                    "response": "I’m a high school drop out, now I have 23 people working for me at 30. I study and learn 5-6 hours a day for free. Internet is the greatest learning tool ever invented. I can learn anything you can. \n\nCollege no longer makes you smarter than someone who study’s same subject online. You will only be smarter than someone who is not educated on such topic. \n\nIn the 50-60-90s we had books, you learned from people who read more books than you. Now everyone has access to the books for free, by a teacher who has read every book ever made.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9w0r87",
                            "author": "Geoknysis",
                            "score": 6,
                            "created_utc": 1653447089.0,
                            "response": "I'm a high school graduate and a university graduate and I have a few thousand working for me. The fuck you saying? Depends what you study.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9w16qu",
                                    "author": "angrysatoshi",
                                    "score": -4,
                                    "created_utc": 1653447303.0,
                                    "response": "You can’t understand what I said, so I’m not sure your credentials check out.\n\n\nOr maybe because you don’t  understand ,is my exact point.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9zeu4w",
                                            "author": "mnjamm",
                                            "score": 1,
                                            "created_utc": 1653511742.0,
                                            "response": "I know what you said i am trying to say about the OP.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9ygv43",
                                    "author": "OT_Trader",
                                    "score": 1,
                                    "created_utc": 1653498227.0,
                                    "response": "True, in the end its study you gonna need to have first place.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9w18i2",
                            "author": "SweetCoffee120",
                            "score": 4,
                            "created_utc": 1653447327.0,
                            "response": "Hehe I am glad for you, if I can learn computer science and mathematics on my own why not do that honestly",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9w1ef0",
                                    "author": "angrysatoshi",
                                    "score": 3,
                                    "created_utc": 1653447404.0,
                                    "response": "Don’t get so caught up in the college dream, if it wasn’t an issue they wouldn’t be talking about giving college graduates billions of dollars because they  can’t pay a loan off.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9w1pw3",
                                            "author": "SweetCoffee120",
                                            "score": 1,
                                            "created_utc": 1653447564.0,
                                            "response": "Yeah that thing is not cool, in France it is offered by the government though so we can be very thankful for that",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9w2087",
                                                    "author": "angrysatoshi",
                                                    "score": 0,
                                                    "created_utc": 1653447704.0,
                                                    "response": "Should be free everywhere , because it’s a waste imo. Richest people in the world dropped out or never went. \n\nIt’s obvious it hasn’t been profitable as of late, if you can’t pay off a loan you’re not making enough money or your not that smart.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9w2djq",
                                                            "author": "SweetCoffee120",
                                                            "score": 0,
                                                            "created_utc": 1653447888.0,
                                                            "response": "Though Elon Musk got an administration degree",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9w2t9f",
                                                                    "author": "angrysatoshi",
                                                                    "score": 0,
                                                                    "created_utc": 1653448109.0,
                                                                    "response": "Elon has  a bunch of degrees acutely, he lived in a time where that was how one got smarter.He would be the first person to tell you having a college degree does not guarantee intelligence, he’s said it more then once.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9ytdy5",
                                                                            "author": "zeffir2",
                                                                            "score": 1,
                                                                            "created_utc": 1653503121.0,
                                                                            "response": "A degree doesn't mean you get the intelligence in the end.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "i9x0s05",
                                                                    "author": "huebuonqua",
                                                                    "score": 1,
                                                                    "created_utc": 1653472711.0,
                                                                    "response": "He is not a human being, he more of a living  alien to me.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "i9y2kx5",
                                                            "author": "smurfhead2005",
                                                            "score": 1,
                                                            "created_utc": 1653492657.0,
                                                            "response": "DO you really think that all the that will ever be go free everywhere?",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i9xso2z",
                                                    "author": "sdfwefqwefqz",
                                                    "score": 1,
                                                    "created_utc": 1653488605.0,
                                                    "response": "Atleast there are some government that is actually doing something good.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9xweui",
                                                            "author": "SweetCoffee120",
                                                            "score": 1,
                                                            "created_utc": 1653490158.0,
                                                            "response": "They all care about power honestly I think, we are 130% of GDP in debt with huge taxes and great unemployment, this is not all great. But individually we can be thankful to have this opportunity that's for sure !",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9ythqd",
                                            "author": "sammyjessie",
                                            "score": 1,
                                            "created_utc": 1653503162.0,
                                            "response": "It's the college life experience that he gonna miss the most.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9z6s60",
                                    "author": "bartstroobants",
                                    "score": 1,
                                    "created_utc": 1653508466.0,
                                    "response": "I think then do your vision clear and try to talk your parents for that.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9w90yu",
                            "author": "delerious",
                            "score": 1,
                            "created_utc": 1653451369.0,
                            "response": "Arguably not everyone in the industry agrees with you. Many places of work require a BA or higher for a management position. Even with years of experience, it comes down to comparison on paper.\n\nSimilarly if you are looking to move abroad, work visa applications in some countries still grade you basis on school results etc.\n\nI am too an exception to the rule, but I do not want to give the image that it’s the same as having a diploma.\n\nEither path come with its own challenges and benefits.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9xhjks",
                                    "author": "Olegius2001",
                                    "score": 1,
                                    "created_utc": 1653483504.0,
                                    "response": "I think it's all depends on the country in which we are living.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9xl757",
                                            "author": "delerious",
                                            "score": 1,
                                            "created_utc": 1653485263.0,
                                            "response": "Of course a lot of variables to consider, but I would easily say that proper education gives you an edge in any country.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9wqoeq",
                            "author": "fluffynice9ke9",
                            "score": 1,
                            "created_utc": 1653463655.0,
                            "response": "See learning and investing in the bitcoin totally both different things mate.\n\nHe is choosing the bitcoin over the collage not some other learning thing and this is the issue.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9vznf7",
                    "author": "Independent-Snow-129",
                    "score": 1,
                    "created_utc": 1653446555.0,
                    "response": "MIT OpenCourseWare, SaylorAcademy, Khan Academy , Gutenberg for the books . ( If you want to get ahead academically )\n\nCollege and university are potentially good if you want to find new relationships.\n\nPersonally , I think its a scam at it's finest and my ego is way to bloated to give them any satisfaction, they literally teach you worst than reading the teaching book by yourself  ! You learn how to listen and apply silly tricks , not how to think !  Get some free education , buy bitcoin and get laid next halving !\n\nEdit: That's what I would **personally** do, don't take this as financial advice for bitcoin , bitcoin could literally go to 0 or ∞!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9w0g8h",
                            "author": "SweetCoffee120",
                            "score": 2,
                            "created_utc": 1653446943.0,
                            "response": "Yes it's what I was thinking to do as an alternative to university, but the lack of people who endorse that on internet made me a little bit afraid to do that, it's like if it wasn't possible but I just think is that most people just go to university because it's the standard way so there are more people to say it's the way to go than going auto-didact",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9wuvme",
                                    "author": "inkehad",
                                    "score": 2,
                                    "created_utc": 1653467406.0,
                                    "response": "Look mate, most of us here doesn't know the shit trust me, if you are confident enough of your plan,\n\nand you have the backing of your family then i would say go for it, and just trust yourself.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9w3121",
                                    "author": "Independent-Snow-129",
                                    "score": 1,
                                    "created_utc": 1653448219.0,
                                    "response": "Jealousy at it's finest !   Instead of following the best teachers lessons and advancing faster for free(maybe for the same classes ) . They had to either work/student-loan/grants/paid by family, you can't blame them , tough one to accept !  If anyone tell you its worth nothing , just outsmart them, they are not worth your time.\n\nStill , like I wrote earlier there's the social adventures which are quite nice and rewarding  !",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9w4g6t",
                                            "author": "SweetCoffee120",
                                            "score": 1,
                                            "created_utc": 1653448936.0,
                                            "response": "Yeah I could not tell for them, but yeah maybe it's a great first path, and it does not prevent from getting a degree later in an other field or the same I think",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9ww73i",
                                                    "author": "sceapt",
                                                    "score": 2,
                                                    "created_utc": 1653468616.0,
                                                    "response": "You can also get the degree with some online classes is well.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i9w5oy6",
                                                    "author": "Independent-Snow-129",
                                                    "score": 1,
                                                    "created_utc": 1653449561.0,
                                                    "response": ">\\- \"***the lack of people who endorse that on internet made me a little bit afraid to do that\"***  \n>  \n>I was replying to this !",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9yv5hw",
                                            "author": "istmike",
                                            "score": 1,
                                            "created_utc": 1653503811.0,
                                            "response": "May be they are trying to convince him for a safer option is well.\n\nwe all know if you have the study atleast you will get some sort of the job in the end, I don't think it's pure jealousy.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9z4lu8",
                                                    "author": "Independent-Snow-129",
                                                    "score": 1,
                                                    "created_utc": 1653507600.0,
                                                    "response": "It is obviously a safer option , safer doesn't mean better !  - I guess... when it will be popular , then its going to be the smart move !",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9xs5j7",
                            "author": "intec82",
                            "score": 2,
                            "created_utc": 1653488390.0,
                            "response": "College is the place where he gonna explore the new things.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9yjyra",
                                    "author": "Independent-Snow-129",
                                    "score": 1,
                                    "created_utc": 1653499432.0,
                                    "response": "Good for relationships .\n\nNew things ? In 2022 , *we* still live \\~**100 years**, we still have trouble exploiting new innovations( In 1831 we had the electric bicycle , 1901 electric car, and now we are changing the world with *new*  electromagnetic innovations !  ( I could go way deeper , but please... )\n\nThe truth is the one who control the finest energy win , barely anyone can think about the real questions !   If in 2032 I didn't find/control it , I'll give you my hat and advocate on how necessary are academic program's ! (*edited format*)",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9vztlo",
                    "author": "AnonymDePlume",
                    "score": 1,
                    "created_utc": 1653446637.0,
                    "response": "Go to college",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9wr54o",
                            "author": "hranur",
                            "score": 1,
                            "created_utc": 1653464054.0,
                            "response": "I am happy that many people are choosing this right way.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9w03kl",
                    "author": "sail3r",
                    "score": 1,
                    "created_utc": 1653446773.0,
                    "response": "Why not do both? Cost of living shouldn’t be that ridiculous If your entire uni is only 500€ \nGet a job to cover bills and only dip into your btc as an absolute last resort.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9w0n5j",
                            "author": "SweetCoffee120",
                            "score": 2,
                            "created_utc": 1653447033.0,
                            "response": "Sure but I am not sure I will be able to do both since I have an attention deficit disorder so I don't know if I will be able to handle both and also I will not be able to buy bitcoin as if I was a full time employee",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9z55lv",
                                    "author": "snaks101",
                                    "score": 4,
                                    "created_utc": 1653507817.0,
                                    "response": "Oh sorry to hear that, then you need to be very careful before chossing.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9w2j79",
                                    "author": "sail3r",
                                    "score": 1,
                                    "created_utc": 1653447965.0,
                                    "response": "Believe me I understand, I have ADHD & PTSD.  Even with student loans and two full time jobs I was left in debt up to my eyeballs and without being able to complete my final 2 semesters. \n\nEven if you’re not able to stack btc nearly as much while studying, you’re still covering both things you’re interested in. Have you run a rough budget/estimate of what your bills would be while in school? The degree/knowledge will pay off short & longterm, btc longterm. I am sorry if my first post came off dickish- trying to convey there’s always another option.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9w3ng2",
                                            "author": "SweetCoffee120",
                                            "score": 1,
                                            "created_utc": 1653448536.0,
                                            "response": "No I had no any problem with your post. Yeah indeed I think it is feasible and other people have been though a lot harder challenges with university than what I could experience.\n\nYes sure it sounds like a great compromise if it's possible. I think it will cost aproximatively 6000$ per year to live but my parents will maybe help for all of it.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i9xczde",
                                            "author": "iacon50",
                                            "score": 1,
                                            "created_utc": 1653481086.0,
                                            "response": "Some time our life of the life we spent earning goes into the EMIs.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9x9wb1",
                            "author": "Asceticbabushka",
                            "score": 1,
                            "created_utc": 1653479288.0,
                            "response": "True, if you are too keen for the bitcoin, you can do the both thing.\n\nYou can go to the college and also do the online or some part job along with that for the investment of the bitcoin.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9w0xne",
                    "author": "rtheiss",
                    "score": 1,
                    "created_utc": 1653447177.0,
                    "response": "There will always be opportunities friend. Enjoy college and social life while you can.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9w1d3c",
                            "author": "SweetCoffee120",
                            "score": 1,
                            "created_utc": 1653447387.0,
                            "response": "Sure but that one I am sure it is super undervalued",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9yd4uo",
                                    "author": "andreystashin",
                                    "score": 1,
                                    "created_utc": 1653496788.0,
                                    "response": "So what do you think are things that is currently valued?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9yeeyt",
                                            "author": "SweetCoffee120",
                                            "score": 1,
                                            "created_utc": 1653497282.0,
                                            "response": "I was talking about the undervaluation of bitcoin",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9y2cwk",
                            "author": "zver139",
                            "score": 1,
                            "created_utc": 1653492568.0,
                            "response": "We can earn money in the later part, but never gonna get the college life later.\n\nTrust me once you enter in the earning field all you gonna do is run after the money.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9w1msy",
                    "author": "Johndrc",
                    "score": 1,
                    "created_utc": 1653447520.0,
                    "response": "Both",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9w1xrc",
                            "author": "SweetCoffee120",
                            "score": 1,
                            "created_utc": 1653447671.0,
                            "response": "Yeah I think I will try to do that",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9ynwoc",
                                    "author": "exklcc",
                                    "score": 2,
                                    "created_utc": 1653500969.0,
                                    "response": "Try some online job if you can get along with the college.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9y4z6u",
                            "author": "cherinichenko77",
                            "score": 1,
                            "created_utc": 1653493601.0,
                            "response": "If anyone can manage that, then the best thing to do.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9w2152",
                    "author": "SweetCoffee120",
                    "score": 1,
                    "created_utc": 1653447716.0,
                    "response": "I think I am gonna try university for 1 year, try to find a part time job and see how it goes. If it don't go well I will dropout and work full-time I think and self-study or do college later in life",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9x4vlp",
                            "author": "Chobostar",
                            "score": 1,
                            "created_utc": 1653475967.0,
                            "response": "Finally i think you decide the right way, try the college and see if it fits you or not.\n\nAnd if you can do the job along with that is well, then i would say this is the best thing you can do.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9w2a2z",
                    "author": "seymourskinnyskinner",
                    "score": 1,
                    "created_utc": 1653447842.0,
                    "response": "You could look for apprenticeship/internship for computer science where they will pay you to study and work. Get the best of both worlds.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9w2uvg",
                            "author": "SweetCoffee120",
                            "score": 1,
                            "created_utc": 1653448131.0,
                            "response": "Yes else I can do that, I have already experience in web development and a small portfolio",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9x1p73",
                                    "author": "cjoffsca",
                                    "score": 1,
                                    "created_utc": 1653473484.0,
                                    "response": "You can also do some free lancing on the internet is well.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9wz9ig",
                            "author": "jasonrobertm",
                            "score": 1,
                            "created_utc": 1653471392.0,
                            "response": "This is also a great option to have, atleast he will get the both.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9w2p1b",
                    "author": "Happy_Arthur_Fleck",
                    "score": 1,
                    "created_utc": 1653448048.0,
                    "response": "Choose college, you will get a better salary sooner and that will allow you to live and invest better.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9w37ne",
                            "author": "SweetCoffee120",
                            "score": 1,
                            "created_utc": 1653448311.0,
                            "response": "Sure even if I miss on bitcoin for 3 years I could invest after on other opportunities so it's a good argument for college",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9xg1k5",
                                    "author": "mcarvalh",
                                    "score": 1,
                                    "created_utc": 1653482741.0,
                                    "response": "You can complete you college and can invest in the next bear market.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9yvs74",
                            "author": "lrpedropires",
                            "score": 1,
                            "created_utc": 1653504058.0,
                            "response": "Plus along with that salary the experience of the college life is something that he gonna remember for his whole life.\n\nSometime we also need to look beyond the money is well in the life.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9w3a6m",
                    "author": "hyperinflationUSA",
                    "score": 1,
                    "created_utc": 1653448345.0,
                    "response": "Both take out student loans they are frozen and likely never resume payments",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9z9grx",
                            "author": "glukmedia",
                            "score": 1,
                            "created_utc": 1653509549.0,
                            "response": "Here i am still paying the loan of my study even after doing the job.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9w4e1y",
                    "author": "heyhihowyahdurn",
                    "score": 1,
                    "created_utc": 1653448906.0,
                    "response": "I’d do both",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9zcc2o",
                            "author": "hamstorg1",
                            "score": 1,
                            "created_utc": 1653510710.0,
                            "response": "There is nothing that will be better than this, if anyone can do that.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9w4n1d",
                    "author": "GreenStretch",
                    "score": 1,
                    "created_utc": 1653449031.0,
                    "response": "College, but invest in BTC as you can afford it.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9yjg4v",
                            "author": "renecop",
                            "score": 2,
                            "created_utc": 1653499238.0,
                            "response": "There is no money that is small for the bitcoin along with there is no amount that is enough for the bitcoin is well.\n\nYou can always try to cut your expanses and can invest that money into the bitcoin.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9w5fmw",
                    "author": "FixedGearJunkie",
                    "score": 1,
                    "created_utc": 1653449425.0,
                    "response": "Go to college and get a good job. You'll be nearly graduated by the time the next bull market arrives.\n\nOr just buy Bitcoin and wash dishes, tame lions, whatever for the next few years. But if I was asking for life advice on reddit, I would just go to college. Best of luck in whatever you choose.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9w5xz8",
                            "author": "SweetCoffee120",
                            "score": 1,
                            "created_utc": 1653449693.0,
                            "response": "Thank you !",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9z5pc0",
                            "author": "pickles0_0",
                            "score": 1,
                            "created_utc": 1653508035.0,
                            "response": "I think going college is always a better decision over choosing the bitcoin.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9w60ns",
                    "author": "n8dahwgg",
                    "score": 1,
                    "created_utc": 1653449732.0,
                    "response": "Do you know how to teach yourself? If yes, bitcoin. If no - invest highly into colleges (yale, harvard, etc) or maybe consider a trade. If i could go back and do it again this is how I would have handled it.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9w6qhp",
                            "author": "SweetCoffee120",
                            "score": 2,
                            "created_utc": 1653450104.0,
                            "response": "I think I can self-study, I am currently studying college algebra to be able to understand the courses in university, this is going very well. Unfortunately I live in France and I cannot go to the best universities which are at Paris and are very selective even if I had the money to live there",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9yepxl",
                                    "author": "zrqmars",
                                    "score": 1,
                                    "created_utc": 1653497399.0,
                                    "response": "I think you have the potential to be a great lad, choose wisely.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9w70g0",
                    "author": "MadMaxwell92",
                    "score": 1,
                    "created_utc": 1653450253.0,
                    "response": "I’m 30 and desperately wish I would have gone to college for something. Business management, philosophy, corporate finance, who cares",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9wftr7",
                            "author": "SweetCoffee120",
                            "score": 1,
                            "created_utc": 1653455509.0,
                            "response": "I have heard that Principles of Corporate Finance by Brealey and Myers is a great book if you are interested",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9wvkj1",
                                    "author": "greyfoxJew",
                                    "score": 1,
                                    "created_utc": 1653468035.0,
                                    "response": "Since coming in the job i barely gets anytime to do these things.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9ww0tc",
                            "author": "mrtrader387",
                            "score": 1,
                            "created_utc": 1653468458.0,
                            "response": "After coming in the job, i always miss my college days.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9w89sz",
                    "author": "kaicoder",
                    "score": 1,
                    "created_utc": 1653450953.0,
                    "response": "Dev here with degree long time ago. My friend's son did a 6 month course in php Web dev onsite and got a good job after that, don't need 3 years, just have some fun in college for a few months. With IT, especially in ordinary coding jobs, what language/framework, tools you know and past experience is way more important than your degree in relation to jobs that you will apply for. Once you start working you can buy in again, once we see 100k+ in 2/3 years, we will see it below 100k again, i can guarantee that with btc!! If you want to become a quant or something, then yeah 3 year degree, definitely, but normal IT job, coding, dev ops, etc, probably not.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9wdh2j",
                            "author": "SweetCoffee120",
                            "score": 1,
                            "created_utc": 1653453999.0,
                            "response": "Thank you for you answer ! Yeah I got a dev web certificate from a bootcamp, I can find a job with it maybe",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9yrk6k",
                                    "author": "serik_mass",
                                    "score": 1,
                                    "created_utc": 1653502407.0,
                                    "response": "What is the best website for learning the bootcamp for a newbie?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9ysk01",
                                            "author": "SweetCoffee120",
                                            "score": 1,
                                            "created_utc": 1653502801.0,
                                            "response": "For France I know OpenClassrooms, but else I don't know for the other countries",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9w8bvh",
                    "author": "LouisKI",
                    "score": 1,
                    "created_utc": 1653450985.0,
                    "response": "A stupid question that will get you stupid answers. This is the wrong sub to ask that question. Get a degree.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9yxn8g",
                            "author": "Kadurri",
                            "score": 1,
                            "created_utc": 1653504792.0,
                            "response": "Taking these kind of advice online is not a wise choice.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9w8p0g",
                    "author": "LouisKI",
                    "score": 1,
                    "created_utc": 1653451192.0,
                    "response": "Bro you're betting your life on \"I think Bitcoin will hit at least 140,000 USD in 3 years.\" 500 euros for a degree is fucking nothing. You can work part time at a local McDonald and make more than that PER MONTH.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9wbcel",
                            "author": "SweetCoffee120",
                            "score": 1,
                            "created_utc": 1653452691.0,
                            "response": "Yeah sure I think I must try that, I just hope I will find jobs in this city",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9yhkkf",
                                    "author": "elftantra69",
                                    "score": 1,
                                    "created_utc": 1653498504.0,
                                    "response": "I know few of my friend is doing the part time job in the McDonald.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9w8w8p",
                    "author": "LevyRoss",
                    "score": 1,
                    "created_utc": 1653451299.0,
                    "response": "Invest in yourself",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9yash3",
                            "author": "jiexa1706",
                            "score": 3,
                            "created_utc": 1653495875.0,
                            "response": "Invest in yourself will give you the better return in the life.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9w8xgg",
                    "author": "Zealousideal_Leg_630",
                    "score": 1,
                    "created_utc": 1653451316.0,
                    "response": "Dude. Get out. And get on with your life. Please.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9w9097",
                    "author": "MiamiHeatAllDay",
                    "score": 1,
                    "created_utc": 1653451358.0,
                    "response": "The best investment is yourself, go to college or pursue another form of education.\n\nBitcoin is what you buy with your excess cash flow, not what you trade for an education",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9xdjzn",
                            "author": "btceed",
                            "score": 2,
                            "created_utc": 1653481400.0,
                            "response": "This is the safe and the best investment that anyone can have.\n\nyes we can argue that price of the bitcoin will go that high but there is absolutely no certainty of that thing.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9yb4og",
                                    "author": "MiamiHeatAllDay",
                                    "score": 1,
                                    "created_utc": 1653496007.0,
                                    "response": "Agreed",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9w9d7r",
                    "author": "Noyaboi954",
                    "score": 1,
                    "created_utc": 1653451558.0,
                    "response": "Education first buddy",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9wa4oq",
                    "author": "Filmerd",
                    "score": 1,
                    "created_utc": 1653451987.0,
                    "response": "Get a degree first 100%. Try to get a job where you can just pay for expenses with Fiat and not have to sell your Bitcoin. \n\nCampus jobs can be really clutch for this kind of thing.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9xqdtx",
                            "author": "antonlva",
                            "score": 2,
                            "created_utc": 1653487626.0,
                            "response": "Yes we can also do a job while doing the study is well.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9wa6sn",
                    "author": "333chordme",
                    "score": 1,
                    "created_utc": 1653452021.0,
                    "response": "If you’re dumb enough to ask this question, you’d best go back to school. And that’s coming from someone who loves Bitcoin.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9wtjfw",
                            "author": "maxjetic",
                            "score": 2,
                            "created_utc": 1653466194.0,
                            "response": "I don't think it's a dumb question, he is just confused right now.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9wbjjp",
                            "author": "SweetCoffee120",
                            "score": 0,
                            "created_utc": 1653452811.0,
                            "response": "I don't think it's dumb if it can make a lot of money and allow me to go to university in better conditions later on. I am still young",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9wc0jj",
                                    "author": "333chordme",
                                    "score": 1,
                                    "created_utc": 1653453103.0,
                                    "response": "Honey go to school",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9x020w",
                                            "author": "NeoDemocrito",
                                            "score": 1,
                                            "created_utc": 1653472088.0,
                                            "response": "feels like he is already made up his mind, just want best for him.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9wuy49",
                                    "author": "giorgioprimo",
                                    "score": 1,
                                    "created_utc": 1653467468.0,
                                    "response": "But buddy their is no guarantee that you will make money at out point?\n\nPeople always said always invest the money which you can afford to lose or can hold for the long time.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9waebk",
                    "author": "EgonHorsePuncher",
                    "score": 1,
                    "created_utc": 1653452143.0,
                    "response": "Get the degree. Yes you can learn it all on your own at home at your convivence but it's difficult to convince yourself to do that instead of youtube, reddit, twitter, games, etc etc etc.   \n\n\nPaying for schooling associates the work aspect to your computer instead of a device for entertainment.   \n\n\nAnd yes you might fall behind in bitcoin while it's so cheap, but if you live like you're only making 40-50k a year then you're going to have upwards of 20k to play with if not more annually to invest. Just don't let lifestyle inflation steal your money away.  \n\n\nAlternatively you can learn to program while trading and then build a bot to trade for you :).   \n\n\nWorst case scenario if Bitcoin goes tits up or heavy regulations makes it difficult to utilize your CS degree will make FIAT money sustainable a lot more than other professions.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9wwf0g",
                            "author": "mrfongpham",
                            "score": 1,
                            "created_utc": 1653468821.0,
                            "response": "You can get the knowledge from the different internet platform but you never gonna get the environment of the college life.\n\nThis is like once in a life time opportunity and you should grab that.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9yo3wa",
                                    "author": "EgonHorsePuncher",
                                    "score": 1,
                                    "created_utc": 1653501048.0,
                                    "response": "Yeah, unfortunately in my case I'm 30+ paying for quite a few bills and needing money to make ends meet. Luckily though laid off for a year or so, so have the free time to start self teaching \\*shrug\\*.  \n\n\nIf I could change things in life I'd be a full time student, but need financial stability and the lack of needing to ever work.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9wagsa",
                    "author": "1800smellya",
                    "score": 1,
                    "created_utc": 1653452183.0,
                    "response": "You will need to find a skill, hobby or activity you can perform to add value. \n\nWether you obtain that through “traditional schooling” like overpriced universities or via self-taught, or even mentorship opportunities. \n\nThe skill will allow you to trade your product or time for a currency. \n\nThen you should most definitely choose BTC as your money of choice, as you are asking the Bitcoin sub. \n\nWelcome brother",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9wdo2y",
                            "author": "SweetCoffee120",
                            "score": 1,
                            "created_utc": 1653454120.0,
                            "response": "Thank you, yeah education no matter what !",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9x9tav",
                                    "author": "jpost23",
                                    "score": 1,
                                    "created_utc": 1653479238.0,
                                    "response": "Now i am feeling that you are getting the right decision.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9ysp6o",
                            "author": "jajunk77",
                            "score": 1,
                            "created_utc": 1653502855.0,
                            "response": "You can always make the money while doing the college is well.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9warkm",
                    "author": "Based",
                    "score": 1,
                    "created_utc": 1653452356.0,
                    "response": "go to college and get into crypto, make it work buster.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9y038v",
                            "author": "kathmandu7777",
                            "score": 1,
                            "created_utc": 1653491657.0,
                            "response": "True, crypto is going no way and we are still very early into this thing.\n\nWhen i made my entry i though i was late, but then realise i was still very early compare to others.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9wbflm",
                    "author": "Vegas_42",
                    "score": 1,
                    "created_utc": 1653452745.0,
                    "response": "investing in your education should be your first priority. not everything in life is measured in €.\nI'm 45 yo, have a wife, 2 kids, a masters degree and make 6 figures working as a manager. I understand that you feel you can make this decision because you're 19. but you're not mature enough to take such an extensive decision (your answers sound like from a teenager, which you still are). please, don't.\n\nbut assume for a moment it's all about money.\nask yourself, how much BTC you have. If you have like 5 BTC you can study and keep enough for the future. No question.\nIf you have 1 BTC, this might be enough to live off in the future. maybe. If you have less than 1 BTC, there is no discussion either.\nIf it is about working and buying BTC on from now, please consider, that without education you earn most likely minimum wage. you can study and work a student job and have not far less. I did that as well.\nand take into account, that it is likely that you increase your earnings with a better education far more than without. today, 28k€ looks like a huge amount, but it will be a similar effort for you to buy 1 BTC with savings from minimum wage (because you need up to 100% for a living) at this price as it will be at 80k€ salery and BTC at 100k€. with a masters or bachelors degree, you can earn 2x or 3x or even more than without. over the next 45 years, this could be a difference of >2.000.000€!\nit will have an impact on your social live as well.\nbut this goes too far.\nplease do your future self a favor and go to university!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9wdw6w",
                            "author": "SweetCoffee120",
                            "score": 1,
                            "created_utc": 1653454260.0,
                            "response": "Thank you for the time you put into replying me. I have indeed a lot to learn. Yes I think indeed university is a great choice as you said I will earn some money doing jobs on the side",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9ynulo",
                            "author": "smaraux",
                            "score": 1,
                            "created_utc": 1653500948.0,
                            "response": "Once a wise men said, education and wisdom are the things that can never go wasted and no one can take that away from you is well.\n\nSo giving the priority to the education must be our first choice.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9wbj6n",
                    "author": "alien3d",
                    "score": 1,
                    "created_utc": 1653452805.0,
                    "response": "collage ! pronto . we dont have degree and still survive doesnt mean we dont want but we cannot afford 😣. We force our brother to learn and his much good then us .",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9xhs8q",
                            "author": "ArtiusVens",
                            "score": 2,
                            "created_utc": 1653483625.0,
                            "response": "I am sorry to heard that guy, may be all is going good for you.\n\nThere are many guys who want to study but the fee of the school and college is that high that they can't afford them.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9wdz94",
                            "author": "SweetCoffee120",
                            "score": 1,
                            "created_utc": 1653454314.0,
                            "response": "I hope you will be able to afford it later on",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9x7xg0",
                                    "author": "CQEFlash",
                                    "score": 3,
                                    "created_utc": 1653478058.0,
                                    "response": "We can just hope for that, lucky are those who is getting that.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9wf995",
                                    "author": "alien3d",
                                    "score": 1,
                                    "created_utc": 1653455134.0,
                                    "response": "we do teach tutorial programming in youtube(profile reddit) for those whom want to learn . Learning is continues but time is not . Even you left 1 btc and dont touch for 4 year learning and retouch when work its much better . Ask anybody here would said same thing , learn first . When you start work and family , you dont have much time , ask people family whom had ps5 ? did they ever play it ? Enjoy your life and learn and get good girlfriend .",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9x56g7",
                                            "author": "sergeyasv777",
                                            "score": 1,
                                            "created_utc": 1653476190.0,
                                            "response": "You are really doing some great work mate, keep it up. Tell me the name of your Youtube channel name.\n\nI will happily subscribe that. True once you enter in the world of the earning you will not gonna have much time.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9x6h0w",
                                                    "author": "alien3d",
                                                    "score": 1,
                                                    "created_utc": 1653477097.0,
                                                    "response": "Rebels Developer . We do for our backup knowledge and provided other . No for profit  idea . ☺️",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9wbjda",
                    "author": "Jade-moon-and-stars",
                    "score": 1,
                    "created_utc": 1653452808.0,
                    "response": "Why choose? You can do college and have a job on the side to keep DCA in BTC. Maybe your parents are willing to help you out too. Don’t give up both dreams. See college as your plan A and BTC as your plan B. Focus mainly on plan A and put your free time in plan B. A degree gives you the most certainty for the future, everything else is just sprinkles on the sundae. Work hard, focus and thank me later when you have that degree and your BTC is thriving in your wallet.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9we0xy",
                            "author": "SweetCoffee120",
                            "score": 2,
                            "created_utc": 1653454345.0,
                            "response": "Yes I think this is what I will do",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9wq071",
                                    "author": "Jade-moon-and-stars",
                                    "score": 1,
                                    "created_utc": 1653463093.0,
                                    "response": "This literally has been my own plan and it worked out for me, so I’m sure you can do it too! And bless your parents, mine didn’t help me at all!!! Stay focused, dedicated and keep your eyes on your goals.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9z8xyu",
                                    "author": "btcneeded90",
                                    "score": 1,
                                    "created_utc": 1653509335.0,
                                    "response": "I hope know all your doubts are clear and now will choose the right path.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9yl47w",
                            "author": "rdmcnabb",
                            "score": 1,
                            "created_utc": 1653499880.0,
                            "response": "Yes, there is many people who is doing multiple things at the same, so need to go just after one thing.\n\nI am doing job along with investing in the bitcoin, because without job i can't afford to invest in the bitcoin.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9wbn7k",
                    "author": "wheresrobthomas",
                    "score": 1,
                    "created_utc": 1653452875.0,
                    "response": "College, I’m not even going to read your post. Invest in yourself first, college. A majority of people here thought Bitcoin was going to crack 100K last year and look where we are. College.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9wbrns",
                    "author": "kiwimonk",
                    "score": 1,
                    "created_utc": 1653452951.0,
                    "response": "College. 🤓",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9wc0qw",
                    "author": "sangderenard",
                    "score": 1,
                    "created_utc": 1653453107.0,
                    "response": "Riperoni in pepperoni this guy's comment karma",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9wcndu",
                    "author": "Kitchen-Pen7559",
                    "score": 1,
                    "created_utc": 1653453494.0,
                    "response": "Let the college educate you. It's really necessary as most of your comments (and tbh the attitude you're showing) sound quite stupid. You sound like a kid. Education first.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9we4vs",
                            "author": "SweetCoffee120",
                            "score": 1,
                            "created_utc": 1653454415.0,
                            "response": "I think I am being correct here, I insulted nobody or disrespected nobody",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9z71w0",
                                    "author": "OutCode653",
                                    "score": 3,
                                    "created_utc": 1653508575.0,
                                    "response": "One thing i see here that atleast you being honest and not insulted anyone here.\n\nYou are a good lad but i think you need to ask question yourself before putting here, are you having some second thoughts?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9xfdkw",
                            "author": "gildanecroquini",
                            "score": 1,
                            "created_utc": 1653482394.0,
                            "response": "I think that kid just made up his mind that want to go in the bitcoin, but i don't think he made any harsh comment or show some disrespect to anyone.\n\nBut still i would say he need to go college first before anything.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9wdzu5",
                    "author": "SoupyAT",
                    "score": 1,
                    "created_utc": 1653454325.0,
                    "response": "Bitcoin. You will be so rich you don’t need to work.\n\nI totally understand, I often prefer to buy more bitcoin than spend money on my ungrateful kids who are always expecting new clothing, school trips etc",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9weefo",
                            "author": "SweetCoffee120",
                            "score": 1,
                            "created_utc": 1653454588.0,
                            "response": "🤣",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9wep3l",
                    "author": "Tiggsweld",
                    "score": 1,
                    "created_utc": 1653454780.0,
                    "response": "This is really simple actually.  \n\nQuestion #1 \nDo you have enough Bitcoin that is it were to hit $140,000 tomorrow , you could have your \"financial freedom\" ?  \n\nI take it your pretty young.  So I'd imagine you would probably want to enough to be able to live off of. So say $80-120k for the next 60+ years ? \n\nWhat would change in your life if it was to be $140k per coin ?   You must have a shit ton to give up your future of earning a good salary.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9wgjmf",
                            "author": "SweetCoffee120",
                            "score": 1,
                            "created_utc": 1653455989.0,
                            "response": "It was not a either bitcoin & no higher education or higher education and give up on bitcoin. If I choose to work I could have went to uni later on. But yeah your comment makes sense",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9x57el",
                                    "author": "technovoucher",
                                    "score": 1,
                                    "created_utc": 1653476210.0,
                                    "response": "But you can always invest in the bitcoin while doing the study.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9xj2jb",
                            "author": "llgiant",
                            "score": 1,
                            "created_utc": 1653484256.0,
                            "response": "I don't think so, that 140k will give him the financial freedom from this point.\n\nHe is very young and feels like very energetic is well, and just want to make some money.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9wf3nn",
                    "author": "shimshimmash",
                    "score": 1,
                    "created_utc": 1653455035.0,
                    "response": "The two are not mutually exclusive. I am worked while I was at uni, and was about to pay for my own food, rent and all of the alcohol that an average UK student consumes. This was before BTC, but I could have pretty easily put 50 pounds a week towards BTC if it had been around. You would be able to do the same, get a job in a cafe or bar and you will make enough to DCA whole also enjoying your time at uni.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9wgcor",
                            "author": "SweetCoffee120",
                            "score": 1,
                            "created_utc": 1653455862.0,
                            "response": "Yeah I plan to do the same, thank you man ! I think it is the best choice",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9wh8tn",
                                    "author": "shimshimmash",
                                    "score": 1,
                                    "created_utc": 1653456456.0,
                                    "response": "Have fun, the main benefit of uni is the time to have fun with friends and get creative with your living. Make sure to take advantage of it!",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9xccpt",
                                    "author": "DianneStitham",
                                    "score": 1,
                                    "created_utc": 1653480727.0,
                                    "response": "All i hope that in the end you just made the right decision for yourself.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9z1h8t",
                            "author": "scwosh21",
                            "score": 1,
                            "created_utc": 1653506330.0,
                            "response": "You can always do some work while doing the college,as man of student now days are doing.\n\nNowdays you can easily found some really decent online job that paid you well is well.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9wf4go",
                    "author": "eatmyf1re",
                    "score": 1,
                    "created_utc": 1653455049.0,
                    "response": "Are you sure you can get into college? Because that's a pretty dumb question.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9wggm6",
                            "author": "SweetCoffee120",
                            "score": 1,
                            "created_utc": 1653455933.0,
                            "response": "Yes I would really enjoy going to uni !",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9y6xtd",
                            "author": "DinkyFly33",
                            "score": 1,
                            "created_utc": 1653494375.0,
                            "response": "Here in my country some of the college is cost more than i can afford.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9whfje",
                    "author": "veggiecrunchwrap",
                    "score": 1,
                    "created_utc": 1653456585.0,
                    "response": "College is overrated. Get experience working instead",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9whyr7",
                    "author": "Dankmanchilliwilli",
                    "score": 1,
                    "created_utc": 1653456949.0,
                    "response": "College, you can buy bitcoin later when you make the big bucks. Make sure to study engineering or finance, don’t do underwater sewing or gender studies.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9x2ny6",
                            "author": "cryptkings",
                            "score": 1,
                            "created_utc": 1653474260.0,
                            "response": "There is the whole life ahead of him to buy the bitcoin but college life will not gonna coma later.\n\nInfact he can do the bitcoin investing while going to the college by doing some part time job.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9wih2n",
                    "author": "Er1Ck010",
                    "score": 1,
                    "created_utc": 1653457290.0,
                    "response": "Reading your comments makes me believe you made your choice already. I would 1000% go for studies. Your time for investing in bitcoin will come. The sooner you get your degree, the sooner you can start the carreer, the sooner you earn a senior salary, add that up to your calculation",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9xgii6",
                            "author": "Sascha206",
                            "score": 2,
                            "created_utc": 1653482981.0,
                            "response": "The way he is giving the answer certainly made me think so is well.\n\nThere is no doubt that study is always a better option over the crypto market. For bitcoin you will get enough chance.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9wivym",
                    "author": "KramRepparc",
                    "score": 1,
                    "created_utc": 1653457575.0,
                    "response": "If you have to ask maybe you need to learn a bit more about how the world works but I would say school is an expensive way to do so.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9yyw24",
                            "author": "zerhborg",
                            "score": 1,
                            "created_utc": 1653505286.0,
                            "response": "One thing i learn that this world is a very cruel place to have.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9wjbwx",
                    "author": "ChasmoGER",
                    "score": 2,
                    "created_utc": 1653457889.0,
                    "response": "You've asked this question on this sub, where mostly Bitcoin maxis exist. Although nearly everyone suggested education, you're still arguing why you'd prefer Bitcoin.\n\nYou already made your choice! If not even this sub can convince you, nothing can.\n\nEnjoy your BTC, hopefully it'll play out in your favor.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9wlxk8",
                    "author": "-_-Zuko",
                    "score": 1,
                    "created_utc": 1653459833.0,
                    "response": "Work another job and invest in both. Youre young. Fck parties n shit. Work your ass off now so you dont struggle in your 30s and 40s.\n\n Make moves bro.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9xfi5f",
                            "author": "SweetCoffee120",
                            "score": 2,
                            "created_utc": 1653482459.0,
                            "response": "Sure I am not interested in partying",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9z545c",
                                    "author": "-_-Zuko",
                                    "score": 1,
                                    "created_utc": 1653507801.0,
                                    "response": "Already a step ahead. Get at it",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9wz1kz",
                            "author": "Amoci",
                            "score": 1,
                            "created_utc": 1653471199.0,
                            "response": "Now that I’m almost 40, I’m so glad I partied in my 20’s and 30’s. People always tell me I should write a book because I have so many colorful stories from all the lives I lived.\n\nI say do not work your ass off now. Instead go to “fck parties n shit.”\n\nAnd stack sats.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9z58l2",
                                    "author": "-_-Zuko",
                                    "score": 0,
                                    "created_utc": 1653507849.0,
                                    "response": "You ever write that book?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9zc8u3",
                                            "author": "Amoci",
                                            "score": 1,
                                            "created_utc": 1653510673.0,
                                            "response": "I said people tell me I should. Quit being an ass.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9zf9b0",
                                                    "author": "-_-Zuko",
                                                    "score": 1,
                                                    "created_utc": 1653511916.0,
                                                    "response": "Nah i dont think i will. Ur giving this kid advice with his life and seems to me you dont understand what youre doing. \n\nThis could make or break this kid if he decides to listen to you. Your justification for party rocking, are the stories you walk away with that directly correlates to the success of your book so, did you or did you not write that book?",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9wnc54",
                    "author": "PumperNikel0",
                    "score": 1,
                    "created_utc": 1653460923.0,
                    "response": "500 Euros compared to the tens of thousands of dollars in the US for education. Get your education dude.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9woetb",
                    "author": "MGTOW_and_Bitcoin",
                    "score": 1,
                    "created_utc": 1653461781.0,
                    "response": "Bitcoin if you don't want to work for anyone\n\nCollege if you want to work for someone",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9wofo9",
                            "author": "MGTOW_and_Bitcoin",
                            "score": 1,
                            "created_utc": 1653461800.0,
                            "response": "And I hope you remember guys that being an employer still me and you work for the customer",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9wpwke",
                    "author": "BarbedWire3",
                    "score": 1,
                    "created_utc": 1653463007.0,
                    "response": "Get a part-time job to help with your spendings, and just go to university. 500€ that's not money. You could make way more with an university degree, than hoarding all these bread crumbs rn",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9wq9xh",
                    "author": "theelephantinthebox",
                    "score": 1,
                    "created_utc": 1653463311.0,
                    "response": "You actually don’t need to choice especially if you are looking for a tech-related degree. Don’t choose since you don’t know were life is going to bring you. Set a goal instead (I want to be financially independent by the age of 30, I want to be a startupper, I want to be a Microsoft executive in the Silicon Valley etc). You can get a degree and have a side hustle and buy bitcoin and have fun.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9wsqjy",
                    "author": "RielBitcoin",
                    "score": 1,
                    "created_utc": 1653465477.0,
                    "response": "Bitcoin and learn online.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9wvc3s",
                    "author": "MichaelAischmann",
                    "score": 1,
                    "created_utc": 1653467819.0,
                    "response": "education is priceless. no question. edu > btc",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9wysi8",
                    "author": "Amoci",
                    "score": 1,
                    "created_utc": 1653470972.0,
                    "response": "Major in Bitcoin",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9wziqn",
                    "author": "fawnside",
                    "score": 1,
                    "created_utc": 1653471620.0,
                    "response": "You won’t know the answer to this until you have a university level education",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9x14wy",
                    "author": "tw4651612",
                    "score": 1,
                    "created_utc": 1653473010.0,
                    "response": "I never invest my last money in crypto currency. It doesn't seem to make sense to me.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9x7web",
                    "author": "cjbrannigan",
                    "score": 1,
                    "created_utc": 1653478038.0,
                    "response": "Dude, for 500€ get your danm degree.  It’s a far better investment in your future.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9x84ly",
                    "author": "calculateHash",
                    "score": 1,
                    "created_utc": 1653478191.0,
                    "response": "Education is more important. This is only an argument for consideration if you are from a country like the US where you go into major debt for studying. As a fellow European from France just go to college since it's either free or cheap, I mean it's 500 euros as you just stated in that example that's not money. It's a no brainer, invest with the extra money.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9xm7ki",
                    "author": "swimingiscoldandwet",
                    "score": 1,
                    "created_utc": 1653485744.0,
                    "response": "Is this even a question??  Always invest in yourself first - and I mean you brain, skills, health etc.  BTC or fiat …. It’s only money.  One can always earn more.  But learning, skills and follow on experience are invaluable.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9xnk5v",
                    "author": "RottenBlueCheese",
                    "score": 1,
                    "created_utc": 1653486364.0,
                    "response": "Take out a school loan and buy bitcoin with it",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9xvuo3",
                            "author": "SweetCoffee120",
                            "score": 1,
                            "created_utc": 1653489931.0,
                            "response": "Ah ah Saylor mode, leveraging is too risk especially if I fraud the banks lol",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9xw7d6",
                    "author": "Edvardoh",
                    "score": 1,
                    "created_utc": 1653490073.0,
                    "response": "500 Euro total, am I reading that right?? Is that per credit or per semester or what? If it’s per semester that is a huge bargain and well worth it. Bitcoin will still be here, maybe get a side job and DCA while you’re going to school, but Bitcoin isn’t a free ticket to riches. You need a solid foundation of marketable skills and the power to earn and stack sats. Go get your computer science education for 500 euro lol that is a huge bargain compared to the six figure USD debt most are getting into in the US 🧡",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9y7wol",
                    "author": "RealPrimaris",
                    "score": 1,
                    "created_utc": 1653494749.0,
                    "response": "University is a waste of time UNLESS you have a specific profession in mind that requires a degree (Lawyer, Doctor, Engineer etc). Don’t waste your time on social sciences, and especially not on nonsense like gender studies or art or something. In the computer world, you don’t need a degree. You can take online courses and get certified in certain programming languages for far less than a uni degree. If you’re interested in pen testing, coding, or computer science generally, you don’t need to go to university and spend $100,000+ for four years of studies. You can spend $1k-$5k online at your own pace to really master coding or pen testing and you’ll be able to earn as much as most people with degrees, if not more. \n\nUniversity used to be the barrier to entry into a ‘successful’ middle class life for most people. Society is changing though, and university is heavily overpriced and is more focused on political activism than learning. Many employers, myself included, prefer to hire based on skills, not education. Ultimately, it’s up to you though, so dyor and think it through.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9yg8rs",
                            "author": "SweetCoffee120",
                            "score": 1,
                            "created_utc": 1653497987.0,
                            "response": "Hey, I have in fact a bootcamp diploma for dev web, but I don't know if I can find a job with it maybe it can allow to get a first job at a helpdesk. However if I do university it's almost free in France, we have just to pay for food, rent etc",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9yif3l",
                                    "author": "RealPrimaris",
                                    "score": 1,
                                    "created_utc": 1653498837.0,
                                    "response": "If it’s almost free, then the cost benefit analysis changes quite a bit. Just make sure that you’re aware that your experience there will not guarantee any level of success. Use it as a chance to make friends and enjoy new social experiences by all means, but be aware that the window of youth closes far more quickly than you might think, and you should also do your best to learn as much as possible (in addition to your formal education I mean). My advice is to not waste your time trying to be popular or fit in. Instead, find a group of interesting and talented people, and befriend / learn from them. Anyways, good luck kid, I wish you nothing but success!",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9ymoig",
                                            "author": "SweetCoffee120",
                                            "score": 2,
                                            "created_utc": 1653500492.0,
                                            "response": "Sure I plan to self-study also. Thank you sir !",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}