{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uy82h1",
            "title": "it’s the silence before the storm with a big storm",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/uy82h1/its_the_silence_before_the_storm_with_a_big_storm/",
            "author": "Alarming-Ad-8311",
            "created_utc": 1653572999.0,
            "score": 1,
            "num_comments": 4,
            "subreddit": "BitcoinBeginners",
            "selftext": "📊 Bitcoin is still in the same tight range of $28,800 – $30,800. Bitcoin doesn’t have much movement and it’s the silence before the storm with a big storm coming from both sides. Bitcoin cannot break even the $30,800 local resistance level. The market is very volatile right now and the trend in the market is still bearish. The index of greed and fear is: 12 - and this is an indicator of extreme fear. Despite the growth of BTC dominance, which now stands at: 45.4%, but at the same time, the trading volume decreased to $30.37 million. This indicates that the dominance growth occurred due to internal market resources, and not due to external resources . The most likely scenario is that Bitcoin will fall to the level of $22,000 - $20,000. If this happens, we will witness the onset of a “crypto winter”. You can find out about the onset of the “crypto winter”, and about the trends and aspects of its course in my article, which will be published in the coming days.  \n🏛 US markets are on a positive wave with the prospect of further growth, except for Bitcoin futures: S&P 500 +0.95% | NASDAQ +1.51% |Dow Jones +0.60%|CME (Bitcoin futures) -1.41%.",
            "stickied": false,
            "comments": [
                {
                    "id": "ia2cr2b",
                    "author": "509BandwidthLimit",
                    "score": 3,
                    "created_utc": 1653573098.0,
                    "response": "Wake me when it hits bottom so I can load up and hodl.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia2cit1",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653573000.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia2d3vg",
                    "author": "Shield4SI",
                    "score": 1,
                    "created_utc": 1653573254.0,
                    "response": "Bullish",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}