{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ml3i46",
            "title": "How do you cash out $750,000 worth of bitcoin?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/ml3i46/how_do_you_cash_out_750000_worth_of_bitcoin/",
            "author": "ohimanalabamagamer",
            "created_utc": 1617683270.0,
            "score": 760,
            "num_comments": 573,
            "subreddit": "BitcoinBeginners",
            "selftext": "Ancient bitcoiner here, I have made a large amount of money on crypto since 2013. I’m looking to liquidate a large portion of it to invest into stable stocks/index funds etc. How do I go about getting the money from blockchain wallets to my bank account, is it taxed immediately or do i file it later on? I have withdrawn around $50,000 worth at once from coinbase but i included the figure in title because I imagined taking out that much would have different rules. I do not have a high income, is my bank/IRS going to have a panic attack when i withdraw nearly a million dollars to my account out of nowhere?",
            "stickied": false,
            "comments": [
                {
                    "id": "gtjfbs0",
                    "author": "nerdburg",
                    "score": 500,
                    "created_utc": 1617686371.0,
                    "response": " I hired a CPA. I literally did a Google search for \"cryptocurrency cpa near me\" and found a firm not to far from me that had experience with BTC. I paid them about $2k. They facilitated the transfer, established a money market account for the funds, and gave me tax advice.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "gtjjozw",
                            "author": "ohimanalabamagamer",
                            "score": 310,
                            "created_utc": 1617690039.0,
                            "response": "Okay that’s obviously what i should do, i honestly expected it to cost more than $2000 though. Thank you!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "gtlnr3g",
                                    "author": "TheEndTrend",
                                    "score": 16,
                                    "created_utc": 1617735454.0,
                                    "response": "I’m sure you know, but DO NOT accept any message requests from anyone about this, OP. Lots of scammers on Reddit, just like everywhere online.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "gxdg2bf",
                                            "author": "Jamesbronzy",
                                            "score": 6,
                                            "created_utc": 1620468306.0,
                                            "response": "Your right!!\n\nI just got my first message on reddit and I don't know what it is all about.\n\nThey said hi, then asked me where I lived and told me they have a business proposal for me.\n\nI replied with, \"as a very very very very good chess player I am always open to ideas\" and asked them where are they from while at the same time looking and noticing they don't have any karma. lol\n\nI will next ask them for their Facebook user name, their instagram and any online history so I can get a basic profile of who they are.  \n\n\nbut since telling them I am a very very good chess player I have not heard nothing else.  lol\n\nLittle do they know I am the worst person on earth to try and scam...... I live to find these people, but then again I want to hear them out.  \n\n\nFor if it's that good, I might have to tell them we just might need a lawyer to handle all the contract work. hehe",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "gtjkwcx",
                                    "author": "nicolesimon",
                                    "score": 75,
                                    "created_utc": 1617691119.0,
                                    "response": " a good accountant should be able to give you steps and also options aka, lets do that first and what would it cost if I also do the other thing.\n\nIf they have experience they probably can help you avoid problems. And giving that we are now in zoomland, you can choose a good cpa likely across the country. Maybe in your case your state as there might be additional laws, not sure about hta.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "gtjm32i",
                                            "author": "ohimanalabamagamer",
                                            "score": 45,
                                            "created_utc": 1617692222.0,
                                            "response": "Yeah i’m also kind of worried about finding a good accountant lmfao. I’ve never really needed a good one because I never had any significant amount of money and everything was simple and straight forward. Awesome though thank you!",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "gtk2rl6",
                                                    "author": "nolimitzman0",
                                                    "score": 23,
                                                    "created_utc": 1617708047.0,
                                                    "response": "I have a good crypto saavy accountant that I use for my business. Happy to connect the two of you. Shoot me a DM and I’ll get you his info. He’s based in St Louis. \n\nMake sure you do your research on anyone you find so they don’t swoop your coins!",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "gtkp7pc",
                                                            "author": "TheRitalinCommando",
                                                            "score": 9,
                                                            "created_utc": 1617720316.0,
                                                            "response": "State shouldn't make a difference either unless he also wants tax advice, but a local cpa should be able to offer advice to that end once it's converted to fiat and put in another instrument.\n\nEDIT: also, a cpa can minimize the risk of getting screwed because they actually have a licensing board and ostensibly police themselves. Regardless, op just needs to know that a cpa is not the same as any accountant.",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "gtmoxxf",
                                                            "author": "fuasyfaposht",
                                                            "score": 1,
                                                            "created_utc": 1617752723.0,
                                                            "response": "was he young or old?",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "gtmpkog",
                                                                    "author": "nolimitzman0",
                                                                    "score": 1,
                                                                    "created_utc": 1617753054.0,
                                                                    "response": "My accountant is pretty young. He’s been crypto focused at his firm for years, and he knows his stuff.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "gvq7sr3",
                                                            "author": "ValKyKaivbul",
                                                            "score": 1,
                                                            "created_utc": 1619284231.0,
                                                            "response": "While looking at comments like this,  I think that we could assume there should be scammers presenting themselves as accountants and use this role to get closer to you  to your wallets and your property.",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "gwv1xru",
                                                            "author": "Bug_Deep",
                                                            "score": 1,
                                                            "created_utc": 1620096155.0,
                                                            "response": "STL is my town.  I'd appreciate your contact here on that.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "gtjobqe",
                                                    "author": "nicolesimon",
                                                    "score": 10,
                                                    "created_utc": 1617694366.0,
                                                    "response": "Then I would suggest the part about talking to the bank asap. Afaik coinbase is one of the best fee wise as also being able to go then through paypal to send yourself the money. do something like that for a small amount and work from there.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "gtkp17u",
                                                            "author": "TheRitalinCommando",
                                                            "score": 17,
                                                            "created_utc": 1617720234.0,
                                                            "response": "As I understand it, Coinbase *Pro* has low fees and is different from regular Coinbase. I'm not saying you can't use it, just that they're two different products as I understand it.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "gx3kygz",
                                                                    "author": "WhaleAtHeart",
                                                                    "score": 1,
                                                                    "created_utc": 1620264085.0,
                                                                    "response": "Fees are high on both exchanges imo. I just cleaned out my CBpro account. Trading fees start piling up.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "gtmkut8",
                                                            "author": "Wco39MJY",
                                                            "score": 6,
                                                            "created_utc": 1617750666.0,
                                                            "response": "Why on God's green earth would you let any investment money go anywhere near PayPal?  There are no controls on Paypal, they are not a bank and you are at their mercy. There are enough horror stories to stay clear of paypal for anything other than few random online sales",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "gukwv6l",
                                                                    "author": "Vegasboy52",
                                                                    "score": 3,
                                                                    "created_utc": 1618470397.0,
                                                                    "response": "Agreed, they will put your money on a hold forever",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "gvc36js",
                                                                            "author": "ah-hum",
                                                                            "score": 1,
                                                                            "created_utc": 1619020198.0,
                                                                            "response": "Happened to my friend who was accused of supporting terrorists, bc the maker of a product was pakistani.  She's banned for life.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "gtkhf14",
                                                    "author": "DirtieHarry",
                                                    "score": 5,
                                                    "created_utc": 1617716684.0,
                                                    "response": "Pick up some gold and silver while you're at it. Greenbacks ain't what they used to be.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "gtkmy55",
                                                    "author": "42252252",
                                                    "score": 3,
                                                    "created_utc": 1617719294.0,
                                                    "response": "Yeah, if you're paranoid there are rumors that the IRS starts auditing people that fit a profile who start making a lot of money \"out of nowhere\" and getting a tech illiterate CPA won't help all that much if they're the ones that report you.  \n\nThe last thing you want is feds barging in and confiscating all your devices just to make sure it's all legitimate. You're in that sweet spot where you have enough money to make an audit worthwhile, but not so much that you can afford protracted court battles and experts on your side.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "gwyibh0",
                                                            "author": "Gullible_Ad_3290",
                                                            "score": 1,
                                                            "created_utc": 1620167874.0,
                                                            "response": "Yeh.. with that big of a cash out.. it will trigger a flag.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "gtkvy3d",
                                    "author": "Theoretical_Action",
                                    "score": 41,
                                    "created_utc": 1617723325.0,
                                    "response": "It will absolutely cost much much more than $2k if you're in the US. Long term capital gains will be 20% on nearly half of that (all gains over ~$450k) assuming your cost basis was in the thousands and not hundreds of thousands. And then it'll be about 15% on everything under ~$450k, plus 5-10% for state depending on where you live. \n\n>How do I go about getting the money from blockchain wallets to my bank account, is it taxed immediately or do i file it later on?\n\nYou would use an exchange like Gemini, Binance, etc and place a Sell order at a certain price the same way as a stock market. It will not be taxed immediately and you will file it in your 2021 tax return (assuming you're in US) next year. \n\n>I do not have a high income, is my bank/IRS going to have a panic attack when i withdraw nearly a million dollars to my account out of nowhere?\n\nYes and no.. This is the part you'll want to hire the CPA for, and I'd recommend having someone help you on your 2022 taxes as well, as you will likely have to file your returns quarterly for the year instead of all at the end of 2022 (The IRS having a panic attack). Your income for 2021 will become nearly a million dollars which will put you and your family in a higher tax bracket than you were previously. \n\nBut yeah, like the others have said, a good accountant will give you great suggestions on how and when to move your money around to minimize capital gains taxes. \n\nAll I'll say to close on is that once you've spoken with a CPA, consider the cost of your strategy here. Decide if the volatility of bitcoin is too scary for you to the point that you'd be willing to pay over a hundred thousand dollars just to have it in another investment vehicle. There are reports even from financial firms that have BTC price targets of over $100k. I'm *certainly* not giving you any financial advice here but just recognize that the cost of moving this much money out of any investment vehicle is very high, and it is always more profitable to put off paying taxes until a later date. That being said, Biden's new capital gains tax plan will be hitting $1mm+ earners with a 40% gains tax soon, so be smart with your investments. If you're reinvesting the full amount somewhere else, plan to either eat a 40% tax or leave it in there for 4-8 years or longer depending on whether or not Republicans take office back any time soon.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "gtmml59",
                                            "author": "Wco39MJY",
                                            "score": 5,
                                            "created_utc": 1617751521.0,
                                            "response": "He said he paid the CPA 2k for among other things tax advice.  Obviously taxes on the profit will be higher but taking profit and diversification over time may be exactly what OP need. (Your mileage may vary). Estate management looks very different than weath accumulation.  Having assets whose cost basis reset  may be more important than avoiding taxes now.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "gtmpf8t",
                                                    "author": "Theoretical_Action",
                                                    "score": 6,
                                                    "created_utc": 1617752974.0,
                                                    "response": "To your first point, you're right I misread that. Estate management and wealth management are absolutely different but leaving money on the table is not smart regardless of the situation. Like I said I'm not trying to provide any investment advice whatsoever because you and I both know nothing of OPs situation. For me personally, if I were, say, a 30 year old with this money it doesn't make a lot of sense to me to move this into other investment vehicles as a giant lump sum. Again for me personally even if I were closer to 50 and had the time but still wanted to pull the money out for retirement early, for me it would be wiser to realize <450k gains each year over 2 years in most cases to save yourself the potential 5-20% (depending on when Biden plans to begin enforcing the new tax plan) as well as to continue having money in a rapid growth investment for another year. Win win of letting half your money continue earning moderate interest in safe low risk investments while still keeping some in more volatile investments with a LOT of growth projected for the next year.\n\nBut once again, not investment advice. I'm not saying that as a meme, I'm saying that because it's my personal investment ideas and everyone has different needs, goals, and money.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "gtms07n",
                                                            "author": "Wco39MJY",
                                                            "score": 2,
                                                            "created_utc": 1617754300.0,
                                                            "response": "I agree completely I don't give investment advice but have empathy for those trying to find good advice. I think we would agree paying for advice from a knowledgeable Fiduciary is money well spent. Sometimes you just need an expert. Taxes are no fun and I am procrastinating.. time to get off redit..",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "gtmsj0t",
                                                                    "author": "Theoretical_Action",
                                                                    "score": 1,
                                                                    "created_utc": 1617754565.0,
                                                                    "response": "Very much so. My dad is my in house CPA so I couldn't agree more haha. Have a nice day!",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "gtmgh64",
                                            "author": "lil_chowda",
                                            "score": 7,
                                            "created_utc": 1617748447.0,
                                            "response": "This guy gets it.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "gvyz11s",
                                            "author": "555soul1989",
                                            "score": 1,
                                            "created_utc": 1619468462.0,
                                            "response": "boooom",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "gwyii2i",
                                            "author": "Gullible_Ad_3290",
                                            "score": 1,
                                            "created_utc": 1620167959.0,
                                            "response": "Kid they can find someone to buy the btc without an exchange they can just pocket the cash.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "gtmfomm",
                                    "author": "Oatz3",
                                    "score": 6,
                                    "created_utc": 1617748040.0,
                                    "response": "If you know what to do it's not that hard to do it yourself.  Though 2k may be worth it if they are providing insurance on the transfer.\n\nSteps:\n\n1.) Transfer the bitcoin to the exchange.\n\n2.) Transfer the bitcoin into USD. You may want to do this over time if you are concerned about current price or volatility to get an average price.  Or do it all at once.\n\n3.) Follow the exchange's rules on withdrawing. DO NOT STRUCTURE YOUR PAYMENTS, this is illegal.\n\n4.) Pay taxes on it. This is also required and not doing so is illegal.  The taxable event occurred when you transferred the bitcoin into USD. Cost basis is (cost of bitcoin at transfer - cost of bitcoin when acquired) in the US.\n\nCongrats, now you have your money (in USD).",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "gtngs55",
                                            "author": "rydog389",
                                            "score": 2,
                                            "created_utc": 1617767646.0,
                                            "response": "What do you do not structure your payments? This is news to me.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "gto9we5",
                                                    "author": "Oatz3",
                                                    "score": 1,
                                                    "created_utc": 1617792664.0,
                                                    "response": "Basically just withdraw as normal, don't intentionally withdraw 9k at a time instead of 50k or whatever amount you need just to avoid bank reporting requirements. Not a lawyer though.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "gtp623n",
                                                            "author": "rydog389",
                                                            "score": 1,
                                                            "created_utc": 1617809897.0,
                                                            "response": "Interesting...",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "gva98c1",
                                                                    "author": "Fish_Kungfu",
                                                                    "score": 2,
                                                                    "created_utc": 1618975348.0,
                                                                    "response": "Google the Bank Secrecy Act.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "gtl2glm",
                                    "author": "Desperate_Answer_997",
                                    "score": 10,
                                    "created_utc": 1617726174.0,
                                    "response": "I’m just a piece of shit that doesn’t know shit but this seems like it would be the best $2,000 ever spent",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "gtk770n",
                                    "author": "9trogenta",
                                    "score": 20,
                                    "created_utc": 1617711100.0,
                                    "response": "2000$ to move your own money around is a ripoff.\n\nOnly that would convince me to stick to my Bitcoin. In stocks, index funds, etc, be prepared to get bitten in the ass at every single step.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "gtkrwcz",
                                            "author": "H_ALLAH_LUJAH",
                                            "score": 21,
                                            "created_utc": 1617721517.0,
                                            "response": "Underrated comment right here.\n\n  \nWasn't the entire point of bitcoin autonomy? To be your own bank? Paying 2k to open an account that is free at its core is absurd.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "gtm83tb",
                                                    "author": "ttack99",
                                                    "score": 17,
                                                    "created_utc": 1617744364.0,
                                                    "response": "> errated comment right here.\n> \n> Wasn't the entire point of bitcoin autonomy? To be your own bank? Paying 2k to open an account that is free at its core is absurd.\n\nYou're not paying $2K to move your own money, you're paying $2K for someone's knowledge of tax code that is far beyond your own & how to pay as little taxes as possible.  That said, you can always look up & read the tax code for free & familiarize yourself with other financial products, but that takes time & there's a chance  you misinterpret tax code.  There's a reason why CPA's make a good living, they specialize in knowing & understanding something that most people do not.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "gtmacpb",
                                                            "author": "H_ALLAH_LUJAH",
                                                            "score": 7,
                                                            "created_utc": 1617745424.0,
                                                            "response": "> That said, you can always look up & read the tax code for free & familiarize yourself with other financial products, but that takes time & there's a chance you misinterpret tax code.\n\nFair enough. This is the essence of what I was trying to say, thanks for putting it more succinctly!",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "gtks6lq",
                                                    "author": "9trogenta",
                                                    "score": 14,
                                                    "created_utc": 1617721642.0,
                                                    "response": "Being downvoted. It tells a lot about the values people here have.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "gvc3vek",
                                                            "author": "ah-hum",
                                                            "score": 1,
                                                            "created_utc": 1619020483.0,
                                                            "response": "You have ideas on replacing our tax system i take it?  \n\n\"The only two certain things in life are taxes and death\"",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "gvf7rfi",
                                                                    "author": "9trogenta",
                                                                    "score": 1,
                                                                    "created_utc": 1619079002.0,
                                                                    "response": "Bitcoin.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "gvghp2d",
                                                                            "author": "ah-hum",
                                                                            "score": 1,
                                                                            "created_utc": 1619107349.0,
                                                                            "response": "Well we agree on bitcoin lol.  But how does it create sustainable revenue for public services?",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "gvgn2aw",
                                                                                    "author": "9trogenta",
                                                                                    "score": 1,
                                                                                    "created_utc": 1619109595.0,
                                                                                    "response": "The market provides more than all the services needed. The only use of a government is to defend you against other governments.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "gvgoz9i",
                                                                                            "author": "ah-hum",
                                                                                            "score": 1,
                                                                                            "created_utc": 1619110384.0,
                                                                                            "response": "Well, which part of the market provides the military?  They supposed to invest in bitcoin and use the returns to fund themselves?  No war when bitcoin is low?  Trying to understand the specifics of what you mean",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "gvvubel",
                                                            "author": "FinancialSituation11",
                                                            "score": 1,
                                                            "created_utc": 1619402211.0,
                                                            "response": "Good luck, the latest I saw the United States tax code is 73,954 pages, although there are alternate numbers. Which ever, it's going to be a lot of reading!",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "gvwq2px",
                                                                    "author": "9trogenta",
                                                                    "score": 1,
                                                                    "created_utc": 1619425260.0,
                                                                    "response": "I was in Canada but it was the same problem. I did it by hand though. I know what my income come from and keep my receipts. I just Ctrl + F the tax code to find the paragraphs that applied to me. It takes about 3 hours. Definitely worth it.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "gtk5b61",
                                    "author": "TotalRepost",
                                    "score": 4,
                                    "created_utc": 1617709872.0,
                                    "response": "There's a free crypto tax session on clubhouse tonight",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "gtkca0d",
                                            "author": "CuriosumRe",
                                            "score": 3,
                                            "created_utc": 1617714054.0,
                                            "response": "Yo, can I get a clubhouse invite?",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "gtn6iyz",
                                            "author": "FinTechShark",
                                            "score": 1,
                                            "created_utc": 1617761742.0,
                                            "response": "Awesome. Would like to join please.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "gtl04i9",
                                    "author": "sleeknub",
                                    "score": 0,
                                    "created_utc": 1617725160.0,
                                    "response": "$2k seems way overpriced.  They probably just charged that because they knew they could (someone who is withdrawing that much money obviously can afford it).  I’d shop around a bit.  I don’t see why any capable CPA couldn’t help you out without being a “Bitcoin” CPA.  Seems more likely that someone that markets themselves that way is going to rip you off.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "gtm37y0",
                                    "author": "tdevic",
                                    "score": 1,
                                    "created_utc": 1617742153.0,
                                    "response": "Fabriik.com",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "gtmbiwh",
                                    "author": "Fernjo35",
                                    "score": 1,
                                    "created_utc": 1617745984.0,
                                    "response": "Not sure why you would need to pay 2k. It gets taxed at 20% capital gains if held for more than 1 year which is your case. You would do this when you file for taxes next year",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "gtmowhy",
                                    "author": "fuasyfaposht",
                                    "score": 1,
                                    "created_utc": 1617752703.0,
                                    "response": "was the guy old or new? I doubt old accountants could be of any help?",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "gwyi52k",
                                    "author": "Gullible_Ad_3290",
                                    "score": 1,
                                    "created_utc": 1620167791.0,
                                    "response": "Still going to cost more than 2 k if you pay taxes on your cash out.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "gtmsi61",
                            "author": "grateful_dreamer",
                            "score": 1,
                            "created_utc": 1617754553.0,
                            "response": "Thanks I was wondering also.  Saving this response",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "gw4we3g",
                            "author": "democrypto",
                            "score": 1,
                            "created_utc": 1619582876.0,
                            "response": "How much did you end up paying in taxes?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "gtjdayb",
                    "author": "jhuhfft",
                    "score": 433,
                    "created_utc": 1617684815.0,
                    "response": "You can just cash it all out on Coinbase but trading that for fiat will realize a taxable event and you’ll pay capital gains tax on it. Since you’ve been holding it for well over a year it should get taxed as long-term gains. Look up what the rates are for the amount you’re realizing. Coinbase is a KYC exchange so the IRS already has your info. No panic attack and your bank will gladly hold your money. You shouldn’t have any problems if you just pay your taxes. You should hire a CPA. And also consider taking out a loan against the btc instead so you don’t have to sell, that shit is only going to get more valuable.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "gtjnpjb",
                            "author": "Subject-Creme",
                            "score": 138,
                            "created_utc": 1617693759.0,
                            "response": "Agree with everything except for the loan part\n\nHe is moving $750k from BTC (high volatile) into index stocks (lower volatile), it means he accepted a lower return. Lower the risk, lower the return.\n\nTaking the loan (backed by BTC) to buy index stock actually increases the Risk, for higher return. Which isn't something he wanted in the first place. For example: both BTC and Stock can go down, which can lead to margin call",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "gtl9i0v",
                                    "author": "jayhilly",
                                    "score": 0,
                                    "created_utc": 1617729217.0,
                                    "response": "Then don’t buy stocks with the earnings, keep your assets in the hardest money on the planet and say fuck off to tradfi returns. \n\nUse the loan to start a business, buy a house, or send your kids to college.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "gtko524",
                                    "author": "jhuhfft",
                                    "score": -2,
                                    "created_utc": 1617719831.0,
                                    "response": "I meant just instead of doing anything else. But yeah you’re right",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "gto48qb",
                                    "author": "tinycorperation",
                                    "score": 1,
                                    "created_utc": 1617787535.0,
                                    "response": "If you think index funds are safe now you probably don’t understand bitcoin, I’m sorry this whole thread is like the blind leading the blind with no understanding of the macro climate or even taxes. \n\nIf you’ve truly lost your conviction I would recommend selling 40k a hear when you are retired and have 0 income to avoid all capital gains tax as your invested and income is below 40k.\n\nIt is smart to hold and not sell but rather earn yield on your bitcoin. Bitcoin is deeply safe (google this phrase) and now you want deep safety. Bitcoin is an eminent threat to every asset class especially index funds and passive investing in general.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "gtjga65",
                            "author": "Content_Structure118",
                            "score": 66,
                            "created_utc": 1617687137.0,
                            "response": "This is the best advice I've read all day!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "gtjgjsr",
                                    "author": "jhuhfft",
                                    "score": 47,
                                    "created_utc": 1617687351.0,
                                    "response": "Use it as a jumping off point for your own research. After all I’m just some guy on Reddit",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "gtjgt4r",
                                            "author": "Content_Structure118",
                                            "score": 22,
                                            "created_utc": 1617687565.0,
                                            "response": "Oh believe me, I trust no one 😉",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "gtjvhli",
                                                    "author": "freakyframer73",
                                                    "score": 7,
                                                    "created_utc": 1617701676.0,
                                                    "response": "I don't trust this..",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "gtmc3mt",
                                            "author": "PoppyBirchBark",
                                            "score": 1,
                                            "created_utc": 1617746260.0,
                                            "response": "Oh, I think you’re more than that! I love this group",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "gtji8gk",
                            "author": "damjanv1",
                            "score": 20,
                            "created_utc": 1617688762.0,
                            "response": ">You can just cash it all out on Coinbase but trading that for fiat will realize a taxable event and you’ll pay capital gains tax on it. Since you’ve been holding it for well over a year it should get taxed as long-term gains. Look up what the rates are for the amount you’re realizing. Coinbase is a KYC exchange so the IRS already has your info. No panic attack and your bank will gladly hold your money. You shouldn’t have any problems if you just pay your taxes. You should hire a CPA. And also consider taking out a loan against the btc instead so you don’t have to sell, that shit is only going to get more valuable.\n\nCan you outline the taking out a loan part / strategy. I agree that I personally wouldn't be selling, but I get the feeling whales are using Dexes to their own benefit and wondering how a loan against a holding would be advantageous (I imagine its because you get to realize the monetary benefit and the loan repayments would be dwarfed by any further growth in the price of crypto assets is that correct? are there any tax benefits?)",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "gtkhwc2",
                                    "author": "Plaski",
                                    "score": 3,
                                    "created_utc": 1617716918.0,
                                    "response": "Crypto to crypto is a taxable event. Using crypto as collateral for a loan isn't taxable unless you default on the loan, then it's deemed regular income. Smart contracts and DEXs excel this feature, unfortunately BTC doesn't have it so you are stuck with 3rd party loaners with high rates and sketchy fine print on how they can use your collateral.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "gtn3ruj",
                                            "author": "southofearth",
                                            "score": 1,
                                            "created_utc": 1617760281.0,
                                            "response": "Wrapped bitcoin does",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "gw9beoa",
                                            "author": "New_Money2021",
                                            "score": 1,
                                            "created_utc": 1619668744.0,
                                            "response": "Transferring crypto between any of the wallets or Exchange accounts you own is not a taxable event, as long as you do not trade them for another crypto or to fiat currency when you transfer the assets.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "gu105kj",
                                    "author": "damjanv1",
                                    "score": 1,
                                    "created_utc": 1618046916.0,
                                    "response": "So what is the loan repaid in? bTC I assume? But wouldn't you then be selling the btc and being taxed on that, to make loan repayments",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "gtjgwvn",
                            "author": "neon_giraffe9",
                            "score": 12,
                            "created_utc": 1617687649.0,
                            "response": "Take out a loan against the BTC? Please explain more",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "gtmvn2y",
                                    "author": "easymovet",
                                    "score": 2,
                                    "created_utc": 1617756154.0,
                                    "response": "These guys do bitcoin collateral loans and you can see your collateral on the blockchain never moves. https://unchained-capital.com/loans/",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "gu103ul",
                                            "author": "damjanv1",
                                            "score": 1,
                                            "created_utc": 1618046865.0,
                                            "response": "What do you make the loan repayments in ? bTC ? Wouldn't that trigger a taxable event?",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "gvc49pp",
                                            "author": "ah-hum",
                                            "score": 1,
                                            "created_utc": 1619020645.0,
                                            "response": "Yes also Compound App",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "gtjkafe",
                            "author": "ohimanalabamagamer",
                            "score": 8,
                            "created_utc": 1617690572.0,
                            "response": "Thanks for the detailed response, i’ll be calling exchanges and CPA’s tomorrow. Yeah i’ve had that suggested many times as well so i’ll be looking into taking a loan against it. I am worried about future regulations on crypto causing it to devalue though. But i’ve got time and i’m just now starting to look into what to do with it so i’ll figure it all out. Thanks again for the info!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "gtm8o00",
                                    "author": "ttack99",
                                    "score": 1,
                                    "created_utc": 1617744628.0,
                                    "response": "> i’ll be calling exchanges and CPA’s tomorrow. Yeah i’ve had that suggested many times as well so i’ll be looking into taking a loan against it. I am worried about future regulations on crypto causing \n\nThere is also a crypto IRA.  I don't know much about it but may be worth it for you for sure.  Check out this guy's video, he also has one about a bull cycle exit strategy, which discusses when & how he exits the market.\n\nhttps://www.youtube.com/watch?v=zQzSk8r9mYY",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "gtk790o",
                            "author": "HandsomeHoney",
                            "score": 3,
                            "created_utc": 1617711135.0,
                            "response": "Not trying to be a smartass, but if you sell and pay your taxes, why should you hire a CPA for? Please elaborate. Thanks.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "gtkv2cn",
                                    "author": "PopWhatMagnitude",
                                    "score": 2,
                                    "created_utc": 1617722932.0,
                                    "response": "To hear him laugh at you for trying to get a loan off BTC.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "gtkour0",
                                    "author": "jhuhfft",
                                    "score": 1,
                                    "created_utc": 1617720154.0,
                                    "response": "It can be complicated and if you’re someone asking Reddit what to do, you probably don’t know what you’re doing. A CPA does. They will make sure you don’t miss anything and will possibly know something that I don’t.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "gtjntrg",
                            "author": "b0ogal0o_b0i",
                            "score": 2,
                            "created_utc": 1617693873.0,
                            "response": "CPA? And what does borrowing against ₿ mean? I keep hearing that term but haven't gotten my head around it yet. Can you explain it so a smooth brain like me can understand?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "gtjsomz",
                                    "author": "HASTOLEAVEAIRPORT",
                                    "score": 7,
                                    "created_utc": 1617698803.0,
                                    "response": "Certain institutions will allow you to borrow USD if you park your BTC with them. It’s definitely a not your keys not your bitcoin situation if the shit hits the fan",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "gtlr7kt",
                            "author": "normemmacaro",
                            "score": 1,
                            "created_utc": 1617736990.0,
                            "response": "You don’t pay taxes right away when you cash out! You will add the long term capital gains of your BTC with your personal income once you file your federal and state taxes to get the tax rate. To get an estimate, use CoinTracker.io",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "gtm19jy",
                                    "author": "jhuhfft",
                                    "score": 2,
                                    "created_utc": 1617741302.0,
                                    "response": "You’re right it’s not right when you cash out, I didn’t say that or mean to give that impression. \nI assumed OP knows you only pay tax either quarterly or at the end of the year. But long term capital gains tax is not taxed at the same rate as your regular income tax. In fact it’s 0% up to $40k, something to factor in when thinking about using your btc as collateral against a loan.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "gtmv6zp",
                            "author": "GalacticCannibalism",
                            "score": 1,
                            "created_utc": 1617755926.0,
                            "response": "I was with you until you said 'you should hire a CPA.'\n\nEverything leading up that was do it yourself mantra. Are you sure this is what you meant to say?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "gtn2a8j",
                                    "author": "jhuhfft",
                                    "score": 1,
                                    "created_utc": 1617759524.0,
                                    "response": "I mean if the dudes really worried about it. You don’t have to if you are 100% confident you know what you’re doing. But $750k is a lot of money and OP doesn’t seem 100% confident",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "gtjq399",
                    "author": "frds125",
                    "score": 108,
                    "created_utc": 1617696128.0,
                    "response": "Just curious, how many scam DMs have you gotten since this post? Any support asking for seed etc?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "gtjxjvr",
                            "author": "daybreakerco",
                            "score": 76,
                            "created_utc": 1617703650.0,
                            "response": "idk man...i’m his long lost cousin and haven’t heard from him in years lol so i’ll just DM here i guess",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "gtk14he",
                                    "author": "PhyrexianSpaghetti",
                                    "score": 45,
                                    "created_utc": 1617706770.0,
                                    "response": "Small time, I'm a Nigerian prince and that's exactly the amount of money I need to unlock my account with 999999999 trillions on it",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "gtk6wlq",
                                            "author": "daybreakerco",
                                            "score": 2,
                                            "created_utc": 1617710917.0,
                                            "response": "now that’s thinking lmfao",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "gtkdinx",
                            "author": "Chrisppity",
                            "score": 16,
                            "created_utc": 1617714711.0,
                            "response": "Especially the ones pretending to be CPAs or knowing a “reputable” CPA. lol  He might as well delete his account and start fresh because I’d imagine he’d be bombarded from here on out.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "gtk08m7",
                            "author": "zivilia",
                            "score": 2,
                            "created_utc": 1617706039.0,
                            "response": "At least 1",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "gtkqrik",
                                    "author": "ironbit1",
                                    "score": 1,
                                    "created_utc": 1617721006.0,
                                    "response": "Yours? :)",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "gtjqaoa",
                    "author": "OgunX",
                    "score": 52,
                    "created_utc": 1617696334.0,
                    "response": "your poor inbox",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gtlghvp",
                    "author": "SafeHarbors",
                    "score": 12,
                    "created_utc": 1617732249.0,
                    "response": "Use Coinbase Pro vs Coinbase to sell. Lower fees. Then you’ll have to pay long term capital gains taxes. See if you can find your purchase records. Don’t try to evade taxes. The IRS won’t know until tax time, and that’s when you file. And your bank will immediately start treating you very differently!\n\nCongratulations for hodling for so long. You are a rare breed!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "gtmjyop",
                            "author": "stephmonkeya",
                            "score": 2,
                            "created_utc": 1617750216.0,
                            "response": "How do I withdraw my crypto from Coinbase Pro? Do I have to transfer back to coinbase? I don't see the withdraw feature allowing me to withdraw to my bank account only another wallet or coinbase. Any advice is appreciated, newbie here.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "gtulqi1",
                                    "author": "SafeHarbors",
                                    "score": 3,
                                    "created_utc": 1617912099.0,
                                    "response": "You can withdraw crypto and fiat from coinbase pro to any wallet address and bank account, respectively. You can transfer back and forth between coinbase and coinbase pro instantly and with no fees",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "gtkdcsl",
                    "author": "ChuckSlick007",
                    "score": 8,
                    "created_utc": 1617714626.0,
                    "response": "Everybody in stocks should be doing the opposite.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gtjkmpg",
                    "author": "sanblasto",
                    "score": 19,
                    "created_utc": 1617690881.0,
                    "response": "Mr. Hadley, do you trust your wife?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "gtmsbzt",
                            "author": "CrackoryF",
                            "score": 2,
                            "created_utc": 1617754465.0,
                            "response": "Shawshank Redemption??",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "gtjuiru",
                    "author": "Supersymm3try",
                    "score": 35,
                    "created_utc": 1617700696.0,
                    "response": "Id probably start by not posting about my vast wealth on reddit and delete this post immediately, and be prepared to be targeted by many many scammers that have seen this post.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "gtk36k4",
                            "author": "set-271",
                            "score": 15,
                            "created_utc": 1617708363.0,
                            "response": "Hey Hey Heyyyyyy!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "gtkcz8v",
                                    "author": "gearboxjoe",
                                    "score": 7,
                                    "created_utc": 1617714427.0,
                                    "response": "Wasawasawasawasa wASSUPP",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "gtkdy5z",
                                            "author": "kubbiember",
                                            "score": 4,
                                            "created_utc": 1617714935.0,
                                            "response": "Carlos Matos is on track to be immortal :-)",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "gtk6d9n",
                                    "author": "KhanKarab",
                                    "score": 2,
                                    "created_utc": 1617710569.0,
                                    "response": "It’s me, your buddy/friend/cousin... how’s it going man?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "gto4j76",
                            "author": "tinycorperation",
                            "score": 3,
                            "created_utc": 1617787821.0,
                            "response": "750k is not a vast amount on wealth. I feel like everyone congratulating him now should imagine what it will feel like when bitcoin triples this year and he leaves 1.5m on the table for index funds that are returning rates below the rate of inflation. I would have a hard time living with that",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "gto5lba",
                                    "author": "Supersymm3try",
                                    "score": 1,
                                    "created_utc": 1617788850.0,
                                    "response": "750k is a vast amount of wealth for 99.99% of all humans that ever lived. Also, yeah but its also possible BTC tanks to 5k and he loses everything  m\n\nYou play a dangerous game when you start talking about certainties of what BTC is going to do. Covid was good for BTC, we are still seeing the imo artificially high (for now) valuation from that. Once it settles back down another 10k or so, and if it then stays stable, I think we can start talking in more certain terms, at that point.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "gtomd6y",
                                            "author": "tinycorperation",
                                            "score": 1,
                                            "created_utc": 1617800697.0,
                                            "response": "First of all nothing is certain, not index funds not bitcoin-i dont talk in certainties I talk in probabilities and I understand macro climate better than you. OP is deciding to put his money in index funds thats the alternative we are talking about. Passive investing could very well underperform inflation and thats why QQQ, Ark Invest and Bitcoin are doing so well because everybody is racing for growth/yield to beat expanding money supply. \n\nBitcoin is asymmetric upside because its an emerging asset class where institutions can't front run the trade. If you think bitcoin is overvalued now you have not done your homework on glassnode or cryptoquark. On chain analysis is strong right now. Could bitcoin go down a couple K, yeah for sure. Would I trade out of bitcoin, fuck now. \n\n  \nI dont know how its become fashionable to encourage people to trade out of bitcoin on here. I understand that you dont want bitcoin to become this religiously devoted cult but can we at least understand what we are talking about here. If you dont think bitcoin has a good chance of overtaking gold as store of value in the next 4-5 years why even post here? That would be peanuts compared to past performance by the way. Would I advise someone to trade out of bitcoin for index funds? fuck no, and definitely not on the basis of safety or prudence, look at m2 money supply charts on FRED and tell me anything is safe, this is unprecedented times, any asset class that is considered safe is a naive illusion. \n\nLets do the math, if bitcoin does steal half of golds market cap, thats a 5x thats  $3.75m. Not a certainty but nothing is a certainty, its merely just a continuation of one of the best performing assets in our lifetime in an extremely friendly macro climate. I would have a hard time living with myself giving up that kind of money to buy into a passive investing bubble that completely contradicts the thesis of bitcoin. \n\nIndex funds are not created to be safe-Stock market is not intended to prop up retirement accounts. Stock market purpose is to allocate capital to under invested companies. This has created a huge misallocation into indexed companies and created a bubble ripe for bitcoin to steal value indirectly. Real estate, negative yielding bonds, passive etfs/index funds are ripe to get raped by Bitcoin as they have been operating as vastly inferior stores of value. \n\nr/bitcoin has become a laughing stock in bitcoin discourse because of this lack of awareness. Encourage someone to buying index funds is completely contradictory to bitcoin thesis. Diversifying for the sake of diversifying lol, imagine leave 3 million on the table for index funds-fuck you guys really",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "gtkcwm1",
                    "author": "ChuckSlick007",
                    "score": 11,
                    "created_utc": 1617714388.0,
                    "response": "I have been a financial advisor for over 30 years. I have seen it all. Do not do that. Period. Just keep holding BTC and spend it in the future. You will never have to liquidate back to fiat in the very near future.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "h9061sj",
                            "author": "nousernamesleft___",
                            "score": 2,
                            "created_utc": 1629009984.0,
                            "response": "Best comment I’ve ever read on Reddit. Expert level shit",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "gtkgvdu",
                            "author": "Crypto_Jacobt",
                            "score": 1,
                            "created_utc": 1617716415.0,
                            "response": "So, you're saying go with a loan against your btc holdings? I think that's the best way.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "gtkjuxo",
                                    "author": "TheShtoiv",
                                    "score": 4,
                                    "created_utc": 1617717861.0,
                                    "response": "No, I think he means simply keep Hodling and wait until more services begin accepting BTC in the future.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "gtl2062",
                                    "author": "ChuckSlick007",
                                    "score": 3,
                                    "created_utc": 1617725978.0,
                                    "response": "I don't really know the persons situation. All I know is that they hold a significant amount of BTC and want to sell it and invest in stocks. What would he need a loan for? The best thing to do is just HODL the BTC, no loan. But if he needs money for something other than to purchase stock, I would say just sell a bit as long as it's not more than maybe 10%. The most important thing is not to lose the position in Bitcoin.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "gtlntkw",
                                            "author": "sideof-vicious777",
                                            "score": 2,
                                            "created_utc": 1617735484.0,
                                            "response": "This is very logical advice.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "gtm61cf",
                            "author": "ReviewMePls",
                            "score": 1,
                            "created_utc": 1617743406.0,
                            "response": "Is... Is this financial advice?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "gtm6bb3",
                                    "author": "ChuckSlick007",
                                    "score": 1,
                                    "created_utc": 1617743531.0,
                                    "response": "From ChuckSlick007...what are you some kinda joker? Of course it's not \"financial advice\"...I'm just trying to save the guy from ruin.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "gtm5dpq",
                    "author": "rkalla",
                    "score": 4,
                    "created_utc": 1617743107.0,
                    "response": "READ THIS\n\n1. Yes you will owe tax on the difference from what it cost you when you bought it to the day you sold it.\n2. If you only ever bought one batch of BTC in 2013 and now it’s worth $750k, that’ll be easy to calculate, but be warned, it means almost all that money will be up for some aggressive taxing.\n3. If you bought in MANY batches over the years and sold at different times, uhhh calculating all of that unless you kept excellent notes is going to suck. If you’ve been on coin base the whole time then they keep good records and it should be ok.\n4. IMPORTANT - we have a PROFRESSIVE tax in the US; incremental amounts of income are taxed differently. It’s not, for example, your yearly income taxed at say percent like 30%. You can find estimate calculators online.\n5. IMPORTANT - Given #4, you can look up the tax brackets for 2021... if you go cash out all Bitcoin at once, that will push you into highest tax bracket immediately and everything above 250 or 300k is taxed at 39%. Look up the brackets I forgot exactly. My brackets were pretty off, here are the brackets - https://www.kiplinger.com/taxes/tax-brackets/602222/what-are-the-income-tax-brackets-for-2021-vs-2020\n6. IMPORTANT - Because of #5, and you said you are low income, if you instead liquidated your Bitcoin over the next 4 years in chunks, being careful to keep yourself in the 20-something tax bracket, you could potentially save yourself $100k or more in taxes versus cashing it all at once.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gtjbr3u",
                    "author": "KindDecision2",
                    "score": 25,
                    "created_utc": 1617683700.0,
                    "response": "You can also find a person, be it a friend or family member that can buy the crypto for you in cash, which is highly unlikely and you send them the btc thru a wallet exchange. Just an idea, of course",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "gtjd0fs",
                            "author": "Emergency_Raccoon363",
                            "score": 23,
                            "created_utc": 1617684598.0,
                            "response": "This works if you want to keep the money under your mattress but they are looking to put the money back into the market.  So the IRS is going to see massive deposits into the guys account in cash and it will flag an audit and because it’s cash there will probably be some guys in wind breakers with big yellow letters on the back knocking on their door.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "gtjl9xx",
                            "author": "ohimanalabamagamer",
                            "score": 8,
                            "created_utc": 1617691467.0,
                            "response": "Yes thank you this is exactly the kind of thing i was asking here for. But i dont know anyone with that kind of money that’d be willing to buy bitcoin i don’t think lmao. A good thought though i might ask a few people.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "gtk5qi2",
                                    "author": "olugbo",
                                    "score": 8,
                                    "created_utc": 1617710156.0,
                                    "response": "Michael Saylor’s ears are tingling now, lol",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "gtkdad1",
                    "author": "ChuckSlick007",
                    "score": 10,
                    "created_utc": 1617714590.0,
                    "response": "It's as close to a guarantee as I can give that you will be crying in a very short period of time if you liquidate your BTC and \"invest\" in equites. Equities are at an all-time high with little to no prospects going forward short of additional money printing to support just stupid valuations. That is literally, the worst thing you could do...short of liquidating and putting it in long duration government bonds.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "gtm5odx",
                            "author": "ReviewMePls",
                            "score": 1,
                            "created_utc": 1617743242.0,
                            "response": "What other options for diversification do you see? And I mean outside of crypto",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "gtm8cdo",
                                    "author": "oldhodler",
                                    "score": 2,
                                    "created_utc": 1617744476.0,
                                    "response": "Real estate, bonds, banana stands, precious metals...honestly I'm not more bullish on anything more than BTC for the near term.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "gto8axm",
                                    "author": "ChuckSlick007",
                                    "score": 1,
                                    "created_utc": 1617791328.0,
                                    "response": "I don't know outside of crypto...you got any ideas? Everything is overvalued in my view except for the precious metals and mining equities. And the problem with those is that TPTB have a lockdown on the price. They are the most manipulated markets on the planet all to the downside. That manipulation will break one day but who knows how long that is going to take.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "gtjhhrl",
                    "author": "Adorable_coins",
                    "score": 20,
                    "created_utc": 1617688130.0,
                    "response": "If you’re going to do it - do it by end of year. Biden is raising long term capital gains tax!!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "gtjied4",
                            "author": "Adorable_coins",
                            "score": 7,
                            "created_utc": 1617688902.0,
                            "response": "It’s not good but it won’t happen until 2022 so he should do it by year end.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "gtlxglf",
                    "author": "nervecurve",
                    "score": 3,
                    "created_utc": 1617739646.0,
                    "response": "If you moved $50,000 from Coinbase you know the answer to your tax question, so why are you asking? Before the $50,000 comment you said, “How do I go about getting the money from blockchain wallets (you have more than one?) to my bank account” Then in the following sentence you say you moved Bitcoin from Coinbase to I assume your bank account. So help me out here, why the contradictions? Did your bank “have a panic attack” on the $50,000? Apparently not, so why think they would on a higher amount? As you would have learned, banks KNOW where the money came from, also the IRS were notified the day you deposited the $50,000, did they contact you, any men in suits knock on your door? No they did not. So relax. Now the good news setting aside the contradictory statements, if you made under $40,000 and you are single, you can cash in a million in Bitcoin and you will pay 0% taxes on it. Now that was the tax rule on long term (held over a year) capital  gains in 2020 (you can thank President Trump for it) I assume the same rule will apply for 2021, but you better act before the current administration changes this. As I am sure everyone on this tread is aware the IRS 1040 form includes a question about virtual currencies on the front page asking taxpayers if “at any time during 2020, did [they] receive, sell, send, exchange, or otherwise acquire any financial interest in any virtual currency? If you made over $40,000 up to something around $400,000 the tax on long term capital gains is 15%. Hopefully when you said you did not have a high income you meant under $40,000 or if you are married it’s higher, not sure how much. If you make more than $40,000 and do not want to pay over a $112,000 to the government then consider a self-directed Roth IRA to shelter your cryptocurrency profits from capital gains taxes and income taxes. Self-directed IRA’s give you more flexibility in that you can expand your investments beyond those approved by a custodian (like Fidelity or Vanguard, etc.) to encompass a much wider range of options including real estate, precious metals, etc. There are other options but that’s enough for now. PS...telling people publicly you have 3/4 a million dollars in Bitcoin is not wise.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "gtm357d",
                            "author": "StressMission694",
                            "score": 3,
                            "created_utc": 1617742121.0,
                            "response": "The tax rate for single in 2021 will be 37% on the sale of $750000. And then you add State income tax. It is taxed as income no matter how long you own it. Of course, there are tax steps up to 37%.\n\n* 37% for incomes over $523,600 ($628,300 for married couples filing jointly)\n* 35% for incomes over $209,425 ($418,850 for married couples filing jointly)\n* 32% for incomes over $164,925 ($329,850 for married couples filing jointly)\n* 24% for incomes over $86,375 ($172,750 for married couples filing jointly)\n* 22% for incomes over $40,525 ($81,050 for married couples filing jointly)\n* 12% for incomes over $9,950 ($19,900 for married couples filing jointly)\n* 10% for incomes up to $9,950 ($19,900 for married couples filing jointly)\n*  [CryptoTrader.Tax — The #1 Crypto Tax Software](https://cryptotrader.tax/)",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "gtmz4oc",
                    "author": "SolarPanelDude",
                    "score": 3,
                    "created_utc": 1617757938.0,
                    "response": "if that is your entire holdings do not cash it all out at once.  Take some out and use it buy a house and keep holding the rest for when bitcoin keeps going up.\n\n&#x200B;\n\nToo many times in my life I cashed out a position in entirety only to watch it go another 10X.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gtneay3",
                    "author": "btcbrady",
                    "score": 3,
                    "created_utc": 1617766107.0,
                    "response": "Don’t cash out! Hold",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gtjgobh",
                    "author": "notJambi",
                    "score": 33,
                    "created_utc": 1617687452.0,
                    "response": "don’t cash out, take a loan against it.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "gtjjf4o",
                            "author": "ohimanalabamagamer",
                            "score": 45,
                            "created_utc": 1617689797.0,
                            "response": "I had a friend suggest this too but i’m unsure how future regulations will affect bitcoin price and i’m not huge on risk taking anymore now that i have something to lose lmao. I’ll look into it though, thank you.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "gtjrse6",
                                    "author": "dubov",
                                    "score": 24,
                                    "created_utc": 1617697869.0,
                                    "response": "I think the loan idea is just adding an extra layer of complexity, cost, and risk. IMO you would be better off just keeping a bit more BTC rather than going down that road. Or, your original plan is fine",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "gtk4qv2",
                                            "author": "vinsane38",
                                            "score": 2,
                                            "created_utc": 1617709489.0,
                                            "response": "Agreed, the collateral loan makes sense if you need the cash for something tangible...borrowing to invest works great in bulk markets only",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "gtk56zr",
                                                    "author": "dubov",
                                                    "score": 11,
                                                    "created_utc": 1617709796.0,
                                                    "response": "Yeah exactly, imagine if he took out a loan of $500k against the BTC instead of selling the BTC, and then the price retraces to $15k/BTC. Now your BTC is worth $125k and you owe $500k of fiat. Oh, and you have to pay interest on that too",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "gtkmqc6",
                                                            "author": "randolphmd",
                                                            "score": 2,
                                                            "created_utc": 1617719195.0,
                                                            "response": "I think you guys are misunderstanding how these BTC-backed loans work.  Not all of them, but many dont work the way you are describing.  I see them as a win win since you dont loose any future upside/exposure to bitcoin but you can also pull out capital.\n\nIn the event you are describing, bitcoin crashed to to 15k, you wouldn't owe any USD, the BTC you lent would have been liquidated.  So if it goes down, you lose your bitcoin but who cares since you can buy back much cheaper.  If it goes up you keep your entry locked in at whatever price you took the loan.\n\nI am not an expert on this so someone please correct me if I am wrong.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "gtkojx5",
                                                                    "author": "dubov",
                                                                    "score": 5,
                                                                    "created_utc": 1617720018.0,
                                                                    "response": "Yeah it depends on the exact terms of the loan (which I don't know), but there's no way it can be a 'win win'\n\n> In the event you are describing, bitcoin crashed to to 15k, you wouldn't owe any USD, the BTC you lent would have been liquidated\n\nImagine you had $500k of BTC at today's price, and asked Coinbase for a loan. Maybe they would allow you to borrow something like $250k (wild guess). They would send you cash and make you keep your coins on the exchange. If the price dropped 50%, they would tell you to either put more collateral forward, or be liquidated. If you don't put more in, they sell your coins for $250k, get their money back, and you have nothing (except the remaining cash). \n\nOf course it would be great if the price went up, because now you'd get the best of both worlds, same number of coins at a higher value, plus cash, but we are leveraging here. If you invest borrowed money (which effectively, you are doing), your risks are magnified as well as your reward. It cannot be the right strategy in OPs case where he is looking to reduce risk (unleveraged BTC is risky enough). Plus it also comes with interest costs, which are a guaranteed loss",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                },
                                                                {
                                                                    "id": "gtkpy45",
                                                                    "author": "BenTG",
                                                                    "score": 1,
                                                                    "created_utc": 1617720640.0,
                                                                    "response": "But what money would you use to buy back in? Assuming you used the loan for other things, you’d then need to come up with cash to buy back in once your btc was liquidated.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "gtkrsqb",
                                                                            "author": "randolphmd",
                                                                            "score": 1,
                                                                            "created_utc": 1617721473.0,
                                                                            "response": "I guess my assumption is we are talking about someone with income or some disposable money if this sell is about diversifying investments rather than needing capital.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        },
                                                                        {
                                                                            "id": "gtkrv6u",
                                                                            "author": "Roasted_Butt",
                                                                            "score": 1,
                                                                            "created_utc": 1617721503.0,
                                                                            "response": "Exactly. That’s the problem - it’s risky.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "gtjl7c8",
                                    "author": "notJambi",
                                    "score": 6,
                                    "created_utc": 1617691399.0,
                                    "response": "yeah np, everyone’s financial situation is different as well as risk tolerance.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "gtkkhky",
                                    "author": "Jek_Porkinz",
                                    "score": 8,
                                    "created_utc": 1617718155.0,
                                    "response": "> i’m not huge on risk taking anymore now that i have something to lose lmao\n\nI feel like you know this better than crypo fans on Reddit will know it. We are all on here bc we're super pumped about crypto, love the idea of it,  and making money off it too. You've already made life changing money off of it, don't fuck that up lol. Enjoy your life upgrade. But maybe keep at least some BTC to avoid FOMO.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "gtjtlhq",
                                    "author": "jaydoors",
                                    "score": 2,
                                    "created_utc": 1617699741.0,
                                    "response": "Seriously I think you need to consider the risks associated with the alternatives to bitcoin.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "gtjwvke",
                                    "author": "beowulfpt",
                                    "score": 2,
                                    "created_utc": 1617703019.0,
                                    "response": "You don't \"exit\" BTC. \n\nBTC is the exit.\n\nAs others suggested, I'd use a part of that stash to take a loan to invest in different hard assets. \n\nThis thing will pump forever, forever ohimanalabamagamer!",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "gtke6jh",
                                    "author": "ChuckSlick007",
                                    "score": 0,
                                    "created_utc": 1617715055.0,
                                    "response": "The stock market declined by 90% in the Great Depression, I see no reason that will not repeat itself especially considering that the fundamentals today are even worse.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "gtm5dns",
                                            "author": "ReviewMePls",
                                            "score": 4,
                                            "created_utc": 1617743106.0,
                                            "response": "Bitcoin declined by 80% at least three times, that's a much more probable event short to middle term.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "gtm5sfw",
                                                    "author": "ChuckSlick007",
                                                    "score": 2,
                                                    "created_utc": 1617743294.0,
                                                    "response": "But what is your point? We know the situation with the volatility, that's not news. If the person in question went by that he already would have sold a long time ago. It will drop again, not sure 80% but it will do so significantly, but so what? That's just the nature of the beast. It's going over a million in the long-term.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "gtm761k",
                                                            "author": "ReviewMePls",
                                                            "score": 1,
                                                            "created_utc": 1617743927.0,
                                                            "response": "I was just saying that the crash argument alone goes both ways",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "gto7ugd",
                                                                    "author": "ChuckSlick007",
                                                                    "score": 1,
                                                                    "created_utc": 1617790921.0,
                                                                    "response": "That would be true. The difference in my opinion is the long-term prospects for Bitcoin is better than for the US Stock markets. But then, there is the difference period.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "gtm62au",
                                                    "author": "ChuckSlick007",
                                                    "score": 1,
                                                    "created_utc": 1617743418.0,
                                                    "response": "I disagree that it is \"much more probable\". The stock market is a total joke. When the manipulation breaks it will drop straight down going \"no bid\".",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "gtm6zkr",
                                                            "author": "ReviewMePls",
                                                            "score": 1,
                                                            "created_utc": 1617743844.0,
                                                            "response": "The way they're pumping money right now, it could take another few years until that might happen. The btc bull run on the other hand could last until end of year. Nobody knows, but that's my intuition",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "gto82i8",
                                                                    "author": "ChuckSlick007",
                                                                    "score": 1,
                                                                    "created_utc": 1617791119.0,
                                                                    "response": "You definitely could be correct. But we just don't know. In my mind the only thing to be done is play the long-term game and means Bitcoin. The guy should just keep HODL'ing it. It does not make any sense to trade it for a structurally deficient asset just because you are afraid of the volatility. He must have believed in it to begin with and over the years since he has held it through ups and downs already.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "gtke0b1",
                                    "author": "ChuckSlick007",
                                    "score": 1,
                                    "created_utc": 1617714966.0,
                                    "response": "You have no idea of the amount of risk your strategy holds. You think stocks are \"low risk\" only because you have not witnessed the carnage that can take place once the government gets out of the business of supporting them or just looses it's ability to rig markets. What we are witnessing now cannot continue indefinitely. The stock market most likely will decline 90% or so once the current manipulations run their course. While BTC goes to over a million per coin. Mark it.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "gto4p5y",
                                    "author": "tinycorperation",
                                    "score": 1,
                                    "created_utc": 1617787988.0,
                                    "response": "Index funds are a worse sharp ratio and worse risk adjusted returns. I would absolutely not sell. I am not a huge blind bitcoin bull but It’s possible bitcoin is a timely life raft from the negative effects of passive investing bubble we’ve created. I would personally not sell and I have 0 fear of regulation, it is equivalent to",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "gtk69hb",
                            "author": "Bigvagenergy",
                            "score": 2,
                            "created_utc": 1617710503.0,
                            "response": "Im trying to understand this. I get taking a loan against bitcoin as collateral so you don’t have to trigger a taxable event and get to keep your bitcoin (fantastic!) but if my plan was to liquidate some of my bitcoin holdings to pay off a student loan that’s been like an albatross, or buy a house and not have to pay a mortgage, how does this help me, I’m still making monthly payments?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "gv0d5hb",
                                    "author": "jefftopgun",
                                    "score": 1,
                                    "created_utc": 1618780219.0,
                                    "response": "Need a tax person, but there are rules that that limit tax exposure for paying student loans as well.  I got a break cashing in savings bonds to pay for student loans/education.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "gv0m0t9",
                                            "author": "Bigvagenergy",
                                            "score": 1,
                                            "created_utc": 1618784550.0,
                                            "response": "Oooh I need to\nLook into that",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "gtk2ggb",
                    "author": "saitamoshi",
                    "score": 7,
                    "created_utc": 1617707816.0,
                    "response": "If you end up cashing out just keep at least 1 coin just incase it goes to 1M 🤣",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gtkm8kb",
                    "author": "wgmmc",
                    "score": 2,
                    "created_utc": 1617718970.0,
                    "response": "Make sure you hire a fee-only certified financial advisor. They will not sell you products. They will help you allocate your investments too.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gtkznbq",
                    "author": "EarningsPal",
                    "score": 2,
                    "created_utc": 1617724950.0,
                    "response": "When you cash out, consider the rate you’re getting. Maybe you can do better OTC.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gtn9sjh",
                    "author": "ThomasMacVoy",
                    "score": 2,
                    "created_utc": 1617763511.0,
                    "response": "why the hell would you want to cash it all to invest in that obsolete shit?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "guexdfi",
                            "author": "Weary-Ad-352",
                            "score": 1,
                            "created_utc": 1618347377.0,
                            "response": "Omg 😹😹😹😹😹chill bro",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "gug3ugr",
                                    "author": "ThomasMacVoy",
                                    "score": 1,
                                    "created_utc": 1618369289.0,
                                    "response": ";)",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "gvw0umc",
                    "author": "Papa_Dabz",
                    "score": 2,
                    "created_utc": 1619405970.0,
                    "response": "Hodl",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gwluuco",
                    "author": "imbatman1212",
                    "score": 2,
                    "created_utc": 1619916020.0,
                    "response": "You hit the withdrawal button",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gtjjj7r",
                    "author": "emoneynati",
                    "score": 5,
                    "created_utc": 1617689899.0,
                    "response": "Maybe you already have and you gotta do what you gotta do but just in case, make sure you've done your research or maybe find a financial advisor. You don't have high income, bitcoin is still growing and expected to appreciate a lot, institutions are suddenly coming in as well, going to be buying up the supply, using it to  hedge inflation, etc .... who would *want* to cash out right now??\n\nReally hope you already have more than a million's worth, or you've worked out your plan on how much to keep holding.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gtjlhsf",
                    "author": "mcbergstedt",
                    "score": 5,
                    "created_utc": 1617691668.0,
                    "response": "If you move more than $10k at one time into a bank you'll get looked into. \n\nI would seriously set up a meeting with an accountant. Over $100k in \"gains\" you start to get into quarterly tax filing.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "gtjmbh5",
                            "author": "ohimanalabamagamer",
                            "score": 6,
                            "created_utc": 1617692443.0,
                            "response": "I moved $50K not that long ago oh god oh fuck lmao, i just have to pay the taxes though and its all good right? I wonder how hard they look... \n\nYeah that’s the plan, i’ll be talking to a CPA and tax attorney possibly in the coming weeks to figure it out.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "gtjmonc",
                                    "author": "mcbergstedt",
                                    "score": 3,
                                    "created_utc": 1617692793.0,
                                    "response": "It really just depends. If you haven't gotten a call or a letter I wouldn't worry about it.\n\nI do think it's funny that the government takes a cut of the money you gained from risking your skin",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "gtjn3ks",
                                            "author": "ohimanalabamagamer",
                                            "score": 4,
                                            "created_utc": 1617693185.0,
                                            "response": "Okay i think i’m good then lmfao, no letters or calls yet. \n\nThey gotta have their cut no matter what, essentially a gang of thieves. But i do not want to get locked in a cage for not paying up lol.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "gtkdpgk",
                    "author": "Netcoins-John",
                    "score": 5,
                    "created_utc": 1617714809.0,
                    "response": "Hi /u/ohimanalabamagamer,\n\nTwo most popular options that people use to cash out their cryptocurrency investments:\n\n* **On-exchange:** crypto exchanges offer the advantage of fast, reliable and secure transactions. Some of these exchanges trade in fiat currencies and allow you to link your bank account so you can withdraw directly. However, to increase withdrawal limits to a range adequate for large amounts of bitcoin you must provide personal information, which compromises anonymity. Slippage can also be an issue when cashing in on-exchange. (Some people divide their holdings between multiple exchanges to bypass daily limits. For example splitting between Coinbase, Kraken, and Netcoins (shameless plug).\n* **Off-exchange:** this type of trading happens directly between two people. There are two slight variations of this method: One is to trade with an over-the-counter (OTC) broker and the other one is peer-to-peer (p2p) trading. In both cases, you would be trading directly with a person. The difference is that the former is a professional crypto trader, while the latter is not. Off-exchange trading allows greater levels of anonymity, but you must be very careful who you trade with. The same anonymity that protects you also offers a layer of protection to scammers who may be after your bitcoin.\n\nAnd of course, it is always recommended to discuss your options with an accountant/lawyer (who understands crypto tax laws), to make sure you are safe and take advantage of all options available to you.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gtjd8py",
                    "author": "OpinionsAreUseless",
                    "score": 8,
                    "created_utc": 1617684769.0,
                    "response": "My own insignificant view, never exchange bitcoin for fiat currency unless its necessary!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "gtjkhkw",
                            "author": "ohimanalabamagamer",
                            "score": 15,
                            "created_utc": 1617690755.0,
                            "response": "I have more BTC this is just a chunk of it, so i’m not too worried. But thank you for the advice. I want to diversify, i’ve never had wealth like this before so i want some ‘real’ investments too.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "gtku5dm",
                                    "author": "BubblegumTitanium",
                                    "score": 7,
                                    "created_utc": 1617722521.0,
                                    "response": "I think you mean traditional investment. Bitcoin is real, there are terawatt hours of energy being pumped into it and an insane amount of brain power as well.\n\nI don't man, I would stay away from US equities, bonds and real estate. All of that is hugely overbought but its your money so you do with it what you like.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "gtjureo",
                            "author": "Supersymm3try",
                            "score": 8,
                            "created_utc": 1617700938.0,
                            "response": "The koolaid in this community man, yeah definitely never cash out literal life changing money because ‘fiat is a thing of the past man, BTC is the future and when it is compared as 1 BTC = 1 BTC we achieve nirvana. The sArCaStIc tExT LiKe tHiS is implied for all of  the above I hope.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "gtjhpus",
                    "author": "EternalLifeBeing",
                    "score": 2,
                    "created_utc": 1617688314.0,
                    "response": "I also have a noob question.\n\nWhat if i sell my bitcoin to other people? I send the bitcoin to their wallets then they give me the money in cash? Are they still going to tax me if they dont know i already sold my bitcoin for cash and didnt put it in a bank account?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "gtjj0h0",
                            "author": "CMDR_KingErvin",
                            "score": 14,
                            "created_utc": 1617689436.0,
                            "response": "As far as the irs is concerned any money you make, including ill gotten gains or even finding it on the sidewalk, is taxable. Now whether you disclose whatever you made is on you, but it is technically taxable income.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "gtji44v",
                            "author": "Wknibbs93",
                            "score": 6,
                            "created_utc": 1617688656.0,
                            "response": "I guess if they don't know then they don't know. However you do read about people getting scammed trading bitcoin for cash just person to person.\n\nHowever them not knowing doesn't mean they won't know somethings up. However I'm English so you know. The geography and all that shit.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "gtjjtr0",
                                    "author": "EternalLifeBeing",
                                    "score": 1,
                                    "created_utc": 1617690155.0,
                                    "response": "Yeah but if the person im selling bitcoin to is a good friend then i guess it will be fine?\n\nThe only problem left is that person now has a dirt on me because i think i just laundered money. I guess i just have to lick their feet so they wont tell the irs",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "gtjn4gt",
                                            "author": "BearCubDan",
                                            "score": 6,
                                            "created_utc": 1617693207.0,
                                            "response": "That's why you hide a gun with the serial number sanded off and some crack somewhere in their house. \n\nMutual Assured Destruction; it's not just for nuclear world powers anymore...thanks, Bitcoin.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "gtkudmo",
                            "author": "BubblegumTitanium",
                            "score": 3,
                            "created_utc": 1617722624.0,
                            "response": "if you buy a fancy sports car with it and flaunt your wealth, the IRS will eventually figure it out. \n\nIf you just Hodl it and use it to buy stuff here and there then its harder.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "gtjir30",
                            "author": "never_safe_for_life",
                            "score": 5,
                            "created_utc": 1617689208.0,
                            "response": "Nope, you have just successfully laundered money. Now stick it in a safety deposit box and only pull it out as you need it.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "gtjjt4b",
                                    "author": "francograph",
                                    "score": 9,
                                    "created_utc": 1617690139.0,
                                    "response": "Isn’t it simply tax evasion and not money laundering since the money wasn’t obtained illegally?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "gtjo4sz",
                                            "author": "never_safe_for_life",
                                            "score": 1,
                                            "created_utc": 1617694173.0,
                                            "response": "Yeah. Maybe money laundering for the guy selling you the cash",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "gtjj7tg",
                                    "author": "ohimanalabamagamer",
                                    "score": 1,
                                    "created_utc": 1617689615.0,
                                    "response": "👀",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "gtm9dze",
                            "author": "oldhodler",
                            "score": 1,
                            "created_utc": 1617744969.0,
                            "response": "Then you could be charged as an unlicensed money transmitter in addition to a tax evader, if you get caught. If it's just a few hundred dollars, they probably wont care. Thousands and they might.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "gtko1lb",
                    "author": "centinel20",
                    "score": 3,
                    "created_utc": 1617719787.0,
                    "response": "Don't sell. Just ask for a loan with the btc as collateral for a little portion of that. That is taxfree and as long as you can pay the interest your btc will keep apreciating making the loan very small. Then you can refinance and repeat the process just dont overleverage.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "gtkobvn",
                            "author": "centinel20",
                            "score": 1,
                            "created_utc": 1617719918.0,
                            "response": "https://youtu.be/Uvgg3j_uiVw",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "gtjjxak",
                    "author": "AnarchyHeart",
                    "score": 5,
                    "created_utc": 1617690242.0,
                    "response": "Why the sam hell would you do that? Stay. In. Btc.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "gtjlryo",
                            "author": "ohimanalabamagamer",
                            "score": 20,
                            "created_utc": 1617691934.0,
                            "response": "I am staying in with a lot more, this is just a chunk. I felt the need to diversify. If i lose all my bitcoin somehow I want some other money still. I’m still hodling a lot, i’ve gone like 7-8 years already i don’t plan on getting out fully lol.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "gtjjy3a",
                            "author": "Shakespeare-Bot",
                            "score": 0,
                            "created_utc": 1617690262.0,
                            "response": "Wherefore the sam helk would thee doth yond? stayeth.  In.  Btc\n\n***\n\n\n\n^(I am a bot and I swapp'd some of thy words with Shakespeare words.)\n\nCommands: `!ShakespeareInsult`, `!fordo`, `!optout`",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "gtjwibr",
                    "author": "goatsandhoes101115",
                    "score": 3,
                    "created_utc": 1617702669.0,
                    "response": "By posting your key/seed on reddit. It should be cashed out within a few minutes.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gtjqbqb",
                    "author": "Formal-Whereas-8494",
                    "score": 3,
                    "created_utc": 1617696365.0,
                    "response": "how abt hodl. world has just figured out this is a new asset class and u are getting out. just spend for what u need currently rest hodl",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gtkcmz2",
                    "author": "ChuckSlick007",
                    "score": 3,
                    "created_utc": 1617714248.0,
                    "response": " \"stable stocks/index funds\"...have you lost your mind?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gtjw96t",
                    "author": "needausernameyo",
                    "score": 3,
                    "created_utc": 1617702434.0,
                    "response": "Are you sure you want to do that? The stock exchange is going to tumble. Also Bitcoin is stable at this point.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gtjsxta",
                    "author": "elmira_kuzmina",
                    "score": 2,
                    "created_utc": 1617699060.0,
                    "response": "Use a reliable exchange. I would use Tap Global - they are also insured for up to $100m",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "gtjzda7",
                            "author": "babyishbrisk",
                            "score": 3,
                            "created_utc": 1617705287.0,
                            "response": "Here is also a good article Tap Global put together: [https://www.tap.global/how-to-cash-out-large-amounts-of-bitcoin](https://www.tap.global/how-to-cash-out-large-amounts-of-bitcoin) There are a few options: OTC Counters, Peer to Peer, Bitcoin ATM's or you can use the Tap Global app",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "gtkazfy",
                                    "author": "elmira_kuzmina",
                                    "score": 1,
                                    "created_utc": 1617713349.0,
                                    "response": "Yeah Ive seen it. Did you see their coin XTP is up over 30% in the last 24h? Wish I was holding more lol",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "gtjv794",
                    "author": "oiwot",
                    "score": 2,
                    "created_utc": 1617701391.0,
                    "response": "Talk to a reputable OTC (Over the Counter) desk or broker -- they exists specifically to deal with high value transactions.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gtkt4ki",
                    "author": "whatwhatwhichuser",
                    "score": 2,
                    "created_utc": 1617722066.0,
                    "response": "don't crash us bro",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gtktlig",
                    "author": "WH1PL4SH180",
                    "score": 2,
                    "created_utc": 1617722275.0,
                    "response": "At 13BTC, you should contact your exchange and go for an OTC deal. Not only do you lock and stop slippage, but you may be able to get a better than market rate.\n\nI wish I hadn't cashed out on my earlier mined coins.. but you know... sometimes you just really want a hotdog lol.\n\n&#x200B;\n\nGood luck in your future endeavours.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "guf0hov",
                            "author": "Weary-Ad-352",
                            "score": 1,
                            "created_utc": 1618348946.0,
                            "response": "😹😹😹😹",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "gtk4tgg",
                    "author": "Snoo_5681",
                    "score": 2,
                    "created_utc": 1617709538.0,
                    "response": "To be honest, I wouldn’t cash out if I were you. In a few years that could be worth over a million dollars. If you need to take some out, only take half, it’s worth keeping it in your wallet.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gtka4yz",
                    "author": "TheHonestNode1",
                    "score": 2,
                    "created_utc": 1617712873.0,
                    "response": "Why would you “cash out” of the scarcest asset ever known to man, for the worst shitcoin (fiat) ever?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gtjlai0",
                    "author": "bepismonke",
                    "score": 1,
                    "created_utc": 1617691480.0,
                    "response": "Go the police station and tell them how you got it... truthfully.\n\nI’m joking, just read the top comment.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gtk5nkr",
                    "author": "Bullish-Gal",
                    "score": 0,
                    "created_utc": 1617710101.0,
                    "response": "Why the hell do we need to  pay taxes for Bitcoin?!! Isn’t it decentralized?!! This sucks",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "gtkddnh",
                            "author": "irrelevantAF",
                            "score": 9,
                            "created_utc": 1617714639.0,
                            "response": "You don’t ‘pay taxes for Bitcoin’ - you  pay taxes on your income. For that it doesn’t matter if you invest into crypto and sell with a gain (you pay taxes on the gain), sell your time to your employer (you pay taxes on the salary) or if sell your feces in a jar and call it art and generate income with that.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "gtkuh3r",
                            "author": "BubblegumTitanium",
                            "score": 2,
                            "created_utc": 1617722668.0,
                            "response": "yes but meatspace is very centralized",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "gtka7pu",
                            "author": "StimulisRK",
                            "score": 4,
                            "created_utc": 1617712916.0,
                            "response": "guv'mnt gunna guv'mnt",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "gtjb4kr",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1617683270.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gtjmdt8",
                    "author": "Orlandogameschool",
                    "score": 1,
                    "created_utc": 1617692506.0,
                    "response": "Isnt this way BTC atms are for? Or do them only send BTC....",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "gtjmz62",
                            "author": "ohimanalabamagamer",
                            "score": 2,
                            "created_utc": 1617693069.0,
                            "response": "The only ones i’ve seen in my city let you deposit cash into a BTC account i think, im not sure i didn’t really trust them",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "gtjt8qk",
                    "author": "gemengelage",
                    "score": 1,
                    "created_utc": 1617699371.0,
                    "response": "I don't know how things work on your side of the pond (since you wrote IRS I'm assuming you're from the US), but it might pay off to consult your bank first, just to make sure your unusual transaction doesn't set off their anti-money-laundering mechanisms, effectively freezing your account.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gtk3shc",
                    "author": "BKat5",
                    "score": 1,
                    "created_utc": 1617708815.0,
                    "response": "7 hours ago good thing I caught ya early! You’re already a savvy player for making those huge crypto gains but before putting all that profit back into a fake system and fake money please consider reading into silver or some appealing dividend stonks",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gtkewck",
                    "author": "jonsta27",
                    "score": 1,
                    "created_utc": 1617715420.0,
                    "response": "You’re going to get so many scammers messaging you. Lol yea go YouTube “ trader university, bitcoin loan”. Great vid on how to take out a loan against btc so you’ll never have to sell it which is a big mistake in my opinion.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gtkod3s",
                    "author": "jkted562",
                    "score": 1,
                    "created_utc": 1617719933.0,
                    "response": "Eh if u take a loan it will it not be margin called when the price tanks?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "gtn97ab",
                            "author": "southofearth",
                            "score": 1,
                            "created_utc": 1617763183.0,
                            "response": "It will be",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "gtkqvye",
                    "author": "AnitaEkberg30",
                    "score": 1,
                    "created_utc": 1617721062.0,
                    "response": "Congratulations 🎊\n\nPlease consider leaving at least 1 BTC in your wallet if you don't need all of it, for old times sake 😊",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gtksw4i",
                    "author": "imandrev",
                    "score": 1,
                    "created_utc": 1617721959.0,
                    "response": "Don’t, it will be worth a lot more",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gtktcyh",
                    "author": "CyberMatrix87",
                    "score": 1,
                    "created_utc": 1617722169.0,
                    "response": "Buy and sell 8 Tesla's, problem solved. Yes if you're used to small deposits, and 750K hits your bank? I make good income, and just having a $50K random deposit had the bank call me. They mentioned how it sets off red flags and also any amount (maybe >$10K?) has to be reported for anti-laundering.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gtkvqiu",
                    "author": "FOXWOMB94",
                    "score": 1,
                    "created_utc": 1617723232.0,
                    "response": "hodl",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gtky8op",
                    "author": "LichtenbergFigyur",
                    "score": 1,
                    "created_utc": 1617724335.0,
                    "response": "Daaaaaang son!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gtls33j",
                    "author": "nini1423",
                    "score": 1,
                    "created_utc": 1617737366.0,
                    "response": "Just hodl. That amount of bitcoin will probably 10x in the next few years.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gtm9kd3",
                    "author": "realcoinsonly",
                    "score": 1,
                    "created_utc": 1617745052.0,
                    "response": "ur gonna be pissed when the stock market crashes and btc hits 100k.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gtk8hdv",
                    "author": "Unusual-Employ5478",
                    "score": 0,
                    "created_utc": 1617711895.0,
                    "response": "Is everybody jumping ship on bitcoin? I haven't even held it for one year, should I hurry and get out before 2022? I didn't barely have any games haha",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gtjq1hz",
                    "author": "-not-will-smith-",
                    "score": 0,
                    "created_utc": 1617696078.0,
                    "response": "Maybe try buying a property with btc, not sure if it's been done yet or even better a tesla, then sell it for fiat ?! \nNot sure if you'd be taxed on that as I'm from Aus\n\nOr you can deposit it to me and I'll send back I promise",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "gtm105u",
                            "author": "StressMission694",
                            "score": 2,
                            "created_utc": 1617741188.0,
                            "response": "You will still have to pay tax on the transaction. If you buy a Tesla, you will pay income tax to the IRS and State. You will also pay sales tax on the cay and the car will go down in value. The best way to buy the Tesla would to borrow against the bitcoin and buy the car. You will pay no income tax but still pay sales tax.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "gtksfbj",
                    "author": "JJRAMBOJJ",
                    "score": -1,
                    "created_utc": 1617721750.0,
                    "response": "yo man just give it to me i got u fam",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gtjpu0f",
                    "author": "Joemacklin643",
                    "score": 1,
                    "created_utc": 1617695864.0,
                    "response": "Buy physical items with the bitcoin, then sell for cash?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gtjy48a",
                    "author": "AngryGS",
                    "score": 1,
                    "created_utc": 1617704175.0,
                    "response": "I would withdraw in a non US crypto exchange so you won't trigger any tax event. transfer to cold wallet first",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gtl37b2",
                    "author": "mean_mistreater",
                    "score": 1,
                    "created_utc": 1617726496.0,
                    "response": "Good question here. I am not questioning if the OP wants to cash out or not. Most of us do have more or less BTC. If prices go up like predicted and lets say one BTC is 1 million USD. How would you cash out without raising any red flags? Mentioned a few times in this thread is that amounts higher than USD 10k would alarm the banks. But if I want to sell like 0,5 BTC which is maybe USD 500k then, how would I transfer this to my pocket? Currently I buy via Kraken and can also sell there. But I would never transfer too much to my bank account, not to make the IRS investigate on me. Because I know, those guys will come after me immediately if I do so. \n\nCash out via a BTC cash terminal? The fees will probably kill me.\nTransfer small amounts to my bank account via another bank account abroad? (cashing out to the other account and then transferring small unsuspicious amounts to my personal account)\nCash out to Paypal and transfer small amounts to my personal bank account?\n\nI would NOT like to have financial advisor to be involved here.\n\nHow is your strategy?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gtl45om",
                    "author": "groovy_mason",
                    "score": 1,
                    "created_utc": 1617726911.0,
                    "response": "Damn, I ignored crypto in those period of early 2010s and now I feel like kicking myself.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gtl62ge",
                    "author": "Capable-Ad7649",
                    "score": 1,
                    "created_utc": 1617727738.0,
                    "response": "Any pointers for children beginning bitcoin?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "gtn7m8l",
                            "author": "southofearth",
                            "score": 1,
                            "created_utc": 1617762322.0,
                            "response": "Get a parent to help you set up a coinbase acct in their name and learn how bitcoin market cycles work.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "gtlalck",
                    "author": "catsloveart",
                    "score": 1,
                    "created_utc": 1617729690.0,
                    "response": "I'm assuming you live in the US. There are a couple of states that don't have a state income tax. Before cashing out and incurring a state income tax penalty. \n\n\nConsider moving to one of those states or look into the Federal income tax situation in Puerto Rico or Guam or American Samoa and set up residency (usually 6 months) there.\n\nOnce residency is established, proceed with what ever plan you made.\n\nPeople forget that not all states have an income tax and it is worth exploiting.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gtlkac3",
                    "author": "DiamondGlans",
                    "score": 1,
                    "created_utc": 1617733922.0,
                    "response": "Just tell me before u cash out, so I can buy in the dips",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gtlnip3",
                    "author": "Electronic_Mess",
                    "score": 1,
                    "created_utc": 1617735350.0,
                    "response": "OP You need to look into Kraken!!! The fees are way way lower then Coinbase for that amount! Also you can move your BTC into kraken via crypto deposit and move it on to a stable chain there until your account is ready for withdrawal to your bank account. OP they have the cheapest fees for that quantity and a few great options for stable coins and unlimited deposit for crypto so you could set the account up and move everything on to a stable coin within the hour with them",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gtlo7yp",
                    "author": "kilobytecoin",
                    "score": 1,
                    "created_utc": 1617735660.0,
                    "response": "Niko, cousin! 🙂",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gtltamz",
                    "author": "Internal_Bill",
                    "score": 1,
                    "created_utc": 1617737882.0,
                    "response": "A nice problem to have, congratulations on your foresight in buying bitcoin early",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gtm21e9",
                    "author": "litcoinrus",
                    "score": 1,
                    "created_utc": 1617741642.0,
                    "response": "bitcoin is stable. don't pull it out for shitty stocks. and that IS financial advice",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gtm2j1v",
                    "author": "stormbella",
                    "score": 1,
                    "created_utc": 1617741852.0,
                    "response": "I don’t have any useful advice like the Others have given you. I just wanted to say congrats! That’s great  that you were able to make a good amount! That’s pretty awesome, and I’m giving you one of my special, rarely-given, high-fives. -high five-",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gtm2wut",
                    "author": "s0cket",
                    "score": 1,
                    "created_utc": 1617742020.0,
                    "response": "This guy needs to watch some Michael Saylor vids for sure. I've not met anyone who has been able to beat BTC trading stocks. Most people lose money the first 6-12 months they actively manage their portfolio. Also, I hope you don't have a real day job that requires any amount of dedicated attention. Trying to actively day trade and work a real job is terrible... I highly recommend not trying it. But that's just me.. some people can pull it off.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gtmhwbm",
                    "author": "danghunk312",
                    "score": 1,
                    "created_utc": 1617749171.0,
                    "response": "just exchange it all for Visa gift cards and avoid all of the taxes..",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gtmmshs",
                    "author": "Enki906",
                    "score": 1,
                    "created_utc": 1617751626.0,
                    "response": "Do it through Kraken, email them first. They will have dealt with many similar large transactions and will know what kind of problems you’re likely to face. Also congrats on holding for so long!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gtmn1n2",
                    "author": "update-yo-email",
                    "score": 1,
                    "created_utc": 1617751755.0,
                    "response": "Let me know when you’re about to sell I’ll buy some",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gtmohl3",
                    "author": "FinneganFred",
                    "score": 1,
                    "created_utc": 1617752488.0,
                    "response": "I think it would be a mistake to sell any significant amount if you don’t need to. Look at what analysts are saying about Bitcoin. Its projected to get to 100k or more by the end of the year.\n\nBy the way, it will be a taxable event when you sell and the normal capital gains rules apply. It’s not taxed immediately, you have to account for it on your annual return. Also if you transfer it directly to another coin, that is also a taxable event. It’s important to establish a cost basis, fees etc. are part of that. You should also get on Clubhouse and get into a Bitcoin group, lots of great advice there. Last thing, never tell anyone how much Bitcoin you have!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gtmrfl9",
                    "author": "mannyg001",
                    "score": 1,
                    "created_utc": 1617754006.0,
                    "response": "Really?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gtmuli1",
                    "author": "EnvironmentalPie5395",
                    "score": 1,
                    "created_utc": 1617755621.0,
                    "response": "Are you broke? Is the mob about to break your legs. Sell a little bit sure but lord hang on to most of it. When BTC is a million dollars in 5 years you will be so mad at yourself I am not sure you will ever get over it. Good luck",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "gu4njed",
                            "author": "Phucknhell",
                            "score": 1,
                            "created_utc": 1618127466.0,
                            "response": "If it's from 2013 the price was pretty low back then. he could easily have a couple of million even after cashing out. how much do you need?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "gtmuypg",
                    "author": "AmsuAsari",
                    "score": 1,
                    "created_utc": 1617755806.0,
                    "response": "Buy a house and put the rest back for property taxes. Or land and work to put a house or trailer on it. Land or property is the best investment you can make. Plus you can rent it out to people for passive income",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gtmw5fz",
                    "author": "spongebob_63",
                    "score": 1,
                    "created_utc": 1617756418.0,
                    "response": "Curious to know..what makes you decide on \"encashing\" your bitcoin? For reinvestment? Have you sought  information on what 750k is worth now and what the \"best\" investment to put that in that will yield more than what BTC could and can make of it? I would like to know too.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gtmxh17",
                    "author": "Royces_2xr",
                    "score": 1,
                    "created_utc": 1617757096.0,
                    "response": "Yeah anything over 10k or 15k will be taxed",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gtn273i",
                    "author": "BabydollPenny",
                    "score": 1,
                    "created_utc": 1617759478.0,
                    "response": "Has anyone any reviews about AMAZON on SEVEN.IO they accept bitcoin. I haven't used it .",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gtn4dvh",
                    "author": "nervecurve",
                    "score": 1,
                    "created_utc": 1617760600.0,
                    "response": "The long term capital gains tax (asset held more than one year) on $750,000 is zero if you made under $40,000 and you are single for 2020. I have not checked it for 2021, but I would be surprised if it has changed. If we are talking strictly earned income then it wouldn’t surprise me that the tax rate could as high as 37%, that would be without any deductibles.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "gua8b05",
                            "author": "rrib",
                            "score": 2,
                            "created_utc": 1618252764.0,
                            "response": "Disregard.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "gtn7ovo",
                    "author": "FinTechShark",
                    "score": 1,
                    "created_utc": 1617762360.0,
                    "response": "This is really informative thread. Thank you to all that have contributed. My takeaway so far is to buy more and plan to hold as long as possible. \n\nGood luck to all",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gtng5g4",
                    "author": "Big_Journalist_3473",
                    "score": 1,
                    "created_utc": 1617767244.0,
                    "response": "dayum thats wassup , congrats on having all that!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gtnr8wk",
                    "author": "Pale_Mixture_100",
                    "score": 1,
                    "created_utc": 1617775290.0,
                    "response": "You’re risk averse and yet you prefer to put your wealth into dollars? A third of the dollars in existence were printed in the last year. Real inflation is off the rails. That $750k will be melting away to no value over time. There’s a reason institutions are getting Bitcoin in their balance sheet. They don’t want to be the sucker holding the bag of dollars. \n\nDo some research on Bitcoin vs USD before you make a decision you regret for the rest of your life, your children’s lives, and for generations to come. You own more than .01% of the worlds population ever will.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gtp2xoa",
                    "author": "MoreDecentral",
                    "score": 1,
                    "created_utc": 1617808533.0,
                    "response": "Suggestions:  \n1. If Coinbase offers OTC services, you should use OTC to minimize your price impacts.  Typically OTC services require min. transaction size of $100K.  \n\n\n2. Give your bank a heads-up. Tell them you are selling bitcoin on a reputable exchange with KYC and AML in place.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gtp56fx",
                    "author": "Admirable_Ad1430",
                    "score": 1,
                    "created_utc": 1617809519.0,
                    "response": "Why would you cash out? Send it to Celsiusnetwork and borrow against your crypto for 1%",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gtp5ywp",
                    "author": "ruimachadooo",
                    "score": 1,
                    "created_utc": 1617809859.0,
                    "response": "Move to Portugal where you dont get taxed on your crypto gains and take your hands on the whole profit. With that amount of money you are a millionaire there and you can retire already with a good lifestyle for the rest of your life.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gtt7yik",
                    "author": "Elize86",
                    "score": 1,
                    "created_utc": 1617890631.0,
                    "response": "Please get a proper advise, you could crash the amount of you change it all at once find a big party who is willing to buy an amount for a good price for both parties but beware that fiat money will be worth much less so find a financial advisor to go about it",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gtunshw",
                    "author": "megazach",
                    "score": 1,
                    "created_utc": 1617912986.0,
                    "response": "This would be the smartest way since you’re up a ton of money, Do that and put it in the stocks that you want. But once Bitcoin goes in to a bear market and it drops to low prices you should switch it back. If Bitcoin ever drops hard again of course.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gu4n99x",
                    "author": "Phucknhell",
                    "score": 1,
                    "created_utc": 1618127197.0,
                    "response": "Generally, you withdraw to your local account, but you make sure to separate the taxable component of that amount, and when you put the amount you have made on your taxes, they will send you a bill. then you pay with the separated amount. You haven't done anything wrong by receiving a bunch of money, but i'm sure there will be flags popping up somewhere at the IRS when you do, so make sure you're paying the tax on it. they will already be expecting you to when you file. Perhaps see a tax accountant. they should be able to tell you how much you need to set aside. good luck!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gu6jt0x",
                    "author": "rrib",
                    "score": 1,
                    "created_utc": 1618172758.0,
                    "response": "\\[This post applies to the U.S.\\] If you sell bitcoins at a profit in 2021, you will report those capital gains on your 2021 tax year return when you file in 2022.  Since you want to take some money off the table now, sell some of your btc on Coinbase Pro and send the money to your bank.  Next year, when the time comes to calculate the capital gains for your 2021 tax return, you will need records of your purchase amounts and prices, and your sell amounts and prices.  I've been doing my own btc taxes for years without any help from an accountant.  I import my transaction records from the exchange where I buy and sell (in my case, I use Coinbase) into tax software.  I prefer bitcoin(dot)tax, you can use whichever tax software your prefer but it's best to use one that can import data directly from your exchange.  And the reason I say this is because capital gains calculations get very complicated very quickly, especially if you've made lots of transactions.  Let tax software do the calculation for you.   After you import your exchange data and run it through tax software, you will take the resulting Form 8949 and enter it on Schedule D of your 1040.  Note:  if you did all your buying and selling on Coinbase, you only need to import Coinbase data; but if you bought some of your coins on a different exchange, you're also going to need to import the data from that exchange.  You need the records of \\*all\\* your past transactions.  If your profit-taking this year involves selling coins you bought in 2013, you will have to import tx info from 2013 and any other years you made trades.  If there are transactions you don't have  a record of, like in-person cash buys, just put down whatever you remember or estimate the amounts and prices as well as you can.  From your post I'm assuming you will actually have an accountant do your taxes, but you really need to know how it all works, seriously everybody who realizes capital gains needs to know this stuff.  As for scaring the IRS with big money transfers, I'd say they're just going to be glad to take your tax money.  Dot your I's and cross your T's at tax time and you'll have no trouble.  Hiring a good accountant is an insurance policy in that regard.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gu8i910",
                    "author": "Symbioticlabs",
                    "score": 1,
                    "created_utc": 1618218283.0,
                    "response": "May I also recommend getting a crypto debit card and sending some BTC to the exchange that the card is associated with. From there you can maintain some of your investment while also spending the money. I would assume you should sill consider tax implications.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gu9gx8v",
                    "author": "Acceptable-Sort-8429",
                    "score": 1,
                    "created_utc": 1618240805.0,
                    "response": "That's what I use to imagine",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "guc0gmp",
                    "author": "HotHustleLLC",
                    "score": 1,
                    "created_utc": 1618284756.0,
                    "response": "Cash out a K a week. That's extra money in your bank. Keep the rest in. That 750,000 will 50x by the end of the year. Why cut yourself short of being a millionaire, when you could be a multi millionaire",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gujty9s",
                    "author": "teegolf1",
                    "score": 1,
                    "created_utc": 1618445881.0,
                    "response": "This is why you buy GBTC with your Roth IRA—- no future tax concerns.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gujxpyq",
                    "author": "BlackNight305",
                    "score": 1,
                    "created_utc": 1618447801.0,
                    "response": "Send it to me. I’ll cash it out for you lol.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "guuykhz",
                    "author": "ahmedaisar",
                    "score": 1,
                    "created_utc": 1618672127.0,
                    "response": "Congrats bro. Interested to own a pvt luxury resort in Maldives?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gv13dve",
                    "author": "_Triiton",
                    "score": 1,
                    "created_utc": 1618793599.0,
                    "response": "Beware of scammers contacting you on pm’s",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gv5e5r3",
                    "author": "Steven-_-man7",
                    "score": 1,
                    "created_utc": 1618879927.0,
                    "response": "IRS is going to make you pay capital gain taxes.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gv8kwu3",
                    "author": "BraskSpain",
                    "score": 1,
                    "created_utc": 1618946643.0,
                    "response": "Are you sure you want to cash out so early?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gv8uy5n",
                    "author": "FederalPass7511",
                    "score": 1,
                    "created_utc": 1618950860.0,
                    "response": "Hodl it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gv8vcj3",
                    "author": "FederalPass7511",
                    "score": 1,
                    "created_utc": 1618951022.0,
                    "response": "Must be crazy. Hodl Hodl Hodl never sell that amount of BTC. If you sell or invest on anything else in 10years you'll be gutted at how much you lost.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gv8vsww",
                    "author": "FederalPass7511",
                    "score": 1,
                    "created_utc": 1618951210.0,
                    "response": "Go to the police station and tell them your having a breakdown. Otherwise Hodl",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gveop7c",
                    "author": "novicepassinvestor",
                    "score": 1,
                    "created_utc": 1619063806.0,
                    "response": "Check out Deferred sales trust - its where you defer taxes until you ready to use it but keep all the $ to be invested to your choosing",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gvh8i86",
                    "author": "Ok_Calligrapher_6889",
                    "score": 1,
                    "created_utc": 1619118499.0,
                    "response": "You buy physical gold and silver paper bubble will be popping soon",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "gvh8jc4",
                            "author": "Shakespeare-Bot",
                            "score": 1,
                            "created_utc": 1619118513.0,
                            "response": "Thee buyeth physical gold and silv'r pap'r bubble shall beest popping anon\n\n***\n\n\n\n^(I am a bot and I swapp'd some of thy words with Shakespeare words.)\n\nCommands: `!ShakespeareInsult`, `!fordo`, `!optout`",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "gvim7st",
                    "author": "Local_Leadership_916",
                    "score": 1,
                    "created_utc": 1619141532.0,
                    "response": "A bank",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gvniejf",
                    "author": "Boondocker66",
                    "score": 1,
                    "created_utc": 1619242431.0,
                    "response": "Look into Real Estate Opportunity Zone Funds, great for allegedly deferring Capitol gains taxes by investing into them check out Qualified Opportunity Zones at irs.gov it will also explain what qualifies. Congrats and good luck.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gvqgyfv",
                    "author": "agargodyt",
                    "score": 1,
                    "created_utc": 1619288701.0,
                    "response": "Send it to this BTC address I’ll send u a DM just throw in 100k I’m good",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gvvtruu",
                    "author": "FinancialSituation11",
                    "score": 1,
                    "created_utc": 1619401905.0,
                    "response": "Your bank might have a conniption, but the IRS is going to love you.....",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gvyyplp",
                    "author": "555soul1989",
                    "score": 1,
                    "created_utc": 1619468321.0,
                    "response": "sell it",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gw5iojc",
                    "author": "OceanFreeExplorer",
                    "score": 1,
                    "created_utc": 1619601197.0,
                    "response": "Move to an income tax free country and set up a USD bank account and move it to there and retire....",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gw6v3mi",
                    "author": "IndependenceGlum4141",
                    "score": 1,
                    "created_utc": 1619628222.0,
                    "response": "Sure, IRS rep.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gw7ffo9",
                    "author": "CarmiacArrest",
                    "score": 1,
                    "created_utc": 1619636695.0,
                    "response": "You don't. I'd never do that anyway. Get a LOC on your portfolio instead.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gwbivdl",
                    "author": "bs_is_everywhere",
                    "score": 1,
                    "created_utc": 1619716861.0,
                    "response": "Why not just park your money in USDC. Visa is releasing a card backed by USDC. Also you can take your USDC, deposit it into a good DEX and reap upto 10% interest as income.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gwc1cuu",
                    "author": "Non_typical_me",
                    "score": 1,
                    "created_utc": 1619724202.0,
                    "response": "With a huge grin on your face?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gwc1cv7",
                    "author": "Non_typical_me",
                    "score": 1,
                    "created_utc": 1619724202.0,
                    "response": "With a huge grin on your face?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gwda6rr",
                    "author": "alexeroberts",
                    "score": 1,
                    "created_utc": 1619744027.0,
                    "response": "You don't",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gwi9g9m",
                    "author": "JackFerox",
                    "score": 1,
                    "created_utc": 1619841805.0,
                    "response": "Lol for real?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gwlyyyd",
                    "author": "a56z",
                    "score": 1,
                    "created_utc": 1619918331.0,
                    "response": "In some countries cryptos aren’t taxed. Moving there could be a $100k+ saving..",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gwmaf2h",
                    "author": "JuanldTrump",
                    "score": 1,
                    "created_utc": 1619925020.0,
                    "response": "become an expat and withdraw or reinvest physically in a country with lower capital gains. Caymans, or New Zealand if you really have that much to eat in Tax it would be worth it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gwsg6ky",
                    "author": "Darffydduck",
                    "score": 1,
                    "created_utc": 1620054115.0,
                    "response": "\nSafeBANK phase 2 is selling fast on PancakeSwap trust wallet . Invest guyshttps://bscscan.com/token/0x2aB90FBb649bA3DDD4269764eb2975d8F32b7b5a",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gwux1o2",
                    "author": "Psychological-Gas992",
                    "score": 1,
                    "created_utc": 1620093647.0,
                    "response": "Look up Clinton Donnelly. Hes a crypto tax specialist. His team can help you.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}