{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "utccyk",
            "title": "daytrading btc",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/utccyk/daytrading_btc/",
            "author": "Alapac0",
            "created_utc": 1652991925.0,
            "score": 0,
            "num_comments": 28,
            "subreddit": "BitcoinBeginners",
            "selftext": "whats a good and safe site for beginners to start on for daytrading. i dont want to verify my id but if i have to ig i will talk to my mom and dad about it\n\n&#x200B;\n\nThank you",
            "stickied": false,
            "comments": [
                {
                    "id": "i995ct4",
                    "author": "Narmotur",
                    "score": 18,
                    "created_utc": 1652996902.0,
                    "response": "Don't day trade, and don't day trade if you have to talk to your mom and dad about opening an account, jesus christ.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9d2nqj",
                            "author": "The_JoshGausden_Scam",
                            "score": 1,
                            "created_utc": 1653072772.0,
                            "response": "Lol",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9hti4g",
                            "author": "korvanc",
                            "score": 1,
                            "created_utc": 1653168948.0,
                            "response": "I was screaming this too. Lol!!!What you should be talking to your mom and dad about include stuffs like playing family games. Y’all can definitely try playing Family Feud on the Gamestar+ edition. Day trading is definitely not for you! Lol",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i995k05",
                            "author": "Goofy_AF",
                            "score": -8,
                            "created_utc": 1652996993.0,
                            "response": "Don't tell people what to do with their lives, even if they're kids",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i995sfw",
                                    "author": "Narmotur",
                                    "score": 12,
                                    "created_utc": 1652997095.0,
                                    "response": "Don't tell me what to do with my life.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i99a1rm",
                    "author": "bitusher",
                    "score": 5,
                    "created_utc": 1652999073.0,
                    "response": "Most people will lose money day trading due to these reasons\n\nhttps://www.reddit.com/r/BitcoinBeginners/comments/c4zpw9/what_are_the_steps_to_trading_bitcoin/erzkfmm/\n\nThis study shows that 97% of traders lose money\n\nhttps://papers.ssrn.com/sol3/papers.cfm?abstract_id=3423101\n\nWiser to invest long term , stack those sats , and use bitcoin to save money",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9aot6d",
                    "author": "DavLithium",
                    "score": 3,
                    "created_utc": 1653026686.0,
                    "response": "I tried daytrading, i made a little profit for a few days then had the genius idea to maximize my profits with the binance future trading leverage. So i went on 20x leverage trading btc for a few days. The price seemed to fluctuate between 29-31k for a while so all i had to do was short it at 31k and long it 29k, worked great for a whooping 2 days, then the third i longed btc 20x leverage at 29k only it didnt go up it went to 26k but i got liquidated at 27.8k and there it went all the winning and the initial profit. After that its a spiral that u need to win back what u lost and more. I never touched my main btc stash and i used a very small amount to do this daytrading stuff so it didnt hurt much but it gave me a full picture of what happens. U work hard for those small wins and can lose them in one bad trade, if u think to implement stop orders to cut your losses u will get rekt by fees. Bottom line DCA and hodl dont daytrade dont leverage trade.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9bwjlg",
                            "author": "davidkolesanov",
                            "score": 1,
                            "created_utc": 1653055425.0,
                            "response": "Many don’t do well day trading because of leverage",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i98vi8d",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1652991925.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i995ndg",
                    "author": "bitcoin_barry",
                    "score": 1,
                    "created_utc": 1652997034.0,
                    "response": "This isn't really a forum for day trading.\n\nBitcoin isn't a daytrading platform, it is merely an asset that you can learn about and obtain. If you wish to use it for day trading, you are dealing with Bitcoin + other things (we call them shitcoins for a reason).\n\nWe call daytrading platforms \"casinos\". But yea, you might have better luck on another subreddit :)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9brp5z",
                    "author": "WutruCrypto-",
                    "score": 1,
                    "created_utc": 1653053336.0,
                    "response": "Just play long term, DCA a certain amount every week into bitcoin and enjoy every free hour you don’t have to sit behind a chair and watch charts",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9c8rjb",
                    "author": "DudeIncogneto",
                    "score": 1,
                    "created_utc": 1653060360.0,
                    "response": "Trading bitcoin is a good way to get wrecked",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9d2msr",
                    "author": "The_JoshGausden_Scam",
                    "score": 1,
                    "created_utc": 1653072759.0,
                    "response": "All i can say… just be careful man! Good luck!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9dbzv5",
                    "author": "Psychological-Ad212",
                    "score": 1,
                    "created_utc": 1653077025.0,
                    "response": "Try popular exchanges like Binance, but all these kinds of exchanges requires you to so verification because the money you are trading is entirely dependent on you and you cant blame your mentor for your losses, try using TradingView platform as it offers Paper Trading account where you use hypothetical money using real market data and get comfortable there.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9g3l5h",
                    "author": "Senior-Drama-1781",
                    "score": 1,
                    "created_utc": 1653139240.0,
                    "response": "Only way to make money day trading is good strategy + perfect risk management / RR good",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9vedl9",
                    "author": "Pairywhite3213",
                    "score": 1,
                    "created_utc": 1653436458.0,
                    "response": "Since you are still a beginner, day trading is not an ideal one. I recommend you stick to the long term until you develop a good strategy. I started with weekly and DCA into Bitcoin in 2017 and it was done without stress as I was investing only what I can afford to lose. While you do so, dedicate some time to reading, and balance it with some fun game nights with your family. I recommend you try out the newly launched Family Feud game on GameStar+. My family and I love playing it over the weekend. You will get there with time.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9cxr7y",
                    "author": "Stunning-Ad-1208",
                    "score": 0,
                    "created_utc": 1653070482.0,
                    "response": "For the newbie if you are actually trading in the crypto space and you don't have a sound mentor. Then you are certainly going to get liquidated in 90% of your trades.  Yeah that's the sad truth. For a start you need a good and experienced hand to guide you. Trust me, trading isn't difficult as we see it. With the right Signals and guide, you can earn hugely monthly.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}