{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "usf7un",
            "title": "Was going through old e-mails and found the status of one of my first BTC purchases. HODL! (but use self custody)",
            "url": "https://i.redd.it/jkrby6mj39091.png",
            "author": "vvillehelm",
            "created_utc": 1652886894.0,
            "score": 1,
            "num_comments": 0,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "usfauo",
            "title": "Bitcoin Movie: Bit X Bit | In Bitcoin We Trust | Cryptocurrencies | Docu...",
            "url": "https://youtube.com/watch?v=JQB0CiT08Bk&feature=share",
            "author": "Inevitable_Ad2570",
            "created_utc": 1652887128.0,
            "score": 2,
            "num_comments": 2,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i92zp85",
                    "author": "Inevitable_Ad2570",
                    "score": 1,
                    "created_utc": 1652887170.0,
                    "response": "Bitcoin Movie: Bit X Bit | In Bitcoin We Trust | Cryptocurrencies | Documentary by the creators of MOTBTC... #motbtc u/motbtc",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "usf4k7",
            "title": "Propagation of bitcoin transactions",
            "url": "https://www.reddit.com/r/Bitcoin/comments/usf4k7/propagation_of_bitcoin_transactions/",
            "author": "Admirable-Dark4543",
            "created_utc": 1652886634.0,
            "score": 0,
            "num_comments": 6,
            "subreddit": "Bitcoin",
            "selftext": "Hello everyone, lately I have been asking myself this question : what if the internet stopped working, would there be a possibility to propagate transactions in the bitcoin network without internet ? For example on another medium such as phone or sms ?",
            "stickied": false,
            "comments": [
                {
                    "id": "i93aane",
                    "author": "Nada_Lives",
                    "score": 3,
                    "created_utc": 1652891487.0,
                    "response": "This has been discussed exhaustively over the past twelve years. Do some minimal reading first.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i92z3en",
                    "author": "ChillAx-",
                    "score": 1,
                    "created_utc": 1652886920.0,
                    "response": "Nope, if I’m correct Bitcoin transactions require https, TCP/IP to share the data in peer to peer. \n\nIn other words, no internet no Bitcoin. However there are satellite nodes around the planet hosting a copy of the Bitcoin blockchain… goood luck to kill bitcoin by killing the internet ;)",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i935p1w",
                            "author": "Admirable-Dark4543",
                            "score": 0,
                            "created_utc": 1652889612.0,
                            "response": "Mmmh okok, but i find this https://news.bitcoin.com/no-internet-no-problem-how-to-send-bitcoin-by-amateur-radio/",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i939z3r",
                                    "author": "Nada_Lives",
                                    "score": 1,
                                    "created_utc": 1652891356.0,
                                    "response": "There's always sneakernet.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i93in6u",
                                    "author": "Wilynesslessness",
                                    "score": 0,
                                    "created_utc": 1652894828.0,
                                    "response": "Bitcoin is math. Transactions are sending messages. You do not need the internet to perform math or send messages.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "id": "usf6an",
            "title": "inflation trap",
            "url": "https://www.reddit.com/r/Bitcoin/comments/usf6an/inflation_trap/",
            "author": "JimBloc",
            "created_utc": 1652886768.0,
            "score": 13,
            "num_comments": 21,
            "subreddit": "Bitcoin",
            "selftext": "This down trun in btc is because they are putting interest rates up.\nProblem is, companies have been borrowing money and buying back  shares in the companies themselves, pushing the share price up and in return getting bonuses for themselves. This will no longer be feasible, so people will pull money out shares.. The rich get poorer and companies would go broke.. Your government is not going let this happen.. \nThey'll put rates up for short time, then they'll go back low rates and more money printing to back up the stock market. The stock will go up and money will devalue long term. \nSo keep your money in bitcoin",
            "stickied": false,
            "comments": [
                {
                    "id": "i92zvpz",
                    "author": "AnonFor99Reasons",
                    "score": 7,
                    "created_utc": 1652887242.0,
                    "response": "Agreed. By summer when the economy starts melting down,  they'll soften their talk.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9327j7",
                    "author": "JimBloc",
                    "score": 3,
                    "created_utc": 1652888190.0,
                    "response": "Well the stock market is a wealth transfer mechanism now anyway, the politicians and rich have vested interest in printing money, creating inflation (hidden tax) and moving into hands of top 10 percent. Then this will be cashed in for real assets, land, houses and there's still more milking of the under class to be done before they let the whole thing implode.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9359d3",
                            "author": "outdatedrhombus",
                            "score": 2,
                            "created_utc": 1652889436.0,
                            "response": "You know you can buy stocks yourself right? In fact you probably own a bunch of stocks in your pension plan even if you're unaware of it.\n\nStop pretending like the bad central bankers have it in for you. I'd also love to know what the vested interest they supposedly have for moving wealth to the top 10% is",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i937o4y",
                                    "author": "JimBloc",
                                    "score": 3,
                                    "created_utc": 1652890426.0,
                                    "response": "Believe it not not everyone has a pension to start, I'm one them, and poor people don't have a stock portfolio or exter money to invest in shares. They mostly make money to pay bills.. But you'll find most your politicians do.. So yes they do have a vested interest, sometimes in the mlions",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i93z50c",
                                            "author": "whitslack",
                                            "score": 2,
                                            "created_utc": 1652901521.0,
                                            "response": ">poor people don't have a stock portfolio or extra money to invest in shares.\n\nWhy not? Quit drinking alcohol and smoking cigarettes and put that money into investments. Eat more fresh produce and fewer preprocessed foods, and put the savings into investments. Cancel your streaming service subscriptions, and put that money into investments. Move into a smaller, humbler home and take a roommate, and put the savings into investments.\n\nIt's not about not having \"extra money.\" It's about learning to live frugally. The difference in personality between a rich person and a poor person largely comes down to a difference in time preference.\n\nNow, let the downvoting commence!",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i93i91u",
                                            "author": "outdatedrhombus",
                                            "score": 1,
                                            "created_utc": 1652894669.0,
                                            "response": "So riddle me this, if someone doesnt have extra money to invest in shares how is one supposed to buy bitcoin?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i96inzi",
                                                    "author": "JimBloc",
                                                    "score": 1,
                                                    "created_utc": 1652950397.0,
                                                    "response": "Because bitcoin is a available to people living anywhere with no address or social numbers most importantly a bank account to put your money into after your financial advisor down beside the waterhole next to the dead cow makes you millions on stock trading.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i93bst9",
                    "author": "TheGreatGreg81",
                    "score": 1,
                    "created_utc": 1652892089.0,
                    "response": "At the moment btc is inflating faster than USD or Eur, so i guess your argument is totally valid",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i93hjmp",
                            "author": "JimBloc",
                            "score": 3,
                            "created_utc": 1652894387.0,
                            "response": " over long term its a deflationary currency, and will become more so with halfing, and lost coins, this is without additional demand.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i943vv8",
                                    "author": "yearnlearning115",
                                    "score": 1,
                                    "created_utc": 1652903441.0,
                                    "response": "That assumes liquidity is constant though -- there are many meme ERC 20 tokens that are \"deflationary\" but after a quick spike they fizzle to zero because of the lack of liquidity.\n(I generally am long term bullish on BTC but liquidity is a major equation in price, not just demand)",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i94jffj",
                                            "author": "JimBloc",
                                            "score": 0,
                                            "created_utc": 1652909898.0,
                                            "response": "There's always going people that liquidate or sell in down trun, for different reasons.. but fundamentally I believe after each boom, you are left with percentage of the new comes that join the ranks long term holders, theyll never sell, each cycle adds new long term holders and a higher price,, This is why it never returns to low levels seen before the last up trun or boom. Its why I don't care about crashes anymore.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i931613",
                    "author": "lgieg",
                    "score": 1,
                    "created_utc": 1652887760.0,
                    "response": "Good summary. Corrupt financial oligarchs are running this shit show , buying Bitcoin now",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i933prx",
                    "author": "Xen7963",
                    "score": 1,
                    "created_utc": 1652888804.0,
                    "response": "I agree but no one knows how long the pain will last before that happen.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i939sw0",
                            "author": "Nada_Lives",
                            "score": 1,
                            "created_utc": 1652891288.0,
                            "response": "What if it has already happened, and they just haven't told you?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i93aeha",
                                    "author": "Xen7963",
                                    "score": 1,
                                    "created_utc": 1652891529.0,
                                    "response": "At least you will know when they QE and lower rates.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i95pqo6",
                    "author": "udevil2",
                    "score": 1,
                    "created_utc": 1652929590.0,
                    "response": "So if the government will print more money for stock market, shouldn’t you just buy stocks? It’s like you did this whole analysis (which I don’t agree with but that’s besides the point) and in the end you just snuck in “keep money in bitcoin” after literally saying stock market will get pumped up",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9610en",
                            "author": "Lolfcklol",
                            "score": 1,
                            "created_utc": 1652936126.0,
                            "response": "Why not both?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "usf1sv",
            "title": "Food for thought......",
            "url": "https://www.reddit.com/r/Bitcoin/comments/usf1sv/food_for_thought/",
            "author": "Godson91018",
            "created_utc": 1652886419.0,
            "score": 2,
            "num_comments": 15,
            "subreddit": "Bitcoin",
            "selftext": "This forum is filled with persons \"not liking\" traditional banking, but hear me out and I know i'll get hammered for this. What if there was a way to adopt both, accept both.......It wont be such a bad thing.",
            "stickied": false,
            "comments": [
                {
                    "id": "i934aum",
                    "author": "llewsor",
                    "score": 2,
                    "created_utc": 1652889044.0,
                    "response": "they will both exist though traditional banking will have a lot less influence than it does currently as more nations add bitcoin to their treasuries and make it legal tender and banks start to add more bitcoin financial products and services. \n\nas saifdean ammous said bitcoin is like a monetary batman lurking in the shadows of the financial system to keep the bankers and government honest whenever they try to overstep their authority.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i94eeod",
                            "author": "solomonsatoshi",
                            "score": 1,
                            "created_utc": 1652907750.0,
                            "response": "Agree BTC at least brings a competitive market by providing an alternative.\n\nCompetition is healthy.\n\nIf the government try to ban Bitcoin they are admitting their fiat shitcoin cannot compete with a superior alternative, as China has already done...",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i93amit",
                    "author": "Nada_Lives",
                    "score": 2,
                    "created_utc": 1652891621.0,
                    "response": "The two payment systems co-exist right now. Anything to add? No.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i93t7bl",
                            "author": "Godson91018",
                            "score": 1,
                            "created_utc": 1652899084.0,
                            "response": "Correction it exist with ALOT of resistance on the crypto side of things.......imagine if it didnt. A globally accepted hybrid.  Expand your vision like you do the BTC charts. It may work and is the more likely avenue the Gov. will go in the future.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i93vndu",
                                    "author": "Nada_Lives",
                                    "score": 1,
                                    "created_utc": 1652900090.0,
                                    "response": "The public now has a choice. It wasn't allowed one twelve years ago.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i92zk1s",
                    "author": "solomonsatoshi",
                    "score": 1,
                    "created_utc": 1652887111.0,
                    "response": "There is no choice in terms of fiat monetary systems.\n\nThey are imposed, by force, by governments.\n\nBitcoin has provided an alternative...because fiat money is a bad thing that only survives due to its state imposed monopoly.\n\nCurrently they do co exist but there is a natural tension in that co existence as demonstrated by the ongoing obstruction of Bitcoin adoption in most jurisdictions because BTC reduces the ability of governments and bankers to steal from citizens via debasement.\n\nSo the two can co exist but there is an inherent tension in that co existence.\n\nThe tension between the individuals freedom of choice to access and enjoy monetary integrity, and state/banker imposed fiat debt slavery.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9310vy",
                            "author": "GrabOk460",
                            "score": -2,
                            "created_utc": 1652887702.0,
                            "response": "Say for example bitcoin takes over fiat as the worlds currency, if you don’t think it’ll then become monopolised the same way as fiat is currently then you’re living in a fantasy world",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i93d43s",
                                    "author": "averagewokehuman",
                                    "score": 2,
                                    "created_utc": 1652892608.0,
                                    "response": "But then whoever has the most can’t dilute the currency by making more making everyone at the bottom have less.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i968j1r",
                                            "author": "GrabOk460",
                                            "score": 1,
                                            "created_utc": 1652941583.0,
                                            "response": "Yeah that makes sense, I just can’t see the government allowing it to replace fiat, they’d lose too much money and that’s all they care about",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i96ij5x",
                                                    "author": "averagewokehuman",
                                                    "score": 1,
                                                    "created_utc": 1652950271.0,
                                                    "response": "They can’t control it. Anyone with an internet connection can send it. All they can do is threaten violence and say Bitcoin is worthless.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i93dzzq",
                                    "author": "wkw3",
                                    "score": 2,
                                    "created_utc": 1652892961.0,
                                    "response": "You believe that a private central bank will be given control over the issuance of Bitcoin?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i968mxm",
                                            "author": "GrabOk460",
                                            "score": 1,
                                            "created_utc": 1652941670.0,
                                            "response": "I don’t as I don’t believe it will replace fiat, but I’m talking about the theories I keep reading where people say it will, I just don’t see that happening",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i94e1n3",
                                    "author": "solomonsatoshi",
                                    "score": 0,
                                    "created_utc": 1652907602.0,
                                    "response": "If you believe that is inevitable you are a defeatist bankers cartel apologist cuck.\n\nLong live the revolution!",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i968fsj",
                                            "author": "GrabOk460",
                                            "score": 1,
                                            "created_utc": 1652941509.0,
                                            "response": "No it’s called being realistic, i love the idea and philosophy behind bitcoin but I can’t see government allowing it to replace fiat. I’m more than open to hear theories and information but if all you’re going to do is hurl insults then I’m not interested in talking :)",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "id": "usfaye",
            "title": "Pickhardt Payments - 60 million sat payment sent through lightning network!",
            "url": "https://twitter.com/renepickhardt/status/1526305264420499457?s=20&t=u95yEVeAu71LERnQSyo28Q",
            "author": "turick",
            "created_utc": 1652887136.0,
            "score": 216,
            "num_comments": 86,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i933m4z",
                    "author": "llewsor",
                    "score": 28,
                    "created_utc": 1652888763.0,
                    "response": "damn rene is too good for this world ⚡️",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93zik0",
                    "author": "BlueberryDefender",
                    "score": 22,
                    "created_utc": 1652901670.0,
                    "response": "Can someone ELI5 the significance of this? Isn’t the lightning network already operational? Does this no longer require channels? Thanks in advance",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i940tr8",
                            "author": "slvbtc",
                            "score": 63,
                            "created_utc": 1652902204.0,
                            "response": "Previously one transaction was sent through one channel which limited the size of the transactions possible because of channel liquidity. Essentially the lightning network was only useful for small transactions.\n\nWhat Rene has managed to create is a method where a large transaction can be broken up in tens or hundreds of smaller transactions all taking different routes through the lightning network and ending up recombining as one transaction at its destination.\n\nThis is a big deal as now even large transactions can be sent over lightning.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i94g00t",
                                    "author": "Ima_Wreckyou",
                                    "score": 40,
                                    "created_utc": 1652908426.0,
                                    "response": "Multipath payments where already a thing before. What Rene actually added is a new routing algorithm that accounts for the probability of a certain amount going trough a certain route. Until now, lightning nodes where only going after the cheapest route and did not account for probability.\n\nSo instead of only optimizing for small fee, you can now also optimize for reliability.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i96z08e",
                                            "author": "CryptoBehemoth",
                                            "score": 2,
                                            "created_utc": 1652962637.0,
                                            "response": "Wow that IS a big deal!",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i97fsqn",
                                            "author": "varikonniemi",
                                            "score": 2,
                                            "created_utc": 1652970755.0,
                                            "response": "that is not the whole picture, as the link states this is done without any prior knowledge of the network.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i97k85v",
                                                    "author": "Ima_Wreckyou",
                                                    "score": 2,
                                                    "created_utc": 1652972619.0,
                                                    "response": "Do you mean the sentence \"No prior probing for liquidity required\"?\n\nWhat he means by that is IMHO that we don't know the how the channels are balanced, what side of the channels has what amount of the coins.\n\nA lightning node knows the network and the channel size, because that is collected from the gossip protocol. We don't know the amount of coins on each side, but we do know the **probabilities** of a certain amount of liquidity being on one side of the channel, and that is what the algorithm uses to calculate the probability along the route.\n\nAs far as I understood the story, he realized that once you have those probabilities, it essentially becomes an optimization problem. He then figured out that there is already a solution known for that problem, so he used it to implement the new routing algorithm.\n\nWas at a presentation of it last summer, and that are my vague recollection of it. There was a lot of beer flowing, so may have gotten some details wrong. But I think he also wrote some stuff about it.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i97qwvx",
                                                            "author": "varikonniemi",
                                                            "score": 1,
                                                            "created_utc": 1652975361.0,
                                                            "response": "> We don't know the amount of coins on each side, but we do know the probabilities of a certain amount of liquidity being on one side of the channel, and that is what the algorithm uses to calculate the probability along the route.\n\nthis is not true, you can assume something but you don't know the local/remote balance and thus no probabilities. In fact i don't think you even know who is local who is remote.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i97vxel",
                                                                    "author": "Ima_Wreckyou",
                                                                    "score": 1,
                                                                    "created_utc": 1652977385.0,
                                                                    "response": "If you know where the coins are then you have certainty, not probability. If you don't know where they are you can still calculate the probabilities of various possible distributions of the coins.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9awukr",
                                                                            "author": "varikonniemi",
                                                                            "score": 1,
                                                                            "created_utc": 1653033340.0,
                                                                            "response": "how do you calculate anything without some data points helping you do so? Empty guesswork is not helpful.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i9azqbq",
                                                                                    "author": "Ima_Wreckyou",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653035951.0,
                                                                                    "response": "It's not empty guess work, it's probability theory",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i99239q",
                                            "author": "malphish",
                                            "score": 0,
                                            "created_utc": 1652995412.0,
                                            "response": "This is so ridiculous. Telling the world it doesn't work and dancing about it. \n\nWhy won't Lightning Labs specify a scenario  that we can simulate?  Been asking that for years. They should have done that BEFORE started coding.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i941sfd",
                                    "author": "muffalowing",
                                    "score": 12,
                                    "created_utc": 1652902597.0,
                                    "response": "What are the chances of this working like a bad scene from Star Trek where the person is teleported inside out or we see pieces of the transaction missing at the end??",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i943aa1",
                                            "author": "slvbtc",
                                            "score": 49,
                                            "created_utc": 1652903202.0,
                                            "response": "Usually a lightning transaction is instant. This transaction however took 81 seconds to complete because only 92 of the 137 individual transactions made it on the first attempt. Transactions that fail on the first go get resent until they reach their destination and ultimately combine into the final transaction amount.\n\n81 seconds is a lot better than 10 minutes on the main chain for final settlement. As lightning grows this time will reduce and soon people will be able to send $100k worth of sats in one transaction and get instant settlement.\n\nThis is proof that it works, it only gets better from here.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i945dph",
                                                    "author": "muffalowing",
                                                    "score": 11,
                                                    "created_utc": 1652904050.0,
                                                    "response": "Awesome breakdown, thank you!",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i94jyd7",
                                                    "author": "po00on",
                                                    "score": 5,
                                                    "created_utc": 1652910116.0,
                                                    "response": "!lntip 1000",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i94jzmj",
                                                            "author": "lntipbot",
                                                            "score": 4,
                                                            "created_utc": 1652910131.0,
                                                            "response": "Hi u/po00on, thanks for tipping u/slvbtc **1000** satoshis!\n***\n*[^(More info)](https://xnf5cwpq73.execute-api.us-west-2.amazonaws.com/prod/info) ^| [^(Balance)](https://www.reddit.com/message/compose/?to=lntipbot&subject=balance&message=!balance) ^| [^(Deposit)](https://www.reddit.com/message/compose/?to=lntipbot&subject=deposit&message=!deposit 10000) ^| [^(Withdraw)](https://www.reddit.com/message/compose/?to=lntipbot&subject=withdraw&message=!withdraw put_invoice_here) ^| ^(Something wrong?  Have a question?) [^(Send me a message)](https://www.reddit.com/message/compose/?to=drmoore718)*",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i9611h1",
                                                    "author": "No-Fee6610",
                                                    "score": 1,
                                                    "created_utc": 1652936146.0,
                                                    "response": "what happens if a part of the transactions just wont find a path at the end?\nwill the other transactions be invalid/cancelled and the funds stay with the sender?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9624fe",
                                                            "author": "slvbtc",
                                                            "score": 3,
                                                            "created_utc": 1652936876.0,
                                                            "response": "If a transaction wont find a path even that transaction is broken up into even smaller transactions until a path is found. Eventually all transactions will find a path its just a matter of how many extra seconds that will take.\n\nAs the lightning network grows the faster large transactions will be able to find paths.\n\nSo a path will always be found eventually its just that if it takes many minutes then perhaps an on chain transaction would be more suitable. Right now its better to use lightning for transactions up to around 0.5 btc, as lightning gets bigger with more channels and more liquidity that number rises.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i96o6x4",
                                                                    "author": "No-Fee6610",
                                                                    "score": 1,
                                                                    "created_utc": 1652955316.0,
                                                                    "response": "but isn't it the case that the receiver must have enough channels with an inbound capacity that matches or  is higher than the transaction capacity?\ndoes the software notice if the receiver doesnt fullfill that requirement before starting to send the first transactions?\nadditionally i won't trust that the transactions will be finalized before the last transaction is finalized.\ni would want a system where the last transaction is needed to make the transactions prior valid.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i971qnr",
                                                    "author": "bobderbobs",
                                                    "score": 1,
                                                    "created_utc": 1652964155.0,
                                                    "response": "There was a total of 137 attempts. If one fails you try another. So assuming the size of each attempt didn't change there is a minimum of 47 attempts that succeeded in the first try the attempts that failed the first try go to a different route until all payments succeed",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i99b7j4",
                                    "author": "joz1975",
                                    "score": 2,
                                    "created_utc": 1652999631.0,
                                    "response": "Really awesome!! Those are the experiments we need!",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i944agi",
                                    "author": "BlueberryDefender",
                                    "score": 4,
                                    "created_utc": 1652903606.0,
                                    "response": "So it would go through a number of different channels, which would give access to more liquidity, allowing for bigger transactions? Is there a theoretical limit to how big the transactions can be, or does it allow an unlimited combination of channels and thus unlimited transaction size?\n\nDo I have that right? That payments can now move through not just a single channel, but can use multiple channels, then recombine at the final destination?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i945oaq",
                                            "author": "slvbtc",
                                            "score": 7,
                                            "created_utc": 1652904168.0,
                                            "response": "Correct. This 0.6 btc transaction was 137 individual transactions recombined at their destination. As the lightning network grows and the number of channels and liquidity grows the size of the transactions and number of channels used for each transaction will grow.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i97abs0",
                                    "author": "timbulance",
                                    "score": 1,
                                    "created_utc": 1652968349.0,
                                    "response": "Damn.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i92zo32",
                    "author": "turick",
                    "score": 50,
                    "created_utc": 1652887158.0,
                    "response": "Rene needs community support to continue his transformative work! \n\nhttps://donate.ln.rene-pickhardt.de/",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i93ceo6",
                            "author": "Wilynesslessness",
                            "score": 27,
                            "created_utc": 1652892329.0,
                            "response": "Just donated 100000 for the outrageous fee of 1 Satoshi.\n\n>#zerobasefee",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i94hbh1",
                                    "author": "HDmac",
                                    "score": 9,
                                    "created_utc": 1652908985.0,
                                    "response": "Paid 0 fee for 35k. Went through zero fee routing.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i96wyth",
                                            "author": "Digimonia",
                                            "score": 2,
                                            "created_utc": 1652961445.0,
                                            "response": "Wow, great work Rene!!! Hats off and keep it up. Thank you .",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i97ez8w",
                                    "author": "smeijeri",
                                    "score": 1,
                                    "created_utc": 1652970398.0,
                                    "response": "What happened to the 45 that did not arrive successfully??",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i98ypph",
                            "author": "backobobs",
                            "score": 0,
                            "created_utc": 1652993870.0,
                            "response": "I bet it costed more than 200 sat if he had sent onchain with 1sat/byte.\n\nLol, celebrating this when you can receive it instantly for 0.0001 fee is ridiculous. Lightning sucks for sure.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i94rq26",
                    "author": "saucedonkey",
                    "score": 8,
                    "created_utc": 1652913513.0,
                    "response": "Now this is the shit we need!  Huge!  Expanded LN transaction size makes LN significantly more usable for payments….payments you’d traditionally need ‘BaNk ApProVAl’ before sending.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i94to3r",
                    "author": "DrewBrew95",
                    "score": 6,
                    "created_utc": 1652914397.0,
                    "response": "I like the idea of paying in sats instead of btc",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i957vo1",
                            "author": "Taylorrex0o1",
                            "score": 1,
                            "created_utc": 1652921091.0,
                            "response": "Really",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i95hvuj",
                            "author": "0x1a3c3e7",
                            "score": 1,
                            "created_utc": 1652925737.0,
                            "response": "This is very forward-thinking.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i949djc",
                    "author": "BitcoinIsSimple",
                    "score": 3,
                    "created_utc": 1652905686.0,
                    "response": "Sweeeet",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i96qbs5",
                    "author": "nachofb84",
                    "score": 3,
                    "created_utc": 1652957008.0,
                    "response": "Dude, you need 100% accuracy and subsecond speeds with L1 security.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i94au8q",
                    "author": "Slaaavo",
                    "score": 2,
                    "created_utc": 1652906280.0,
                    "response": "I'd be interested in the fees. They must've paid a lot for that payment. Fees on LN are always proportional to the amount sent and are variable quite a lot. Therefore, any larger amounts are much cheaper on-chain, where the fee is fixed. So, technologically it's great progress, but I doubt its practical application.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i94jvm5",
                            "author": "knox203",
                            "score": 5,
                            "created_utc": 1652910084.0,
                            "response": "You're not considering the privacy aspect that also comes along with this. Breaking up a tx into hundreds of pieces to recombine at the destination makes path tracing that much more difficult, and since it's on the LN there's no UTXO's to account for.\n\nIn a way this can be considered a native mixing service. Some would gladly pay the extra tx fees for this as it's more decentralized and more private than on-chain mixing. And best of all there's no corruptible facilitator like most other mixers.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9an1wr",
                                    "author": "Slaaavo",
                                    "score": 1,
                                    "created_utc": 1653025378.0,
                                    "response": "Agree, though at current rates, it's a pretty hefty premium for privacy.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i969lfx",
                            "author": "Cats_n_Porn",
                            "score": 2,
                            "created_utc": 1652942434.0,
                            "response": "He said he estimated it was 2000 ppm (0.2%), so 120,000 sats. Definitely could be done cheaper on chain, but still pretty damn cheap for that size of a transaction. \n\nThis is much bigger than you think. LN currently relies a lot on higher fee mega-routers to have the liquidity available even for smaller payments. I see payments fail to route through my smaller low-fee node every day in the 500k-1m sat range. If payments are able to split up and find multiple smaller cheaper routes it will reduce fees for the payment and reduce our reliance on these larger centralized hubs. They may even have to consider bringing their fees down in order to compete.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i971w3m",
                                    "author": "dbihosting",
                                    "score": 2,
                                    "created_utc": 1652964239.0,
                                    "response": "Excellent progress, almost there! Rest of the crypto ecosystem is rooting for you .",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i94c475",
                            "author": "turick",
                            "score": 1,
                            "created_utc": 1652906801.0,
                            "response": "Sure it's practical. How much would western union charge you to send $18,000 internationally?\n\nhttps://www.westernunion.com/us/en/send-money/app/price-estimator\n\nSending $18,000 next day from US to Germany costs $270 in fees.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i94dors",
                                    "author": "Slaaavo",
                                    "score": 2,
                                    "created_utc": 1652907451.0,
                                    "response": "Or you could send it on chain for 1 dollar :) of course, if your life depends on the transaction finalising in seconds, I withdraw my objection.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i94gb0x",
                                            "author": "turick",
                                            "score": 5,
                                            "created_utc": 1652908556.0,
                                            "response": "Hahaha good point! However waiting for confirmations could take a long time if you're just buying a computer, TV, or something else that might cost a couple grand at a retail store. But I think things will be vastly different in the future. I think on chain transactions will be very large and very expensive and most ordinary people will not be transacting on layer 1 day to day. It'll just be big capital movements. My guess is that most new bitcoiners 10 years from now will be onboarding directly to lightning. This work is just laying the rails and digging the tunnels 😊",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i94g3aa",
                                            "author": "Danny1878",
                                            "score": 1,
                                            "created_utc": 1652908464.0,
                                            "response": "Theres talk about optional zero fee lightning channels in future, so this combined with no fees could be a game changer.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i93h7dd",
                    "author": "Intelligent_Layer829",
                    "score": 3,
                    "created_utc": 1652894250.0,
                    "response": "The crypto world is growing very fast day by day",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i94muyx",
                            "author": "NYKNYb",
                            "score": 13,
                            "created_utc": 1652911352.0,
                            "response": "Bitcoin world*\n\nShitcoins have been dying in real time last week and hopefully more will follow.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i93357u",
                    "author": "MMinjin",
                    "score": 1,
                    "created_utc": 1652888572.0,
                    "response": "tBTC is just a token on another L1 isn't?\n\nEdit: apparently it is just shorthand for test BTC?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i93720n",
                            "author": "skipperJoey",
                            "score": 14,
                            "created_utc": 1652890171.0,
                            "response": "That's \"test Bitcoin\", the de facto Bitcoin testnet where you can get free coins to experiment with",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i943ewj",
                                    "author": "yearnlearning115",
                                    "score": -1,
                                    "created_utc": 1652903252.0,
                                    "response": "The sats were sent last summer and still not all the way through? I'm trying to understand his tweet",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i95azxi",
                    "author": "TruthSeeker-84",
                    "score": 1,
                    "created_utc": 1652922548.0,
                    "response": "HODL HARD!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i96fzno",
                    "author": "lyp8707",
                    "score": 1,
                    "created_utc": 1652947950.0,
                    "response": "To clarify for the noobs, 92/137 complete still meant that the total payment was received. :)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i96hjm8",
                    "author": "buddyranking",
                    "score": 1,
                    "created_utc": 1652949356.0,
                    "response": "What are the wider implications from this in terms of lightning scalability, reliability, etcetera?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i97zluc",
                    "author": "Creepy-Reason-2381",
                    "score": 1,
                    "created_utc": 1652978857.0,
                    "response": "😃",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i983o3n",
                    "author": "steve11205",
                    "score": 1,
                    "created_utc": 1652980486.0,
                    "response": "Can we verify the transactions? Those 0.6 Bitcoin are hosted off chain correct? When is he planning to move those funds on-chain?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9411j3",
                    "author": "Aggressive_Wish_7162",
                    "score": -9,
                    "created_utc": 1652902294.0,
                    "response": "Serious question: what can you actually buy from Bitcoin without first converting it to dollars? Seems pointless to pretend btc is superior to fiat currency if it’s only useful when converted.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i945q9o",
                            "author": "turick",
                            "score": 8,
                            "created_utc": 1652904190.0,
                            "response": "You sound like an American sitting on your golden throne wondering why anyone needs these silly toys. LOL j/k, but seriously, lightning is changing the lives of people around the world. You have to understand that you can transmit value anywhere in the world for nearly free.\n\nIf you think that's useless, I challenge you to send money internationally in a day, or on the weekend, or after hours, and for free. First, you'll get raped on fees, second, it takes forever to settle. One use case is using lightning for remittances. It's a game changer.\n\nThen you introduce things like Taro, that allow you to send other digital assets over lightning. Dollars will probably be around for a long time to come, but with Taro, digital dollars could be sent anywhere in the world over lightning rails.\n\nYou can't go from zero adoption to a full global circular economy overnight. It's going to take years, probably decades, but we are here paving the way for the future.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i946p3e",
                                    "author": "Aggressive_Wish_7162",
                                    "score": -14,
                                    "created_utc": 1652904591.0,
                                    "response": "I can already send dollars anywhere. And they don’t get lost forever or stolen if I lose my key. Whatever tf that is. \n\nU still didn’t answer on what I can spend these oh so valuable bitcoins on? Let’s say I want to get rid of fiat currency forever. I trade it all in for the “stability” of Bitcoin. Can I buy food without converting to dirty, dirty fiat currency? Or can I eat the btc? Provided I can find my key.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i94a52q",
                                            "author": "turick",
                                            "score": 11,
                                            "created_utc": 1652905999.0,
                                            "response": "You're clearly just here to troll. You are asking about one particular aspect while neglecting all of the huge aspects I just gave you. I can link you many stores where you can pay over lightning, but nah. You're not really interested, you just want an argument. \n\nKeep sucking on the govt and central banks teets and enjoy that money printing.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i94nvwj",
                            "author": "Blimpleton",
                            "score": 3,
                            "created_utc": 1652911795.0,
                            "response": "By the end of the year any place with NCR or blackhawk POS systems will have a bitcoin lightning integration. So anyone with a lightning wallet can spend their bitcoin easily. Some places are already live. Shopify also accepts lightning payments.  Some of these POS systems include buffalo wild wings walmart mcdonalds cvs walgreens Kroger and Starbucks.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9434rc",
                            "author": "yearnlearning115",
                            "score": 3,
                            "created_utc": 1652903140.0,
                            "response": "No one can stop you from spending your bitcoins, whereas payment processors (credit cards), banks and governments can stop you from spending your dollars.\nIf you're a GoodCitizen*TM SocialCredit*10000 then you have nothing to hide and nothing to fear ;)",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9458yk",
                                    "author": "Aggressive_Wish_7162",
                                    "score": -11,
                                    "created_utc": 1652903997.0,
                                    "response": "No\nOne has ever stopped me from spending dollars irl. What actually things can I buy w Bitcoin? I’m in the market for a car and will be visiting many restaurants over the next few weeks as I travel. Also will need hotels, fuel, entertainment, and airline tickets. How many of those take Bitcoin?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i946ejo",
                                            "author": "yearnlearning115",
                                            "score": 4,
                                            "created_utc": 1652904468.0,
                                            "response": "Lots of places take bitcoin just search online for vendors that accept BTC.  \nGovernments have been slowly criminalizing cash -- look at cash seizure / forfeiture in the US, restricted cash withdrawals in EU.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i94atv9",
                                            "author": "turick",
                                            "score": 4,
                                            "created_utc": 1652906276.0,
                                            "response": "So it hasn't happened to you, so it doesn't happen, and all the rest of the people it does happen to can just go fuck themselves?\n\nAgain, you're just here to troll, expecting lightning, that is still in beta, still under development, to be globally adopted and accepted everywhere. And because it isn't today, then it's worthless and never will.\n\nAdoption is massively grown at unprecedented rates. Have fun missing out.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i94cpjn",
                                            "author": "kenlbear",
                                            "score": 3,
                                            "created_utc": 1652907045.0,
                                            "response": "I bought a motorcycle for btc.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i94nid8",
                            "author": "NYKNYb",
                            "score": 2,
                            "created_utc": 1652911627.0,
                            "response": "I think you should read more and listen to a few podcasts because I really don't know where to start here. \n\nThe What Bitcoin Did podcast is nice and beginner friendly.\n\nThe Robert Breedlove Saylor Series is insanely good but very long. You can find that on YouTube.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i9533gr",
                            "author": "saylevee",
                            "score": 2,
                            "created_utc": 1652918830.0,
                            "response": "This is the chicken or egg question for the 21st century.\n\nThe majority don't want to be paid in Bitcoin because the majority of vendors don't accept it.\n\nBut only 5 short years ago nearly no one was paid in Bitcoin and nearly no vendors accepted it.\n\nWhere will we be in 5 years?\n\nPersonally I've asked my employer to be partially paid in Bitcoin. My hope is within a couple of years this will be a reality.\n\nBut I don't currently own Bitcoin to use as a currency. It's the best performing asset in my portfolio (vs. my home, the ETFs I own, and the value of my pension).",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i957y27",
                            "author": "Taylorrex0o1",
                            "score": 1,
                            "created_utc": 1652921122.0,
                            "response": "What??",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i96d0p6",
                            "author": "Ima_Wreckyou",
                            "score": 1,
                            "created_utc": 1652945285.0,
                            "response": "I can buy basically everything with Bitcoin",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i97089i",
                            "author": "Jaycuse",
                            "score": 1,
                            "created_utc": 1652963329.0,
                            "response": "A house was sold in Portugal for 3 BTC and it was a direct payment with no conversion to Euros. So to answer your serious question, seriously, a house.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i96mfdv",
                    "author": "medemskiy",
                    "score": -1,
                    "created_utc": 1652953801.0,
                    "response": "Why is he so happy about something and promoting it if he is literally saying it doesn't work?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i989qra",
                    "author": "NikolayLazarenko",
                    "score": 0,
                    "created_utc": 1652982919.0,
                    "response": "81 seconds and 45 payments were unsuccessful!!!!\n\nI hope you are not serious, and are just trolling. That is poor.\n\nwow, he received fake bitcoins off chain using a shitty mesh network, congratulations .",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i98lfy0",
                            "author": "turick",
                            "score": 1,
                            "created_utc": 1652987706.0,
                            "response": "Why don't you go troll somewhere else. Lightning is very young. This is an experiment. It's testing something unique that isn't supported yet and has great initial results.\n\nYour asinine statement is as ridiculous as critizing space x when they were still blowing up rocket engines in the desert saying \"wow and you want to go to Mars and revolutionize the space industry? What a joke!\"\n\nThe only joke is trolls like you who think that lightning should go from incubation to mass global adoption and complete, robust technical implementations overnight, and if it doesn't, it's a joke and a failure.\n\nIf you don't understand what this experiment is and you're criticizing it, I'm guessing you havent done any research on the topic and have no idea what is being proven out. And I'm not going to waste my breath trying to spell it out for you.\n\nDYOR or STFU and GTFO",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}