{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uzsyrd",
            "title": "High commission to buy BTC",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/uzsyrd/high_commission_to_buy_btc/",
            "author": "Actual_Direction_599",
            "created_utc": 1653761756.0,
            "score": 0,
            "num_comments": 5,
            "subreddit": "BitcoinBeginners",
            "selftext": "So I think I’ve finally settled on a wallet but now that I want to purchase BTC I’m finding out the exchange they work with takes a 20% commission.  So, by giving them USD50, they’d only give me the equivalent of USD39 in BTC.\n\nIs a 20% commission the norm or are there exchanges with lower commissions? Also flexible with the minimum USD to exchange?",
            "stickied": false,
            "comments": [
                {
                    "id": "iac732x",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653761757.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iac7p2e",
                    "author": "krisycoll",
                    "score": 1,
                    "created_utc": 1653762050.0,
                    "response": "Wallets do not \"work\" with exchanges. A wallet store your bitcoin as your garage stores your car and no matter if your car is a Mercedes a BMW or a Tesla. No matter where the bitcoin come from (Exchange, ATM, peer to peer). \n\nThis example is just valid for a very newbie, because a wallet do not store your bitcoin but the private keys, but it helps to understand there is no relationship between wallets and exchanges, like there are no between garage and car sellers. \n\nI don't know where did you buy bitcoin, but in a ATM (the most expensive way) fees are from 5%-15%, so 20% is unsually high. \n\nWhat wallet are you using? where are you buying? Do you have the private keys for your wallet or it is a wallet managed by third-parties?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iac9dv6",
                            "author": "Actual_Direction_599",
                            "score": 1,
                            "created_utc": 1653762874.0,
                            "response": "Well, this one does, i.e. sends to a link where you can buy BTC.\n\nYes, I have the key.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iac8wsi",
                    "author": "bitusher",
                    "score": 1,
                    "created_utc": 1653762642.0,
                    "response": "Why not just use a real exchange to buy bitcoin like one listed in the pinned FAQ?",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}