{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "v0shdp",
            "title": "various questions about operating a lightning node on a void or ubuntu-based linux distro",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/v0shdp/various_questions_about_operating_a_lightning/",
            "author": "Unique_Lake",
            "created_utc": 1653886174.0,
            "score": 2,
            "num_comments": 8,
            "subreddit": "BitcoinBeginners",
            "selftext": "How many packages should I install on void or ubuntu linux on x86 hardware before I could start collecting fees over lightning node transactions?\n\nHow do I manually set up the cost and price of a transaction over my own lightning network and collect the revenue generated into a crypto wallett?\n\nIs there a ready-to-be-used alternative for Umbrel OS but for x86-based hardware computers?\n\nHow do I automatically set up and connect to a network with the aid of the linux kernel? Can I let the system do this automatically during startup?",
            "stickied": false,
            "comments": [
                {
                    "id": "iaieomn",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653886175.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaim3qb",
                    "author": "sciencetaco",
                    "score": 1,
                    "created_utc": 1653891429.0,
                    "response": "Maybe check out Citadel. It’s an open source fork of Umbrel.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iakwear",
                            "author": "Unique_Lake",
                            "score": 1,
                            "created_utc": 1653939944.0,
                            "response": "citadel is only for the raspberry phi board (and thus arm), not for x86 motherboards.\n\nI'll be happy if they where other options, or maybe a way to install all packages required to run thundernodes",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}