{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uxgp8o",
            "title": "I'm wanting to withdraw money from a gambling site (Ignition) and have some questions.",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/uxgp8o/im_wanting_to_withdraw_money_from_a_gambling_site/",
            "author": "directedgraphs",
            "created_utc": 1653483147.0,
            "score": 1,
            "num_comments": 1,
            "subreddit": "BitcoinBeginners",
            "selftext": "When talking to support, they said that I need to have a wallet and then I can transfer money from that wallet to coinbase. So, I need something like blockchain and then I can send it to coinbase? Is this normal? Secondarily, I've heard bad things about blockchain, so I'm wondering if it's a good option or not.\n\nWhat else do I need in order to get my bitcoin to my coinbase account correctly? There was a warning on Coinbase that said if my thing is setup incorrectly, I'll lose my crypto. I want to make sure that everything is good and ready to receive bitcoin.\n\nLastly, suppose I withdraw from Ignition $1000 in BTC, and it takes 2 days to get to my account. Within those 2 days, BTC crashes and loses 15% value. I've lost that 15% value? Further more, once I've gotten it into my coinbase wallet and withdraw it to my bank account, suppose it drops another 15%. Am I losing yet another 15%?",
            "stickied": false,
            "comments": [
                {
                    "id": "i9xguam",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653483147.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}