{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "v0t4lp",
            "title": "Building Bitcoin To Last For Centuries",
            "url": "https://bitcoinmagazine.com/culture/building-bitcoin-to-last-for-centuries?utm_source=carrot&utm_medium=partner&utm_campaign=carrot_share",
            "author": "WritingFun8769",
            "created_utc": 1653888703.0,
            "score": 18,
            "num_comments": 9,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "iaiin5i",
                    "author": "WritingFun8769",
                    "score": 6,
                    "created_utc": 1653888860.0,
                    "response": "“With Bitcoin, we are also building something that we hope will outlive all of us, to withstand countless assaults from man and nature. We understand the goal of providing a new global monetary system, open to all. The scope of the project and its ramifications are even more momentous than the pyramid. Instead of stone, we have code and consensus. We build in cyberspace rather than the physical world. Our monument is everywhere and nowhere, bringing unique protections but also different kinds of vulnerabilities for which we must be vigilant and shore up where possible. The engineering design is simultaneously incredibly open (anyone can contribute to the code) and incredibly private (nobody can force a change onto anyone else). This deliberately messy and entirely voluntary system both supports and demands a social layer on top to coordinate any global-scale changes moving away from the status quo. If the inner functionality is to survive the harsh trials sure to come, we must orient both the code layer and the social layer for unprecedented resilience. Anything else risks failure.”",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaijkq3",
                    "author": "coinfeeds-bot",
                    "score": 7,
                    "created_utc": 1653889513.0,
                    "response": "tldr; Bitcoin developer Owen Kemeys has said that Bitcoin is built in cyberspace rather than the physical world. He argues that Bitcoin must be built to last, to withstand countless assaults from man and nature. He added that Bitcoin needs to be built with great care and diligence to ensure that every change is made with extreme caution.\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaioufo",
                    "author": "solomonsatoshi",
                    "score": 4,
                    "created_utc": 1653893628.0,
                    "response": "I don't know anything much about Jeremy Rubins BIP119 (CTV) but would like to know more in basic terms and how we can take part in decision making to approve or reject the proposal.\n\nThis sort of thing needs more coverage on r/bitcoin and less banal chatter about price and speculation for short term greed. \n\nI guess the technical nature of things like BIP119 make it harder to understand and debate but it sounds important- will enough Bitcoiners care about such things to get involved and take part in important decisions like this?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iais840",
                            "author": "Bitcoin__Hodler",
                            "score": 1,
                            "created_utc": 1653896491.0,
                            "response": "> I don't know anything much about Jeremy Rubins BIP119 (CTV) but would like to know more in basic terms and how we can take part in decision making to approve or reject the proposal.\n\nRun a node.\n\nBIP119 is pretty controversial. bitcoin won´t add highly controversial BIPs. the end.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iaisy7d",
                                    "author": "solomonsatoshi",
                                    "score": 1,
                                    "created_utc": 1653897127.0,
                                    "response": "I am hoping to start a node in the near future- need to research it and also try mining with solar panels. \n\nGood if true the protocol will reject unnecessary changes, if true. The protocol is evolving and the stakes are high. The more we learn and the longer Bitcoin survives the stronger it is proven but vigilance must never die!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "id": "v0t27p",
            "title": "Are there any Bitcoin podcasted/YouTubers on here?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/v0t27p/are_there_any_bitcoin_podcastedyoutubers_on_here/",
            "author": "WhatBands",
            "created_utc": 1653888422.0,
            "score": 7,
            "num_comments": 27,
            "subreddit": "Bitcoin",
            "selftext": "I’m thinking about starting a YouTube / podcast on Bitcoin. I’m just your average person who read a lot about Bitcoin, took action by buying the dip, and understand the full ramifications of Bitcoin. I want to help spread the word about Bitcoin and how it will change the world, talk to average people who thinks Bitcoin is trash and convince them otherwise, etc. \n\nBitcoin changed my life and I feel the need to give back by educating whoever vibes with my type of energy. I enjoy discussing the bigger picture of Bitcoin, and educating on that front. \n\nIf any of you are out there, starting tips would be highly appreciated! Thank you. I love you all.",
            "stickied": false,
            "comments": [
                {
                    "id": "iailjmh",
                    "author": "silestlifestyle",
                    "score": 6,
                    "created_utc": 1653890991.0,
                    "response": "Unless your YouTube channel will be add free I won't be watching, if you are doing it to make money then it's a highly competitive market and to get clicks or views every single youtuber if forced to ensure there content stands out by sensationalising everything. Click bait tactics are sickening. \n\nI only subscribe to the YouTubers who don't run ads.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaimc5g",
                            "author": "WhatBands",
                            "score": 2,
                            "created_utc": 1653891610.0,
                            "response": "Ok thanks for the feedback. Noted, I will definitely not run ads. And I’m not doing it for money, I am doing this because Bitcoin has set me free, and I want others (especially the average person, who I seem to connect with easily). I want to die knowing I made a difference and I feel like I can reach the basic bros and negative Nancys out there. I can’t stop talking about Bitcoin because I truly understand the ramifications of it.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iaimgss",
                                    "author": "silestlifestyle",
                                    "score": 2,
                                    "created_utc": 1653891707.0,
                                    "response": "Wellnthis is very Nobel of you, there aren't many like you out there. Good stuff",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iaiokeu",
                                            "author": "WhatBands",
                                            "score": 1,
                                            "created_utc": 1653893399.0,
                                            "response": "Bitcoin changed my life! 😌",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "iaimy6o",
                                    "author": "Lemons_for_Sale",
                                    "score": 1,
                                    "created_utc": 1653892091.0,
                                    "response": "How can you not run ads? I thought YouTube imposes ads, but you don't get \"revenue-share\" until you meet certain criteria. I would love to make my videos ad free since I can't make money from them.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iaiou5s",
                                            "author": "WhatBands",
                                            "score": 2,
                                            "created_utc": 1653893622.0,
                                            "response": "I don’t know but if I get the option to not run ads I won’t. It’s that simple.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "iaimn2m",
                            "author": "Keith_Kong",
                            "score": 1,
                            "created_utc": 1653891845.0,
                            "response": "I’ve been thinking a lot about what a healthy Bitcoin podcast would look like. Maybe a futurist perspective on Bitcoin where you imagine different governments, on-chain direct democracy, business structures, banking and debt, crazy ideas like funding structures that entirely replace loans/debt as the means of driving the economy forward.\n\nI write a lot of combat systems for video games and they tend to be very economical in nature. Might be fun to create economy simulators for these ideas and then create videos that walk through different ideas, visualizing them with simulations.\n\nStill need to develop some more financial independence before I can pursue anything like this though. Just started a family 😂",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iaj0v47",
                                    "author": "WhatBands",
                                    "score": 1,
                                    "created_utc": 1653904317.0,
                                    "response": "That’s sounds interesting. Do you think about Bitcoin Economy simulators? Congrats on your new family!",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iajxmme",
                                            "author": "Keith_Kong",
                                            "score": 2,
                                            "created_utc": 1653924271.0,
                                            "response": "Yeah I have some basic ideas for how it would work:\n1. Build an agent to represent individuals.\n2. Build an economy engine where you can program different events to trigger so you can dynamically add/remove types of taxes.\n3. Make a function so you can seed a world with individual agents, specifying a ratio of different behaviors (for example agents that DCA Bitcoin, agents that buy bear markets, agents that fomo tops).\n\nYou can then set up different tax structures, build worlds where Bitcoin is either a store of value asset or one where it’s a Bitcoin Standard with no other fiats. You can define countries with different tax laws and ways in which they treat Bitcoin to see how they fair economically against each other.\n\nOne of the main ideas I want to explore involves debunking the notion that you can’t fuel technological growth without inflationary money and without requiring altruistic agents–even at the multiple nation state level.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "iakbefk",
                                                    "author": "WhatBands",
                                                    "score": 1,
                                                    "created_utc": 1653930372.0,
                                                    "response": "That is very interesting, definitely beyond my knowledge.  If you do release this thing on the internet, I’m sure we all would want to see it.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "iakflkp",
                                                            "author": "Keith_Kong",
                                                            "score": 2,
                                                            "created_utc": 1653932231.0,
                                                            "response": "Yeah it’s a lot of work and would need to become my full time gig so unless some random Bitcoiners wanted to fund it I gotta keep makin games 😂 \n\nBut I am on a path to some financial independence so I’m hoping to be able to dedicate some time to these ideas in the next 2-3 years.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iaiiiet",
                    "author": "CaVaengineer",
                    "score": 2,
                    "created_utc": 1653888766.0,
                    "response": "Think media YouTube channel",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaiiz08",
                            "author": "WhatBands",
                            "score": 1,
                            "created_utc": 1653889090.0,
                            "response": "Is that yours?\nThank you, I will binge watch them to see if I’m fit for being a YouTuber / podcaster.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "iaimr07",
                    "author": "silestlifestyle",
                    "score": 2,
                    "created_utc": 1653891932.0,
                    "response": "I really love the Coin bureau on YouTube, he appears to be doing it for the same reason",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaioqtc",
                            "author": "WhatBands",
                            "score": 1,
                            "created_utc": 1653893543.0,
                            "response": "I love that “Guy” too! I think I’m going to do it more like PlanB and not reveal my identity, so I have the option to talk about more personal things. I’m not sure yet though. Maybe I should just learn YouTubing a bit and go forward and figure it out as I go.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iaizsku",
                                    "author": "Charming_Sheepherder",
                                    "score": 2,
                                    "created_utc": 1653903341.0,
                                    "response": "I am ready to ditch guy because he wont stop the dumb ass face thumbnails.\n\nI hate it. Makes his channel look like the other craptastic shills.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iaj2kt7",
                    "author": "Evilgrade",
                    "score": 2,
                    "created_utc": 1653905851.0,
                    "response": "I like \"Simply Bitcoin\" channel",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaj2xba",
                            "author": "WhatBands",
                            "score": 2,
                            "created_utc": 1653906153.0,
                            "response": "Cool will watch some. \nI think I will stay anonymous, what do to think? Using an avatar character instead. I think this way I can talk a bit more freely.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iajoz9u",
                                    "author": "Evilgrade",
                                    "score": 2,
                                    "created_utc": 1653920212.0,
                                    "response": "It's up to you. Both options has their good sides. Privacy one hand, and its important. But people i think prefer to see the face of the person who is talking to him",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iakay53",
                                            "author": "WhatBands",
                                            "score": 1,
                                            "created_utc": 1653930175.0,
                                            "response": "Yes for sure. I think anonymous might be better for me, I think being able to disclose my net worth would be interesting, But I definitely would want to stay anonymous if I want to divulge that kind of information.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iaj9izt",
                    "author": "Anonymouslystraight",
                    "score": 2,
                    "created_utc": 1653911362.0,
                    "response": "Trader university. Even tho he’s a bit of a maxi he provides information to beginners and thoses who are veterans.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iak3sqj",
                    "author": "thefullmcnulty",
                    "score": 2,
                    "created_utc": 1653927034.0,
                    "response": "[I’m clipping important bitcoin information](https://youtube.com/channel/UCg4qaPL7RNNR1hXzf2N-PkQ) so I can easily link relevant material to combat FUD. Follow along if you’re interested. \n\nI’m just starting out but I’ll never monetize the channel and will just continue to add clips that demonstrate the realties of bitcoin. It’s nice to have a library of concise clips that address energy consumption, how bitcoin helps the disadvantaged, the fact that bitcoin is the best accounting technology ever created, etc.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iakc54i",
                            "author": "WhatBands",
                            "score": 2,
                            "created_utc": 1653930702.0,
                            "response": "Cool channel. I will check it out!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iaknphn",
                                    "author": "thefullmcnulty",
                                    "score": 1,
                                    "created_utc": 1653935883.0,
                                    "response": "Thanks. I got tired of trying to dig up the relevant clips and time stamp them when citing information about bitcoin. It’s been helpful so far and I know it will improve the efficient communication of ideas / concepts / realities in the future. \n\nIt’s not much but it’s honest work!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iaiz5ut",
                    "author": "iammasvidal",
                    "score": 0,
                    "created_utc": 1653902757.0,
                    "response": "I feel the exact same as you and have been searching for somebody to start a bitcoin only podcast/ YouTube channel with. \n\nHit me up if you potentially want to have a chat about it if you fancy doing it with someone as passionate about bitcoin as you.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaj1el8",
                            "author": "WhatBands",
                            "score": 1,
                            "created_utc": 1653904810.0,
                            "response": "Awesome that you want to do a channel on Bitcoin. If I do I’m going in this solo. But individual collaboration could be possible!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}