{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uxtf09",
            "title": "Velocity of Money applied to Bitcoin",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uxtf09/velocity_of_money_applied_to_bitcoin/",
            "author": "SweetCoffee120",
            "created_utc": 1653519294.0,
            "score": 6,
            "num_comments": 10,
            "subreddit": "Bitcoin",
            "selftext": "I post that for fun don’t take it seriously but I wanted to hear your thoughts about it. Do your own research\n\nHere is my prediction :\n\n2024 : 91,959 $\n\n2025 : 116,558 $\n\n2026 : 151,526 $\n\n2027 : 195,033 $\n\n2028 : 252,294 $\n\n2029 : 326,375 $\n\n2030 : 467,862 $\n\n&#x200B;\n\n**My thought process :**\n\nVelocity of USD (M1V) = GDP / M1 = 4,5 on average in the past\n\nThere is no GDP metric of purchases of goods & services in exchange for gold or in exchange for bitcoin but since most of the transactions involving gold or bitcoin are currently financial we can take trading volume as an alternative to GDP.\n\n“Velocity of Gold” = Yearly Gold Trading Volume in $ / Gold Market Cap = 4,5 on average\n\nNow why shall Bitcoin have a different velocity than gold and dollar on average ? They all aim to be money, are or have been.\n\nNow the issue is that wash trading can falsify the real trading volume (if I buy bitcoin and sell it just after a million times it can be disregarded in the trading volume). So we can’t trust the trading volume bindly.\n\nNow if we use the 2017 CoinMarketCap trading volume, the ratio 4,5 and the bitcoin supply at that time of 16 millions aproximately we can calculate the presupposed price of bitcoin by solving this equation :\n\n“Velocity of Bitcoin” = Yearly Bitcoin Trading Volume in $ / Bitcoin Market Cap\n\n4,5 = 1,285,994,278,980 $ / 16,000,000 \\* Price\n\n4,5 \\* (16,000,000 \\* Price) = (1,285,994,278,980 $ / 16,000,000 \\* Price) \\* (16,000,000 \\* Price)\n\n72,000,000 \\* Price = 1,285,994,278,980 $\n\nPrice = 17,861.0316525 $\n\nIt is almost the 2017 All Time High so we can assume the 2017 Bitcoin Trading Volume was correct and had no suffered too much wash trading, we can use it as a base.\n\nIf we assume Bitcoin user growth to be aproximately 30% a year based on the increase of active addresses each year we can take the 2017 volume and increase it by 30% each year to guess the future volume without wash trading.\n\nFor 2018 it gives us a volume of 1,671,792,562,674$\n\nFor 2019 : 2,173,330,331,476.2$\n\nFor 2020 : 2,825,329,430,919.06$\n\nFor 2021 : 3,672,928,260,194.778$\n\nFor 2022 : 30% more. For 2023 30% more etc...\n\n&#x200B;\n\nSo now we can try to guess the future bitcoin price :\n\n2018 : Yearly Bitcoin Trading Volume in $ / 4,5 / Bitcoin Supply\n\n= 1,671,792,562,674$ / 4,5 / 16,800,000 = 22,114 $ | Actual 2018 ATH : 17,234 $\n\n2019 : 2,173,330,331,476.2$ / 4,5 / 17,500,000 = 27,598 $ | Actual 2019 ATH : 13,880 $\n\n2020 : 2,825,329,430,919.06$ / 4,5 / 18,000,000 = 34,881 $ | Actual 2020 ATH : 29,300 $\n\n2021 : 3,672,928,260,194.778$ / 4,5 / 18,500,000 = 44,119 $ | Actual 2021 ATH : 69,000 $\n\n2022 : 4,774,806,738,253 $ / 4,5 / 19,000,000 = 55,846 $ | Current 2022 ATH : 48,000 $\n\n2023 : 6207,248,759,728.9 $ / 4,5 / 19,000,000 = 72,599 $\n\n2024 : 8,069,423,387,648 $ / 4,5 / 19,500,000 = 91,959 $\n\n2025 : 10,490,250,403,942 $ / 4,5 / 20,000,000 = 116,558 $\n\n2026 : 13,637,325,525,125 $ / 4,5 / 20,000,000 = 151,526 $\n\n2027 : 17,728,523,182,663 $ / 4,5 / 20,200,000 = 195,033 $\n\n2028 : 23,047,080,137,461 $ / 4,5 / 20,300,000 = 252,294 $\n\n2029 : 29,961,204,178,700 $ / 4,5 / 20,400,000 = 326,375 $\n\n2030 : 38,949,565,432,310 $ / 4,5 / 20,500,000 = 467,862 $",
            "stickied": false,
            "comments": [
                {
                    "id": "i9zxk60",
                    "author": "rundown03",
                    "score": 5,
                    "created_utc": 1653519972.0,
                    "response": "This guy math's!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia02i2c",
                    "author": "kuzkokronk",
                    "score": 1,
                    "created_utc": 1653522309.0,
                    "response": "I'm not smart enough to understand everything you wrote, but I like the number going up.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia03ajr",
                            "author": "SweetCoffee120",
                            "score": 1,
                            "created_utc": 1653522688.0,
                            "response": "Honestly I am just doing dumb computations and I don't know what I am doing and what I do has a 90% chance of being bullshit\n\nBut I wanted to share it in case it could give ideas to people",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia04t49",
                                    "author": "Lovemindful",
                                    "score": 1,
                                    "created_utc": 1653523408.0,
                                    "response": "I’ll take the 10% accuracy!!",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "ia08u2t",
                                    "author": "Ar0war",
                                    "score": 1,
                                    "created_utc": 1653525302.0,
                                    "response": "I like you being honest - no one know where Bitcoin is heading. \n\nBut at least you put some logic behind and, even tho I am not smart enough to fully understand your post, I get your point and logic.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia07zn7",
                    "author": "WaYYne169",
                    "score": 1,
                    "created_utc": 1653524902.0,
                    "response": "I like this Hopium",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia07zwk",
                    "author": "savinelli_smoker",
                    "score": 1,
                    "created_utc": 1653524905.0,
                    "response": "The numbers look legit. My tea leaves concurred.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia04l8w",
                    "author": "Romando1",
                    "score": 1,
                    "created_utc": 1653523306.0,
                    "response": "Jeez OP I hope you’re way way way off. That looks so abysmal and bearish.  I’d say you need to add a zero, heck TWO zeros to your 2030 figure. Come on bruh. Do you want lambos or settle for Chevy??",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia04vwu",
                            "author": "Lovemindful",
                            "score": 1,
                            "created_utc": 1653523444.0,
                            "response": "1 mil here we come!",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "ia04z1f",
                            "author": "SweetCoffee120",
                            "score": 1,
                            "created_utc": 1653523484.0,
                            "response": "Lmao, yeah anything can happen, the number of users can grow exponentially. Thousands of corporations and a lot of states can adopt it very quickly. But to me it seems to make sense as a minimum estimate",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "uxtgim",
            "title": "This is the reason why POW is better than POS",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uxtgim/this_is_the_reason_why_pow_is_better_than_pos/",
            "author": "rohilaltro",
            "created_utc": 1653519417.0,
            "score": 109,
            "num_comments": 131,
            "subreddit": "Bitcoin",
            "selftext": "I have seen people debate about it a lot. I got to learn recently why POW is better than POS and this Twitter thread explains it so well. \n\nhttps://twitter.com/namcios/status/1529527133898432513?t=NVn0lXlRXpbh2IAqvuydcg&s=19\n\nEdit: wanted to add this to the criticism that miner control everything about BTC:\nNo no and big no. \n\nI don't know why this lie got out like this. \n\nNode is the basically the backbone of the rules through which bitcoin is running. \n\nIt is so much misunderstood  that Bitcoin is running because of miners but no, it is running because of nodes that support the protocol and safeguards it's governance and rules.\n\nIf there are very less miners in the world and we keep the nodes exactly the same. Bitcoin will still run exactly the same just the network difficulty will decrease for that small group of miner getting the btc rewards and fees. \n\nBut this can't be said vice versa. Example BCH and BSV, they all died because they require heavy nodes. \n\nRead about blocksize wars and you will get it.\n\nEdit 2: Another criticism:\nIf I control 51% hashrate, I can create a fraudulent block and become rich (obviously paraphrasing from comments)\n\nIf you control 51% of the hashrate and put any transactions ( may be made up or fraudulent) other than mempool transactions in each and every node out there. When you will broadcast that block as mined, all the nodes will reject that block and won't add it to the chain of events aka blockchain. \n\nOnly your nodes will accept it and you branch off the main chain and there goes your 51% hashrate. Enjoy a branched off blockchain version which no other nodes identify as the real truth aka bitcoin.\n\nEdit 3: adding a comment that resonated with me a lot from the thread below:\n\"Absolutely. And it’s pretty ingenious in hindsight. Not sure if it’s all planned according to Satoshi’s infinite wisdom or if a bit of luck was involved. \n\nSurely the bitcoiner at the time didn’t understand it well, not until the history panned out.\n\nOur tiny little $100 raspberry pi turn out to be the masters of everything, and all the super high powered X kW set up turns out to be just our security guards. \n\nThe people hold the power and the “powers” bow down to the people. It’s just beautiful. But also frustrating that people don’t understand the implications of it. It’s so often misunderstood, you’re right everyone should read The Blocksize War.\"- u/savinelli_smoker",
            "stickied": false,
            "comments": [
                {
                    "id": "i9zxnor",
                    "author": "llewsor",
                    "score": 16,
                    "created_utc": 1653520019.0,
                    "response": "great thread 👍",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia03pk8",
                    "author": "GoingDeezNuts",
                    "score": 45,
                    "created_utc": 1653522888.0,
                    "response": "POW is a feature - not a bug!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia1id6g",
                            "author": "Aerith_Gainsborough_",
                            "score": 2,
                            "created_utc": 1653552912.0,
                            "response": "It designed that way so yeah.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia0w7q5",
                    "author": "Fit-Boomer",
                    "score": 22,
                    "created_utc": 1653536526.0,
                    "response": "Bitcoin is pretty much perfect.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia054iu",
                    "author": "savinelli_smoker",
                    "score": 25,
                    "created_utc": 1653523554.0,
                    "response": "PoW is the essence of Satoshi’s innovation. The shitcoin PoS narratives completely miss the point of what makes bitcoin tick in the first place. Reverting to PoS negates the point of blockchain. Who needs blockchain if it’s controlled by selected few?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia1pavt",
                            "author": "ciadra",
                            "score": 2,
                            "created_utc": 1653559100.0,
                            "response": "Isn’t btc also controlled by the selected few biggest mining farms? I just can’t see the difference. Downvotes incoming.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia1qmx9",
                                    "author": "Impressive-Handle-69",
                                    "score": 2,
                                    "created_utc": 1653560204.0,
                                    "response": "No, that is not the case. While yes every miner is a full node, a full node is not always a miner.\n\nFor example, I'm running 2 nodes, not mining any BTC, but my nodes are what verifies the transactions and secures the ledger.\n\nWhile it may appear that only a couple companies are running miners, you can't discredit the several 10s of thousands of individuals running their own full node. Or the individual miners that don't publicly announce that they are mining.\n\nEvery full node gets a \"vote\" in any changes to bitcoin, and bitcoin being the upmost decentralized thing out there aside from nature or the night sky, you're pretty safe from any potential 51% attack.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia1yaui",
                                            "author": "ciadra",
                                            "score": 1,
                                            "created_utc": 1653565624.0,
                                            "response": "Thanks for the heads up, still learning",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "ia1s0o1",
                                    "author": "rohilaltro",
                                    "score": 2,
                                    "created_utc": 1653561299.0,
                                    "response": "First, downvotes generally comes with someone's ignorance. \n\nYours is a genuine doubt. \n\nAnd to answer that yes, maybe. But it doesn't matter because my node holds the constitution (protocol) that how btc will run and anything that goes not according to the protocol, it will reject it right away.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia1y6lx",
                                            "author": "ciadra",
                                            "score": 1,
                                            "created_utc": 1653565551.0,
                                            "response": "That’s a good explanation, thank you",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "ia1zwpi",
                                    "author": "savinelli_smoker",
                                    "score": 1,
                                    "created_utc": 1653566613.0,
                                    "response": "That’s the part most people misunderstood. And honestly most bitcoiner OG didn’t fully understand it during the block size war either, things didn’t become clear until it ended in 2017. \n\nTurns out the threats from the worlds biggest miners and bitcoin exchanges banded together was still no match to the real owners of the network: the tens of thousands of these little raspberry pi sipping a few watts of electricity at home are the real boss. That’s the most beautiful outcome in the world. So no the miners don’t call the shots, if we as node owners do not agree, nothing gets changed and they always have to run it past us. Isn’t this an amazing system?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "ia1pfhk",
                            "author": "ChrimsonChin988",
                            "score": 2,
                            "created_utc": 1653559211.0,
                            "response": "You are correct - it's also the reason why Bitcoin is the only application of blockchain technology with real world value. \n\nWithout a lot of energy & (decentralized) hardware + validators supporting the blockchain, it makes no sense to use it. Better to use a centralized server.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "ia1hdwv",
                            "author": "SnowmanRandom",
                            "score": 0,
                            "created_utc": 1653552034.0,
                            "response": "Because mining tends to be more centralized with the advantages of scaling. Mining BTC is mainly done by a few actors worldwide.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia1nfjw",
                                    "author": "Nichoros_Strategy",
                                    "score": 2,
                                    "created_utc": 1653557465.0,
                                    "response": "It's really not when you understand what a mining pool is, all that matters is whether large centralized actors could overcome the combined effort of what goes into mining pools by individual actors all around the world. And that amount has to be over 50%. Also, whoever controls a mining pool could just reject a centralized attack, meaning that their effort would now be on their own.\n\nIf you were just talking about minting supply, that really has no bearing of importance here if you'd ask me.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "ia1aemq",
                            "author": "tohaz",
                            "score": 1,
                            "created_utc": 1653546162.0,
                            "response": "bitcoin on other hand have something to do with full blockchain size. I for example am not too rich and bying two 2tb ssds to store it reliably on the mirrored storage hit my pocket rather hard",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia1bbp2",
                                    "author": "rohilaltro",
                                    "score": 6,
                                    "created_utc": 1653546896.0,
                                    "response": "It did hit you hard but for other POS nodes, you can't even imagine hosting a node.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "ia1da1n",
                                    "author": "savinelli_smoker",
                                    "score": 8,
                                    "created_utc": 1653548477.0,
                                    "response": "You can use a pruned node if you want. It’s tiny in size. The fact that bitcoin lets anyone to run a FULL node with a 1TB ssd is amazing. That’s the cornerstone for decentralisation.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia1e6td",
                                            "author": "rohilaltro",
                                            "score": 6,
                                            "created_utc": 1653549229.0,
                                            "response": "True, when I look at my 150 euros node and think, this shit holds a ledger equivalent to a big size economy that just baffles me ❤️",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "ia1mzpi",
                                            "author": "Nichoros_Strategy",
                                            "score": 3,
                                            "created_utc": 1653557075.0,
                                            "response": "The right side won when the war took place, puts a tear in my eyes.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia1yy9x",
                                                    "author": "savinelli_smoker",
                                                    "score": 2,
                                                    "created_utc": 1653566028.0,
                                                    "response": "Spot on!",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "ia1egt9",
                                    "author": "magneticman245",
                                    "score": 3,
                                    "created_utc": 1653549468.0,
                                    "response": "4TB of storage is a lot of future proofing though, the blockchain is under 0.5TB right now. 1TB of storage would probably have been enough to fit the next decade or so of transactions.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia1n827",
                                            "author": "Nichoros_Strategy",
                                            "score": 2,
                                            "created_utc": 1653557278.0,
                                            "response": "We need to think over 100 years out, and we cannot guarantee Moore's Law for this.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia1rl7o",
                                                    "author": "Aggressive-Pay2406",
                                                    "score": 1,
                                                    "created_utc": 1653560963.0,
                                                    "response": "Moores law is dead bro",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "ia1rp92",
                                                            "author": "Nichoros_Strategy",
                                                            "score": 1,
                                                            "created_utc": 1653561050.0,
                                                            "response": "It very well may or may not be, but I can tell you that if the world is about to fight for its right to party, then yes it is dead.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia1czuw",
                    "author": "savinelli_smoker",
                    "score": 3,
                    "created_utc": 1653548248.0,
                    "response": "Absolutely. And it’s pretty ingenious in hindsight. Not sure if it’s all planned according to Satoshi’s infinite wisdom or if a bit of luck was involved. \n\nSurely the bitcoiner at the time didn’t understand it well, not until the history panned out.\n\nOur tiny little $100 raspberry pi turn out to be the masters of everything, and all the super high powered X kW set up turns out to be just our security guards. \n\nThe people hold the power and the “powers” bow down to the people. It’s just beautiful. But also frustrating that people don’t understand the implications of it. It’s so often misunderstood, you’re right everyone should read The Blocksize War.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia1dbyj",
                            "author": "rohilaltro",
                            "score": 2,
                            "created_utc": 1653548518.0,
                            "response": "I loved your comment. Do you mind if I add to my post as an edit? \n\nObviously giving you the due credit? !",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia1qzva",
                                    "author": "savinelli_smoker",
                                    "score": 1,
                                    "created_utc": 1653560491.0,
                                    "response": "Haha I’m flattered feel free bro 🤜🏼🤛🏼",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "ia1qb9k",
                            "author": "hatetheproject",
                            "score": 2,
                            "created_utc": 1653559933.0,
                            "response": "Implications of it like the emissions of a small country? Which will only get worse if the price of bitcoin appreciates?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia1v7ra",
                                    "author": "savinelli_smoker",
                                    "score": 3,
                                    "created_utc": 1653563624.0,
                                    "response": "The hash rate is the security. Just like any other security measures it takes energy. It is also the only link between a string of numbers and the “real world”, without which the number is just an “out of thin air” number, no different from the fiats that the whole world is printing by the trillions. PoW is the real innovation. Whereas PoS is just the current system we have. \n\nYou may want to look up how much energy is wasted every year around the world (or even just the US alone), how much stranded energy that cannot be transmitted anywhere. Just a fraction of that wasted energy is enough to run the entire bitcoin network. By its nature, Bitcoin is uniquely capable of making use of this stranded energy, because 1) they are the cheapest so the miners have the incentive to seek them out; 2) bitcoin miner can go to the energy, no matter how remote, while the energy cannot be transmitted to human population. 3) much of the cheapest energy are the hydro electric type, it’s just a waterfall or some river stream that the miners can take advantage of.  No carbon footprint.\n\nWithout those miners, the whole world will just watch this energy flared away or go wasted. Bitcoin right now, today, is helping energy companies to build renewable energy sources by subsidising solar and wind in locations where it was uneconomical to build previously. Bitcoin also helps strengthen the electric grid by allowing energy companies to “build for the peak”. How it works is the companies, with bitcoin mining as subsidy, can build more capacity to accommodate the unexpected peaks of consumptions (heat wave or cold storm), bitcoin miners can be switched off completely within seconds to give the extra capacity to the city when needed. And during normal times it can generate an income without which this a extra capacity will not be built. And without this extra capacity the city would simple experience blackouts. \n\nThe headline of bitcoin consuming energy equivalent to a small country is concerning, of course. And it certainly gets a lot of attention. But everything is in perspective, if we look at it from another angle, the total bitcoin energy consumption is less than the energy we use on dryers, or video gaming. \n\nUltimately I think a lot of it comes to whether you think it’s “worth it”, to you perhaps it’d be a waste if even one kW is used on it, but worth is subjective. If you asked me I’d not hesitate to say say video gaming is so much more of a waste in comparison. But who are we to judge? If we believe in the free markets then whether something is worth the price is indicated by whether someone is willing to pay for it. To the gamers around the world the electricity bill is well worth the entertainment value, and pay for the electricity. In that case there is no need to argue further on subjective “worth”. The action speaks for itself. \n\nThis is a rather deep topic and many people have spent years learning and studying it, there is a lot of info online, Nic Carter is an expert on this topic please feel free to look him up if you are interested. It really isn’t what it appears to be, only if you dig a bit deeper. \n\n[sorry for the long post]",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "ia1sam0",
                                    "author": "rohilaltro",
                                    "score": 1,
                                    "created_utc": 1653561511.0,
                                    "response": "People that mine don't want to pay for the premium price of electricity. \n\nFor eg if 1kwh price is 1 dollar (hypothetical ) in market. It won't make sense for a miner to buy the electricity at market price as it won't be profitable. \n\nMiner tend to buy wasteful electric energy in the grids or at places where cost of transportation is very very high. There you can bring your mining rig and convert that electrical energy to financial energy in form of btc that you obtained as rewards.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia1epvk",
                    "author": "whyublockme",
                    "score": 3,
                    "created_utc": 1653549678.0,
                    "response": "PoS is POS.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia1wtva",
                            "author": "savinelli_smoker",
                            "score": 1,
                            "created_utc": 1653564698.0,
                            "response": "Lol good one",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia1fp7r",
                    "author": "Simple_Yam",
                    "score": 3,
                    "created_utc": 1653550535.0,
                    "response": "Everything you've said applies to PoS as well though.\n\nBlock producers (people with lots of money) have a lot of power on both PoW and PoS but it's the full nodes that maintain the correct state of the ledger.\n\nIf the hashrate drops to very low numbers bitcoin doesn't remain the same, regardless of how many nodes are on it, it indicates a fundamental issue - why aren't people mining it? You have to understand that the security of these systems is nothing but a well though game: the cost to attack should be high enough that it stops all bad actors from doing it. \nA low and centralized hashrate could prevent more hashrate from joining the network through force, it can censor transactions that they don't like, it can double spend - it's good to think of miners not as good people but as reasonable people, they will take bribes if the reward of attacking is higher than what they stand to lose.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia1q8g2",
                            "author": "ChrimsonChin988",
                            "score": 2,
                            "created_utc": 1653559868.0,
                            "response": ">it's good to thing of miners not as good people but as reasonable people, they will take bribes if the reward of attacking is higher than what they stand to lose.\n\nAbsolutely. The reason this hasn't (successfully) happened yet is because the incentives on which Bitcoin is build, **actually** **work**. If it was more profitable to attack the network than to defend it, the project would've failed years ago.\n\n>Block producers (people with lots of money) have a lot of power on both PoW and PoS\n\nBitcoin has the miners, the validators and the Bitcoin holders.\n\nPoS combines all 3 into 1.\n\nBtw, I'd argue that block producers do not have much power at all in a PoW system. If this were the case, the block size war would've been won by the miners back in 2017. 2017 showed us that miners are nothing more than voluntary worker bees for the blockchain. All they do is produce blocks as fast as they can and include the highest amount of profitable transactions.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia1rh1e",
                                    "author": "Simple_Yam",
                                    "score": 1,
                                    "created_utc": 1653560871.0,
                                    "response": "This is EXACTLY how PoS works as well.\n\nPoS has block producers, node runners and token holders. Don't mix on-chain governance (which sucks imo and thankfully not many chains adopted it) with the consensus algorithm\n\nAn arbitrary change of the rules by the block producers would not influence what your own node tells you is real, it would not accept them. \n\nThe difference is that in PoW the network would continue running with as much hashrate as there is remaining on this \"good\" fork, which in itself is a security issue AND a good thing because it's self sustaining. In PoS the \"good\" network would halt and it would require social intervention - the token holders of the chain would coordinate to restart the network by removing the bad actors.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia1waeo",
                                            "author": "DatBuridansAss",
                                            "score": 1,
                                            "created_utc": 1653564341.0,
                                            "response": "Doesn't that place a lot of trust in a few centralized people?",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "ia1wh2i",
                                            "author": "ChrimsonChin988",
                                            "score": 1,
                                            "created_utc": 1653564463.0,
                                            "response": "Guess ill have to research PoS some more. \n\nI don't see tho what 'block producer' means in the context of no mining hardware.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "ia1jsjc",
                            "author": "WalksOnLego",
                            "score": 2,
                            "created_utc": 1653554196.0,
                            "response": "How many Ethereum full nodes are there now. Why less and less?\n\n**Most importantly: How does a new node on PoS independently verify the ledger/chain?**\n\nIf given two, competing chains a new node can't tell the real from the fraudulent, because there is no \"heavier chain\". It has to rely on trusted nodes to tell it what \"the real\" chain is.\n\nIf you require trust, at all, you don't need a blockchain, and a centralised database is much, much better.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia1qpea",
                                    "author": "Simple_Yam",
                                    "score": 1,
                                    "created_utc": 1653560264.0,
                                    "response": "What you're describing doesn't really happen in reality. 2 networks running in parallel for months/years while nobody notices it? This is a weak argument and it can happen for PoW networks as well.\n\nBitcoin forked due to a client bug in 2013. If you were running a new node with the bugged code you would have joined the now orphaned bugged chain because it actually had 60% of the hashpower.\n\nSocial consensus is what's keeping this from being an issue: why did that network split? Ohh it's because they wanted X feature or there was Y bug in client code. Cool I'll join instead the network with no bugs or without X feature, give me a few minutes.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia0r0vs",
                    "author": "actpn",
                    "score": 8,
                    "created_utc": 1653533789.0,
                    "response": "Maybe I’m just dumb, but wouldn’t same argument apply for POW? Instead of largest coin holder, the control goes to whoever can build the most sophisticated/powerful mining rig?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia0uq9j",
                            "author": "llewsor",
                            "score": 18,
                            "created_utc": 1653535699.0,
                            "response": "having control over mining doesn’t give you the power to change the protocol. buying up all the bitcoin also doesn’t give you any power over the protocol.\n\nobligatory: https://youtu.be/ncPyMUfNyVM",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia1wtxd",
                                    "author": "Simple_Yam",
                                    "score": 2,
                                    "created_utc": 1653564699.0,
                                    "response": "Neither does having coins on PoS. You're conflicting on-chain governance (which is awful but rare thing) with the consensus mechanism.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "ia1aiqq",
                                    "author": "yoburg",
                                    "score": -1,
                                    "created_utc": 1653546249.0,
                                    "response": "And so staking all the PoS currency by a single holder doesn't make sense because the only thing you can do if you accumulate more than 50% of it is just dumping the price which is just losing money for free.\n\nSharding+staking does what mining does at a fraction of power cost.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "ia13x3b",
                            "author": "BTCMachineElf",
                            "score": 4,
                            "created_utc": 1653541361.0,
                            "response": "They must expend continuous effort in the form of electricity and updating their rigs, and they will lose their status as soon as they stop or someone outpaces them. It is highly competitive and if you slack off, you'll lose rank and become unprofitable.\n\nIn POS, the whales just lounge around and become fatter whales.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia15pk2",
                                    "author": "actpn",
                                    "score": 2,
                                    "created_utc": 1653542616.0,
                                    "response": "Sure makes sense that there won’t be free lounging and they’ll have to put in work. My point was that if someone wanted to control in a POW system, whoever has resources to build the most powerful rig can win and crush any competition.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia18u7v",
                                            "author": "BTCMachineElf",
                                            "score": 4,
                                            "created_utc": 1653544936.0,
                                            "response": "They can be on top *for a while only.* Technology advances will make your rig obsolete.\n\nWhile in PoS, who is in front stays in front *forever.*",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia1as8b",
                                                    "author": "michelbarnich",
                                                    "score": -2,
                                                    "created_utc": 1653546460.0,
                                                    "response": "This is the biggest bullshit I have heard in a long time. If I control 51% of the Bitcoin hashrate, I will stay in front for ever too, I can change the Blocks to whatever I want. PoS is the exact same thing as PoW but mire energy efficient. Same thing applies to PoS, If I control 51% of the staking volume, I can do whatever I want. The difference is that either im rich in a digital currency, or I‘m rich in fiat.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "ia1chbi",
                                                            "author": "rohilaltro",
                                                            "score": 5,
                                                            "created_utc": 1653547820.0,
                                                            "response": "If you control 51% of the hashrate and put any transactions ( may be made up or fraudulent) other than mempool transactions in each and every node out there. When you will broadcast that block as mined, all the nodes will reject that block and won't add it to the chain of events aka blockchain. \n\nOnly your nodes will accept it and you branch off the main chain and there goes your 51% hashrate. Enjoy a branched off blockchain version which no other nodes identify as the real truth aka bitcoin.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "ia1cycp",
                                                                    "author": "michelbarnich",
                                                                    "score": 0,
                                                                    "created_utc": 1653548213.0,
                                                                    "response": "Yeah I know how it works, the issue is that you can just push empty blocks and clog the Network. Bitcoin follfows the Nodes with the highest Blockheight and valid Blocks. Empty Blocks are in fact valid.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "ia1fdsc",
                                                                            "author": "magneticman245",
                                                                            "score": 2,
                                                                            "created_utc": 1653550258.0,
                                                                            "response": "What happens next in this scenario? You're mining every single block and including no transactions. You're already getting less return than an honest miner because you get no transaction fees, so your margins are tighter. \n\nAt the next difficulty adjustment, if the difficulty goes up, it's a certainty that you will be in the group of miners who are no longer profitable (because you are receiving no fees). You have to choose: either begin including transactions, stop your attack, or operate at a loss (how long can you keep that up for?).\n\nIf the difficulty goes down, more miners will be able to start mining profitably again. I'd assume you would have no idle mining rigs because if your goal is to gain 51% of the hashrate you would switch all your miners on, even if some of them aren't individually profitable. So in the event of a difficulty adjustment you will become a smaller proportion of the hashrate when new miners join, likely falling below 51%.\n\nIt's really not possible to sustain an empty-block 51% attack for long. This is the key difference between PoW and PoS, in PoS there's no ongoing cost to being a \"miner\", so once you're in the lead position you can stay there. In PoW you have the ongoing expenditure of energy and the requirement to keep your hardware up to date, which combined with the difficulty adjustment makes it very difficult to sustain the attack for long.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "ia1fl4q",
                                                                                    "author": "michelbarnich",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653550437.0,
                                                                                    "response": "You forget one thing. If overnight 50% of hash rate goes away, the Network will now need ca 20 minutes per Block, slowing the Blockhain down. Difficulty will get adjusted again after some time, and I can switch my 50% hash rate back on. What keeps me from doing that and slowing the Network down enormously? Exactly, money. The same thing that keeps you from doing it on PoS.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "ia1ftzg",
                                                                                            "author": "magneticman245",
                                                                                            "score": 1,
                                                                                            "created_utc": 1653550655.0,
                                                                                            "response": "I don't really see what that has to do with my comment (which was specifically about an empty-block attack). \n\nYes, in PoW and PoS if you somehow controlled half the hashrate, you wouldn't ever switch off entirely because you'd be losing money. The idea however is that in PoW, you can't operate that level of hashrate dishonestly forever, while in PoS you can. So in PoW there's no reason to reach that level of hashrate anyway unless you intend to use it honestly.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "ia1bw83",
                                                            "author": "BTCMachineElf",
                                                            "score": 2,
                                                            "created_utc": 1653547346.0,
                                                            "response": "Nobody is getting 51%. Being on top is still less than 10%. And you need to be working your ass off to stay in front, because everyone else is too.\n\nIf you don't get that, that's on you.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "ia1c0bn",
                                                                    "author": "michelbarnich",
                                                                    "score": -1,
                                                                    "created_utc": 1653547437.0,
                                                                    "response": "Well same thing with PoS. To get 51% you would need to be rich on another level. Actually in sole cases you need 66% which would actually make it even more secure than ihr PoW implementation in Bitcoin.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "ia1ctn0",
                                                                            "author": "BTCMachineElf",
                                                                            "score": 2,
                                                                            "created_utc": 1653548105.0,
                                                                            "response": "It is not the same thing. If you don't get it, take your shitcoin narratives elsewhere.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "ia1czu6",
                                                                                    "author": "michelbarnich",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653548248.0,
                                                                                    "response": "Then what is the difference? If you had an argument you would say it.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "ia1efjc",
                                                                                            "author": "BTCMachineElf",
                                                                                            "score": 3,
                                                                                            "created_utc": 1653549437.0,
                                                                                            "response": "I already did. PoS control = permanent control. PoW control = temporary control. There are plenty of good arguments against PoS. [https://twitter.com/namcios/status/1529527133898432513](https://twitter.com/namcios/status/1529527133898432513?t=NVn0lXlRXpbh2IAqvuydcg&s=19)",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "ia1c1va",
                                                    "author": "yoburg",
                                                    "score": 1,
                                                    "created_utc": 1653547472.0,
                                                    "response": "Except in PoS the more sharded your validators are the more the more coins worth so being a lonely whale would be the worst investment.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "ia1bft6",
                                    "author": "yoburg",
                                    "score": 1,
                                    "created_utc": 1653546984.0,
                                    "response": "So the PoS downside is that it is easier to continue to be a staker than it is to be a miner.\n\nBut that doesn't affect regular users and holders of the currency.\nAlso if somebody decides to become a staker he would need to buy the coins and increase its price instead of inflating price of the mining equipment.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia1c3rd",
                                            "author": "BTCMachineElf",
                                            "score": 2,
                                            "created_utc": 1653547514.0,
                                            "response": "If you think the governance of a currency is irrelevant, then you don't understand this movement.\n\nNo kings, no governing authority, no one in charge of the money supply. That is the whole point of bitcoin. PoS gives power to the rich. Enough money and they could censor their blockchains. PoW makes that kind of control impossible. You'd have to expend an insane amount of money and the best you could do is censor it *for a short time* until you're totally broke.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia1cx6d",
                                                    "author": "yoburg",
                                                    "score": 0,
                                                    "created_utc": 1653548186.0,
                                                    "response": "Censoring blockchain and even owning a majority of PoS chain by a single holder would drastically lower its price and I have never met a whale who deliberately wanted to lose money.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "ia1qofs",
                                                            "author": "Glugstar",
                                                            "score": 1,
                                                            "created_utc": 1653560241.0,
                                                            "response": ">I have never met a whale who deliberately wanted to lose money.\n\nHave you never heard of powerful corporations or governments *spending money at a loss*, just to sink something they don't like, strategically or ideologically?\n\nBecause that's the kind of \"whales\" we are most worried about. They have money to burn, and do not take kindly to independent projects or movements trying to disrupt their monopoly on power.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "ia0uzk1",
                            "author": "TheChoosey1",
                            "score": 6,
                            "created_utc": 1653535839.0,
                            "response": "Work is different from just having money. \n\nThose mining rigs, they run on air, right? For free?\n\nWork takes effort. That effort is unforgeable costliness. \n\nPOS is a fake system that requires no real input. It will collapse in all cases.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "ia0uwk4",
                            "author": "zombiecorp",
                            "score": 2,
                            "created_utc": 1653535795.0,
                            "response": "Maybe I'm just dumb too, but what work or  value does \"largest coin holder\" contribute to the network?  \nI can see the obvious value all miners contribute to the network because they help scale out the computational power and secure the blockchain.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia1wpxt",
                                    "author": "Simple_Yam",
                                    "score": 1,
                                    "created_utc": 1653564627.0,
                                    "response": "Coin holders don't contribute to the network, only coin stakers do. They validate and add blocks to the chain, same as miners. That's the work that they do.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia18j8k",
                    "author": "simplelifestyle",
                    "score": 2,
                    "created_utc": 1653544704.0,
                    "response": "Awesome thread, thanks for sharing!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia1cu4l",
                    "author": "Weak-Examination-920",
                    "score": 2,
                    "created_utc": 1653548116.0,
                    "response": "Absolutely agree! POW is definitely a valuable feature. Specially with the organic decentralised growth I has surpassed.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia1dgzw",
                    "author": "TheChildOfChange",
                    "score": 2,
                    "created_utc": 1653548633.0,
                    "response": "Depends , for Bitcoin which aims to be the new “standard” pow is making it more scarce and powerful. I mean no whale has a big voting power than can change the protocol drastically. POS blockchains on the other hand don’t share the same vision with Bitcoin. Some of them have some “scarcity” but their focus is towards defi and smart contracts . So I think it’s right for Bitcoin being “new gold” ,or better, to have high energy emissions while blockchains where defi platforms operate to have low energy emissions or be carbon negative. \nP.s. Sorry for long reply",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia1jpul",
                    "author": "Reasonable_Guest_434",
                    "score": 2,
                    "created_utc": 1653554129.0,
                    "response": "This conversation should have been framed in the context where both the PoW and PoS chain were actually the global reserve currency.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia1k035",
                    "author": "WalksOnLego",
                    "score": 2,
                    "created_utc": 1653554387.0,
                    "response": "To be fair, that's not how a 51% attack works.\n\nA miner that acquires 51% of the hash rate can start their own, heavier chain, in secret. They don't broadcast it.\n\nThey do some transactions on the \"real\" chain, that all nodes agree on.\n\nLater they publish their secret, heavier chain, making all their recent transactions on the other chain nullified, and restoring all the btc they \"spent\".\n\nAll of the transactions that take place are completely valid.\n\nHowever, the scale required to do this is ridiculous. These days. Even if you were able to acquire the hardware to do so, you also need the electricity to power it all, and the infrastructure too. You basically need to build a nuclear power plant, or two, first, a factory to make the ASICs, etc. etc. etc. etc. A *very* large, and wide, technology stack.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia1qpxb",
                            "author": "ChrimsonChin988",
                            "score": 1,
                            "created_utc": 1653560276.0,
                            "response": "Yep and you would need to do all of it covertly. \n\nRealistically speaking, I'd say it's not possible. \n\nBtw, I don't think you would necessarily double spend, but rather you would build up a huge short position, take over the chain and stop including any transactions in the blocks you produce, effectively killing the coin and sending the price to 0.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia0k87b",
                    "author": "PerformanceVarious45",
                    "score": 8,
                    "created_utc": 1653530576.0,
                    "response": "This is why Ethereum is exposing itself as broken and when everyone realizes how dumb pos is that whole shitcoin ship sinks.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia17o71",
                    "author": "Dazzling_Marzipan474",
                    "score": 4,
                    "created_utc": 1653544043.0,
                    "response": "Can't we all just get along 🙂",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia0hgxs",
                    "author": "DingusPrimeHere",
                    "score": -17,
                    "created_utc": 1653529286.0,
                    "response": "Never mind the vast amounts of electronic waste and pollution PoW produces........",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia0olje",
                            "author": "YaBoyLaKroy",
                            "score": 6,
                            "created_utc": 1653532637.0,
                            "response": "*laughs in amazon/alibaba/cokacola/saudi aramco*",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "ia0ks8x",
                            "author": "VPNApe",
                            "score": 8,
                            "created_utc": 1653530834.0,
                            "response": "Bruh I could make a business that exists to do nothing but waste electricity and literally nobody would give a fuck. The only reason energy consumption is a talking point for BTC is because it's the best thing the anti-btc shitheads could think of.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "ia0k359",
                            "author": "HesitantInvestor0",
                            "score": 12,
                            "created_utc": 1653530512.0,
                            "response": "Are you against any industry that creates waste and pollution? Do you drive? Do you invest in gold? Do you have a bank? Do you eat meat? Do you use plastic? Do you have children?\n\nEveryone has a carbon footprint. I don't know how big yours is, but it is likely you are a hypocrite. Personally, I invest in BTC, but I also bike to work, don't own a car at all, don't have children, don't use plastics, don't take hot showers, don't own property, don't own much of anything (as a desired feature of my life, not for any moral reason).\n\nThere are infinite ways to pollute this earth. Some of those ways we deem necessary, others acceptable. If you're against this one thing in particular then you should probably be considering what you can do personally to reduce your carbon footprint. Otherwise you really don't have a leg to stand on.\n\nThis is not a pro crypto post on my part, just taking a look at the hypocrisy people spout. I'd be saying the same thing whether I was into crypto or not. Had you complained about the amount of pollution and waste that is produced by eating meat, driving cars, or anything else I'd be here making the same point.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia0kipu",
                                    "author": "yefimthesoviet",
                                    "score": 5,
                                    "created_utc": 1653530713.0,
                                    "response": "preach",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "ia0qmjl",
                                    "author": "4241342413",
                                    "score": 4,
                                    "created_utc": 1653533592.0,
                                    "response": "https://en.wikipedia.org/wiki/Whataboutism",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia0vwhc",
                                            "author": "HesitantInvestor0",
                                            "score": 4,
                                            "created_utc": 1653536352.0,
                                            "response": "Whataboutism is just an easy thing to point to for hypocrites if you ask me. If you don't think there is validity to the idea of pointing out hypocrisy then you're probably a hypocrite yourself.\n\nParty A: \"Man, I can't believe you cheated on your girlfriend. That's unethical.\"\n\nParty B: \"Look who's talking! You scammed your own mother out of $50,000!\"\n\nAnd then? Where does the conversation go from here? They are both correct, but only one is a hypocrite. The guy above who mentions the energy argument is obvious correct; Bitcoin mining consumes a lot of energy. Is that the end of the conversation in your opinion? Is it really simply 'whataboutism' (a dumb word in the same line as 'mansplaining) or is it valid critique that points to the fact that we all have a carbon footprint which we can PERSONALLY change.\n\nI've already mentioned that in order to reduce my carbon footprint, I've chosen to give up a solid handful of large conveniences (plastics, vehicles, a home, etc). If I choose to invest in Bitcoin, does that negate my other choices?",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "ia1xb4q",
                                    "author": "Simple_Yam",
                                    "score": 1,
                                    "created_utc": 1653565005.0,
                                    "response": "Hey, I accept the energy and electronic waste that Bitcoin produces because I see value in it as the first real internet currency. \n\nBut if I had the option to drive a car that uses almost no energy, there's no need to dig the earth to mine exponentially more rare minerals or pollute asian rivers with electronic waste then I would do it lol.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "ia0o20h",
                                    "author": "Schlongzz",
                                    "score": -5,
                                    "created_utc": 1653532387.0,
                                    "response": "While I agree with your argument, there’s no real “need” for BTC. Comparing the carbon footprint of BTC to things such as eating and commuting to work isn’t a fair comparison.  You’re talking about telling people they should be sacrificing what most people deem essential if they take issue with the carbon footprint of BTC.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia0v1cf",
                                            "author": "HesitantInvestor0",
                                            "score": 4,
                                            "created_utc": 1653535865.0,
                                            "response": "If you'd like I can just pivot to mention all the things none of us 'need' but want regardless.\n\nInstead though, let's just say that there is absolutely a need for people to harness their wealth. You have the choice to do that in banks, stocks, gold, Bitcoin, real estate, or a box of cash under your bed. Each one of those ways, even the box of cash, produces a ton of emissions. Bitcoin is most directly competing with banks because it it is most fungible in comparison to things like real estate which are absolutely non-fungible.\n\nThis is a competition. There's nothing wrong with that. If we fast forward 100 years there is the potential that Bitcoin and banks are competing even more closely. And by then mining will be gone and the energy argument will be finished.\n\nYou know what though, while banks have put forth zero effort to maintain greener options, Bitcoin has grown greener every year. That's worth something. Taking possession over your own wealth is worth something. The advancement of technology that shows us what out there is obsolete is worth something.\n\nThe arguments don't hold weight. There are far better arguments against Bitcoin than the energy argument, and even those are pretty pathetic. For anyone outside of those who have something to gain from the current form of financials, Bitcoin looks attractive. There is a reason that the people who are most against it either already have billions of dollars, or are part of governments.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "ia0yl9i",
                                            "author": "infopocalypse",
                                            "score": 2,
                                            "created_utc": 1653537922.0,
                                            "response": "People \"need\" a monetary system. Upgrading it will dramatically improve all aspects of life.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia1rtg0",
                                                    "author": "Schlongzz",
                                                    "score": 1,
                                                    "created_utc": 1653561141.0,
                                                    "response": "There’s a million things that need to happen before bitcoin could ever be considered for this role. It likely will never happen.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "ia0ypuq",
                                            "author": "infopocalypse",
                                            "score": 1,
                                            "created_utc": 1653537999.0,
                                            "response": "People \"need\" a monetary system. Upgrading it will dramatically improve all aspects of life.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "ia0lojo",
                            "author": "Riker-Was-Here",
                            "score": 8,
                            "created_utc": 1653531260.0,
                            "response": "Waste?! How is it wasteful? It's actually a brilliant and efficient use of energy. You know what is wasteful? Christmas lights.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "ia0xc11",
                            "author": "Remarkable-Cat1337",
                            "score": 3,
                            "created_utc": 1653537175.0,
                            "response": "hi butter, why don't you adress your responses? guess you can't. bye",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "ia0yfuv",
                            "author": "infopocalypse",
                            "score": 3,
                            "created_utc": 1653537834.0,
                            "response": "It has a smaller footprint than the current financial system. And has a larger (59%) amount of energy that comes from non fossil fuel (thus not CO2 emitting) than any country or other industry and it isn't even close. Furthermore POW incentivizes the expansion of green energy production. Which POS does not.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia1ccie",
                                    "author": "yoburg",
                                    "score": 1,
                                    "created_utc": 1653547714.0,
                                    "response": "Buying all availible green energy doesn't make more green energy come to the world. Every MWatt/h bought by miners would've been spent on literally anything else.\n\nCurrently it's mostly politics and companies go green just for tax reliefs.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia17cwe",
                    "author": "FinnishArmy",
                    "score": -5,
                    "created_utc": 1653543806.0,
                    "response": "POW consume way too much power.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia1as86",
                            "author": "rohilaltro",
                            "score": 3,
                            "created_utc": 1653546460.0,
                            "response": "Yeah because it is worth it. It is worth every single penny. \n\nNext time sitting in your comforts of a plane journey or washing your clothes in washing machine, say that to yourself, \"it is is consuming lot of energy\". I should maybe take a boat or walk or wash my clothes with hands.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia1xehp",
                                    "author": "Simple_Yam",
                                    "score": 2,
                                    "created_utc": 1653565066.0,
                                    "response": "But are there airplanes that can fly without consuming energy?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia1yihl",
                                            "author": "rohilaltro",
                                            "score": 1,
                                            "created_utc": 1653565757.0,
                                            "response": "That's what my point is. You need to consume energy to get basic needs done.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia113af",
                    "author": "iworkisleep",
                    "score": -1,
                    "created_utc": 1653539478.0,
                    "response": "Prisoner of War vs Piece of Shit, I choose PoW every time",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia19xyn",
                    "author": "lakimens",
                    "score": -1,
                    "created_utc": 1653545795.0,
                    "response": "I don't understand. Basically, PoS is shit because people with money can control the chain, is what they said.\n\nBut people with money (the most hashrate) control the chain on Bitcoin and can make changes.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia1bu1o",
                            "author": "SomeBrokeChump",
                            "score": 3,
                            "created_utc": 1653547299.0,
                            "response": ">But people with the most hashrate control the chain on Bitcoin and can make changes.\n\nThe Bitcoin miners are not in control of the Bitcoin protocol rules. The miners can't change the Bitcoin protocol unless the users running fully validating Bitcoin nodes also come to consensus on making those protocol changes. The users that are running fully validating Bitcoin nodes must come to consensus in order for any changes to be made to the Bitcoin protocol. The miners can show support for proposed protocol changes, but the miners cannot make changes to the Bitcoin protocol without the full node operators also agreeing to those changes. Without consensus of the full node operators in agreement with those protocol changes, the miners only have the ability to mine an altcoin that has forked off from Bitcoin, and this has happened many times already.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia1xqh0",
                                    "author": "Simple_Yam",
                                    "score": 1,
                                    "created_utc": 1653565272.0,
                                    "response": "That's exactly how PoS works as well!\n\nYou node will never accept blocks from block producers that try to change the rules, no matter how much stake they have.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia1yyqg",
                                            "author": "SomeBrokeChump",
                                            "score": 1,
                                            "created_utc": 1653566036.0,
                                            "response": "I'm not interrested in proof-of-stake. I was just correcting the user who said that miners can make changes to the Bitcoin protocol. \n\nSince you are so interested in proof-of-stake, below are a couple of videos that can help educate you about PoS. \n\n[Here is a good short video that details the differences between PoW and PoS consensus algorithms.](https://www.youtube.com/watch?v=hMge7LfiRT8&t=69s)\n\n[Here is a good 110 minute What Bitcoin Did episode that details why proof-of-stake is flawed.](https://www.youtube.com/watch?v=trwhWsKm3Qs) It features a former Ethereum core developer named Lane Rettig that quit working on Ethereum because of all of its problems.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "ia24szy",
                                            "author": "putyograsseson",
                                            "score": 1,
                                            "created_utc": 1653569324.0,
                                            "response": "Just out of curiosity, is there any blockchain that utilities a PoS consensus system that allows for their validator's hardware to be as light as a bitcoin node? (100-200 bucks hardware cost)",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "ia1awze",
                            "author": "MrQ01",
                            "score": 2,
                            "created_utc": 1653546568.0,
                            "response": "Are we really going to pretend hash rate and coins are the same? That paying electricity to mine is equal to self-generating money?\n\nReally?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia04cqg",
                    "author": "18476",
                    "score": 1,
                    "created_utc": 1653523197.0,
                    "response": "Well said, as well as all the followup statements below the tweet. Lol, i guess I've been shown that twitter can be educational mmmhhmmm.😉🤔",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia1odkg",
                    "author": "ChrimsonChin988",
                    "score": 1,
                    "created_utc": 1653558294.0,
                    "response": "PoS is the equivalent of PoW, but the validators & miners are the same party.\n\nPoS has very low energy & hardware requirements.\n\nOnly requirement: A lot of (shit)tokens. \n\nI wouldn't say it's insecure per se, but it's about a factor 1000x less secure than a properly decentralized PoW system like Bitcoin. And because there is often a main figure or company behind PoS systems, it's much easier to corrupt/coerce etc. PoS will work great 99.9% of the time, but it is much more likely to go off the rails in case of some sort of Black Swan event. \n\nIt's ab-so-fucken-lutely not something you would want at the base layer of the world economy. Unless, of course, you are one of the few with power over said system.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia1xvcc",
                    "author": "songbolt",
                    "score": 1,
                    "created_utc": 1653565355.0,
                    "response": "So, I was literally reading introductory books on logic just yesterday, and now these Twits appear sharply to me as invalid arguments:\n\n1. 3/ “#Bitcoin created a triple-entry [ledger] from the old double-entry [ledger] and the ledger self-audits and writes on-chain. \n\n2. It’s an immutable ledger entry that can never be altered.\n\n3. That’s the best accounting technology that’s ever been created by humans.”\n\n4. 4/ “So anything that lives on top of this #Bitcoin network will be better than the legacy system that it replaces.\n\n5. And it is only because of PoW that you’re able to have this immutable ledger and all the other layers for financial and economical freedom.”\n\n2 appears to be a false statement insofar as it can be altered if enough hash power is obtained, right?\n\n3 appears to be an opinion, not a statement has been shown to be true.\n\n4 is a false premise. It does not follow that something built on tech with more features will be better. One could have a poor designer, for example; or a feature could have unintended adverse consequences.\n\n5 is either an uncertain premise or a circular fallacy, depending on how you interpret it.\n\nTwitter is not a suitable medium for explanation or discussion, because of the character limitation (and hypocrisy of the administration).",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia23594",
                    "author": "putyograsseson",
                    "score": 1,
                    "created_utc": 1653568448.0,
                    "response": "Just out of curiosity, is there any blockchain that utilities a PoS consensus system that allows for their validator's hardware to be as light as a bitcoin node?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia23i8w",
                            "author": "rohilaltro",
                            "score": 1,
                            "created_utc": 1653568637.0,
                            "response": "Nope, I did not come across any till now. \n\nLook at https://www.ankr.com/\n\nYou will find none of it that affordable and light.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia1rue0",
                    "author": "crypto_lunatic",
                    "score": 0,
                    "created_utc": 1653561163.0,
                    "response": "Motivated Reasoning\n\nhttps://en.wikipedia.org/wiki/Motivated_reasoning",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}