{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uzouv7",
            "title": "✨ Crypto Crazy Gambling - I made more than $500 in a day [NO KYC] ✨",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/uzouv7/crypto_crazy_gambling_i_made_more_than_500_in_a/",
            "author": "Marikabby9",
            "created_utc": 1653749358.0,
            "score": 0,
            "num_comments": 2,
            "subreddit": "BitcoinBeginners",
            "selftext": "Recent research suggests that the global gambling industry generates annual revenue of over $700 billion.\nThis is no surprise given the incredible range of options provided by cryptocurrency gambling sites.\n\nThere are many different types of crypto gambling sites out there. Some allow you to bet on sports, others let you bet on stocks, some let you bet on politics, and so on. But what makes them unique is the fact they all accept cryptocurrencies as payment.\n\nThere are many advantages to using crypto for gambling. One of them is anonymity. This means you don’t have to disclose your identity to anyone else. Another advantage is that it allows you to bet anywhere in the world without having to worry about where you live.\nAnother benefit is that you can gamble whenever you want. There are no restrictions on what time you can place your bets. And there’s no need to wait until the next day to see how your bet turned out.\nWhen it comes to privacy, you can choose to remain anonymous or not. If you do decide to log into your account anonymously, then you won’t have to worry about your IP address being tracked.\n\nhttps://crazy.sites.google.com/view/btc-crazy-gambling",
            "stickied": false,
            "comments": [
                {
                    "id": "iabgreh",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653749359.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}