{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "utrezm",
            "title": "Wallets for beginners",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/utrezm/wallets_for_beginners/",
            "author": "ScrewTheBanker",
            "created_utc": 1653043598.0,
            "score": 8,
            "num_comments": 11,
            "subreddit": "BitcoinBeginners",
            "selftext": "1 year into my BTC journey and I'm starting to think about self custody. But I'm terrified of trying to take my holdings off the exchanges. \nI like the idea of a hard wallet but which ones are bomb proof and idiot proof? I need simplicity and something that has a history of lasting forever.\nI understand that I should keep my seed phrase in multiple places separate from my wallet and I like the idea of a stamped metal card incase of fire or water damage. I also understand I should buy direct from the company producing the wallet.\nI think I just need some advice and reassurance.\nAlso what sort of charge/fee will I incur from the exchanges for transferring off the exchange? Coinbase & CryptoCom\nShould I leave my other cryptos on the exchange and just worry about self custody of my btc?",
            "stickied": false,
            "comments": [
                {
                    "id": "i9basqm",
                    "author": "Desperate-Barnacle-4",
                    "score": 2,
                    "created_utc": 1653044574.0,
                    "response": "Read the pinned beginner FAQ it may address some of your fears.\n\nYou can't really go wrong with a ledger nano s or trezor one. I believe both manufacturers sell a bundle/option for steel seed backup. And they both provide an easy to use app to interface with the hardware wallet.\n\nBitbox02 hardware wallet is a more premium option and they also offer an intro' call to setup the wallet. And they have backup options like steel and tamper evident bags etc. They have focused on making the user experience very smooth. It is worth a look. [https://shiftcrypto.shop/en/#products](https://shiftcrypto.shop/en/#products) (I have a Bitbox02 bitcoin only.)\n\nExchanges may charge like 0.0005 Bitcoin to withdraw to your own wallet. Nothing to worry about.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9bpznq",
                    "author": "GibbsSamplePlatter",
                    "score": 2,
                    "created_utc": 1653052578.0,
                    "response": "If you don't have an insane amount it's also ok to just use a reputable wallet on your phone for example. I use Green for that.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9brky5",
                            "author": "DigitallyInclined",
                            "score": 2,
                            "created_utc": 1653053285.0,
                            "response": "Same here. Blockstream Green Wallet on my iPhone is perfect for me.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9bwuf3",
                                    "author": "GibbsSamplePlatter",
                                    "score": 2,
                                    "created_utc": 1653055549.0,
                                    "response": "Disclaimer I used to be a dev for the wallet but I'm also a customer since 2014. No problems in a number of years now.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9b99y9",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653043599.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9b9j7h",
                    "author": "509BandwidthLimit",
                    "score": 1,
                    "created_utc": 1653043790.0,
                    "response": "Not shilling for Ledger, but it is easy. Check out The Crypto Dad on YT, he shows you exactly how to setup and use with different exchanges.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9bnttu",
                    "author": "BTCMachineElf",
                    "score": 1,
                    "created_utc": 1653051587.0,
                    "response": "Trezor is a solid choice. I recommend avoiding Ledger. They're cheaply made and the led is small and hard to read.\n\nStart by sending a small amount to the wallet. Wipe and restore the wallet using the seed and you will gain a lot of confidence in the setup.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9bvska",
                    "author": "bitusher",
                    "score": 1,
                    "created_utc": 1653055105.0,
                    "response": "You should focus on open source non custodial wallets. Once you have over 1k usd of bitcoin you should seriously consider getting a hardware wallet . Do not using wallets in windows or osx without a hardware wallet. If you can't afford a hardware wallet use a wallet in ios or android. \n\nsome wallets \n\nhttps://walletscrutiny.com\n\nhttps://docs.google.com/spreadsheets/d/1aZ1zbaUEzCo9NCctN8-eL2VLIiSdY009tTJvRXDUWEw/edit#gid=0\n\nhttps://www.reddit.com/r/BitcoinBeginners/comments/g42ijd/faq_for_beginners/",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}