{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "usmxk0",
            "title": "Will Fees on Bitcoin's Lightning Network Rise?",
            "url": "https://www.youtube.com/watch?v=xIMAKmkbt7Q",
            "author": "undertheradar48",
            "created_utc": 1652908292.0,
            "score": 2,
            "num_comments": 14,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9501je",
                    "author": "whitslack",
                    "score": 6,
                    "created_utc": 1652917379.0,
                    "response": "Lightning routing is a fiercely competitive market with near-zero entry costs. The fees will always only barely cover the operating costs, with just enough profit to make the minimal hassle of maintaining a node worthwhile.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i964z1k",
                            "author": "llewsor",
                            "score": 3,
                            "created_utc": 1652938870.0,
                            "response": "lightning nodes is the decentralization of a public utility like water or electricity (in most countries) but now for payments. government subsidized utilities tend to become inefficient and get bloated bureaucratically due to no competition. but if a utility is publicly subsidized (decentralized) then there is competition and an incentive to reward an efficient and cheap payment network.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i94h5xx",
                    "author": "Nada_Lives",
                    "score": 2,
                    "created_utc": 1652908919.0,
                    "response": "Tell me if you know what they are right now, and how they compare with the Visa fee on your next Arby's.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i94nq70",
                            "author": "undertheradar48",
                            "score": 3,
                            "created_utc": 1652911724.0,
                            "response": "I don't know what they are today, but I suspect they'll always be below the fees that Visa charges, especially on small day-to-day payments.\n\nConsumers should benefit from a system where anyone can participate in the payment routing with their own capital.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i94scy6",
                                    "author": "Euphoric-Surprise293",
                                    "score": 1,
                                    "created_utc": 1652913797.0,
                                    "response": "Just wait until the reach massive adoption. Don’t buy Jack Meller’s narrative. They also would love to become a monopoly and then raise prices.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i96b7mi",
                                            "author": "Keith_Kong",
                                            "score": 3,
                                            "created_utc": 1652943752.0,
                                            "response": "Jack Maller isn’t trying to monopolize the lightning network nodes. He’s trying to monopolize the nodes integrating into merchant payment machines and online portals.\n\nIf he does, then raises prices, these companies like NCR will simply invest in their own Lightning integrations. The payment network itself makes the cost of doing this near zero because you don’t need your customers to switch out what they’re using.\n\nIn Jack’s perfect world, he manages all the merchant nodes with Strike, takes a very small fee to make it seem pointless to move away, and continues having a Bitcoin profit generating business with near zero maintenance costs.\n\nHis solution to instantly swap dollars with Bitcoin is actually his largest utility advantage and probably remains the only reason these companies don’t just integrate with lightning themselves. It’s a must have for merchants right now.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i952h23",
                                            "author": "Nada_Lives",
                                            "score": 1,
                                            "created_utc": 1652918539.0,
                                            "response": "You learned this From Jack Meller?",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i97qj5b",
                                    "author": "varikonniemi",
                                    "score": 1,
                                    "created_utc": 1652975210.0,
                                    "response": "lightning, just like visa, does not care about the size of the payment as fee is in %",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i98lnh1",
                                            "author": "undertheradar48",
                                            "score": 1,
                                            "created_utc": 1652987791.0,
                                            "response": "not true for visa, their $0.30 fixed fee means they can't really support payments for less than a few dollars",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9awlb5",
                                                    "author": "varikonniemi",
                                                    "score": 1,
                                                    "created_utc": 1653033107.0,
                                                    "response": "well, lightning also has a fixed fee aspect currently, but it is being advocated for removal in the future. #zerobasefee",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9bcxmy",
                                                            "author": "undertheradar48",
                                                            "score": 1,
                                                            "created_utc": 1653045893.0,
                                                            "response": "40-47% of the network already supports zero base fee",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i94pp6p",
                    "author": "HandyStoic",
                    "score": 1,
                    "created_utc": 1652912594.0,
                    "response": "I wonder if eventually fees would pay as much as a reasonable bank deposit interest? I can see people risking their BTC on nodes now to contribute to the development/liquidity of the network but if the LN is going to be used for payments, people will need to keep most of their BTC on the LN to keep it liquid and avoid future base layer access delays. Will people will be incentivised to \"deposit\" their BTC on nodes and get returns that are propotionate to the risk? I have an Umbrel node with LN and haven't set up funded channels yet but admittedly have not put much time into it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i964l8n",
                    "author": "Mallardshead",
                    "score": 1,
                    "created_utc": 1652938600.0,
                    "response": "Tx fees will always be basically free. It'll always be a race to the bottom. This is why Coinbase and  legacy payment systems despise the LN. There are also plenty of Maxi's like myself who set their node's routing fees to ZERO.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}