{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uzjhf0",
            "title": "A way governments can attack Bitcoin?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uzjhf0/a_way_governments_can_attack_bitcoin/",
            "author": "LiquidSilverJ",
            "created_utc": 1653728686.0,
            "score": 2,
            "num_comments": 21,
            "subreddit": "Bitcoin",
            "selftext": "I saw another post in the sub of how Bitcoin can be attacked: [https://www.reddit.com/r/Bitcoin/comments/uzefqy/comment/iaa9hwi/?utm\\_source=share&utm\\_medium=web2x&context=3](https://www.reddit.com/r/Bitcoin/comments/uzefqy/comment/iaa9hwi/?utm_source=share&utm_medium=web2x&context=3)\n\n&#x200B;\n\nI am thinking of the following scenario:\n\n&#x200B;\n\n\\- A government or many governments do a fork of Bitcoin.\n\n\\- Perhaps they change to a PoS mode so they can control it better.\n\n\\- Through attacking Bitcoin through mainstream media, they convince people it's better to switch to this new fork.\n\n\\- Meanwhile, they can do anything they want with this new coin.\n\n&#x200B;\n\nI'd like to hear your thoughts on this. How likely is such a scenario? If it's theoretically possible, how can we steel against it?",
            "stickied": false,
            "comments": [
                {
                    "id": "iaarqwo",
                    "author": "codingwithcoffee",
                    "score": 11,
                    "created_utc": 1653734059.0,
                    "response": "Bitcoin is decentralized. \n\nWhich means that for anyone - including “many governments working together” - to “do a fork of bitcoin” they need to first change the code (easy) and then get the new code accepted as the new “Bitcoin”. (Extremely difficult). \n\nTo do this they need to convince the majority of miners and node operators to run the new fork of the code. \n\nNobody - and I mean NOBODY - is going to switch to running “FedCoin” no matter how slick their mainstream media marketing campaign is.\n\nIt would at best end up as a parallel blockchain with its own coin - like Bitcoin Cash.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaaobv8",
                    "author": "MrQ01",
                    "score": 7,
                    "created_utc": 1653730957.0,
                    "response": "Why would they copy Bitcoin in order to then make it not Bitcoin? Why not just start with a proof-of-stake coin.\n\n>\\- Through attacking Bitcoin through mainstream media, they convince people it's better to switch to this new fork.\n\nWhat's constitutes as being \"better\"? For every supposed \"flaw\" of Bitcoin, from slow transaction speeds to not being PoS, hard-forks have already been made. And all have pretty much flopped. So \"better\" doesn't mean anything nowadays - what problem would this government coin be solving that Bitcoin doesn't already solve.\n\nTheoretically possible? Well, the EU is already promoting proof of stake over proof of work, with the . They're already talking about a potential CBDC, and convincing people that  a CBDC makes Bitcoin redundant is a red herring that's already been pushed around, and accepted by people.\n\nIf you want to steel against it, just don't fall for the governments antics, and buy and self-custody your Bitcoin. The education is already out there for people who want to do their own research.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaamwk4",
                    "author": "redhtbassplyr",
                    "score": 2,
                    "created_utc": 1653729651.0,
                    "response": "Well going back on a gold standard isn't happening like in the other post. This would completely collapse the economy. That have to seize banknotes or reissue new ones and render the old ones illegitimate. We operate way beyond what can be backed by physical stores of gold. There's no going back without financial ruin across every country in this world.\n\nGovernments can't fork Bitcoin bc they don't control Bitcoin. They could create a new coin that is either backed by something or not and try to convince the people to adopt it like you said but why would anybody listen to them. This would be equivalent to buying snake oil from the snake oil salesman back in the wild west days except the snake oil salesman would be your government. I think people have wised up or would wise up really quick",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaanjtp",
                            "author": "LiquidSilverJ",
                            "score": 2,
                            "created_utc": 1653730268.0,
                            "response": "\"I think people have wised up or would wise up really quick\"\n\n&#x200B;\n\nThat's what I hope also. People will (probably at least) easily understand the difference between a decentralized coin and a CDBC coin, which can track you, and in the end also control you.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iaao2pv",
                                    "author": "redhtbassplyr",
                                    "score": 2,
                                    "created_utc": 1653730737.0,
                                    "response": ">CDBC coin, which can track you,\n\nI think this is probably enough to deter. If anything is true in this country it's that people don't trust our government and they may not understand cryptocurrency worth a damn but once you say that they're being tracked game over. The media does a terrible job of separating the two most likely purposefully and lump in stable coins, Bitcoin, CDBC coins, even talking about China launching CDBC All as one in the same lol\n\nI think the most likely scenario to ever wipe out Bitcoin is the same thing that would wipe out our current financial system that is predominantly electronically based and that's just global catastrophe and or global war with widespread long-standing power and internet outages. It would be tough for Bitcoin to operate, while not impossible not very practical if this scenario were to arise. At the same time your debit card, credit cards, and electronically ledgerd bank accounts would be pretty impractical as well. Banks going back to operating without internet and electronics wouldn't be very successful at all. Transactions and banking in general would grind to almost a halt or at best a slow crawl",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iaaobdg",
                                            "author": "xanmoth",
                                            "score": 1,
                                            "created_utc": 1653730943.0,
                                            "response": "Shit that's dark.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "iaatu5e",
                            "author": "smellyboi6969",
                            "score": 2,
                            "created_utc": 1653735784.0,
                            "response": "Ehh they could just ban all of the exchanges and POS systems accepting BTC from operating in the their country. Would it eliminate everyones access from exchanges, certainly not. Where there is a will there's a way. But it would make things exponentially more complicated for the avg Joe which would have a drastic impact on demand and drive the price way down.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iaaua4f",
                                    "author": "redhtbassplyr",
                                    "score": 2,
                                    "created_utc": 1653736142.0,
                                    "response": "Absolutely they could, but this would take litigation against private companies that are pretty well established at this point like Coinbase, square, RobinHood and even heavier players like Fidelity. The more that gets established the more that it's going to take to destroy it, and these private companies will fight tooth and nail, throw money and lawyers at the situation and make it pretty difficult in reality to achieve. \n\nEven if they did which I'm not saying is impossible, then It would still take the majority of countries on earth to collectively want to kill it to pull this off. If half the world is on board and have to world isn't then you just get on a plane with your hardware wallet and go to a Bitcoin friendly country and figure out how to sign up on an exchange they have access to to be able to convert your Bitcoin or you can probably find it private broker or buyer that you could just send Bitcoin directly to. \n\nI don't think this will happen though because the countries that bar it are risking exclusion from a new established financial system. They'd be shooting themselves in the foot.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iacu9fj",
                                            "author": "smellyboi6969",
                                            "score": 1,
                                            "created_utc": 1653772871.0,
                                            "response": "Well it's been done before so in actuality it just depends on the will of those in power. Look at China as an example of a country that banned BTC. Of course a country banning BTC does not mean the currency itself will fail. I don't think BTC will ever fail in our lifetime simply due to the maximalists who have invested so much already. They will never give up.\n\nI don't think the US govt will ban crypto at least anytime soon. However, I could imagine a situation where a major terrorist attack occurs funded in BTC or major war erupts where the adversary is using BTC for war funding where the US or most western nations would deem it necessary to shut it down. I think it is unlikely but possible",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iaanwa2",
                    "author": "solomonsatoshi",
                    "score": 2,
                    "created_utc": 1653730573.0,
                    "response": "Not viable. Far too blatant and obvious. Very few Bitcoiners would believe any MSM anti Bitcoin FUD.\n\nWhat is much more likely is BTC ETFs are allowed and then absorb a large enough amount of BTC that then a modern day Order 6102 bans private custody...then the banks and government have effectively taken control of Bitcoin. \n\nThis is their plan. Capture and control.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaaqpv7",
                    "author": "BusinessBreakfast3",
                    "score": 2,
                    "created_utc": 1653733165.0,
                    "response": "That's not Bitcoin.\n\nThe argument is the same that you would say for any other cryptocurrency.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaay7fl",
                    "author": "krisycoll",
                    "score": 2,
                    "created_utc": 1653738981.0,
                    "response": ">Through attacking Bitcoin through mainstream media, they convince people it's better to switch to this new fork.\n\nHere is the point of failure i think. People who run nodes probably have a minimal bitcoin technology understanding so they will never agree, and even less if the idea come from governments",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaazm0k",
                    "author": "TiredTim23",
                    "score": 2,
                    "created_utc": 1653739906.0,
                    "response": "Here is the government action I want to see with crypto... @7seconds https://youtu.be/F3d_Cu5Mzbk",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iabl7oz",
                    "author": "Nada_Lives",
                    "score": 2,
                    "created_utc": 1653751458.0,
                    "response": "* *A government or many governments do a fork of Bitcoin.*\n\nThen wait around for someone dumb enough to use it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaam5kj",
                    "author": "Solana25",
                    "score": 1,
                    "created_utc": 1653728939.0,
                    "response": "By claiming it’s used for money laundering",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iaannk1",
                            "author": "LiquidSilverJ",
                            "score": 2,
                            "created_utc": 1653730358.0,
                            "response": "I think this statement has been made so many times that it has lost its power over time. The trendiest way media attacks bitcoin right now is through the environmental angle.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "iaar2ve",
                                    "author": "BrokebackStonker",
                                    "score": 1,
                                    "created_utc": 1653733484.0,
                                    "response": "I honestly don’t see why you downvoted his comment.   \n\nMoney laundering is the #1 reason the government tried to take control of every situation. \n\nYou also asked for people’s opinion…\n\nThen you down vote them when they give it to you.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "iaard8c",
                                            "author": "LiquidSilverJ",
                                            "score": 1,
                                            "created_utc": 1653733744.0,
                                            "response": "I didn't downvote it.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "iacp397",
                    "author": "life762",
                    "score": 1,
                    "created_utc": 1653770384.0,
                    "response": "A government with a complicit media can indeed pull off some very sophisticated psyop campaigns to convince the public to believe in all sorts of wrong things. This is why an independent, critical media is so important.\n\nIt became more difficult to pull off with the advent of an uncensored internet, but they are trying to get their power back by establishing information gatekeepers on the internet so they can again control what information people see and therefore make them more controllable.\n\nThis isn't a unique problem to Bitcoin. It can lead to bad things and loss of liberty in all aspects of your life. It is something all citizens of every nation should be concerned about and constantly pushing back top-down control.\n\nSo yeah, governments can attack Bitcoin. In all sorts of ways. Bitcoin is resistant to such attacks -- Bitcoin will keep on working, tick tock next block, whether or not a government CBDC is foisted on people -- but we can't ever be complacent. Just because governments can't outright kill the Bitcoin network doesn't mean they can't take your liberty and make your life crappy.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iacx9s1",
                    "author": "blaze1234",
                    "score": 1,
                    "created_utc": 1653774259.0,
                    "response": "Just make exchanging for fiat illegal",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iad17er",
                    "author": "BitcoinUser263895",
                    "score": 1,
                    "created_utc": 1653776103.0,
                    "response": "> - A government or many governments do a fork of Bitcoin.\n\nWhy would you buy their not-Bitcoin?\n\n> - Perhaps they change to a PoS mode so they can control it better.\n\nWhy would you buy their not-Bitcoin?\n\n> - Through attacking Bitcoin through mainstream media, they convince people it's better to switch to this new fork.\n\nWhy would you buy their not-Bitcoin?\n\n> - Meanwhile, they can do anything they want with this new coin.\n\nWhy would you buy their not-Bitcoin?\n\n> How likely is such a scenario? \n\nWhy would you buy their not-Bitcoin?",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}