{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "urrvl5",
            "title": "Eventually, Bitcoin Needs SMALL Inflation (Unpopular Opinion)",
            "url": "https://www.reddit.com/r/Bitcoin/comments/urrvl5/eventually_bitcoin_needs_small_inflation/",
            "author": "JohnnyBlack22",
            "created_utc": 1652809262.0,
            "score": 0,
            "num_comments": 17,
            "subreddit": "Bitcoin",
            "selftext": "**Human beings are irrationally risk averse.**\n\nThis is something psychologists, economists, and responsible central bankers have known for centuries, and it's the reason that pure deflationary money creates economic stagnation.\n\nThe big players can overcome this inherent human bias, and they will still invest their deflationary savings in productive ventures, but the average consumer won't. The flow of money dries up because the average consumer, as stated before, is risk averse - why would they risk the guaranteed appreciation of their money for a venture with a higher return?\n\n## Humans are not Pure Austrian Agents\n\nTime and time again, economies with deflationary policies have stagnated. This is *not because of supply and demand* \\- in a pure Austrian world, the economy can function just fine with any amount of money. This is because of a human bias towards risk aversion.\n\nThat's why responsible central banks have always targeted somewhere around 2% as their inflation target. That small inflation shifts the equilibrium point towards investment. In a pure supply and demand world, you'd now get 2% *mal*investment, but in the human world where the equilibrium, due to risk aversion, is *not enough investment*, the 2% pressure actually puts us right where we want to be.\n\nThe prosperity of the Byzantine Empire, as well as other fiscally responsible historical nations that used gold as their monetary standard, constitutes proof that hard money systems work. However, the supply of Gold inflates between 1-2% / year, not 0%. This creates that same *small* investment pressure necessary for human economic prosperity.\n\n## This Won't Break Bitcoin\n\nWhat I'm suggesting is *nothing at all* like the ridiculous yield chasing happening with passive investing right now, but rather a tiny nudge to counteract human bias.\n\nBitcoin's best property is that it is decentralized in such a way that a bailout is impossible. *That* is what makes it the money of the future, not it's deflationary nature. In America, we're used to our politicians being so inflationary that we've added an \"inflation = evil\" node in our brain. But that's not accurate. Deflation, which causes risk averse humans to not invest, is similarly damaging.\n\nAs a last bit of evidence for what I'm talking about, think about how many Bitcoiners will \"never sell their Bitcoin\" for anything. Now, never selling it for fiat, of course. That's for sure.\n\nBut many of them really do mean \"never sell for *anything*\". And this is the precise kind of risk aversion that happens under deflationary money. It creates economic stagnation, because capital sits idle instead of in new, productive, investment.\n\n## Who Pays For Inflation?\n\nLet's talk about the method of inflation of Bitcoin, and who pays. New currency goes to the miners. This means that every holder of Bitcoin pays the miners a small fee to *hold* their Bitcoin. Not to send it. This is the correct model from a labor standpoint. Your Bitcoin only has value because of the mining apparatus, and so it's appropriate that you'd pay the miners a small fee for holding it.\n\nIf this small cost doesn't exist, you get to hold Bitcoin for free, and the miners are working for free. They have to make up the costs in transaction fees. This means that you are allowing the *spenders* to foot the bill for the *savers*. That's just the inverse of what we have now.\n\nIn an equilibrium with human risk aversion factored in, you pay a very small inflationary cost to hold Bitcoin. That cost goes to the miners. There is no Cantillion effect, because mining is inherently equitable by the protocol, and just like today, the only criterion for who gets the new money is computing power. This small inflationary pressure offsets natural human risk aversion, and creates economic prosperity under hard money. With this, Bitcoin becomes a strictly superior version of gold.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8z0cix",
                    "author": "dpc_pw",
                    "score": 10,
                    "created_utc": 1652809616.0,
                    "response": "Buy \"The Fiat Standard\" and read it.\n\nThe idea that people require monetary encouragement to spend money is one of the most absurd things that fiaters believe. :)",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8z3thu",
                            "author": "JohnnyBlack22",
                            "score": 1,
                            "created_utc": 1652811021.0,
                            "response": "I'll check it out. What's the counter-argument to the \"humans are irrationally risk averse\" argument.\n\nDoes it provide evidence of deflationary civs that have flourished? Give me the quick 5 line summary here.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8z6lzi",
                                    "author": "Keith_Kong",
                                    "score": 3,
                                    "created_utc": 1652812161.0,
                                    "response": "The main counter point is that people are not holding wealth in order to not ever deploy it. At some point, you feel like your savings are sufficient and you begin to upgrade your life.\n\nIf Bitcoin was the only money (no trading to fiat, etc) there is no such thing as people “never selling it”. They have to eat, they have to pay their mortgage, they want to go on vacation, they want to retire and live off their savings, etc.\n\nDeflationary money doesn’t stop spending. Keynesian (fiat) philosophy conflates investment with spending. What they are really trying to do is incentivize investment (because you are guaranteed to lose your savings if you don’t). Their argument is that by sending more capital to investments it will drive real growth and innovation in the economy.\n\nWhat really happens? Capital allocation becomes confused as the money which does not actually want to be invested seeks the lowest risk investments. This causes the broad indexes to develop a monetary premium on top of fundamental value analysis of the companies.\n\nThis results in massive capital misallocation where practically everything becomes arbitrarily priced and increasingly volatile. Do you buy the S&P500 based on company valuations? Or do you account for the fact that the largest demographic alive is now retiring with 401k’s largely invested in the index (causing increased sell pressure).\n\nInflation has not improved REAL growth. It has subsidized the largest public companies with people’s retirement savings. A similar analysis can be applied to property as a store of value asset (raising housing prices and rent prices).\n\nWe still have booms and busts… the original criticism blamed on the gold standard. Only now the prices never come back down to where they were in the past and savings are just gone for everyone.\n\nEdit: I want to add, there is no historical precedence for a truly “deflationary money”. First, gold inflates at the suggested 2% rate you are saying Bitcoin “needs”. Second, banks have always been able to centralize and debt monetize that gold such that they were expanding the gold notes beyond the actual gold (eventually leading to a bust of the credit boom).\n\nDebt has ALWAYS been the source of booms and busts which cause the market inefficiencies and recessions.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8znebt",
                                    "author": "dpc_pw",
                                    "score": 1,
                                    "created_utc": 1652819054.0,
                                    "response": "Most of what's in this book is (more briefly, but still) mentioned in https://www.youtube.com/watch?v=gp4U5aH_T6A",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8z22ox",
                    "author": "CoinCorner_Sam",
                    "score": 6,
                    "created_utc": 1652810310.0,
                    "response": "Sorry but that's not correct. Savers shouldn't be forced to spend. We have only one planet (full of resources), we don't need to have 1.02 of the same planet next year.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8z3lkq",
                            "author": "JohnnyBlack22",
                            "score": 1,
                            "created_utc": 1652810931.0,
                            "response": "Altering the money supply by 1.02 does nothing to alter the resources. It merely creates a small incentive towards investment.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8z4rrg",
                                    "author": "effexzi",
                                    "score": 1,
                                    "created_utc": 1652811411.0,
                                    "response": "There's no reason to invest if your money isn't being devalued. 😁",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8z3u01",
                    "author": "KazeFantasia",
                    "score": 5,
                    "created_utc": 1652811027.0,
                    "response": "No, why to mimics fiat when fiat is such a mess?\nKeep the 21m ceiling forever and build another system on this.\nWhen 21m ceiling can be changed, definitely someone will fight for this power and change it again. This is rent-seeking behavior. Only solution is not to let it happen.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8z20nm",
                    "author": "NiceDoctorBeam",
                    "score": 4,
                    "created_utc": 1652810288.0,
                    "response": "You've been fed bullshit brainwashing.  I do hope you eventually break free.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8z3hds",
                            "author": "JohnnyBlack22",
                            "score": 1,
                            "created_utc": 1652810883.0,
                            "response": "Do you have any historical evidence of a deflationary economy that flourished? \n\nBecause if not, maybe you're just overreacting to the fact that the current exploitative monetary policy is inflationary, rather than actually thinking through the economics of human behavior.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8z4ot9",
                                    "author": "NiceDoctorBeam",
                                    "score": 1,
                                    "created_utc": 1652811376.0,
                                    "response": "There are examples of long periods of gold being used as money for centuries, various places at various times.  \n\nThe fact you're not aware of them means you know less about this topic than I.\n\nThen there are plenty of examples of fiat-currency based economies causing great suffering and eventual collapse.  All fiat currencies lose value until they get to zero.  No exceptions.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8zom6p",
                                            "author": "travman7777",
                                            "score": 1,
                                            "created_utc": 1652819566.0,
                                            "response": "Your comment is dodging his question. Do you have an example? Otherwise say you don't and spare us the \"listen to what I say because I'm smart\" argument.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8z06yk",
                    "author": "VariousTransition795",
                    "score": 4,
                    "created_utc": 1652809556.0,
                    "response": "Just use some shitcoin and fuck off",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8z3pwq",
                            "author": "JohnnyBlack22",
                            "score": 0,
                            "created_utc": 1652810981.0,
                            "response": "No. Shitcoins are shit because they are centralized and don't use proof of work. That's the same problem with fiat.\n\nWith small inflation, Bitcoin is still Bitcoin.\n\nDid you even read the post...",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8ze0zg",
                    "author": "BashCo",
                    "score": 1,
                    "created_utc": 1652815190.0,
                    "response": "Then it wouldn't be Bitcoin anymore.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8zobqo",
                    "author": "TheGreatMuffin",
                    "score": 1,
                    "created_utc": 1652819443.0,
                    "response": "If bitcoin's supply is changed at any point, the whole thing is dead.  \n\nFirst, if the transaction fees are not enough to carry the network security after the subsidy declines (after the next 3-5 halvings or so), it would indicate that society isn't really interested in bitcoin. So why keep up alive a project that failed on a larger scale?  \n\nSecond, if the supply is tinkered with, what stops it from being tinkered with again in the future? There goes one of the fundamental security assurances, so why should anyone be interested in bitcoin then?  \n\nThis is a bit exaggerated, there might still be usecases for bitcoin in the future of course, even if society as a whole turns out to be not interested in bitcoin, but then it's a failed zombie project already, so who cares what happens with the supply cap.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "urs2qy",
            "title": "Would a global bitcoin standard cause overpopulation? Humans can't afford to have kids under a fiat standard. Would they be able to afford unlimited number of kids under a bitcoin standard?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/urs2qy/would_a_global_bitcoin_standard_cause/",
            "author": "hyperinflationUSA",
            "created_utc": 1652809806.0,
            "score": 0,
            "num_comments": 4,
            "subreddit": "Bitcoin",
            "selftext": "~~If i understand humans create carbon dioxide which is bad for the environment therefore bitcoin is bad for the environment becuase it allows the population to grow.~~\n\n~~Fiat currency is good for the environment becuase it comes from trees which produce oxygen. We need to plant more trees to grow more paper currency. Fiat is good for the environment.~~",
            "stickied": false,
            "comments": [
                {
                    "id": "i8z69vz",
                    "author": "Obvireal",
                    "score": 1,
                    "created_utc": 1652812024.0,
                    "response": "Weird. The more people the better in my opinion. Yeah we may get overpopulated but we can use technology to hurdle the problems and in 100 years there will be enough volunteers to populate space",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i909l5p",
                    "author": "ludwigvonmises",
                    "score": 1,
                    "created_utc": 1652828797.0,
                    "response": "Only the cities are overpopulated. The Earth can support billions more humans.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i90jggp",
                    "author": "wkw3",
                    "score": 1,
                    "created_utc": 1652833537.0,
                    "response": "Poor nations are often some of most populous. When you have no money, it's more like cheap labor than a dependent.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i90tkfg",
                    "author": "zigzrx",
                    "score": 1,
                    "created_utc": 1652838292.0,
                    "response": "We only appear to be reaching over population because the elite few own millions of acres the commons will never be able to step foot on.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "urs6la",
            "title": "Bitcoin is freedom",
            "url": "https://youtu.be/7Tbi6O212Fs",
            "author": "oldgodemo1",
            "created_utc": 1652810098.0,
            "score": 5,
            "num_comments": 3,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8z8gwz",
                    "author": "LordMinax",
                    "score": 3,
                    "created_utc": 1652812920.0,
                    "response": "Free from what?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i900x7x",
                            "author": "saladfingers6",
                            "score": 1,
                            "created_utc": 1652824810.0,
                            "response": "Fiat slavery financial censorship and control.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i910f1e",
                    "author": "TheWorldOfCrypto",
                    "score": 1,
                    "created_utc": 1652841561.0,
                    "response": "I truly believe that.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}