{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uz662z",
            "title": "Saving in Bitcoin is its first and best use case, not spending it.",
            "url": "https://thehificrypto.substack.com/p/to-hodl-bitcoin-is-to-use-bitcoin",
            "author": "jguest1105",
            "created_utc": 1653680755.0,
            "score": 11,
            "num_comments": 8,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "ia8emud",
                    "author": "coinfeeds-bot",
                    "score": 2,
                    "created_utc": 1653681639.0,
                    "response": "tldr; Bitcoin is the best iteration of money humanity has ever seen. It’s just like the fiat sitting in your pocket, but more secure. Bitcoin users to a large extent trust Bitcoin to retain its value, especially over long time frames. The majority of Bitcoin on the network is currently being used for saving wealth through hodling rather than spending wealth.\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia9p8lb",
                    "author": "King-Donkey-Kong",
                    "score": 2,
                    "created_utc": 1653704986.0,
                    "response": "I disagree.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia8d9ym",
                    "author": "Nada_Lives",
                    "score": 1,
                    "created_utc": 1653681021.0,
                    "response": "Transferring keys from one address to another is Bitcoin's ONLY function. What you do with them Bitcoin doesn't care.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia9bjba",
                            "author": "jguest1105",
                            "score": 1,
                            "created_utc": 1653697722.0,
                            "response": "Function and use case are not always synonymous, and I’m not using them synonymous here. Bitcoin’s software may only have one function, but we can use that one function in a variety of ways",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia9jkui",
                                    "author": "Nada_Lives",
                                    "score": 2,
                                    "created_utc": 1653701988.0,
                                    "response": "Then I'd say that facilitating trade is first and best. Without that Bitcoin would have no purpose to save it for.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia9r7hg",
                    "author": "dfunkmedia",
                    "score": 1,
                    "created_utc": 1653706003.0,
                    "response": "Saving is fundamentally the best strategy with any deflationary asset. If supply is steady or declining and value increases as a function of supply, it's a given that saving will usually yield better utility than spending. Negating the advantage of compound interest, this makes the increasingly common Millennial belief that Bitcoin is retirement money a fairly safe bet despite short term swings (hence the popular \"zoom out, DCA, hodl\" advice).",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia9wfng",
                    "author": "Dankmanchilliwilli",
                    "score": 1,
                    "created_utc": 1653708827.0,
                    "response": "I think everyone has their price",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}