{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "us1m28",
            "title": "Asia trading hours are currently trading at the highest premium since last summer.",
            "url": "https://www.reddit.com/r/Bitcoin/comments/us1m28/asia_trading_hours_are_currently_trading_at_the/",
            "author": "polloponzi",
            "created_utc": 1652837342.0,
            "score": 0,
            "num_comments": 2,
            "subreddit": "Bitcoin",
            "selftext": "Asia has dominated this market for the last 2 years. They dumped their inventory on the US/EU at the top in early 2021 and bought back their coins from them in summer.  \n\n&#x200B;\n\nhttps://preview.redd.it/87o1xa9f05091.png?width=680&format=png&auto=webp&s=adb70e88af494a630bc4a1752414bd9e37708c07\n\nTheir trading hours are currently trading at the highest premium since last summer.\n\nVia: [https://twitter.com/WClementeIII/status/1526593294293147648](https://twitter.com/WClementeIII/status/1526593294293147648)",
            "stickied": false,
            "comments": [
                {
                    "id": "i90tty2",
                    "author": "Tiggsweld",
                    "score": 1,
                    "created_utc": 1652838416.0,
                    "response": "China is a communist country that is completely controlled by the government.  So it's people and government act as one.  Only thing is that their government is a great at trading and much smarter than most people ( probably most people on the planet).  \n\nThat said,  they are also great crypto traders and know when to take profits.   They don't want their people to get burned like all of us \"holders\" in the US and everywhere else.   They tell their people when to BUY by \"unbanning\" crypto, then  force them to SELL by banning it again.  They have done this several times. \n\nYou think their people are all pissed off about the bans ? Hell no.  They are laughing their asses right to the fucken bank with our money.  \n\nImagine you were forced to maximum gains ? Imagine you had big brother telling you EXACTLY  when you buy and sell ?  Would you be mad ?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9104q8",
                            "author": "polloponzi",
                            "score": 1,
                            "created_utc": 1652841422.0,
                            "response": "Asia is more than China",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}