{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "usj2wb",
            "title": "https://www.customink.com/fundraising/we-want-to-raise-money-to-educate-the-youth-about-bitcoin-through-entertainment",
            "url": "https://www.reddit.com/r/Bitcoin/comments/usj2wb/httpswwwcustominkcomfundraisingwewanttoraisemoneyt/",
            "author": "HarryArtin",
            "created_utc": 1652897552.0,
            "score": 1,
            "num_comments": 1,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i93r0r5",
                    "author": "Nada_Lives",
                    "score": 1,
                    "created_utc": 1652898192.0,
                    "response": "Most educational material being written today is done on T-shirts, sadly.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "usiw3k",
            "title": "#BTC",
            "url": "https://www.reddit.com/r/Bitcoin/comments/usiw3k/btc/",
            "author": "SkirtTechnical1691",
            "created_utc": 1652897040.0,
            "score": 0,
            "num_comments": 4,
            "subreddit": "Bitcoin",
            "selftext": "Yesterday, many central bank governors and important officials learned bitcoin live at the summit. Will this be good news for the market?",
            "stickied": false,
            "comments": [
                {
                    "id": "i93orio",
                    "author": "TheGreatMuffin",
                    "score": 1,
                    "created_utc": 1652897280.0,
                    "response": "> Will this be good news for the market?  \n\nWhat do you mean, \"will\"? That's the news from yesterday and the market has most likely priced it in way ahead of you hearing it ;)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93s4ve",
                    "author": "Nada_Lives",
                    "score": 1,
                    "created_utc": 1652898645.0,
                    "response": "It's a three day event. I'm sure The News will report it someday really soon now.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i93vclj",
                            "author": "SkirtTechnical1691",
                            "score": 1,
                            "created_utc": 1652899967.0,
                            "response": "Yes",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i93ok8x",
                    "author": "SkirtTechnical1691",
                    "score": 1,
                    "created_utc": 1652897199.0,
                    "response": "Do you have a good opinion on this?",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "usj7fd",
            "title": "any Diablo 2 players here?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/usj7fd/any_diablo_2_players_here/",
            "author": "coolshoeshine",
            "created_utc": 1652897887.0,
            "score": 7,
            "num_comments": 16,
            "subreddit": "Bitcoin",
            "selftext": "I played the game Diablo 2 a lot as a kid, and it eventually led me to a website operating a virtual currency for trading Diablo 2 items.  You see, Diablo 2 does not have an inherently \"good\" currency in-game.  If you play Diablo 2 then you know I'm talking about forum gold on jsp.\n\nUsing that virtual currency as a kid really helped open me up to Bitcoin.  And funny enough, learning a lot about Bitcoin now as an adult has taught me how forum gold is a god awful currency.\n\nI've devised an alternative currency structure using real Bitcoin payments to verify a Proof-of-Diablo Clone.  If you have any interest in the game Diablo 2 then you might find this interesting:\n\n[https://d2charsifood.com/blog/post/dclone/diablo-clone](https://d2charsifood.com/blog/post/dclone/diablo-clone)",
            "stickied": false,
            "comments": [
                {
                    "id": "i93u952",
                    "author": "humansubjects",
                    "score": 5,
                    "created_utc": 1652899518.0,
                    "response": "Stone of Jordan is the original Proof of Work digital currency.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93t1mk",
                    "author": "ETAVEGAMING",
                    "score": 5,
                    "created_utc": 1652899018.0,
                    "response": "If you liked D2 you will love PoE. I remember my d2jsp bot finding a rare axe that sold for like 5,000 forum gold lol\n\nThe good ol’ days.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9481vq",
                            "author": "Vipu2",
                            "score": 3,
                            "created_utc": 1652905149.0,
                            "response": "There is so many \"PoE\":s that im gonna help OP a bit, Path of Exile\n\nTruly the next Diablo that Diablo players deserve.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9490za",
                                    "author": "ETAVEGAMING",
                                    "score": 1,
                                    "created_utc": 1652905542.0,
                                    "response": "Thank you 😁 yeah, it’s extremely well done. I would like to be able to spam movement abilities a lot more in late game, but other than that 🤌🏻",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i93w52n",
                    "author": "BottleNcanClapUrHand",
                    "score": 3,
                    "created_utc": 1652900289.0,
                    "response": "I was in a game trying to trade some item back in like 2009. Sometimes you just sit and chat with whoever comes in. This one guy talked to me for an hour about mining Bitcoin and how it would be a future internet currency. Passed on it. That's my \"should have got on the bandwagon\" mistake.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93sh1i",
                    "author": "Tall-Environment9387",
                    "score": 2,
                    "created_utc": 1652898781.0,
                    "response": "Full immortal king was still noob",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93tpx8",
                    "author": "cryptonewbeee",
                    "score": 2,
                    "created_utc": 1652899299.0,
                    "response": "Used to have a level 92 hard-core character Amazon. Man, you've brought back some good and bad memories.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93y3h4",
                    "author": "Verallendingen",
                    "score": 2,
                    "created_utc": 1652901089.0,
                    "response": "im just playin very casual on switch",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9427va",
                    "author": "Slapshot382",
                    "score": 2,
                    "created_utc": 1652902773.0,
                    "response": "D2 is great. Sold my gear for $150 USD on eBay back in the early 2000s.\n\nIt’s the addictive nature of those rare items. Just like Pokémon cards or something.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i942h3x",
                    "author": "Hank___Scorpio",
                    "score": 2,
                    "created_utc": 1652902876.0,
                    "response": "I'm so glad I got scammed in d2. Extremely cheap lesson. Goodbye full IK set.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i944i3u",
                    "author": "yearnlearning115",
                    "score": 2,
                    "created_utc": 1652903694.0,
                    "response": "I don't really understand what you're doing but have an upvote! it looks like you are innovating with btc",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i94ftfx",
                            "author": "coolshoeshine",
                            "score": 1,
                            "created_utc": 1652908347.0,
                            "response": "Lol!  Fair\n\nI am indeed innovating with bitcoin.  I hold a firm belief that any information based system will inevitably be powered by Bitcoin so I'm trying to push something like that right now\n\nMy system depends on manually verifying video proof of an in-game event.  The streamer gets rewarded in bitcoin, and that txid is stored to act as a sort of proof that that video was manually verified at some point in time (assuming no one moves real Bitcoin for no reason)",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i945o2e",
                    "author": "Wolfos9",
                    "score": 2,
                    "created_utc": 1652904165.0,
                    "response": "Diablo 2 was my life for about 10 years straight... however I lived in an area with no internet so there was no online play!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i94goca",
                    "author": "seymourskinnyskinner",
                    "score": 1,
                    "created_utc": 1652908713.0,
                    "response": "My dad bought me a necromancer set, then I summoned an iron golem with the chest piece and cried",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i941lax",
                    "author": "Independent-Snow-129",
                    "score": 0,
                    "created_utc": 1652902518.0,
                    "response": "So much work for such a **scam** . Cool looking site nonetheless.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i94g6s0",
                            "author": "coolshoeshine",
                            "score": 1,
                            "created_utc": 1652908506.0,
                            "response": "No scam\n\nIt's a way to reward diablo content creators for hosting an in game event by selling notifications for said event.\n\nIt's a pretty straight forward business model",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "usj74m",
            "title": "In Last Week's Crypto Crash, $1.2 Billion Of Bitcoin Was Liquidated",
            "url": "https://bobosandwojaks.com/in-last-weeks-crypto-crash-1-2-billion-of-bitcoin-was-liquidated/",
            "author": "Tejas_LiMan",
            "created_utc": 1652897861.0,
            "score": 4,
            "num_comments": 6,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i93qwhw",
                    "author": "RogerWilco357",
                    "score": 5,
                    "created_utc": 1652898143.0,
                    "response": "You mean $1.2B worth was aquired.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i93v5h1",
                            "author": "Nada_Lives",
                            "score": 4,
                            "created_utc": 1652899888.0,
                            "response": "Traded.\n\nI think that is a useful quality for a currency.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9562xa",
                    "author": "pixelpoints",
                    "score": 2,
                    "created_utc": 1652920245.0,
                    "response": "And we are at the same price levels as when China banned miners. This network continues to amaze me with how robust it is.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93s8nm",
                    "author": "coinfeeds-bot",
                    "score": 1,
                    "created_utc": 1652898688.0,
                    "response": "tldr; According to data analytics firm CoinGlass, Bitcoin futures traders lost $1.2 billion in liquidations between Sunday, May 8 and Saturday, May 14. Over $1 billion in total crypto assets were destroyed on May 8 alone, the highest sum in more than three months. Liquidations increase sell pressure on Bitcoin, leading the price to fall further.\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i959de1",
                    "author": "Halo22B",
                    "score": 1,
                    "created_utc": 1652921791.0,
                    "response": "1.2billion in margin calls were liquidated",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "usj2jt",
            "title": "Hodler Hopium",
            "url": "https://www.reddit.com/r/Bitcoin/comments/usj2jt/hodler_hopium/",
            "author": "Acceptable-Risks",
            "created_utc": 1652897525.0,
            "score": 3,
            "num_comments": 6,
            "subreddit": "Bitcoin",
            "selftext": "Hodlers need a fresh shot of hopium once in a while. It's good for ya. \n\n\nI dont know about you guys but I'm hodling until BTC is the most widely adapted, desired, and valued currency; and at that point I'm still not selling. Once the dirty fiat becomes BTC it does not become fiat once again. One does not simply sell their BTC for fiat. No....it will be held and held and held until being a satoshi millionaire or billionaire is the equivalent of massive wealth by today's standards. Then and only then is it OK to begin further decentralization of the network by unleashing the horde of hodlers. We will begin to transact with each other and merchants. The world will want our BTC and it will be our duty to finally give it to them, but they will pay a high price for it. It will be necessary to begin transacting with BTC at this point because the network will become stronger if we give it to others for their goods and services.\n\n\nBut here's one point I hope some of the new Bitcoiners take to heart. Don't ever ever ever sell your BTC for fiat. For one reason you will pay capital gains tax on it if you sell for fiat, so it's much better to hodl for a long time and wait until 90% adoption comes. Another reason is because you will be placing your wealth under the control of the very ones who have enslaved humanity for much of our history, the central bankers and governments. \n\n\nMass adoption is coming. Until then accumulate no matter what the price is and HODL! Bitcoin is about the long game monetary revolution. If you don't believe me about the mass adoption coming go look at what strike is doing with the lightning network to connect merchants and consumers and the new contact-less payment card using BTC network.",
            "stickied": false,
            "comments": [
                {
                    "id": "i942brz",
                    "author": "Keith_Kong",
                    "score": 2,
                    "created_utc": 1652902816.0,
                    "response": "Hodl'ing is what creates the big bull markets and the busty bear markets. Selling a bit to live your life and distribute the sats is actually a key role in building the market cap over the longer term.\n\nAt some point feeding a circular economy will be more important than holding. You cannot reduce the volatility in Bitcoin until people are actually using it in daily commerce. It's the velocity of the money that will tame the swings.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93ramx",
                    "author": "Horak_mich",
                    "score": 1,
                    "created_utc": 1652898302.0,
                    "response": "Pure hopium. Bitcoin and crypto pumped only because of QE and will go down as FED tightens its monetary policy.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i93xhhp",
                            "author": "Acceptable-Risks",
                            "score": 2,
                            "created_utc": 1652900834.0,
                            "response": "Thanks for rating my hopium as that of the highest quality.\n\n\nI'm one who believes some day BTC will decouple from other asset classes.\n\n\nIn short term you will see everything correlated like you say. Implementation of the BTC network as a settlement software for many aspects of civilization is the point you're missing though. We're beginning that stage now.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i93syzb",
                            "author": "Loafmanuk",
                            "score": 1,
                            "created_utc": 1652898988.0,
                            "response": "And will then rise again when the fed decides they can't stop inflation this time and starts to print cash ad infinitum.\n\nI genuinely think, with the latest interest rate rises, they are currently using a bandaid to try and fix a decapitation. I can't see it working.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i93y652",
                                    "author": "Acceptable-Risks",
                                    "score": 2,
                                    "created_utc": 1652901120.0,
                                    "response": "In the end, the only course for any fiat is complete devaluation. Human greed is inevitable and causes it every time. They began a massive devaluation in 08 and have since gone back and forth to keep the Bipolar economy from collapsing. They will have to keep this up until it finally breaks once and for all. It will be painful but that's when the decouple of BTC from other assets should happen. Just keep stacking your sats till then. Every one of them will be crucial.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "id": "usj4ln",
            "title": "Serious: what reason do you really have to buy and hold BTC other than a guess that it might be worth more in the future?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/usj4ln/serious_what_reason_do_you_really_have_to_buy_and/",
            "author": "MLSHomeBets",
            "created_utc": 1652897679.0,
            "score": 11,
            "num_comments": 137,
            "subreddit": "Bitcoin",
            "selftext": "I believe in the tech behind crypto, but I struggle with the monetary value of BTC on a daily basis. I actually use BTC frequently, but only as a temporary means to transfer money.\n\nIt terms of utility, the price of BTC doesn't matter, as long as it's stable (which it isn't, has never been and may never be). If you want to use it as a medium of exchange for goods and services, or transfer of funds, the price doesn't actually matter: 1 BTC could be $1M or $1, you'd just buy some, send it, and the recipient would redeem it in the currency of their choice (or you buy something with it, but same idea).\n\nI fail to see how the belief that BTC's value as compared to the US dollar will increase over time is anything but circular logic that nearly 100% depends on the majority of BTC market participants holding the same belief.\n\nThere's nothing underpinning the actual $ value of BTC besides exchanges. Unlike stocks, which at least grant you ownership stake in an actual tangible corporation, or precious metals, which have properties that aren't reproducible, BTC itself has no underlying value as an investment if, in the future, no one desires to actually hold onto it.\n\nSo it's difficult for me to reach a conclusion other than BTC's \"value\" being nearly all based on the hope that someone else in the future will want to purchase it from you for more than it's worth now, for...reasons??\n\nI would love to have my mind changed, so I would love some thoughtful responses.",
            "stickied": false,
            "comments": [
                {
                    "id": "i93rgcw",
                    "author": "Tiny_Session_9524",
                    "score": 56,
                    "created_utc": 1652898370.0,
                    "response": "We don't buy hoping the value of btc goes up but because we know the value of usd will continue to go down",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i94l3sd",
                            "author": "bitrequest",
                            "score": 6,
                            "created_utc": 1652910605.0,
                            "response": "Yes, a hedge against inflation. Because there's a max cap.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i95wpcj",
                            "author": "along_for_the_ride_",
                            "score": 2,
                            "created_utc": 1652933402.0,
                            "response": "Saw something the other day…\n\n25% of all usd was printed last year.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i93t16o",
                            "author": "MLSHomeBets",
                            "score": 0,
                            "created_utc": 1652899013.0,
                            "response": "But what gives you any confidence than BTC's value will not go down as well?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i93v1lo",
                                    "author": "Tiny_Session_9524",
                                    "score": 8,
                                    "created_utc": 1652899844.0,
                                    "response": "My confidence comes from understanding the big cycles of debt and economic history. \n\nThere are no guarantees. However there is counterparty risk. \n\nAs of right now there are only 3 assets with no counterparty risk you can store wealth in. Gold, silver, and btc. \nPhysical gold and silver and btc held on a private wallet owned by you to be more specific. \n\nThe question has to be are you trying to invest and make a roi or are you storing wealth you already have so you can safely retire in the future?\n\nIf you have wealth. You have to store it as something. It can't just exist independant of something. If you have 50k in cash, you are putting your faith in usd and the federal reserve. There is no way around this. \nAsk yourself what do you trust most. \nMaybe btc isn't for you, buy some gold or silver and store it in a safe place or put your faith in the US government and hold dollars and hope you don't lose purchasing power over the next 10 to 50 years.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i93weld",
                                            "author": "Chipjack",
                                            "score": 12,
                                            "created_utc": 1652900398.0,
                                            "response": "Pretty sure the dollar lost purchasing power while you were typing that.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i93whd2",
                                                    "author": "Tiny_Session_9524",
                                                    "score": 2,
                                                    "created_utc": 1652900429.0,
                                                    "response": "Yep haha 😄",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i95q0oo",
                                                    "author": "udevil2",
                                                    "score": 3,
                                                    "created_utc": 1652929736.0,
                                                    "response": "Haha and  bitcoin tanked 5%.. funny",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i93uwur",
                                    "author": "infopocalypse",
                                    "score": 14,
                                    "created_utc": 1652899790.0,
                                    "response": "Because it's supply can't be inflated to shit the way we KNOW for a fact fiat currencies will be. The dollar goes down because supply is always racing up.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i93wao0",
                                            "author": "MLSHomeBets",
                                            "score": 2,
                                            "created_utc": 1652900354.0,
                                            "response": "That's not value. That's just supply. There are many, many things whose supply will stay the same or decline over time, and they're not intrinsically valuable.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i94uan6",
                                                    "author": "extq00",
                                                    "score": 4,
                                                    "created_utc": 1652914688.0,
                                                    "response": "Yes, many things have limited supply. However, how many things have preceisly capped supply, can be easily stored (even in memory/piece of paper/usb stick), can be transfered around the world within minutes and above all doesn’t depend on any country or any single entity?",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i93wua4",
                                                    "author": "infopocalypse",
                                                    "score": 10,
                                                    "created_utc": 1652900574.0,
                                                    "response": "Supply matters. It has value for being the best money the planet has ever seen. For being the best innovation in accounting in (the world runs on ledgers) human history. For breaking down jurisdictional barriers and enables global trading with instant settlement at the speed of light. Honestly you gotta read some books and listen to podcasts apart from just asking reddit.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i93ykln",
                                                            "author": "LegitimateCopy7",
                                                            "score": 3,
                                                            "created_utc": 1652901286.0,
                                                            "response": "the best money you can't spend almost anywhere? it's an asset.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i93zcq5",
                                                                    "author": "infopocalypse",
                                                                    "score": 9,
                                                                    "created_utc": 1652901607.0,
                                                                    "response": "That is rapidly changing. The largest Point of Sale retailer in the world  just announced it integrated LN (shopify also announced it same day as a tiny sidenote). Meaning walmart, home depot, chipotle, safeway, and nearly every chain you can think of will shortly be accepting btc. Also other countries are ahead of the US as far as payment acceptance. The amount of announcements for acceptance has been staggering   in the last year if you are paying attention.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i94zba2",
                                                                            "author": "mantits-",
                                                                            "score": 5,
                                                                            "created_utc": 1652917032.0,
                                                                            "response": "Can you link me anything to prove this claim?\n\nThat huge if true, but I can’t find anything.\n\nI believe you but I just wanna troll my Bitcoin hating friend lol",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i94zwr7",
                                                                                    "author": "infopocalypse",
                                                                                    "score": 7,
                                                                                    "created_utc": 1652917316.0,
                                                                                    "response": "It was announced at the 22 btc conference. 7:10 is where it starts to show them. ncr is the POS company that all these places use. \n\n[https://youtu.be/o73fWsqJDdY](https://youtu.be/o73fWsqJDdY)",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i94046w",
                                    "author": "NiceDoctorBeam",
                                    "score": 13,
                                    "created_utc": 1652901915.0,
                                    "response": "> But what gives you any confidence than BTC's value will not go down as well?\n\nIt can and from time to time will go down.  Long term it goes up.\n\nThe reason the US Dollar goes down, down, down is because of endless \"money printing\".  Bitcoin has a hard cap of 21 million, most of which have already been created.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i93tmlb",
                                    "author": "ar2222",
                                    "score": 6,
                                    "created_utc": 1652899262.0,
                                    "response": "There’s no guarantees. But there is a finite amount of it and it is getting more and more scarce as time goes on which is the exact opposite of fiat money",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i94qpal",
                                    "author": "BtcKing1111",
                                    "score": 0,
                                    "created_utc": 1652913047.0,
                                    "response": "Basic math.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i93qnlp",
                    "author": "dragonstalking",
                    "score": 7,
                    "created_utc": 1652898043.0,
                    "response": "the same reason you buy a stock, gold, or literally any other asset or investment: because it will be worth more in the future....",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i93ta59",
                            "author": "MLSHomeBets",
                            "score": 1,
                            "created_utc": 1652899117.0,
                            "response": "The things you listed are more valuable in the future for a reason. Successful companies, over time, make more and more profit. Gold is a finite resource with many actual uses, as well as vanity purposes in jewelry. They have reasons they will be worth more in the future.\n\nWhat *reason* will BTC be worth more in the future, other than because people hope it will be?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i93ubp0",
                                    "author": "dragonstalking",
                                    "score": 4,
                                    "created_utc": 1652899547.0,
                                    "response": "Why do they make profit though? Because more and more people are interested in their product\n\nBTC is a product that 100 million people and growing believe in and DCA into it daily\n\nAs long as government centralization and fiscal irresponsibility continue, there's really no reason for BTC to not continue rising",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i93vonp",
                                            "author": "MLSHomeBets",
                                            "score": 0,
                                            "created_utc": 1652900104.0,
                                            "response": "But, again, people are only DCAing into it because they think (hope) that it will be worth more in the future... but why. It seems self-fulfilling. \n\nDo you see what I'm asking? If there isn't actually any underlying reason why something will be more in demand (or maintain demand while reducing supply) over time, it doesn't really have a reason to increase in value.\n\nOwning a % of Amazon, for example, should be worth more 10 years from now than today simply because the company itself should be larger and more profitable. This is obvious an assumption that isn't guaranteed, but Amazon provides services that most of the world uses on a daily basis. Bitcoin does not.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i93wizb",
                                                    "author": "dragonstalking",
                                                    "score": 9,
                                                    "created_utc": 1652900447.0,
                                                    "response": "I know exactly what you're asking, but the truth is pretty much everything else in life is based on the same logic if you really dig deep enough",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i93xjow",
                                                    "author": "Disastrous_Peace_674",
                                                    "score": 5,
                                                    "created_utc": 1652900860.0,
                                                    "response": "Neither does the dollar. It only has value because the government says it does, and everyone uses it. If everyone uses Bitcoin, and as a result, it has value, it's very similar in some ways except there will only ever be 21 million bitcoin. Because more can never be made, they are increasingly scarce and increasingly in demand.\n\nTry to think of money as a being very similar to a token. A dollar can buy let's say 1/3 a gallon of milk today. But when I was a kid, that same dollar would have paid for the whole gallon. Gas used to be $1/gallon when I started driving. $1 only buys 20% of a gallon of gas today. Dollars are just a measurement. Bitcoin is a measurement too.  \n\nIf everyone believes in bitcoin, and uses it, you can claim it's not worth anything, the same as pointing to a dollar and telling someone it's only paper, but the value will go up nonetheless.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i93zxyo",
                                                    "author": "98gffg7728993d87",
                                                    "score": 1,
                                                    "created_utc": 1652901844.0,
                                                    "response": "I think humans voluntarily gravitate towards using 1 thing to exchange resources, its been different things throughout history. At times tobacco has been the currency. Today some people use dollars. People seem to instinctually desire to have these \"waypoints\" for their value. \n\n&#x200B;\n\nAnother underlying mechanism backing up bitcoins value is that in order to send bitcoin there is only one thing which is accepted as payment for the transaction fee, and thats bitcoin. So you need bitcoin to send bitcoin, this provides some underlying value. What does bitcoin \"do\"? it allows you to send money as you stated. So that is one anchor on the baseline of value, one thing you can only do with bitcoin is pay the transaction fee. And it lets you send the money anywhere, final settlement can be essentially instant if you want to pay a higher fee or you can pay a lower fee and it may go slower. No one can stop the payment, and if you really want to and exercise some caution, you can retain anonymity as well. here's another thought why do we choose to use gold and not some other rare element.\n\n&#x200B;\n\nAnother thought: in some sense, everything has bubbles. Stocks go in to bubbles, people buy and the value goes higher cause other people buy. people. buy purely in hopes to sell for more later, this pervades everything, and often the value of a stock will eventually reach an unsustainable level before crashing down to a level at which people think is too low, then it will go back up, and then back down, and so on. That issue, of people buying things simply to sell them for more in the future, that is something which seems to pervade every investment. Yes the company may one day be worth that, thats the concept of potential. And bitcoin may one day be worth some amount as well. Everything will at some point or other be at 0 over the course of an infinite amount of time though of course.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i95yu6z",
                                                    "author": "Jerjon89",
                                                    "score": 1,
                                                    "created_utc": 1652934717.0,
                                                    "response": "DIVERSIFICATION.\n\nAlso, if you think Bitcoin doesn´t provide services, why do u use it?\nAsk people in Turkey, Argentinia, Venezuela, Libanon and many others if Bitcoin provided a service to them.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i94s0rk",
                                    "author": "explorer-9",
                                    "score": 3,
                                    "created_utc": 1652913646.0,
                                    "response": "Bitcoin is scarce because its rules of consensus are enforced in a trustless manner; you do not simply trust a miner to after many attempts find a valid block hash to insert into the header of a new block, you don't simply trust thousands of computers around the world that subsequently verify that block hash, as well as that every transaction signature in the underlying block is valid, and that ~30 rules of consensus have been followed by that block, you can also run bitcoin core yourself and verify that block.\nThis prevents counterfeiting of new coins, fraudulent transactions (double spending), theft of your holdings (unless your key is compromised, and if that happens the security breach is isolated to that wallet; everyone's money isn't all in a big treasure chest offering a juicy target to attackers).\n\nSo, you know your funds are safe, that if you receive funds the payment is guaranteed to be free of fraud once confirmed by a few blocks, that the monetary rules of the system will stay the same, and that the system will carry on working as expected; another block appearing every ~10 minutes.\n\nThere's no limits on who you may sign a transaction payable to, or not.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i95wh4v",
                                    "author": "maxcoiner",
                                    "score": 2,
                                    "created_utc": 1652933264.0,
                                    "response": "BTC is already valuable to hundreds of millions of people, with an adoption rate growing faster than the internets' adoption rate did by this age. It's been 13 years now, bubbles have popped many times already in its perceive value at exchanges and yet it still grows overall.\n\nMany people have their own, unique reasons for seeing value in bitcoin. It could be the unseizability of it, because their spouse or government will steal any money they try to save.\n\nIt could be the programmability of it, because they want to do fun things with their money like spend it in Web3 or use it over the Internet of Things.\n\nIt could even simply be the hardness of this form of money, which is what many goldbugs have come over to bitcoin searching for... No money that humanity has ever made before is as difficult to produce (and limited in supply) as bitcoin is. By far. That's very comforting for them to consider when deciding where to store their value and not have it subjected to inflation outside of their control.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i95yc5e",
                                    "author": "Jerjon89",
                                    "score": 1,
                                    "created_utc": 1652934393.0,
                                    "response": "Hardest money and supranational. Hell, why do u use it?\nThere is value in utility and supply which incentives adoption.\n\nWhat happens when money brakes? W´re finding that out as we speak btw. Others have experienced it already.\nSearch youtube for ´the banking cartel - Andreas Antonopulos´",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i93vuzn",
                    "author": "Creative-Molasses-60",
                    "score": 16,
                    "created_utc": 1652900175.0,
                    "response": "The separation of money and state should be an issue of great importance in the near future. \n\n\n\n\n\nIn Canada during the convoy protest, individuals who were involved or were supporting this had their bank accounts frozen. The emergency act allowed Trudeau to do this without proper investigation/prosecution.\n\nRegardless of your stance on the protest, funds should never be frozen due to a difference of opinion - it’s a dangerous path to head down. \n\n\nWhat happens if governments make a transition away from cash and towards a central bank digital currency? Huge potential for financial control and surveillance. \n\nThere needs to be an alternative form of saving that the government can’t inflate/control. \n\nFor me, it’s Bitcoin.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i95r8he",
                            "author": "udevil2",
                            "score": 2,
                            "created_utc": 1652930371.0,
                            "response": "So, let’s say you live in a democracy - where do you draw this line? We can agree that countries with law and order have done well historically compared to countries with no law and order? \n\nNow, your comment is specific to money. Let’s say there is a criminal group who the government caught and they have a wide network. In the current system the government is able to trace all their assets, freeze them and keep civilians safe. If money is separated from state, isn’t that a risk? \n\nUltimately I think in any democracy, if enough people want this separation it will happen because the elected officials will reflect the will of the people.. but I think there are a lot of downsides. This is not to condone abuse of power by government but I think this separation ultimately does more harm than good (in a democracy).",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i95uwo8",
                                    "author": "maxcoiner",
                                    "score": 6,
                                    "created_utc": 1652932361.0,
                                    "response": ">elected officials will reflect the will of the people.\n\nIs that what they told you? Wow.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i965zaj",
                                            "author": "glen_echidna",
                                            "score": 2,
                                            "created_utc": 1652939603.0,
                                            "response": "They don’t allow you to vote? Don’t allow you to research what they stand for?",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i95xviq",
                                            "author": "Jerjon89",
                                            "score": 1,
                                            "created_utc": 1652934103.0,
                                            "response": "Well, isn´t that what they tell all of us??\nHe just didn´t see through it yet.\n\nWe westeners don´t live in a democracy. A partycracy is what your looking for, thats a whole different ball game. Let alone a ´perfect democracy´..\n\nAnd especially when that partycracy system is 2 parties big, well, rip. \nDemocracy... read a book or 2 please.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i966djp",
                                                    "author": "glen_echidna",
                                                    "score": 1,
                                                    "created_utc": 1652939909.0,
                                                    "response": "Nothing is stopping you from putting your hand up and putting your ideas against other candidates in the party primary that you align more with. If majority of voters like your ideas, you get to represent them. Complaining about the situation is definitely easier but probably also less productive",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i95zn37",
                                    "author": "Creative-Molasses-60",
                                    "score": 0,
                                    "created_utc": 1652935225.0,
                                    "response": "I never mentioned that there shouldn’t be any law and order - I think weaponizing finance is something we should all be concerned about. \n\nBitcoin is an immutable ledger - probably one of the worst ways to conduct illicit activities. In order to withdraw the Bitcoin to dollars, you need to go through a KYC exchange. \n\nEx. Colonial Pipeline Co. ransom demands last year - the Bitcoin was sent to a wallet address and was moved around a bit. It was traced and when brought onto an exchange to be withdrawn, it was frozen and seized. I have no problem with this. This completely removes this notion that Bitcoin cannot be traced. \n\n\nCash will continue to be the main way that criminals finance their activities, not Bitcoin. \n\n\nHow does preventing a savings vehicle from being controlled by the government cause harm to everyday people? Take a look at the purchasing power of national currencies over time - do you really trust the government with your purchasing power?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i95ibun",
                            "author": "Vinnypaperhands",
                            "score": 1,
                            "created_utc": 1652925939.0,
                            "response": "Also this!! Other than the fact that Bitcoin is energy and it's the hardest asset on earth. Its decentralized nature gives us the ability to separate money from state. No one person or group or entity should have the power to create money.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i95zx7z",
                                    "author": "Creative-Molasses-60",
                                    "score": 1,
                                    "created_utc": 1652935404.0,
                                    "response": "The fact that a bunch of old Americans are in control of the “global reserve currency” is frightening. \n\nI’m sure they’re looking out for people worldwide who hold USD…",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i95x76q",
                            "author": "Jerjon89",
                            "score": 1,
                            "created_utc": 1652933698.0,
                            "response": "Solid point.\nIt´s only ´when´, not ´if´",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i95zoy3",
                                    "author": "Creative-Molasses-60",
                                    "score": 1,
                                    "created_utc": 1652935256.0,
                                    "response": "I’m being neutral for arguments sake.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i93r8pm",
                    "author": "Dr-Slay",
                    "score": 13,
                    "created_utc": 1652898283.0,
                    "response": "USD value of bitcoin is irrelevant to me\n\nAll money (including bitcoin) is a religious metanarrative / reification fallacy humans take seriously.  I'd argue they shouldn't, but that's like trying to convince an idiot that it's not an idiot.\n\nThat said, given the stampede of human stupidity, \"money\" is a religious practice one has to participate in (minimally) if one doesn't want to die in relatively immediate agony.\n\nIt's like being born in a stampede of spooked cattle. They're not running from any real problem, they're making the problem.  But if you don't run with them, you get trampled.\n\nSo:\n\n\\#1 it can't be stolen if custodied properly\n\n\\#2 not backed by threat of violence/ad baculum.\n\n\\#3 no one can stop me spending it where and when I want.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i93tyft",
                            "author": "MLSHomeBets",
                            "score": 6,
                            "created_utc": 1652899394.0,
                            "response": "Ok, ignore \"USD value\" for the purpose of my question. Call it purchasing power, or whatever value metric you want to assign it.\n\nWhat makes you think that the BTC you hold now will be more valuable to exchange in the future for whatever you choose than it is now?\n\nYour points are accurate and slightly compelling, but aren't very convincing to me that hold it long term would be a prudent financial decision.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i93w4f3",
                                    "author": "BigDeezerrr",
                                    "score": 7,
                                    "created_utc": 1652900281.0,
                                    "response": "It is the hardest form of money ever created. Its stock to flow and scarcity is superior to gold even. This seems trivial at first but Bitcoin has all of the benefits of in-person money transactions (peer to peer, no authority can intervene, private, instantaneous) and digital transactions (transactions over distances, not needing to be physically present). At the end of the day, it is a superior form of money and I believe that is why it will win out compared to fiat currencies.\n\nIf you're curious enough to read a book, check out \"The Bitcoin Standard\". The entire book is about examining the questions you posed and Bitcoin's place in the history of money. It's more of an economics book and doesn't dive into Bitcoin in any technical detail.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i940c8u",
                                    "author": "Disastrous_Peace_674",
                                    "score": 3,
                                    "created_utc": 1652902006.0,
                                    "response": "I don't necessarily hope it will be worth more. I simply trust the foundation of Bitcoin more than I trust the foundation of the dollar. \n\nI believe Bitcoin will *hold it's value better* than the dollar. If someone were to store $50,000 in USD and the same amount in BTC, that in the future, I believe the BTC will be worth more, as in, more desirable and valued than the dollar will be, and therefore have more purchasing power than the stored dollars will. Assets increase in value. Dollars fall in value. That's why the richest store their wealth as assets, not liquid currency. \n\nBecause the dollar is controlled by people whose goals are theirs, and who are decidedly not working to my benefit. Because BTC is exactly what it says it is on the cover. I don't wonder if BTC will be hacked, or if someone will be voted in that changes the structure of the currency dramatically. I don't worry about a war destroying it's value, nor do I worry about hyperinflation, which is so common during the fall of empires; a stage we're sliding into further and further. If you're curious, Howard Bloom explains that part better than I can: https://en.m.wikipedia.org/wiki/The_Lucifer_Principle#:~:text=The%20Lucifer%20Principle%20is%20a,genes%20and%20human%20psychological%20development.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i940e6x",
                                            "author": "WikiMobileLinkBot",
                                            "score": 1,
                                            "created_utc": 1652902027.0,
                                            "response": "Desktop version of /u/Disastrous_Peace_674's link: <https://en.wikipedia.org/wiki/The_Lucifer_Principle>\n\n --- \n\n ^([)[^(opt out)](https://reddit.com/message/compose?to=WikiMobileLinkBot&message=OptOut&subject=OptOut)^(]) ^(Beep Boop.  Downvote to delete)",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i95na4m",
                                    "author": "LilBlueFire",
                                    "score": 2,
                                    "created_utc": 1652928354.0,
                                    "response": "I just bought some pants with Bitcoin and the transaction fees were non existent.\n\nAlso I just wired some money from one bank to another and it cost 3 bucks. \n\nI also just transferred Bitcoin from one wallet to another using lightning and again, basically free.\n\nTwice in the recent past I needed some cash and the ATM I went to first was broken, which was annoying and made me feel not in control of my own money. \n\nI'm sure I could come up with a lot of examples where I used my credit or debit card and it was a quick seamless transaction too.\n\nThat's my reason.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i95gpfl",
                                    "author": "tedthizzy",
                                    "score": 1,
                                    "created_utc": 1652925193.0,
                                    "response": "Basically you can think of it this way:\n\n1. Is Bitcoin a superior Store-of-Value than alternatives like Gold, Bonds, Real Estate etc - once you're convinced this is true you can move to #2\n2. If Yes, then what is the total addressable market of all SoV assets combined?\n3. What fraction of the TAM do you think Bitcoin will take? That is your future expected value.\n\nNobody knows where it will top out, most estimates range from 20T - $200T in today's dollars (which is $1M - $10M / btc)",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i94ra10",
                                    "author": "BtcKing1111",
                                    "score": 0,
                                    "created_utc": 1652913308.0,
                                    "response": "> What makes you think that the BTC you hold now will be more valuable to exchange in the future for whatever you choose than it is now?\n\nChart analytics: 200% average YoY growth, and yearly lows keep increasing.\n\nThe price activity from last 10 years confirms that USD money printing and velocity is impacting the price of assets, including Bitcoin, beyond the reported CPI numbers.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i93yyj7",
                            "author": "Disastrous_Peace_674",
                            "score": 3,
                            "created_utc": 1652901447.0,
                            "response": "This guy bitcoins. \n\nThe religious stuff is a bit weird, but the rest seems sound, so I'll allow it.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i93tb35",
                            "author": "manwhole",
                            "score": 1,
                            "created_utc": 1652899128.0,
                            "response": "Thanks for your meta take.\n\nIn your analogy, the stampede you are born into, is it running to or from bitcoin these days?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9423mg",
                                    "author": "Dr-Slay",
                                    "score": 1,
                                    "created_utc": 1652902725.0,
                                    "response": ">is it running to or from bitcoin these days?\n\nI don't know.  Others probably have this information, I simply don't know - it's probably a good question.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i946grh",
                                            "author": "manwhole",
                                            "score": 1,
                                            "created_utc": 1652904494.0,
                                            "response": "Just remember, there is no follow up stampede after stampeding off a cliff. I recommend you get to the edge of the pack and look at the landscape.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i956bxg",
                            "author": "learner77",
                            "score": 1,
                            "created_utc": 1652920364.0,
                            "response": ">no one can stop me spending it where and when I want.\n\nYeah, but nobody HAS to accept it, because it’s not legal tender. so unless the person selling the thing/service you want accepts Bitcoin, you’re out of luck.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i93qx32",
                    "author": "Calibre1972",
                    "score": 4,
                    "created_utc": 1652898149.0,
                    "response": "Isn't this enough reason? What other reasons are there investing in precious materials like gold? Gold has no attributes that can not be replaced by other material. BTC is limited and can not be faked.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i93srtl",
                            "author": "manwhole",
                            "score": 1,
                            "created_utc": 1652898905.0,
                            "response": "Just because something is limited doesn't mean it has value. If you dont believe me, start caning your shit and sell it online. Gold has many functional attributes and is limited and has a solid track record as the true international timeless currency.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i93vwi4",
                                    "author": "myironcity",
                                    "score": 5,
                                    "created_utc": 1652900192.0,
                                    "response": "When is the last time you sent $1000 worth of gold overseas, try it, and then send $1000 worth of Bitcoin, see which one is easier, faster, and the least fees.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9466o6",
                                            "author": "manwhole",
                                            "score": -1,
                                            "created_utc": 1652904377.0,
                                            "response": "All true. And yet gold will outlast all. Do you know why? Because gold has intrinsic value.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9490fr",
                                                    "author": "myironcity",
                                                    "score": 3,
                                                    "created_utc": 1652905536.0,
                                                    "response": "Nothing has intrinsic value. It’s a philosophy concept. Value is subjective.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9496ym",
                                                            "author": "manwhole",
                                                            "score": 0,
                                                            "created_utc": 1652905611.0,
                                                            "response": "Try eating without food.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i94byis",
                                                                    "author": "myironcity",
                                                                    "score": 1,
                                                                    "created_utc": 1652906735.0,
                                                                    "response": "Objective",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i94pd9y",
                                    "author": "averagewokehuman",
                                    "score": 2,
                                    "created_utc": 1652912448.0,
                                    "response": "This only works if you’re Tom Brady. Plus everybody shits. Why would someone buy something they endlessly create. If we are ever able to mine astroids in the future gold will become worthless.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i94pz5f",
                                            "author": "manwhole",
                                            "score": 1,
                                            "created_utc": 1652912719.0,
                                            "response": "Fair enough about the shit. Gold will become worthless when it's useless (meaning never). BTC has a value as a shadow currency.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i94up0e",
                                                    "author": "averagewokehuman",
                                                    "score": 1,
                                                    "created_utc": 1652914873.0,
                                                    "response": "So does fiat. Drug cartels and criminals use that way more than Bitcoin",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i93u1w2",
                                    "author": "Calibre1972",
                                    "score": 1,
                                    "created_utc": 1652899434.0,
                                    "response": "BTC has a lot of useful attributes, store and transfer of wealth/asset. Can not be copied/faked. Can not be taken away from you (exempt brute force or breakdown of Internet / communication systems). And so on. I think I don't have to repeat this in here. \n\nThe track record of gold as a currency? Maybe in medieval, lol. In the US it was forbidden to own gold for a long time in the last century. If BTC is forbidden, you can still memorize your seedphrase, nobody can take it away from you.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i93usmj",
                                            "author": "manwhole",
                                            "score": 1,
                                            "created_utc": 1652899742.0,
                                            "response": "If it cant store wealth in these uncertain time as well as a fiat currency losing 10% yoy, it isnt functional as a store of wealth. If it isnt a functional store of wealth, it isnt a sensible investment. It appears useful though as a way to do commerce outside of government oversight. Hence, frindge application.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i93vsb7",
                                                    "author": "Calibre1972",
                                                    "score": 2,
                                                    "created_utc": 1652900145.0,
                                                    "response": "In the last 5 years USD lost against EUR as well as EUR against BTC. Think longterm.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9459l0",
                                                            "author": "manwhole",
                                                            "score": 0,
                                                            "created_utc": 1652904004.0,
                                                            "response": "How long has gold been around? As for the last 5 years, it is called a speculation bubble. There is a boom period and then a bust.\n\nBTC makes sense as a shadow currency. But otherwise, please accept the emperor has no clothes.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i952f7u",
                                    "author": "xKusamaGaming",
                                    "score": 1,
                                    "created_utc": 1652918516.0,
                                    "response": "If big farmers stopped having animals that shit, shit would become valuable as fertilizer and many other use cases need it. \n\nPlus shit isn’t capped, everything living must consume and produce some sort of waste.\n\nI agree with you that limited doesn’t mean value, but I think shit is poor comparison. Respectfully",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i93uoos",
                            "author": "MLSHomeBets",
                            "score": 1,
                            "created_utc": 1652899697.0,
                            "response": "Are you unfamiliar with what gold is? It quite literally is unique and scarce. Of course this doesn't make it inherently a good instrument to use to store wealth, but I'm extremely confused by your assertion that it has \"no attributes that can not be replaced by other material.\"\n\nExcluding future materials engineering that we cannot predict, gold absolutely has unique properties that cannot currently be duplicated.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i94z09o",
                                    "author": "Puzzled_Bread_6412",
                                    "score": 2,
                                    "created_utc": 1652916886.0,
                                    "response": "Bitcoin has the monetary properties of gold, but in a digital form.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i93vacy",
                                    "author": "Calibre1972",
                                    "score": 1,
                                    "created_utc": 1652899942.0,
                                    "response": "Who knows what nanotech will make possible? Maybe even the alchemist dream come true?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i93x21u",
                                            "author": "MLSHomeBets",
                                            "score": 1,
                                            "created_utc": 1652900663.0,
                                            "response": "That is a horrific argument. \n\nIt may be true. We don't know what will be possible in the future. Gold may have no value in 100 years.\n\nIt is undeniable that a new cryptocurrency, or anything like it, could be created MUCH more easily than a replacement for gold. I will grant you that many, many have tried and failed so far (if you define success as market cap, or $/coin), but it is impossible to argue that BTC is anywhere near as unique as gold or any other naturally finite resource.\n\nSo by your own argument, who knows what crypto (or something else we haven't even thought of) will be made in the future, completely replacing BTC?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i95divr",
                                                    "author": "00iamgru00",
                                                    "score": 3,
                                                    "created_utc": 1652923733.0,
                                                    "response": "Bitcoin has allowed for the first time in history, a provably scarce, secure digital asset, which can be verified by anyone with a computer.\nYou underestimate the magnitude and the value of this.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i946q6t",
                                                    "author": "Calibre1972",
                                                    "score": 1,
                                                    "created_utc": 1652904603.0,
                                                    "response": "I would agree with everything you say here.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i95fned",
                                                    "author": "tedthizzy",
                                                    "score": 1,
                                                    "created_utc": 1652924706.0,
                                                    "response": "There are many issues with your logic here.\n\n1. \"we don't know what will be possible\" is the [appeal to possibility fallacy](https://www.logicallyfallacious.com/logicalfallacies/Appeal-to-Possibility). \n2. \"new crypto could be created easier\" yes, but a successful crypto cannot. Why? because security scales exponentially with distributed compute, so it is a network effect problem and a winner-take-all market. \n3. \"BTC is not as unique as gold or anything else finite\" - the exact opposite is true. It is impossible to argue that anything is more finite that Bitcoin...\n\nI would suggest reading some of Nick Szabo's work. [Shelling Out](https://nakamotoinstitute.org/shelling-out/) is a good place to start to understand what money is and why different forms of money are better than others.\n\nGood luck!",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i93qzdr",
                    "author": "stateofidleness",
                    "score": 3,
                    "created_utc": 1652898176.0,
                    "response": "This post comes up often.. and I just always come back to, what you described is no different than fiat currency. What gives that value? It’s not backed by anything? Just the belief from users of it that it has value and can be used as a utility to buy goods and services. All bitcoin is missing is that adoption. In the meantime, it’s going to be pretty speculative and volatile.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i93tqq3",
                            "author": "HermanCainsGhost",
                            "score": 2,
                            "created_utc": 1652899308.0,
                            "response": "> I just always come back to, what you described is no different than fiat currency. What gives that value?\n\nThe main difference being that there are a maximum of about 200 or so fiat currencies.\n\nThere are an infinite potential number of cryptocurrencies.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i93yljw",
                                    "author": "Disastrous_Peace_674",
                                    "score": 2,
                                    "created_utc": 1652901297.0,
                                    "response": "Yeah, which is why it's important to do your research and be careful, and not YOLO into every dog coin that shows up trying to make quick dollars. For everyone out there looking to get rich quick, there's someone willing to sell them a scam. Crypto is just the latest thing that's exciting and people don't fully understand, then FOMO in and lose a ton.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i93tii3",
                            "author": "MLSHomeBets",
                            "score": 0,
                            "created_utc": 1652899216.0,
                            "response": "That may be true about the overall concept of fiat currency, but the United States government backs its currency. \n\nI understand that if we all woke up tomorrow and had no desire to have US currency, it would cease to have value, but at the end of the day it is at least backed by laws, a government, a treasury, etc.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i94kq71",
                                    "author": "Remarkable-Cat1337",
                                    "score": 3,
                                    "created_utc": 1652910445.0,
                                    "response": "math > laws and government\n\nu can't see the separation of the money from the state as something good like any other religious people couldn't when it was about the church\n\nand btw we only talking about dollars without realizing half the world right now doesn't have good monetary policies which implies that this can't and neither should be useful to you but it is for many",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i94s08w",
                                    "author": "BtcKing1111",
                                    "score": 2,
                                    "created_utc": 1652913640.0,
                                    "response": "US Dollar depends on TRUST. If foreign nations no longer trust the US government, they will settle oil/gas trades using other methods, and US$ will lose value quickly.\n\nThe growing $30 trillion debt and rapid money printing has caused foreign nations to doubt in US$, and the whispers of discontent are starting.\n\nBitcoin doesn't require trust, it is mathematically verifiable. Settlements happen instantly, do not require an intermediary party to hold or deliver your nation's wealth (see: Russia frozen from withdrawing its $350 billion from London).\n\nIn the future, the idea that we need to trust someone with our wealth will be laughable.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i93wkwb",
                    "author": "moogster17",
                    "score": 3,
                    "created_utc": 1652900468.0,
                    "response": "That is the question people asked thirteen years ago. At that time Bitcoin was valued in the single digits. Now it is worth roughly 30k. All of this valuation was built on belief. In time I believe it will be declared a world reserve currency. Then what is its worth?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93x9f9",
                    "author": "xNUCLEARxBLASTx",
                    "score": 3,
                    "created_utc": 1652900746.0,
                    "response": "I want decentralized money. Easy.\n\nIf bitcoin was super stable (imagine btc = 20k for 10 years straight), I'd still buy it and use it.\n\nDespite being one of the reasons to buy bitcoin, my greatest pleasure regarding bitcoin is not its value increasing. \n\nHaving my money, on my possession, away from bankers and their bullshit system is where the value of bitcoin is to me.\n\nLet's see if we can succeed.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93zf86",
                    "author": "Marcion_Sinope",
                    "score": 3,
                    "created_utc": 1652901634.0,
                    "response": "Can't be seized by banks or governments.\n\nNot terribly complicated reasoning.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9412jc",
                    "author": "Pushyourself2019",
                    "score": 3,
                    "created_utc": 1652902306.0,
                    "response": "Because we believe in the technology, network effect and the utility it brings. It's really not that complicated.\n\n\nYou know, it's not like scarcity is Bitcoin's only property. \nIt's an efficient medium of exchange that's p2p.\n\nThe network itself has a revolutionary security solution, that will potentially have an incredible impact on how we view and generate energy, as well as subsidize a revolution in the industry.\n\n\nYou can take full ownership of it and move it with you across borders.\n\n\nIt levels the playing field for all participants in modern society. All you need is a smart phone and internet, which most of the world has access to. This will only improve with time. \n\n\nBitcoin cannot be corrupted. It is the people taking the power back from the corrupted elites that have been irresponsibly inflating billions of people's life savings away.\n\n\nWe NEED Bitcoin to work. We can't trust the money printer in the hands of humans. We are way too easily corrupted. Decentralization is key.\n\n\nBitcoin is more than getting rich. It is the ethical choice.\nIt's that perfect. You are lucky enough to potentially enjoy both aspects, because you are fortunate enough to be an adult with spare cash in this specific timeline of it's adoption.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i95uc9w",
                    "author": "maxcoiner",
                    "score": 3,
                    "created_utc": 1652932038.0,
                    "response": "You do realize that the same argument can be made for the dollar, right? It hasn't been backed by anything of value since 1971.\n\nEven still, you seem to be unable to believe that bitcoin can be the world's reserve currency one day... That the dollar (and likely all other fiat) will die out because everyone started saving & transacting in BTC instead.\n\n**This is what we call financial privilege.** You don't realize how money actually works in other countries around the world & throughout history because you've been living with the world's strongest currency & best financial network throughout your lifetime. Sadly, reality doesn't work like that elsewhere.\n\n[https://www.youtube.com/watch?v=FjvSqaGhKQI](https://www.youtube.com/watch?v=FjvSqaGhKQI)\n\nUnbacked fiat is an experiment whose time was drawing near and like so many other civilizations in the past, is due to collapse as people lose faith in it. Sounds apocalyptic, but it has happened countless times already.\n\nAt least this time you have bitcoin to fall back on and protect your savings. I'd say that is valuable, wouldn't you?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93vhek",
                    "author": "infopocalypse",
                    "score": 2,
                    "created_utc": 1652900021.0,
                    "response": "It is by far the best asset to send/hold value thru space and time. Saylor illustrates this. Gold is expensive to keep secure and extreme difficult to transport. Real estate requires maintenance, taxes and is easily confiscated. Not many companies last 50 years. Again easily shut down or confiscated. Fiat is just a promise to lose wealth. Only bitcoin maintains scarcity, use case, is easily movable (important for moving to a jurisdiction that treats you best) and is unconfiscatable.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93xi0u",
                    "author": "CommunicationAway341",
                    "score": 2,
                    "created_utc": 1652900840.0,
                    "response": "Because I want to send a big „Fuck you“ to the banksters having to transfer my money to the Exchanges. I never sell.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i94i168",
                    "author": "KMan471",
                    "score": 2,
                    "created_utc": 1652909294.0,
                    "response": "1. Keep your fruits from labor from the banking institutions, who leverage your deposits at a 10 to one ratio. This is called fractional reserve banking. Banks are not money storage facilities. They are credit creation institutions, where they use your money to create 10 times more credit than your actual deposit.\n\n2. Relatively intrinsic value, due to scarcity.\n\n3. Bitcoin, itself, has never been hacked.\n\n4. Not censored.\n\n5. Decentralized\n\n6. Destroy the world bank system by bleeding it dry.\n\n7. Full control and freedom over your own fruits from labor.\n\nThat’s just a start",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i94jyq2",
                    "author": "Just-Blow-Into-It",
                    "score": 2,
                    "created_utc": 1652910120.0,
                    "response": "2 questions first.\n\nIf you wanted to invest money.\n* How would you do it?\n\nIf you wanted to save money.\n* How would you do it?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i94ukxn",
                    "author": "BUY___BITCOIN",
                    "score": 2,
                    "created_utc": 1652914820.0,
                    "response": "Every week when I purchase Bitcoin I do a big \"fuck you\" to my country's central bankers. It feels good. That's why I buy, to feel good.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i95bqbp",
                    "author": "Mean-Run2169",
                    "score": 2,
                    "created_utc": 1652922900.0,
                    "response": "Simple. Educate yourself on money and you'll realize bitcoin is the best money ever created. It's the best cuz it's the hardest money ever created. Meaning u can't make anymore of it there's only 21 million. 4 year halving. Gold inflates 2% a year.\n\nThen you'll learn about the other characteristics of money like divisibility, gold needs fiat to scale which means trusting government which never worked.....",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i967ut5",
                    "author": "BTCMachineElf",
                    "score": 2,
                    "created_utc": 1652941045.0,
                    "response": "Fiat is a scam. Humans deserve fair money.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i95bnoh",
                    "author": "lib3rty47",
                    "score": 1,
                    "created_utc": 1652922865.0,
                    "response": "I think to answer this question, you have to understand what money is first before understanding bitcoin. Read how humanity decided selling sea shells, goats, gold and now fiat. Find out why humans used them and why they don't make sense today. \n\nA good reference is the bitcoin standard, it talks about money before talking about bitcoin. You can also watch this video. It talks about money before understanding bitcoin.\n\nhttps://www.youtube.com/watch?v=d\\_34YjXAU5Y&t=653s",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93r2g9",
                    "author": "Horak_mich",
                    "score": 0,
                    "created_utc": 1652898211.0,
                    "response": "Its only pure hope. There is no way to tell if bitcoin is underpriced, overpriced or at the right price.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i94sv6w",
                            "author": "BtcKing1111",
                            "score": 1,
                            "created_utc": 1652914030.0,
                            "response": "The price of Bitcoin is correlated to the size of the network infrastructure and participants. Each year the network grows with more miners, services, and users. \n\nJust like any market, becomes more valuable based on the popularity. \n\nie. Malls with more foot traffic can charge higher prices for retail space, TV programs with more viewers can charge higher prices for ad views, Social Media sites with more users can charge higher prices for ad clicks.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i93rktc",
                    "author": "Hot_Necessary_2618",
                    "score": 1,
                    "created_utc": 1652898419.0,
                    "response": "It's the only medium of exchange that is not control by any centralized entity and with scarcity",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93t532",
                    "author": "frequent_heron_2102",
                    "score": 1,
                    "created_utc": 1652899059.0,
                    "response": "Why do I need a reason other than that?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93us4q",
                    "author": "Nada_Lives",
                    "score": 1,
                    "created_utc": 1652899736.0,
                    "response": "Because fiat *just might be* more corrupt and less valuable in the future.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93v7rg",
                    "author": "under_dnuorg",
                    "score": 1,
                    "created_utc": 1652899913.0,
                    "response": "Bitcoin is the first and only money that anyone can use and nobody can control. In the future this will prove to be imperative.\n\nIf that dynamic isn’t sufficient I think eventually even the uninitiated will realize Bitcoin is the first and only money thats value increases over time.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93xn6s",
                    "author": "Euphoric-Surprise293",
                    "score": 1,
                    "created_utc": 1652900900.0,
                    "response": "The same applies to stocks and other assets.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93zwep",
                    "author": "ashtonlaszlo",
                    "score": 1,
                    "created_utc": 1652901825.0,
                    "response": "But you just described the very nature of investing. If I were to buy stock in a publicly traded company right now, it would be in the hopes that the price goes up and I make money. But it’s just as likely that 15 years from now the company won’t exist and I’ll have lost my initial investment.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i940g82",
                    "author": "Charming-Meringue-68",
                    "score": 1,
                    "created_utc": 1652902050.0,
                    "response": "Fixed supply, exponentially growing demand - do the math. Short term, nobody knows anything. Long term Bitcoin is likely to overtake gold and even bond market caps, which will take it to 0($ millions) per coin.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i940o5o",
                    "author": "Keith_Kong",
                    "score": 1,
                    "created_utc": 1652902139.0,
                    "response": "Watch this, there is no short answer:  \nhttps://www.youtube.com/watch?v=49FhysfWX1M",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i94110b",
                    "author": "glasswiper69",
                    "score": 1,
                    "created_utc": 1652902288.0,
                    "response": "how else am i supposed to shop the markets?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i943w29",
                    "author": "distraxxx",
                    "score": 1,
                    "created_utc": 1652903444.0,
                    "response": "Stop seeing it as a payment replacement and start seeing it as a store of value, digital gold.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i946mwc",
                    "author": "FerrisMichaels",
                    "score": 1,
                    "created_utc": 1652904565.0,
                    "response": "lightning network / taro network liquidity",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i94c2vv",
                    "author": "Calibre1972",
                    "score": 1,
                    "created_utc": 1652906786.0,
                    "response": "As soon as enough people worldwide will use one Coin/ Blockchain to buy and sell goods with a more or less fixed price (not fixed in USD but fixed in that Coin) it will be over for USD and all other fiat money. The volatility stems only from goods being bought for a fixed fiat price instead of fixed universal Crypto price",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i94htgn",
                    "author": "pink_raya",
                    "score": 1,
                    "created_utc": 1652909201.0,
                    "response": "to me it's mostly how the network reacted to the attacks over time, there's some weird justice in permissionless network that punishes the adversaries you can't find anywhere else.\n\nif you've been thru s2x you get a sense of justice and can't wait till someone foolish enough attacks it again for the fireworks of it all.\n\nSo once you get used to it, you cheer on anyone dumb enough to try, because you know worst case they'll make bitcoin better for everyone.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i94kzs1",
                    "author": "Remarkable-Cat1337",
                    "score": 1,
                    "created_utc": 1652910557.0,
                    "response": "uncertainty of price going up vs the certainty of fiat going down",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i94lpbn",
                    "author": "NoShip7475",
                    "score": 1,
                    "created_utc": 1652910866.0,
                    "response": "I have actual faith that *unlike* Social Security and my employers 0.5:1 401K based on stocks and bonds, my Bitcoin will be worth something in the future.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i94mlvk",
                    "author": "Hank___Scorpio",
                    "score": 1,
                    "created_utc": 1652911244.0,
                    "response": "Everyone buys bitcoin at the price you deserve. If you need people to hold your hand through it, im afraid that number is currently higher than present prices.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i94or2j",
                    "author": "averagewokehuman",
                    "score": 1,
                    "created_utc": 1652912176.0,
                    "response": "Bitcoin is digital. Metals are analog. Bitcoin is the best version of a scarce assets that can be used for trade or held into the future without being diluted.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i94oxo9",
                    "author": "keepingmoresecret",
                    "score": 1,
                    "created_utc": 1652912257.0,
                    "response": "I just think it's cool. I don't view it as \"investing\" but rather collecting something. I get satisfaction of seeing the amount go up over time. Maybe it'll be worth something or maybe not. It doesn't really matter to me.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i94p8ge",
                    "author": "m_jax",
                    "score": 1,
                    "created_utc": 1652912390.0,
                    "response": "Coould aak you the same ques OP for Stocks, ETFs, forex, commodities. What would you propose then? To hold liquid cash in my Band accnt forever?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i94s8qv",
                    "author": "konokonohamaru",
                    "score": 1,
                    "created_utc": 1652913745.0,
                    "response": "Yes, actually the only reason to hold it (and any asset) is if you think you can exchange it for more goods at a later date than you could by holding a different asset\n\nI think your real question is what are the scenarios which favor Bitcoin over other assets, other than market psychology.\n\nOne possible scenario is if you become targeted by the government. Your other assets can be frozen and are worthless to you, but the government cannot censor Bitcoin. Another scenario is if your currency collapses. Then you can get more from Bitcoin than from your cash.\n\nOne reason BTC/USD is down so much, by the way, is because of the strength of the dollar due to rising rates",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i94u5pd",
                    "author": "SubstantialNinja",
                    "score": 1,
                    "created_utc": 1652914624.0,
                    "response": "99% of potential market participants haven't groked the implications of the halving code and I have. This is why I hold BTC.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i94ua68",
                    "author": "1025scrap",
                    "score": 1,
                    "created_utc": 1652914682.0,
                    "response": "If you really “would love to have your mind changed”, why don’t you read up on Bitcoin?  That’s a whole lot better than putting the honus on somebody else.  In this case, why is it someone else’s task to do the leg work or convince you?  After you study it more, maybe you’ll view it differently.  If not, so be it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9503u2",
                    "author": "walloon5",
                    "score": 1,
                    "created_utc": 1652917410.0,
                    "response": "Why can't that be enough reason for you",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i952gtl",
                    "author": "Iguana_The_Wise",
                    "score": 1,
                    "created_utc": 1652918536.0,
                    "response": "People wouldn't buy real estate or stocks either if they didn't expect their value to be higher in the future.\n\nThat is not the ONLY reason we buy Bitcoin though. I love having full control over my money and being able to send it to anyone in the world without asking for permission.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i953hb0",
                    "author": "Anonymouslystraight",
                    "score": 1,
                    "created_utc": 1652919013.0,
                    "response": "I believe btc does have values that you are looking for. Gold is valuable because it’s scarce and have applications such as electricity, jewelry, and etc. But how does gold scale in terms of being transactionable? What about storing or transporting gold? Here is where I believe bitcoin shines. \n1. It is also scarce in the way gold is. There will only be 21 million btc. So same property of btc\n2. Gold is not very easy to transact nor transport. Imagine transacting with someone who bring a bar of bar. You will get robbed and worse yet no the transaction is not going to be fast as people got to inspect to see if it even is real. So Bitcoin comes into play. You see you can store and transact with bitcoin far easier than you can with gold. Though it is slow and newer technology are faster than btc now. It is seen as a store of value as state in reason 3\n3. A store of value. As btc is slow and old you shouldn’t count it out. As the first cryptocurrency it has never been shut down nor hacked since it’s inception. For 13 years no hack or issue have occurred with the network making it the most trustworthy on the market. As people can see it can be trusted, more people will flourish into it. As that happen the price will stabilize and barely move  like gold",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9554go",
                    "author": "Sharing-my-bad-ideas",
                    "score": 1,
                    "created_utc": 1652919790.0,
                    "response": "We live increasingly in the digital realm. The majority of USD is a digital currency. Why wouldn’t you choose a digital property that is decentralized, transmutable, secure and transparent? \n\nMy take is that the governments/banks of the future will have their reserves stored in Bitcoin because it will be the most cost effective way to settle their accounts. The average “peons” will continue to do business with centralized banks. By that point all the Bitcoin will be mined and speculation will not affect the price as heavily.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i959b89",
                    "author": "Jigglepuff07991",
                    "score": 1,
                    "created_utc": 1652921763.0,
                    "response": "No matter the dollar price of BTC, it still provides me with the assurance that I will always be able to do with my money what I choose and not be coerced or manipulated into living a way I don’t want to. The value of a hard money that supports a truly free market has a limitless value to me.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i959wmb",
                    "author": "Yes_Daddy_Bezos",
                    "score": 1,
                    "created_utc": 1652922042.0,
                    "response": "Why? Two things: Hookers and Cocaine.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i95jt2c",
                    "author": "RWH072783",
                    "score": 1,
                    "created_utc": 1652926651.0,
                    "response": "All I know I is I’m a idiot for not buying it when it was hella cheap. Anyone who is ever going to have prospered from bitcoin has already done so. Good job congratulations!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i95xv1p",
                            "author": "turtle_main_61",
                            "score": 1,
                            "created_utc": 1652934095.0,
                            "response": "It's never too late start hodling!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i95qxtu",
                    "author": "Crypto_bro999",
                    "score": 1,
                    "created_utc": 1652930214.0,
                    "response": "And that's the best reason to hold it lol. I will probably hold it on finex till it is 100k and then I will sold it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i962sz8",
                    "author": "Fair-Pool-5155",
                    "score": 1,
                    "created_utc": 1652937359.0,
                    "response": "Since increased money printing “required” releasing paper money from gold standard backing - the printing dilutes the people purchasing power. The only gainers are the fewer and fewer who can hoard money way past the loss of purchasing power. Bitcoin is a locked amount of supply and no more is printed/minted. I agree with principal author that bitcoin works as a vehicle of exchange. The change in value came when institutional investors set their eye on Btc select crypto. Now thy own large volumes and apply short selling proven methods for their financial markets also on Btc to shift holding of less strong owners to their own pockets. With inflation on the loose safe havens are sought. I believe Btc can be one such driven by the fact that nobody can “print more” and because it is outside the hands of central banks and regulatory bodies",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i96b05n",
                    "author": "extrastone",
                    "score": 1,
                    "created_utc": 1652943585.0,
                    "response": "Here is the absolute most under-rated attribute of  bitcoin that I know of:\n\nIn any given month in my or my children's lifetimes, I will know to within less than one percent error, how many bitcoin there will be.\n\nThat is huge.  You cannot predict anything else in the future that actually matters so much to your finances as how many bitcoin there will be.\n\nIn parallel, every nation in the world is trying to devalue its currency by printing more of it.  Today I'd rather have bitcoin.  As the United States Government runs an 8% to GDP deficit that the Federal Reserve prints for it, I'm sure that many people in the future will also rather hold and be paid in bitcoin than the United States dollar.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i96ema3",
                    "author": "Physical-Aspect-5281",
                    "score": 1,
                    "created_utc": 1652946705.0,
                    "response": "As there have been a lot of the standard answers, with most of which I agree, I'll only add my rather speculative 2 cents.  \nIt seems to me that bitcoin (and crypto in general) and the government/media reaction to them are paving the way for CBDCs which again seems to my uneducated ass like the next logical step in finance and monetary policy.   \nIn the ensuing CBDC vs crypto \"wars\" I feel it will be to my advantage to have some (ideally more than some) Bitcoin rather than not.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i96fjm3",
                    "author": "mushambani",
                    "score": 1,
                    "created_utc": 1652947537.0,
                    "response": "Why do People buy gold?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i95bro2",
                    "author": "shoopyvras",
                    "score": -1,
                    "created_utc": 1652922917.0,
                    "response": "BTC is stable. 1 BTC = 1 BTC",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i95hmy4",
                    "author": "Vinnypaperhands",
                    "score": 0,
                    "created_utc": 1652925621.0,
                    "response": "Bitcoin is stored energy. Bitcoin gets its value from being a hard asset and the amount of energy needed to mine Bitcoin.   That's where it's underlying value comes from. Yes the price is going to fluctuate from people speculating, but it still has underlying value to it. The Bitcoin network is the strongest network on this planet and it's a beautiful thing. I think you should do a deep dive on money. What makes money, money. Knowing the history of barter and money makes understanding Bitcoins monetary value a lot easier.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "usj6sz",
            "title": "Bitcoin coming to 401k plans... who's next?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/usj6sz/bitcoin_coming_to_401k_plans_whos_next/",
            "author": "NuggedClarp",
            "created_utc": 1652897835.0,
            "score": 36,
            "num_comments": 19,
            "subreddit": "Bitcoin",
            "selftext": "I emailed my employer's 401k provider about Fidelity's decision to implement Bitcoin into their retirement accounts. This is what they said: \n\n\"When it comes to planning for a secure retirement, cryptocurrencies are too unpredictable to count on for the long-term right now and can put participants’ hard-earned savings in jeopardy. Recent guidance from the Department of Labor demonstrates that the federal government has its own concerns with plan fiduciaries that make cryptocurrency available in their investment lineups. The release states that there will be further analysis conducted and DOL will target plans that offer digital assets and related investments in their standard investment lineup and through self-directed brokerage accounts. While no further guidance is required when issuing a Compliance Assistance Release, there is hope that DOL will provide further clarity given the strong industry response to the guidance. We will continue to support our clients and their employees with solutions designed for the long-term nature of retirement investing. We’re aware of our competitor’s stance, but we’re taking this approach because our core belief is to do the right thing and help plan sponsors and their participants build their financial security. For a variety of reasons, digital assets just don’t appear to be part of that equation yet.\"\n\nHow should I respond? \n\n*Notice: Please refrain from talking about not your keys, not your coins. I am aware of this third party risk. I believe it's smart to diversify in all aspects of life, and this includes having multiple wallets holding Bitcoin. It is especially appealing to equip the tax benefits that a 401k provides.*",
            "stickied": false,
            "comments": [
                {
                    "id": "i94a8qk",
                    "author": "ThrowAwaydntopnddins",
                    "score": 10,
                    "created_utc": 1652906041.0,
                    "response": "I would tell them that you would like to have your retirement plan transferred to Fidelity or Itrustcapital to manage it instead, so you can plan your retirement how you see fit, and not how their out of touch money managers see fit. Money managers who can't even keep up with millennial's returns who are passively saving in Bitcoin.\n\nMaybe send them some of Fidelity's papers on Bitcoin too, and why not putting a small percentage of capital in it is a disservice to clients missing out on 50% portfolio gains for a small 1% to 5% allocation",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i973tub",
                    "author": "mrxsdcuqr7x284k6",
                    "score": 2,
                    "created_utc": 1652965251.0,
                    "response": "I would tell them they can advise their investors however they deem appropriate but actually preventing them from participating in emerging technologies like cryptocurrency is overly restrictive. Let them know you'll be lobbying your employer to change 401k providers starting immediately.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9420lk",
                    "author": "Big_Competition3812",
                    "score": -19,
                    "created_utc": 1652902690.0,
                    "response": "Sell your fantasy money, cash out before the tether bubble bursts and thank me afterwards.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i944mfz",
                            "author": "NuggedClarp",
                            "score": 9,
                            "created_utc": 1652903743.0,
                            "response": "I’m in it for the long term, I don’t care about the short term. Just presents a buying opportunity",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i949sgc",
                                    "author": "Big_Competition3812",
                                    "score": -10,
                                    "created_utc": 1652905856.0,
                                    "response": "What's long term for yourself?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i949v0r",
                                            "author": "NuggedClarp",
                                            "score": 8,
                                            "created_utc": 1652905885.0,
                                            "response": "Retirement. 30+ years. 401k is perfect for that",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i94b09u",
                                                    "author": "Big_Competition3812",
                                                    "score": -13,
                                                    "created_utc": 1652906349.0,
                                                    "response": "What makes you think that BTC will last that long? Isn't it just a useless earth incinerating waste of energy that relies in the existance of greater fools to exit this below-zero-sum-game with a profit?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i94d51s",
                                                            "author": "NuggedClarp",
                                                            "score": 7,
                                                            "created_utc": 1652907223.0,
                                                            "response": "It’s all relative. It takes a lot less energy to send bitcoin to somebody overseas than to initiate a bank transfer",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i94ls94",
                                                                    "author": "Mr69Niceee",
                                                                    "score": -9,
                                                                    "created_utc": 1652910900.0,
                                                                    "response": "I think it is the opposite.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i94lxza",
                                                                            "author": "NuggedClarp",
                                                                            "score": 11,
                                                                            "created_utc": 1652910967.0,
                                                                            "response": "Can you provide evidence of this?",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        },
                                                                        {
                                                                            "id": "i97yc10",
                                                                            "author": "ThrowAwaydntopnddins",
                                                                            "score": 1,
                                                                            "created_utc": 1652978348.0,
                                                                            "response": "Research the lightning network. A second layer network built on top of Bitcoin with endless scalability that can process more transactions than Visa Card, Master Card, and Paypal combined and at the speed of light settling in less than a second. Using nothing more than things like a raspberry pi, using less energy than you waste on your modern smart phone to move Bitcoin through time and space to anyone anywhere in the world.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "i94lwsi",
                                                            "author": "Hank___Scorpio",
                                                            "score": 4,
                                                            "created_utc": 1652910953.0,
                                                            "response": "The fact that you're here.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9598ks",
                            "author": "Puzzled_Bread_6412",
                            "score": 7,
                            "created_utc": 1652921728.0,
                            "response": "Tether crashing would be a net benefit for bitcoin. People would flee to bitcoin to retain their value.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i96hs23",
                                    "author": "outdatedrhombus",
                                    "score": -1,
                                    "created_utc": 1652949576.0,
                                    "response": "So naive. If/when it collapses you'll get to see what a liquidity crisis looks like",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i96od3v",
                                            "author": "Puzzled_Bread_6412",
                                            "score": 3,
                                            "created_utc": 1652955461.0,
                                            "response": "Liquidity crisis in crypto… not the traditional financial industry. What is the safe haven in crypto?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i96qnl8",
                                                    "author": "outdatedrhombus",
                                                    "score": -1,
                                                    "created_utc": 1652957256.0,
                                                    "response": "USD",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "id": "usiwpu",
            "title": "Is there something more important for an individual like you and me then accumulating as much bitcoin as possible?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/usiwpu/is_there_something_more_important_for_an/",
            "author": "Bedroom-Eastern",
            "created_utc": 1652897083.0,
            "score": 2,
            "num_comments": 15,
            "subreddit": "Bitcoin",
            "selftext": "Im asking this, not because im a scammer. Im asking this because scammers chose a - lets say unethical - way to accumulate more bitcoin by trapping other people. Like this they accumulate more coins then they ever could buy. - yes some of those scammer gonna trade it for fiat, but some just gonna hodl it as most of us intend to.\nPeople who lose their coins most likely didn’t follow one of the basic rules which every true bitcoiner knows and follows. If you ignore at least one security-rule the chance of losing all your bitcoin at some points increases significantly. Therefore these coins get stolen anyway at one point.\nExaggerated example:\nIf i printed my seed phrase on a shirt and went to public places, then i couldnt really blame someone but me for being robbed.",
            "stickied": false,
            "comments": [
                {
                    "id": "i93t58h",
                    "author": "Suspicious_Plan3394",
                    "score": 11,
                    "created_utc": 1652899060.0,
                    "response": "Family, friends and not smoking as much weed as you are.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i93w8uy",
                            "author": "Bedroom-Eastern",
                            "score": 1,
                            "created_utc": 1652900333.0,
                            "response": "Im hearing the last one quite often. But i dont do this at all lol",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i941bg7",
                                    "author": "Keith_Kong",
                                    "score": 0,
                                    "created_utc": 1652902407.0,
                                    "response": "You definitely have some ADHD going on with this post lol\n\nTrying to relate accumulation importance with a random story about scammers maybe accumulating, maybe selling, ending with pondering who's at fault for getting hacked by a scammer.\n\nLike, what is the point of this post? lol",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i93zyhb",
                    "author": "Chipjack",
                    "score": 5,
                    "created_utc": 1652901849.0,
                    "response": "I'm not a particularly good-looking person, in my opinion, but when I look in the mirror, I see someone I like, someone I feel like I can respect. That guy in the mirror usually does the right thing, and almost always treats other people well. And when he screws up, he admits it and tries to make amends. It's good to be able to like yourself.\n\nI could spend my time trying to acquire wealth by any means necessary, no matter who it hurts, but then I'd probably need to get rid of all my mirrors. I don't want to be that guy.\n\nI think being the person you want to be, even if that person has struggles, is better than being someone you despise.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93r2q9",
                    "author": "ducasaurus",
                    "score": 2,
                    "created_utc": 1652898214.0,
                    "response": "A comfortable level of quality of life.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93ycvj",
                    "author": "sylsau",
                    "score": 2,
                    "created_utc": 1652901197.0,
                    "response": "There are more important things than Bitcoin to your survival.\n\nBut accumulating Bitcoin will allow you to really take care of your money future so you can better take care of those you love and live a better future life.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i96b2d6",
                    "author": "Telechain",
                    "score": 2,
                    "created_utc": 1652943635.0,
                    "response": "No",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93qbwl",
                    "author": "Educational_Big_5968",
                    "score": 1,
                    "created_utc": 1652897911.0,
                    "response": "Food and water.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i94fnmd",
                    "author": "MrQ01",
                    "score": 1,
                    "created_utc": 1652908278.0,
                    "response": "Gonna skip over the stuff about whether its ethical to take someone's seed phrase (as I find the title question more interesting).\n\nI accumulate Bitcoin because there are more important things in my life - and so it serves as a means to enhance these areas (the usual - family, friends, travelling, being a good person etc). I don't actually worship \"numbers on a screen\" and, though I appreciate the utility and service they offer, would find it depressing to hear of someone struggling to find anything more important to them than Bitcoin.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i94hntm",
                    "author": "swgo1",
                    "score": 1,
                    "created_utc": 1652909132.0,
                    "response": "Yes",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i97xay6",
                    "author": "Independent-Snow-129",
                    "score": 1,
                    "created_utc": 1652977935.0,
                    "response": "I still believe it's unethical, you could compare this to a blind man dropping money on the ground by accident .\n\n*edited*: You decide what is more important for your life needs. Most likely, I'm not like you and you are not like me !",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i98hfne",
                            "author": "Bedroom-Eastern",
                            "score": 1,
                            "created_utc": 1652986075.0,
                            "response": "Its more like: someone stores gold at home (viewable from the street in the living room) but never closes his garden door.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i98mfzh",
                                    "author": "Independent-Snow-129",
                                    "score": 1,
                                    "created_utc": 1652988105.0,
                                    "response": "Send him/her a note  -Hey , you might want to boost your security level , everyone can see that shiny gold through your window you silly rabbit.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i98noo6",
                                            "author": "Bedroom-Eastern",
                                            "score": 1,
                                            "created_utc": 1652988612.0,
                                            "response": "I can clearly see the reddit tweets: \" who lost access to the wallet with the following seed phrase ...\"",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}