{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "u0rlwl",
            "title": "How to clean my kyc bitcoin?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/u0rlwl/how_to_clean_my_kyc_bitcoin/",
            "author": "SadAttemptx",
            "created_utc": 1649626428.0,
            "score": 3,
            "num_comments": 35,
            "subreddit": "BitcoinBeginners",
            "selftext": "I have 0.05 bitcoins bought on Kraken, so with KYC.\n\nWhat is the best way to anonymize them?\n\n1) Wasabi is no longer reliable for making coinjoin\n\n2) Whirpool they say does not have a high enough anonymity set and also you have to trust a third party\n\n3) I don't have a full node to do coinjoin with joinmarket\n\nWhat can I do to clean my bitcoins?",
            "stickied": false,
            "comments": [
                {
                    "id": "i47ru9z",
                    "author": "bitusher",
                    "score": 3,
                    "created_utc": 1649626905.0,
                    "response": ">Wasabi is no longer reliable for making coinjoin\n\nthis is untrue. To answer your questions-\n\nhttps://www.reddit.com/r/BitcoinBeginners/comments/txpxjz/people_are_telling_me_to_not_use_wasabi_wallet/",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i495gqw",
                    "author": "redditofuse",
                    "score": 3,
                    "created_utc": 1649650601.0,
                    "response": "Swap them to lightning sats and then swap them back on-chain.\n\nSwap them to liquid sats and then swap them back on-chain.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "tovctc",
            "title": "Oops I messed up",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/tovctc/oops_i_messed_up/",
            "author": "Immediate_Living3830",
            "created_utc": 1648311069.0,
            "score": 3,
            "num_comments": 31,
            "subreddit": "BitcoinBeginners",
            "selftext": "I’ve been DCA’ing for a while and have been transferring the bitcoin to 1 address. What’s the best actions I can take to decrease the damage I have done to my privacy?",
            "stickied": false,
            "comments": [
                {
                    "id": "i27k05o",
                    "author": "IRightReelGud",
                    "score": 4,
                    "created_utc": 1648312955.0,
                    "response": "Who cares? \n\nSeriously. Your \"error\" caused no damage.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "thm4lh",
            "title": "Fatal error while synchronizing with blockchain",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/thm4lh/fatal_error_while_synchronizing_with_blockchain/",
            "author": "GasaiMiki",
            "created_utc": 1647659030.0,
            "score": 4,
            "num_comments": 34,
            "subreddit": "BitcoinBeginners",
            "selftext": "So, it has been quite a few years since I last had this going... Quite a few. I seem to be having issues synchronizing. I was at around 72% and it ended up giving me the error message and shutting down every attempt. Found out it had something to do with the chainstate file, so I dumped that and restarted the grind. Everything was smooth until it gave me an error at around 60% and I deduced that it was once again the chainstate file. Attempt number three and I made it  as far as 48% before it won't let me continue. \n\nLast time I did find the 2-3 most recent blocks in my blockchain file didn't seem to correspond with how the other files looked, so I zipped those away. \n\nThe debug is first giving the flag at deserialize or I/O error, FlatFilePos(nFile=1385, nPos=35865147\n\nSomewhere around there. Is there anyone slightly more adept at diagnostic procedures that could help?",
            "stickied": false,
            "comments": [
                {
                    "id": "i18vg5q",
                    "author": "igadjeed",
                    "score": 3,
                    "created_utc": 1647664582.0,
                    "response": "The error message is saying that the blocks stored in block file #1385 are corrupt. This is the type of error which occurs at random times during node initialization when the data is stored on a USB2-connected disk. If you're using a SATA-connected internal disk, it indicates a faulty disk  \n\nMore details about your hardware please",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "u9czsz",
            "title": "Bitcoin and taxes; why do I see people saying it’s hard to figure?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/u9czsz/bitcoin_and_taxes_why_do_i_see_people_saying_its/",
            "author": "clandestine2anon",
            "created_utc": 1650628886.0,
            "score": 3,
            "num_comments": 60,
            "subreddit": "BitcoinBeginners",
            "selftext": "As all the transactions are visible shouldn’t it be easy to point some analytics at your public address and compute a number? Has this not been developed yet?\n\nPersonally I haven’t sold any so as far as I can tell I’ve got nothing to file. Just wondering how this works going forward.",
            "stickied": false,
            "comments": [
                {
                    "id": "i5qukzy",
                    "author": "Narmotur",
                    "score": 5,
                    "created_utc": 1650633545.0,
                    "response": "If you are using an exchange or multiple exchanges, not all transactions are visible because they take place within the exchange itself. Not all exchanges provide a nice way to access this data, apparently.\n\nAdditionally, a public address tells you nothing about the purchase price of the coins within. The government cares about what you paid for the coins, not just how many there are, so you need to track that yourself.\n\nAs for your sub question, yes, you need to pick an accounting method for your coins and stick to it within a tax year, like LIFO or FIFO. Best to talk to an accountant for this sort of info.\n\nMost people who have serious tax issues are involved in day trading or alt coins, and are surprised to find that every trade to and from an altcoin is a sale that needs to be recorded and reported.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "t7wm3s",
            "title": "Is this how mining works?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/t7wm3s/is_this_how_mining_works/",
            "author": "rartedw",
            "created_utc": 1646564914.0,
            "score": 3,
            "num_comments": 26,
            "subreddit": "BitcoinBeginners",
            "selftext": "\n\n1. Miners see people want to send bitcoin\n\n2. A miner solves the math thing (idk what it's called)\n\n3. The miner makes a new block and puts the new transactions in the block\n\n4. Full nodes check if the block is valid (no one can spend more bitcoin than they have etc)\n\n5. Block goes to blockchain and the miner gets 6.25 BTC",
            "stickied": false,
            "comments": []
        },
        {
            "id": "t7kj1j",
            "title": "Beginner Question",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/t7kj1j/beginner_question/",
            "author": "justaohioguy",
            "created_utc": 1646519427.0,
            "score": 3,
            "num_comments": 16,
            "subreddit": "BitcoinBeginners",
            "selftext": "I am using Crypto.com and I have a Ledger Wallet. Can’t I just transfer my coins from crypto.com to Ledger?",
            "stickied": false,
            "comments": [
                {
                    "id": "hzinc96",
                    "author": "bitusher",
                    "score": 5,
                    "created_utc": 1646527154.0,
                    "response": "Yes, but that is a horrible exchange with very high withdraw fees of 0.0005 BTC , so you are better off using another exchange like one listed in the FAQ . Many exchanges have free withdrawals",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "t4kvzn",
            "title": "Beginner questions about bitcoin.",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/t4kvzn/beginner_questions_about_bitcoin/",
            "author": "Cryptoff98",
            "created_utc": 1646175437.0,
            "score": 3,
            "num_comments": 24,
            "subreddit": "BitcoinBeginners",
            "selftext": "Couple of questions as I’m looking to make a small investment in Crypto:\n1. You are advised to keep you keys and such offline. On a device like a Ledger Nano S. When you buy Bitcoin, aren’t you given these keys on your computer? At that point their online since they’ve come through the exchanges website, no? So when people buy Bitcoin do they have it online for a couple minutes until they can transfer their keys to Ledger?\n\n2. Couple years back I bought some Bitcoin only to make a small purchase online. I had just a tiny bit of Change left but don’t exactly remember how much. I saved a txt document with 2 keys in them. I didn’t mark them as private/public/wallet or anything. Just two strings of characters. I want to see what the balance is, if any. How do I see if there’s any Bitcoin left? Is there a way to determine which of the 2 keys I have is the private or public?",
            "stickied": false,
            "comments": [
                {
                    "id": "hyz460v",
                    "author": "TheGreatMuffin",
                    "score": 3,
                    "created_utc": 1646175755.0,
                    "response": "> So when people buy Bitcoin do they have it online for a couple minutes until they can transfer their keys to Ledger?  \n\nThat's correct. Dealing with an exchange is a point of trust: you have to trust the exchange that they let you transfer your coins out in the end. That's why it's recommended to NOT let your coins on there for longer periods of time (or any periods, for that matter).  \n\n> I want to see what the balance is, if any. How do I see if there’s any Bitcoin left? Is there a way to determine which of the 2 keys I have is the private or public?  \n\nIt's possible to recognize them because pubkeys and privkeys have different formats, but I can't help with it from my memory right now. You can try importing either of those into a proper wallet like Electrum: https://electrum.org/ (and play around with different ways of importing them, as depending on how your previous wallet was created, it might show a 0 balance even if it's not empty, so you might need to figure out the \"right\" recovery settings.. but it's not that many, so don't worry).",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "t28g6z",
            "title": "How is bitcoin the answer to oppression if transfers are under state control?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/t28g6z/how_is_bitcoin_the_answer_to_oppression_if/",
            "author": "ekatane",
            "created_utc": 1645913449.0,
            "score": 3,
            "num_comments": 39,
            "subreddit": "BitcoinBeginners",
            "selftext": "Hello, first post here. Maybe a dumb question, but...\n\nDuring the Canada trucker protests, when we saw donations to the cause being frozen by the state, it seemed like Bitcoin's moment to shine, and every other post on social media claimed that 'Bitcoin fixes this!'\n\nBut, to my eyes, it seemed like the solution fell short. While a person could donate to a Bitcoin wallet that was purportedly tied to the protests, that donation didn't do them any good if they had no way to convert that Bitcoin to dollars. Obviously, the recipient couldn't directly use Bitcoin to buy groceries or gas, they'd need to sell that Bitcoin to get money into their bank account, and that transfer to the bank account could be prevented or frozen. Same goes for trying to use a service like PayPal to broker the transaction between a Bitcoin wallet and a store - PayPal can (and will) cave to state pressure in these situations.\n\nI understand that P2P transfers are basically beyond state control, which sounds good in principle, but eventually \\*someone\\* has to transfer that Bitcoin to cash and interact with the regular economy, and it seems to me like that attempted transfer will always be under the control of the state. Is there something I'm missing here?\n\nThanks!",
            "stickied": false,
            "comments": [
                {
                    "id": "hyknrqm",
                    "author": "Mister_VWP",
                    "score": 3,
                    "created_utc": 1645916656.0,
                    "response": "Actualy since the bitcoin wallets are not tied to the protestors any protestor could cash out on a friends bank account and recieve the money in cash without the friend worying about any state action.\n\nI get what you are saying. \nBut for example in Elsalvador this problem isnt existing since btc are accepted in every store.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "sxktsw",
            "title": "I emailed bitcoin money from Coinbase to my e-mail. My so says I shouldn’t have done that and it’s gone. I have the e-mail confirming that it’s been sent. How can I find it? Or is it gone for sure?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/sxktsw/i_emailed_bitcoin_money_from_coinbase_to_my_email/",
            "author": "Electronic_Wind_9540",
            "created_utc": 1645418689.0,
            "score": 3,
            "num_comments": 35,
            "subreddit": "BitcoinBeginners",
            "selftext": "My *son",
            "stickied": false,
            "comments": [
                {
                    "id": "hxt354x",
                    "author": "blaze1234",
                    "score": 8,
                    "created_utc": 1645428671.0,
                    "response": "it is not possible to send BTC to an email address.\n\nFigure out how to describe precisely what you did step by step and come back.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "hxtfhu9",
                            "author": "drrgrr123",
                            "score": 3,
                            "created_utc": 1645438800.0,
                            "response": "On Coinbase you can. Should be sent to an email linked to a Coinbase account for it to be successful, I guess.\n\n  \n\n\n> If you’re a Coinbase customer, you can also send crypto to any email address in 100+ countries instantly and for free. Just open your Coinbase app, select the crypto and an amount, enter the recipient’s email address, and hit send.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "hxtiifv",
                                    "author": "blaze1234",
                                    "score": 3,
                                    "created_utc": 1645441306.0,
                                    "response": "Well of course, with hundreds of custodial services work like that.\n\nBut from BTC's POV that's all off chain, invisible stuff, just a notification someone wants to send, nothing is actually sent.\n\nUnless they are signed up for Coinbase already as you say, or maybe replying with an email containing a BTC receiving address",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "hxt0ftu",
                    "author": "Squishyblobfish",
                    "score": 3,
                    "created_utc": 1645426703.0,
                    "response": "How do you email bitcoin",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "hxtqjsg",
                    "author": "bitusher",
                    "score": 3,
                    "created_utc": 1645447275.0,
                    "response": "When you email Bitcoin with coinbase they send a email to allow your son to claim it. If your son does not claim the Bitcoin it simply gets returned to you.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "sx9co4",
            "title": "Buying BTC under 18 and without ID verification",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/sx9co4/buying_btc_under_18_and_without_id_verification/",
            "author": "liamdempsey014",
            "created_utc": 1645385816.0,
            "score": 3,
            "num_comments": 37,
            "subreddit": "BitcoinBeginners",
            "selftext": " I've been looking to buy for way too long I can't find anywhere trustworthy enough that also doesn't ask for ID any suggestions would be appreciated",
            "stickied": false,
            "comments": [
                {
                    "id": "hxqt89i",
                    "author": "nitra007",
                    "score": 5,
                    "created_utc": 1645388186.0,
                    "response": "Look for bitcoin atm near you most you can buy with no ID under certain amounts just need a phone #",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "su3dvz",
            "title": "How do I keep my crypto activity under the table? Asking academically for a friend.",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/su3dvz/how_do_i_keep_my_crypto_activity_under_the_table/",
            "author": "HrvrdMonky",
            "created_utc": 1645037830.0,
            "score": 3,
            "num_comments": 24,
            "subreddit": "BitcoinBeginners",
            "selftext": "Things we can count on in life are death and taxes. It’s not advisable to attempt to elude either one but given we endeavour to be masters of our destiny…\n\nSince my friend already has a source for unicorn blood (legit imported from the promise land), I figured we could start a discussion about the ‘Unicorn Blood’ for the 2nd point. \n\nThis discussion is for academic and karma purposes only ;-)\nEveryone should report their income and follow their laws/regulations so you can help pay for my healthcare.\nIf your activity attracts attention by the authorities, they’ll still track you dispute these steps below… just say no to illegal activity.\n\nWhy: My friend and I haven’t heard of centralized and regulated exchanges/crypto dealers reporting customer activity to the tax man but I can imagine it would be an easy fight to force these organizations to share this kind of activity in the future.\n\nNot all the steps should be thought of as required but the space is evolving so this is more for good measure.\n\n1. Start an email that is not specific to your personal information from a privacy oriented provider (proton mail for example). Only use this email for the one exchange account - nothing else. Use strong password formatting/keeping.\n\n2. Use a vpn showing you from a less regulation-oriented country (ex. GT), open an exchange account with a provider that allows for decent daily withdrawal limits for unverified accounts (ex. Kucoin allows <1BTC/day). Always show your activity from that country.\n\n3. Don’t use your phone number (SMS) for verification purposes.\n\n4. Fund your exchange account through sources that don’t know or KYC you. Example, peer to peer, Bisq, Coinshack (<$600/day as of today). All of these sources won’t perform KYC and will allow you to stage value into and out of the cryptosphere. \n\n5. NEVER commingle your new under-the-table activity with KYC end points.\n\nAt least that’s how I would do it, if I was ever gonna do it, not that I have. To the naughty noobs that insist on being dumb and drinking unicorn blood, you’re welcome.",
            "stickied": false,
            "comments": [
                {
                    "id": "hx7wxji",
                    "author": "smiling_corvidae",
                    "score": 3,
                    "created_utc": 1645043927.0,
                    "response": "Bullish on unicorn blood",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "u9c9nu",
            "title": "Why does Bitcoin correlate to the stock markets? What are the drivers for this behaviour of Bitcoin?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/u9c9nu/why_does_bitcoin_correlate_to_the_stock_markets/",
            "author": "BandidoPinguino",
            "created_utc": 1650626351.0,
            "score": 2,
            "num_comments": 64,
            "subreddit": "BitcoinBeginners",
            "selftext": "Why does Bitcoin correlate to the stock markets? What are the drivers for this behaviour of Bitcoin?",
            "stickied": false,
            "comments": [
                {
                    "id": "i5qhd2v",
                    "author": "AutoModerator",
                    "score": 2,
                    "created_utc": 1650626352.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i5rvgu9",
                    "author": "LunaGuardian",
                    "score": 2,
                    "created_utc": 1650648375.0,
                    "response": "They are both considered risky/volatile, so when interest rates rise or are anticipated to rise, money tends to get pulled from both as it becomes more profitable to get bonds or other low-risk assets correlated with interest rates.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i5sesuy",
                    "author": "bitusher",
                    "score": 1,
                    "created_utc": 1650656100.0,
                    "response": "The question is based upon a false premise. Bitcoin and Stocks are uncorrelated in price. This by definition means that sometimes their is neutral correlation , other times positive correlation, and other times negative correlation.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uhvgqb",
            "title": "Does every bitcoin transaction get logged to the blockchain?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/uhvgqb/does_every_bitcoin_transaction_get_logged_to_the/",
            "author": "csmart01",
            "created_utc": 1651628174.0,
            "score": 16,
            "num_comments": 72,
            "subreddit": "BitcoinBeginners",
            "selftext": "I know it’s a stupid question but I can’t wrap my head around how big the blockchain could get if every cup of coffee purchased is logged. Wouldn’t it become just too large. Also - another dumb one - what if you are without an internet connection, is the transaction logged temporarily and then registered once you are in line? And if you have a desktop hard wallet and make a phone transaction how does it link to the hard wallet if that is off line?",
            "stickied": false,
            "comments": [
                {
                    "id": "i792tta",
                    "author": "igadjeed",
                    "score": 11,
                    "created_utc": 1651637102.0,
                    "response": "> Wouldn’t it become just too large\n\nThe Bitcoin block size is limited to about 1.7MB and the Bitcoin block count is limited to 144 blocks per day. This means that a reasonably priced storage device ($200) can store more than 150 years of Bitcoin transactions\n\n> is the transaction logged temporarily\n\nTransactions are stored on the Bitcoin blockchain. Money isn't sent to your wallet. A transaction is included in a block on the blockchain. One of the outputs of that transaction has an address which makes it your coin, even though the transaction is not in your wallet  \n\nBitcoin is a decentralized system of network nodes. Each node is operated independently. Each node stores the Bitcoin blockchain. If your node goes off-line for a few days, all the other nodes store all the transactions on their copies of the Bitcoin blockchain. When your node comes back on-line, it spends an hour or two catching up  \n\nYour wallet can be off-line forever. When it connects to the Internet, it asks your node (or some stranger's node if you don't have your own) for a list of transactions which match the wallet's list of addresses  \n\nA wallet needs to connect to a node to update its transaction history, or to broadcast a transaction",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i79zgjk",
                            "author": "csmart01",
                            "score": 0,
                            "created_utc": 1651661833.0,
                            "response": "The blockchain is currently over 300 gigabytes and let’s face it - few use BTC as a daily currency. I’m hypothesizing maybe 20% of the global population are on board - wouldn’t it be terabytes?  I also see a reply that if your wallet is off line it can take a hour or 2 to register your transactions. With a 500 TB block chain that could be days - no?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7cny40",
                                    "author": "igadjeed",
                                    "score": 1,
                                    "created_utc": 1651702924.0,
                                    "response": "Obviously you failed elementary school arithmetic. When you take the time to relearn those things, ask this question again. Until then, you're not competent to understand",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i7coi8t",
                                            "author": "csmart01",
                                            "score": 1,
                                            "created_utc": 1651703159.0,
                                            "response": "That’s a helpful reply in a beginner specific sub. Would you take the time to reply? You spent a lot of typing insulting me.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i7cqyhr",
                                                    "author": "igadjeed",
                                                    "score": 1,
                                                    "created_utc": 1651704210.0,
                                                    "response": "I responded to your question, you ignored my comment and made a stupid 500TB claim. Post again when you've learned elementary school arithmetic",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i7cv2lb",
                                                            "author": "csmart01",
                                                            "score": 1,
                                                            "created_utc": 1651706040.0,
                                                            "response": "I’m really sorry - but I don’t understand. The chain is now over 300GB. I just googled it and see this from 2021 that is will be 1TB in 2030 And again - as I stated - basically nobody uses BTC (El Salvador tried and failed) so let’s assume “the world” starts using BTC - why is 500TB so stupid? You really don’t belong here if you are u willing to help without insulting people. Does this bring you satisfaction? Pretty sad. \n\nFrom Google, 2021: In the last two years, the bitcoin blockchain ledger size has grown from 150 GB to 250 GB. That's almost 50 GB per year. By 2030, we can see the blockchain ledger size cross more than 1 TB",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i7cvynr",
                                                                    "author": "igadjeed",
                                                                    "score": 1,
                                                                    "created_utc": 1651706452.0,
                                                                    "response": "All this was answered in my first comment:  \n\n> The Bitcoin block size is limited to about 1.7MB and the Bitcoin block count is limited to 144 blocks per day\n\nNow that you've read this twice, please do the arithmetic\n\n> By 2030, we can see the blockchain ledger size cross more than 1 TB\n\nA 1TB HDD costs about $40 in 2022. It will be cheaper in 2030",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i7jdl9z",
                                                                            "author": "csmart01",
                                                                            "score": 1,
                                                                            "created_utc": 1651833219.0,
                                                                            "response": "So phones will have 1TB hard drives?",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i7nyq3r",
                                                                                    "author": "igadjeed",
                                                                                    "score": 1,
                                                                                    "created_utc": 1651922319.0,
                                                                                    "response": "Some phones already have 1TB storage  \nNot that it's relevant to Bitcoin  \n\nYour assumptions were incorrect. Let go of your ego. Stop clinging to your false beliefs. Learn something new",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i7nzy6h",
                                                                                            "author": "csmart01",
                                                                                            "score": 0,
                                                                                            "created_utc": 1651923213.0,
                                                                                            "response": "How can I let go… you keep coming back for more 🤣😂🤣😂\nI’ll stop. Thanks for your help - I learned a lot from other folks posting. It’s a fascinating concept.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i78nh5j",
                    "author": "lightninghero-node",
                    "score": 14,
                    "created_utc": 1651629740.0,
                    "response": "Yes it does. Every transaction is saved in the blockchain forever. I agree it’s pretty stupid to have every small transaction take up space on the blockchain, but this is why lightning is being developed. \n\nLightning is a second layer protocol, that allows you to use Bitcoin similar to using a bank account and cash. You can make one transaction on chain to load up your lightning wallet with “cash” and then use it to make small purchases on the lighting network without having to record it on the blockchain until you run out of funds.\n\nThis way, the blockchain is similar to your bank statement, where you only record one transaction when you take out money from an ATM and daily spendings are done off-chain.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7alyyb",
                            "author": "csmart01",
                            "score": 0,
                            "created_utc": 1651673642.0,
                            "response": "I just looked into lightning and their site is informative. As I read it though it seems not “every” transaction is logged to the BC but a final “settling up” transaction. Or am I misunderstanding this?\n\nBidirectional Payment Channels. Two participants create a ledger entry on the blockchain which requires both participants to sign off on any spending of funds. Both parties create transactions which refund the ledger entry to their individual allocation, but do not broadcast them to the blockchain. They can update their individual allocations for the ledger entry by creating many transactions spending from the current ledger entry output. Only the most recent version is valid, which is enforced by blockchain-parsable smart-contract scripting. This entry can be closed out at any time by either party without any trust or custodianship by broadcasting the most recent version to the blockchain.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7igrkd",
                                    "author": "lightninghero-node",
                                    "score": 1,
                                    "created_utc": 1651808254.0,
                                    "response": "You got it right. Traditionally, every transaction is written to the blockchain. Lightning avoids that and only logs the opening and the closing transaction of a payment channel. All the intermediate transactions are not written to the blockchain.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i7je2z7",
                                            "author": "csmart01",
                                            "score": 1,
                                            "created_utc": 1651833594.0,
                                            "response": "Thanks - so your first response was basically wrong? I’m not trying to be a dick (but in know it comes across that way) I’m just so confused about crypto and every time I post to this “beginners” sub I get a slew of contradictory responses which leads me to believe very few people really understand crypto. I want to get into it but could never unless I really understand it and that process is taking forever :( \nBut I’m getting there",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i7jus4p",
                                                    "author": "lightninghero-node",
                                                    "score": 1,
                                                    "created_utc": 1651843237.0,
                                                    "response": "Seems like you’re confused by my answer. There’s two parts there:\n\nFirst, not considering lightning, because it’s new and not very common yet. When you don’t use lightning, then every transaction is done on-chain. That means, it’s registered on the blockchain forever, no matter how small. \n\nSecond: there’s a new development called lightning which avoids that, by adding a second layer to Bitcoin that allows a different way of making transactions. This is what avoids recording every transaction on the blockchain. But only if both the sender and the receiver do actually use lighting. It’s not as easy as doing transactions on-chain, and both parties need to use a lightning node to transact. This is a special software that has to be running and connected to the lightning network as the same time so they can perform the transaction. \n\nLightning is quite new and experimental. It works pretty well, but it’s still not widespread enough. So when you ask about the blockchain and every transaction being recorded on it, the standard answer is yes assuming that lightning is not used.\n\nEdit: it’s like when someone asks: “Do you have to use the clutch to change gears when you drive a car?” The answer is “Yes, unless you drive automatic”.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i7lodul",
                                                            "author": "csmart01",
                                                            "score": 2,
                                                            "created_utc": 1651871544.0,
                                                            "response": "Hugely helpful! Thanks",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i79e40p",
                    "author": "bitusher",
                    "score": 3,
                    "created_utc": 1651644130.0,
                    "response": "Most Bitcoin transactions occur offchain or on other layers today. think of onchain transactions more as a settlement network",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i78s918",
                    "author": "0xArmin",
                    "score": 1,
                    "created_utc": 1651631878.0,
                    "response": "Re your second question: You have to be online for the transaction to work- at least so that the merchant can check that sufficient number of nodes have confirmed this transaction.\n\nRe your third question: Hard wallets have to be connected to something online for it to receive and authorise transactions. E.g. USB to computers and Bluetooth to phone.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7a7n2p",
                    "author": "harryvl",
                    "score": 3,
                    "created_utc": 1651666861.0,
                    "response": "Check out ligtning network .",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i78jvh0",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1651628175.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i79y0yz",
                    "author": "AbuddyFL",
                    "score": 1,
                    "created_utc": 1651660780.0,
                    "response": "Yep",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i79zvlu",
                    "author": "irene74569",
                    "score": 1,
                    "created_utc": 1651662122.0,
                    "response": "not compulsory.\n\nminers can mine block with tx that will not be visible on blockchain",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7algoi",
                    "author": "GibbsSamplePlatter",
                    "score": 1,
                    "created_utc": 1651673426.0,
                    "response": "Probably over 99% of all transactions are done \"off-chain\":  \n1) Exchange buying and selling to customers. Not chain enforceable so censorship/theft can occur.  \n2) Smart contract based like Lightning Network, Statechains, where if the service becomes unreliable, you can take your funds on-chain after a timeout. They resist censorship/theft to varying degrees, depending on the security model chosen.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7ampqz",
                            "author": "csmart01",
                            "score": 1,
                            "created_utc": 1651673952.0,
                            "response": "Thanks. I swear - I will never understand this crypto thing :(\nSo most replies say “yes - every transaction is recorded” but you seem to contradict this. I looked into lightning and it is helping me understand and is in alignment with your reply. So to be specific - when “off chain” transactions are “settled up” onto the blockchain do they include a record of every coffee purchased or only the final exchange of BTC which could have 100 small transactions behind it but who cares?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7an4qx",
                                    "author": "GibbsSamplePlatter",
                                    "score": 1,
                                    "created_utc": 1651674124.0,
                                    "response": "this is kind of a \"one hand clapping\" situation.\n\nI have made hundreds of Lightning Network payments, none of which have \"gone to chain\". If I \"go to chain\", it'll end up being a single transaction, quite small. Think \"batch settlement\" in a trust-minimized manner.\n\nYou might \"go to chain\" to pay someone on chain who asked for it, or to send to cold storage, or to increase capacity of your LN node, etc. Lots of reasons.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i7cnfh6",
                                            "author": "csmart01",
                                            "score": 1,
                                            "created_utc": 1651702714.0,
                                            "response": "So what you are saying - I think - is all the folks that answered yes to my question were wrong. Not EVERY transaction goes to the chain. Correct?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i7cucqq",
                                                    "author": "GibbsSamplePlatter",
                                                    "score": 2,
                                                    "created_utc": 1651705715.0,
                                                    "response": "Yes with caveats",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i7bq6b8",
                    "author": "IntelligentAuthor626",
                    "score": 1,
                    "created_utc": 1651689677.0,
                    "response": "The mechanics of a bitcoin transaction block chain, which is a construct that is generated by bitcoin miners and functions as a global ledger for recording and validating bitcoins.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7g9yz3",
                    "author": "Beginning_Drive_9521",
                    "score": 1,
                    "created_utc": 1651772660.0,
                    "response": "You could theoretically encounter strange situations like this if not all nodes could communicate with each other. However, once there are two \"different\" chains out there, bitcoin mining nodes will start building on top of the one with the most work put into it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7nmq2r",
                    "author": "Hot-Dealer-2184",
                    "score": 1,
                    "created_utc": 1651911930.0,
                    "response": "Of course it is. It hase some rules",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8bcy1e",
                    "author": "AskEmberAnything",
                    "score": 1,
                    "created_utc": 1652361934.0,
                    "response": "The question is not stupid! The blockchain definitely gets big over time. And to briefly answer your second question, most wallets don't let you submit transactions without an Internet connection. [Here's a more detailed explanation](https://ember.help/questions/332). Please feel free to reply there if you have follow-up questions!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8btti5",
                            "author": "csmart01",
                            "score": 1,
                            "created_utc": 1652368845.0,
                            "response": "Solid info - thanks!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}