{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uwa5jv",
            "title": "UTXO Question",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/uwa5jv/utxo_question/",
            "author": "kaioken1986",
            "created_utc": 1653339325.0,
            "score": 3,
            "num_comments": 19,
            "subreddit": "BitcoinBeginners",
            "selftext": "Is unspent transaction output just the data of the wallets that have not initiated a transaction to another wallet? So like user A recieves x amount bitcoin or sats and just holds it in the wallet? Or am I completely wrong? Please let me know.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9q8xxq",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653339326.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9q9bng",
                    "author": "bitusher",
                    "score": 1,
                    "created_utc": 1653339494.0,
                    "response": "UTXOs (bitcoins) are unspent outputs that exist on the bitcoin public blockchain \n\n> So like user A recieves x amount bitcoin or sats and just holds it in the wallet? \n\nA wallet stores private and public keys that allow you to sign and send these UTXOs that exist on the public blockchain",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9qahyj",
                            "author": "kaioken1986",
                            "score": 1,
                            "created_utc": 1653340010.0,
                            "response": "Unspent meaning that they have resided in that location and have not moved since being transferred to that location? This is a concept I am having a hard time wrapping my head around. The wallet is like the  memory location then.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9qaukc",
                                    "author": "bitusher",
                                    "score": 1,
                                    "created_utc": 1653340170.0,
                                    "response": "Wallets are like a key ring that allow you to use Bitcoin that exist on the ledger. \n\nBitcoin transactions are comprised of inputs and outputs and you always end up spending or sending unspent outputs(UTXOs)\nSo say you have a Bitcoin wallet\nAnd you receive 3 transactions –\n\nTx 1 = 0.5 BTC sent to Address A\n\nTx 2 = 0.3 BTC sent to Address B\n\nTx 3 = 0.45 BTC sent to Address C\n\nNow you have a total balance of 1.25 BTC. You than decide to buy something worth 1 BTC. The wallet is forced to take 3 inputs from these 3 addresses and send to one address leaving this :\n\n**The inputs**\n\nAddress A = 0 BTC\n\nAddress B = 0 BTC\n\nAddress C = 0 BTC\n\n**The outputs**\n\nAddress D(in another wallet) = 1 BTC\n\nAddress E( Back to your wallet) = 0.24999472 btc change going back to a new change address in your wallet\n\nWait, you may ask why didn’t you get 0.25 btc back in change? = You paid a miner fee of 31 pennies of btc to include the tx in a block",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9qd4i9",
                                            "author": "kaioken1986",
                                            "score": 1,
                                            "created_utc": 1653341196.0,
                                            "response": "So you can have more than one address in a wallet? Like infinite due to the public priv key pairs? Also I am confused on the second part talking about the inputs. Do they switch to zero since you are sending the bitcoin to wallet D?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9qe4h0",
                                                    "author": "bitusher",
                                                    "score": 2,
                                                    "created_utc": 1653341653.0,
                                                    "response": "> So you can have more than one address in a wallet?\n\nMillions of addresses. So many you never need to worry about running out. \n\nMost wallets use hierarchical deterministic (HD) key derivation after bip32.\n\nThis means you have \n\n**Backup Seed words (BIP 39 or other)** consisting of 12-24 words that can than recover \n\n**Master extended private key (xpriv,ypriv,zpriv)** Which can generate many private keys \n\n**Master extended public key(xpub,ypub,zpub)** Which can generate many public keys \n\nAs of which from the public keys many Bitcoin addresses can be derived from. \n\n------------------\n\n>Do they switch to zero since you are sending the bitcoin to wallet D?\n\nYes.\n\nThe addresses no longer have UTXOs after spent because by definition they are spent instead of **U**nspent **T**(x)ransactions **O**utputs\n\nSingle addresses can have multiple UTXOs within them as well if you keep sending btc to the same address",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9qened",
                                                            "author": "kaioken1986",
                                                            "score": 1,
                                                            "created_utc": 1653341894.0,
                                                            "response": "So any wallet that just has btc in it sitting there is defined as UTXO's?",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9qge06",
                                                                    "author": "bitusher",
                                                                    "score": 3,
                                                                    "created_utc": 1653342690.0,
                                                                    "response": "**B**itcoin with the capital \"B\" usually refers to the network/protocol as a whole. \n\n**b**itcoins = UTXOs on a public ledger. These UTXOs do not exist in a wallet technically, they exist on the public ledger. Your wallet contains the keys to use those UTXOs . These UTXOs can be locked up in a lightning payment channel as well so you can spend them more efficiently, privately, and use bitcoin in smart contracts , but ultimately the Bitcoin(UTXOs) all exist on the public ledger",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9qoe0s",
                                                                            "author": "kaioken1986",
                                                                            "score": 3,
                                                                            "created_utc": 1653346493.0,
                                                                            "response": "THAT MAKES O MUCH SENSE NOW.  I had a realization last night that the whole thing was the ledger. Wow the mother fing thing is just data on a ledger that we give monetary value with just extra security and a little more complexity. The protocol is Bitcoin but the unit of value is the UTXO's wow.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9qd9z9",
                                            "author": "kaioken1986",
                                            "score": 1,
                                            "created_utc": 1653341265.0,
                                            "response": "So what the hell is a spent transaction? Can you think of unspent like money sitting in a bank account. Were the money has not been spent?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9qfu45",
                                                    "author": "bitusher",
                                                    "score": 3,
                                                    "created_utc": 1653342438.0,
                                                    "response": "There are no \"accounts\" in Bitcoin. Its not an account model , but an UTXO model. \n\nThink of a wallet with a set of bills in it, and each bill represents a key to unlock spending power within an economy. You have 3 bills= a 20 , a 10 , and a 1 dollar bill(3 UTXOs) , you want to buy something worth 25 dollars so you open your wallet and take out the 20 and 10 and hand it to the merchant. The merchant gives you a 5 in change and now your wallet has 2 bills (2 UTXOs), a 1 and a 5 dollar bill. Only one of those UTXOs(bills) is old and now you have a new UTXO(new bill as change)\n\nAn account model would be like a Bank account where you have a balance of 31 dollars inside, you buy something for 25 dollars and that gets subtracted from the 31 and you are left with a balance of 6 dollars. \n\nWhy?\n\nAccount models of accounting are simpler to understand but the UTXO model allows for better efficiencies and scalability and certain privacy benefits.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9qkya6",
                                                            "author": "kaioken1986",
                                                            "score": 2,
                                                            "created_utc": 1653344841.0,
                                                            "response": "Aw that makes some sense now so Satoshi chose UTXO for security purposes then. What a guy or robot idk. That is really cool. So like when you get that change back in your example it's like a new instance in a class if  you compare it to programming. New instances are formed from old instances and so forth.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9qal64",
                            "author": "kaioken1986",
                            "score": 1,
                            "created_utc": 1653340051.0,
                            "response": "Outputs are the coin and the inputs are previous outputs.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9qap3v",
                                    "author": "bitusher",
                                    "score": 2,
                                    "created_utc": 1653340101.0,
                                    "response": "Correct.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9s10lx",
                    "author": "igadjeed",
                    "score": 1,
                    "created_utc": 1653373260.0,
                    "response": "The Bitcoin blockchain only stores transactions, not wallets. A Bitcoin coin is not stored in a wallet. A coin is the output of a transaction. A UTXO is an unspent coin. A coin can only be spent once. A coin can only be spent completely. Bitcoin has no partial spends",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uw9wsv",
            "title": "Why are legacy addresses still used?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/uw9wsv/why_are_legacy_addresses_still_used/",
            "author": "FuelWild665",
            "created_utc": 1653338677.0,
            "score": 0,
            "num_comments": 10,
            "subreddit": "BitcoinBeginners",
            "selftext": "For instance, why do some exchanges still use legacy addresses to receive and send bitcoin? Aren't all formats compatible or how shall I call it?",
            "stickied": false,
            "comments": [
                {
                    "id": "i9qxf0q",
                    "author": "sciencetaco",
                    "score": 3,
                    "created_utc": 1653350942.0,
                    "response": "Some wallets and exchanges use them just because they haven't bothered to update and add support for newer formats.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9q918v",
                    "author": "bitusher",
                    "score": 2,
                    "created_utc": 1653339366.0,
                    "response": "There really aren't good reasons to use legacy P2PKH addresses starting with 1, at minimum they should use SegWit-P2SH addresses starting with 3 . \n\nIf an exchange still uses that address type its a warning they could be a scam exchange or just very irresponsible to not update their wallets/code",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9s56wf",
                            "author": "BTCMachineElf",
                            "score": 1,
                            "created_utc": 1653376771.0,
                            "response": "Updating an exchange is no small task. For smaller local exchanges it can be monumental. My friend runs a smaller exchange in Vietnam and they've been planning an update from legacy addresses for years, hopefully to implement in Q4 this year. It's definitely an arduous process, rewriting the backend and updating thousands of accounts while keeping opsec. He'll also be integrating lightning, which I'm excited for.\n\nIt is necessary however and legacy addresses are an increasing red flag as time goes on.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9q7ga8",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653338677.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9s4qi9",
                    "author": "BTCMachineElf",
                    "score": 1,
                    "created_utc": 1653376363.0,
                    "response": "Outdated infrastructure. Simple as that. At this point it's a sign that an exchange isn't on the ball, so to speak.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}