{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ujay0g",
            "title": "Does the bitcoin market open/close like the stock market?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/ujay0g/does_the_bitcoin_market_openclose_like_the_stock/",
            "author": "dmantzoor",
            "created_utc": 1651795629.0,
            "score": 3,
            "num_comments": 40,
            "subreddit": "BitcoinBeginners",
            "selftext": "How exactly does this work?",
            "stickied": false,
            "comments": [
                {
                    "id": "i7hx904",
                    "author": "sciencetaco",
                    "score": 14,
                    "created_utc": 1651798366.0,
                    "response": "A stock market opens and closes because it has a central controller who can decide such things. \n\nBitcoin has no central control. Each bitcoin exchange (and there are many) can decide it’s own, but they choose to operate 24/7.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7ht5tt",
                    "author": "-_-Stinky-_-",
                    "score": 4,
                    "created_utc": 1651796062.0,
                    "response": "No.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7ht9ad",
                    "author": "_im_Done",
                    "score": 4,
                    "created_utc": 1651796109.0,
                    "response": "It runs 24/7 trading",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7hw8fi",
                    "author": "stealthjewishboy",
                    "score": 3,
                    "created_utc": 1651797739.0,
                    "response": "No, its not a stock market. It’s more like currency exchange",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ulvnsa",
            "title": "How do I simple explain to friends and/or family what Bitcoin is?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/ulvnsa/how_do_i_simple_explain_to_friends_andor_family/",
            "author": "SwurveMan",
            "created_utc": 1652115124.0,
            "score": 4,
            "num_comments": 26,
            "subreddit": "BitcoinBeginners",
            "selftext": "so they can understand easily without having to explain complex consensus algorithms, and the sort.",
            "stickied": false,
            "comments": [
                {
                    "id": "i7y0yoe",
                    "author": "Temporary-Welder7588",
                    "score": 4,
                    "created_utc": 1652117813.0,
                    "response": "Bitcoin uses software and energy to maintain a global ledger, rather than inefficient human recordkeeping.\n\nIt uses a higher % of renewable energy than just about any other industry.\n\nIt gives people worldwide access to inflation-resistant savings and permissionless payments.\n\nIt might be easier to sit down and watch This Machine Greens (45 min doc on YouTube which explains bitcoin simply and then ends with explaining how bitcoin enables a clean energy future) than try to explain it yourself.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7xvbfp",
                    "author": "MOTANYA_BRAVO",
                    "score": 3,
                    "created_utc": 1652115562.0,
                    "response": "As Michael saylor puts it... it's money at a speed of light.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "umksvf",
            "title": "Can \"they\" take over Bitcoin?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/umksvf/can_they_take_over_bitcoin/",
            "author": "DragonfruitDefiant33",
            "created_utc": 1652195074.0,
            "score": 3,
            "num_comments": 42,
            "subreddit": "BitcoinBeginners",
            "selftext": "If they really wanted to can the powers that be ruin bitcoin? \nLet's say they have trillions of dollars and worldwide influence(like locking down the whole world for the flu levels of influence).\n\nCould they do it? \nTaking over the dev team?\nChanging the code to PoS?\nFractional reserves?\nCreating mass formation propaganda to influence people to not use bitcoin and think it's bad?",
            "stickied": false,
            "comments": [
                {
                    "id": "i826frc",
                    "author": "bitusher",
                    "score": 24,
                    "created_utc": 1652195818.0,
                    "response": "> Taking over the dev team?\n\nBitcoin has many independent implementations and many independent groups of developers that all peer review each other code so this would be extremely difficult to do . Easier with a smaller altcoin project for these attacks that lack the diversity bitcoin has \n\n>Changing the code to PoS?\n\nThat will never happen because full nodes don't self update by themselves and users and miners never would go for it . \n\nProof of stake as a whole is pointless, insecure, and will always trend to centralization\n\nProof of stake game theory insures that those with the most coins will continue to collect the most fees , thus creating a vicious cycle of centralization where they continue to accrue more coins with 0 effort unlike with Proof of work where a meritocracy exists of those trying to be more efficient and miners are forced to sell most of their coins\n\n>Fractional reserves? \n\nthis already occurs when people keep bitcoin on exchanges or lend out their btc for interest. Some of these exchanges and companies are likely fractional which is why we tell people to withdraw the bitcoin \n\n>Creating mass formation propaganda to influence people to not use bitcoin and think it's bad?\n\nThis has been ongoing by haters, banks, and governments for the last 13 years. Propaganda and disinformation can slow down bitcoins growth but not stop the truth",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i827nvj",
                            "author": "IRightReelGud",
                            "score": 9,
                            "created_utc": 1652196304.0,
                            "response": "I fucking love this guy. \n\nYou should create a YouTube channel for this content. Create a script and get it recorded and animated.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8294rk",
                            "author": "dwulf69",
                            "score": 4,
                            "created_utc": 1652196888.0,
                            "response": ">Easier with a smaller altcoin project for these attacks that lack the diversity bitcoin has\n\nIf \"They\" had any clue they would be a development team, just say'n :-)",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8283cw",
                            "author": "DragonfruitDefiant33",
                            "score": 2,
                            "created_utc": 1652196477.0,
                            "response": "Thank you for the great response. \n\nSo taking over the dev team would be extremely difficult but still possible? If someone had unlimited resources would it be so difficult for them? They can be manipulated, bought and/or killed and replaced by people who want to destroy bitcoin.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8296m1",
                                    "author": "bitusher",
                                    "score": 5,
                                    "created_utc": 1652196908.0,
                                    "response": "> So taking over the dev team would be extremely difficult but still possible? \n\nThere is no single dev team. There are multiple independent implementations and many nodes don't upgrade either. People like myself review the source code and build the binaries from scratch before updating our nodes as well so this also would prevent any malicious code from being added \n\n>If someone had unlimited resources would it be so difficult for them? \n\nMoney can only do so much. Once you have sufficient amount of eyes on the code it becomes almost impossible to compromise it. The game theory is that we are incentivized by many billions of dollars in value to protect our money and since some of the best developers are working on bitcoin (many of them are independently wealthy from being early adopters ) they cannot be easily bribed",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i83kiyt",
                            "author": "Sendmedoge",
                            "score": 1,
                            "created_utc": 1652215797.0,
                            "response": "\"Proof of stake is pointless\" expand on that, please.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i84t5on",
                                    "author": "sciencetaco",
                                    "score": 2,
                                    "created_utc": 1652235514.0,
                                    "response": "Look into the \"weak subjectivity\" and \"long range attack\" issues. PoS systems cant be independently verified by a new user who downloads the whole chain from scratch.\n\nWith PoW you accept the chain that has the most accrued work. But with PoS you need to trust other nodes who are always online to add verified \"checkpoints\" in the blockchain.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i83w2ol",
                                    "author": "bitusher",
                                    "score": 1,
                                    "created_utc": 1652220609.0,
                                    "response": "https://www.reddit.com/r/BitcoinBeginners/comments/pb6zzh/how_does_proofofstake_work_i_can_understand/\n\nhttps://www.reddit.com/r/BitcoinBeginners/comments/u5snzl/takeaways_from_stanford_universitys_paper_on/i540dgp/",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i83xk98",
                                            "author": "Sendmedoge",
                                            "score": 1,
                                            "created_utc": 1652221260.0,
                                            "response": "\"Take the same energy to create, secure\".  \n\nWhich is all initiall stuff... \n\nThere a reason you leave the actual USE out of the power use comparison?\n\nSince usage is the largest variable after just a couple years on any coin?\n\nIts like the one part that matters most and where pos shines was left out.\n\nIsnt that like buying a car that gets 1 mile per gallon and saying \"its better for the environment because of material\"?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i83y1sz",
                                                    "author": "bitusher",
                                                    "score": 1,
                                                    "created_utc": 1652221474.0,
                                                    "response": "No. The cost to **continue** to use the currency due to rent(locked up stake) forces production costs (MC) to always equal sale prices (MR)\n\nhttp://www.truthcoin.info/blog/pow-cheapest/\n\nhttp://www.truthcoin.info/blog/pos-still-pointless/",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i83y7ti",
                                                    "author": "bitusher",
                                                    "score": 1,
                                                    "created_utc": 1652221548.0,
                                                    "response": "> Isnt that like buying a car that gets 1 mile per gallon and saying \"its better for the environment because of material\"?\n\nThe more valuable something is the more it will cost to secure it because the more effort will be made to steal and or control it. This applies to any currency or asset.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i83yuvg",
                                                            "author": "Sendmedoge",
                                                            "score": 1,
                                                            "created_utc": 1652221828.0,
                                                            "response": "Right.. but thats \"mostly\" in the upfront costs. \n\nWhich on a coin that lasts.. will be the smallest of the cost.\n\nThe big part is the actual USE of the asset.\n\nLike I asked in my example.. doesnt that seem like buying a recyclable car that gets 1 mile per gallon?",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i83zd03",
                                                                    "author": "bitusher",
                                                                    "score": 1,
                                                                    "created_utc": 1652222050.0,
                                                                    "response": ">but thats \"mostly\" in the upfront costs.\n\nno , most of the costs will come after minting due to continued use , locked up capital , misallocation or resources (especially since the game theory makes it worse than fiat as it tends towards and unaccountable oligarchy)\n\n>doesnt that seem like buying a recyclable car that gets 1 mile per gallon?\n\nPoS is more akin to a car with triangle wheels and a mule pulling it instead of a motor \n\nIt makes no sense whatsoever as money and fiat is much better",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i83zuzo",
                                                                            "author": "Sendmedoge",
                                                                            "score": 1,
                                                                            "created_utc": 1652222270.0,
                                                                            "response": ">no , most of the costs will come after minting due to continued use\n\nThis is exactly my point. I'm saying what YOU are talking about (minting, security)  is the INITIAL cost.\n\nAs best as I can research, continued use is exactly where POS is less energy. Which, as you just stated... is most of the cost.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i840fuc",
                                                                                    "author": "bitusher",
                                                                                    "score": 1,
                                                                                    "created_utc": 1652222522.0,
                                                                                    "response": ">  is the INITIAL cost.\n\nand I'm saying the exact opposite very clearly and provided you with 2 articles that explain the exact economics of why this is the case . \n\nThe locking up of capital for **ongoing** security called \"staking\" creates the ongoing cost called \"rent\" in economics \n\nplease read the links I provided",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i82e4gg",
                    "author": "1entreprenewer",
                    "score": 5,
                    "created_utc": 1652198850.0,
                    "response": "Nope. That’s the point. \n\nYou should probably watch this:\n\nBitcoin Explained - What's The Big Deal, Anyways?\nhttps://youtu.be/lM3vAM9sbsw",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i824ih5",
                    "author": "AutoModerator",
                    "score": 2,
                    "created_utc": 1652195074.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i85yx8x",
                    "author": "igadjeed",
                    "score": 2,
                    "created_utc": 1652263509.0,
                    "response": "> Taking over the dev team?\n\nBitcoin development is not monolithic. It is public, open to all participants\n\n> trillions of dollars\n\nAnd trillions more dollars just by selling some more bonds. But money power has already been proven to fail to influence Bitcoin. The money creeps only had enough power to develop a failed software fork (SegWit2X) and then their failure fallback was the worthless BCash fork. After wasting their hundreds of millions, their boardrooms echoed with the exclamation, \"If only I understood open source software development before wasting all that money\"\n\n> propaganda to influence people to not use bitcoin\n\nThis has been a constant feature of the public discussion of Bitcoin for several years. It's effective. People who are too lazy of stupid to learn about Bitcoin have a convenient list of propaganda excuses for remaining ignorant. Bitcoin is not affected\n\n> locking down the whole world for the flu levels of influence\n\nThis is a stupid analogy",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i824uvs",
                    "author": "Brettanomyces78",
                    "score": 2,
                    "created_utc": 1652195212.0,
                    "response": "Who is \"they?\"",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i837e3o",
                            "author": "putyograsseson",
                            "score": 1,
                            "created_utc": 1652210615.0,
                            "response": "the global oligarchy would be my guess",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i837tfj",
                                    "author": "Brettanomyces78",
                                    "score": 1,
                                    "created_utc": 1652210783.0,
                                    "response": "As in groups of powerful people?  Those groups are hardly organized and working collaboratively.\n\nMaybe the question could be rephrased to \"could some powerful entity undermine Bitcoin, and if so via what mechanisms?\"\n\nThat would allow for a discussion of attack vectors, both direct & indirect, regardless of who launches such attacks.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i82c4mz",
                    "author": "ZioTron",
                    "score": 2,
                    "created_utc": 1652198068.0,
                    "response": "I think the only viable way to do this is to buy out the miners or buy/produce enough ASICs to reach 51% Hash power of the net.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i852n4r",
                    "author": "sandee_eggo",
                    "score": 1,
                    "created_utc": 1652240082.0,
                    "response": "The US government doesn’t want to destroy crypto. The US is the largest crypto country. They know it’s a new industry, growing fast, and taxable.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i83na2a",
                    "author": "blaze1234",
                    "score": 0,
                    "created_utc": 1652216917.0,
                    "response": "All They need to do, is pass laws that cripple the companies that operate the fiat exchanges.\n\nIn effect you could only trade P2P with individuals.\n\nDepending on how many countries did that, BTC would exist, and operate just like the illegal drugs industry, but the value in fiat would collapse and forever grow much more slowly.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8bmsdr",
                    "author": "IkeTrian",
                    "score": 0,
                    "created_utc": 1652366087.0,
                    "response": "Why will you join FlurryFinance? With the numerous advantages that $FLURRY comes with such as the flexibility band and use oriented as your fund won't be locked-up. This is why you should choose FlurryFinance.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "umizpu",
            "title": "I'm building an easy solution to enable us, the BTC &crypto holders, to settle our expenses in the fiat system without an intermediary like banks in a few clicks. Thoughts?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/umizpu/im_building_an_easy_solution_to_enable_us_the_btc/",
            "author": "ccjasoncc",
            "created_utc": 1652190049.0,
            "score": 2,
            "num_comments": 24,
            "subreddit": "BitcoinBeginners",
            "selftext": "If you like this idea, what are your use cases?\n\nIf not, mind sharing your concerns with me?\n\nOr pros and cons?",
            "stickied": false,
            "comments": [
                {
                    "id": "i81sm86",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1652190050.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i81t1gd",
                    "author": "bitusher",
                    "score": 1,
                    "created_utc": 1652190240.0,
                    "response": "Does it use multisig and escrow deposits  like Bisq ?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i84yrwh",
                            "author": "ccjasoncc",
                            "score": 1,
                            "created_utc": 1652238131.0,
                            "response": "are multisig and escrow deposits important? \n\nI'm figuring out what will be part of the first phase of the product.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i85w4xz",
                                    "author": "bitusher",
                                    "score": 1,
                                    "created_utc": 1652261154.0,
                                    "response": "Of  course they are important. They prevent counterparty risk . Are you just going to be a centralized custodian controlling the money?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i822vnz",
                    "author": "sexyama",
                    "score": 1,
                    "created_utc": 1652194419.0,
                    "response": "to pay bills abroad it would be convenient, it exists for payment by card but not payment by bank wire",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i84ywdv",
                            "author": "ccjasoncc",
                            "score": 1,
                            "created_utc": 1652238190.0,
                            "response": "exactly. that's the core reason for building this solution! would love to learn about your use cases",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i85wun1",
                    "author": "igadjeed",
                    "score": 1,
                    "created_utc": 1652261786.0,
                    "response": "This is naive enough to be a beginner's question. What's the question?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8bnk0f",
                    "author": "IkeTrian",
                    "score": 1,
                    "created_utc": 1652366390.0,
                    "response": "With the stability of FlurryFinance, your funds do not fluctuate. Join $FLURRY today.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}