{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uu5ght",
            "title": "Investment Strategy: Buy Bitcoin and hedge with Coinbase puts",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uu5ght/investment_strategy_buy_bitcoin_and_hedge_with/",
            "author": "TonightSame",
            "created_utc": 1653074176.0,
            "score": 0,
            "num_comments": 1,
            "subreddit": "Bitcoin",
            "selftext": "Make the close date as far into the future as possible.\n\n\nIf both BTC and Coinbase tank just balance it so you break even.\n\nIf BTC goes up and Coinbase goes down due to being a terrible exchange, more buy and hold (which is not as profitable as people continuing to make rapid speculative trades), and/or a bunch of altcoins dying and taking volume with them.  YOU MAKE BANK.\n\nIf both BTC and Coinbase go up, you lose the option premiums, but hopefully you balance that out with BTC gains.\n\nIf BTC goes down and Coinbase goes up you're screwed, but that seems unlikely, no?\n\nThoughts?",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uu59qi",
            "title": "Bitcoin Ideas Anyone???",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uu59qi/bitcoin_ideas_anyone/",
            "author": "Maximum-Tart760",
            "created_utc": 1653073635.0,
            "score": 0,
            "num_comments": 8,
            "subreddit": "Bitcoin",
            "selftext": "I am a Bitcoin consultant, and with a worldwide number of people coming into this new crypto-currency phase, we the redditor's of today are the pioneers of what's to come in its evolution.  We can share ideas, create possibilities, develop concepts. I have such a concept by where one can recruit funds for a particular project. It's called '**1mBTC@aTime**', and works like this.  \n\nSay!,  You are called by a Charitable Society(Ex:Red Cross) and they want to accept crypto-currency at their next event or fundraiser.  They call on you, to fix a QR-code with a payment request of 1milliBitcoin(agreed amount by the customer) that is setup on a display of some sort.  Or you can be called on to setup an admission fee for a particular evening at some nice dance club.  A parking spot for rent to a concert show in your city.  The possibilities are endless!  \n\nObviously, 1mBTC for a parking or admission could be to much, but the amount requested is also variable to suite your customer's need.  You supply the displays, and/or the means, and collect a percentage of the amount generated.  **1mBTC@aTime** is more than just a payment request, it's a way of supporting any project, like a little crowdfunding.\n\nTake project ‘Off-Grid’ for instance.  An Off the Grid Home, deep in the woods.  With the advent of hyper-inflation, and the imminent fall of global economies, the dream of owning an Off Grid Home is just getting more and more out of reach.  Since, having a mortgage is not very Off Grid Like, one can use **1mBTC@aTime** to creating a funding address for donations.\n\n**1mBTC@aTime** can be your trademark to furnishing a fast growing population of Bitcoin users looking for a way to use their Bitcoins.  By promoting your services, you have an opportunity to make some bitcoin, in either a fixed amount, or as a percentage.\n\n**1mBTC@aTime** can reunite its users to share information, such as, events that might want to try this service.  Support with ideas as, how to furnish the necessary equipment for the task of ‘accepting or collecting’ Bitcoin funds, and what amounts are best suited for a particular event.   \n\n**1mBTC@aTime** can be in any language, say French... **1mBTC@laFois**\n\n**1mBTC@aTime** users can create, share, backdrops for slapping a QRcode on in publications,(weddings, airshows, conferences, etc.)  And so much more!\n\nJust set up a Key Pair and let the customer hold the private key.  Agree to either a fixed fee or a percentage settlement.  Generate a QRcode for the receiving wallet.  Take a ‘watch only’ view of the account on your smartphone.  BOOM, your setup!  Supply QRcodes signs where needed and/or train staff if you have to.  You know best what needs to be done to make it happen!  This would probably work better under Lightning Networks.  Damn, the future is coming fast.\n\nSo, what do you think of **1mBTC@aTime**\n\nIf you like. Leave it a thumbs up, or share me a comment below on how the **1mBTC@aTime** concept can work for you!  \n\n[Try it out, see how it works!](https://preview.redd.it/p07ssdaoio091.png?width=225&format=png&auto=webp&s=e672c79521f65839ae5e8d33ee3a90be3674e244)",
            "stickied": false,
            "comments": [
                {
                    "id": "i9d5okh",
                    "author": "NiceDoctorBeam",
                    "score": 11,
                    "created_utc": 1653074205.0,
                    "response": "> I am a Bitcoin consultant\n\nLOL.  Cut it out.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9d7irp",
                            "author": "Beta_Delta_Alpha",
                            "score": 2,
                            "created_utc": 1653075042.0,
                            "response": "Yeah this guy is very blockable",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9d90fi",
                                    "author": "NiceDoctorBeam",
                                    "score": 2,
                                    "created_utc": 1653075704.0,
                                    "response": "Suppose the United Nations call you.  They need your advice to save the world from thermonuclear war...",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9dbmce",
                    "author": "gdmfsobtc",
                    "score": 8,
                    "created_utc": 1653076862.0,
                    "response": "How do you do, fellow bitcoiners? I'm somewhat of a cryptos cosnsultant myself!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9dfa9h",
                    "author": "Keith_Kong",
                    "score": 2,
                    "created_utc": 1653078513.0,
                    "response": "Let's say you want to be financially independent, but working is required for money! Instead, use **1mBTC@aTime** to create a funding address for donations. Subsidize your life!\n\n/s",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9dt3fk",
                    "author": "code4578i",
                    "score": 1,
                    "created_utc": 1653084905.0,
                    "response": "You sponsor me some bitcoins, I will think about it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ezq49",
                    "author": "Anothercoin1",
                    "score": 1,
                    "created_utc": 1653107788.0,
                    "response": "Too long didnt read",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9fcqpd",
                    "author": "Thirdlegproduction",
                    "score": 1,
                    "created_utc": 1653117918.0,
                    "response": "Send me 1mBTC@aTime and I will send you 2mBTC@aTime",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uu5bku",
            "title": "Are people in Africa *actually* paying their everyday bills with Cryptocurrency?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uu5bku/are_people_in_africa_actually_paying_their/",
            "author": "Qzply76",
            "created_utc": 1653073776.0,
            "score": 5,
            "num_comments": 20,
            "subreddit": "Bitcoin",
            "selftext": "I understand that wiring money to banks in Africa is often super expensive, but are people in Africa paying bills with it? I see this claim, and I see articles online claiming this that are totally unsubstantiated. \n\nIs there any way for me to see that lots of people in Africa are paying their bills in cryptocurrency?",
            "stickied": false,
            "comments": [
                {
                    "id": "i9d9yc2",
                    "author": "Nada_Lives",
                    "score": 7,
                    "created_utc": 1653076116.0,
                    "response": "Lots of people? Check back in a year.\n\n[https://m.youtube.com/watch?v=arfDJStxwcc](https://m.youtube.com/watch?v=arfDJStxwcc)\n\nBTW, that's not *crypto*. That's Bitcoin!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9d56i1",
                    "author": "GruleNejoh",
                    "score": 6,
                    "created_utc": 1653073970.0,
                    "response": "Nobody in South Africa is paying any bills with crypto, can’t speak for the other 53 countries though.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9d6zvy",
                            "author": "Asum_chum",
                            "score": 4,
                            "created_utc": 1653074804.0,
                            "response": "Good you speak for over 59 million people though.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9dcjem",
                                    "author": "GruleNejoh",
                                    "score": 5,
                                    "created_utc": 1653077267.0,
                                    "response": "No major utilities in South Africa accept crypto, so all 59 million people can’t pay them with Bitcoin",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9dcqoh",
                                    "author": "GruleNejoh",
                                    "score": 5,
                                    "created_utc": 1653077358.0,
                                    "response": "Africa still prefers cash, corruption is easier with cash",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9dr56p",
                                            "author": "Few_Budget_2510",
                                            "score": 3,
                                            "created_utc": 1653083978.0,
                                            "response": "zing",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9d6nz6",
                    "author": "stoic_goat_",
                    "score": 2,
                    "created_utc": 1653074651.0,
                    "response": "I'm leaving for Malawi tomorrow for a week, I'll let you know what I see (but I doubt it).",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ek3c8",
                    "author": "Creative_Rub_9167",
                    "score": 2,
                    "created_utc": 1653098817.0,
                    "response": "I live and travel throughout East Africa and thats a negative sir, no large companies accept any form of crypto currencies at the moment.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9du6oe",
                    "author": "tronsom",
                    "score": 4,
                    "created_utc": 1653085429.0,
                    "response": "Let's be realistic, no one is paying for anything anywhere with crypto.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9eqiex",
                            "author": "Hectic-Mind",
                            "score": 2,
                            "created_utc": 1653102297.0,
                            "response": "Crypto runs the darknet.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9d643y",
                    "author": "Nervous_Appearance14",
                    "score": -4,
                    "created_utc": 1653074404.0,
                    "response": "It's bollox they are just trying to get you to buy before it goes too 8k 9k or so.. So you will be holding till 2024",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9dtuw4",
                            "author": "roliasedor",
                            "score": 3,
                            "created_utc": 1653085270.0,
                            "response": "If you can’t hold until 2024 you probably shouldn’t hold at all",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9e1u3o",
                                    "author": "Nervous_Appearance14",
                                    "score": 3,
                                    "created_utc": 1653089226.0,
                                    "response": "That's the next áth's just accumulate till then",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9e7kkp",
                    "author": "CapivaraMan",
                    "score": 1,
                    "created_utc": 1653092211.0,
                    "response": "We are still far from that, something like 5 to 10 years",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9eq4k5",
                    "author": "dogpeeves",
                    "score": 1,
                    "created_utc": 1653102087.0,
                    "response": "If anyone is curious goggle mpesa or similar. That's how folks in developing countries pay their bills not Crypto. Much as we want everyone, everywhere to use Crypto for everyday transactions its still very raptly on the game.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9flytr",
                            "author": "areola_ola",
                            "score": 1,
                            "created_utc": 1653126437.0,
                            "response": "Everyone must be missing out on the stellar blockchain.  The transaction fees are less than 1 cent per transaction.  Tokens on the stellar blockchain where you can purchase merchandise and pay shipping with crypto. Check out the biggest marketplace on the stellar blockchain 😎",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9femjx",
                    "author": "Killydor",
                    "score": 1,
                    "created_utc": 1653119615.0,
                    "response": "I think it’s mainly the flourishing ransomware industry",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9dw1nq",
                    "author": "talanhorne",
                    "score": 0,
                    "created_utc": 1653086338.0,
                    "response": "I think they mostly use it to bless the rains.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}