{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uwizbf",
            "title": "When all Bitcoin are mined?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uwizbf/when_all_bitcoin_are_mined/",
            "author": "lkopfer",
            "created_utc": 1653367873.0,
            "score": 0,
            "num_comments": 18,
            "subreddit": "Bitcoin",
            "selftext": "Just wondering what happens to miners once all bitcoins are mined? Iv done research because I’m curious what the incentive will be too process transactions for miners will be. All I have come up with is that their will be a transaction fee but no information on how much? How do they decide what a transaction fee will cost if no entity is in charge and how do they maintain the transaction fee at a rate which will still compensate the miners enough to continue mining/processing transactions? Also it should continue getting more expensive to process transactions as there are more blocks being added to each Bitcoin and as other electricity and other such costs rise for the miners.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9rusq6",
                    "author": "Girafferage",
                    "score": 1,
                    "created_utc": 1653368582.0,
                    "response": "They will still get fees for processing transactions. I suppose its an assumption Bitcoin will be worth enough that they will still want to run hardware for just the fee",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9rv216",
                            "author": "lkopfer",
                            "score": 1,
                            "created_utc": 1653368758.0,
                            "response": "But the value of Bitcoin will cap out and should theoretically stop/severely slow down in price increase where as energy almost certainly will continue skyrocketing in cost therefore it couldn’t possibly be worth it",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9rvkig",
                                    "author": "Girafferage",
                                    "score": 1,
                                    "created_utc": 1653369122.0,
                                    "response": "why does the value have to cap or slow down? Once we get close to having all Bitcoin mined it means there will never be any more and demand might increase if anything. Cost of energy should only increase with cost of living and value of currency, which Bitcoin would to assuming it survives for many years to come - which I believe it will.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9rvvdt",
                                            "author": "lkopfer",
                                            "score": 1,
                                            "created_utc": 1653369339.0,
                                            "response": "If it increases wouldn’t there be massive amounts of price increase meaning products are increasing as well?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9rw9yt",
                                                    "author": "Girafferage",
                                                    "score": 1,
                                                    "created_utc": 1653369631.0,
                                                    "response": "The price of bitcoin isn't tied to the value of another currency or item. Milk and bread dont need to increase in cost just because Bitcoin is worth more because people put value in it.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9rwiut",
                                                            "author": "lkopfer",
                                                            "score": 1,
                                                            "created_utc": 1653369808.0,
                                                            "response": "But it would that is how all currency has worked ever.  If there’s more of it which in this case there’s more value then it’s still increasing everything around it because everyone’s value is increasing. It’s the same thing as USD. If they print more money we have more of it therefore products also rose because people now have more currency to buy products and that increases demand driving prices up.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9rxamf",
                                                                    "author": "Girafferage",
                                                                    "score": 1,
                                                                    "created_utc": 1653370379.0,
                                                                    "response": "Oh, ok. I get what you are saying, but Bitcoin has a hard cap. Once it has all been mined, that's it, and we have known from the get go how much there will be, and the rate at which it is produced slows with each halving. No more can ever be created. USD is always increasing in amount which as you mentioned, lowers its true value with no end. \n\nSo yes, there is more Bitcoin being produced, but its better to think of it like how people are still mining gold. Its harder to mine because we have found all the easiest bits, and its rarity is a huge source of its value even as we get more globally each day.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9ruzq9",
                    "author": "SomeBrokeChump",
                    "score": 1,
                    "created_utc": 1653368714.0,
                    "response": "The incentive for Bitcoin miners to secure the Bitcoin network comes from block rewards and transaction fees. The block reward gets reduced by 50% every 210,000 blocks solved, which is approximately every 4 years. So over time the incentive for Bitcoin miners to secure the Bitcoin network transitions from block rewards to transaction fees. After all of the bitcoins have been mined, the Bitcoin miners will only be incentivized by transaction fees and Bitcoin will be completely inflation free.\n\nThe Bitcoin mining difficulty automatically adjusts every 2016 blocks which is approximately every two weeks. The mining difficulty automatically increases or decreases after 2016 blocks depending on the time between the previous 2016 blocks. If the time between those blocks averages out to less than ten minutes, then the mining difficulty will increase and miners will become less profitable. If the time between those blocks averages out to more than ten minutes, then the mining difficulty will decrease and miners will become more profitable. So if some Bitcoin miners stop mining bitcoin because it's no longer profitable for them, the mining difficulty will decrease and it will become more profitable to mine bitcoin.\n\nBlock space is limited. So Bitcoin users must bid on inclusion in the limited block space by way of transaction fees. Higher demand for block space = higher transaction fees.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9rvj8j",
                            "author": "lkopfer",
                            "score": 1,
                            "created_utc": 1653369096.0,
                            "response": "But if the mining decreases how do the transactions get processed?? Also won’t the transactions always get longer as there are more chain as more and more transactions happen in a Bitcoin?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9rwhmc",
                                    "author": "SomeBrokeChump",
                                    "score": 1,
                                    "created_utc": 1653369782.0,
                                    "response": "I explained it in my comment. The mining difficulty automatically adjusts every 2016 blocks so that the average time between blocks remains 10 minutes. \n\n>Also won’t the transactions always get longer as there are more chain as more and more transactions happen in a Bitcoin?\n\nTransactions get longer? No. That doesn't even make sense.\n\n>it should continue getting more expensive to process transactions as there are more blocks being added to each Bitcoin\n\nThat doesn't make sense either. \n\nYou have a poor understanding of how Bitcoin works. I recommend that you watch this 26 minute video to gain a better understanding of how Bitcoin works: https://www.youtube.com/watch?v=bBC-nXj3Ng4",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9rveys",
                    "author": "RossMacdonald",
                    "score": 1,
                    "created_utc": 1653369011.0,
                    "response": "2140. No chance we are using Bitcoin then.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9rvky8",
                            "author": "lkopfer",
                            "score": 1,
                            "created_utc": 1653369131.0,
                            "response": "Lol then why are we all on this thread 😂",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9rwxex",
                    "author": "GemStateStacker",
                    "score": 1,
                    "created_utc": 1653370108.0,
                    "response": "We’ll all be dead so it doesn’t matter.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9rtxhn",
                    "author": "ndgoLiberty",
                    "score": 1,
                    "created_utc": 1653367993.0,
                    "response": "I for one will be mining on my futuristic bitcoin miner rig even if I’m getting nothing. Actually I’ll be dead but you get the picture.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9rubwb",
                            "author": "lkopfer",
                            "score": 1,
                            "created_utc": 1653368269.0,
                            "response": "So your saying that all bitcoins will never be mined?\n\nEdit. I understand If u mean this is a problem for the future as in 2100ish but a currency with a essentially doomsday event doesn’t seem like institutions would ever be interested in it.\n\nEdit 2 lol I also think the estimate of a 100 or so years could be super off the because if Bitcoin does catch on as everyone in this thread Is believing it stands to reason that there will be a massive increase in transactions and mining speeding up the entire doomsday event(no more blocks for miners).",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9rusjp",
                                    "author": "ndgoLiberty",
                                    "score": 1,
                                    "created_utc": 1653368579.0,
                                    "response": "No they’ll all be mined.\n\nBut I’ll keep generating blocks. Even if it’s for free. Hoping to get a little more bitcoin from transaction fees alone.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9rwudq",
                    "author": "TrueAOT",
                    "score": 1,
                    "created_utc": 1653370045.0,
                    "response": "What makes you think the cost of energy will undoubtedly increase? Technological advances could make harnessing energy significantly cheaper.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9rx8hl",
                            "author": "lkopfer",
                            "score": 1,
                            "created_utc": 1653370335.0,
                            "response": "So your saying that theyr going to somehow solve the energy problem? Possible but the demand of energy is always going up soo yea energy costs will always go up unless they find an infinity energy source that would temporarily reduce energy costs but again energy demand always rises so even if they somehow figured out how to supply the demand the demand would likely just get even higher as sufficient energy supply would cause a massive leap in technology and demand would skyrocket. Again that’s mostly theoretical but based on the fact that energy demand always rises long term I would cut my left nut off if energy costs didn’t rise for the next 100 years.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        }
    ]
}