{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "urh93a",
            "title": "HTML Coding For Beginners - Understanding HTML Tags",
            "url": "https://www.stsanemusic.com.ng/html-coding-for-beginners-understanding-html-tags/",
            "author": "CategoryElectrical65",
            "created_utc": 1652773517.0,
            "score": 0,
            "num_comments": 1,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8x9hdc",
                    "author": "coinfeeds-bot",
                    "score": 1,
                    "created_utc": 1652776206.0,
                    "response": "tldr; Having a basic knowledge of HTML is necessary for anyone who wants to build, manage or improve websites, from professional developers to marketers and small-time business owners. To learn HTML, you will need to study the various tags and understand how they behave while formatting a textual document. HTML makes use of various tags to format the content and these tags are enclosed within angle braces.\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR.*",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "urhf6b",
            "title": "Now's the time to mention Bitcoin to your friends and family that wish they had bought it when it was cheaper",
            "url": "https://www.reddit.com/r/Bitcoin/comments/urhf6b/nows_the_time_to_mention_bitcoin_to_your_friends/",
            "author": "Luminous_Emission",
            "created_utc": 1652774301.0,
            "score": 64,
            "num_comments": 73,
            "subreddit": "Bitcoin",
            "selftext": "I've come across several people in my life that wished they had bought Bitcoin when it was $600. Those people are probably no longer paying attention to Bitcoin and assume they just missed the boat. Well the boat is coming around for a second pass and we're getting another chance to buy at 30k so everyone that missed the 30k boat last summer now has a second chance to scoop some up while the gettin's good. I've only been buying for 1 year, but I'm already SOOOOO glad I started buying a year ago so I can only imagine how people that have been buying for several years must feel. One conversation with someone you care about could be the one that inspires them to start their Bitcoin journey rather staying a victim to a broken system that's keeping them poor. The price is low. The time is now. Make whatever adjustments you need to in order to buy as much as you can. Get rid of Netflix, get rid of Disney Plus, don't buy those expensive shoes, don't buy those expensive jeans, stop eating fast food all the dang time, and STACK LIKE YOUR LIFE DEPENDS ON IT, THE TIME IS NOW TO TAKE ADVANTAGE OF THIS OPPORTUNITY, THE NEXT 30K ISN'T PROMISED.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8xg6g7",
                    "author": "SeanyBlaze",
                    "score": 28,
                    "created_utc": 1652782241.0,
                    "response": "Honsetly i think the best way is to just lead by example. I'll never tell someone where they should invest their money",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8xjbre",
                            "author": "Luminous_Emission",
                            "score": -4,
                            "created_utc": 1652784762.0,
                            "response": "My point is that if they were interested in it but thought it was too late to buy (and stopped keeping track of the price), you could mention that it's low again and maybe they'll buy. I guess I lot of people misunderstood the part where I said to mention it to people that were already interested in it that way you aren't shoving it down their throats.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8y9gbl",
                                    "author": "notmyrealnam3",
                                    "score": 9,
                                    "created_utc": 1652798627.0,
                                    "response": "They have access to the internet , why do they need you to tell them it is low? Seriously , please don’t do this , Bitcoin is better without hypemen and sales pitches",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8yxopv",
                                            "author": "OtherDetective",
                                            "score": 2,
                                            "created_utc": 1652808554.0,
                                            "response": "I agree. There is no excuse for not self starting. There is so much information out there.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i8z4ck1",
                                            "author": "JollyJury",
                                            "score": 2,
                                            "created_utc": 1652811237.0,
                                            "response": "Exactly. I like to point them in the right direction if they show interest but only if they bring it up first.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i8yynw3",
                                    "author": "jaumenuez",
                                    "score": 1,
                                    "created_utc": 1652808952.0,
                                    "response": "99% of them will never buy no matter what the price is, because that will need them to acknowledge they were stupid.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8xh0yf",
                    "author": "Thirdlegproduction",
                    "score": 50,
                    "created_utc": 1652782951.0,
                    "response": "Ahh you must be new to this.  \nWhat you think will happen where you and your friends achieve financial freedom an you'll go on luxury vacations together and everyone thinks you're cool for letting them in your money making ways.\n\nHere's what will happen...\n\n\\- People won't listen and will deeply hate you when the price moves up 10x.  \n\\- People will listen and then trade their btc for altcoins and lose most of it and they'll hate you.  \n\\- People will listen, hodl bitcoin and will credit their success to their own genius.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8y09vz",
                            "author": "Lagavulin",
                            "score": 17,
                            "created_utc": 1652794563.0,
                            "response": "- People will argue “why would I buy that crypto stuff when the price is collapsing?”\n- People will eagerly fomo in when bitcoin hits $100k",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8z2fmk",
                                    "author": "blackhat8287",
                                    "score": 5,
                                    "created_utc": 1652810453.0,
                                    "response": ">People will eagerly fomo in when bitcoin hits $100k\n\nEven worse is that they'll then blame you when it crashes from $100k to $80k even though you told them to buy it at $30k. That will validate their hypothesis that you were \"wrong all along\" lol...",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8ybi4l",
                            "author": "Film2021",
                            "score": 5,
                            "created_utc": 1652799481.0,
                            "response": "Exactly this.\n\nPeople take personal credit for their wins yet tend to blame others for their losses.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8xbhqf",
                    "author": "Llonga",
                    "score": 20,
                    "created_utc": 1652778058.0,
                    "response": "Yeah don’t do this. Let them do their own research. This approach is ‘culty’ and never ends well.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8y3ecj",
                    "author": "miamiair92",
                    "score": 7,
                    "created_utc": 1652796003.0,
                    "response": "I have been sharing Bitcoin telling people it’s on sale with people I care about , they seem skeptical but at least I tried",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8x7snp",
                    "author": "Lolfcklol",
                    "score": 34,
                    "created_utc": 1652774631.0,
                    "response": "This is the kind of behavior that gets people to hate bitcoin. If your friends/family actually studied bitcoin, they would realize they didnt miss the boat. We have to educate those that want to be educated, not tell them BUY BUY ITS ON SALE, thats how you get more paper hands",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8x83wd",
                            "author": "Luminous_Emission",
                            "score": -16,
                            "created_utc": 1652774919.0,
                            "response": "Well you mention it to people that were ALREADY interested in it AND THEN they study it AND THEN BUY IT. You don't even have to understand something 100% to take advantage of it. Most people don't fully understand all the small details about how electricity works and yet they use electricity for their convenience in their lives.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8x8bpb",
                                    "author": "Lolfcklol",
                                    "score": 8,
                                    "created_utc": 1652775124.0,
                                    "response": "Using something and being invested in something is different. I know how to use an iphone, but I dont own apple stock.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8ydofk",
                                            "author": "Rokey76",
                                            "score": 2,
                                            "created_utc": 1652800397.0,
                                            "response": "That's ok. I own Apple stock but can't figure out how to use an iPhone, so we cancel each other out.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i8xcr6q",
                                            "author": "Luminous_Emission",
                                            "score": -7,
                                            "created_utc": 1652779221.0,
                                            "response": "You can still take advantage of it if you know it's a good product that provides a benefit, that's what I meant.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8xtkz8",
                                                    "author": "elmersglue17",
                                                    "score": -2,
                                                    "created_utc": 1652791189.0,
                                                    "response": "Dude, you are so cringe. Can you like, not? Listen to yourself…",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i8y99oe",
                                    "author": "notmyrealnam3",
                                    "score": 0,
                                    "created_utc": 1652798549.0,
                                    "response": "Just ….don’t.   Please",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8ydqw4",
                    "author": "AchillesDKS",
                    "score": 6,
                    "created_utc": 1652800426.0,
                    "response": "No. Don't mention bitcoin to anybody close to you. They will inevitably get greedy, see the price drop a little bit, buy high sell low, and resent you for the rest of their lives for getting them in on that \"scam\".\n\n\nIt's not your job to educate people. Everyone gets bitcoin at the price they deserve it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8xdfru",
                    "author": "VirtuaFighter6",
                    "score": 7,
                    "created_utc": 1652779855.0,
                    "response": "Stack stack stack, 2025 is coming.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8z2qgl",
                            "author": "nitsua_saxet",
                            "score": 1,
                            "created_utc": 1652810574.0,
                            "response": "Do you believe interest rate fears are overblown? I am still uncertain about that.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8z4yso",
                                    "author": "VirtuaFighter6",
                                    "score": 1,
                                    "created_utc": 1652811493.0,
                                    "response": "No, because institutions are absolute greedy pricks, and when the Fed’s crank up the interest rate, they will cry and fucking whine, and start to sell off.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8y5ssg",
                    "author": "HeatSeekingPanther",
                    "score": 2,
                    "created_utc": 1652797062.0,
                    "response": "So many comments in here bashing you for recommending one pay attention to BTC at these prices. I’d rather you try and help others down the rabbit hole than to give up because of the challenges associated with it. This community needs to focus more on the right ways to go about this than just outright discouraging it because of what can go wrong. Proof-of-work not proof-of-its-too-hard-don’t-even-try.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8y7clh",
                    "author": "asHagg",
                    "score": 2,
                    "created_utc": 1652797730.0,
                    "response": "Still cheap",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8yfpea",
                    "author": "lil_groundbeef",
                    "score": 2,
                    "created_utc": 1652801243.0,
                    "response": "It’s 2022, if they wanted to hear about Bitcoin, they would tune in. Much of the western world will not buy in to Bitcoin for another ten or even twenty years, possibly ever.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8yj8cc",
                    "author": "ThotDoge69",
                    "score": 2,
                    "created_utc": 1652802700.0,
                    "response": "They always want to buy but can't stand the drops. It's easy saying that by seeing the price action over the years, it's a different story when you're living it. \n\nLet them do their own research.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8xkz6w",
                    "author": "sugarduck99",
                    "score": 1,
                    "created_utc": 1652785939.0,
                    "response": "Just shut up OP, you sound like a degen.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8xk68u",
                    "author": "Throwaway4VPN",
                    "score": 1,
                    "created_utc": 1652785381.0,
                    "response": "I like my Netflix and sometimes some expensive shoes?  \nI'm not going to lower my quality of life to stack sats...  \n\n\nInvest what you can afford to lose... also chill, this attitude is why so many people are against Bitcoin right now. Teach people if they are interested, or advise people to read about it if not. Don't go forcing ideas on people. This is not the gwei..",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8z7411",
                            "author": "Luminous_Emission",
                            "score": 2,
                            "created_utc": 1652812367.0,
                            "response": "I never said anything about forcing anything tho",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8xt4gd",
                    "author": "VPNApe",
                    "score": 1,
                    "created_utc": 1652790938.0,
                    "response": "Nah. They're mostly dead broke or raging liberals who want the govt to print even more money. They won't understand till $1000 buys a burger.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8xafs4",
                    "author": "Cakey44",
                    "score": 1,
                    "created_utc": 1652777095.0,
                    "response": "using/ buying an iphone is most certainly an investment \n\n“to have given a lot of time and effort to something and care about it very much”",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8xohz6",
                    "author": "Fizzifish",
                    "score": 1,
                    "created_utc": 1652788250.0,
                    "response": "Nvr do this. Especially to your loved ones. Especially If they cannot stomach the volatility and have no experience in investing. You are no different from the dumb influencers who shill their tokens. \n\nThis is one of the dumbest advice given. It doesn’t matter if they were interested. They will get Bitcoin at the price they deserve.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8z7g6g",
                            "author": "Luminous_Emission",
                            "score": 3,
                            "created_utc": 1652812502.0,
                            "response": "Yeah it's different cos I'm not an influencer shilling for anything. Reminding people that previously were interested but didn't pull the trigger that now might be a good time to reconsider is WAAAAAAAAAY different lol",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8yt5ox",
                    "author": "Gloomy_Tennis_5768",
                    "score": 1,
                    "created_utc": 1652806738.0,
                    "response": "Yeah, creepy salesman.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8zmkus",
                    "author": "hcollector",
                    "score": 1,
                    "created_utc": 1652818716.0,
                    "response": "I read these exact same posts at 60k, 50k, 40k, 30k. Do not tell your friends and family to buy crypto. Most will not be able to stomach the volatility and it's a great way to lose friends.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i901ivm",
                            "author": "Angustony",
                            "score": 1,
                            "created_utc": 1652825079.0,
                            "response": "Well I'm really glad one of my friends told me they were buying crypto, and gave me some good sounding reasons and a few pointers to get started.\n\nSubtly different to telling me to buy some I know, but I often see posts from people saying don't discuss it at all, which is just dumb. How's it supposed to grow without newbies hearing about it?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i90igy1",
                                    "author": "hcollector",
                                    "score": 1,
                                    "created_utc": 1652833086.0,
                                    "response": "I gain nothing from my friends making money, I only stand to lose them when their investment doesn't work out in the short term. \n\nNewbies aren't going to make bitcoin grow anymore at its current market cap, the only thing that will move the price is big institutional money and whales.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8xbs71",
                    "author": "hayseed_byte",
                    "score": 0,
                    "created_utc": 1652778320.0,
                    "response": "This is the start of crypto winter. I looking to buy btc at around $15k",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8xmnm9",
                            "author": "debanked",
                            "score": 2,
                            "created_utc": 1652787075.0,
                            "response": "Start selling it down",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8xt0dt",
                            "author": "ApplicationAny1434",
                            "score": 2,
                            "created_utc": 1652790878.0,
                            "response": "I told to everyone since may 2021 its bear time....now its 1.8 years till halving  ..means it will be priced in before the block reward get halved....say 6 month before.\n\nyou get around 1.2 years for a bearcycle plus complete bullmarket to new highs 100-200k",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8y9nr9",
                            "author": "notmyrealnam3",
                            "score": 2,
                            "created_utc": 1652798713.0,
                            "response": "Just know if it works it was luck.  Trying to time the market is a terrible idea.  Time and time again time in the market beats timing the market",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8xdkd1",
                            "author": "one_one12",
                            "score": 1,
                            "created_utc": 1652779969.0,
                            "response": "What makes you think it will fall to 15k?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8xwr59",
                                    "author": "hayseed_byte",
                                    "score": 1,
                                    "created_utc": 1652792830.0,
                                    "response": "If the support at 29-30k doesn't hold, the next closest support level on the monthly chart is like $14k. It might crab for a few months and keep bouncing between $30k and $40k. Then it'll break down and you'll stop seeing posts like this. This isn't the bottom. There are too many shitcoins. Bitcoin dominance will go up even as the price goes down because alts will bleed HARD against btc and the shitcoins will die off.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8xsn8h",
                                    "author": "SimpleRelative9038",
                                    "score": 1,
                                    "created_utc": 1652790678.0,
                                    "response": "what makes you think it wouldnt?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8xt87l",
                                            "author": "SouthTippBass",
                                            "score": 4,
                                            "created_utc": 1652790993.0,
                                            "response": "Well, historically, Bitcoin never drops below its previous bull runs ATH. So that would be $19k I think?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8xvv61",
                                                    "author": "hayseed_byte",
                                                    "score": 2,
                                                    "created_utc": 1652792385.0,
                                                    "response": "Bitcoin has only existed during the longest economic bull run in a long time. It hasn't existed during an economic downturn/recession.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8xwd5w",
                                                            "author": "SouthTippBass",
                                                            "score": 5,
                                                            "created_utc": 1652792637.0,
                                                            "response": "Heard the same story back in 2018. Nobody knows what's going to happen.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i8y80o1",
                                    "author": "puce_moment",
                                    "score": 0,
                                    "created_utc": 1652798018.0,
                                    "response": "Tether collapse and/or regulation.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8y4dzc",
                            "author": "HeatSeekingPanther",
                            "score": 1,
                            "created_utc": 1652796447.0,
                            "response": "How big is your short?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8yg8cu",
                    "author": "redditjam645",
                    "score": 0,
                    "created_utc": 1652801464.0,
                    "response": ">people that have been buying for several years must feel. One conversation with someone you care about could be the one that inspires them to start their Bitcoin journey rather staying a victim to a broken system that's keeping them poor. The price is low. The time is now.\n\n\n\nStop. Bitcoin will not make you rich. Even if the price doubles, your lifestyle will not change. Unless you're willing to gamble your life savings and turn $500K to a million. Turning $20K to $40K will not change your life. It will only put you in more stress while you see your $20K go up and down. Only invest what you're willing to lose. Anyone who comes up to you tells you to invest in something to \"stick it to the man\"  or calls you a \"victim of the system\" is not working in your best interest.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8yisqt",
                            "author": "Luminous_Emission",
                            "score": 1,
                            "created_utc": 1652802523.0,
                            "response": "So you don't think that most regular folks are buying Bitcoin for the potential financial gain or to get their money out of inflationary currency and put it into deflationary currency?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8ywjmz",
                                    "author": "redditjam645",
                                    "score": 0,
                                    "created_utc": 1652808102.0,
                                    "response": "Most regular folks don't understand bitcoin and you getting them to invest money in something they don't completely understand is predatory.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8xe51h",
                    "author": "piotrek211",
                    "score": -1,
                    "created_utc": 1652780483.0,
                    "response": "Oh yeah because there is no such a thing as a marketcap and btc can just grow and grow. Better wait for sub $10k.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8y4o3s",
                    "author": "L0ckeandDemosthenes",
                    "score": 1,
                    "created_utc": 1652796569.0,
                    "response": "No it's not. Dang noobs. Let people make their own minds up. Quick way to lose friends and anger family if they buy and it keeps dipping like it most likely will. Just worry about your own investing and let them do the same. No one cares when you lose they only care when you win and always act like they would have listened to you after the fact once you've won, truth is they won't believe you till it's too late for them.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8yiumb",
                    "author": "alien3d",
                    "score": 1,
                    "created_utc": 1652802545.0,
                    "response": "nope . Issue is our country and a lot of other country dont like this exchange bitcoin thing. Can we see atm everywhere  to get money out ? we know bitcoin long time ago but never invest cause why should we ?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8yviqg",
                    "author": "UncagedAngel19",
                    "score": 1,
                    "created_utc": 1652807693.0,
                    "response": "I’m 20 years old and my mom knew about Bitcoin but she thought it was a scam and now she regrets it a lot",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8yxv2b",
                    "author": "CaptainAntwat",
                    "score": 1,
                    "created_utc": 1652808624.0,
                    "response": "Not yet, the stock market is still wayyy over bloated",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8z0mth",
                    "author": "YvngDesmos",
                    "score": 1,
                    "created_utc": 1652809728.0,
                    "response": "My family categorically does not accept Bitcoin. They don't believe in money that can't be held in their hands.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8z2516",
                    "author": "blackhat8287",
                    "score": 1,
                    "created_utc": 1652810335.0,
                    "response": "The people who had to be convinced at $50k+ will not buy it at $30k. People are much more likely to pile in after it's gone up than when it's going down.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8zg9lu",
                    "author": "Significant_Sink4342",
                    "score": 1,
                    "created_utc": 1652816107.0,
                    "response": "I bet against crypto last year and cleared 7 figures with my wealth management hedge.  To each there own. \n\nTrust me if your just hearing about the “next thing” or “it’s time to buy” your already to late",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8zj395",
                    "author": "Ill_Doubt_2221",
                    "score": 1,
                    "created_utc": 1652817268.0,
                    "response": "Is it best to just DCA your way to one whole coin? Only issue is exchanges charge so much in fees in Europe anyway. I use Coinbase are there any recommendations for exchanges that charge reasonable fees for someone trying to DCA month to month or week to week?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8zo6ko",
                    "author": "masonpeter090",
                    "score": 1,
                    "created_utc": 1652819382.0,
                    "response": "I think now is the best time to advise them to start investing in BTC. I am currently buying it on Bitfinex and I am sure that soon the price will rise greatly.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8zrxgi",
                    "author": "Informal_Fishing5729",
                    "score": 1,
                    "created_utc": 1652820941.0,
                    "response": "What if Bitcoin dips even more?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i905uo4",
                    "author": "LordPrettyMax",
                    "score": 1,
                    "created_utc": 1652827048.0,
                    "response": "Ya they will buy Bitcoin and then it will capitulate by 50% and then they will freak out and sell but you will hold and then during next bull run they will be down 50% while you made money. Idk about you but that’s not a situation I wanna be in",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i90irl3",
                    "author": "MiguelLancaster",
                    "score": 1,
                    "created_utc": 1652833223.0,
                    "response": "downvoted for terrible formatting",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8x9jjj",
                    "author": "ThatL1ttleGuy",
                    "score": 0,
                    "created_utc": 1652776262.0,
                    "response": "I don't push it on my loved ones. I have mentioned it a few times and tried to explain it to them in basic terms.. I bring it up every now and then and if they seem interested I try to inform them more of what it is and will be and say look into it. In the end it's up to them.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8xqehy",
                    "author": "kytheon",
                    "score": 0,
                    "created_utc": 1652789400.0,
                    "response": "Watch them not take your advice until we’re back at 50, crash back to 30 and then panic sell. And you lose friends/family. Source: I did this with my friends in 2017/2018",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}