{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ur609y",
            "title": "Are we still waiting or has the bottom been confirmed?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/ur609y/are_we_still_waiting_or_has_the_bottom_been/",
            "author": "AvisPhlox",
            "created_utc": 1652734986.0,
            "score": 5,
            "num_comments": 31,
            "subreddit": "Bitcoin",
            "selftext": "I'm new to this but I've been educating myself more and more each day. I'm ready to buy but I was told to wait for the bottom to be confirmed.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8va1f7",
                    "author": "Bkokane",
                    "score": 37,
                    "created_utc": 1652735149.0,
                    "response": "Yeah we’re all just waiting until they announce the bottom is confirmed. Then there’s no way it can go any lower and we can all buy at the cheapest price.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8va3l0",
                            "author": "Silver13Foxx",
                            "score": 4,
                            "created_utc": 1652735175.0,
                            "response": "well said",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8vdsz6",
                            "author": "Evvoli",
                            "score": 2,
                            "created_utc": 1652736753.0,
                            "response": "You need to /s or ppl don't know if it's sarcasm.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8veapf",
                                    "author": "Bkokane",
                                    "score": 14,
                                    "created_utc": 1652736967.0,
                                    "response": "It’s not sarcasm. Only an *idiot* would buy before the official announcement from Bitcoin that the price has reached it’s lowest point.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8vehmj",
                                            "author": "FanInternational9315",
                                            "score": 4,
                                            "created_utc": 1652737048.0,
                                            "response": "He literally said he was new, give him a break",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8vg9z1",
                                                    "author": "Evvoli",
                                                    "score": 1,
                                                    "created_utc": 1652737822.0,
                                                    "response": "Yea, don't ruin his first time when the CEO of bitcoin makes the announcement.\n\n/s",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8vmgxr",
                                                            "author": "FanInternational9315",
                                                            "score": 1,
                                                            "created_utc": 1652740588.0,
                                                            "response": "This is the kind of attitude that makes everyone invested in cryptocurrencies look like they’re douchebags",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i8vjqm7",
                                    "author": "Silver13Foxx",
                                    "score": 1,
                                    "created_utc": 1652739354.0,
                                    "response": "😂😂",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8vctd3",
                    "author": "VariousTransition795",
                    "score": 8,
                    "created_utc": 1652736329.0,
                    "response": "Bottom confirmed in 2009.\n\nNow it is up YoY",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8va537",
                    "author": "NiceDoctorBeam",
                    "score": 5,
                    "created_utc": 1652735192.0,
                    "response": "I never started trying to time the market.  \n\nTiming the market is gambling.  \nGambling with any expectation of coming out ahead is foolish.  \nFools and their money are soon parted.  \n\nInstead, invest, long term.  \nBuy Bitcoin.  \nSend it to your own (hardware) wallet.  \nWait.  Be patient.  Be brave.  \nConsider using DCA (dollar cost averaging).  \nThink and act long term.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8va3u8",
                    "author": "Antique_Mission_8834",
                    "score": 2,
                    "created_utc": 1652735178.0,
                    "response": "Lol nobody can confirm the bottom. Seems as good a time as any to buy in to me 🤷‍♂️ buy little at a time if nervous",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8vhpar",
                    "author": "account4cryptopostin",
                    "score": 1,
                    "created_utc": 1652738447.0,
                    "response": "Will the Bitcoin CEO be confirming the bottom?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8vi9jb",
                    "author": "Dkoot",
                    "score": 1,
                    "created_utc": 1652738692.0,
                    "response": "The only thing confirmed are blocks every 10 minutes.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8vlfnt",
                    "author": "bluetuxedo22",
                    "score": 1,
                    "created_utc": 1652740113.0,
                    "response": "The market bottom can only be seen in hindsight",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8vb1sa",
                    "author": "Boe_Ning",
                    "score": -5,
                    "created_utc": 1652735576.0,
                    "response": "retarded",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8vkxen",
                            "author": "Vinnypaperhands",
                            "score": 1,
                            "created_utc": 1652739882.0,
                            "response": "Let's try to be a little nicer to newcomers. It's not easy grasping the concept of Bitcoin and the network. We were all retarded trying to understand this complicated market in the beggining lol",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8vbua0",
                    "author": "Smokentoken4750",
                    "score": 1,
                    "created_utc": 1652735914.0,
                    "response": "You will know when the bottom is when we get back to ath.\nGo By the halving time cycles and the high. Take average of 86% drops off the high of $69,000\nShould be about 10,400.00-15k still few months  away ima. Hope and pray for some great catalyst to make us not go any lower from here.\nAccumulating all I can anyway at this level.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8vcf9i",
                            "author": "Potatotornado20",
                            "score": 2,
                            "created_utc": 1652736161.0,
                            "response": "Entire stablecoin market unraveling would get bitcoin to $15k quick. And holders would be fleeing to dollars, not bitcoin, cos they want safety and are ignorant or don’t care about long term inflation.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8vc9c5",
                    "author": "Enkaybee",
                    "score": 1,
                    "created_utc": 1652736091.0,
                    "response": "I'm waiting. *We* aren't doing anything.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8vf9q8",
                    "author": "voltsmeter",
                    "score": 1,
                    "created_utc": 1652737383.0,
                    "response": "Your best bet is to DCA daily. If not daily, then weekly. Don't try to catch a falling knife by attempting to time the market. The bottom is $0.00 There really isn't a \"bottom\".",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8vhvt8",
                    "author": "customtoggle",
                    "score": 1,
                    "created_utc": 1652738524.0,
                    "response": "Ignore anything that \"predicts\" the future or upcoming trends. Nobody knows what will happen next, not even the guy who's drawn the ascending wedge pattern on his triple dipped Fibonacci spiral of golden crosses\n\nI wasted a lot of time watching videos and reading about all that crap when I was new, then I realised it's no more useful than horoscopes",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8vi94s",
                    "author": "shawnewoods",
                    "score": 1,
                    "created_utc": 1652738687.0,
                    "response": "there is no waiting homie you DCA and HODL.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8vimuv",
                    "author": "Toiletpaperpanic2020",
                    "score": 1,
                    "created_utc": 1652738857.0,
                    "response": "Purely speculative, but I think big money will give crypto another pump and dump (possibly more) to refuel liquidity needs during the crash.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8vjx7c",
                    "author": "ThotDoge69",
                    "score": 1,
                    "created_utc": 1652739436.0,
                    "response": "No one can time the market. What you know now is already priced into the market. Market is in a downtrend right now, and it could go lower based on if reality is worst than expectation. Just DCA and forget about it for years, Bitcoin is so volatile that you will be glad splitting your buys in the end, because it could drop another 50% from here, or not. Since you don't know which way it will go, why would you pick a side ?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8vkm96",
                    "author": "Neinfu",
                    "score": 1,
                    "created_utc": 1652739742.0,
                    "response": "Just DCA",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8vkmi8",
                    "author": "Vinnypaperhands",
                    "score": 1,
                    "created_utc": 1652739745.0,
                    "response": "Another lesson to be learned. No one has any idea where the bottom is. If you know what you are buying and have conviction and a long term view. Typically times of extreme fear are good opportunities to get into the market.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8vkph1",
                    "author": "freedomrider21",
                    "score": 1,
                    "created_utc": 1652739784.0,
                    "response": "I can confirm that I am waiting for confirmation.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8vl9gd",
                    "author": "Geoknysis",
                    "score": 1,
                    "created_utc": 1652740035.0,
                    "response": "Always a double tap in bottom discovery.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8vmddy",
                    "author": "Satoshiman256",
                    "score": 1,
                    "created_utc": 1652740543.0,
                    "response": "Normally it gets announced over at r/confirmedbottom But I haven't seen anything mention there yesterday or today.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8vi8z8",
                    "author": "MarcDarcy",
                    "score": 1,
                    "created_utc": 1652738685.0,
                    "response": "Elon Musk will tweet to announce when the bottom has been reached!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8vj9mv",
                    "author": "Nervous_Appearance14",
                    "score": 1,
                    "created_utc": 1652739143.0,
                    "response": "9k ish",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ur64qy",
            "title": "How is it that Antiwork crowd can see the problems with being paid in a inflation currency, but can't see the benefits of saving and earning a deflation currency?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/ur64qy/how_is_it_that_antiwork_crowd_can_see_the/",
            "author": "hyperinflationUSA",
            "created_utc": 1652735323.0,
            "score": 164,
            "num_comments": 216,
            "subreddit": "Bitcoin",
            "selftext": "First they wanted $15 dollars an hour and now that they get it they want $25 dollars an hour. Once they get that they will want $35 dollars per hour. The cost of living goes up with the wages. The grocery store/landlord/etc heard minimum wage went up and said ok they got more money we can raise prices even more. Keep chasing the carrot, keep swimming up hill with fiat currency. Bitcoiners float downstream and the carrot walks towards us.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8vqd5g",
                    "author": "dfunkmedia",
                    "score": 132,
                    "created_utc": 1652742401.0,
                    "response": "Wages in general but especially minimum wage doesn't cause inflation. Inflation of a dollar from 2000 until today is over 70% but wages nationally at the bottom 20th percentile is only up 5%- and that's not inflation adjusted, that's gross dollars. The total share of money supply in the hands of the bottom 80% of America (yes the bottom 80%) is less than a third of the top 20%- which incidentally has grown guess how much- 180%. Think that's a coincidence? That the people moving 75% of the money supply have grown 180% while the dollar grew 170% and everyone else's cut stayed the same in gross (and therefore went down in aggregate)? \"It's a big club- and you ain't in it\" - cynical comedy man.\n\nBitcoin was created specifically because of the problem they ineloquently and tangentially ramble about. They might miss the mark but they're kinda looking at the target- wealth generation in this country is a debt machine powered by access to a trillion dollar printing press you'll never see a dime from. Money is minted off debt, wealth is minted off debt. Debt is tax free and spends the same as your hard earned dollar (which these days is $0.90 if you save it for a year). Boss makes a dollar, you lose a dime. Your grandparents minimum wage of $0.25 an hour was 2 gold eagles a month. Wanna guess what that is today? 'bout $40 grand. How can you blame them for being pissed off that they're taking home 1/3 what the dumbest laziest asshole did in 1933 for the same 40 hours a week? I mean, were talking a minimum wage of $20/hr if we had sound money that wasn't leveraged to the tits by suits who _knowingly_ tank the economy, hoard wealth, get the government to print them out of debt, and rinse/repeat while you can't buy fucking baby formula and the government sends $200 billion a year overseas just because it can? Every dollar printed hurts them just as bad.\n\nWe're all mad at the same thing. Our forefathers struggled and died so we'd have better lives and our lives are _objectively worse_. Our jobs don't pay shit, our healthcare system is a joke not just in pricing but in actual outcomes, we can't afford houses, we can't afford kids, we increasingly can't even save or invest our way out because inflation and boom/bust cycles implode any gains we make, and it's all getting worse because the whole system is rigged _and we can all see it clear as day_. The whole situation is politicized for a reason. The longer everyone blames the antiwork crowd or the Bitcoin crowd or the frog meme crowd or the colored hair crowd or whoever, the longer the actual fucking menace to society can make the printers go brrrrr.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8w2htb",
                            "author": "Interesting_Spare528",
                            "score": 36,
                            "created_utc": 1652748411.0,
                            "response": "He's not wrong. If the poor are busy fighting each other they'll never see it coming.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8wciyx",
                                    "author": "Just_Another_AI",
                                    "score": 4,
                                    "created_utc": 1652753438.0,
                                    "response": "Always has been",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8w206p",
                            "author": "IntroductionReal1970",
                            "score": 13,
                            "created_utc": 1652748166.0,
                            "response": "Thank you ! That is a perfect answer 👌",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8wk5i4",
                            "author": "According_Ad5882",
                            "score": 5,
                            "created_utc": 1652757445.0,
                            "response": "*George Carlin*",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8woluj",
                            "author": "WorriedExpat123",
                            "score": 2,
                            "created_utc": 1652760046.0,
                            "response": "Perfect comment.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8we0q0",
                            "author": "Twentyamf28",
                            "score": 3,
                            "created_utc": 1652754190.0,
                            "response": "Congress has a spending problem.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8wyn9u",
                            "author": "Uberhipster",
                            "score": 1,
                            "created_utc": 1652766885.0,
                            "response": ">minimum wage of $0.25 an hour was 2 gold eagles a month. Wanna guess what that is today? 'bout $40 grand\n\nwhoa slow down there timmy \n\n2 gold eagles is 2 oz gold at $2k / oz = $4k \n\nyou're off by an order of magnitude there",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8vq3ky",
                    "author": "Thatonebagel",
                    "score": 59,
                    "created_utc": 1652742277.0,
                    "response": "Federal minimum wage is still $7.25/hr brother. On top of that, wages are not rising in correlation to inflation unless you are on the way higher end of the earning scale. Furthermore, this sort of smug “keep chasing the carrot” type shit is why crypto gets shit on everywhere else on Reddit. The fact the labor movement and the crypto movement seem to be at odds with each other honestly confuses the fuck out me. Both want to go against the oligarchs and the systems they’ve built to keep us from the fruits of our labor, yet all the pro labor subs I’m in have been having a field day with the recent crash. And here we are talking down on them wondering “why do they want to get paid in fiat instead of BTC” while they watched BTC lose 50% its value YTD and fiats only lost about 8% YTD. This feels about as tone deaf as a Do Kwon tweet.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8w734h",
                            "author": "Cygnus_X",
                            "score": 2,
                            "created_utc": 1652750706.0,
                            "response": "Btc may have lost 50% this year, but it's had years of tremendous growth.  The dollar, by contrast, loses 2% to 8 % A year every year.  There may be tone deafness in the short term, but there is most certainly more tone deafness in the long term.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8w0cxd",
                            "author": "recessiontime",
                            "score": 2,
                            "created_utc": 1652747342.0,
                            "response": "Their ideology conflicts with bitcoin. In their mind only the government can give them the things they need and want. They can influence or revolt against a centralized government but it is impossible to control bitcoin - this is why they do not like Bitcoin and why this is not an appealing alternative to the fiat banking system for them",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8w79nd",
                                    "author": "SHA256dynasty",
                                    "score": 4,
                                    "created_utc": 1652750797.0,
                                    "response": ">Their ideology conflicts with bitcoin.\n\nBitcoin is about fair rules, not equality. Personal responsibility is key to bitcoin ethos (NYKNYC).\n\nAntiwork people are generally socialist, they WANT powerful government and wealth redistribution, just in a \"fair\" way (FROM the rich TO them). They are the losers of the current system and want to flip the pyramid so they are the winners.\n\nI spend a lot of time on the workreform sub because fuck the man but at least half of them really are a hopeless bunch who just wants to be taken care of by big govt.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8w7snr",
                                    "author": "frog_tree",
                                    "score": 0,
                                    "created_utc": 1652751065.0,
                                    "response": "bitcoin, stocks, FIRE, etc are all antiwork movements, we're just trying to do it in reality.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8w8by5",
                                            "author": "Trenchapo",
                                            "score": 4,
                                            "created_utc": 1652751334.0,
                                            "response": "But different people tho, we are ambitious, stocks bros are ambitious too. Anti work crowd have no motivation whatsoever. I get it no one wants to work but at least we are doing something besides complain about how unfair the world is",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i8wxuiz",
                                            "author": "bubumamajuju",
                                            "score": 1,
                                            "created_utc": 1652766285.0,
                                            "response": "All of those communities require working for capital to acquire capital generating assets. They’re all chasing a “means to an end” within capitalism…. Whereas antiwork is anti-capitalist.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8wjerr",
                            "author": "BuyRackTurk",
                            "score": -2,
                            "created_utc": 1652757030.0,
                            "response": "> type shit is why crypto gets shit on everywhere else on Reddit.\n\nfuck crypto, we arent about that shit. This is a bitcoin sub.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8vwmjd",
                    "author": "gods_loop_hole",
                    "score": 27,
                    "created_utc": 1652745469.0,
                    "response": "Objectively, the goal of antiwork and bitcoin is one and the same: freedom from uncertainty brought about by the controlling few. Therefore, instead of being antagonistic, we should educate each other for the bettterment of our conditions.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8wxpac",
                            "author": "InterPool_sbn",
                            "score": 1,
                            "created_utc": 1652766174.0,
                            "response": "I’ve felt for years now that socialists are often actually right about identifying most of the problems — including many that Republicans are in denial about — but the socialists nonetheless get their proposed solutions entirely backwards",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8wy06i",
                                    "author": "Random_Ad",
                                    "score": 1,
                                    "created_utc": 1652766403.0,
                                    "response": "Guess you don’t understand what and how socialism works.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8wyvhs",
                                            "author": "LasGio_",
                                            "score": 1,
                                            "created_utc": 1652767060.0,
                                            "response": "Gonna cry",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8vo0hx",
                    "author": "silverfire626",
                    "score": 32,
                    "created_utc": 1652741303.0,
                    "response": "“Only invest what you can afford to lose”",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8w3qjd",
                            "author": "theplushpairing",
                            "score": 4,
                            "created_utc": 1652749033.0,
                            "response": "Bitcoin down 50%, fiat down 12%. Pick your battles.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8we702",
                                    "author": "MiguelLancaster",
                                    "score": 8,
                                    "created_utc": 1652754278.0,
                                    "response": "a weekly purchase of bitcoin over the last year is down 6% -- inflation over the last year is 8.3%\n\nbitcoin beat inflation and a savings account over the last year\n\na weekly purchase of bitcoin over the last two years is up 75%\n\nover the last 3 years, 180%\n\nover the last 4, 313%\n\nwww.dcabtc.com\n\nwhy weekly purchase vs. lump sum, you say? well, you get paid in fiat weekly, no?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8wk9er",
                                            "author": "No-Taro-3952",
                                            "score": 5,
                                            "created_utc": 1652757506.0,
                                            "response": "If a weekly purchase over the last year puts you down 6% and inflation was 8.3% then the real return would actually be -14.3% no?",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i8wgclc",
                                    "author": "BobKurlan",
                                    "score": 2,
                                    "created_utc": 1652755387.0,
                                    "response": "High time preference.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8wod5x",
                                            "author": "theplushpairing",
                                            "score": 1,
                                            "created_utc": 1652759900.0,
                                            "response": "If you’re not making that much you sorta have to be",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8wqv0i",
                                                    "author": "BobKurlan",
                                                    "score": 1,
                                                    "created_utc": 1652761465.0,
                                                    "response": "No you don't. \n\nYou need to control your costs. I've been poor. I learned to cook and enjoy rice, beans and potatoes.\n\nreddit is such a cesspool that people really believe they have no control over their lives.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i8w420h",
                                    "author": "Infamous_Bus1578",
                                    "score": 6,
                                    "created_utc": 1652749194.0,
                                    "response": "How about since 2016? Or 2018? Or 2019? Or March 2020?",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8w5ot8",
                                    "author": "Defiant_Increase_191",
                                    "score": 3,
                                    "created_utc": 1652750007.0,
                                    "response": "In the last 100 years the dollar has lost about 90% of its value. Don’t believe it look it up yourself. Also, about 40% of circulating supply was printed in the past 2 years.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8w5vev",
                                            "author": "TheAnalogKoala",
                                            "score": 4,
                                            "created_utc": 1652750100.0,
                                            "response": "Who invests or hodls the US dollar? It’s a medium of exchange. Like Bitcoin used to be.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8wb6du",
                                                    "author": "infopocalypse",
                                                    "score": 4,
                                                    "created_utc": 1652752766.0,
                                                    "response": "People have savings accounts and typically try to keep their checking over a certain amount. It may be small amounts but the % loss still matter because you can't afford to lose as much. They aren't investing it but they hold it. The rich avoid inflation by holding assets but most people's wealth is all they have in the bank.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i8w8zf8",
                                                    "author": "Infamous_Bus1578",
                                                    "score": 0,
                                                    "created_utc": 1652751662.0,
                                                    "response": "Plenty of people hold it, and plenty of people try to survive on it.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8wb9ze",
                                                            "author": "TheAnalogKoala",
                                                            "score": 5,
                                                            "created_utc": 1652752816.0,
                                                            "response": "If you’re paycheck to paycheck the purchasing power isn’t eating your cash because you don’t have it. \n\nIf you’re not, you typically have the money in real estate (most folks main investment) or mutual funds, which are inflation hedges.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8wjukl",
                                                                    "author": "Infamous_Bus1578",
                                                                    "score": 1,
                                                                    "created_utc": 1652757277.0,
                                                                    "response": "Nice, you addressed a point I wasn’t making. I didn’t say inflation was eating their cash reserves (obviously). I’m saying that inflation impacts their ability to cover their expenses, given that they’re already pay cheque to pay cheque.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i8wh6td",
                                    "author": "StiltonG",
                                    "score": 1,
                                    "created_utc": 1652755836.0,
                                    "response": ">Bitcoin down 50%, fiat down 12%. Pick your battles.\n\nNow try doing that over 3 years, 5 years, 10 years, ie. any other time frame since Bitcoin existed.  \n\nAbout the only way to lose with Bitcoin is to FOMO in all at once at (or near) the market peak and then panic-sell in the middle of a major market correction.  Accumulating and holding over time has been a winning strategy for most people who hold Bitcoin.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8w45of",
                                    "author": "TheAnalogKoala",
                                    "score": 0,
                                    "created_utc": 1652749241.0,
                                    "response": "Bitcoin’s down over 60% in terms of purchasing power.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8w4x49",
                                            "author": "_CypherIO",
                                            "score": 3,
                                            "created_utc": 1652749619.0,
                                            "response": "You need to zoom out to see the big picture. \n\nIf you bought near the top of latest ATH, yes it is.\n\nNow if you bought anywhere from his creation to a few years ago, you have at the very least double your purchasing power.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8wa2w4",
                                                    "author": "silverfire626",
                                                    "score": 5,
                                                    "created_utc": 1652752213.0,
                                                    "response": "If your on minimum wage chances are you don’t have the capability to lose 25-50%of your purchasing power in a  week (potentially).\n\nThese are the people that get fucked and sell at the bottom. Unexpected bills can appear (car, home repair, medical, etc). \n\nYou need to have an emergency fund before you even consider crypto",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8wfb8n",
                                                            "author": "_CypherIO",
                                                            "score": 0,
                                                            "created_utc": 1652754852.0,
                                                            "response": "That's pretty much basic common sense and I mostly agreed with what you said but how this as anything to do with my comment?\n\nSecondly, your point doesn't make my last comment false in any way and not everyone is on a minimum wage by the way. \n\n> before you even consider crypto\n\nI never talked about 'crypto'. What I said was about Bitcoin. Altcoins are a totally different thing.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i8w59jg",
                                                    "author": "TheAnalogKoala",
                                                    "score": 3,
                                                    "created_utc": 1652749793.0,
                                                    "response": "That’s speculative gains, not inflation hedging. Bitcoin isn’t an inflation hedge and won’t be for decades. Claiming it is (or a store of value) just turns people off. \n\nStores of value don’t double their purchasing power in a month, nor do they lose over half of it in six months. \n\nUnsustainable claims are counterproductive.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i8wgcg6",
                                    "author": "dd2488",
                                    "score": 1,
                                    "created_utc": 1652755385.0,
                                    "response": "See below.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8vsif1",
                    "author": "TheOT1001",
                    "score": 6,
                    "created_utc": 1652743440.0,
                    "response": "Anti work should be synonymous with anti bank/ anti central banks - but they cant make the connection yet. Although the idea of bitcoin is (VERY) slowly becoming palatable (as in theres less hate whenever its mentioned now)\n\nIt's infuriating because they all argue about sticking it to the man all have some sense of libertarian idealism with regards to work, but dont make the connect between economic libertarianism. They're so close!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8vxapz",
                    "author": "Mothy187",
                    "score": 42,
                    "created_utc": 1652745804.0,
                    "response": "You're blaming the wrong people dude. Before dropping a hot take maybe bone up on some financial literature first and look into how the federal government, hedgefunds, banks, and other ruling agencies have DIRECTLY caused inflation by over-leveraging their assets. \n\nShitting on people who are trying to survive this economically oppressive era for wanting a living wage and then blaming them for asking for something as basic and enough money to eat and pay rent over looks the root cause of this inflation and is concerningly dismissive to the very rampant and wealth inequality that's oppressing the majority of citizens.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8w11bv",
                            "author": "coredweller1785",
                            "score": 5,
                            "created_utc": 1652747685.0,
                            "response": "Nailed it.\n\nThe problem is that \"inflation \" right now is just corporations raising prices bc of their market power and monopolization.\n\nYou can't have record profits and record stock buybacks and blame raising prices on labor costs it's just not possible.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8w2mah",
                                    "author": "mtb312000",
                                    "score": -5,
                                    "created_utc": 1652748472.0,
                                    "response": "Profit levels are not adjusted for inflation, so of course they are the highest ever.  Corporations have to compete for customer loyalty so your price gauging comment is a little over generalized",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8w338w",
                                            "author": "coredweller1785",
                                            "score": 4,
                                            "created_utc": 1652748706.0,
                                            "response": "Sure cool not adjusted for inflation but ur conveniently ignoring the point. \n\n\"In other words, had corporate America kept the same average annual level of profits in 2021 as it did from 2012-2019 and passed on today’s excess to consumers, the inflation rate would be 3.8%, not 6.8%. And that’s a big difference, indeed it is the difference between Americans getting a raise, and seeing real wages decline.\" \n\nhttps://mattstoller.substack.com/p/corporate-profits-drive-60-of-inflation?s=r\n\nThe effect and detriment is the same.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8w5mqh",
                                                    "author": "mtb312000",
                                                    "score": 0,
                                                    "created_utc": 1652749977.0,
                                                    "response": "Sounds like you are saying businesses are responsible for inflation.  So how would that explain housing prices?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8w5s2s",
                                                            "author": "coredweller1785",
                                                            "score": 4,
                                                            "created_utc": 1652750054.0,
                                                            "response": "Buying up houses. Have you really not been watching that? One of the best examples. \n\nhttps://www.axios.com/2022/02/18/investors-homes-wealth-families\n\nEdit to add quote. \n\n\"Worth noting: Investors are an especially heavy presence in markets that have seen some of the highest price spikes in the country.\n\nIn Las Vegas and Phoenix, where prices are were up 28% and 25% last year, investors bought roughly 30% of the houses sold in the fourth quarter, Redfin found.\n\n\"",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i8wjn2i",
                                    "author": "BuyRackTurk",
                                    "score": -1,
                                    "created_utc": 1652757159.0,
                                    "response": "> The problem is that \"inflation \" right now is just corporations raising prices\n\nStop babbling nonsense. \n\n*“Inflation is always and everywhere a monetary phenomenon.” -- Milton Friedman*",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8wobfa",
                                            "author": "coredweller1785",
                                            "score": 1,
                                            "created_utc": 1652759870.0,
                                            "response": "Milton Friedman is a joke. I would read How China Escaped Shock Therapy and just read how the Chinese laugh at the elementary level of understanding Friedman has of economics. The Chinese had so many scholars who did in depth reports and commissioned research of every kind. Milton Friedman brought in by the world Bank just lies about the \"Erhard miracle\" and spews the most basic bs about suppressed inflation the Chinese nearly laugh him out.\n\nMonopolies cause inflation, market concentration causes inflation.  Great podcast on it \n\nhttps://listen.stitcher.com/yvap/?af_dp=stitcher://episode/203155240&af_web_dp=https://www.stitcher.com/episode/203155240&deep_link_value=stitcher://episode/203155240\n\n\nAnd one final point is you clearly did not read thr article above as it is very clear in its calculations.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8w0tdq",
                            "author": "TheChoosey1",
                            "score": -4,
                            "created_utc": 1652747575.0,
                            "response": "You don't get it. \n\nA single mention of Bitcoin gets your post removed or heavily downvoted in:\n\nr/povertyfinance r/antiwork r/economics etc. \n\nWe need to directly message the moderators of those subs and orange pill them.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8w9v7x",
                                    "author": "mikebailey",
                                    "score": 0,
                                    "created_utc": 1652752109.0,
                                    "response": "Probably because antiwork and impoverished people have the least capital to put into Bitcoin? Worst communities to advertise to at this point. Even if you’re long on BTC some people can’t take the illiquidity associated with holding for what may be decades",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8wabmy",
                                            "author": "TheChoosey1",
                                            "score": -1,
                                            "created_utc": 1652752336.0,
                                            "response": "All the more important to sacrifice and buy as much Bitcoin as they can.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8wanw2",
                                                    "author": "mikebailey",
                                                    "score": 2,
                                                    "created_utc": 1652752508.0,
                                                    "response": "Completely missed the part of my comment where they have no capital to sacrifice. This isn’t a “drink less coffee” situation.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8wavka",
                                                            "author": "TheChoosey1",
                                                            "score": -5,
                                                            "created_utc": 1652752615.0,
                                                            "response": "Completely missed my point of determination and sacrifice and ingenuity. I'm figuring it out. They can too. Most people have more income than me. I assure you.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8wb19j",
                                                                    "author": "mikebailey",
                                                                    "score": 2,
                                                                    "created_utc": 1652752694.0,
                                                                    "response": "The poverty line is far far lower than the median income so I’m not sure what you think you figured out unless you’re below it. Telling impoverished people to figure it out is just braindead.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i8wbego",
                                                                            "author": "TheChoosey1",
                                                                            "score": -2,
                                                                            "created_utc": 1652752877.0,
                                                                            "response": "No. I'm saying that Bitcoin is their only way out. Bitcoin already saved my life and I was in worse conditions than basically 95% of people. \n\nYou sacrifice and put away $50 or $100 each month into Bitcoin. Eventually you can use that money to buy income generating assets to buy more Bitcoin. \n\nI'm not being callous. You're being callous. Giving people a tool like Bitcoin is a gift no matter who they are.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i8wbmx9",
                                                                                    "author": "mikebailey",
                                                                                    "score": 2,
                                                                                    "created_utc": 1652752995.0,
                                                                                    "response": "These people do not have $50-100 discretionary and it’s absolutely bonkers that you think they do. I’m done here lol.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i8wbvwc",
                                                                                            "author": "TheChoosey1",
                                                                                            "score": 0,
                                                                                            "created_utc": 1652753115.0,
                                                                                            "response": "I guess nobody smokes. It's absolutely bonkers to think that any human smokes cigarettes or weed or crack. \n\nThere's always something to be sacrificed for money no matter what.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i8wjwfg",
                                                    "author": "BuyRackTurk",
                                                    "score": 0,
                                                    "created_utc": 1652757306.0,
                                                    "response": "> All the more important to sacrifice and buy as much Bitcoin as they can.\n\nThey dont like the idea that they can help themselves with simple choices. In fact its offensive to them. \n\nThey want to steal from the rich, using the power of government. \n\nThe problem of the antiwork crowd is envy and sloth. Bitcoin is an unwelcome message to them, because it proves that their decision to rely upon the government and the US dollar is exactly why they are impoverished. Its their own fault.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8w0u4z",
                            "author": "soooofa_king",
                            "score": 0,
                            "created_utc": 1652747585.0,
                            "response": "Underrated comment.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8waiz9",
                    "author": "Negotiation_Only_",
                    "score": 3,
                    "created_utc": 1652752439.0,
                    "response": "Wages are *rising* as an incentive. A lot of people have little to no staff so they must pay more to attract workers.\n\nA McDonald’s by my house now pays 16/hr",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8wl1kp",
                    "author": "BestCelery263",
                    "score": 3,
                    "created_utc": 1652757942.0,
                    "response": "That whole sub is just baristas jerking each other off.  Don’t take it too seriously.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8w6dsu",
                    "author": "cubeeless",
                    "score": 2,
                    "created_utc": 1652750356.0,
                    "response": "To be fair, there was no alternative. Now there is!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8wcaq5",
                    "author": "adamcarrot",
                    "score": 2,
                    "created_utc": 1652753322.0,
                    "response": "there have been studies refuting the idea that cost of living going up with higher wages.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8whutr",
                            "author": "Alternative_Visit_72",
                            "score": 1,
                            "created_utc": 1652756196.0,
                            "response": "By whom? Commies academics?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8wjdtv",
                    "author": "DownvoteKink",
                    "score": 2,
                    "created_utc": 1652757016.0,
                    "response": "Nobody wants to take out a loan in a deflationary currency.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8wkbzq",
                            "author": "hyperinflationUSA",
                            "score": 1,
                            "created_utc": 1652757546.0,
                            "response": "Nobody needs a loan in a deflationary currency world",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8w0u6p",
                    "author": "LetItRaine386",
                    "score": 6,
                    "created_utc": 1652747586.0,
                    "response": "OP is dumb af. Antiwork is well aware of how inflation is impacting US workers, and are essentially demanding that pay keeps pace with inflation.\n\nMost people don't trust Bitcoin, and think that it's just another Crypto. You can single out any sub and say the same thing. I see bitcoin hate literally everywhere on the internet, it's still early",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8vdmot",
                    "author": "BusinessBreakfast3",
                    "score": 4,
                    "created_utc": 1652736677.0,
                    "response": "That's good for Bitcoin. :)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8vp6xa",
                    "author": "rofnacla",
                    "score": 3,
                    "created_utc": 1652741856.0,
                    "response": "Shhhhh let them keep pursing fiat. I got banned from that trying to make an argument quite similar to yours. Let them HFSP",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8vpvkf",
                    "author": "baconcheeseburgarian",
                    "score": 3,
                    "created_utc": 1652742173.0,
                    "response": "Inflation isn’t rising this fast because we increased the minimum wage.  I didn’t realize employers were offering to pay in bitcoin either. A consumer economy can’t function if consumers don’t have expendable income. We kill the golden goose by suppressing wage growth.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8wk2ur",
                            "author": "BuyRackTurk",
                            "score": 1,
                            "created_utc": 1652757404.0,
                            "response": "> Inflation isn’t rising this fast because we increased the minimum wage.\n\nThe Federal reserve is asking corporations to slow hiring and freeze wages to slow inflation. \n\nSo they think raising wages cause inflation.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8wlb0y",
                                    "author": "baconcheeseburgarian",
                                    "score": 1,
                                    "created_utc": 1652758090.0,
                                    "response": "> So they think raising wages cause inflation.\n\nFuel costs, supply line problems and trillions in borrowed debt getting an interest rate increase are what is primarily driving inflation, not wages.  Labor is only 20% of total product price.  The largest costs are materials and shipping.  One member of the Fed suggested a temporary corporate hiring freeze as a tool to fight inflation.  Clearly there are many other factors driving this surge.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8wluld",
                                            "author": "BuyRackTurk",
                                            "score": 1,
                                            "created_utc": 1652758405.0,
                                            "response": "> Labor is only 20% of total product price. \n\nThats not the reason. Its the extra money those workers would have to spend from their higher salaries that concerns the fed.\n\nIn short, they need someone to pay the tab for their reckless spending, and would prefer is the W2 wage slaves to take one for the team.\n\nBitcoin is the way to opt out.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8wmjzk",
                                                    "author": "baconcheeseburgarian",
                                                    "score": 1,
                                                    "created_utc": 1652758812.0,
                                                    "response": "> In short, they need someone to pay the tab for their reckless spending, and would prefer is the W2 wage slaves to take one for the team.\n\nThe workers always get fucked.  Why are you blaming their wages when the problem was clearly supply chain issues, fuel costs and too much borrowed money coupled with reckless spending?  The average tax rate on the rich is now only 3.4% after deductions.  Anyone getting a paycheck gets an average of 28% taken right off the top.\n\nBitcoin can help but if people cant save because they cant even pay their bills despite working full time then they cant even begin to build a position.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8vkzre",
                    "author": "Remarkable-Cat1337",
                    "score": 3,
                    "created_utc": 1652739912.0,
                    "response": "bitcoin is inflationary till 2130 idk what u are talking about",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8vozcj",
                            "author": "Edvardoh",
                            "score": 3,
                            "created_utc": 1652741755.0,
                            "response": "Dis-inflationary is likely what OP meant",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8vnhpa",
                            "author": "dadlif3",
                            "score": 2,
                            "created_utc": 1652741059.0,
                            "response": "Yup. Pretty surprising that people on a Bitcoin sub don't understand how Bitcoin works.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8wmqw5",
                                    "author": "hi_Joe_joe_mama",
                                    "score": 1,
                                    "created_utc": 1652758923.0,
                                    "response": "Oh 2 million left so how that is impact the price + there is more lost Bitcoin than left to be mined",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8vuo57",
                    "author": "walrus120",
                    "score": 2,
                    "created_utc": 1652744497.0,
                    "response": "You are acting like the anti work group think rationally. The mere act of investing is evil to them. Being a landlord is evil to them (I haven’t raised the rent in 3 years as I know people were struggling. We invest and do the other thing not because it is easy, but because it gives us a shot at self reliance. The antiwork crowd just want to bitch and blame",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8w05ks",
                            "author": "Jub-n-Jub",
                            "score": 2,
                            "created_utc": 1652747239.0,
                            "response": "When someone feels there are no options bitching and blaming is the safest thing they could do. Expecting rational behavior in an irrational system amongst the people that have the least hope is asking too much. I could say that it's irrational. Things are tough for a lot of people.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8w1s7p",
                                    "author": "walrus120",
                                    "score": -1,
                                    "created_utc": 1652748055.0,
                                    "response": "But many of us have been in poverty and worked our way out with no help. Just bitching is like saying “I’m defeated” look at the problem and solve it. It’s like those facing a serious illness, sometimes they just give up, sometimes they stay positive and fight through horrible pain and treatments and come out the other side disease free with a new outlook. I’m not be unrealistic thinking we can “think things into being” but certainly attitude plays a large part in overcoming many of life’s problems",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8w047x",
                            "author": "Hughski",
                            "score": -2,
                            "created_utc": 1652747220.0,
                            "response": "A lot are borderline communist tbh",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8vy8yj",
                    "author": "Ultimatenub0049",
                    "score": 2,
                    "created_utc": 1652746281.0,
                    "response": "This is a comprehension problem. It’s not that they can’t read it; it’s that they don’t understand it….",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8vd0hl",
                    "author": "NiceDoctorBeam",
                    "score": -9,
                    "created_utc": 1652736413.0,
                    "response": "By and large, the antiwork crowd are people who took the \"dumb\" classes in high school and never went to college.  A few went to college but didn't earn a degree which would make them marketable in the job market.\n\nTypically, they flip burgers but expect to be paid as much as an engineer.  \n\nI flipped burgers while in high school and realized right away, \"Must go to college, get a degree in something useful, get a much better job than this.\"  They didn't.  They think that by bitching to each other about their evil bosses they'll get ahead somehow.\n\nOne of my siblings was like that, got sick and tired of it, went to a vocational school and learned to do things with insurance claims that few people are able to do -- got a job in that field and started earning twice as much while working in a more pleasant environment.  Benefits, too.  Imagine!\n\nThose anti work people are like, \"My boss earned a profit.  He should split it with me.\"  Um, no.  That's not how it works.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8vtfgm",
                            "author": "kidcoodie",
                            "score": 17,
                            "created_utc": 1652743886.0,
                            "response": "This is probably the absolute dumbest take about that sub I’ve ever seen. They don’t ask for that, they ask for fair employment practices. A live able wage. Actual benefits, or call for unionization. If you spent even 2 seconds on that sub you’d realize they’re not as much “anti work” but rather in the pursuit of fair employment practices. Most actually express that they want to work and fulfill themselves but cannot because they are being exploited and/or short changed, or straight up mistreated in the workplace.\n\nThey do not simply ask for a cut from the higher ups. They are simply pointing out that wages have not grown with the rate of productivity and growth in this country, but CEO take home pay has never been higher. You cannot deny that this concentration is unhealthy, even more so in this inflationary environment when their measly wages are being eroded more and more. The CEOs certainly provide value, but do CEOs deserve 200-300x the wages of average workers? Especially those that cash out after tanking their businesses? (Look up JCPenney’s CEO bonus after horrible performance) Do baseline workers deserve not to eat, or meet basic needs? That’s the road you’re going down when you have takes like yours..Your statements seem to neglect that workers are the backbone of this country and that laborers & unions give us many of the benefits we enjoy today in the workplace.\n\nI don’t think someone flipping burgers should make as much as an engineer, but I don’t blame them for being upset by any means. Back in the day you could sustain yourself and your family with one job. That is hardly the case for anyone starting from zero these days",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8vn278",
                            "author": "swgo1",
                            "score": 13,
                            "created_utc": 1652740859.0,
                            "response": "Restaurant work is honest work.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8vvqnb",
                                    "author": "NiceDoctorBeam",
                                    "score": 4,
                                    "created_utc": 1652745026.0,
                                    "response": "Yes.  It really is.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8vjw8n",
                            "author": "Keith_Kong",
                            "score": 27,
                            "created_utc": 1652739424.0,
                            "response": "Such a bad take. It's true that r/antiwork folks are not very informed about how inflation works or what they should be asking for (chasing wage increases). But they are complaining about the cost of living rising relative to the majority of jobs in the US.\n\nYou're basically coming at them with the same boomer fud directed at Bitcoin:\"Just a bunch of lazy kids who want to get rich fast so they don't have to work!\"\n\nNo... it's about the unsustainable fiat system causing employees to constantly (and hopelessy) negotiate wages upwards just to maintain their lifestyle.\n\nMost of these people would be happy with making less than more innovative and successful people. They just see that they're getting an ever shrinking portion of the pie for doing what they do. This causes them to hate rich people because the simple conclusion to make is \"poor people have less, must be the rich people doing this\".\n\nI think r/antiwork is ripe for orange pilling if the right framing can make it into their ecosystem.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8vt0ch",
                                    "author": "NiceDoctorBeam",
                                    "score": 8,
                                    "created_utc": 1652743681.0,
                                    "response": "Yes.  Things have been changing.  \n\nMy grandfather drove a truck, delivering live chickens to the meat processor plant.\n\nHe owned a house (no mortgage), a car, a fishing boat, a camping trailer (pretty nice inside), and a truck to pull the trailer or the boat.  He collected gold and silver coins and guns.\n\nMy parents' generation, nearly the same kind of thing.  \n\nMy generation mostly ended up as debt slaves, praying for a real estate miracle to bail them out at the last minute.  Looks like the current real estate bubble is about to pop - they're fucked.\n\nThe younger generations are getting fucked.  They tend to have roommates, and debts, and they know better than to count on a miracle happening (at least the ones I've gotten to know).\n\nWhat's causing this shift?  \"Money printing.\"  That's why I'm here, in the Bitcoin sub...  Doing what I can to fix the root problem.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8wb698",
                                            "author": "LordCharidarn",
                                            "score": 2,
                                            "created_utc": 1652752764.0,
                                            "response": "What caused this shift is that your grandfather (assuming you are somewhere in the 25-40ish range) was employed in a world where America was pretty much the only territory in the world that hadn’t been bombed to shit at least once in the last century (your lineage screams American Story). \n\nSo, while the rest of the world was rebuilding, America was selling the world its resources and reaping the benefits of being a superpower/empire. \n\nCurrent situation is deeply different. Global economy has leveled out a lot more than that time. And America has decided that collective labor is too much like communism/socialism and that simply isn’t allowed. \n\nSo, less of a peak to sit on, and less leverage in the marketplace with the death of unions led to workers getting lubed up and bent over. Not so much the money printing, but that is a part of it. \n\nThe root problem isn’t that the imaginary money keeps getting made. It’s that the actual tangible resources are being hoarded by those who will never be able to utilize those resources. We don’t need USD or Bitcoin to drag out the guillotines, but the hoarders *do* need USD and Bitcoin to keep stringing us along in the hopes that we don’t bring out the knives. \n\nOr they could simply share a *little* bit of the wealth they’ve collected. But we all know they’d rather die than do that. So….",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8wke62",
                                                    "author": "BuyRackTurk",
                                                    "score": 1,
                                                    "created_utc": 1652757579.0,
                                                    "response": "> with the death of unions led to workers getting lubed up and bent over. \n\nUnions didnt help, they also lube and bend over the workers. \n\nWhat will help is ending the fed.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i8vw4qm",
                                            "author": "munkebizniss",
                                            "score": -1,
                                            "created_utc": 1652745219.0,
                                            "response": "The younger generation throws tantrums to get the policies that are fucking them",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8vyy1e",
                                                    "author": "kidcoodie",
                                                    "score": 3,
                                                    "created_utc": 1652746635.0,
                                                    "response": "Then I’d like you to list all the policies that have been enacted by “the younger generation” that result in their economic and social disadvantages compared to the boomer generation when they were younger. \n\nMaybe you’ve forgotten that our system has been fucked for many years.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8w5mah",
                                                            "author": "munkebizniss",
                                                            "score": -1,
                                                            "created_utc": 1652749971.0,
                                                            "response": "All of the policies? Gtfoh mush brain. The younger generation overwhelmingly supports democrats who push for inflationary policies such as massive and constantly expanding welfare programs, large scale immigration of unskilled labor, providing taxpayer benefits to non citizens, and modern monetary theory that calls for us to never attempt to reign in spending. That’s a short list, if you want more take an Econ class and learn the basics of supply and demand.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8w5rk7",
                                                                    "author": "kidcoodie",
                                                                    "score": 3,
                                                                    "created_utc": 1652750047.0,
                                                                    "response": "I believe that fed QE has been happening under democratic and republican leadership, you know, the biggest cash infusion and devaluation of the dollar due to unlimited money printers.\n\nAnd the biggest welfare package in history was passed by Trump. PPP (massive loans that were largely FORGIVEN) unemployment at $600 a week, then $300 a week, all the stimulus checks. But yes blame ONLY democrats and the younger generation for the inflationary environment we live in. Some democratic policies didn’t help, but to say democrats and the youngins are the sole reason shows you truly know nothing about economics, politics, and the world in general. My degree is quite literally in political science & business\n\nSounds like you’re a biased red pill-er, who lives in a dichotomy bubble. I find that most Americans think this way, pretty sad. It’s pretty easy to tell who’s “mush brain” here. Your bias has mushed your brain so far to the right you can’t even see what’s happening around you. If democrats are the problem, then why didn’t build back better pass? Because a democrat voted against it. \n\nEDIT: I also believe it was sir 45 that told Jerome Powell to keep the money printer going in the previous taper tantrum, because the market couldn’t handle raising rates AT ALL, despite us undergoing one of the largest economic expansions to date. So thank your orange leader for that one too, he directly pressured the federal reserve to keep printing more money & stimulating the economy",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "i8wkkvu",
                                                            "author": "BuyRackTurk",
                                                            "score": 0,
                                                            "created_utc": 1652757682.0,
                                                            "response": "> Then I’d like you to list all the policies that have been enacted by “the younger generation” that result in their economic and social disadvantages \n\nGo to any democrats home page\n\n> compared to the boomer generation when they were younger. \n\nThe boomers had the same shit, just seemed better because the rest of the world had been bombed to shit.\n\nThe younger generation who arent political NPC's are figuring this out, and getting on to bitcoin... but not the types who dwell in shitholes like antiwork.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i8vu7t0",
                                            "author": "Keith_Kong",
                                            "score": 1,
                                            "created_utc": 1652744273.0,
                                            "response": "Hell yeah man, just gotta figure out how to make r/antiwork see that Bitcoin isn’t just a Ponzi scheme. That framing has been so effective on common people. They just can’t seem to look past the volatility of cycles and are convinced rich people are simply stealing money from suckers.\n\nThe main barrier I believe is that they don’t realize Bitcoin is a movement with a philosophy behind it.\n\nReally interesting how deep you have to go into Bitcoin before getting to the ethos. For me, I watched Bitcoin from the sidelines since it’s inception. Took me until 2017 to discover there was an ethos, took me until the pandemic to learn how fiat monetary policy worked (which is the ‘why’ for Bitcoins ethos in the first place).\n\nI can only imagine how difficult it is for someone who doesn’t have hours to spend digging into educating themselves to grasp the Bitcoin value proposition.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8vj14l",
                            "author": "Woogank",
                            "score": 10,
                            "created_utc": 1652739036.0,
                            "response": "Abandoning everyone who didn't earn a degree isn't going to be better for you.\n\nUnfettered capitalism strewn with corruption has probably a lot more to do with the country spiraling down the shitter than poor people fighting for a pittance.\n\nSomeone's got to clean your shit splatter out the toilet.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8wkp43",
                                    "author": "BuyRackTurk",
                                    "score": 1,
                                    "created_utc": 1652757745.0,
                                    "response": "> Unfettered capitalism strewn with corruption \n\nOxymoron. \n\nBitcoin is unfettered capitalism; that is the cure for corruption. \n\nThe corruption is the fetters; central banks and government regulations.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8vs16m",
                                    "author": "NiceDoctorBeam",
                                    "score": -6,
                                    "created_utc": 1652743210.0,
                                    "response": "> Someone's got to clean your shit splatter out the toilet.\n\nYes.  Typically one of the lowest bidders for the work.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8vzqvr",
                            "author": "tio_aved",
                            "score": 2,
                            "created_utc": 1652747035.0,
                            "response": "Sure, this mindset may work on an individual level but seems unrealistic across the 150+ million hard-working US employees.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8vijhh",
                            "author": "FLWeedman",
                            "score": 8,
                            "created_utc": 1652738815.0,
                            "response": "No people are tired of busting ass and getting fucked in said ass while the boss takes the boat out every weekend. We've been getting screwed for decades...I'm genx. The system is rigged.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8vrv9e",
                                    "author": "NiceDoctorBeam",
                                    "score": 3,
                                    "created_utc": 1652743129.0,
                                    "response": "I agree.  The system is rigged.\n\nPeople USED TO get by with menial labor.  Things have changed.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8vhd9k",
                            "author": "hyperinflationUSA",
                            "score": 7,
                            "created_utc": 1652738300.0,
                            "response": "I think theres a much bigger picture of antiwork, the idea is on the current trajectory the majority of the population will not be able to afford basic shelter and food, why continue to work?\n\nA easier to understand example is why bother working for anyone that lives in venezuela where the average salary is $25 USD per month. The answer is becuase the government tied food stamps to being employed, which you don't get in most countries.\n\nThis is a direct effect of debasement of the currency.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8w25np",
                                    "author": "Percyheckendorf",
                                    "score": 2,
                                    "created_utc": 1652748242.0,
                                    "response": "No workers cannot debase a currency by asking for a proper wage. That’s not how currency works. They’re basing the desired wage off what they see at a grocery store. The wage increase is because the currency is debased.\n\nThere’s no incentive to work in Venezuela because your weeks wages are worth half as much by the time you get them. Because the currency was debased by banks, not because they asked for a raise. \n\nThis stuff doesn’t come from the labor markets, labor markets don’t have power like that, they just react to it",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8w6twx",
                                            "author": "hyperinflationUSA",
                                            "score": 0,
                                            "created_utc": 1652750576.0,
                                            "response": "i meant the wage is debased due to inflation. You work for $7.25 in 2009 and and then still work for $7.25 in 2022 the wage has been debased to worth half as much due to inflation. Even if you got a raise, the inflation is always higher",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i8vrozl",
                                    "author": "NiceDoctorBeam",
                                    "score": 0,
                                    "created_utc": 1652743044.0,
                                    "response": "> on the current trajectory the majority of the population will not be able to afford basic  \n\nI've been saying for years, \"Welcome to the third world.\"  \n\nIt's not my fault.  I just see it happening.\n\nJobs moved offshore.  Robots.\n\nIt's WAY different now than when my grandparents were young.  It just getting worse and worse.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8wmnes",
                                    "author": "kidcoodie",
                                    "score": 1,
                                    "created_utc": 1652758866.0,
                                    "response": "I like that you are understanding the anti-work perspective for what it is, and not for the buzzword title they gave themselves",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8vw662",
                            "author": "Creative-Molasses-60",
                            "score": 3,
                            "created_utc": 1652745239.0,
                            "response": "If you truly believe the system is rigged, this is a shit perspective. \n\nYou’re coming off not only as entitled as fuck but completely ignorant to the struggles that marginalized groups experience; especially low-income kids. Not everyone has the same opportunities. \n\nFor someone SO educated, I’d assume there would be a little more thought put into a post.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8vgfm2",
                            "author": "explosiveplacard",
                            "score": -7,
                            "created_utc": 1652737892.0,
                            "response": "Agree. Also, most of the antiwork crowd just don't want to work at all. What a lot of them really want is a universal basic income without having to work a job.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8vp3j2",
                                    "author": "rjc187",
                                    "score": 2,
                                    "created_utc": 1652741812.0,
                                    "response": "You know this how? You know most of the antiwork crowd?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8vq9ik",
                                            "author": "explosiveplacard",
                                            "score": -7,
                                            "created_utc": 1652742354.0,
                                            "response": "For starters, it's in the name 'antiwork', lol.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8vw9e6",
                                                    "author": "rjc187",
                                                    "score": 3,
                                                    "created_utc": 1652745285.0,
                                                    "response": "They are more anti the system where corporate profits and cost of living increase at a much faster rate than rate of pay",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i8vhzmk",
                                    "author": "AutoWallet",
                                    "score": -11,
                                    "created_utc": 1652738571.0,
                                    "response": "They want a meal ticket. They want to be fanned and fed figs by a robot as they lounge all day, every day.\n\nEdit for downvotes: you’re confusing r/workreform people with r/antiwork  \nHuge difference. One group wants to earn a living, the other doesn’t.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8vsh3l",
                                            "author": "Creative-Molasses-60",
                                            "score": 4,
                                            "created_utc": 1652743423.0,
                                            "response": "Quick delete after you went back and read the top posts 😂",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8vupy1",
                                                    "author": "AutoWallet",
                                                    "score": -1,
                                                    "created_utc": 1652744522.0,
                                                    "response": ">\tQuick delete after you went back and read the top posts 😂\n\nWhat are you blabbing on about? I had to edit after 2 minutes to include links to differentiate work reform vs anti workers, decided to resubmit so it doesn’t look edited after your comments.  I haven’t looked at that sub in months so dont put that shit on me ricky bobby. \n\nWhy u so salty? I can’t respond here anymore due to downvotes and time to post.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8vxerc",
                                                            "author": "Creative-Molasses-60",
                                                            "score": 2,
                                                            "created_utc": 1652745860.0,
                                                            "response": "You responded to me with: “I literally read from the sub’s top posts, no deeper” then you deleted it. \n\n\n\nNot sure what Ricky Bobby has to do with this.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8vyl64",
                                                                    "author": "AutoWallet",
                                                                    "score": 0,
                                                                    "created_utc": 1652746454.0,
                                                                    "response": "I hit edit immediately, typed up the response, submitted, was 1 minute late; so I created a new post for the comment. What’s your issue with this vs publishing an edit? Why does it matter? And why does it matter to you specifically?  \n\nWhy are you needing to create a narrative?",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i8vz88v",
                                                                            "author": "Creative-Molasses-60",
                                                                            "score": 3,
                                                                            "created_utc": 1652746777.0,
                                                                            "response": "Because it’s amusing when someone starts frantically editing when they start receiving downvotes. Why so defensive, bro?",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i8vrlii",
                                            "author": "Creative-Molasses-60",
                                            "score": 4,
                                            "created_utc": 1652742997.0,
                                            "response": "Terrible take. \n\nAnti-work is about improving overall working conditions for employees, not about being against the concept of work. \n\nYou sound like a shitty manager/boss or maybe just an idiot.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8vufmw",
                                                    "author": "kidcoodie",
                                                    "score": 3,
                                                    "created_utc": 1652744381.0,
                                                    "response": "It seems like nobody actually reads the anti work sub but just assumes that they’re all unemployment grifting unproductive slobs, when in reality that is not the case. I’ve seen many takes like that guys and they are so misled. Anti work wants fair wages & labor practices, not handouts",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i8vtgcr",
                                                    "author": "AutoWallet",
                                                    "score": -5,
                                                    "created_utc": 1652743898.0,
                                                    "response": "I literally read from the sub’s top posts only, no deeper. I have only looked at the sub a couple of times, and it was clearly not about work reform. \n\nIt is not about better work conditions. It’s “anti-work” about being against work. Workers being forced to preform work in order to receive nourishment, money, substance. Not about improving working conditions.. you’re confused. \n\nYou’re describing r/workreform, not r/antiwork\n\nWork reform is something I can get behind as a hard worker. One builds, the other breaks down. Looking at your last paragraph I know which you subscribe to.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8vyzil",
                                                            "author": "Creative-Molasses-60",
                                                            "score": 4,
                                                            "created_utc": 1652746656.0,
                                                            "response": "The top post is about a mom with a broken foot getting bitched at for sitting down at her shift while being the top performing employee that day.\n\nThe next top post is someone who’s dad passed away, got the Monday off, was told to stop being a victim and come to work. \n\n\nWhere is the anti-work bit?",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "i8wmwqa",
                                                            "author": "kidcoodie",
                                                            "score": 1,
                                                            "created_utc": 1652759019.0,
                                                            "response": "Did you know that the r/workreform Reddit descended from r/antiwork because a mod took it upon himself to make a centralized decision to appear on FOX News, wholly unprepared & not able to convey the movement, without any input from the sub; he made an absolute fool of himself live on FOX and damaged the entire movement, and wouldn’t relinquish control of the sub despite the whole sub demanding he step back & let organizers take over? Watch the interview. He was an absolute fool & the subs did not respond well to his misrepresentation of their actual labor movement. \n\nBoth subs still promote a similar labor-friendly message at this point & they have cleaned up the antiwork sub since the FOX shit show and removed that mod!\n\nBut No. You probably didn’t know. Because you only read headlines and regurgitate surface level information. You literally said you only read the top posts, no deeper, yet you have these strong convictions about your arguments. How is that even possible",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i8vhqzu",
                                    "author": "dima054",
                                    "score": -1,
                                    "created_utc": 1652738466.0,
                                    "response": "It's coming.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8vuna4",
                                    "author": "kidcoodie",
                                    "score": 1,
                                    "created_utc": 1652744485.0,
                                    "response": "False. Many of them talk about work & how they would continue to feel optimistic if jobs paid enough and were fulfilling. However most jobs are underpaid, execs & the boards are overpaid, and long time workers are at a disadvantage. That’s why job hopping became so popular. If you actually read the sub, you’ll see many people talking about leaving their current jobs to find better opportunities.\n\nAnd why wouldn’t they be upset with the situation, their shit wages are getting shit on even more by inflation. The anti work sub is a collective labor movement, not a handout get together for bums",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8vte8e",
                            "author": "escap0",
                            "score": 1,
                            "created_utc": 1652743870.0,
                            "response": "Such an excellent take.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8w05vi",
                    "author": "VPNApe",
                    "score": 2,
                    "created_utc": 1652747243.0,
                    "response": "Antiwork is made up of losers who are dedicated to not working and being handed all their wants/needs by the government (either directly in the form of stuff like free stuff or indirectly in the form of absurdly high minimum wage laws). \n\nThey are the exact opposite of capitalists and are socialist for all intents and purposes. \n\nBitcoin is about escaping the overbearing control of government, and they are about relying on the government for everything. The monetary side effect of their intended way of life (printing tons of money) is the exactly what causes inflation to begin with.\n\nSo yeah, fuck antiwork and any movement who's goal is to encourage the govt to inflate the dollar even more.\n\nI understand the struggle of being a low wage worker, I really do, but the solution ought to be to increase your value as an employee, not to drag the world down to your level. The fantasy of the poor having good lives has never been and will never be a reality. Better to accept that instead of reeeeeeeeing into the air.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8w2rag",
                            "author": "pushdose",
                            "score": 1,
                            "created_utc": 1652748539.0,
                            "response": "Louder for the people in the back. \n\nAntiwork is made up of LOSERS. \n\nBitcoin is made from WORK. It takes WORK to get it. \n\nThey don’t deserve bitcoin.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8vch8v",
                    "author": "dadlif3",
                    "score": -2,
                    "created_utc": 1652736184.0,
                    "response": "I'll say this till I'm blue in the face: Bitcoin is inflationary, it has a limited supply but that supply is increasing therefore it is inflationary.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8vg10n",
                            "author": "ludwigvonmises",
                            "score": 3,
                            "created_utc": 1652737714.0,
                            "response": "The supply increases, but the price level in terms of Bitcoin decreases. So it exhibits monetary inflation and price deflation at the same time.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8vhnim",
                                    "author": "dadlif3",
                                    "score": 6,
                                    "created_utc": 1652738425.0,
                                    "response": "Good clarification, Bitcoin and the price of Bitcoin are two different things.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8vcvz1",
                            "author": "hyperinflationUSA",
                            "score": -4,
                            "created_utc": 1652736360.0,
                            "response": "it is listed as a example of hyperdeflation \n\n[https://www.investopedia.com/terms/h/hyperdeflation.asp](https://www.investopedia.com/terms/h/hyperdeflation.asp)",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8ve2y3",
                                    "author": "dadlif3",
                                    "score": 10,
                                    "created_utc": 1652736874.0,
                                    "response": "Every 10 minutes 6 new bitcoin are added to the circulating supply for an approximate inflation rate of 1.8% per year. Then in 2024 the halving will decrease the inflation rate by 50%.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8vzzkb",
                                            "author": "Salt-Traffic59",
                                            "score": 1,
                                            "created_utc": 1652747155.0,
                                            "response": "No dont show truth to these kind of peopleee",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8wnt50",
                                                    "author": "dadlif3",
                                                    "score": 1,
                                                    "created_utc": 1652759554.0,
                                                    "response": "I'm already regretting it lol. In true reddit fashion, you get downvoted for stating facts.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8vkxok",
                            "author": "Hank___Scorpio",
                            "score": -9,
                            "created_utc": 1652739886.0,
                            "response": "Lol. Sounds like you're running at dangerously low brain oxygen levels naturally, why push it?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8vt25n",
                    "author": "escap0",
                    "score": 1,
                    "created_utc": 1652743705.0,
                    "response": "The antiwork crowd can’t see a lot of things.  Nothing in life comes without your own time and labor, or someone else’s time and labor, short of incredibly good luck; and even then it was probably someone else’s time and labor.  Work hard and build your own thing instead of just ranting about it.   I get it, sometimes there are bad bosses, but FFS, they need to grow TFU.   I can’t believe it even survived the media fiasco it was involved in.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8vw639",
                    "author": "inter71",
                    "score": 1,
                    "created_utc": 1652745238.0,
                    "response": "AntiWork is a defeatist echo chamber.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8wbfh9",
                    "author": "An_Actual_Porcupine_",
                    "score": 0,
                    "created_utc": 1652752891.0,
                    "response": "I think the problem is their stupid.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8wc6ab",
                            "author": "Whatever3999086543",
                            "score": 3,
                            "created_utc": 1652753260.0,
                            "response": "*they're",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8wi76o",
                                    "author": "An_Actual_Porcupine_",
                                    "score": 0,
                                    "created_utc": 1652756381.0,
                                    "response": "This is social media. Nobody gives a fuck.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8vjjvv",
                    "author": "angrydanmarin",
                    "score": -1,
                    "created_utc": 1652739269.0,
                    "response": "Because deflationary currency doesn't have many benefits. If your money is worth more tomorrow than it is today, you don't spend it. \n\nDon't spend money, economy stops. Innovation stops. Progress stops.\n\nI'll ask you this, say you wanted to do your weekly shop right now. Would you pay in dollars, or bitcoin?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8vkup6",
                            "author": "unred",
                            "score": 2,
                            "created_utc": 1652739849.0,
                            "response": "Bitcoin reduces unnecessary spending and encourages conservation.\n\nI sold bitcoin to buy a home, in order to start a family.\n\nI don't sell bitcoin for plastic garbage or things I don't actually value. I use USD for that.\n\nIf our economy is based on people buying garbage they don't actually need, then it's wasteful and inefficient.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8vy6pt",
                                    "author": "Pale_Title6460",
                                    "score": 6,
                                    "created_utc": 1652746249.0,
                                    "response": "> Bitcoin reduces unnecessary spending and encourages conservation.\n\nAnd that's very, very bad for economies that depend on consumption.\n\nu/angrydanmarin is right. You're the one who doesn't understand how a deflationary currency is an atrocious idea. There's a reason why literally every single country on the planet strives for a small positive (and controlled) inflation. You don't want to encourage conservation because that stagnates your entire economy, you **want** it not to be worth it to just store currency. What you actually want to encourage in order to have economic growth is for money to circulate in the form of either consumption or investment, and a small amount of inflation accomplishes that.\n\nYou literally do not comprehend what you're wishing for. If your country's currency were replaced with a deflationary one, you would very quickly enter a severe recession and you'd economically crumble shortly after.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8w0dj7",
                                            "author": "Hughski",
                                            "score": 6,
                                            "created_utc": 1652747351.0,
                                            "response": "Coming onto r/Bitcoin and expecting most members to understand economics in the slightest is quite bold of you tbh",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i8w0jf9",
                                            "author": "unred",
                                            "score": -1,
                                            "created_utc": 1652747434.0,
                                            "response": "We printed over 40% of all USD in 2020.\n\nInflation is good, they say. Inflation is temporary, they say. Inflation is only bad for the rich, they say.\n\nI went to a restaurant last night, and a steak dinner costs $52.\n\nA basic 3 bedroom house in my area costs about $450,000, with a minimum wage of $15/hr.\n\n\nMaybe this system of inflationary currency doesn't work so well.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i8wl21o",
                                            "author": "BuyRackTurk",
                                            "score": 1,
                                            "created_utc": 1652757949.0,
                                            "response": "> And that's very, very bad for economies that depend on consumption.\n\nBitcoin was invented by a person who does not believe in that keynesian fairy tale.\n\nIronic that antiworkers so fervently believe in that idiotic yarn told to pacify wage slaves.\n\nBelieving that inflation is good is the root of their problems.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8wms1f",
                                                    "author": "Pale_Title6460",
                                                    "score": 1,
                                                    "created_utc": 1652758942.0,
                                                    "response": "> Bitcoin was invented by a person who does not believe in that keynesian fairy tale.\n\n\"That keynesian fairy tale\" is how literally every country on this planet operates.\n\nIf anything here is a fairy tale, it's a deflationary currency, which literally never worked in the history of mankind, and there's a very good reason for that.\n\n>Believing that inflation is good is the root of their problems.\n\nSo you believe that deflation is good instead?\n\nWhat happens to the economy of your country when people realize they're better off not spending anything beyond the strictly necessary because the currency they're holding is gaining value? What happens when people no longer start businesses or invest their money in order to make more money, because they can make more money with none of the risk by just holding that currency instead? What happens to unemployment when no new/expanding businesses means no more jobs being generated? What happens to industries dependent on consumption when nobody has money due to skyrocketing unemployment, and the few who do have money are strongly incentivized not to spend anything beyond the strictly necessary?\n\nA deflationary currency very quickly puts your country's economy on a death spiral and throws GDP out the window. It's literally a financial catastrophe any% speedrun.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i8vljy7",
                                    "author": "angrydanmarin",
                                    "score": 2,
                                    "created_utc": 1652740167.0,
                                    "response": "There's more to living than having shelter. Living on necessity alone is basically what the Soviets strived for and society broke down rather predictably. \n\nPeople like nice things and the freedom to do things. If that means getting a new set of golf clubs, it a new car, or a bottle of coke, so be it.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8vlv3e",
                                            "author": "unred",
                                            "score": 0,
                                            "created_utc": 1652740311.0,
                                            "response": "One nice thing about bitcoin is that it is voluntary.\n\nIf you want to buy golf clubs and cars and coke, go for it.\n\nIf you want to preserve your wealth in bitcoin, understanding that in the long term, the price of bitcoin goes up, while the price of used golf clubs goes down, that is an option that is available to you.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8vmhk8",
                                                    "author": "angrydanmarin",
                                                    "score": 2,
                                                    "created_utc": 1652740597.0,
                                                    "response": "What I'm getting at in my OP is that you are not encouraged to spend it in the first place as it's deflationary, and that will fuck over the economy on such a scale. \n\nI'm not going to buy that set of golf clubs because next year, I could get the newer set for less money. So I don't get it. The golf club company doesn't get my money, so they don't create new clubs and innovate new designs. Their company doesn't grow. Essentially, GDP goes down and the economy shrinks.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8wlj3x",
                            "author": "canadas",
                            "score": 1,
                            "created_utc": 1652758221.0,
                            "response": "So I will what, not buy food everyday? not replace my TV when it breaks?  Somehow live without a car it it dies?  All because it ill be worth  little more tomorrow?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8vyxww",
                    "author": "assclown356",
                    "score": -2,
                    "created_utc": 1652746634.0,
                    "response": "Notice that no one will admit raising minimum wage has a direct correlation to high inflation. Economic theory states it though and one of the keys to decreasing inflation is to lower minimum wage. \n\nBut honestly those in the anti work crowd are not necessarily the brightest bulbs in the box and are easily influenced by false information.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8w1hy8",
                    "author": "Stock-Cauliflower364",
                    "score": 1,
                    "created_utc": 1652747915.0,
                    "response": "Fake money is the problem.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8wa35z",
                    "author": "Troy_Ounces",
                    "score": 1,
                    "created_utc": 1652752216.0,
                    "response": "Because their whole life they’ve only known inflation. Deflation is a hidden secret",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8wa8fw",
                    "author": "BeefFeast",
                    "score": 1,
                    "created_utc": 1652752290.0,
                    "response": "Your internet numbers don’t fix wealth inequality, in fact, they make it’s much much worse. Do you even understand what you’re asking?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8wcqxx",
                    "author": "vAaEpSoTrHwEaTvIeC",
                    "score": 1,
                    "created_utc": 1652753550.0,
                    "response": "Uhh, is it because they are all under 25, know little Bout the world, and got through college without taking Economics 101?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8wjdmd",
                    "author": "jimmypezz15",
                    "score": 1,
                    "created_utc": 1652757013.0,
                    "response": "You're making the mistake of thinking they express rationality in their beliefs. They are anti work and pro communism which are literally 2 opposing philosophies.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8vy4jh",
                    "author": "PeterSchiffindisguse",
                    "score": 0,
                    "created_utc": 1652746219.0,
                    "response": "Because even they are not immune from drinking the lame stream media koolaid and it’s negative bias against Bitcoin.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8vqbk2",
                    "author": "Halo22B",
                    "score": -4,
                    "created_utc": 1652742380.0,
                    "response": "Dude your expecting to much....alot of plebs on here don't understand Austrian economics and free market capitalism, why do you expect a bunch of Marxists to get it?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8w0qrd",
                            "author": "Hughski",
                            "score": 0,
                            "created_utc": 1652747537.0,
                            "response": "Those people aren’t Marxists - they probably don’t even know who he was. For the most part they are clueless and very susceptible to misinformation",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8vrak0",
                    "author": "arbalest_22",
                    "score": -4,
                    "created_utc": 1652742851.0,
                    "response": "The people that screech for a higher minimum wage aren’t smart enough to understand simple concepts like inflation. That’s why they do it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8vmfsq",
                    "author": "Ofiller",
                    "score": -2,
                    "created_utc": 1652740574.0,
                    "response": "Probably because it requires work to do just that",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8vmzjf",
                    "author": "swgo1",
                    "score": 0,
                    "created_utc": 1652740827.0,
                    "response": "They have problems",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8vhblz",
                    "author": "ndgoLiberty",
                    "score": -12,
                    "created_utc": 1652738279.0,
                    "response": "Anti-work is code for:\n\n “my high school economics teacher had blue hair and I only came to school 3 days a week cause I was too busy getting butt fucked by my drug dealer behind the dumpster”\n\nAsk me how I know.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8vi17a",
                            "author": "dadlif3",
                            "score": 4,
                            "created_utc": 1652738590.0,
                            "response": ">Ask me how I know.\n\nHow do you know?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8vtil6",
                                    "author": "ndgoLiberty",
                                    "score": -1,
                                    "created_utc": 1652743929.0,
                                    "response": "Found out about 30 months into a long term relationship. She seemed so normal.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8vvqu6",
                                            "author": "dadlif3",
                                            "score": 2,
                                            "created_utc": 1652745029.0,
                                            "response": "It happens. Last I heard my ex wife is an unemployed freeloader.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8vq1jn",
                            "author": "ty_rex",
                            "score": -1,
                            "created_utc": 1652742251.0,
                            "response": "🤣🤣",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8w87mm",
                    "author": "Any-Comb4685",
                    "score": 0,
                    "created_utc": 1652751276.0,
                    "response": "Have you read many of the posts and comments there?  Half of them are about legitimate issues with employers etc that in many cases are awful but the other half are just lazy people complaining about everything….\n\n“I got out of bed, came into work and have little skill…. want $25 a hour!”  \n\n“the boss didn’t say good morning to me so my feelings are hurt and I want a job someplace else”.  \n\n“It’s not fair that Frank makes $5 more an hour than me…he only has a college degree in the same field and 10 years more experience.“\n\n“I got a degree in (insert worthless degree here) and can’t find a job in that field that doesn’t pay $100k a year.  Where are all the jobs??”\n\n“I can’t pay my student loans that I was “forced to take out”. The government better pay them off for me!”",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8wbuu9",
                    "author": "Jezzes",
                    "score": 0,
                    "created_utc": 1652753101.0,
                    "response": "They don't want to do the work to understand.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8vivbp",
                    "author": "E-renter",
                    "score": -10,
                    "created_utc": 1652738963.0,
                    "response": "They're just lazy commies who want free money from the socialist governments here in the West and some of them I know I figured out how to do it. 10 years younger than me and fully retired with government compensation for a non-existent injury, paying higher than they made when they worked. As a result those of us who do work pay extremely high taxes. Eventually if the WEF gets its way we will all have nothing. Only those at the very top of course will own everything but they don't mention that even in the fine print. They will accomplish this with taxes they are already making it so expensive that people who own their own homes increasingly have to sell because they can't afford the rent they have to pay to the government for something they already own. At that point why should I work? I'll just lay around and collect a free check like everyone else. The only problem is in such a world what can we buy with our free checks, when nobody's making anything? Of course, commies like Trudeau and Biden cannot comprehend such concepts. So the world's going to have to go to complete shit before the woke liberal sheep really wake up and we start to get real conservative governments back in power. Or who knows maybe they will never wake up. Maybe it's back to the caveman lifestyle, I've heard the paleo diet is quite healthy.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8vpg4i",
                            "author": "rjc187",
                            "score": 2,
                            "created_utc": 1652741975.0,
                            "response": "It’s funny, most conservatives I know work at Walmart or something similar, most liberals I know are doctors/lawyers/engineers/teachers",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8vuvfs",
                                    "author": "kidcoodie",
                                    "score": 1,
                                    "created_utc": 1652744597.0,
                                    "response": "Yup",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8vtlli",
                                    "author": "theslapzone",
                                    "score": 0,
                                    "created_utc": 1652743970.0,
                                    "response": "Most conservatives I know work for the military, government or a government contractor. To be fair I live out here in the mid-atlantic region. I just laugh when they bitch about social programs and taxes.\n\nFor reference: I'm all in on bitcoin. I'm also all in on democratic work places. I just don't see any conflict there. If a person has a problem with the r/antiwork crowd, it's got nothing to do with Bitcoin and everything to do with the biases they've been programmed with. No amount of Austrian economic buzzwords will change that.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8wlkw6",
                                            "author": "BuyRackTurk",
                                            "score": 0,
                                            "created_utc": 1652758250.0,
                                            "response": "> If a person has a problem with the r/antiwork crowd, it's got nothing to do with Bitcoin and everything to do with the biases they've been programmed with. \n\nLol, it has more to do with the outrageously idiotic proposals they make, and their insane ideas as to how economics or the world works. \n\nIf you think that the antiwork crowd are anything but a bunch of useful idiots and bots, you are just not being logical.\n\n> No amount of Austrian economic buzzwords will change that.\n\nBuzzwords? The actual concepts of austrian economics and bitcoin are exactly pointing out the gap that separates antiwork zombies from escaping their self-imposed drudgery.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8wvgbb",
                                                    "author": "theslapzone",
                                                    "score": 1,
                                                    "created_utc": 1652764544.0,
                                                    "response": ">outrageously idiotic proposals they make, and their insane ideas as to how economics or the world works. \n\nHaha you just described this subreddit to a tee.\n\nListen, many folks in here use buzzwords like Austrian economics without knowing a thing about it.\n\nBitcoin is only tied to Austrian economics in so much as libertarian minded people are drawn to both. That's fine. Bitcoin is sound money but it doesn't need an economic theory. It just is plain and simply sound money. You and I both know and love it for that. I'm not here to dis anyone for liking Bitcoin. \n\nI read r/antiwork frequently. Much like here there is a broad range of ideas. Crackpot to brilliant. Categorically dismissing them as lazy people who don't want to work is disingenuous and shows personal biases more than passing a qualitative judgement.\n\nHumans are born valid. They don't have to toil away at shitty jobs to earn validity. Too frequently I see hard working well meaning folks denigrate people who aren't as talented, fortunate or lucky as themselves. People should be more aware of their own situation and how fortunate and lucky they might be. We fool ourselves into believing that everything we have we 100% earned. That's just categorically false. We're all fighting our own battles. Being compassionate to others and their struggle just takes a little effort. That's my point.\n\nEnjoy the dip. DCA. Here's to 8 billion self banked humans. 💪",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8w83b0",
                    "author": "Trenchapo",
                    "score": -1,
                    "created_utc": 1652751215.0,
                    "response": "Most antiwork crowd are unemployed and the few employed work retail.. we shouldn’t be listening to them at all",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8w4704",
                    "author": "Rokey76",
                    "score": 1,
                    "created_utc": 1652749259.0,
                    "response": "Because most people don't think Bitcoin is a currency.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8w74mz",
                    "author": "WanYiLin",
                    "score": 1,
                    "created_utc": 1652750727.0,
                    "response": "Saving profit is the most correct way of inflation, but people don't know how to do it, more often need steps and tutorials to guide",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8wbzgx",
                    "author": "GarugasRevenge",
                    "score": 1,
                    "created_utc": 1652753165.0,
                    "response": "I'm kind of in both, I just got a hardware wallet and I plan to put excess money into Bitcoin, off of exchanges. The main reasoning is to not leave my money in a bank. You might think it's safe, but in 3 years inflation will add up to around 50%, that won't necessarily happen to YOUR money if it's kept in a hardware wallet. Most people don't understand the yield bearing concept, just the value.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8wd69o",
                    "author": "Peckingclaw",
                    "score": 1,
                    "created_utc": 1652753766.0,
                    "response": "You said tangentially",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8wh72p",
                    "author": "General_Wallaby_3947",
                    "score": 1,
                    "created_utc": 1652755839.0,
                    "response": "Btc is not deflationary .....",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8wi2yv",
                    "author": "MartinCavallo",
                    "score": 1,
                    "created_utc": 1652756317.0,
                    "response": "Antiwork and Bitcoin are both a little sanguine, not yet ready for some tough conversations about cleaning up the old economy, preventing past mistakes from repeating, moving forward...  and so it shall remain as long as some of the population isn't starving, some is getting ahead, some is ahead.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8wiaas",
                    "author": "hedon7",
                    "score": 1,
                    "created_utc": 1652756426.0,
                    "response": "Great question and something I noticed too. It’s all politics. The main issue they all have with Bitcoin is the responsibility that is required to use it well. Buying at the right time, holding your keys, not selling, taking the time to learn it all. They would rather have state power hold their hand and make corporations treat them better. This has historical precedent with labor movements so it isn’t completely unfounded. But considering the main source of their misery is money printing and not corporate policy, it is unfounded. Bitcoin is a very new technology, so a consensus around it’s monetary value like gold might take decades.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8wkvd9",
                    "author": "P_M_TITTIES",
                    "score": 1,
                    "created_utc": 1652757843.0,
                    "response": "Most people on r/antiwork don’t make enough to contribute to investments. That’s why they are so pissed in the first place. You try and make min wage and buy btc at the same time while you provide a roof over your family while still getting food on the table as well. \n\nIt’s hard being broke, everything costs face value. No deals, no interest earned just paid.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8wn0t0",
                    "author": "blaze1234",
                    "score": 1,
                    "created_utc": 1652759086.0,
                    "response": "Inflation is fine, so long as the bottom 85-90% are taken care of.\n\nUniversal health care, rent controls, food security, end homelessness, free education.\n\nTax the fuck out of the top percentages.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8wo0uw",
                    "author": "FutureNotBleak",
                    "score": 1,
                    "created_utc": 1652759687.0,
                    "response": "Majority of the youth have been educated into ignorance. It’s not 100% their own fault.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8wo7ar",
                    "author": "torinakomara",
                    "score": 1,
                    "created_utc": 1652759798.0,
                    "response": "Bitcoin does have a bit of inflation, not all 21 mil been created yet",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8wodqt",
                    "author": "GazeTheSun",
                    "score": 1,
                    "created_utc": 1652759910.0,
                    "response": "lol they don't \"have\" 15 dollars an hour, the federal minimum wage is still 7.25",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8wqu0u",
                    "author": "OfficerFrieza",
                    "score": 1,
                    "created_utc": 1652761446.0,
                    "response": "You expect too much from them. Not everyone invests into anything, especially people that expect others to do it for them.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ws9rc",
                    "author": "JeremyLinForever",
                    "score": 1,
                    "created_utc": 1652762395.0,
                    "response": "Too smart to start a worldwide movement, too dumb to realize the repercussions haha",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8wsbwb",
                    "author": "KevKevKvn",
                    "score": 1,
                    "created_utc": 1652762432.0,
                    "response": "Because that anti work sub is made up of a majority of people that have very little knowledge of economics. Most people in this world just think: more money = good. They don’t see the bigger picture (can’t blame them tho)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8wufkj",
                    "author": "ivgur",
                    "score": 1,
                    "created_utc": 1652763835.0,
                    "response": "Yeah basically too much debt and money printing cause inflation while minimum wage (or wages in general) did not follow that path of increase. All of this is due to the monetary policy that was way too loose for decades (with periods of tightening ofc) and money has been literally given away. That was not the case in like 50-80’ when people did almost any job and had a better lifestyle comparatively to people earning minimum wage today.\n\nConcerning the « seeing inflation issue and not seeing a point in getting a deflationary asset » it’s something else. First Bitcoin is not deflationary as many people say. Bitcoin is just non-deflationary. Except for lost bitcoins that are estimated to approx. 10-15% of total supply, no Bitcoin is « burned ». There will always be 21m Bitcoin after all are minted. You can not decrease the supply, thus it is non deflationary it’s just scarce.\n\nThat anti work crowd maybe isn’t tech savvy and you can’t totally blame them. When you’re working your ass off just to pay the bills you probably won’t prioritize to educate yourself on some new tech investment stuff: you’ll still invest into assets the people that eat you offer you. That’s a cycle unfortunately.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ww65k",
                    "author": "Confident_Worker_203",
                    "score": 1,
                    "created_utc": 1652765050.0,
                    "response": "Sorry, but Bitcoin will not solve this problem, just like gold didnt solve that problem.\nImo the core issue is not monetary, it is redistribution.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8wwpnx",
                    "author": "New_Dawn",
                    "score": 1,
                    "created_utc": 1652765446.0,
                    "response": "Antiwork crowd are lazy socialists that want everyone to be governed harder specifically to have the hard working segment of society have their earnings redistributed to the lazy segment of society. They're a bunch losers who will contribute zero to the functioning of a strong society.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8wwyjk",
                    "author": "Sea_Conversation2799",
                    "score": 1,
                    "created_utc": 1652765630.0,
                    "response": "They are mostly stupid lazy neoliberals that don't understand what neo liberals are actually doing. That sub if toxic stupidity and everything wrong with how humans organize.  There will be a post from a conservative source wanting to tax corporations fairly and eliminate wage disparity etc.. all the same fundamental values. But because they don't like Biden somehow they can't work together towards a common good.  This kind of teaming up and refusing to work together with other teams. Or viewing everything through the binary lens of western politics. It not only suspends actual progress it creates a situation where we are fighting each other as the ruling class steals from our pockets then points the finger at the other team. It's almost tragic seeing how this plays out on Reddit all the time. You can literally see how the posts that glinly demonize another group get upvoted and the ones trying to have nuanced discussion about forming a real movement most people can get behind just whither away . It's really sad what happened here. The mob mentalities have for some reason become the standard.\nI remember back in the day you would read a few different opinions on a subject at the top of posts here and feel educated in a way. Now you just get vicious echo chambers filled with mostly lame condescending remarks that only work in this one liner culture we are curating.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8wx1tg",
                    "author": "Kuzcopolis",
                    "score": 1,
                    "created_utc": 1652765695.0,
                    "response": "I joined both subs around the same time if that makes you feel any better.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8wxxg9",
                    "author": "Random_Ad",
                    "score": 1,
                    "created_utc": 1652766346.0,
                    "response": "How is BTC deflationary?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8wynks",
                    "author": "Uberhipster",
                    "score": 1,
                    "created_utc": 1652766892.0,
                    "response": "\"how is it people who believe in government solutions dont see government is the problem?\"",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8whv7t",
                    "author": "More-Adventure2",
                    "score": -1,
                    "created_utc": 1652756202.0,
                    "response": "Lol bitcoin is worthless than half of what it was last year",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8w9lf7",
                    "author": "Eternal12equiem",
                    "score": 0,
                    "created_utc": 1652751973.0,
                    "response": "Isn’t bitcoin inflationary until it hits its cap. Bitcoin is not deflationary. There is no burning.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8wdb22",
                    "author": "Hot-Canceld",
                    "score": 0,
                    "created_utc": 1652753834.0,
                    "response": "because they're dumb",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8wfdoy",
                    "author": "Mysterious-Emu-4503",
                    "score": 0,
                    "created_utc": 1652754887.0,
                    "response": "They wanna turn the game table over. We want to corner the king.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8wfut2",
                    "author": "JArmstrongDesign",
                    "score": 0,
                    "created_utc": 1652755135.0,
                    "response": "Despite Fox, I believe in Antiwork",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8wktzn",
                    "author": "SigaVa",
                    "score": 0,
                    "created_utc": 1652757822.0,
                    "response": "8% inflation is huge news.  A 40% drop in bitcoin is just a bad month.\n\nBitcoin isnt a currency, its gambling.  People living paycheck to paycheck cant afford gambling.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8wnnc0",
                    "author": "NewFuturist",
                    "score": 0,
                    "created_utc": 1652759458.0,
                    "response": "Let's see, when inflation warning bells started happening 6 months ago you could:  \n\\- Leave money in cash, losing you 3% in real terms  \n\\- Put money in Bitcoin, losing you 60% in real terms. \n\nBitcoin is NOT a stable store of value. It is a bet on the world adopting a new payment infrastructure.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}