{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "nlhxgk",
            "title": "Searching for an explanation of relevant taxes in germany",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/nlhxgk/searching_for_an_explanation_of_relevant_taxes_in/",
            "author": "Flasheninhalt",
            "created_utc": 1622038158.0,
            "score": 0,
            "num_comments": 9,
            "subreddit": "BitcoinBeginners",
            "selftext": "Hello everybody,\nsadly there is no real german sub related to crypto currencies.\n\nIm kinda new into crypto. What i know so far for the german tax law:\n\nIf you hodl coins over 1 year there will be no taxes.\nIf u cash-out before 1 year u need to pay ~25% taxes.\n\nWhat is defined as cash-out? Do i also need to pay taxes if my fiat money stays on the exchange?\nSometimes there are coins i buy but i dont believe in the long term so i want to grab the cash and put into some long term coin.\n\nAnd who will check if i pay the taxes properly? Does my bank do it for me or do i have to make a Steuererklärung?\n\nThats pretty it.\nThank you.",
            "stickied": false,
            "comments": [
                {
                    "id": "gzik731",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1622038159.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "gzisfqv",
                    "author": "FieserKiller",
                    "score": 1,
                    "created_utc": 1622041516.0,
                    "response": "every trade counts. so basically say you transferred 1000$ to kraken and bought Bitcoin. if you keep it on the exchange for > 1 year or move it to your cold storage for a year and back to the exchange and then cash aout to euros -> no taxes.\n\nnow lets say you did not wait for a year, but instead you exchnged back to euro after a month -> thats a taxable event. lets say you kept the money on kraken and another month later you bought some hyped shitcoin  -> thats a taxable event. then another moth later you traded that shitcoin for bitcoin -> another taxeable event.\n\nSo basically everytime you trade anything and there is less then a year between the last trade its a taxable event.\n\nYou need to declare your trading gains and losses in your annual tax declaration. If you do not you are commiting fraud but nobody will check for years until at some day finanzamt will check and ask you for a declaration of the source of your coins for the last 11 years. happened to me. Its not fun.Better declare everything every year thats saves a lot of trouble and an expensive lawyer.\n\nThere are websites like Koinly which help with calculation of gains and losses.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "gziuejw",
                            "author": "Flasheninhalt",
                            "score": 1,
                            "created_utc": 1622042331.0,
                            "response": "Thanks a lot! In conclusion day trading is not effective enough in germany but im also glad hodling is rewarded.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "gziwx4j",
                                    "author": "Ranzratte3",
                                    "score": 1,
                                    "created_utc": 1622043348.0,
                                    "response": "Thats right. I really like the 1 year rule. Also technically you could trade using CFDs (contracts for difference) like on BitMex which count as Kapitalgeschäft and are taxed with the Abgeltungssteuer similar to interest and stocks. But don't really recommend it.   \nAlso intensive day trading can be seen as \"Selbstständigkeit\" and you would have to register a \"Gewerbe\" and pay \"Umsatzsteuer\".",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "gziur0v",
                    "author": "Ranzratte3",
                    "score": 1,
                    "created_utc": 1622042470.0,
                    "response": "As the fellow redditor already said every exchange of your bitcoin to another good is a taxable event (doesn't matter if you sell it for euros, lambos or other cryptos). But after a holding time of 1 year you are fine.  \n\nBetter grab an excel sheet an write down all your buys and sells with its date so you can calculate your profits (using FIFO - first in first out) to enter in your tax declaration (Anlage Sonstige Einkünfte -> Private Veräußerungsgeschäfte). There are also websites helping like cointracking.info but I personally don't use them and don't know how good they are.  \nThe exchanges usually have KYC (know your customer) so they could provide the Finanzamt with your trading data so don't try not declaring your trades. Also keep a good record of your trades, the Finanzamt will always ask for them as proof when declaring crypto trades. At least it was 5 years in a row now for me.  \nIn a nutshell: Don't trade to often, you will have a shitload of work to do when you don't hold onto for a year. Up to 600€ per year are \"steuerfrei\" but if you get above it you have to pay taxes on ALL your profits. Not just the profit above 600€.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "gzivqek",
                            "author": "driedDates",
                            "score": 1,
                            "created_utc": 1622042865.0,
                            "response": "So if a bought some shit coin for a couple euros, then traded them for some more reliable project and then hold these coins for more then a year, they can’t tax the initial trade I made ?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "gzix3k7",
                                    "author": "Ranzratte3",
                                    "score": 1,
                                    "created_utc": 1622043420.0,
                                    "response": "The trade of your shitcoin to the reliable project is taxable since you sold the shitcoin. Just buy the reliable project directly with euro, hold it for more than a year and you don't have to pay taxes.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "gzk16fj",
                    "author": "Zwiada",
                    "score": 1,
                    "created_utc": 1622060046.0,
                    "response": "If you have only a few trades you can also have a look at \nhttps://cryptotax.io/\n\nExchanges like Coinbase Pro provide an excel overview including all your trades. You can simply import those sheets in cryptotax and they do the maths. But it's only free for 25 transactions / year or less.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}