{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uxehk5",
            "title": "How did you guys first hear of Bitcoin?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/uxehk5/how_did_you_guys_first_hear_of_bitcoin/",
            "author": "SwurveMan",
            "created_utc": 1653475039.0,
            "score": 1,
            "num_comments": 28,
            "subreddit": "BitcoinBeginners",
            "selftext": "By accident or told by a friend, comment what led you to this Decentralised Rabbithole.",
            "stickied": false,
            "comments": [
                {
                    "id": "i9zmi3l",
                    "author": "Villifraendi",
                    "score": 3,
                    "created_utc": 1653515003.0,
                    "response": "2014, dad was talking about how people are getting dumber and dumber and that it will bankrupt those who buy a fake coin. In 2015 I started spending half my salary every month on buying it and have been doing it with a fixed amount ever since just to piss him off. Fuck you dad.\n\nI've never sold any of it and don't plan on doing so since I don't really need to, I've got a nice job, a small apartment, my computer and my cat Peanut.\n\nFuck you dad, again.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia0ifh8",
                            "author": "Parking-Secretary-87",
                            "score": 1,
                            "created_utc": 1653529735.0,
                            "response": "Fkn funny man..yet thats ur reality, but from the outside, the wording and gag effect is perfect. Good job friend",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9x4vum",
                    "author": "bigeyedfish041",
                    "score": 2,
                    "created_utc": 1653475972.0,
                    "response": "Mt Gox",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9x62vo",
                    "author": "Hussard_Fou",
                    "score": 2,
                    "created_utc": 1653476826.0,
                    "response": "In 2013 a classmate of mine told me about it. He had been mining and had around a 100 BTC at the time. I found it interesting, tried to mine but the internet connection at my university housing was so shitty that I couldn't. So it slept out of my mind until 2019 when there was this whole fuzz around BTC. \n\nNeedless to say that I regret to not have looked into it a little deeper at that time.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia0i7k1",
                            "author": "Parking-Secretary-87",
                            "score": 1,
                            "created_utc": 1653529629.0,
                            "response": "Where is that 100 btc friend, by curiosity?😆",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia19u4z",
                                    "author": "Hussard_Fou",
                                    "score": 1,
                                    "created_utc": 1653545714.0,
                                    "response": "Ahah no idea, and he was selling his BTC when he wanted to buy something, so he probably doesn't have 100 BTC anymore",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "ia167qx",
                            "author": "ouyangnna",
                            "score": 1,
                            "created_utc": 1653542979.0,
                            "response": "Then won't you be sad to death?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia19xan",
                                    "author": "Hussard_Fou",
                                    "score": 1,
                                    "created_utc": 1653545782.0,
                                    "response": " No, simply because I am sure I would never have waited for btw to have reach its ath before selling. Probably would have sold a 1k or something",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9xf651",
                    "author": "MrQ01",
                    "score": 2,
                    "created_utc": 1653482283.0,
                    "response": "Probably on the news somewhere, or some internet forum. Sure I heard about it before the 2018 hype-fest, but it still would have been a household name even if nobody understood it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9xohxz",
                    "author": "azraelle_178",
                    "score": 2,
                    "created_utc": 1653486790.0,
                    "response": "Heard it first from a friend here in Canada. I was a total noob back then and now, I trade, buy and sell cryptos through Netcoins. Had the best gains ever since I started trading with them.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9xuaky",
                    "author": "never-give-up-every1",
                    "score": 2,
                    "created_utc": 1653489288.0,
                    "response": "I heard about bitcoin in 2018 By Elon musk, I start to research it because I am confused and, to be honest, it was hard because there is just a little information about it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9xveah",
                    "author": "BenTG",
                    "score": 2,
                    "created_utc": 1653489746.0,
                    "response": "Reddit.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9y41g8",
                    "author": "igadjeed",
                    "score": 2,
                    "created_utc": 1653493234.0,
                    "response": "I was born knowing about Bitcoin  \n\nThese personal questions have an element of interrogation, as if you're a law enforcement intern collating dossiers on Reddit users. They don't really belong in a beginners' forum",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9x3ncw",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653475039.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9y427x",
                    "author": "UncagedAngel19",
                    "score": 1,
                    "created_utc": 1653493242.0,
                    "response": "I found out about it in 2020 when I was 18. I asked my mom about it and she knew when it first came out but decided to not invest in it. Worst mistake she ever made",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9yb0yu",
                    "author": "Ok_Memory_1842",
                    "score": 1,
                    "created_utc": 1653495967.0,
                    "response": "My homie used it in the black market to purchase some stuff. It was 600 dollars. I was with him a few weeks after and it was 800 I was so confused about it. Then forgot until the whole crypto craze",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia169ie",
                            "author": "ouyangnna",
                            "score": 1,
                            "created_utc": 1653543015.0,
                            "response": "Then won't you be sad to death?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9yefhq",
                    "author": "BitFunky1990",
                    "score": 1,
                    "created_utc": 1653497288.0,
                    "response": "On the BoingBoing dot net blog in 2010 or 2011.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9z556h",
                    "author": "AnonSA52",
                    "score": 1,
                    "created_utc": 1653507812.0,
                    "response": "It was a picturesque day in 2012. I was in first year. I went to my stoner buddy's house. He was on Silk Road trying to hookup the gnarliest lsd from spain. I asked him how the f was he going to get it to south africa (my country). Easy he says. They will just mail it lol.   \n  \nOk... so how are you going to pay for it?  \n  \nWith bitcoin bruh. My uncle bought some and gave me 10 btc.     \n\nMy buddy went on to spend all of his 10 btc on lsd from spain. If only we could have predicted the future lol",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia0hiwl",
                    "author": "MichaelFackrell4",
                    "score": 1,
                    "created_utc": 1653529312.0,
                    "response": "While working as a contractor at Texas Instruments 2007-2008. I was hanging out with engineers who designed semiconductors for stuff like calculators.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}