{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "usi791",
            "title": "Are you using the CFTC report in your trading 🤔",
            "url": "https://www.reddit.com/r/Bitcoin/comments/usi791/are_you_using_the_cftc_report_in_your_trading/",
            "author": "ErosTHE",
            "created_utc": 1652895115.0,
            "score": 1,
            "num_comments": 0,
            "subreddit": "Bitcoin",
            "selftext": "Hello to all traders out there.\n\nI know that it is not the best tool, however do you use the CFTC report in your trading ?",
            "stickied": false,
            "comments": []
        },
        {
            "id": "usiaqf",
            "title": "Public Reminder: Not Your Keys, Not Your Coins",
            "url": "https://cryptosec.info/nyknyc",
            "author": "EZLIFE420",
            "created_utc": 1652895381.0,
            "score": 6,
            "num_comments": 3,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i93pw6y",
                    "author": "coinfeeds-bot",
                    "score": 1,
                    "created_utc": 1652897733.0,
                    "response": "tldr; Since Bitcoin and most cryptocurrencies are pseudonymous, hackers can potentially get away with hacking these exchanges, running away with huge amounts of money from the exchanges’ users with them. The only way to combat this issue is to use reputable non-custodial wallets and to learn how to protect yourself from hackers and scammers.\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i93ygd3",
                    "author": "sylsau",
                    "score": 1,
                    "created_utc": 1652901237.0,
                    "response": "The Golden Rule to remember again and again: Not Your Keys, Not Your Bitcoin.\n\nGet your Bitcoin off the exchanges and take control of your money.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i95vq3k",
                    "author": "jkkkiiu9",
                    "score": 1,
                    "created_utc": 1652932828.0,
                    "response": "🔥 DINOSTEP.APP 🔥\n\n🦖 The First Move To Earn App With Virtual Dinosaurs\n👟 Earn while building healthy habits with the Dino\n✨ Varied NFTs\n💵 Passive Income Features\n💎 App Activation Code & NFT Drop For Fair Launch Contributors\n\n🚀 Fair Launch Starts On May 9th",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "usi6wt",
            "title": "Taxable Event?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/usi6wt/taxable_event/",
            "author": "TownConscious",
            "created_utc": 1652895088.0,
            "score": 3,
            "num_comments": 20,
            "subreddit": "Bitcoin",
            "selftext": "If I pay for something (bitcoin Boston 2023 for example) is that considered a taxable event if I use the lightning network?",
            "stickied": false,
            "comments": [
                {
                    "id": "i93m63l",
                    "author": "UranusisGolden",
                    "score": 6,
                    "created_utc": 1652896245.0,
                    "response": "Yes. \n\n\nConverting crypto to other crypto \n\nConverting crypto to fiat\n\n\nPaying services or goods with crypto\n\n\nAll those are taxable events (in usa)",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i93njna",
                            "author": "TownConscious",
                            "score": 2,
                            "created_utc": 1652896794.0,
                            "response": "Thank you good sir.  I have a cost basis of about 40K.  I wonder if that will have any effect on taxes if I buy something with bitcoin since the price is currently around 30K.  It’s all very complicated!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i93pjvi",
                                    "author": "UranusisGolden",
                                    "score": 5,
                                    "created_utc": 1652897595.0,
                                    "response": "It's not. \n\n\nLet me put you an example. \n\n\nYou bought 1 btc for 40k. If you sell for 30k it is a taxable event. You will then create a loss because your cost basis was higher than your proceeds. \n\n\nNow you have a 10k tax loss and if I am not mistaken you can use 3k a year to offset your loss. That means that if your total yearly taxable income is 50k, your tax burden will only cover 47k, 47k, 47k, 49k. The next 4 taxable years you can reduce your tax burden by that realized loss. You will carry 3k, 3k, 3k and finally 1k of that tax loss to reduce your tax burden\n\n\nVery likely someone will agree with this or comment on what I got wrong.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i93ug5u",
                                            "author": "TownConscious",
                                            "score": 2,
                                            "created_utc": 1652899598.0,
                                            "response": "very well explained, thanks.  ive never sold or spent a dime of my bitcoin since getting into it, and the community seems to be obsessed with this \"hodl\" stuff.  I'm very hesitant to even spend 250$ of it yet i own like 1.2btc and dca into 500$ a week.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i93xukg",
                                                    "author": "UranusisGolden",
                                                    "score": 1,
                                                    "created_utc": 1652900985.0,
                                                    "response": "I stopped selling in 2018. Holding doesn't require reporting",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i95rws9",
                                            "author": "udevil2",
                                            "score": 2,
                                            "created_utc": 1652930719.0,
                                            "response": "Small caveat, you can only offset capital gain with capital losses. So you can’t offset it with your “salary”. Maybe that was clear but thought I’d clarify.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i93nr66",
                                    "author": "Lovemindful",
                                    "score": 3,
                                    "created_utc": 1652896878.0,
                                    "response": "You would take a loss if using first in first out cost basis",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i97ht7p",
                            "author": "BetterRecognition868",
                            "score": 1,
                            "created_utc": 1652971611.0,
                            "response": "using other cryptocurrencies may constitute a taxable capital gains event for small purchases, but using Bitcoin would not since it has legal status as a foreign currency",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i97sgxu",
                                    "author": "UranusisGolden",
                                    "score": 0,
                                    "created_utc": 1652975991.0,
                                    "response": "Not in usa",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i98pu4l",
                                            "author": "BetterRecognition868",
                                            "score": 1,
                                            "created_utc": 1652989507.0,
                                            "response": "care to elaborate? Bitcoin must be legally regarded as a foreign currency by the United States government, since it is legal tender in at least one foreign nation whose government it recognizes as legitimate",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i99o7ni",
                                                    "author": "UranusisGolden",
                                                    "score": 0,
                                                    "created_utc": 1653006171.0,
                                                    "response": "Those are the rules of foreign nations, not the usa.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i99tyug",
                                                            "author": "BetterRecognition868",
                                                            "score": 1,
                                                            "created_utc": 1653009055.0,
                                                            "response": "What? The United States has rules regarding foreign currencies. Within the United States, Bitcoin is a foreign currency.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i99umb6",
                                                                    "author": "UranusisGolden",
                                                                    "score": 1,
                                                                    "created_utc": 1653009375.0,
                                                                    "response": "You need to read more about the topic. Smh. \n\n\nhttps://www.irs.gov/businesses/small-businesses-self-employed/virtual-currencies\n\n\nWhat is Virtual Currency?\nVirtual currency is a digital representation of value that functions as a medium of exchange, a unit of account, and/or a store of value. In some environments, it operates like “real” currency (i.e., the coin and paper money of the United States or of any other country that is designated as legal tender, circulates, and is customarily used and accepted as a medium of exchange in the country of issuance), but it does not have legal tender status in  the U.S. Cryptocurrency is a type of virtual currency that utilizes cryptography to validate and secure transactions that are digitally recorded on a distributed ledger, such as a blockchain.\n\nVirtual currency that has an equivalent value in real currency, or that acts as a substitute for real currency, is referred to as “convertible” virtual currency. Bitcoin is one example of a convertible virtual currency. Bitcoin can be digitally traded between users and can be purchased for, or exchanged into, U.S. dollars, Euros, and other real or virtual currencies.\n\nTax Consequences\nThe sale or other exchange of virtual currencies, or the use of virtual currencies to pay for goods or services, or holding virtual currencies as an investment, generally has tax consequences that could result in tax liability.\n\nThe IRS issued IRS Notice 2014-21, IRB 2014-16, as guidance for individuals and businesses on the tax treatment of transactions using virtual currencies.\n\nThe IRS also published Frequently Asked Questions on Virtual Currency Transactions for individuals who hold cryptocurrency as a capital asset and are not engaged in the trade or business of selling cryptocurrency.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i99v8gc",
                                                                            "author": "BetterRecognition868",
                                                                            "score": 1,
                                                                            "created_utc": 1653009677.0,
                                                                            "response": "Bitcoin is accepted as legal tender in certain countries now, meaning that in the specific case of Bitcoin (not all cryptocurrency), the United States rules regarding foreign currencies apply. \n\nThose rules include provisions for facilitating ease in making small purchases using foreign currencies \n\nCongress is also working to apply a version of those rules to all cryptocurrencies, allowing for small every day purchases to not be counted as capital gains tax events",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i93q7nw",
                    "author": "dlq84",
                    "score": 2,
                    "created_utc": 1652897861.0,
                    "response": "Tax is technology agnostic.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i93ukg9",
                            "author": "TownConscious",
                            "score": 0,
                            "created_utc": 1652899649.0,
                            "response": "thats exatly why i dont want to \"F\" with it at all, my accountant likely thinks the same",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i948u2o",
                    "author": "SmoothGoing",
                    "score": 0,
                    "created_utc": 1652905465.0,
                    "response": "Yes. See irs.gov",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}