{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "v1c8wo",
            "title": "How much BTC could I manage to accumulate over the next 2 years. (Also my 30 year plan)",
            "url": "https://www.reddit.com/r/Bitcoin/comments/v1c8wo/how_much_btc_could_i_manage_to_accumulate_over/",
            "author": "bumblebrutis11",
            "created_utc": 1653951718.0,
            "score": 0,
            "num_comments": 15,
            "subreddit": "Bitcoin",
            "selftext": "The answer here is nobody knows.\n\nMy target is to put 12.5k dollars (dirty fiat) into BTC by EoY starting september when i’ll have the funds to do that. essentially buying 3k btc a month for 4 months. I’m lump summing here because the bottom will hopefully be roughly around this time but I could miss the bottom over summer period which is a possibility.\n\nAfter this i’ll DCA in total another 5k in 2023 ready for the next Btc halving where using extrapolation, from the halving it should roughly 2/3x ROUGHLY turning 15k dollars into 45k bare in mind it could be more if i’m buying at the bottom so let’s say 60k. Remember I can’t predict the market.\n\nMy target is 0.5 Btc by January 2024 and 0.65 Btc by 2030. \n\nRealistically, by 2024 and in total putting in 15k dollars into BTC, could I reach my target of 0.5 Bitcoin? \n\n30 year plan:\n\nIf BTC got to let’s say 50% of the gold market cap by 2030 with a price of about 335/400k, 350*0.65 = 227k. Rough maths i know. If 100% market cap then 500k so let’s say 150-500k dollars by 2030. \n\nLet’s say I sell BTC by then and diversify into stocks property and staking with an average return of 6% yearly compound interest saving 5k a year into investments for the next 20 years assuming 2% inflation, I could turn the 200k into 3.3 million dollars and then live off passive income and retire by 50.\n\nOr sell not all BTC, have 20% BTC, 20% stocks, 20% property etc but still compound interest to 3.3m\n\nAm I crazy? I know I KNOW this is so many assumptions but 0.65 Btc could be life changing. I need *perspective*",
            "stickied": false,
            "comments": [
                {
                    "id": "ialn48e",
                    "author": "The-Francois8",
                    "score": 5,
                    "created_utc": 1653953057.0,
                    "response": "So:\n\nStep 1: turn 20k into 230k… in 7.5 years\n\nStep 2: sell this asset to acquire something aiming for a 6.5% annual return",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ialnrlb",
                            "author": "bumblebrutis11",
                            "score": 2,
                            "created_utc": 1653953393.0,
                            "response": "yea you’re right that sounds rather dumb. it would be interesting how btc does in 20 years. How much could it grow. My reasoning to sell was to create passive income that’s all. Btc wouldn’t be passive income. thank you tho. what do you recommend then?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ialnwbj",
                                    "author": "The-Francois8",
                                    "score": 1,
                                    "created_utc": 1653953462.0,
                                    "response": "It may not be popular here, but I think investing in dividend stocks monthly, along with BtC is a good strategy.\n\nLook into DRiPs.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ialqtpv",
                                            "author": "bumblebrutis11",
                                            "score": 1,
                                            "created_utc": 1653954998.0,
                                            "response": "will do thanks!",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "iambrxu",
                                            "author": "ideas4mac",
                                            "score": 1,
                                            "created_utc": 1653965810.0,
                                            "response": "Take a look at VYM or DVY.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "ialsdbt",
                                    "author": "DownRodeo404",
                                    "score": 1,
                                    "created_utc": 1653955804.0,
                                    "response": "If bitcoin gets to those prices, then I'm sure there are platforms or entities you can loan your bitcoin through.   Be your own bank.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ialsgtp",
                                            "author": "bumblebrutis11",
                                            "score": 1,
                                            "created_utc": 1653955855.0,
                                            "response": "do u think it can reach that price?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ialsrx4",
                                                    "author": "DownRodeo404",
                                                    "score": 1,
                                                    "created_utc": 1653956014.0,
                                                    "response": "Want or think?   \n\nNo one knows anything, but I think we will know more about bitcoins stance in the world over the next 4 to 5 years.   \n\nI think, if bitcoin takes the market cap of gold.... it would take 10 or so years.    It's a long play.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ialud4r",
                    "author": "NiceDoctorBeam",
                    "score": 2,
                    "created_utc": 1653956835.0,
                    "response": "...*about... tree fiddy*",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iamgzu5",
                            "author": "BTC_Deepfuckvalue",
                            "score": 1,
                            "created_utc": 1653968830.0,
                            "response": "Hahaha came here to say this",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ialwstt",
                    "author": "Halo22B",
                    "score": 1,
                    "created_utc": 1653958068.0,
                    "response": "If your that commited go get a personal loan from the bank for 15k. As soon as your able start dropping 1000k a month...even at 8% your only looking at maybe an extra 2 months of payments.\nAny extra dollars just regular DCA.\nSo January 1 2024, you are a debt free half coiner at the very least.\nOnly do this is if you have a guaranteed income to cover the debt and you have the stomach for another 50% drop.\nGood Luck",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "iam0chz",
                            "author": "bumblebrutis11",
                            "score": 2,
                            "created_utc": 1653959880.0,
                            "response": "never take a loan out for crypto, but yea if income is guaranteed it could work",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ian5cr1",
                    "author": "nomorefappening",
                    "score": 1,
                    "created_utc": 1653987866.0,
                    "response": "It’s not popular here because it’s not without risk but lending Bitcoin will give you some extra Bitcoin interest.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ian8ypm",
                    "author": "lightbulb-7",
                    "score": 1,
                    "created_utc": 1653991130.0,
                    "response": "Only future will tell. \n\nBut if Bitcoin is going to be the global monetary system it is aiming to, probably just from a financial perspective it will be unwise to diversify at any point into stocks and real estate. Irrespective of the amount of Bitcoin you might hold.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}