{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "tzby91",
            "title": "\"It's time to check your financial privilege\"- Bitcoin",
            "url": "https://v.redd.it/2fsn0r802ds81",
            "author": "ohnoh18",
            "created_utc": 1649447985.0,
            "score": 1726,
            "num_comments": 172,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i3y6v89",
                    "author": "NiceDoctorBeam",
                    "score": 166,
                    "created_utc": 1649450453.0,
                    "response": "To whomever made this: ***THANK YOU!***",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i43iq9o",
                            "author": "wjtwww",
                            "score": 1,
                            "created_utc": 1649547195.0,
                            "response": "This is Amazing. This short video is more educational than many big videos.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i3y6kgs",
                    "author": "N_Kripted",
                    "score": 96,
                    "created_utc": 1649450334.0,
                    "response": "This highlights one of the most critical points of cryptocurrency/decentralization that so many people fail to understand. Great stuff!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i420auv",
                            "author": "JASONmoers",
                            "score": 3,
                            "created_utc": 1649523784.0,
                            "response": "People will get it, they might ignore it now. They won't be Able to do it for long.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i3yehbs",
                    "author": "Ferdo306",
                    "score": 69,
                    "created_utc": 1649453511.0,
                    "response": "Wow great work\n\nThe true message is often lost with all the lambos and FUD stuff that comes with BTC\n\nWe should remember the basics",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i3yjeqh",
                    "author": "dfunkmedia",
                    "score": 58,
                    "created_utc": 1649455555.0,
                    "response": "10/10\n\n\"Yes, [we will not find a solution to political problems in cryptography,] but we can win a major battle in the arms race and gain a new territory of freedom for several years.\nGovernments are good at cutting off the heads of a centrally controlled networks like Napster, but pure P2P networks like Gnutella and Tor seem to be holding their own.\" - Satoshi Nakamoto",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i40s3xc",
                            "author": "Polumuzh",
                            "score": 4,
                            "created_utc": 1649502823.0,
                            "response": "Yep, this video is 10 on 10. This is really educational stuff right here.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i3y3qb0",
                    "author": "fiercygoat",
                    "score": 78,
                    "created_utc": 1649449217.0,
                    "response": "Very well made",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i415n9f",
                            "author": "schwipps",
                            "score": 2,
                            "created_utc": 1649510845.0,
                            "response": "Yep, I see really less stuff like this. Should be seeing more of this tho.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i3yi64a",
                    "author": "PerformanceVarious45",
                    "score": 29,
                    "created_utc": 1649455038.0,
                    "response": "Need more quality content like this!!!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i40y2hr",
                            "author": "jasonrobertm",
                            "score": 1,
                            "created_utc": 1649506749.0,
                            "response": "Yep, this sub would be really amazing if we had more stuff like this.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i3z2utc",
                    "author": "duckofdeath87",
                    "score": 24,
                    "created_utc": 1649464182.0,
                    "response": "And for those lucky 13%, we are always less than a single generation away from losing these structures. Only a few votes and its all gone",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i3yvfgh",
                    "author": "electriccars",
                    "score": 10,
                    "created_utc": 1649460768.0,
                    "response": "This is extremely well made. Is there a YouTube link?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i40r1p3",
                            "author": "No-Statistician133",
                            "score": 4,
                            "created_utc": 1649502041.0,
                            "response": "https://youtu.be/cR4sMsI8z7U",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i3y6eij",
                    "author": "ForbiddenFruit91",
                    "score": 61,
                    "created_utc": 1649450267.0,
                    "response": "People this smart can't be this stupid. Every one of these puppets has a hidden agenda, and I can assure you it's not in the interest of the people.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i3yfsn6",
                            "author": "nmolanog",
                            "score": 31,
                            "created_utc": 1649454052.0,
                            "response": "Exactly. They are not ignorant, nor they just don't understand how Bitcoin works. They already know. And is a matter of fact that Bitcoin is against they interests. And they will do whatever is in their hands and pockets to stop it.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i3z4c6w",
                                    "author": "TrymWS",
                                    "score": -8,
                                    "created_utc": 1649464897.0,
                                    "response": "If they were smart, they’d long it beyond expectations, and dump on FOMO plebs.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i3zyjid",
                                            "author": "Explodicle",
                                            "score": 4,
                                            "created_utc": 1649480487.0,
                                            "response": "_Nobody_ is smart enough to predict when and by how much the price will increase. These guys didn't get where they are today by taking risks in a level playing field.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i400u1o",
                                                    "author": "TrymWS",
                                                    "score": -4,
                                                    "created_utc": 1649481980.0,
                                                    "response": "I never said they had to predict anything.\n\nI said they could make the bull market and create the top.\n\nIt’s not a level playing field, when a few people have enough to move the market.\n\nBut it’s adorable that you think it is. 🥳",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i401z4b",
                                                            "author": "Explodicle",
                                                            "score": 1,
                                                            "created_utc": 1649482747.0,
                                                            "response": "I think the part where we disagree is whether or not wagering on manipulation is a sure thing in the absence of bailouts.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i4067iv",
                                                                    "author": "TrymWS",
                                                                    "score": -1,
                                                                    "created_utc": 1649485671.0,
                                                                    "response": "I never said anything was a sure thing either.\n\nBut for a few ultra wealthy people bundled together, manipulating a market of BTCs size with leverage and crashing it even harder with the profits to destabilize confidence, would certainly be far from impossible.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i41im4p",
                                                                            "author": "Explodicle",
                                                                            "score": 0,
                                                                            "created_utc": 1649516636.0,
                                                                            "response": "One of those future events that's neither a prediction nor a sure thing, cool.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i43h9m3",
                                                                                    "author": "TrymWS",
                                                                                    "score": 0,
                                                                                    "created_utc": 1649546521.0,
                                                                                    "response": "You probably need to stop making shit up in your own head about what other people are saying.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i43nwlz",
                                                                                            "author": "Explodicle",
                                                                                            "score": 0,
                                                                                            "created_utc": 1649549648.0,
                                                                                            "response": "Pick one",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i3zlgsk",
                            "author": "ICumCrypto",
                            "score": 11,
                            "created_utc": 1649473173.0,
                            "response": "Being intelligent doesn't automatically make one insightful or wise. Additionally, I can imagine success and wealth leading one away from insight.\n\nIs Charlie Munger really asking himself why he finds Bitcoin disgusting? Has he intentionally done any shadow work? Is he interested in the psychology or phenomenology of disgust? I honestly don't know, but I doubt it.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i3ztx36",
                            "author": "Sino13",
                            "score": 7,
                            "created_utc": 1649477674.0,
                            "response": "They are also a previous generation whose massive wealth was been built and multiplied upon traditional finance/fiat rails. Their perspective likely resembles “if it isn’t broke then don’t fix it”. Not to mention they’re long in the tooth without much to gain with something perceived as “risky” as BTC (or any crypto). \n\nI wouldn’t bet against them having an agenda but I suspect there’s more at play than that. Seems like the 1% who’s under 65 years old are far more supportive bc they have much more to gain and definitely have their own agendas. Hell, they have another 30-60 years of wealth multiplication ahead of them that BTC will fuel compared to the small amount of time remaining for Gates, Buffet, Munger, etc.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i437env",
                                    "author": "second-last-mohican",
                                    "score": 1,
                                    "created_utc": 1649542045.0,
                                    "response": "It would have been the same with gold to oil.\n\nGold is mined and hard to find.. Oil was in parts just coming up out of the ground and seemed endless like water.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i3yinmt",
                    "author": "suuperfli",
                    "score": 27,
                    "created_utc": 1649455241.0,
                    "response": "great vids as always from Human Rights Foundation / Alex Gladstein \n\nhere are two more:  \n[Bitcoin Is Protecting Human Rights Around the World](https://www.youtube.com/watch?v=xLYYh4aPXAM)  \n[Bitcoin: 'A Weapon for Us To Fight Oppression](https://www.youtube.com/watch?v=zYs-j6Wx-hs)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i3yjira",
                    "author": "Tebasaki",
                    "score": 7,
                    "created_utc": 1649455600.0,
                    "response": "Great watch!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i3ywdc8",
                    "author": "enterusername34",
                    "score": 9,
                    "created_utc": 1649461190.0,
                    "response": "In these countries, how do they use btc to pay for ... food? Genuinely curious.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i40l9z2",
                            "author": "diradder",
                            "score": 5,
                            "created_utc": 1649497448.0,
                            "response": "Unlike what others answered, Cash App is only available in USA and UK, so it's unlikely that they use it.\n\nThe video explains how one of the people operates with their business, they have setup a [BTC Pay Server](https://btcpayserver.org/), to receive payments. So customers can pay them with BTC without any intermediary. That's already a pretty advanced way to receive Bitcoin.\n\nWithout this kind of infrastructure (which helps with more than just receiving Bitcoin), you can still use Bitcoin wallets and preferably ones that support the Lightning Network (Electrum, Phoenix, Eclair, etc.) to pay in a Peer-to-Peer manner. In other words directly from your wallet to the person you want to pay. All they have to do is press \"Receive\" on their wallet, show you the QR code of their address and you scan it with your wallet. Again, no intermediary that can block this.\n\nAs to whom accepts to receive Bitcoin in exchange for food, I would guess necessity is the mother of invention, when your government is oppressive or irresponsible with your country's currency you will find ways to escape this. If you can't leave, you'll adapt and use better forms of money, Bitcoin is one that is very difficult to censor.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i40qccj",
                                    "author": "enterusername34",
                                    "score": 1,
                                    "created_utc": 1649501498.0,
                                    "response": "> If you can't leave, you'll adapt \n\n\" If you can't leave, you'll adapt \" \n\nI agree...\n\nbut still wondering who is accepting bitcoin for food in these countries... even if they did, would the supplier to the shop accept bitcoin, etc...",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i43irjj",
                                            "author": "diradder",
                                            "score": 1,
                                            "created_utc": 1649547211.0,
                                            "response": "The person selling food also wants to escape a devaluing fiat money, so they are more prone to accept Bitcoin, USD, or anything else really, ultimately their supplier too. We're talking about failing systems, if you run a business you can't just \"deal with it and hope it passes\" if it lasts.\n\nIt's certain that the switch, even for a foreign currency is not easy, and the technical hurdles of Bitcoin can hinder it even more, but as these people testify it seems to be a viable alternative for them. One that is out of the reach of their government's control too. Before Bitcoin I'm not sure what they would have done (barred from access to all foreign currencies), maybe they'd have used gold/barter which both have major cons (mainly they are not easily divisible and verifiable).",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i3z9iby",
                            "author": "kinstinctlol",
                            "score": 3,
                            "created_utc": 1649467376.0,
                            "response": "By using Cash App by lightning network.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i3z9xnu",
                                    "author": "enterusername34",
                                    "score": 3,
                                    "created_utc": 1649467574.0,
                                    "response": "sweet just looked it up, thanks! \n\nis this what the canadian truckers would have been using? \n\ncan cashapp freeze accounts?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i40h2a6",
                                            "author": "Liquids0ul",
                                            "score": 1,
                                            "created_utc": 1649494002.0,
                                            "response": "Not sure but even If they can do so you don’t have to put all you bitcoin there right you can cash out what you need to cash out and leave the majority on a hard wallet or so",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i43vlho",
                                    "author": "Bad_guy_eye",
                                    "score": 1,
                                    "created_utc": 1649553411.0,
                                    "response": "Apparently cash app is only available in the USA and UK",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i3zfi4c",
                    "author": "CryptoKnignt",
                    "score": 6,
                    "created_utc": 1649470225.0,
                    "response": "I invest in Bitcoin and crypto because decentralized finance is liberation to the people. Anyone trying to stop BTC probably doesn’t want liberation for working people.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i437sbh",
                            "author": "second-last-mohican",
                            "score": 1,
                            "created_utc": 1649542218.0,
                            "response": "Well banks and governments cant get their transaction fees and sales taxes.. so they are mainly against it",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i3yn77w",
                    "author": "JediElectrician",
                    "score": 6,
                    "created_utc": 1649457172.0,
                    "response": "Bitcoin can and will level the playing field without disrupting any of the technological advancements in our society.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i3ypfpb",
                    "author": "SHA256dynasty",
                    "score": 5,
                    "created_utc": 1649458135.0,
                    "response": "bravo",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i3zka11",
                    "author": "LowKeySalty_",
                    "score": 4,
                    "created_utc": 1649472575.0,
                    "response": "This can spread like wildfire. You can sway normal people with powerful stories. Great job to whoever made this!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i407o1t",
                    "author": "desert_biker",
                    "score": 7,
                    "created_utc": 1649486720.0,
                    "response": "Ethiopian here. The map is upside down 🙃 🤣 \n\nOther than that, great video. Inflation is hitting us hard right now and I hope we find a solution in bitcoin. Only a tiny fraction knows enough about bitcoin, and even less people actually own/use it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i3ym1yh",
                    "author": "cryptosareagirlsbf",
                    "score": 7,
                    "created_utc": 1649456679.0,
                    "response": "I've been looking for this. Thanks so much for posting!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i3yygn4",
                    "author": "__cnav__",
                    "score": 7,
                    "created_utc": 1649462142.0,
                    "response": "Beautiful",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i3ytv9z",
                    "author": "brrrettonwoods",
                    "score": 3,
                    "created_utc": 1649460076.0,
                    "response": "what's the source on this video???\n\nAmazing stuff",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i3z6b1v",
                            "author": "cryptosareagirlsbf",
                            "score": 3,
                            "created_utc": 1649465845.0,
                            "response": "I saw it as part of the live feed from the Bitcoin conference. I think it was the intro to when Alex Gladstein was on.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i3y7jux",
                    "author": "hyperinflationUSA",
                    "score": 10,
                    "created_utc": 1649450726.0,
                    "response": "Love this",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i3ydzvr",
                    "author": "Vegas_42",
                    "score": 12,
                    "created_utc": 1649453310.0,
                    "response": "Respect",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i3z3i4k",
                    "author": "DarrylAmulet",
                    "score": 3,
                    "created_utc": 1649464495.0,
                    "response": "Where is this from? Youtube link if anyone has it please",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i40r71e",
                            "author": "No-Statistician133",
                            "score": 2,
                            "created_utc": 1649502151.0,
                            "response": "https://youtu.be/cR4sMsI8z7U",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i41ufuc",
                                    "author": "DarrylAmulet",
                                    "score": 2,
                                    "created_utc": 1649521412.0,
                                    "response": "Thank you!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i3z9fqf",
                    "author": "acegarrettjuan",
                    "score": 3,
                    "created_utc": 1649467342.0,
                    "response": "This was the beat part of the conference so far I think.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i3zarc9",
                    "author": "ChrisCWgulfcoast",
                    "score": 3,
                    "created_utc": 1649467959.0,
                    "response": "Wow",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4042vw",
                    "author": "Sam_the_Hefer",
                    "score": 3,
                    "created_utc": 1649484215.0,
                    "response": "I don’t think many people, even in “dollar” countries, are even aware of exactly how much corruption thrives in their countries. In the USA for example, the rich use Wall Street to funnel billions out of the economy and effectively fleece taxpayers by getting payed-for politicians to help bail them out.\n\nAwareness needs to be spread.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i4043gg",
                            "author": "Paid-Not-Payed-Bot",
                            "score": 2,
                            "created_utc": 1649484226.0,
                            "response": "> by getting *paid-for* politicians to\n\nFTFY.\n\nAlthough *payed* exists (the reason why autocorrection didn't help you), it is only correct in:\n\n * Nautical context, when it means to paint a surface, or to cover with something like tar or resin in order to make it waterproof or corrosion-resistant. *The deck is yet to be payed.*\n\n * *Payed out* when letting strings, cables or ropes out, by slacking them. *The rope is payed out! You can pull now.*\n\nUnfortunately, I was unable to find nautical or rope-related words in your comment.\n\n*Beep, boop, I'm a bot*",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i429d8g",
                    "author": "0x1a3c3e7",
                    "score": 3,
                    "created_utc": 1649527423.0,
                    "response": "Just because a person is an expert doesn't mean they're honest.  Indeed, it's the experts I trust the least because they know best how to lie most convincingly.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i3ype3y",
                    "author": "seancollinhawkins",
                    "score": 2,
                    "created_utc": 1649458117.0,
                    "response": "\"I would short it if there was an easier way to do it\" \n\nTranslation: I don't understand technology enough to learn how to trade btc properly.\n\n\nHahha fuckin what? You can short bitcoin easier than you can stocks on the NYSE. Also not sure when that statement was made. Video is very well made nonetheless",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i3zz11i",
                            "author": "Explodicle",
                            "score": 3,
                            "created_utc": 1649480802.0,
                            "response": "Easier = platform where I have special treatment",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i405fdd",
                                    "author": "seancollinhawkins",
                                    "score": 2,
                                    "created_utc": 1649485150.0,
                                    "response": "Ah yes! And everyone else gets screwed. Atleast the little guys anyhow",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i40rie3",
                            "author": "undadatunda",
                            "score": 1,
                            "created_utc": 1649502381.0,
                            "response": "i think they built the 'easy' tools after bill said that and they get special privilages with places like blockfi and stuff where they get the bitcoin to do their dirty work\n\nfor all we know they are making 10 times what the bitcoiners are making..its a tricky world and the cream is going somewhere",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i3zbis1",
                    "author": "nifty_mick",
                    "score": 2,
                    "created_utc": 1649468322.0,
                    "response": "incredible, is this a snippet from a full documentary?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i3zckxg",
                    "author": "NefariousnessOk4619",
                    "score": 2,
                    "created_utc": 1649468816.0,
                    "response": "The animation reminds me of Metalocalypse",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i3zkcsr",
                    "author": "fuzzytradr",
                    "score": 2,
                    "created_utc": 1649472613.0,
                    "response": "This was excellent.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4017on",
                    "author": "Readanoi",
                    "score": 2,
                    "created_utc": 1649482234.0,
                    "response": "this is the best thing ever posted in this sub",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i401om9",
                    "author": "madmapguy",
                    "score": 2,
                    "created_utc": 1649482548.0,
                    "response": "Perfect explanation about BTC and how and where to use it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i40hqgf",
                    "author": "BadCurious429",
                    "score": 2,
                    "created_utc": 1649494556.0,
                    "response": "This video explains everything, thanks!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i40j2b9",
                    "author": "Sephire_2021",
                    "score": 2,
                    "created_utc": 1649495633.0,
                    "response": "BTC ✊🏻💫",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i40lm60",
                    "author": "-Bus-Driver",
                    "score": 2,
                    "created_utc": 1649497727.0,
                    "response": "Save this and link to anyone asking for crypto use case.\n\n #Level playing field",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i40wlgy",
                    "author": "hangfromthisone",
                    "score": 2,
                    "created_utc": 1649505846.0,
                    "response": "Bill can short my liggmma",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i41vqmp",
                    "author": "trumpshairspray",
                    "score": 2,
                    "created_utc": 1649521940.0,
                    "response": "They don't have the people's interest at heart.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i42mpzx",
                    "author": "onlimet",
                    "score": 2,
                    "created_utc": 1649532999.0,
                    "response": "This is awesome. To anyone whoever made this. Thanks.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i3y1g5t",
                    "author": "Consequenceplz",
                    "score": 5,
                    "created_utc": 1649448302.0,
                    "response": "I wonder if they think that kind of verbiage is really going to resonate with people at this point",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i3zb93x",
                    "author": "enraged768",
                    "score": 6,
                    "created_utc": 1649468192.0,
                    "response": "I always wonder how do the poorest of people even get btc. I mean I'm talking 30% of the world that can't even afford a cold wallet. Hell an actual phone. That's where btc falls short. I feel like people don't actually know how poor some people are. Theres people within this world and i've seen it in way more countries than id like to. There's places where people pay for kool-aid out of a sandwich baggie with a staw and a rubber band. These poor sons a bitches can't even afford rice. Btc means nothing to them, wallets means nothing to them, they just care about having enough currency to buy enough rice to live.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i3ziyr5",
                            "author": "mongartus",
                            "score": 5,
                            "created_utc": 1649471917.0,
                            "response": "Yeah btc is okay in developing countries where the currency is weak but they still have a disposable income. Because to buy btc you need a disposable income. Hell that doesn't even apply to a huge portion of people in developed countries. Your not buying bitcoin unless literally all your immediate bills and living expenses are paid and there is nothing else you need. You need access to technology like computers, an exchange which may require kyc docs that the poorest may or may not have, a bank to transfer payments into the exchange again which might not exist. Btc is primarily for middle class developed country participants looking to make returns. Right now in any case.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i40g64x",
                                    "author": "LayPessimist",
                                    "score": 1,
                                    "created_utc": 1649493278.0,
                                    "response": "Theres unfortunately a whole lot of prerequisites before one is able to buy BTC indeed.\n\nKYC bullshit even increases these requirements further and solely exists to make access to monetary instruments inaccessible to the underprivileged.\n\nTHAT is the whole reason KYC exists.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i3ywlgn",
                    "author": "Due_Percentage8276",
                    "score": 3,
                    "created_utc": 1649461290.0,
                    "response": "I cried to this😭",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i3zo7mv",
                    "author": "boominggem",
                    "score": 1,
                    "created_utc": 1649474572.0,
                    "response": "😂 except the banks own more bitcoin than the people. Bitcoin doesn’t bridge the gap nor does it help poor people.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i40aam6",
                            "author": "CallingVoid",
                            "score": 2,
                            "created_utc": 1649488705.0,
                            "response": "Except that it literally is helping people right now. Banks can hoard bitcoin all they like. You can still use bitcoin as an individual and use it however you please.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i3zjzfn",
                    "author": "Spartan3123",
                    "score": 1,
                    "created_utc": 1649472430.0,
                    "response": "Why is the face of the Muslim man blurred. Muhammad is that you?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i3zz3z4",
                            "author": "Explodicle",
                            "score": 2,
                            "created_utc": 1649480854.0,
                            "response": "So nobody recognizes him, duh.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i3zzusl",
                                    "author": "Spartan3123",
                                    "score": 1,
                                    "created_utc": 1649481340.0,
                                    "response": "I mean its an animation they could have drawn a generic Muslim man...",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i3zveyc",
                    "author": "anajoy666",
                    "score": 1,
                    "created_utc": 1649478550.0,
                    "response": "Great video but with respect to the very last part: don't assume malice where ignorance suffices. There is no point in making a powerful enemy when they could be your ally.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i3zzfwp",
                            "author": "Explodicle",
                            "score": 2,
                            "created_utc": 1649481068.0,
                            "response": "A billionaire monopolist will never, ever, start being your ally. They've been taking advantage of your benefit of the doubt for decades now - they aren't ignorant.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i3zzpzn",
                                    "author": "anajoy666",
                                    "score": -2,
                                    "created_utc": 1649481252.0,
                                    "response": "None of those people have taken advantage of me. They don’t need to be my “allies”, they just need to see the value of bitcoin.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i40177p",
                                            "author": "Explodicle",
                                            "score": 1,
                                            "created_utc": 1649482225.0,
                                            "response": "They did, for example as ruled in United States vs Microsoft.\n\nWhat did you mean when you said ally in the first place?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i4044ku",
                                                    "author": "anajoy666",
                                                    "score": 1,
                                                    "created_utc": 1649484248.0,
                                                    "response": "They did not take advantage of me. I guess I did use the term “ally” loosely, I meant “price goes up, freedom goes up”.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i41jvd8",
                                                            "author": "Explodicle",
                                                            "score": 1,
                                                            "created_utc": 1649517153.0,
                                                            "response": "You can keep just saying that, but monopolists do take advantage of you and literally everyone involved in their market. We'll never know how much better computers would have been by now, and what a difference that would have made in people's lives.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i41stu3",
                                                                    "author": "anajoy666",
                                                                    "score": 1,
                                                                    "created_utc": 1649520758.0,
                                                                    "response": "I could argue computer would be much worse too. It's easy to make claims with no data.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i42ptoy",
                                                                            "author": "Explodicle",
                                                                            "score": 1,
                                                                            "created_utc": 1649534344.0,
                                                                            "response": "The \"data\" are basic economics, it's a deadweight loss due to a monopoly.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i42tsob",
                                                                                    "author": "anajoy666",
                                                                                    "score": 1,
                                                                                    "created_utc": 1649536084.0,
                                                                                    "response": "Not data.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i42ylvb",
                                                                                            "author": "Explodicle",
                                                                                            "score": 1,
                                                                                            "created_utc": 1649538204.0,
                                                                                            "response": "Wow that completely revolutionizes what everyone thought about basic introductory economics.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i40rd0z",
                    "author": "67ITCH",
                    "score": 1,
                    "created_utc": 1649502271.0,
                    "response": "Used to watch and listen to videos of Warren Buffett. Then I read an article which quoted him saying something along the lines of \"it's a scam\" but when asked what he knows about it, he said, \"I don't know it, I don't understand it.\" I mean, come on... You jumped the scam bandwagon without researching and it. Lost all respect outright. This video brings to light why he's so scared of it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4136nv",
                    "author": "MaritimeMucker",
                    "score": 1,
                    "created_utc": 1649509596.0,
                    "response": "Bill Gates gives health advice while having flabby man breast so I wouldn't really listen to him anyhow.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i3zpszy",
                    "author": "FuggemAuhl_NoRubuh",
                    "score": -1,
                    "created_utc": 1649475417.0,
                    "response": "Lame",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i3zquet",
                            "author": "Hotsushiking",
                            "score": 2,
                            "created_utc": 1649475979.0,
                            "response": "Don’t talk about your username like that",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i3y2v9c",
                    "author": "unfuckingstopped",
                    "score": -10,
                    "created_utc": 1649448872.0,
                    "response": "i don't know what 'check your privilege' even means.  this element of shame that's supposed to be ascribed to privilege is really fucking dumb.  the implication is that your advantage equates to someone else's disadvantage. wrong. it's envy that makes people say this. there are infinite privileges to be had or created in the world. gain as much privilege as you can, and be proud of it because there's plenty to go around and endless more to be created. it's not a zero sum world. commies believe otherwise.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i3yjcq6",
                            "author": "life762",
                            "score": 13,
                            "created_utc": 1649455533.0,
                            "response": "I always considered it to simply mean you might be fortunate enough to take something for granted that others cannot.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i3yhti7",
                            "author": "cryptosareagirlsbf",
                            "score": 11,
                            "created_utc": 1649454892.0,
                            "response": ">i don't know what 'check your privilege' even means\n\nGoogle it, so you don't look like an ass pontificating on something you don't understand.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i3zy4vv",
                            "author": "New_Dawn",
                            "score": 2,
                            "created_utc": 1649480226.0,
                            "response": "I'm as anti-commie as they come but this is different. This is about equal opportunity not equal outcomes.\n\nIt's about a fair and just system that everyone can use to pursue their dreams. It's perfectly fine to overlay an honest capitalist system underwritten by Bitcoin-as-a-system. Plumbers, teachers, nurses, baby sitters should all be able to earn a living in a unit of account that benefits everyone. \n\nThose that are sitting on a mountain of dollars should not be throwing shade at Bitcoin but rather humbly giving it a thumbs up to do its thing.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i3z7xuw",
                            "author": "Geoknysis",
                            "score": 1,
                            "created_utc": 1649466631.0,
                            "response": "Well said. Too many people are brainwashed to drool and lockstep virtue signal support for anything that has negative connotation regarding a \"privilege\" of any sort. It's simply jealously as you outlined.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i3y5vye",
                            "author": "IndianaGeoff",
                            "score": -4,
                            "created_utc": 1649450063.0,
                            "response": "Esp since Bitcoin is mostly a rich economy thing and people in broken countries would rather have a Benjamin than Internet money when they don't have internet.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i3y74c3",
                                    "author": "NiceDoctorBeam",
                                    "score": 10,
                                    "created_utc": 1649450554.0,
                                    "response": "Wrong.\n\nThey want what you and I want: a fair chance.  Bitcoin is a huge step in that direction.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i3zzxcc",
                                            "author": "labenset",
                                            "score": 3,
                                            "created_utc": 1649481386.0,
                                            "response": "He's right about the people in poorer countries, though. They would much rather have usd in hand. I wish bitcoin were more accessible to them though. WU and other older methods are light-years behind crypto.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i4089wg",
                    "author": "asseesh",
                    "score": 0,
                    "created_utc": 1649487176.0,
                    "response": "You need stable country and economy to have cheap stable internet connection and thus bitcoin FFS.\n\nIt will take any government 5 mins to shut down internet if they want to. Good luck doing that with cash or gold.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i40umrf",
                            "author": "DeslerZero",
                            "score": 0,
                            "created_utc": 1649504592.0,
                            "response": "Someone else who sees the light.  Bitcoin is not the financial messiah, it's just a currency with some uses here and there.  It is not immune to human corruption or financial manipulation.\n\nYou might want it to be all these great things.  It sometimes is but just like regular currency it falls short when the right people want to use it to their own ends.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i3zsyyz",
                    "author": "IBRoln1",
                    "score": 1,
                    "created_utc": 1649477133.0,
                    "response": "This is Nikola Tesla energy",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i3zx6so",
                    "author": "New_Dawn",
                    "score": 1,
                    "created_utc": 1649479633.0,
                    "response": "LIBERATION TECHNOLOGY",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i40docu",
                    "author": "Tro_au",
                    "score": 1,
                    "created_utc": 1649491301.0,
                    "response": "Which countries are in the 13%",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i40gjgl",
                    "author": "Bitcoin__Hodler",
                    "score": 1,
                    "created_utc": 1649493579.0,
                    "response": "wages stagnate while there is 400% inflation? \ni guess not ;-)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i40tte9",
                    "author": "BidiBidiBommBomm",
                    "score": 1,
                    "created_utc": 1649504034.0,
                    "response": "Can’t be stopped….",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i40x6lt",
                    "author": "CryptoMiningUK",
                    "score": 1,
                    "created_utc": 1649506209.0,
                    "response": "Great video! Nice to see real-world adoption and something showing the true utility of bitcoin",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i40xjbv",
                    "author": "BeefSupreme2",
                    "score": 1,
                    "created_utc": 1649506425.0,
                    "response": "\"There is a war between the rich and the poor...and the rich are winning.\"\n\n-Warren Buffet",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i417akg",
                    "author": "DarthKoDa_",
                    "score": 1,
                    "created_utc": 1649511656.0,
                    "response": "Very well made. Bravo.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i419kar",
                    "author": "Lewis_0683",
                    "score": 1,
                    "created_utc": 1649512734.0,
                    "response": "Wow that's powerful",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i41d6ws",
                    "author": "According_Cow_5089",
                    "score": 1,
                    "created_utc": 1649514358.0,
                    "response": "Great video. \nBtcpay server, think this is the sort of thing I have been looking for. Thanks",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i41edk9",
                    "author": "paddyspubkey",
                    "score": 1,
                    "created_utc": 1649514865.0,
                    "response": "Beautiful.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i41llvv",
                    "author": "eve_of_distraction",
                    "score": 1,
                    "created_utc": 1649517860.0,
                    "response": "I mean Gates, Munger and Buffett are not just ignorantly privileged people, they're egomaniacal power-hungry psychopaths who know exactly how privileged they are and want to keep it that way.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i40d9h6",
                    "author": "caahel",
                    "score": -1,
                    "created_utc": 1649490973.0,
                    "response": "Very racist undertones in this video against whites",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i410lin",
                            "author": "g1utt0ny",
                            "score": 2,
                            "created_utc": 1649508205.0,
                            "response": "for what? for not including black billionaires who are against bitcoin?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i41gz5z",
                                    "author": "caahel",
                                    "score": 0,
                                    "created_utc": 1649515964.0,
                                    "response": "Every single clip in that video is \"white bad, nonwhite victim\"",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i4224n0",
                                            "author": "g1utt0ny",
                                            "score": 1,
                                            "created_utc": 1649524514.0,
                                            "response": "Read the title.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i3zou75",
                    "author": "PsychoSmurfx",
                    "score": -1,
                    "created_utc": 1649474904.0,
                    "response": "My worry is that without corporations spending $millions to run expensive (yet profitable) bitcoin farms, the whole system would fall apart. To be truly a solution for the poor, and truly decentralized, a change needs to be made there? I’m hoping for an honest discussion, not a religious (maxi) smack down.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i40b5i6",
                            "author": "CallingVoid",
                            "score": 3,
                            "created_utc": 1649489350.0,
                            "response": "It is actually a good thing, it means that the network is secured by real world costs. In order to attack bitcoin and make the network worthless for the poor, you'd first need to be willing to source (difficult) purchase (extremely expensive) and run the miners (also expensive). You would then have to sacrafice steady, almost guanateed profits on an attack that will ultimately probably fail (bitcoin has survived these attacks before).\n\nMiners should be seen as independent security contractors for bitcoin. They are rewarded to keep the network secure. The decentralisation of BTC is the business of node runners.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i42aioi",
                                    "author": "PsychoSmurfx",
                                    "score": 1,
                                    "created_utc": 1649527891.0,
                                    "response": "I really appreciate these points. I don’t mean do be all doom and gloom, but there is at least some risk of another world war right now. (Please don’t turn this thread political). What happens if instead of spending the capital to create new mines, the strategy is simply to disable the current $multimillion mines? In their absence, would every day people be able to take up that slack (IE affordability) without big negative ramifications to the network? Speed, security, etc.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i42hb21",
                                            "author": "CallingVoid",
                                            "score": 2,
                                            "created_utc": 1649530706.0,
                                            "response": "It would be a hit to network security of course because ASICS are just so efficient at turning energy into hashes. If ASICS become targets for malicious actors. Difficulty adjusts as required, so if ASICS get taken out then we can GPU mine until ASICS come back. If all GPUs get taken we can use CPUs, if there are no CPUs, GPUs and no ASICs left functioning in the world then I guess we've got bigger problems than bitcoin.\n\nIf ASICS are turned by a malicious actor to actively attack Bitcoin (in some kind of extremely clever, coordinated attack) then the nuclear option is to change the hashing algorithm from SHA256 and turn all bitcoin ASICS into expensive, ugly bricks. But that is a last resort.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i42w7dq",
                                                    "author": "PsychoSmurfx",
                                                    "score": 1,
                                                    "created_utc": 1649537148.0,
                                                    "response": "Thank you for you input. Much appreciated. That has helped clear things up for me.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i40p77g",
                            "author": "theSerotoninSqueeze",
                            "score": 1,
                            "created_utc": 1649500611.0,
                            "response": "The network could run on a single crusty computer from 2012 just fine if all other computers in the network were no longer mining or running a node.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i42901c",
                                    "author": "PsychoSmurfx",
                                    "score": 0,
                                    "created_utc": 1649527276.0,
                                    "response": "But at this point it isn’t. It runs by a means that without the rich, the poor can’t utilize the network. Is there something that can be done about that?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i43k6kr",
                                            "author": "theSerotoninSqueeze",
                                            "score": 1,
                                            "created_utc": 1649547864.0,
                                            "response": "The “poor” as you put, don’t need to mine Bitcoin to use the network. The network doesn’t care where you’re from or what your economic background is, it still exists to serve you. All that is needed is a node to record transactions. And running a node isn’t the same as mining. Cost almost nothing to build a node.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i44vano",
                                                    "author": "PsychoSmurfx",
                                                    "score": 1,
                                                    "created_utc": 1649572728.0,
                                                    "response": "If $million dollar mines are not needed, then why do they exist?",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i414fiq",
                    "author": "Geoknysis",
                    "score": 0,
                    "created_utc": 1649510243.0,
                    "response": "Lol, wtf was this?\n\nOkay let me check my financial privilege...\n\n*opens BTC wallet*\n\n*confirms BTC still there*\n\nMy ancestors fought for what I have now. You see that as 'privilege' but it's really the product of smart intergenerational decisions.\n\nIt's not our problem your ancestors chose to fuck monkeys, rape and pillage endlessly instead of actually build something for your society. It's now obviously up to you in the generational lineage to make better decisions going forward.\n\nUnfortunately all you made so far is a shitty cartoon blaming smarter and more successful generational lineages for the shortcomings of your own.\n\nIf you really do want to make a difference in your impoverished community, stop lashing out at others and projecting blame and hate. Start working with them and you'll find there are lots of financially 'privileged' people willing to share the fruits of their ancestors to help fix the shit decisions of yours.\n\nWould you consider people who have access to medicine to be medically 'privileged'? Medical knowledge comes from hard work, applied intellect, and coordination amongst society members. Plenty of organizations work to share medical as well as financial assistance to those more needy.\n\nYour use of the word 'privileged' is misguided and inappropriate as is the case for all lamesteam media brainwashed NPCs. Stop hating and start collaborating.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "urlkfz",
            "title": "古巨基 Leo Ku feat. 黃子華《子華說》[Official MV]",
            "url": "https://youtu.be/Hk_P6rfg_aU",
            "author": "n_n-v_v-z_z",
            "created_utc": 1652791255.0,
            "score": 1,
            "num_comments": 0,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "urlbu8",
            "title": "First Bitcoin meetup for nation states",
            "url": "https://i.redd.it/15d9eh7451091.jpg",
            "author": "CoinCorner_Sam",
            "created_utc": 1652790472.0,
            "score": 1872,
            "num_comments": 293,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8ycxuh",
                    "author": "killarnivore2",
                    "score": 118,
                    "created_utc": 1652800082.0,
                    "response": "This gathering happens yearly.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8yidc6",
                            "author": "Rokey76",
                            "score": 84,
                            "created_utc": 1652802348.0,
                            "response": "There was even a thread here yesterday debunking that this isn't some Bitcoin conference but a regular meeting with a rotating host, and El Salvador is the host this year. But here we are.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8z46cm",
                                    "author": "bornccy",
                                    "score": 6,
                                    "created_utc": 1652811169.0,
                                    "response": "I CAN SMELL THE FREEDOM FROM HERE , LETS FUCKING GO .",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i927smk",
                                            "author": "brown_matthew_n",
                                            "score": 1,
                                            "created_utc": 1652873510.0,
                                            "response": "I wish we had more insight into what happened! Cheers !",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i8ypjan",
                                    "author": "Wise_Recover9576",
                                    "score": 32,
                                    "created_utc": 1652805285.0,
                                    "response": "Maybe Bukele tweet had something to say about that!?\n\n\"Tomorrow, 32 central banks and 12 financial authorities (44 countries) will meet in El Salvador to discuss financial inclusion, digital economy, banking the unbanked, the #Bitcoin rollout and its benefits in our country.\"",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8yrpg1",
                                            "author": "PRMan99",
                                            "score": 37,
                                            "created_utc": 1652806157.0,
                                            "response": "Glad he is hijacking it a bit to tell countries about bitcoin.\n\nBut it's not the main purpose of the meeting.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i8yt279",
                                    "author": "never_safe_for_life",
                                    "score": 5,
                                    "created_utc": 1652806699.0,
                                    "response": "[https://twitter.com/caoimhinllc/status/1526406677716602880?s=20&t=uxMbqXl0n5XV9bg-2by5Pg](https://twitter.com/caoimhinllc/status/1526406677716602880?s=20&t=uxMbqXl0n5XV9bg-2by5Pg)\n\nNot seeing that on AFI calendar. https://afi-global.org/activities/events-calendar/ Looks like they're meeting in Costa Rica. Do you have a link?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8ywgkb",
                                            "author": "cliffyw",
                                            "score": 3,
                                            "created_utc": 1652808068.0,
                                            "response": "He replied with a [link ](https://www.afi-global.org/events/digital-financial-services-sme-finance-working-group-meeting/)",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i909hln",
                                                    "author": "never_safe_for_life",
                                                    "score": 3,
                                                    "created_utc": 1652828750.0,
                                                    "response": "Ah, too bad. It sounded like they all took a special trip *just* to learn about Bitcoin. \n\nStill, here are photos of them downloading the Bitcoin Beach wallet. Pretty bullish! \n\nhttps://twitter.com/Bitcoinbeach/status/1526328744796823554?s=20&t=xn0yBCepUm3ubmYwCsuYhA",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i8zeajy",
                                    "author": "Georgelynch1986",
                                    "score": 10,
                                    "created_utc": 1652815295.0,
                                    "response": "There are pictures of Bitcoin booths to test Lightning and they tried it 🤷‍♂️",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i90oymk",
                                    "author": "Snow75",
                                    "score": 1,
                                    "created_utc": 1652836126.0,
                                    "response": "Correct. You can read about it here:\n\nhttps://www.afi-global.org/events/digital-financial-services-sme-finance-working-group-meeting/",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8zxj8m",
                            "author": "18boro",
                            "score": 3,
                            "created_utc": 1652823322.0,
                            "response": "What's the name of this gathering?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i91ogjh",
                                    "author": "HopeToFireWithCrypro",
                                    "score": 3,
                                    "created_utc": 1652856999.0,
                                    "response": "Digital Financial Services & SME Finance Working Group Meetings: [https://www.afi-global.org/events/digital-financial-services-sme-finance-working-group-meeting/](https://www.afi-global.org/events/digital-financial-services-sme-finance-working-group-meeting/)\n\n>After a two-year hiatus, we are excited to resume our physical meetings. The Banco Central de Reserva de El Salvador (BCR) and AFI are honored to host the 25th Digital Financial Services Working Group (DFSWG) and 18th SME Finance Working Group (SMEFWG) Meetings in San Salvador, El Salvador, land covered with lush tropical forest and amazing lakes.  \n>  \n>This will enable members to deepen policy conversations through the use of high-quality content, build member capacity, and identify synergies on topical issues between working groups. The working groups are anticipated to offer practical thought leadership and regulatory guidance on crucial and unsolved policy issues in the form of policy models, frameworks, and toolkits as a result of this collaboration and constitute the content backbone of AFI. The meetings also align with El Salvador’s recently launched national financial inclusion strategy which has digitization and access to finance to small businesses as a priority.  \n>  \n>Should you have any questions regarding this event or how to participate, please contact [smefwg@afi-global.org](mailto:smefwg@afi-global.org) / [dfswg@afi-global.org](mailto:dfswg@afi-global.org)\n\nThe event description doesn't mention Bitcoin.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i92aqqk",
                                            "author": "18boro",
                                            "score": 2,
                                            "created_utc": 1652875347.0,
                                            "response": "Thanks! Sad that this is hyped way too much, kinda erodes the trustworthiness and makes one doubt when there's actual big news in this space",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8zgdm5",
                            "author": "CSI_Tech_Dept",
                            "score": 2,
                            "created_utc": 1652816153.0,
                            "response": "It was a first in one this year ;)",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8zgfn2",
                            "author": "NYKNYb",
                            "score": -1,
                            "created_utc": 1652816176.0,
                            "response": "Do they discuss Bitcoin every year too?\n\nI didn't think so.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i91owfv",
                            "author": "suinegisgenius",
                            "score": 1,
                            "created_utc": 1652857366.0,
                            "response": "These indicators are so much more interesting to me than the current bitcoin price.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8ydwv5",
                    "author": "XXsforEyes",
                    "score": 13,
                    "created_utc": 1652800497.0,
                    "response": "I’d like an attendance list please!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8yl5ql",
                            "author": "CoinCorner_Sam",
                            "score": 28,
                            "created_utc": 1652803495.0,
                            "response": "Representatives of he Central Bank of São Tomé and Príncipe, Central Bank of Paraguay, National Bank of Angola, Bank of Ghana, Bank of Namibia, Bank of Uganda, Central Bank of the Republic of Guinea, Central Bank of Madagascar, Bank of the Republic of Haiti, Bank of the Republic of Burundi, Central Bank of Eswatini and its Ministry of Finance, Central Bank of Jordan, Central Bank of The Gambia, National Committee of Banks and Seguros of Honduras, Directorate General of Treasury, Ministry of Finance and Budget, Madagascar, the Maldives Monetary Authority, the National Bank of Rwanda, Nepal Rastra Bank, Sacco Societies Regulatory Authority (SASRA), Kenya, State Bank of Pakistan, General Superintendency of Financial Entities of Costa Rica, Superintendence of the Popular and Solidarity Economy of Ecuador - I believe 44 countries all together.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8yla49",
                            "author": "h0twired",
                            "score": 19,
                            "created_utc": 1652803547.0,
                            "response": "Look for the countries that have the lowest GDP.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8ysk8r",
                                    "author": "XXsforEyes",
                                    "score": 8,
                                    "created_utc": 1652806500.0,
                                    "response": "Of that I had no doubt. If you’ve read the BTC white paper… or even if you haven’t it’s game theory - GAME ON!!!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i900u35",
                    "author": "cameronmena",
                    "score": 5,
                    "created_utc": 1652824771.0,
                    "response": "I never in my wildest dreams thought that my country would be the epicenter of monetary freedom.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8xuj9l",
                    "author": "DesmondNav",
                    "score": 112,
                    "created_utc": 1652791690.0,
                    "response": "lmao Europe and North America late to the innovation party, as always",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8xvqrm",
                            "author": "kytheon",
                            "score": 57,
                            "created_utc": 1652792322.0,
                            "response": "smash that regulation button",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8yn162",
                                    "author": "timbulance",
                                    "score": 15,
                                    "created_utc": 1652804280.0,
                                    "response": "Historic photo for the history books",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8zqd9l",
                                    "author": "vgecempire",
                                    "score": 3,
                                    "created_utc": 1652820296.0,
                                    "response": "We’ll be in El Salvador next month and would love to attend one of those meetings.\n\nHopefully there is one around the time we are down there.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8zrj09",
                                            "author": "kytheon",
                                            "score": 1,
                                            "created_utc": 1652820775.0,
                                            "response": "Cool, going for the bitcoin adoption or another reason?",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i921ei4",
                                            "author": "mattjackwillBTC",
                                            "score": 1,
                                            "created_utc": 1652868762.0,
                                            "response": "Wait until 2032 where halvening makes miner profit less than 1btc perblock, unless the price spikes 3x than current price. miner most likely will went offline.\n\n And leftover asic will be rented, and might be used as 51% attack on btc network.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i8yrpw0",
                                    "author": "margalolwut",
                                    "score": 5,
                                    "created_utc": 1652806162.0,
                                    "response": "“Innovation or regulation”\n\nInsert guy wiping sweat off forehead to choose the right button meme",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8yg2w1",
                            "author": "kellnoidiii",
                            "score": 26,
                            "created_utc": 1652801401.0,
                            "response": "You're joking right? I forgot how much south American tech is used.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8yxmoe",
                                    "author": "BitcoinFan1239",
                                    "score": 9,
                                    "created_utc": 1652808532.0,
                                    "response": "yeah op has to be joking, how did that get upvoted otherwise",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i919m5x",
                                    "author": "sardegnala1963",
                                    "score": 1,
                                    "created_utc": 1652846444.0,
                                    "response": "this will hopefully have a profound effect on the trajectory of the over the coming years bitcoin is hope .",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8y1b0x",
                            "author": "__Error404",
                            "score": 23,
                            "created_utc": 1652795045.0,
                            "response": "I think they'd much rather have centralized fiat",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i913h17",
                                    "author": "maryanlukuts",
                                    "score": 5,
                                    "created_utc": 1652843091.0,
                                    "response": "Is that with or without the state of emergency and the suspension of constitutional rights that was just declared?",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8yl0wh",
                                    "author": "h0twired",
                                    "score": 5,
                                    "created_utc": 1652803438.0,
                                    "response": "And the participating countries have already destroyed theirs and are out of options of ways to enrich the political elites.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i90cnvi",
                                            "author": "dimon00ks",
                                            "score": 3,
                                            "created_utc": 1652830262.0,
                                            "response": "Yes! Another first. Bitcoin is rolling over the world like a tidal wave.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i8ydmiq",
                                    "author": "rmzy",
                                    "score": 0,
                                    "created_utc": 1652800374.0,
                                    "response": "Because they ain’t even got that",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8z5ryc",
                                            "author": "Pgj88",
                                            "score": 2,
                                            "created_utc": 1652811822.0,
                                            "response": "Need to start a meetup... wish I was in college still, would be much easier.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8yk17c",
                            "author": "mountaincabinlife",
                            "score": 11,
                            "created_utc": 1652803030.0,
                            "response": "I promise you the US has more bitcoin than you could ever imagine",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8zo4vj",
                                    "author": "woshidage",
                                    "score": 1,
                                    "created_utc": 1652819363.0,
                                    "response": "This picture takes the concept of 'Bitcoin is hope' to a whole new level .",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i928ovu",
                                            "author": "alexis013077",
                                            "score": 4,
                                            "created_utc": 1652874092.0,
                                            "response": "BTC is an escape hatch.  That's the first thing that comes to mind when I look at the picture on the right.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9055wh",
                                    "author": "ride_the_LN",
                                    "score": 0,
                                    "created_utc": 1652826734.0,
                                    "response": "Imagine how all that bitcoin compares to printing press powers.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8y9g7m",
                            "author": "redshadow90",
                            "score": 11,
                            "created_utc": 1652798625.0,
                            "response": "When you're winning, why change anything? See also: Blockbuster",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8yt4fq",
                                    "author": "ailovebtc",
                                    "score": 2,
                                    "created_utc": 1652806724.0,
                                    "response": "Just some plebs hanging out. I bet you they share their planes to safe fuel in order to buy the dip.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8xxl96",
                            "author": "MuchTemperature6776",
                            "score": 11,
                            "created_utc": 1652793253.0,
                            "response": "Because they don’t like things they can’t control",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i91bz3j",
                                    "author": "lachlanmcqueen",
                                    "score": 1,
                                    "created_utc": 1652847852.0,
                                    "response": "Love to see all these people representing the countries most effected by the disastrous consequences of western money printing open to learning about the escape .",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8zraof",
                            "author": "AndyZuggle",
                            "score": 2,
                            "created_utc": 1652820679.0,
                            "response": "99% percent of innovation comes from Europe and North America.  The rest comes from East Asia.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8y8vl0",
                            "author": "po00on",
                            "score": 7,
                            "created_utc": 1652798385.0,
                            "response": "too busy cooking up tyranny, under the guise of 'world health'...",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8z40uc",
                                    "author": "kaushikTD",
                                    "score": 3,
                                    "created_utc": 1652811107.0,
                                    "response": "What is this meetup called? Is there any official agenda or statement?\n\nWould like to read more about it..",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8yhsi2",
                            "author": "New_Confusion2034",
                            "score": 3,
                            "created_utc": 1652802108.0,
                            "response": "You mean the actual leaders of innovation? Who the hell outside the developed world is innovating?\n\nThe vast majority are just begging for money from the innovators.\n\nWhat grand innovations are coming out of South America? What, new ways for drug cartels to peel the skin off of a human?\n\nThese countries are being held together by duck tape, and bubble gum.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8yqkz9",
                                    "author": "PM_ME_YOUR_THESES",
                                    "score": 4,
                                    "created_utc": 1652805703.0,
                                    "response": "I can’t imagine being this ignorant.\n\nChina is the country with the most patent applications, and it’s not even close. It’s about double (or more) that of the US.\n\nIndia produces more patents than Spain. Brazil produces more patents than Norway. Mexico has more patents than Greece…\n\nNorth America, Western Europe, Japan, and South Korea are pretty innovative countries for sure. But they’re not the leaders (China is), and they’re not the *only* innovative countries. Plenty of innovation going on outside the “developed” bubble too…",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8yuz5i",
                                            "author": "Adamsd5",
                                            "score": 4,
                                            "created_utc": 1652807470.0,
                                            "response": "I just applied for a patent on your comment.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8z6v1d",
                                                    "author": "PM_ME_YOUR_THESES",
                                                    "score": 5,
                                                    "created_utc": 1652812264.0,
                                                    "response": "It’s funny because you’re trying to mock facts without providing any of your own.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i901qxn",
                                                            "author": "nyaaaa",
                                                            "score": 3,
                                                            "created_utc": 1652825178.0,
                                                            "response": "Filing a patent application is not a fact that represents innovation.\n\nBefore pretending someone mocks facts, you have to provide some relevant ones to be mocked.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i90muf3",
                                                                    "author": "PM_ME_YOUR_THESES",
                                                                    "score": 1,
                                                                    "created_utc": 1652835131.0,
                                                                    "response": "It’s more of a fact than the null alternative you’re presenting",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i91geln",
                                                                            "author": "nyaaaa",
                                                                            "score": 0,
                                                                            "created_utc": 1652850780.0,
                                                                            "response": "No.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "i90ntvz",
                                                            "author": "Adamsd5",
                                                            "score": 2,
                                                            "created_utc": 1652835598.0,
                                                            "response": "You are thinking way harder about it than I did...  I just thought it sounded funny.  I wasn't even mocking.  I didn't even disagree.\n\n Relax a bit....it's reddit.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i8zvejz",
                                            "author": "Crafty_Supermarket15",
                                            "score": 3,
                                            "created_utc": 1652822412.0,
                                            "response": "Patents per capita? Also, China is notorious for stealing international technology",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i90mye6",
                                                    "author": "PM_ME_YOUR_THESES",
                                                    "score": 0,
                                                    "created_utc": 1652835186.0,
                                                    "response": "How is the “per capita” relevant?\n\nAs for the second part, go ahead and quantify it.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i8z7c14",
                                            "author": "Mr_Again",
                                            "score": 0,
                                            "created_utc": 1652812456.0,
                                            "response": "Name three pieces of Indian tech that you use or have even heard of",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8zyt3e",
                                                    "author": "Jrdirtbike114",
                                                    "score": 3,
                                                    "created_utc": 1652823876.0,
                                                    "response": "Your casual (maybe unintentional? Idk you) racism is showing",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i8zf1qq",
                                                    "author": "PM_ME_YOUR_THESES",
                                                    "score": 3,
                                                    "created_utc": 1652815606.0,
                                                    "response": "- J# was a programming language developed in India by Microsoft India division, transitional for Java into .Net framework.\n\n- Kojo is a programming language and IDE for education.\n\n- Genome Valley is a high-tech life sciences R&D and industrial cluster in Hyderabad, India.\n\n- Plastic roads were first developed in India\n\n- InvIT Trust funds, also invented in India.\n\n- DigiLocker, Indian development\n\n- 5Gi is an Indian standard for 5G.\n\n- The first public demonstration of microwave communication was performed in Calcutta, India\n\n- I love mangoes. They’re my favorite fruit. And Amrapali mangos are a genetic hybrid developed in India.\n\n- India developed the first “warm” COVID-19 vaccine, called Mynvax.\n\n- There is a lot of research around Synthetic genes happening in India\n\n- Tata Steel developed a Coal-bed methane blast furnace for their production processes\n\n- India is developing something called DMR-grade steel, which is a steel used for Defense Metallurgical Research.\n\n- Tata Motors developed one of the least expensive cars in the world market, and for it, they invented a special type of fortified cabin.\n\nThese are, of course, just recent inventions. As you know, India is the birthplace of many ancient inventions, from Chess and Musical Notation, to crucible steels and dockyards. \n\nI hope I answered your question.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i8yyw4e",
                                            "author": "EclecticHigh",
                                            "score": -1,
                                            "created_utc": 1652809044.0,
                                            "response": "he's probably using a phone made in korea or china, of using a computer, which has parts made everywhere except the US (and probably assembled in an asian country). some people dont logic very well.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8z6l3j",
                                                    "author": "PM_ME_YOUR_THESES",
                                                    "score": 2,
                                                    "created_utc": 1652812152.0,
                                                    "response": "Some people are still living in 20, 30, 40, or even 50 years ago… unfortunately, those people are the most influential when determining policy for the next few decades… And *that* is the reason why inequality and other injustices prevail.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i8yjt5n",
                                    "author": "DesmondNav",
                                    "score": 1,
                                    "created_utc": 1652802935.0,
                                    "response": "Have you ever been to Singapore, Qatar, UAE, South Korea, Japan, Hong Kong or even Turkey, China?\n\nThe western world is sleeping.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8yovc0",
                                            "author": "gnosiac",
                                            "score": 2,
                                            "created_utc": 1652805019.0,
                                            "response": "All great countries of South America",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8ypwek",
                                                    "author": "DesmondNav",
                                                    "score": 1,
                                                    "created_utc": 1652805429.0,
                                                    "response": "I never mentioned South America",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8yrtz0",
                                                            "author": "PRMan99",
                                                            "score": 1,
                                                            "created_utc": 1652806207.0,
                                                            "response": "So, you admit that you were off-topic...",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8ystv3",
                                                                    "author": "DesmondNav",
                                                                    "score": 3,
                                                                    "created_utc": 1652806605.0,
                                                                    "response": "Did I miss something? Were Asian and middle eastern nations not present? - because it sure looks like it",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i8ypyg3",
                                            "author": "waterfucker_",
                                            "score": 2,
                                            "created_utc": 1652805452.0,
                                            "response": "UAE works on slavery and retarded decisions. China, Singapore and South Korea are great examples though (I'd also like to add Vietnam).",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i90u7ig",
                                            "author": "y8523835",
                                            "score": 1,
                                            "created_utc": 1652838588.0,
                                            "response": "Damn, why not in a shade! The sun is almost in zenith, must be terribly hot .",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i8yyipu",
                                    "author": "EclecticHigh",
                                    "score": 0,
                                    "created_utc": 1652808894.0,
                                    "response": "el salvador is growing and is going to be a very developed country in 5 to 10 years",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i91ypjw",
                                            "author": "zoomborg",
                                            "score": 0,
                                            "created_utc": 1652866383.0,
                                            "response": "Is it? Pretty much every country with destroyed economy has been a result of rampant corrupted governments selling off their assets to international entities for a fat paycheck leaving their native people without jobs to feed them and their families which spirals down to increased crime, drugs, human trafficking etc. The petrol industry is by far the best example, take a look at Venezuela.\n\nEl salvador is no exception here. If the government is still corrupted then the only ones who will benefit from any financial bloom is them and them only. For example if most El Salvador citizens hold bitcoin to their name (since it's pretty much a national currency) and BTC goes on a huge bull run a corrupted government could just increase taxes to reap the benefits of said bull run since people are now richer. So before BTC adoption can do anything to help the country  government corruption has to go first.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i92k0gc",
                                                    "author": "EclecticHigh",
                                                    "score": 1,
                                                    "created_utc": 1652880267.0,
                                                    "response": "im from el salvador, trust me, the government has been overhauled with younger politicians. they are actually rebuilding the country. there's construction and remodeling already taking place everywhere starting with san salvador, surf city, and bitcoin city. the political parties since the 80's have been shit, nobody is denying that.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i8yyu61",
                                    "author": "mj37108",
                                    "score": 1,
                                    "created_utc": 1652809022.0,
                                    "response": "Looks like word is out that AOL’s expensive, proprietary, garden-walled cartoon village might not be the best way of doing the things \n\nAOL should be very nervous.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8y6o08",
                            "author": "Boe_Ning",
                            "score": 2,
                            "created_utc": 1652797431.0,
                            "response": "That's a joke, right?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i909ok7",
                                    "author": "backret",
                                    "score": 1,
                                    "created_utc": 1652828842.0,
                                    "response": "What if they’ve already done the work in online meetings and this is where they all whip out their phones and smash buy strategic national reserves .",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8yd96e",
                            "author": "voltsmeter",
                            "score": 0,
                            "created_utc": 1652800216.0,
                            "response": "All they care about is their archaic banking system.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8yu5jj",
                                    "author": "ivanbeld",
                                    "score": 0,
                                    "created_utc": 1652807134.0,
                                    "response": "Looks like brown people will inherit the earth. Who knew?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8yrtgk",
                            "author": "swgo1",
                            "score": 1,
                            "created_utc": 1652806201.0,
                            "response": "Yeah. Let's hope Europe and the US get more like the countries represented here. Lol",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i90lrlp",
                            "author": "rdmcnabb",
                            "score": 1,
                            "created_utc": 1652834625.0,
                            "response": "It's incredible to see how many there are! Soon there will be one in every major city so that no matter where you travel .\n\nYou'll always have a group to connect with! It's a thing of beauty.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8yx6ld",
                            "author": "Scholes_SC2",
                            "score": 0,
                            "created_utc": 1652808358.0,
                            "response": "Ofc, the ones benefiting the most from current system don't want things to change",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8yki7c",
                    "author": "NeonxGone",
                    "score": 11,
                    "created_utc": 1652803224.0,
                    "response": "https://bitcoinmagazine.com/markets/el-salvador-president-nayib-bukele-announces-countries-to-discuss-bitcoin\n\nHere is the article If anyone is curious",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8y408p",
                    "author": "Verallendingen",
                    "score": 24,
                    "created_utc": 1652796275.0,
                    "response": "where r the lasereyes?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i90shdr",
                            "author": "pryan912",
                            "score": 6,
                            "created_utc": 1652837784.0,
                            "response": "I so wanted to add laser eyes to everyone on this photo .",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8yeqgo",
                            "author": "Zelgada",
                            "score": -10,
                            "created_utc": 1652800841.0,
                            "response": "Cringe",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8ykqp1",
                                    "author": "rhaphazard",
                                    "score": 2,
                                    "created_utc": 1652803319.0,
                                    "response": "Can't a man have fun?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8zs1gu",
                                            "author": "wytslyts",
                                            "score": 1,
                                            "created_utc": 1652820988.0,
                                            "response": "Dude ,his country is practically insolvent and  lost tens of millions of dollars of his treasury in a time of record inflation .",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i8yl6s6",
                                            "author": "Zelgada",
                                            "score": -2,
                                            "created_utc": 1652803507.0,
                                            "response": "Sure, have fun.  But it's still cringe to others.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8zxg5b",
                                                    "author": "rhaphazard",
                                                    "score": 1,
                                                    "created_utc": 1652823285.0,
                                                    "response": "Bitcoin is cringe to most people. Doesn't mean anything.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i90iags",
                                                            "author": "Zelgada",
                                                            "score": 1,
                                                            "created_utc": 1652832999.0,
                                                            "response": "Nothing wrong with bringing some more professionalism to Bitcoin.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i90uuz1",
                                                                    "author": "rhaphazard",
                                                                    "score": 1,
                                                                    "created_utc": 1652838899.0,
                                                                    "response": "I agree. But also nothing wrong with having fun.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i90frb1",
                                    "author": "yusupan777",
                                    "score": 1,
                                    "created_utc": 1652831764.0,
                                    "response": "Not a white man in sight. If only liberals understood the freedom bitcoin can bring to minority nations.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i90igjy",
                                            "author": "Zelgada",
                                            "score": 1,
                                            "created_utc": 1652833081.0,
                                            "response": "? Bitcoin is amazing for these nations.  I just wish there was more professionalism in this community instead of \"lasereyes\".",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i8yo82b",
                                    "author": "Verallendingen",
                                    "score": -2,
                                    "created_utc": 1652804762.0,
                                    "response": "sorry...not sorry!? relax mate 🤣",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8yc9c4",
                    "author": "JSammut29",
                    "score": 10,
                    "created_utc": 1652799795.0,
                    "response": "Does anyine hvae a list of countries or will i be sent to the bench for bein g a lazy fuck",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8yl3wm",
                            "author": "CoinCorner_Sam",
                            "score": 16,
                            "created_utc": 1652803474.0,
                            "response": "Representatives of he Central Bank of São Tomé and Príncipe, Central Bank of Paraguay, National Bank of Angola, Bank of Ghana, Bank of Namibia, Bank of Uganda, Central Bank of the Republic of Guinea, Central Bank of Madagascar, Bank of the Republic of Haiti, Bank of the Republic of Burundi, Central Bank of Eswatini and its Ministry of Finance, Central Bank of Jordan, Central Bank of The Gambia, National Committee of Banks and Seguros of Honduras, Directorate General of Treasury, Ministry of Finance and Budget, Madagascar, the Maldives Monetary Authority, the National Bank of Rwanda, Nepal Rastra Bank, Sacco Societies Regulatory Authority (SASRA), Kenya, State Bank of Pakistan, General Superintendency of Financial Entities of Costa Rica, Superintendence of the Popular and Solidarity Economy of Ecuador - I believe 44 countries all together.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i90uaf1",
                                    "author": "xxtratera",
                                    "score": 3,
                                    "created_utc": 1652838625.0,
                                    "response": "Praying for President Bukele and those who have put this historical effort together.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i92ece4",
                                            "author": "daytrader1230",
                                            "score": 1,
                                            "created_utc": 1652877390.0,
                                            "response": "Bitcoin had such a promising start and is still growing.\n\n Bitcoin will soon become legal tender in several countries. keep using USDT to accumulate BTC!",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i91p1l4",
                                    "author": "JSammut29",
                                    "score": 1,
                                    "created_utc": 1652857484.0,
                                    "response": "😊 Hope it was productive. Them people deserve it.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i91fle3",
                            "author": "wqj911",
                            "score": 2,
                            "created_utc": 1652850217.0,
                            "response": "I look forward to your updates about this. \n\nWay to lead not only El Salvador, but the world into the next financial system.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i91z8o9",
                                    "author": "urtehsuxx",
                                    "score": 1,
                                    "created_utc": 1652866858.0,
                                    "response": "This is the biggest news since\n\nBitcoin's inception. \n\nThose who think otherwise aren't in touch with the ground reality.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8ye1a0",
                            "author": "rmzy",
                            "score": -20,
                            "created_utc": 1652800549.0,
                            "response": "They are all under developed countries. Nothing work looking up",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8yfppc",
                                    "author": "JSammut29",
                                    "score": 17,
                                    "created_utc": 1652801246.0,
                                    "response": "I like under developed countries working on their sovereignty. I don't care about what the immediate price action will be.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i91655l",
                                            "author": "tschnoeck2803",
                                            "score": 4,
                                            "created_utc": 1652844480.0,
                                            "response": "This is progress!  This is the way of the future!! Cheers .",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i8ykspo",
                                    "author": "rhaphazard",
                                    "score": 8,
                                    "created_utc": 1652803344.0,
                                    "response": "That's exactly where all the opportunity is.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8ylfyx",
                                            "author": "rmzy",
                                            "score": -9,
                                            "created_utc": 1652803615.0,
                                            "response": "Yeah opportunity for countries to forget about debt and all the problems they caused trying to create a fiat instead of just adopting to begin with. Good for these countries bro, but it doesn’t make a difference.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8yzv7a",
                                                    "author": "Barnabass",
                                                    "score": 6,
                                                    "created_utc": 1652809429.0,
                                                    "response": "you are so wrong.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8zpclr",
                                                            "author": "jmw74",
                                                            "score": 1,
                                                            "created_utc": 1652819875.0,
                                                            "response": "Sounds about right to me.\n\nThese countries are the college kids of nations. The demand they create is from the change they find in their couch.\n\nTo put it in perspective, Michael Saylor has many times more bitcoin than the entire country of El Salvador.\n\nWhat's important is the domino effect, but these are microscopic dominos so far.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i8zxqcp",
                                                    "author": "rhaphazard",
                                                    "score": 1,
                                                    "created_utc": 1652823407.0,
                                                    "response": "There's a reason why people invest in \"emerging markets\"",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i91q631",
                                                    "author": "glukmedia",
                                                    "score": 1,
                                                    "created_utc": 1652858470.0,
                                                    "response": "What would he be talking about if Bitcoin tanks another 20% on the days the 32 central banks and 12 financial authorities are there?\n\nThey meeting to figure out how to bail him out of debt because he invested in a worthless cryptocurrency?",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8zwvzj",
                            "author": "tradone",
                            "score": 0,
                            "created_utc": 1652823042.0,
                            "response": "They are the Central Bank of São Tomé and Príncipe, Central Bank of Paraguay, National Bank of Angola, Bank of Ghana, Bank of Namibia, Bank of Uganda, Central Bank of the Republic of Guinea, Central Bank of Madagascar, Bank of the Republic of Haiti, Bank of the Republic of Burundi, Central Bank of Eswatini and its Ministry of Finance, Central Bank of Jordan, Central Bank of The Gambia, National Committee of Banks and Seguros of Honduras, Directorate General of Treasury, Ministry of Finance and Budget, Madagascar, the Maldives Monetary Authority, the National Bank of Rwanda, Nepal Rastra Bank, Sacco Societies Regulatory Authority (SASRA), Kenya, State Bank of Pakistan, General Superintendency of Financial Entities of Costa Rica, Superintendence of the Popular and Solidarity Economy of Ecuador",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8y0wud",
                    "author": "domotor2",
                    "score": 33,
                    "created_utc": 1652794863.0,
                    "response": "This will be a historic photo!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i90msth",
                            "author": "lfynt01",
                            "score": 2,
                            "created_utc": 1652835110.0,
                            "response": "Catch me rolling up to one of these meetups in basketball shorts T-15 years .",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i920707",
                                    "author": "cryptidan",
                                    "score": 4,
                                    "created_utc": 1652867708.0,
                                    "response": "Right. Just shorted more Bitcoin. Thanks for the good entry prices.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8yxo7l",
                            "author": "BitcoinFan1239",
                            "score": 3,
                            "created_utc": 1652808548.0,
                            "response": "it will be in kids textbooks",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8z71hk",
                                    "author": "mikebailey",
                                    "score": 7,
                                    "created_utc": 1652812338.0,
                                    "response": "Not as a Bitcoin meetup though because it was literally debunked in this sub lol",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i90p4mi",
                            "author": "Snow75",
                            "score": 1,
                            "created_utc": 1652836205.0,
                            "response": "Not really, these people gather every now and then:\n\nhttps://www.afi-global.org/events/digital-financial-services-sme-finance-working-group-meeting/",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8ywi9l",
                    "author": "tisuy",
                    "score": 3,
                    "created_utc": 1652808086.0,
                    "response": "Did I understand correctly that this is happening in El Salvador?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8zlpqq",
                            "author": "CoinCorner_Sam",
                            "score": 0,
                            "created_utc": 1652818357.0,
                            "response": "That's correct. In San Salvador ([16th May 2022 - 19th May 2022](https://www.afi-global.org/events/digital-financial-services-sme-finance-working-group-meeting/)). Not just about Bitcoin but some of them already [visited the Bitcoin Beach](https://twitter.com/Bitcoinbeach/status/1526328744796823554) and have been introduced to and trying r/thelightningnetwork.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i901ove",
                    "author": "HighlightTiny9896",
                    "score": 3,
                    "created_utc": 1652825152.0,
                    "response": "The New G 44",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i92h61v",
                    "author": "mblasterr",
                    "score": 1,
                    "created_utc": 1652878872.0,
                    "response": "Bitcoin had such a good humble begining and it continues to grow. It started from empty halls, to nations gathering to talk about Bitcoin. \n\nIn the near future, Bitcoin will become a house hold name in every country and legal tender in many nations. Just keep accumulating BTC .",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8xxbzh",
                    "author": "DomComm",
                    "score": 13,
                    "created_utc": 1652793123.0,
                    "response": "If all these countries jump in it would create FOMO among nations then next stop $1 Million BTC",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8y122l",
                            "author": "TheChoosey1",
                            "score": 0,
                            "created_utc": 1652794930.0,
                            "response": "At least.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8ydyny",
                            "author": "rmzy",
                            "score": -9,
                            "created_utc": 1652800518.0,
                            "response": "All these countries broke af. Does any of them even have $1 mill to drop on btc?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8yk6uj",
                                    "author": "Juankestein",
                                    "score": 2,
                                    "created_utc": 1652803096.0,
                                    "response": "Y'all are mean lol",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8yjc6h",
                                    "author": "seancollinhawkins",
                                    "score": 2,
                                    "created_utc": 1652802743.0,
                                    "response": "I get you're being sarcastic, but El Salvador alone holds about $70m in btc. So that one poor country would say 70xs yes",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8yl6h1",
                                            "author": "h0twired",
                                            "score": 1,
                                            "created_utc": 1652803503.0,
                                            "response": "It only cost them $140M to buy it!",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8ymlks",
                                                    "author": "poluting",
                                                    "score": 2,
                                                    "created_utc": 1652804098.0,
                                                    "response": "They bought in at 40k initially and have been DCAing",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8zgc2c",
                                                            "author": "TheAnalogKoala",
                                                            "score": 2,
                                                            "created_utc": 1652816135.0,
                                                            "response": "They bought in at $51 769.06 initially. \n\nhttps://nayibtracker.com",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "i8ync3q",
                                                            "author": "h0twired",
                                                            "score": 1,
                                                            "created_utc": 1652804404.0,
                                                            "response": ">have been DCAing\n\n\"If you liked it at $40k... you will love it at $20k... $10k... $5k....\"",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8ynjk4",
                                                                    "author": "poluting",
                                                                    "score": 3,
                                                                    "created_utc": 1652804486.0,
                                                                    "response": "As someone who owns 1+btc I want it to drop to those levels. I’d literally work 100 hours a week and throw all of my money into it",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i8yupfa",
                                                    "author": "seancollinhawkins",
                                                    "score": 1,
                                                    "created_utc": 1652807360.0,
                                                    "response": "That only furthers the point of my response. Clearly those 'poor counties' can afford $1m in btc",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8yxulb",
                                                            "author": "h0twired",
                                                            "score": 1,
                                                            "created_utc": 1652808619.0,
                                                            "response": "Sure.  It just results in less money for education, healthcare, roads and other infrastructure and social services enjoyed by other countries.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i8ylwdj",
                                            "author": "rmzy",
                                            "score": 1,
                                            "created_utc": 1652803808.0,
                                            "response": "Bro El Salvador has a huge reserve of gas and gas power plants. That one poor country has like 2 wealthy individuals. Good for them!",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i8ykyia",
                                    "author": "rhaphazard",
                                    "score": 1,
                                    "created_utc": 1652803411.0,
                                    "response": "Because the US with $30 trillion debt is so rich.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8yl9jm",
                                            "author": "rmzy",
                                            "score": 3,
                                            "created_utc": 1652803540.0,
                                            "response": "It’s a difference when you are so in debt your own dollar bill takes a million of them to = 1 usd. So what about US debt?",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i8yo78v",
                                            "author": "KO9",
                                            "score": 1,
                                            "created_utc": 1652804753.0,
                                            "response": "Doesn't really matter when they can (and do) just print fresh money. USD might as well stand for United States Debt",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8zynyf",
                                                    "author": "rhaphazard",
                                                    "score": 1,
                                                    "created_utc": 1652823814.0,
                                                    "response": "Papa Powell",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i8zcmci",
                                    "author": "leoslam",
                                    "score": 1,
                                    "created_utc": 1652814615.0,
                                    "response": "But , I thought Bitcoin is anti bank and anti government?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i924jpk",
                                            "author": "uaanonymous",
                                            "score": 3,
                                            "created_utc": 1652871254.0,
                                            "response": "I estimate more than 1 billion people there, being represented. This is bullish.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i8zjype",
                                            "author": "rmzy",
                                            "score": 1,
                                            "created_utc": 1652817630.0,
                                            "response": "How is it anti government or anti bank if they are in control of it for the masses?",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8yav31",
                    "author": "Jetjones",
                    "score": 7,
                    "created_utc": 1652799211.0,
                    "response": "They did talk bitcoin but they weren’t there for it.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8yg78u",
                            "author": "TheMoonMoth",
                            "score": 2,
                            "created_utc": 1652801451.0,
                            "response": "More info?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i90p9y6",
                                    "author": "Snow75",
                                    "score": 2,
                                    "created_utc": 1652836277.0,
                                    "response": "https://www.afi-global.org/events/digital-financial-services-sme-finance-working-group-meeting/",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i90uycb",
                            "author": "TheMoonMoth",
                            "score": 1,
                            "created_utc": 1652838944.0,
                            "response": " >  The working groups are anticipated to offer practical thought leadership and regulatory guidance on crucial and unsolved policy issues in the form of policy models, frameworks, and toolkit\n\nSounds like Bitcoin is exactly what they were there for.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8y3lum",
                    "author": "Jemless24",
                    "score": 4,
                    "created_utc": 1652796094.0,
                    "response": "Looks like a successful meetup turnout",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ykoch",
                    "author": "rhaphazard",
                    "score": 4,
                    "created_utc": 1652803293.0,
                    "response": "This is a historic photo.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8yxiw6",
                    "author": "ysiioxfo",
                    "score": 4,
                    "created_utc": 1652808491.0,
                    "response": "Love to see this, hope to join you at future meetups!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8z9t9b",
                    "author": "ILikePracticalGifts",
                    "score": 4,
                    "created_utc": 1652813467.0,
                    "response": "According to this sub, all of these countries will become the next superpower",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i91vzhc",
                    "author": "ffeng271",
                    "score": 4,
                    "created_utc": 1652863833.0,
                    "response": "In 10 years  ,Max El Salvador will be a rich as Switzerland is today.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8yseqf",
                    "author": "Bisquick_in_da_MGM",
                    "score": 2,
                    "created_utc": 1652806438.0,
                    "response": "Which countries were there?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8zlxni",
                            "author": "CoinCorner_Sam",
                            "score": 2,
                            "created_utc": 1652818447.0,
                            "response": "Representatives of he Central Bank of São Tomé and Príncipe, Central Bank of Paraguay, National Bank of Angola, Bank of Ghana, Bank of Namibia, Bank of Uganda, Central Bank of the Republic of Guinea, Central Bank of Madagascar, Bank of the Republic of Haiti, Bank of the Republic of Burundi, Central Bank of Eswatini and its Ministry of Finance, Central Bank of Jordan, Central Bank of The Gambia, National Committee of Banks and Seguros of Honduras, Directorate General of Treasury, Ministry of Finance and Budget, Madagascar, the Maldives Monetary Authority, the National Bank of Rwanda, Nepal Rastra Bank, Sacco Societies Regulatory Authority (SASRA), Kenya, State Bank of Pakistan, General Superintendency of Financial Entities of Costa Rica, Superintendence of the Popular and Solidarity Economy of Ecuador - I believe 44 countries all together.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i90mnm8",
                    "author": "HumanJenoM",
                    "score": 2,
                    "created_utc": 1652835040.0,
                    "response": "Very cool",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i90qsrj",
                    "author": "SkirtTechnical1691",
                    "score": 2,
                    "created_utc": 1652837001.0,
                    "response": "It must be very meaningful to participate in this kind of party",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i90yb8b",
                    "author": "andres25d",
                    "score": 2,
                    "created_utc": 1652840532.0,
                    "response": "Tonight we're having the first bitcoin meetup in Salvador, Bahia, Brazil.\n\nI'll post the pictures later. Congratulations on you guys!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i913txm",
                    "author": "Karapatian",
                    "score": 2,
                    "created_utc": 1652843274.0,
                    "response": "What was accomplished at this historic meetup?! Awareness and community building?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i91prff",
                    "author": "farcus48",
                    "score": 2,
                    "created_utc": 1652858116.0,
                    "response": "It feels like El Salvador turned into one giant bitcoin meetup!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ywjkc",
                    "author": "milkonyourmustache",
                    "score": 2,
                    "created_utc": 1652808101.0,
                    "response": "The biggest hurdle for these Nations will be to coordinate their adoption. We've already seen what happens to countries that act alone in trying to move away from dollar dependence. Adoption is inevitable imo because the current system is one that has proven to only benefit the few and that few becoming much fewer over time. Bitcoin is the alternative, it's the chance to 'reset' - that alone is a massive incentive for those who have been left behind (the majority).",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8zees0",
                    "author": "Georgelynch1986",
                    "score": 2,
                    "created_utc": 1652815344.0,
                    "response": "https://www.reddit.com/r/Bitcoin/comments/urgxof/central_bankers_and_financial_ministers_from_44/?utm_source=share&utm_medium=ios_app&utm_name=iossmf&utm_term=link",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8yl829",
                    "author": "Enormouslypoor",
                    "score": 1,
                    "created_utc": 1652803522.0,
                    "response": "Don’t expect anything good coming from politicians. Bitcoin exists to get rid of those psychopaths.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8xtf57",
                    "author": "GannicusXIII",
                    "score": 1,
                    "created_utc": 1652791099.0,
                    "response": "This is the way",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ya22c",
                    "author": "mbrochh",
                    "score": -1,
                    "created_utc": 1652798880.0,
                    "response": "I love that no one wears a mask. Nature is healing.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8zu6rk",
                            "author": "c_games_official",
                            "score": 5,
                            "created_utc": 1652821895.0,
                            "response": "I mean, there IS someone wearing a mask in this photo but no one really gives a shit (except people like you I guess)",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8yk89x",
                    "author": "perfectgodcreation",
                    "score": 1,
                    "created_utc": 1652803112.0,
                    "response": "Historic",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i925moi",
                            "author": "gundbtc",
                            "score": 1,
                            "created_utc": 1652872030.0,
                            "response": "Damn El Pres gave them all his sign up link and is making fat stacks on rewards .",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8ynt5d",
                    "author": "OtherDetective",
                    "score": 1,
                    "created_utc": 1652804594.0,
                    "response": "This photo is beautiful in so many ways.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8yvszs",
                    "author": "XxBig_D_FreshxX",
                    "score": 1,
                    "created_utc": 1652807807.0,
                    "response": "Fun fact: This is >1/5th of all countries in the world. Gradually then suddenly.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8xwp2r",
                    "author": "Bones22ff",
                    "score": -10,
                    "created_utc": 1652792801.0,
                    "response": "Statist nonsense 👎we don't need any politicians to get involved",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8y42ka",
                            "author": "Letsmakeitawsome",
                            "score": 8,
                            "created_utc": 1652796304.0,
                            "response": "BTC is free for everyone to participate",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8yguxc",
                                    "author": "New_Confusion2034",
                                    "score": -2,
                                    "created_utc": 1652801725.0,
                                    "response": "So is self immolation.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8yh3g0",
                                            "author": "Letsmakeitawsome",
                                            "score": 1,
                                            "created_utc": 1652801822.0,
                                            "response": "Or update",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8y9yn9",
                            "author": "Aeriq",
                            "score": 3,
                            "created_utc": 1652798840.0,
                            "response": "I can’t believe the stupidity present in this thread. Anyone who thinks governments can’t opt in to the bitcoin standard like everyone else is a literal shit for brains retard.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8ya8dr",
                                    "author": "Bones22ff",
                                    "score": 1,
                                    "created_utc": 1652798952.0,
                                    "response": "ok statist. but i didn't say they cant, i said that this isn't the way to do it. read it again mate",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8ybe5z",
                                            "author": "Aeriq",
                                            "score": 2,
                                            "created_utc": 1652799434.0,
                                            "response": "If you think for one second civilization has any chance in your imaginary make believe world where governments aren’t necessary, then you’re either a privileged seventeen year old kid with a whole lot to learn, or just a cringy fuckin embarrassment on two legs. \n\nAnd your dumbass said we don’t need politicians involved. Meanwhile they’re who decide how much your bitcoin transactions should be taxed. Not that you probably file taxes, since that would be something a statist would do. \n\nLmao do you call yourself a sovereign citizen of the world? Hahaha the cringe",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8yd8e8",
                                                    "author": "Bones22ff",
                                                    "score": 1,
                                                    "created_utc": 1652800207.0,
                                                    "response": "tell me you're controlled by your emotions without telling me\\^  \ninstead of sucking up to saylor, learn how to use the tools. and maybe meditate or something",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8ye9wj",
                                                            "author": "Aeriq",
                                                            "score": 1,
                                                            "created_utc": 1652800651.0,
                                                            "response": "I actually just enjoy belittling uneducated morons lol especially when they have nothing of substance to add. Anarchists are worse than communists, and are even worse advocating for their shit ideology because it only makes sense to a person incapable of thinking critically.\n\nEnjoy your junior year in high school, Noam.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8yemq1",
                                                                    "author": "Bones22ff",
                                                                    "score": 1,
                                                                    "created_utc": 1652800799.0,
                                                                    "response": "ah yes, thanks for all the substance you've added to this conversation",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i92ekf5",
                                            "author": "steve11205",
                                            "score": 1,
                                            "created_utc": 1652877513.0,
                                            "response": "How is that political? Bitcoin is free as hell my brother.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8y0lbu",
                            "author": "ShiftyDM",
                            "score": 8,
                            "created_utc": 1652794714.0,
                            "response": "These people are just trying to get out from under the US dollar dominance. We don't need them. They need us.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8y0vk1",
                                    "author": "Bones22ff",
                                    "score": -2,
                                    "created_utc": 1652794847.0,
                                    "response": "100% agree, but it has to be from the bottom up. These governments can't coordinate anything. This leads to more power and wealth making its way to their hands. Bitcoin went from anti state, to funding the state. This is going to result in custodial solutions, kyc wallets, 0 censorship resistance. This is not the way to go about it.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8y418t",
                                            "author": "godofleet",
                                            "score": 7,
                                            "created_utc": 1652796288.0,
                                            "response": "these governments are the bottom up... y'all \"states are unquestionably evil\" folks in the bitcoin scene need to wake up and realize that these countries are bodies of people... if their leadership sees the potential that we see in bitcoin - the people of these countries stand to be much better served financially and represented politically (in the long run) rather than living under the dollar, juan etc...\n\nbitcoin is for everyone",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8y4urf",
                                                    "author": "Bones22ff",
                                                    "score": 0,
                                                    "created_utc": 1652796649.0,
                                                    "response": "Government is not the bottom up. We need to get it into the hands of the little guy. I live in a third world country and I watched my government, along with every other government, take away freedoms, liberties and abuse human rights over these past few years, not to mention watch them run our country into the ground over the last few decades, so yes, I do think they're evil. There are alternatives paths we can take",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8y71nd",
                                                            "author": "godofleet",
                                                            "score": 2,
                                                            "created_utc": 1652797599.0,
                                                            "response": ">There are alternatives paths we can take\n\nI am not saying there aren't ... Everyone should be promoting/educating folks about bitcoin...\n\nSincerely- what do you have in mind? Word of mouth?\n\nBut state recognition/adoption IS critical because that's the reality of how humans have organized themselves thus far.\n\nYou may not trust your states leadership but if they promote/educate their populace about bitcoin, it benefits the PEOPLE...\n\nConsider that perhaps you are blinded by your hatred for states... They can and have historically been used as tools for/by the people - for the betterment of said people. It's not perfect, but it's the reality we live in.",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "i8y6cgm",
                                                            "author": "misc6674",
                                                            "score": 1,
                                                            "created_utc": 1652797294.0,
                                                            "response": "I completely agree that centralized governments typically do not have their peoples best interest at heart. My hope is that these governments pushing / accepting bitcoin will lead to a broader, bottom up adoption of their population.\n\nMy bitcoin journey, which is likely that of others, would then hopefully follow: buy BTC on centralized exchange > learn and research bitcoin > buy more bitcoin > learn and research self-custody / sovereign individual > slowly move to self-custody > research non-KYC ways of obtaining bitcoin > continue stacking.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i8yl940",
                                    "author": "Lets_Hunt",
                                    "score": 1,
                                    "created_utc": 1652803534.0,
                                    "response": "🤣",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8y0lgf",
                    "author": "KualaLJ",
                    "score": -9,
                    "created_utc": 1652794715.0,
                    "response": "WTF is wrong with this sub? \n\nWe don’t want or need government involvement and least of all 3rd world corrupt governments. This is not a good thing long term.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8y48ot",
                            "author": "Letsmakeitawsome",
                            "score": 19,
                            "created_utc": 1652796381.0,
                            "response": "BTC is free for everyone to participate. You need to change your attitude",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8yedoy",
                                    "author": "rmzy",
                                    "score": 2,
                                    "created_utc": 1652800695.0,
                                    "response": "Yeah it’s free. Just forget your debt, adopt the new principal. Fuckin morons. These countries drove their dollar to shit and think they gon make btc do wonders.,.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8yeucf",
                                            "author": "Letsmakeitawsome",
                                            "score": 3,
                                            "created_utc": 1652800885.0,
                                            "response": "Why not?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i921dcj",
                                                    "author": "xjx4060",
                                                    "score": 1,
                                                    "created_utc": 1652868735.0,
                                                    "response": "Glad that I am with the right side, we gotta do so much good.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i8y594q",
                                    "author": "KualaLJ",
                                    "score": -9,
                                    "created_utc": 1652796821.0,
                                    "response": "It is literally not free",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8y9ovc",
                                            "author": "Aeriq",
                                            "score": 4,
                                            "created_utc": 1652798726.0,
                                            "response": "Are you literally stupid ? What kind of holes do square pegs belong in?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8yaqs4",
                                                    "author": "KualaLJ",
                                                    "score": -4,
                                                    "created_utc": 1652799162.0,
                                                    "response": "Please share how I get free Bitcoin!",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8ycrjm",
                                                            "author": "Letsmakeitawsome",
                                                            "score": 4,
                                                            "created_utc": 1652800008.0,
                                                            "response": "Free to participate. It’s Permission less",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8yd87e",
                                                                    "author": "KualaLJ",
                                                                    "score": -4,
                                                                    "created_utc": 1652800205.0,
                                                                    "response": "The fuck does that mean?",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i8ydocp",
                                                                            "author": "lots_of_cheese",
                                                                            "score": 5,
                                                                            "created_utc": 1652800396.0,
                                                                            "response": "Free as in freedom, not free as in 0$",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        },
                                                                        {
                                                                            "id": "i8ydlqi",
                                                                            "author": "Letsmakeitawsome",
                                                                            "score": 2,
                                                                            "created_utc": 1652800365.0,
                                                                            "response": "You can adopt Bitcoin standard at anytime. You can convert to Bitcoin as much money as you want. When you want. Without asking anyone for permission to do so. That’s why it’s free to participate. Same applies for running nodes and Bitcoin mining",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "i8yg2nh",
                                                            "author": "stayyfr0styy",
                                                            "score": 4,
                                                            "created_utc": 1652801398.0,
                                                            "response": "He didn’t say bitcoin is free, he said it’s free to participate in. You can buy bitcoin at the market price and there is no rule or anything saying you cannot do that.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8y6gfd",
                            "author": "Roik9",
                            "score": 5,
                            "created_utc": 1652797339.0,
                            "response": "The El Salvadorian government got involved and I'd argue its going pretty well...\nI'm currently in El Salvador, to see first hand what this adoption has brought, and despite the vast majority of citizens not understanding the magnitude of making Bitcoin legal tender, it has given them their \"own\" tender, which cannot be manipulated or controlled by any outside nation (as is the case with USD)... in the short term and long term, this will transform El Salvador for the better... any nation which do not have their own defacto tender (like the vast majority of the African nations) can only benefit from adoption.\nPeople need to use the currency, if nobody does, what's the point. This is what Bitcoin was created for. No government, be it corrupt or not, can control bitcoin, that's the whole point of the protocol.\n\nEdit: forgot to mention, its a different story that places such as the US and particularly the EU want to regulate bitcoin to make it unavailable to their own citizens, THAT we don't need.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8y8hzh",
                                    "author": "KualaLJ",
                                    "score": -4,
                                    "created_utc": 1652798224.0,
                                    "response": "Sounds like someone invested in this",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8yblek",
                                            "author": "Roik9",
                                            "score": 5,
                                            "created_utc": 1652799519.0,
                                            "response": "Why else would anyone be on the Bitcoin subreddit?.. O.o\n\nAnd I guess I'm sorry for hoping for financial equity in this world... :(",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8yc7qt",
                                                    "author": "KualaLJ",
                                                    "score": 2,
                                                    "created_utc": 1652799777.0,
                                                    "response": "You haven’t been around these places long, have you.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i8ygeo0",
                                                    "author": "New_Confusion2034",
                                                    "score": 1,
                                                    "created_utc": 1652801538.0,
                                                    "response": "Financial equity is a myth. Countries that produce more, tend to get more. \n\nYou guys think you can break the laws of thermodynamics and bring about some kind of energy equity that goes against how we weigh economic value.\n\nGood luck. Life is an awakening process. Time is the best teacher.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8y152e",
                            "author": "CapivaraMan",
                            "score": 5,
                            "created_utc": 1652794969.0,
                            "response": "game theory playing",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8y9mc6",
                            "author": "Aeriq",
                            "score": 2,
                            "created_utc": 1652798696.0,
                            "response": "You’re also stupid as fuck, wow can’t believe how prevalent these types of moronic fuckin thinking we still have here. \n\nGovernments are who decide whether every “sale/transaction” should be taxed 0% or 50% bUt We DoNt NeEd gOvErNmEnT says the dumbass anarchocapitalist. \n\nI can understand distrust for government considering how they’ve handled the money supply. That’s why bitcoin is so important, they can only opt in and follow the rules or try to ignore it or ban it which is futile.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i923pu7",
                                    "author": "CoziestPine",
                                    "score": 1,
                                    "created_utc": 1652870631.0,
                                    "response": "They need to learn so many things man, they are so wrong.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8yagbw",
                                    "author": "KualaLJ",
                                    "score": 0,
                                    "created_utc": 1652799041.0,
                                    "response": "I’m guessing you have .00001 BTC",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8y67sg",
                            "author": "Bones22ff",
                            "score": -2,
                            "created_utc": 1652797239.0,
                            "response": "\\+1, bitcoiners online became statists, only interested in something that's going to pump their bags so that they can accumulate more fiat. gotta find the few that still believe in the cypherpunk vision and are building towards it",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8ygivs",
                                    "author": "New_Confusion2034",
                                    "score": 2,
                                    "created_utc": 1652801587.0,
                                    "response": "That's cute. \"Viva la revolution!\"",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8xt5lm",
                    "author": "kitastrophae",
                    "score": 1,
                    "created_utc": 1652790955.0,
                    "response": "That’s a lot of bankers.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ynuij",
                    "author": "basedisciple",
                    "score": 1,
                    "created_utc": 1652804610.0,
                    "response": "Huge W",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8z17zl",
                    "author": "allovernow11",
                    "score": 1,
                    "created_utc": 1652809963.0,
                    "response": "State bank of Pakistan . The only big Asian country.\nGood to see it gaining worldwide interest.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8zd05p",
                    "author": "Euphoric_Luck_8126",
                    "score": 1,
                    "created_utc": 1652814774.0,
                    "response": "This is straight propaganda",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9248nz",
                            "author": "mifalkash",
                            "score": 0,
                            "created_utc": 1652871026.0,
                            "response": "How is that a propaganda? Please explain me what you mean.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i92klst",
                                    "author": "Euphoric_Luck_8126",
                                    "score": 1,
                                    "created_utc": 1652880548.0,
                                    "response": "If you are not trolling, this is a conference that has happened every year to talk about financial regulation. They might have talked any Bitcoin but this is not the first ever nation state Bitcoin conference at all. [Link](https://www.afi-global.org/events/digital-financial-services-sme-finance-working-group-meeting/).",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8zm2w4",
                    "author": "hoangnd1",
                    "score": 1,
                    "created_utc": 1652818506.0,
                    "response": "I am not sure all these people are keen being pictured here... \n\nMaybe you should remove this photo.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i926ard",
                            "author": "bitchipmeister",
                            "score": 1,
                            "created_utc": 1652872498.0,
                            "response": "How can it be \"essentially\" they did or they didn't are you twisting the facts and forwarding misinformation again.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i905uxs",
                    "author": "BitcoinUser263895",
                    "score": 1,
                    "created_utc": 1652827051.0,
                    "response": "Not at all what this meeting is.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i90hc0b",
                    "author": "FanInternational9315",
                    "score": 1,
                    "created_utc": 1652832531.0,
                    "response": "Incorrect, you goon",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i92g4xl",
                            "author": "jamesnick2327",
                            "score": 1,
                            "created_utc": 1652878344.0,
                            "response": "Would be interesting to label these guys and follow their countries futures if they end up goong down a bitcoin path and what happens to the ones that don’t.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8ywlzk",
                    "author": "wageslavewealth",
                    "score": 0,
                    "created_utc": 1652808127.0,
                    "response": "This can’t be a real photo. \n\nThe media tells me Bitcoin is only for white men",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9296y9",
                            "author": "bigbadgaz",
                            "score": 1,
                            "created_utc": 1652874406.0,
                            "response": "It's a real photo and we all have to agree with it my man.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8ydrjh",
                    "author": "rmzy",
                    "score": -3,
                    "created_utc": 1652800434.0,
                    "response": "Are these the under developed countries that shit their economy looking toward Bitcoin as a way out? Just forget about your debt and adopt Bitcoin? Will that work for the world?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8yoxz0",
                            "author": "supersb360",
                            "score": 2,
                            "created_utc": 1652805049.0,
                            "response": "Looks like American control is slipping. We don’t have enough bombs to take care of all these $ traitors…",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i90rbiu",
                                    "author": "So4So2Good",
                                    "score": 2,
                                    "created_utc": 1652837242.0,
                                    "response": "exactly the weapons that remain in America are the ones that they use to kill each other. the rest are already in Ukraine been wasted, sold in the black market or simply taken as trophies by the Russians.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8yp8yj",
                                    "author": "rmzy",
                                    "score": -1,
                                    "created_utc": 1652805171.0,
                                    "response": "Why?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8yrsmr",
                                            "author": "supersb360",
                                            "score": 1,
                                            "created_utc": 1652806192.0,
                                            "response": "That’s too many places and people to bomb. And all the made up reasons to do it? We’ve probably got the propaganda machine running 24/7 already to fabricate disinformation. Now we will need the bomb machine to start running 24/7 so we can keep the money printer running 24/7..",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8xzv82",
                    "author": "snowdropvivi",
                    "score": -8,
                    "created_utc": 1652794366.0,
                    "response": "well damn, look at all those people that could fck up btc anytime",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8y4g7d",
                            "author": "Letsmakeitawsome",
                            "score": 5,
                            "created_utc": 1652796475.0,
                            "response": "Like how? China was fighting with BTC and mining and now they are losing billions of dollars each year because mining moved to other countries.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8ye6xl",
                                    "author": "rmzy",
                                    "score": -2,
                                    "created_utc": 1652800615.0,
                                    "response": "What makes you think they are losing? They banned btc and took control over everyone bag in China. That’s not a loss bro",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8yezef",
                                            "author": "Letsmakeitawsome",
                                            "score": 2,
                                            "created_utc": 1652800943.0,
                                            "response": "To miss the whole industry and billions of dollars. Sounds like a loss",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9213u0",
                                                    "author": "jeltete",
                                                    "score": 1,
                                                    "created_utc": 1652868504.0,
                                                    "response": "Damn man, I can't believe these people still arguing for Bitcoin and china lol. We all know that China is losing like hell, Bitcoin market is the fucking future.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i924yv5",
                                            "author": "tomoriley1975",
                                            "score": 1,
                                            "created_utc": 1652871568.0,
                                            "response": "Dude you are really saying that what makes us think they are losing? Lmao man. You really don't know much about bitcoin market, we can't help you with that.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8y4mwl",
                            "author": "not_SatoshiNakamoto",
                            "score": 6,
                            "created_utc": 1652796555.0,
                            "response": "How?",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8y4vsb",
                            "author": "Hank___Scorpio",
                            "score": 6,
                            "created_utc": 1652796661.0,
                            "response": "I imagine if I threw a dart at a dictionary 13 times I'd come up with a collection of words more valuable than this.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8y5exn",
                                    "author": "Limos42",
                                    "score": 3,
                                    "created_utc": 1652796892.0,
                                    "response": "Expecting a seed phrase?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8y5t4q",
                                            "author": "Hank___Scorpio",
                                            "score": 3,
                                            "created_utc": 1652797066.0,
                                            "response": "Double whammy, randomly get the satoshi wallet and it just so happens to be a convincing argument?",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8y9fov",
                    "author": "po00on",
                    "score": 1,
                    "created_utc": 1652798619.0,
                    "response": "is Bukele in the photo?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8yb03s",
                    "author": "I-Know-What-To-Do",
                    "score": 1,
                    "created_utc": 1652799270.0,
                    "response": "78 to 80 folks out there.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ygu0m",
                    "author": "PumpkinSpice2Nice",
                    "score": 1,
                    "created_utc": 1652801715.0,
                    "response": "I wonder what percentage of the 21 million Bitcoin those attending own as a whole.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i91zmua",
                            "author": "thojenkins",
                            "score": 1,
                            "created_utc": 1652867212.0,
                            "response": "Don't know but I guess that's a large amount of number.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8yn20h",
                    "author": "fredrico_goncalvez01",
                    "score": 1,
                    "created_utc": 1652804289.0,
                    "response": "❤️",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ynugz",
                    "author": "Lokeycommie",
                    "score": 1,
                    "created_utc": 1652804610.0,
                    "response": "Bitcoins existence threatens the idea of nation states.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8zw4pb",
                            "author": "outdatedrhombus",
                            "score": 1,
                            "created_utc": 1652822715.0,
                            "response": "Lol",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8z4xgs",
                    "author": "Mojicana",
                    "score": 1,
                    "created_utc": 1652811478.0,
                    "response": "I bet they're not talking about what they want to get us for Christmas.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ztwcf",
                    "author": "BITHIGHCOIN",
                    "score": 1,
                    "created_utc": 1652821770.0,
                    "response": "Were there any talks that were especially interesting/well received? If so, any links to videos of the presentations?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8zw8u6",
                            "author": "outdatedrhombus",
                            "score": 2,
                            "created_utc": 1652822762.0,
                            "response": "There were no bitcoin talks. This sub just likes to pretend there were",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i91wip9",
                            "author": "ericargentum",
                            "score": 1,
                            "created_utc": 1652864347.0,
                            "response": "Investment field is investment certainty:\n\n1. Investing in the field of encryption is just like doing business. If you choose the right direction, you have to go all the way.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8zv3d6",
                    "author": "FiatDiaper6000",
                    "score": 1,
                    "created_utc": 1652822280.0,
                    "response": "Probably nothing",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8zvkfn",
                    "author": "polished_pole",
                    "score": 1,
                    "created_utc": 1652822478.0,
                    "response": "this does not necessarily translate to price action",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8zyt34",
                    "author": "Much_Dependent_6313",
                    "score": 1,
                    "created_utc": 1652823876.0,
                    "response": "Does anyone know how did the discussion go? about banking the unbanked, and bitcoin !",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i90ppe3",
                            "author": "Snow75",
                            "score": 1,
                            "created_utc": 1652836483.0,
                            "response": "It wasn’t about Bitcoin.\n\nhttps://www.afi-global.org/newsroom_speeches/25th-dfswg-and-18th-smefwg-meetings-opening-remarks-by-afi-policy-programs-implementation-director-eliki-boletawa/",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i90plr9",
                    "author": "Snow75",
                    "score": 1,
                    "created_utc": 1652836435.0,
                    "response": "It wasn’t about Bitcoin:\n\nhttps://www.afi-global.org/newsroom_speeches/25th-dfswg-and-18th-smefwg-meetings-opening-remarks-by-afi-policy-programs-implementation-director-eliki-boletawa/",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i90rq55",
                    "author": "akshaysri00",
                    "score": 1,
                    "created_utc": 1652837429.0,
                    "response": "is anywhere any video of the conference presentations?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i90x2nj",
                    "author": "Vipssrr",
                    "score": 1,
                    "created_utc": 1652839954.0,
                    "response": "I was reading that the Governments allows management companies to increase Rent/Lease in U.S up to 5 percent + another percent proportional to (Inflation) rise! This makes no sense. People literally have less every year do to inflation and yet the government steals from regular citizens by increasing cost another 5 percent in top of the inflation increase. What kind of politicians makes these laws to literally hurt regular citizens already struggling. I hope Bitcoin can really help fix some of these issues, by removing the money away from government power. Governments of suppose to charge tax not control money itself.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i91wdz0",
                            "author": "SmoothGoing",
                            "score": 2,
                            "created_utc": 1652864223.0,
                            "response": "Owners of the properties should be able to set any rent price they want. You're not entitled to shelter. Pay market rent price or buy your own.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i92d8xz",
                                    "author": "Vipssrr",
                                    "score": 1,
                                    "created_utc": 1652876790.0,
                                    "response": "I believe it should be illegal for Owners to raise rent based on Market prices. Market prices are nothing more than Banks inflating the price, affordabilty is manufacture by manipulating interest rates on massive loans eventually causing defaults and market crashes over and over around the world. Bitcoin should help with the stopping of the monitization of homes. Hopefully you dont own and rent property you might be the worst landlord in history.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i913llk",
                    "author": "MotionDimension",
                    "score": 1,
                    "created_utc": 1652843157.0,
                    "response": "How do I find a modern apt/house to rent there? Not much on airbnb.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i91x13v",
                    "author": "rankinrez",
                    "score": 1,
                    "created_utc": 1652864813.0,
                    "response": "This is not a “Bitcoin meet-up”.\n\nhttps://www.afi-global.org/events/digital-financial-services-sme-finance-working-group-meeting/",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i92ffyf",
                    "author": "13dca",
                    "score": 1,
                    "created_utc": 1652877983.0,
                    "response": "Bitcoin is getting ahead, whoever and wherever bitcoin is always in the heart.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8y8746",
                    "author": "Rinigen",
                    "score": -11,
                    "created_utc": 1652798096.0,
                    "response": "moonsoon season?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ysmyr",
                    "author": "sergeyasv777",
                    "score": -3,
                    "created_utc": 1652806531.0,
                    "response": "Who cares about men. Take a close up all girls photo.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ymjbe",
                    "author": "OfWhomIAmChief",
                    "score": -2,
                    "created_utc": 1652804072.0,
                    "response": "How about when Gavin Andersen met with the council of foreign affairs and Satoshi went dark?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8y5q4t",
                    "author": "SkewerSk8r",
                    "score": -1,
                    "created_utc": 1652797029.0,
                    "response": "Where's Joe?!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i903z52",
                    "author": "CertainPerspective84",
                    "score": -1,
                    "created_utc": 1652826186.0,
                    "response": "Make an NFT of this pic, this is going to be epic in a few decades.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8yhszn",
                    "author": "justlikemydad",
                    "score": 0,
                    "created_utc": 1652802114.0,
                    "response": "prolly the last",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ykx4t",
                    "author": "coredweller1785",
                    "score": 0,
                    "created_utc": 1652803395.0,
                    "response": "I wish I could post the picture of the world Bank delegates who went to China in the 80s for the reform package meetings.\n\nThis picture reminds me of those images which was a transformative time in history.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8yones",
                    "author": "SuspiciousStable9649",
                    "score": 0,
                    "created_utc": 1652804931.0,
                    "response": "At least the price stopped falling for a bit.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8z4bf1",
                    "author": "wxibing2013",
                    "score": 0,
                    "created_utc": 1652811225.0,
                    "response": "Smart, young, good looking people.\n\nThe fiat currencies can't compete!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i908s28",
                    "author": "Busy-Succotash9701",
                    "score": 0,
                    "created_utc": 1652828417.0,
                    "response": "Is Lady GaGa in there?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i90jqa6",
                    "author": "CANUHODL",
                    "score": 0,
                    "created_utc": 1652833661.0,
                    "response": "Who cares about him",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i911o45",
                    "author": "rancor60",
                    "score": 0,
                    "created_utc": 1652842176.0,
                    "response": "I’m interested te see which bitcoiners will be there in July when it gets Africa hot .",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i91io5y",
                    "author": "DubiousWizard",
                    "score": 0,
                    "created_utc": 1652852418.0,
                    "response": "Dictators of clown countries assemble and discuss how to scam their people and launder tax money",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}