{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uq4odp",
            "title": "still cannot understand how bitcoin can win with 7 transaction per second (expert opinion needed)",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/uq4odp/still_cannot_understand_how_bitcoin_can_win_with/",
            "author": "vitalyevodin",
            "created_utc": 1652616321.0,
            "score": 3,
            "num_comments": 55,
            "subreddit": "BitcoinBeginners",
            "selftext": "I know but LN network but if it is like galaxy currency even store of value how is it possible to use it in example if people will leave on several planets and we will be much more \n\nI don’t see that LN is solution for all this, really interested of thought about future of bitcoin adaptation",
            "stickied": false,
            "comments": [
                {
                    "id": "i8or9oa",
                    "author": "bitusher",
                    "score": 8,
                    "created_utc": 1652616693.0,
                    "response": ">I don’t see that LN is solution for all this\n\nWhy not? Be specific. Lightning is merely one way bitcoin is scaling and allows for millions of transactions per second",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8pyogr",
                            "author": "jondubb",
                            "score": 0,
                            "created_utc": 1652637347.0,
                            "response": "Think of BTC as an asset more than daily use.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8q377h",
                                    "author": "bitusher",
                                    "score": 2,
                                    "created_utc": 1652639326.0,
                                    "response": "If that is how you want to use it , that's up to you , but to me BTC will remain principally p2p money that i spend daily and many of the merchants I spend with keep the bitcoin",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8pt0x1",
                    "author": "ScrewTheBanker",
                    "score": 3,
                    "created_utc": 1652634898.0,
                    "response": "I'll bet Satoshi didn't expect a company like Strike to replace Visa and Mastercard as a payment rail. \nI think people worry too much about bitcoin scaling and forget that technologies are being built to maximise the use of bitcoin.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8x7qc3",
                    "author": "OneStepAheadApp",
                    "score": 3,
                    "created_utc": 1652774573.0,
                    "response": "Think about LN like a gold and money early stage where dollar was backed by gold reserves. Of course I am not going to dive in discussion about FIAT, but this concept of removing gold and make it underlying asset for paper money already was in use and whether you like it or not worked for some time. The benefit in case of LN is that you cannot decouple from Bitcoin.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8orhlk",
                    "author": "bitusher",
                    "score": 6,
                    "created_utc": 1652616839.0,
                    "response": ">\"can win with 7 transaction per second\"\n\n\nThe size of the block doesn't matter much in the context , what matters is the tx throughput, so here is the math if you are curious- (not including future improvements with MAST and schnorr)\n\nhttps://bitcoin.stackexchange.com/questions/59408/with-100-segwit-transactions-what-would-be-the-max-number-of-transaction-confi\n\n4 bytes version\n\n1 byte input count\n\nInput\n\n36 bytes outpoint\n\n1 byte scriptSigLen (0x00)\n\n0 bytes scriptSig\n\n4 bytes sequence\n\n1 byte output count\n\n8 bytes value\n\n1 byte scriptPubKeyLen\n\n22 bytes scriptPubKey (0x0014{20-byte keyhash})\n\n4 bytes locktime\n\n>This sums up to a total of 82 bytes for the non-witness part. So with a total non-witness blocksize of 1 million bytes we get a maximum of 12195 transactions. Assuming that all spent outputs were P2WPKH the witness part for each transaction consists of two pushes: one for the signature and one for the pubkey. These are around 72 bytes and 33 bytes long, and each need a length prefix of 1 byte. Additionally there is 1 byte witness version. So the total witness size is 108 bytes. With 3 MB of space in the witness block left, this brings us to about 27777 witnesses per block. So the limiting factor is the space in the non-witness part of the block, so that's the final number that we should consider.\n\n>Notice that I used the non-segwit serialization for the non-segwit part since that is what non-upgraded nodes will enfore. Notice also that this is an extreme example, since most transactions are not single-input-single-output. A corresponding non-segwit transaction would have a size of 192 bytes, which, together with the 1MB size limit brings us to 5208 transactions per block, **compared to 12195 max segwit transaction per block.**\n\n>The second part of your question regarding maximum UTXO in a block is rather easy. We'd like to amortize the overhead from the transaction structure, and maximize inputs + outputs. Since inputs are larger than outputs we will simple use a single input and compute the **maximum number of outputs that fits in a block which is 32256.** Since the outputs are non-segwit data, it also changes minimally from before the segwit activation (only the signature from the one input is moved to the segwit part). Therefore the maximum UTXO churn is 1 UTXO gets removed, 32256 get added. For comparison, without segwit the maximum number added was 32252. Notice that there may be other limits that I haven't considered, but this definitely are the upper limits, and these limits are unlikely to have changed during the activation of segwit.\n\n**12195/600 = 20 TPS for 10 minute average blocks max**\n\n**32256/600 = 53.76 TPS for 10 minute average blocks max for maximum batching in a block**\n\nOf course you know as well as I do Blocks are often found quicker than 10 minutes so these TPS numbers are variable and sometimes it will be higher than this. Also this doesn't include tx throughput on other layers which allows for millions of TPS.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8pcilf",
                    "author": "DukeFlipside",
                    "score": 4,
                    "created_utc": 1652627681.0,
                    "response": "Betamax was technically better than VHS but that didn't make it win.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8pes9d",
                            "author": "bitusher",
                            "score": 5,
                            "created_utc": 1652628713.0,
                            "response": "This is especially true of money where the most important properties are trust, security, liquidity, stability, scarcity, acceptability, and its network effect and not some new gimmick or feature.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8pdsc9",
                            "author": "cryptochill",
                            "score": 3,
                            "created_utc": 1652628258.0,
                            "response": "LOL. This is one of my usual examples I like to use in explaining certain things as well.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8pv0fu",
                            "author": "N0T_A_DOCT0R",
                            "score": 1,
                            "created_utc": 1652635755.0,
                            "response": "Also HD DVDs were better than Blu-Ray, don’t even get me started on laserdisc…",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8p4zmb",
                    "author": "DavidKens",
                    "score": 3,
                    "created_utc": 1652624216.0,
                    "response": "You’re correct that Bitcoin has problems scaling to work at inter-planetary scale. I’d just point out that this is an deep problem about the propagation of information through space, and doesn’t have much to do with Bitcoin specifically.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8p7sfw",
                            "author": "bitusher",
                            "score": 2,
                            "created_utc": 1652625532.0,
                            "response": "This problem specifically has to deal with the limitations in the speed of light where a 10 min block target is too quick and a mars colony would need to use  a sidechain as parodied in this video \n\nhttps://youtu.be/mDeA61RY1A4",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8p8e4c",
                                    "author": "DavidKens",
                                    "score": 2,
                                    "created_utc": 1652625805.0,
                                    "response": "Haha! Love the video!",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8p9gpn",
                                            "author": "bitusher",
                                            "score": 2,
                                            "created_utc": 1652626293.0,
                                            "response": "Its an april fools joke that turns out to be exactly what will likely happen. cheers",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8plmzy",
                    "author": "SwurveMan",
                    "score": 2,
                    "created_utc": 1652631710.0,
                    "response": "First Mover Advantage is quite a big factor",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8pm352",
                            "author": "vitalyevodin",
                            "score": 1,
                            "created_utc": 1652631900.0,
                            "response": "what is that, what do you mean ?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8pp7z5",
                                    "author": "SwurveMan",
                                    "score": 0,
                                    "created_utc": 1652633247.0,
                                    "response": "Bitcoin was the first cryptocurrency, so it has the biggest impression on everyone in crypto and whenever they hear ‘crypto’",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8ppoqo",
                                            "author": "vitalyevodin",
                                            "score": 1,
                                            "created_utc": 1652633449.0,
                                            "response": "mostly bitcoin is both an implementation and protocol so in current topic it talks about protocol and possible algorithms and thoughts about scalability",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8q85c5",
                                                    "author": "bitusher",
                                                    "score": 2,
                                                    "created_utc": 1652641526.0,
                                                    "response": "Bitcoin is also an evolving open source protocol where almost all of Satoshi's code has changed over the years . If something is useful it can be added to bitcoin's code or built upon other layers that work with bitcoin.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i8pvnlj",
                                                    "author": "N0T_A_DOCT0R",
                                                    "score": 1,
                                                    "created_utc": 1652636030.0,
                                                    "response": "He means it was the first working/useable crypto currency. Like coke was the first cola so it has a certain (market) advantage over Pepsi which was an imitation.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8pzafh",
                                                            "author": "MuchTemperature6776",
                                                            "score": 1,
                                                            "created_utc": 1652637617.0,
                                                            "response": "But Pepsi has a larger market cap than Coca Cola, so that example doesn’t work.\n\nWhile Coca Cola is larger with beverages in general then Pepsi succeeded more as a company.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8uhs8i",
                                                                    "author": "N0T_A_DOCT0R",
                                                                    "score": 1,
                                                                    "created_utc": 1652723679.0,
                                                                    "response": "Coca Cola had that advantage specifically to the soft drink, Pepsi the company’s market cap is largely from fast food/snacks, but Coke the soft drink has and does outperform Pepsi’s version, it’s actually an interesting example because you can have first mover momentum in me aspect but not others.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8oqp13",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1652616322.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8rl7b3",
                    "author": "idome1",
                    "score": 1,
                    "created_utc": 1652664039.0,
                    "response": "Quit worrying just know it's the 🤴 👑 and that's all you need to know. Just look at the past week.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8s3i2n",
                    "author": "BTCMachineElf",
                    "score": 1,
                    "created_utc": 1652673229.0,
                    "response": "Bitcoin (and any true crypto) cannot work on an interplanetary scale because lag would cause region isolated chain splits.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}