{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "upl5wg",
            "title": "40% of all dollars were printed in 2020.",
            "url": "https://www.reddit.com/r/Bitcoin/comments/upl5wg/40_of_all_dollars_were_printed_in_2020/",
            "author": "_RetroDigital_",
            "created_utc": 1652546664.0,
            "score": 141,
            "num_comments": 89,
            "subreddit": "Bitcoin",
            "selftext": "Read that title carefully. 40%. It doesn't even include the dollars printed in 2021, and the first quarter of 2022.\n\nPeople around Reddit are saying \"the dollar is getting stronger!!1\". No it isn't. It is getting stronger compared to other currencies that haven't stopped the money printing. I don't care who you are or what bridge you are trying to sell me...printing 40+% of all your nations currency in the span of 2 years IS going to have repercussions going forward that we haven't felt yet. \n\nThe BTC to Dollar exchange rate is being affected by the fact that those who purchased BTC as a speculative asset are moving their money out of BTC back into dollars because they are fearful of a market crash. But your SATS haven't lost value in compared to the other SATS on the market...they will only go up in time.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8ldz7w",
                    "author": "Informal-Act1282",
                    "score": 39,
                    "created_utc": 1652546801.0,
                    "response": "The dollar is not getting stronger just more expensive to borrow due to interest rate increases, yikes.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8lngqi",
                            "author": "Keith_Kong",
                            "score": 11,
                            "created_utc": 1652551123.0,
                            "response": "Right, it’s more expensive to create more dollars, so it’s harder to leverage up investments. Bitcoin = investment right now so Bitcoin go down.\n\nIn future, Bitcoin go up.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8lw07d",
                                    "author": "Informal-Act1282",
                                    "score": 5,
                                    "created_utc": 1652555031.0,
                                    "response": "People cant borrow so they are selling their invrstments to afford stuff",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8lw7rx",
                                            "author": "Keith_Kong",
                                            "score": 8,
                                            "created_utc": 1652555127.0,
                                            "response": "That’s probably true in some cases, but most of it is wealthy institutions deleveraging their margin. They aren’t selling so they can afford their weekly bananas going up 25 cents.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8lm37i",
                    "author": "TheHodlingHermit",
                    "score": 16,
                    "created_utc": 1652550498.0,
                    "response": "DXY looks \"strong\" because other fiat is doing even more shitty. All fiat can suck my nutsack.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8m7fn6",
                    "author": "BeastMiners",
                    "score": 5,
                    "created_utc": 1652560355.0,
                    "response": "40% of PRINTED dollars. Don't mislead.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8lvt7k",
                    "author": "dfunkmedia",
                    "score": 4,
                    "created_utc": 1652554939.0,
                    "response": "You know we had this same argument back in 2008 and everything turned out _fin..._\n\nOh fuck",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8lqyk2",
                    "author": "lordsamadhi",
                    "score": 3,
                    "created_utc": 1652552698.0,
                    "response": "I wish I could give this post another upvote.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8lv3bo",
                    "author": "livewhilealive",
                    "score": 3,
                    "created_utc": 1652554605.0,
                    "response": "Printed? I don’t think anything’s been actually printed",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8lpghl",
                    "author": "wtfsperday",
                    "score": 5,
                    "created_utc": 1652552022.0,
                    "response": "Hey I have an idea. Wanna fix inflation? STOP PRINTING MONEY!!\n\nBitcoin fixes this.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8lydzj",
                    "author": "Peccataclamantia",
                    "score": 3,
                    "created_utc": 1652556150.0,
                    "response": "Totally wrong.\n\nIn a subjective free-float zero sum debt based money system there is NO money supply.\n\nRepeat after me. There is no money supply.\n\nAll dollars are claims on someones sweat equity. That is all.Your neighbor flipping burgers at mcdonalds may have qualified for a mortgage and those new ‘dollars’ are backed by his future burger flipping.\n\nYou are always either a creditor or a debtor or a combination of both in this system. The majority of the population is a debtor-creditor being overweight towards the debtor side.\n\nThe collateral that backs the dollars(loans) is completely arbitrary and subjective. The majority of collateral is entirely virtual gambling debts, ie mortgages secured by the \\*belief\\* that home values always go up.\n\nHardly any of the dollars are secured by knowable principles that govern the universe and allow higher output innovation to occur.\n\nThe collateral is all guesses.\n\nWhat causes the instability of this system? The debts grow at compounding rates due to usury being a fundamental presupposition. All dollars(debts) are issued with interest that compounds at arbitrarily set rates. \\*There are no objective reasons for why an interest rate is what it is\\* just like a sports stadium has arbitrary rules.\n\nThere is always a shortage of sufficient credit worthy borrowers in this system which causes offered goods/service to always exceed money.\n\nWhere does the inflation come from? Again usury. Compounding requires prices to \\*increase\\* if innovation isn‘t increasing productivity fast enough. What has kept prices lower? Wage arbitrage ie wage slavery. Enslaving inferior cultures has allowed the NY-London based dollar system to work this long.\n\nAs the labor force collapses due to the unrepayability of the debts, the total liabilities will be collaterallized by fewer and fewer sweat equity meaning a nominal inflation and physical deflation.\n\nThe physical economy is \\*deflating\\* while the virtual-dollar economy is hyper inflating.\n\nCan bitcoin ’protect you’?\n\nNo.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8m0vjk",
                            "author": "moryroar",
                            "score": 4,
                            "created_utc": 1652557321.0,
                            "response": "you worked really hard to sound smart from moms basement",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "upp3q2",
            "title": "Been Buying Bitcoin every month since October 2017 (56 months)",
            "url": "https://www.reddit.com/r/Bitcoin/comments/upp3q2/been_buying_bitcoin_every_month_since_october/",
            "author": "jamespunk",
            "created_utc": 1652558335.0,
            "score": 72,
            "num_comments": 36,
            "subreddit": "Bitcoin",
            "selftext": "So I got obsessed with bitcoin back in October 2017. Was really bummed I found it so late and it was too late to have any sizeable amount of bitcoin anymore. Decided to buy as much as possible and tightened the budget to buy maximum amount every month. Been doing that for 56 months and gonna continue until my stack gives me freedom/security enough to quit the fiat hamster wheel. Decided to document my journey in a blog. Enjoy!\n\n[https://er-bybitcoin.com/stacking-em-volume-22-may-2022/](https://er-bybitcoin.com/stacking-em-volume-22-may-2022/)",
            "stickied": false,
            "comments": [
                {
                    "id": "i8m57du",
                    "author": "bitcoin_islander",
                    "score": 47,
                    "created_utc": 1652559330.0,
                    "response": "Same here. Used to throw 50% of my paychecks into crypto from 2018-2020. No one believed that I went from 5k to my name to 500k in crypto at the all time high. You dont need to believe in math, it just works people. Anyway, I quit my job in 2020 and I wish you can soon as well.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8m3qk4",
                    "author": "bigglesmac",
                    "score": 11,
                    "created_utc": 1652558655.0,
                    "response": "Beauty - this is cool op. Keep stacking sats!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8m4urc",
                    "author": "sophieoliver123",
                    "score": 6,
                    "created_utc": 1652559168.0,
                    "response": "I enjoy reading your posts.  Goes to prove a good DCA strategy works really well over time",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8m3rjy",
                    "author": "18476",
                    "score": 4,
                    "created_utc": 1652558667.0,
                    "response": "You honestly have never sold any ever? Anyway, i have been saying what you said about staking for the longest time and got beat up verbally for it. A long time back it seems alot of articles dissapeared about how that staking was connected to the derivatives game and being leveraged. Hedgefunds have been stated to have about 20% of thier net worth in this crypto game. It really does all line up.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uppfke",
            "title": "Turkish Lira resumes path to hyperinflation.",
            "url": "https://i.redd.it/psbqmite1iz81.png",
            "author": "hyperinflationUSA",
            "created_utc": 1652559290.0,
            "score": 3,
            "num_comments": 1,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "up7obz",
            "title": "1 Bitcoin = 1 Bitcoin and Hash Rate is at an all time high — that’s all.",
            "url": "https://coinmarketcap.com/currencies/bitcoin/",
            "author": "satoshishash",
            "created_utc": 1652496000.0,
            "score": 58,
            "num_comments": 42,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8jo9no",
                    "author": "mgd09292007",
                    "score": 4,
                    "created_utc": 1652506704.0,
                    "response": "ELI5?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8jp0qr",
                            "author": "satoshishash",
                            "score": 8,
                            "created_utc": 1652507251.0,
                            "response": "The chart shows Bitcoin’s 1 hour trading chart in green and the goldish color straight line represents 1 Bitcoin. The significance is that although Bitcoins’ price may change, it’s still 1 Bitcoin (out of the 21 million total there will ever be. A strong cap on supply is more unique and important than it may initially sound.) \nPeople who believe Bitcoin will be a base layer for all financial activities believe the importance is attaining a supply of Bitcoin (or satoshis, satoshis = 1/100m of 1 Bitcoin), we don’t care about the current price because it’s not a short term investment.\n\nHash rate is the relative security of a network. Bitcoin has the highest hashrate compared to all cryptocurrencies. \nBitcoins network is therefore most secure and hardest to attack.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8j6k16",
                    "author": "queer_mentat",
                    "score": 6,
                    "created_utc": 1652496076.0,
                    "response": "But what about all the FUD from people who think shitcoins are the same as Bitcoin?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8j6x9g",
                            "author": "satoshishash",
                            "score": 7,
                            "created_utc": 1652496272.0,
                            "response": "They don’t get it. Can’t help them all understand. Like Satoshi said, I don’t have time to explain.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "upkv9p",
            "title": "Hard wallet for btc that allows for multiple accounts",
            "url": "https://www.reddit.com/r/Bitcoin/comments/upkv9p/hard_wallet_for_btc_that_allows_for_multiple/",
            "author": "zandor435",
            "created_utc": 1652545815.0,
            "score": 3,
            "num_comments": 12,
            "subreddit": "Bitcoin",
            "selftext": "I have a name brand  hard wallet.  However I have been storing a small amount of btc for other family members on some exchanges.  I’d like to keep all of this btc on the same hard wallet (so I only have one recovery seed).  But I’d like to not co mingle our btc. \n\nIs anyone doing anything like this and willing to share some thoughts?\n\nAppreciate any suggestions.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8lcpp0",
                    "author": "technotrader",
                    "score": 5,
                    "created_utc": 1652546236.0,
                    "response": "Use the password feature of your BIP39 - compatible wallet. The same seed plus a unique password for each family member will generate an entirely distinct set of addresses.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8le3nd",
                    "author": "BusterGrundle",
                    "score": 3,
                    "created_utc": 1652546856.0,
                    "response": "I use a ledger nano X and have separate BTC accounts for family. It's really easy to set up.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "upqfio",
            "title": "This is why Bitcoin is important! The Federal Reserve & Inflation explained in 90 seconds!",
            "url": "https://www.youtube.com/watch?v=w3VaS8P3j3w",
            "author": "TonyLiberty",
            "created_utc": 1652562424.0,
            "score": 3,
            "num_comments": 0,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "upcrw5",
            "title": "We need to stop thinking in terms of 'buying' and 'selling'",
            "url": "https://www.reddit.com/r/Bitcoin/comments/upcrw5/we_need_to_stop_thinking_in_terms_of_buying_and/",
            "author": "tallreagan",
            "created_utc": 1652516556.0,
            "score": 3,
            "num_comments": 9,
            "subreddit": "Bitcoin",
            "selftext": "You are converting your fiat shitcoins, the ones you don't need to pay the bills of this month anyway,  to the hardest money ever invented.\n\nWhy would you ever convert that back?",
            "stickied": false,
            "comments": [
                {
                    "id": "i8k0fwl",
                    "author": "AdMountain8413",
                    "score": 3,
                    "created_utc": 1652516610.0,
                    "response": "What is „selling“?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8kbh3v",
                    "author": "Hughski",
                    "score": 3,
                    "created_utc": 1652526279.0,
                    "response": "Because it’s still hard to use BitCoins transactionally in a lot of cases. It’s been solid as an investment but as a currency it’s not exactly mainstream… that’s pretty much why.\n\nPanic selling during and because of a dip is obviously stupid but if you actually need to buy something from your investment during a dip, you’re gonna be in trouble.\n\nOf course that’s the same as with all investment but I guess it’s why BitCoin is better thought of as an asset than as a currency for the time being (at least outside of some niche albeit growing cases).",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "up0lj7",
            "title": "Anyone know if this is bad or normal?",
            "url": "https://www.reddit.com/gallery/up0lj7",
            "author": "JaydenWatters",
            "created_utc": 1652473599.0,
            "score": 4,
            "num_comments": 16,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8hw1re",
                    "author": "ndgoLiberty",
                    "score": 4,
                    "created_utc": 1652473830.0,
                    "response": "I wouldn’t say it’s normal for the last 10 months but it does happen. If you had replace by fee I would say boost it to 15sats/vbyte but you didn’t so now you just have to wait.\n\nMaybe days. Next time check mempool.space to determine what transaction fee you need to pay.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8hyjve",
                    "author": "SmoothGoing",
                    "score": 5,
                    "created_utc": 1652474922.0,
                    "response": "It's normal. Transaction fees are based on demand for block space. If you underpay the fee you have to wait. Learn how fees work https://www.reddit.com/r/Bitcoin/comments/jkw0l5/transaction_stuck_read_this/",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8i2r0m",
                    "author": "pityaka",
                    "score": 3,
                    "created_utc": 1652476791.0,
                    "response": "Don't worry like everyone said it will clear. The low transaction fee has lowered the priority but it will get sorted 👍",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "upnjt6",
            "title": "It's never a bad idea to read and analyze anti-bitcoin sentiments. Here's Why.",
            "url": "https://www.reddit.com/r/Bitcoin/comments/upnjt6/its_never_a_bad_idea_to_read_and_analyze/",
            "author": "ResponsibleWhile6991",
            "created_utc": 1652553724.0,
            "score": 71,
            "num_comments": 40,
            "subreddit": "Bitcoin",
            "selftext": "You can't be unbiased if you're just hanging around in an echo chamber. Even if you think Bitcoin is the future, even if you think those against it are uneducated and don't understand anything, it's probably still a good idea to search out the best arguments against what you're investing in.\n\nListening to other people's perspectives is never a bad idea, especially with something still so new. Even if you disagree with somebody, hearing the other side of the argument is always good so you can understand their reasoning. \n\nI am not saying that you need to listen and do what people with opposing opinions are telling you, but on this subreddit, I constantly see posts deleted, or people attacking others in comments for absolutely no reason. This subreddit should be for open discussion for all views regarding Bitcoin.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8lzmbt",
                    "author": "hurray_for_boobies",
                    "score": 14,
                    "created_utc": 1652556734.0,
                    "response": "So true.\n\nThe biggest challenge is probably finding knowledgeable critics, who know both sides of the argument and have identified credible concerns.\n\nThe recent What Bitcoin Did podcast about the risks of hyperbitcoinization was a rare gem that fits this category.\n\nIt's also what I was hoping /r/buttcoin to be but unfortunately most of it is conflating Bitcoin with some crappy wannabe cryptocurrencies or some scam NFT's to score cheap wins, not really well thought out criticism. I guess I should have known... it's practically in the name :-D",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8m3whg",
                            "author": "TheUnstoppableBTC",
                            "score": 6,
                            "created_utc": 1652558729.0,
                            "response": "buttcoin can only screech about Tether and Boted ape nfts these days. Their perpetually imminent Tether crash is their messiah. I’m sure such a thing would impact on the short term BTC-USD price, just as we saw with UST, but would naturally have no effect on the network whatsoever. \n\nBTC has slugged off the UST fallout and has a track record anti-fragility to a level which boarders on the eerie. I suspect the UST collapse would immunise bitcoin to further stablecoin issues to a degree.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8lxx9b",
                    "author": "dadlif3",
                    "score": 20,
                    "created_utc": 1652555934.0,
                    "response": "What reddit should be vs what it actually is are two completely separate things. It SHOULD be an area for free speech and active discourse between opposing points of view but it IS an echo chamber and center for self-affirming group-think.\n\nThat said I absolutely agree with seeking out an opposing point of view. Most of the vocal critics of Bitcoin demonstrate a fundamental misunderstanding of the network and therefore I ignore their criticism because it is either uninformed or misinformed.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8m495z",
                    "author": "SahnSuolulous",
                    "score": 3,
                    "created_utc": 1652558892.0,
                    "response": "The more information we have, the better.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8lxsw3",
                    "author": "TheUnstoppableBTC",
                    "score": 3,
                    "created_utc": 1652555876.0,
                    "response": "OP, have you come across many legitimate critiques? There don’t appear to be many",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8max6u",
                            "author": "Earth2Andy",
                            "score": 4,
                            "created_utc": 1652561969.0,
                            "response": "OK, I’ll bite….\n\n1/ Bitcoin will never become a day to day currency.  Bitcoin is not scalable to be used for day to day currency purposes.  Even with the lighting network overlaid there are still transaction costs to open and close a channel.  The fees associated, based on the energy consumed, make this unscalable in it’s current form.  (Happy to go into plenty more reasons why it won’t be used as a currency too, such as it’s deflationary nature, but scalability is the easiest one to cover).\n\n2/ Bitcoin will not be taken seriously as a stable store of value for another at least another 40 years, probably longer.  To be a more attractive as a store of value than the currently available options, the price of Bitcoin needs to be predictable over the long term.  Risk models for other stable assets like bonds or metals still price in events from the 70s and 80s.  Even if the price of Bitcoin stabilized today, the regular 50+% drops Bitcoin has experienced in the last decade will be priced into it’s risk profile making it unattractive as a store of value (note wild upside is not a plus for a stable store of value, that’s a feature of a speculation vehicle).  The volatility of Bitcoin has only gone up in the last 5 years not down.  This is not an indicator of it being a stable store of value any time soon.\n\n3/ Bitcoin isn’t a good uncorrelated asset.  There was for a while a school of thought that said Bitcoin was very useful as part of a portfolio, because it high upside that moved in an uncorrelated way to the rest of the market, allowing it to perform a diversification role in a balanced portfolio.  That is no longer the case, Bitcoin tracks the NASDAQ.  Maybe one day this will change, but that’s where it is right now.\n\n4/ Intrinsic demand.  The value of every currency is ultimately based supply and demand.  There is intrinsic demand for USD, every tax paying person or business in the US pays their taxes in Bitcoin.  The largest single buyer of goods and services in the world (us govt) will only pay you in USD.  Every time a gallon of gas is purchased anywhere on earth, some of that transaction ends up in USD.  Bitcoin cannot match that any time soon.\n\nSo it’s not useful as a currency, it’s not useful as a store of value, it’s not useful to stabilize a portfolio and there’s no intrinsic demand.\n\nThese are my arguments against Bitcoin.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "uppg2r",
            "title": "Alternative to Coinbase",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uppg2r/alternative_to_coinbase/",
            "author": "bbbbound",
            "created_utc": 1652559332.0,
            "score": 3,
            "num_comments": 30,
            "subreddit": "Bitcoin",
            "selftext": "Hi guys,  which exchange do you recommend?  Looking at Swan, Gemini, etc.  Just stacking, not trading.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8m5lxz",
                    "author": "Har0ldDemure",
                    "score": 11,
                    "created_utc": 1652559512.0,
                    "response": "I like Gemini for its 10 free monthly withdrawals and kraken",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8m7pfm",
                            "author": "brotherRozo",
                            "score": 4,
                            "created_utc": 1652560480.0,
                            "response": "I wanna trust the Winklevoss twins because they may be able to get revenge on Zuckerberg one day, but I also don’t wanna trust them because they’re super rich dudes",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8m8qba",
                                    "author": "Brettanomyces78",
                                    "score": 4,
                                    "created_utc": 1652560949.0,
                                    "response": "Any owners or CEOs of exchanges are super rich.  Not sure how this is relevant.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8maoh8",
                                            "author": "brotherRozo",
                                            "score": 3,
                                            "created_utc": 1652561854.0,
                                            "response": "Fear not! You can be certain it is irrelevant. To calm your worries good sir",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8m6wt1",
                    "author": "SmoothGoing",
                    "score": 5,
                    "created_utc": 1652560107.0,
                    "response": "Every large exchange is an alternative to coinbase.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8m94v1",
                    "author": "senfmeister",
                    "score": 5,
                    "created_utc": 1652561135.0,
                    "response": "Strike",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8m7k0p",
                    "author": "Financial_Pianist209",
                    "score": 3,
                    "created_utc": 1652560411.0,
                    "response": "Kucoin is the best!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8m8xhj",
                    "author": "comfyggs",
                    "score": 3,
                    "created_utc": 1652561041.0,
                    "response": "Kraken",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8m9c80",
                    "author": "bryguy4436",
                    "score": 3,
                    "created_utc": 1652561233.0,
                    "response": "Buy on strike, transfer to HWW",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}