{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ux3j94",
            "title": "Question",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/ux3j94/question/",
            "author": "Thecryptoaspect",
            "created_utc": 1653433431.0,
            "score": 2,
            "num_comments": 23,
            "subreddit": "BitcoinBeginners",
            "selftext": "Do you find talking about crypto to your friends and family more hassle than it’s worth?\n\nI feel i am wasting my breath… because it isn’t simplified and main stream.. I think you either get it or you don’t at the moment...I have spoken to various people about it and some people are all for it and it seems you if you aren’t invested in it, it’s a huge grey area of doubt and deception. The people who grate on me the most are the “ the pound/dollar has always been around it will never crash “ and they are so grounded and ignorant about it. \n\nDoes anyone else come across the close minded people or is it just my circle of friends?…",
            "stickied": false,
            "comments": [
                {
                    "id": "i9wdzg4",
                    "author": "BTCMachineElf",
                    "score": 4,
                    "created_utc": 1653454317.0,
                    "response": "I would not discuss crypto. As bitusher said, it's most scams. If you do want to help your friends, don't lead them to risky assets with questionable futures. They'll end up buying into the next Luna and blaming you for their misfortune. \n\nI have, however, made a point to ask friends what they know about bitcoin, and if they're interested in learning more. Most say no, and for them I drop it and don't bring it up again. But some have said yes and I've helped guide them on getting started.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9xqla6",
                    "author": "never-give-up-every1",
                    "score": 3,
                    "created_utc": 1653487716.0,
                    "response": "I'm not open about this to other people but sometimes if they are asking me about do I know cryptocurrency lessons or cryptocurrency platforms I always said try Netcoins Crypto Academy to learn and to trade but I'm not expressing any excitement because crypto really is a risky thing to do.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia05ru8",
                            "author": "memljivomfc",
                            "score": 1,
                            "created_utc": 1653523859.0,
                            "response": "The only crypto platforms that I've recommended was Binance and Cryptoxpress, but when the dip started i regretted ever advising anyone to join crypto because they all think I made them lose their money.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9vc7uo",
                    "author": "bitusher",
                    "score": 2,
                    "created_utc": 1653435434.0,
                    "response": ">Do you find talking about crypto to your friends and family \n\nIts worst than this because the cryptocurrency ecosystem is filled with over 99% scams and pointless projects so by talking about \"crypto\" you appear to them as a scumbag pitching a scam or an idiot and in many cases they have good reason to distrust you. \n\nMy suggestion is to do the following\n\n1) Don't pitch anything to them , not even legitimate projects like bitcoin\n\n2) At most you can either pay something in front of them or buy them dinner with bitcoin and let them ask if they are curious \n\n3) Another thing to do with family members or close friends is to gift them so bitcoin with a paper wallet (bip39) and than they will likely throw it in a drawer for a couple years but start to get interested in it and come to you asking about bitcoin when its much more valuable \n\n4) If you provide any good or service as a business accept bitcoin and perhaps even offer a discount with bitcoin \n\n5) Perhaps talk about similar concerns that bitcoin addresses instead of bitcoin directly like how high fuel is these days due to inflation",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9v7y8m",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653433432.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9vcncc",
                    "author": "blaze1234",
                    "score": 1,
                    "created_utc": 1653435639.0,
                    "response": "I would never reveal any knowledge of nor interest in crypto, to anyone",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9xwsk6",
                    "author": "igadjeed",
                    "score": 1,
                    "created_utc": 1653490312.0,
                    "response": "> talking about crypto\n\nNo crypto here, only Bitcoin",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}