{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uyj4fs",
            "title": "How to make BTC on my Trezor non-kyc and what are the benefits?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/uyj4fs/how_to_make_btc_on_my_trezor_nonkyc_and_what_are/",
            "author": "03Oliver",
            "created_utc": 1653603648.0,
            "score": 3,
            "num_comments": 19,
            "subreddit": "BitcoinBeginners",
            "selftext": "Title",
            "stickied": false,
            "comments": [
                {
                    "id": "ia4itiu",
                    "author": "bitusher",
                    "score": 7,
                    "created_utc": 1653605598.0,
                    "response": "If you are merely concerned about longterm privacy than you are likely overthinking things and the solution is rather simple.\n\n1)\tWithdraw your btc from exchange to wallet A(mobile wallet) , than send to wallet  wallet B(example - HW wallet) within a few hours and never in reverse you create more plausible deniability which is good for privacy and tax reasons. Make sure you send the entire amount each time as well. \n\n2)\tWhen you are ready to spend your bitcoin in your hardware wallet there are many ways to sell or spend the bitcoin very privately like loading the bitcoin up in a lightning wallet where chain analysis cannot track those UTXOs offchain. \n\nWith Chainanalytics exchanges and regulators are using probabilistic guess work in tracking transactions onchain. They merely assume your withdraw address likely belongs to you. By sending the bitcoin from wallet A to wallet B within a few hours you are creating plausible deniability and adding in significant doubt those UTXOs(bitcoin) belong to you and doing so in such a small window that the price change is moot to avoid creating a taxable event. At any time in the future you can privately spend the bitcoin or sell it for fiat in a private manner. \n\nIf you want immediate privacy than you can \n\nmany ATMs don't require ID and just sms verification - coinatmradar.com\nOther options are any way that doesn't require verification like this list -\n\nhttps://github.com/cointastical/P2P-Trading-Exchanges\n\nor you can buy bitcoin with ID and than coinjoin it \n\nOr you can buy bitcoin with ID than use a feature like https://samouraiwallet.com/ricochet\n\nOr you can buy with ID than send the btc between 2 lightning wallets \n\nAnd many more ways",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia4emxk",
                    "author": "AutoModerator",
                    "score": 0,
                    "created_utc": 1653603648.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}