{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "tzby91",
            "title": "\"It's time to check your financial privilege\"- Bitcoin",
            "url": "https://v.redd.it/2fsn0r802ds81",
            "author": "ohnoh18",
            "created_utc": 1649447985.0,
            "score": 1726,
            "num_comments": 172,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i3y6v89",
                    "author": "NiceDoctorBeam",
                    "score": 166,
                    "created_utc": 1649450453.0,
                    "response": "To whomever made this: ***THANK YOU!***",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i43iq9o",
                            "author": "wjtwww",
                            "score": 1,
                            "created_utc": 1649547195.0,
                            "response": "This is Amazing. This short video is more educational than many big videos.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i3y6kgs",
                    "author": "N_Kripted",
                    "score": 96,
                    "created_utc": 1649450334.0,
                    "response": "This highlights one of the most critical points of cryptocurrency/decentralization that so many people fail to understand. Great stuff!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i420auv",
                            "author": "JASONmoers",
                            "score": 3,
                            "created_utc": 1649523784.0,
                            "response": "People will get it, they might ignore it now. They won't be Able to do it for long.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i3yehbs",
                    "author": "Ferdo306",
                    "score": 69,
                    "created_utc": 1649453511.0,
                    "response": "Wow great work\n\nThe true message is often lost with all the lambos and FUD stuff that comes with BTC\n\nWe should remember the basics",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i3yjeqh",
                    "author": "dfunkmedia",
                    "score": 58,
                    "created_utc": 1649455555.0,
                    "response": "10/10\n\n\"Yes, [we will not find a solution to political problems in cryptography,] but we can win a major battle in the arms race and gain a new territory of freedom for several years.\nGovernments are good at cutting off the heads of a centrally controlled networks like Napster, but pure P2P networks like Gnutella and Tor seem to be holding their own.\" - Satoshi Nakamoto",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i40s3xc",
                            "author": "Polumuzh",
                            "score": 4,
                            "created_utc": 1649502823.0,
                            "response": "Yep, this video is 10 on 10. This is really educational stuff right here.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i3y3qb0",
                    "author": "fiercygoat",
                    "score": 78,
                    "created_utc": 1649449217.0,
                    "response": "Very well made",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i415n9f",
                            "author": "schwipps",
                            "score": 2,
                            "created_utc": 1649510845.0,
                            "response": "Yep, I see really less stuff like this. Should be seeing more of this tho.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i3yi64a",
                    "author": "PerformanceVarious45",
                    "score": 29,
                    "created_utc": 1649455038.0,
                    "response": "Need more quality content like this!!!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i40y2hr",
                            "author": "jasonrobertm",
                            "score": 1,
                            "created_utc": 1649506749.0,
                            "response": "Yep, this sub would be really amazing if we had more stuff like this.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i3z2utc",
                    "author": "duckofdeath87",
                    "score": 24,
                    "created_utc": 1649464182.0,
                    "response": "And for those lucky 13%, we are always less than a single generation away from losing these structures. Only a few votes and its all gone",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i3yvfgh",
                    "author": "electriccars",
                    "score": 10,
                    "created_utc": 1649460768.0,
                    "response": "This is extremely well made. Is there a YouTube link?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i40r1p3",
                            "author": "No-Statistician133",
                            "score": 4,
                            "created_utc": 1649502041.0,
                            "response": "https://youtu.be/cR4sMsI8z7U",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i3y6eij",
                    "author": "ForbiddenFruit91",
                    "score": 61,
                    "created_utc": 1649450267.0,
                    "response": "People this smart can't be this stupid. Every one of these puppets has a hidden agenda, and I can assure you it's not in the interest of the people.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i3yfsn6",
                            "author": "nmolanog",
                            "score": 31,
                            "created_utc": 1649454052.0,
                            "response": "Exactly. They are not ignorant, nor they just don't understand how Bitcoin works. They already know. And is a matter of fact that Bitcoin is against they interests. And they will do whatever is in their hands and pockets to stop it.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i3z4c6w",
                                    "author": "TrymWS",
                                    "score": -8,
                                    "created_utc": 1649464897.0,
                                    "response": "If they were smart, they’d long it beyond expectations, and dump on FOMO plebs.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i3zyjid",
                                            "author": "Explodicle",
                                            "score": 4,
                                            "created_utc": 1649480487.0,
                                            "response": "_Nobody_ is smart enough to predict when and by how much the price will increase. These guys didn't get where they are today by taking risks in a level playing field.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i400u1o",
                                                    "author": "TrymWS",
                                                    "score": -4,
                                                    "created_utc": 1649481980.0,
                                                    "response": "I never said they had to predict anything.\n\nI said they could make the bull market and create the top.\n\nIt’s not a level playing field, when a few people have enough to move the market.\n\nBut it’s adorable that you think it is. 🥳",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i401z4b",
                                                            "author": "Explodicle",
                                                            "score": 1,
                                                            "created_utc": 1649482747.0,
                                                            "response": "I think the part where we disagree is whether or not wagering on manipulation is a sure thing in the absence of bailouts.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i4067iv",
                                                                    "author": "TrymWS",
                                                                    "score": -1,
                                                                    "created_utc": 1649485671.0,
                                                                    "response": "I never said anything was a sure thing either.\n\nBut for a few ultra wealthy people bundled together, manipulating a market of BTCs size with leverage and crashing it even harder with the profits to destabilize confidence, would certainly be far from impossible.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i41im4p",
                                                                            "author": "Explodicle",
                                                                            "score": 0,
                                                                            "created_utc": 1649516636.0,
                                                                            "response": "One of those future events that's neither a prediction nor a sure thing, cool.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i43h9m3",
                                                                                    "author": "TrymWS",
                                                                                    "score": 0,
                                                                                    "created_utc": 1649546521.0,
                                                                                    "response": "You probably need to stop making shit up in your own head about what other people are saying.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i43nwlz",
                                                                                            "author": "Explodicle",
                                                                                            "score": 0,
                                                                                            "created_utc": 1649549648.0,
                                                                                            "response": "Pick one",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i3zlgsk",
                            "author": "ICumCrypto",
                            "score": 11,
                            "created_utc": 1649473173.0,
                            "response": "Being intelligent doesn't automatically make one insightful or wise. Additionally, I can imagine success and wealth leading one away from insight.\n\nIs Charlie Munger really asking himself why he finds Bitcoin disgusting? Has he intentionally done any shadow work? Is he interested in the psychology or phenomenology of disgust? I honestly don't know, but I doubt it.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i3ztx36",
                            "author": "Sino13",
                            "score": 7,
                            "created_utc": 1649477674.0,
                            "response": "They are also a previous generation whose massive wealth was been built and multiplied upon traditional finance/fiat rails. Their perspective likely resembles “if it isn’t broke then don’t fix it”. Not to mention they’re long in the tooth without much to gain with something perceived as “risky” as BTC (or any crypto). \n\nI wouldn’t bet against them having an agenda but I suspect there’s more at play than that. Seems like the 1% who’s under 65 years old are far more supportive bc they have much more to gain and definitely have their own agendas. Hell, they have another 30-60 years of wealth multiplication ahead of them that BTC will fuel compared to the small amount of time remaining for Gates, Buffet, Munger, etc.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i437env",
                                    "author": "second-last-mohican",
                                    "score": 1,
                                    "created_utc": 1649542045.0,
                                    "response": "It would have been the same with gold to oil.\n\nGold is mined and hard to find.. Oil was in parts just coming up out of the ground and seemed endless like water.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i3yinmt",
                    "author": "suuperfli",
                    "score": 27,
                    "created_utc": 1649455241.0,
                    "response": "great vids as always from Human Rights Foundation / Alex Gladstein \n\nhere are two more:  \n[Bitcoin Is Protecting Human Rights Around the World](https://www.youtube.com/watch?v=xLYYh4aPXAM)  \n[Bitcoin: 'A Weapon for Us To Fight Oppression](https://www.youtube.com/watch?v=zYs-j6Wx-hs)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i3yjira",
                    "author": "Tebasaki",
                    "score": 7,
                    "created_utc": 1649455600.0,
                    "response": "Great watch!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i3ywdc8",
                    "author": "enterusername34",
                    "score": 9,
                    "created_utc": 1649461190.0,
                    "response": "In these countries, how do they use btc to pay for ... food? Genuinely curious.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i40l9z2",
                            "author": "diradder",
                            "score": 5,
                            "created_utc": 1649497448.0,
                            "response": "Unlike what others answered, Cash App is only available in USA and UK, so it's unlikely that they use it.\n\nThe video explains how one of the people operates with their business, they have setup a [BTC Pay Server](https://btcpayserver.org/), to receive payments. So customers can pay them with BTC without any intermediary. That's already a pretty advanced way to receive Bitcoin.\n\nWithout this kind of infrastructure (which helps with more than just receiving Bitcoin), you can still use Bitcoin wallets and preferably ones that support the Lightning Network (Electrum, Phoenix, Eclair, etc.) to pay in a Peer-to-Peer manner. In other words directly from your wallet to the person you want to pay. All they have to do is press \"Receive\" on their wallet, show you the QR code of their address and you scan it with your wallet. Again, no intermediary that can block this.\n\nAs to whom accepts to receive Bitcoin in exchange for food, I would guess necessity is the mother of invention, when your government is oppressive or irresponsible with your country's currency you will find ways to escape this. If you can't leave, you'll adapt and use better forms of money, Bitcoin is one that is very difficult to censor.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i40qccj",
                                    "author": "enterusername34",
                                    "score": 1,
                                    "created_utc": 1649501498.0,
                                    "response": "> If you can't leave, you'll adapt \n\n\" If you can't leave, you'll adapt \" \n\nI agree...\n\nbut still wondering who is accepting bitcoin for food in these countries... even if they did, would the supplier to the shop accept bitcoin, etc...",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i43irjj",
                                            "author": "diradder",
                                            "score": 1,
                                            "created_utc": 1649547211.0,
                                            "response": "The person selling food also wants to escape a devaluing fiat money, so they are more prone to accept Bitcoin, USD, or anything else really, ultimately their supplier too. We're talking about failing systems, if you run a business you can't just \"deal with it and hope it passes\" if it lasts.\n\nIt's certain that the switch, even for a foreign currency is not easy, and the technical hurdles of Bitcoin can hinder it even more, but as these people testify it seems to be a viable alternative for them. One that is out of the reach of their government's control too. Before Bitcoin I'm not sure what they would have done (barred from access to all foreign currencies), maybe they'd have used gold/barter which both have major cons (mainly they are not easily divisible and verifiable).",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i3z9iby",
                            "author": "kinstinctlol",
                            "score": 3,
                            "created_utc": 1649467376.0,
                            "response": "By using Cash App by lightning network.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i3z9xnu",
                                    "author": "enterusername34",
                                    "score": 3,
                                    "created_utc": 1649467574.0,
                                    "response": "sweet just looked it up, thanks! \n\nis this what the canadian truckers would have been using? \n\ncan cashapp freeze accounts?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i40h2a6",
                                            "author": "Liquids0ul",
                                            "score": 1,
                                            "created_utc": 1649494002.0,
                                            "response": "Not sure but even If they can do so you don’t have to put all you bitcoin there right you can cash out what you need to cash out and leave the majority on a hard wallet or so",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i43vlho",
                                    "author": "Bad_guy_eye",
                                    "score": 1,
                                    "created_utc": 1649553411.0,
                                    "response": "Apparently cash app is only available in the USA and UK",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i3zfi4c",
                    "author": "CryptoKnignt",
                    "score": 6,
                    "created_utc": 1649470225.0,
                    "response": "I invest in Bitcoin and crypto because decentralized finance is liberation to the people. Anyone trying to stop BTC probably doesn’t want liberation for working people.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i437sbh",
                            "author": "second-last-mohican",
                            "score": 1,
                            "created_utc": 1649542218.0,
                            "response": "Well banks and governments cant get their transaction fees and sales taxes.. so they are mainly against it",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i3yn77w",
                    "author": "JediElectrician",
                    "score": 6,
                    "created_utc": 1649457172.0,
                    "response": "Bitcoin can and will level the playing field without disrupting any of the technological advancements in our society.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i3ypfpb",
                    "author": "SHA256dynasty",
                    "score": 5,
                    "created_utc": 1649458135.0,
                    "response": "bravo",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i3zka11",
                    "author": "LowKeySalty_",
                    "score": 4,
                    "created_utc": 1649472575.0,
                    "response": "This can spread like wildfire. You can sway normal people with powerful stories. Great job to whoever made this!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i407o1t",
                    "author": "desert_biker",
                    "score": 7,
                    "created_utc": 1649486720.0,
                    "response": "Ethiopian here. The map is upside down 🙃 🤣 \n\nOther than that, great video. Inflation is hitting us hard right now and I hope we find a solution in bitcoin. Only a tiny fraction knows enough about bitcoin, and even less people actually own/use it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i3ym1yh",
                    "author": "cryptosareagirlsbf",
                    "score": 7,
                    "created_utc": 1649456679.0,
                    "response": "I've been looking for this. Thanks so much for posting!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i3yygn4",
                    "author": "__cnav__",
                    "score": 7,
                    "created_utc": 1649462142.0,
                    "response": "Beautiful",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i3ytv9z",
                    "author": "brrrettonwoods",
                    "score": 3,
                    "created_utc": 1649460076.0,
                    "response": "what's the source on this video???\n\nAmazing stuff",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i3z6b1v",
                            "author": "cryptosareagirlsbf",
                            "score": 3,
                            "created_utc": 1649465845.0,
                            "response": "I saw it as part of the live feed from the Bitcoin conference. I think it was the intro to when Alex Gladstein was on.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i3y7jux",
                    "author": "hyperinflationUSA",
                    "score": 10,
                    "created_utc": 1649450726.0,
                    "response": "Love this",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i3ydzvr",
                    "author": "Vegas_42",
                    "score": 12,
                    "created_utc": 1649453310.0,
                    "response": "Respect",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i3z3i4k",
                    "author": "DarrylAmulet",
                    "score": 3,
                    "created_utc": 1649464495.0,
                    "response": "Where is this from? Youtube link if anyone has it please",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i40r71e",
                            "author": "No-Statistician133",
                            "score": 2,
                            "created_utc": 1649502151.0,
                            "response": "https://youtu.be/cR4sMsI8z7U",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i41ufuc",
                                    "author": "DarrylAmulet",
                                    "score": 2,
                                    "created_utc": 1649521412.0,
                                    "response": "Thank you!",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i3z9fqf",
                    "author": "acegarrettjuan",
                    "score": 3,
                    "created_utc": 1649467342.0,
                    "response": "This was the beat part of the conference so far I think.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i3zarc9",
                    "author": "ChrisCWgulfcoast",
                    "score": 3,
                    "created_utc": 1649467959.0,
                    "response": "Wow",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4042vw",
                    "author": "Sam_the_Hefer",
                    "score": 3,
                    "created_utc": 1649484215.0,
                    "response": "I don’t think many people, even in “dollar” countries, are even aware of exactly how much corruption thrives in their countries. In the USA for example, the rich use Wall Street to funnel billions out of the economy and effectively fleece taxpayers by getting payed-for politicians to help bail them out.\n\nAwareness needs to be spread.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i4043gg",
                            "author": "Paid-Not-Payed-Bot",
                            "score": 2,
                            "created_utc": 1649484226.0,
                            "response": "> by getting *paid-for* politicians to\n\nFTFY.\n\nAlthough *payed* exists (the reason why autocorrection didn't help you), it is only correct in:\n\n * Nautical context, when it means to paint a surface, or to cover with something like tar or resin in order to make it waterproof or corrosion-resistant. *The deck is yet to be payed.*\n\n * *Payed out* when letting strings, cables or ropes out, by slacking them. *The rope is payed out! You can pull now.*\n\nUnfortunately, I was unable to find nautical or rope-related words in your comment.\n\n*Beep, boop, I'm a bot*",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i429d8g",
                    "author": "0x1a3c3e7",
                    "score": 3,
                    "created_utc": 1649527423.0,
                    "response": "Just because a person is an expert doesn't mean they're honest.  Indeed, it's the experts I trust the least because they know best how to lie most convincingly.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i3ype3y",
                    "author": "seancollinhawkins",
                    "score": 2,
                    "created_utc": 1649458117.0,
                    "response": "\"I would short it if there was an easier way to do it\" \n\nTranslation: I don't understand technology enough to learn how to trade btc properly.\n\n\nHahha fuckin what? You can short bitcoin easier than you can stocks on the NYSE. Also not sure when that statement was made. Video is very well made nonetheless",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i3zz11i",
                            "author": "Explodicle",
                            "score": 3,
                            "created_utc": 1649480802.0,
                            "response": "Easier = platform where I have special treatment",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i405fdd",
                                    "author": "seancollinhawkins",
                                    "score": 2,
                                    "created_utc": 1649485150.0,
                                    "response": "Ah yes! And everyone else gets screwed. Atleast the little guys anyhow",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i40rie3",
                            "author": "undadatunda",
                            "score": 1,
                            "created_utc": 1649502381.0,
                            "response": "i think they built the 'easy' tools after bill said that and they get special privilages with places like blockfi and stuff where they get the bitcoin to do their dirty work\n\nfor all we know they are making 10 times what the bitcoiners are making..its a tricky world and the cream is going somewhere",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i3zbis1",
                    "author": "nifty_mick",
                    "score": 2,
                    "created_utc": 1649468322.0,
                    "response": "incredible, is this a snippet from a full documentary?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i3zckxg",
                    "author": "NefariousnessOk4619",
                    "score": 2,
                    "created_utc": 1649468816.0,
                    "response": "The animation reminds me of Metalocalypse",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i3zkcsr",
                    "author": "fuzzytradr",
                    "score": 2,
                    "created_utc": 1649472613.0,
                    "response": "This was excellent.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4017on",
                    "author": "Readanoi",
                    "score": 2,
                    "created_utc": 1649482234.0,
                    "response": "this is the best thing ever posted in this sub",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i401om9",
                    "author": "madmapguy",
                    "score": 2,
                    "created_utc": 1649482548.0,
                    "response": "Perfect explanation about BTC and how and where to use it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i40hqgf",
                    "author": "BadCurious429",
                    "score": 2,
                    "created_utc": 1649494556.0,
                    "response": "This video explains everything, thanks!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i40j2b9",
                    "author": "Sephire_2021",
                    "score": 2,
                    "created_utc": 1649495633.0,
                    "response": "BTC ✊🏻💫",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i40lm60",
                    "author": "-Bus-Driver",
                    "score": 2,
                    "created_utc": 1649497727.0,
                    "response": "Save this and link to anyone asking for crypto use case.\n\n #Level playing field",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i40wlgy",
                    "author": "hangfromthisone",
                    "score": 2,
                    "created_utc": 1649505846.0,
                    "response": "Bill can short my liggmma",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i41vqmp",
                    "author": "trumpshairspray",
                    "score": 2,
                    "created_utc": 1649521940.0,
                    "response": "They don't have the people's interest at heart.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i42mpzx",
                    "author": "onlimet",
                    "score": 2,
                    "created_utc": 1649532999.0,
                    "response": "This is awesome. To anyone whoever made this. Thanks.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i3y1g5t",
                    "author": "Consequenceplz",
                    "score": 5,
                    "created_utc": 1649448302.0,
                    "response": "I wonder if they think that kind of verbiage is really going to resonate with people at this point",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i3zb93x",
                    "author": "enraged768",
                    "score": 6,
                    "created_utc": 1649468192.0,
                    "response": "I always wonder how do the poorest of people even get btc. I mean I'm talking 30% of the world that can't even afford a cold wallet. Hell an actual phone. That's where btc falls short. I feel like people don't actually know how poor some people are. Theres people within this world and i've seen it in way more countries than id like to. There's places where people pay for kool-aid out of a sandwich baggie with a staw and a rubber band. These poor sons a bitches can't even afford rice. Btc means nothing to them, wallets means nothing to them, they just care about having enough currency to buy enough rice to live.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i3ziyr5",
                            "author": "mongartus",
                            "score": 5,
                            "created_utc": 1649471917.0,
                            "response": "Yeah btc is okay in developing countries where the currency is weak but they still have a disposable income. Because to buy btc you need a disposable income. Hell that doesn't even apply to a huge portion of people in developed countries. Your not buying bitcoin unless literally all your immediate bills and living expenses are paid and there is nothing else you need. You need access to technology like computers, an exchange which may require kyc docs that the poorest may or may not have, a bank to transfer payments into the exchange again which might not exist. Btc is primarily for middle class developed country participants looking to make returns. Right now in any case.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i40g64x",
                                    "author": "LayPessimist",
                                    "score": 1,
                                    "created_utc": 1649493278.0,
                                    "response": "Theres unfortunately a whole lot of prerequisites before one is able to buy BTC indeed.\n\nKYC bullshit even increases these requirements further and solely exists to make access to monetary instruments inaccessible to the underprivileged.\n\nTHAT is the whole reason KYC exists.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i3ywlgn",
                    "author": "Due_Percentage8276",
                    "score": 3,
                    "created_utc": 1649461290.0,
                    "response": "I cried to this😭",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i3zo7mv",
                    "author": "boominggem",
                    "score": 1,
                    "created_utc": 1649474572.0,
                    "response": "😂 except the banks own more bitcoin than the people. Bitcoin doesn’t bridge the gap nor does it help poor people.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i40aam6",
                            "author": "CallingVoid",
                            "score": 2,
                            "created_utc": 1649488705.0,
                            "response": "Except that it literally is helping people right now. Banks can hoard bitcoin all they like. You can still use bitcoin as an individual and use it however you please.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i3zjzfn",
                    "author": "Spartan3123",
                    "score": 1,
                    "created_utc": 1649472430.0,
                    "response": "Why is the face of the Muslim man blurred. Muhammad is that you?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i3zz3z4",
                            "author": "Explodicle",
                            "score": 2,
                            "created_utc": 1649480854.0,
                            "response": "So nobody recognizes him, duh.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i3zzusl",
                                    "author": "Spartan3123",
                                    "score": 1,
                                    "created_utc": 1649481340.0,
                                    "response": "I mean its an animation they could have drawn a generic Muslim man...",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i3zveyc",
                    "author": "anajoy666",
                    "score": 1,
                    "created_utc": 1649478550.0,
                    "response": "Great video but with respect to the very last part: don't assume malice where ignorance suffices. There is no point in making a powerful enemy when they could be your ally.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i3zzfwp",
                            "author": "Explodicle",
                            "score": 2,
                            "created_utc": 1649481068.0,
                            "response": "A billionaire monopolist will never, ever, start being your ally. They've been taking advantage of your benefit of the doubt for decades now - they aren't ignorant.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i3zzpzn",
                                    "author": "anajoy666",
                                    "score": -2,
                                    "created_utc": 1649481252.0,
                                    "response": "None of those people have taken advantage of me. They don’t need to be my “allies”, they just need to see the value of bitcoin.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i40177p",
                                            "author": "Explodicle",
                                            "score": 1,
                                            "created_utc": 1649482225.0,
                                            "response": "They did, for example as ruled in United States vs Microsoft.\n\nWhat did you mean when you said ally in the first place?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i4044ku",
                                                    "author": "anajoy666",
                                                    "score": 1,
                                                    "created_utc": 1649484248.0,
                                                    "response": "They did not take advantage of me. I guess I did use the term “ally” loosely, I meant “price goes up, freedom goes up”.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i41jvd8",
                                                            "author": "Explodicle",
                                                            "score": 1,
                                                            "created_utc": 1649517153.0,
                                                            "response": "You can keep just saying that, but monopolists do take advantage of you and literally everyone involved in their market. We'll never know how much better computers would have been by now, and what a difference that would have made in people's lives.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i41stu3",
                                                                    "author": "anajoy666",
                                                                    "score": 1,
                                                                    "created_utc": 1649520758.0,
                                                                    "response": "I could argue computer would be much worse too. It's easy to make claims with no data.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i42ptoy",
                                                                            "author": "Explodicle",
                                                                            "score": 1,
                                                                            "created_utc": 1649534344.0,
                                                                            "response": "The \"data\" are basic economics, it's a deadweight loss due to a monopoly.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i42tsob",
                                                                                    "author": "anajoy666",
                                                                                    "score": 1,
                                                                                    "created_utc": 1649536084.0,
                                                                                    "response": "Not data.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i42ylvb",
                                                                                            "author": "Explodicle",
                                                                                            "score": 1,
                                                                                            "created_utc": 1649538204.0,
                                                                                            "response": "Wow that completely revolutionizes what everyone thought about basic introductory economics.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i40rd0z",
                    "author": "67ITCH",
                    "score": 1,
                    "created_utc": 1649502271.0,
                    "response": "Used to watch and listen to videos of Warren Buffett. Then I read an article which quoted him saying something along the lines of \"it's a scam\" but when asked what he knows about it, he said, \"I don't know it, I don't understand it.\" I mean, come on... You jumped the scam bandwagon without researching and it. Lost all respect outright. This video brings to light why he's so scared of it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i4136nv",
                    "author": "MaritimeMucker",
                    "score": 1,
                    "created_utc": 1649509596.0,
                    "response": "Bill Gates gives health advice while having flabby man breast so I wouldn't really listen to him anyhow.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i3zpszy",
                    "author": "FuggemAuhl_NoRubuh",
                    "score": -1,
                    "created_utc": 1649475417.0,
                    "response": "Lame",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i3zquet",
                            "author": "Hotsushiking",
                            "score": 2,
                            "created_utc": 1649475979.0,
                            "response": "Don’t talk about your username like that",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i3y2v9c",
                    "author": "unfuckingstopped",
                    "score": -10,
                    "created_utc": 1649448872.0,
                    "response": "i don't know what 'check your privilege' even means.  this element of shame that's supposed to be ascribed to privilege is really fucking dumb.  the implication is that your advantage equates to someone else's disadvantage. wrong. it's envy that makes people say this. there are infinite privileges to be had or created in the world. gain as much privilege as you can, and be proud of it because there's plenty to go around and endless more to be created. it's not a zero sum world. commies believe otherwise.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i3yjcq6",
                            "author": "life762",
                            "score": 13,
                            "created_utc": 1649455533.0,
                            "response": "I always considered it to simply mean you might be fortunate enough to take something for granted that others cannot.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i3yhti7",
                            "author": "cryptosareagirlsbf",
                            "score": 11,
                            "created_utc": 1649454892.0,
                            "response": ">i don't know what 'check your privilege' even means\n\nGoogle it, so you don't look like an ass pontificating on something you don't understand.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i3zy4vv",
                            "author": "New_Dawn",
                            "score": 2,
                            "created_utc": 1649480226.0,
                            "response": "I'm as anti-commie as they come but this is different. This is about equal opportunity not equal outcomes.\n\nIt's about a fair and just system that everyone can use to pursue their dreams. It's perfectly fine to overlay an honest capitalist system underwritten by Bitcoin-as-a-system. Plumbers, teachers, nurses, baby sitters should all be able to earn a living in a unit of account that benefits everyone. \n\nThose that are sitting on a mountain of dollars should not be throwing shade at Bitcoin but rather humbly giving it a thumbs up to do its thing.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i3z7xuw",
                            "author": "Geoknysis",
                            "score": 1,
                            "created_utc": 1649466631.0,
                            "response": "Well said. Too many people are brainwashed to drool and lockstep virtue signal support for anything that has negative connotation regarding a \"privilege\" of any sort. It's simply jealously as you outlined.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i3y5vye",
                            "author": "IndianaGeoff",
                            "score": -4,
                            "created_utc": 1649450063.0,
                            "response": "Esp since Bitcoin is mostly a rich economy thing and people in broken countries would rather have a Benjamin than Internet money when they don't have internet.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i3y74c3",
                                    "author": "NiceDoctorBeam",
                                    "score": 10,
                                    "created_utc": 1649450554.0,
                                    "response": "Wrong.\n\nThey want what you and I want: a fair chance.  Bitcoin is a huge step in that direction.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i3zzxcc",
                                            "author": "labenset",
                                            "score": 3,
                                            "created_utc": 1649481386.0,
                                            "response": "He's right about the people in poorer countries, though. They would much rather have usd in hand. I wish bitcoin were more accessible to them though. WU and other older methods are light-years behind crypto.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i4089wg",
                    "author": "asseesh",
                    "score": 0,
                    "created_utc": 1649487176.0,
                    "response": "You need stable country and economy to have cheap stable internet connection and thus bitcoin FFS.\n\nIt will take any government 5 mins to shut down internet if they want to. Good luck doing that with cash or gold.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i40umrf",
                            "author": "DeslerZero",
                            "score": 0,
                            "created_utc": 1649504592.0,
                            "response": "Someone else who sees the light.  Bitcoin is not the financial messiah, it's just a currency with some uses here and there.  It is not immune to human corruption or financial manipulation.\n\nYou might want it to be all these great things.  It sometimes is but just like regular currency it falls short when the right people want to use it to their own ends.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i3zsyyz",
                    "author": "IBRoln1",
                    "score": 1,
                    "created_utc": 1649477133.0,
                    "response": "This is Nikola Tesla energy",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i3zx6so",
                    "author": "New_Dawn",
                    "score": 1,
                    "created_utc": 1649479633.0,
                    "response": "LIBERATION TECHNOLOGY",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i40docu",
                    "author": "Tro_au",
                    "score": 1,
                    "created_utc": 1649491301.0,
                    "response": "Which countries are in the 13%",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i40gjgl",
                    "author": "Bitcoin__Hodler",
                    "score": 1,
                    "created_utc": 1649493579.0,
                    "response": "wages stagnate while there is 400% inflation? \ni guess not ;-)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i40tte9",
                    "author": "BidiBidiBommBomm",
                    "score": 1,
                    "created_utc": 1649504034.0,
                    "response": "Can’t be stopped….",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i40x6lt",
                    "author": "CryptoMiningUK",
                    "score": 1,
                    "created_utc": 1649506209.0,
                    "response": "Great video! Nice to see real-world adoption and something showing the true utility of bitcoin",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i40xjbv",
                    "author": "BeefSupreme2",
                    "score": 1,
                    "created_utc": 1649506425.0,
                    "response": "\"There is a war between the rich and the poor...and the rich are winning.\"\n\n-Warren Buffet",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i417akg",
                    "author": "DarthKoDa_",
                    "score": 1,
                    "created_utc": 1649511656.0,
                    "response": "Very well made. Bravo.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i419kar",
                    "author": "Lewis_0683",
                    "score": 1,
                    "created_utc": 1649512734.0,
                    "response": "Wow that's powerful",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i41d6ws",
                    "author": "According_Cow_5089",
                    "score": 1,
                    "created_utc": 1649514358.0,
                    "response": "Great video. \nBtcpay server, think this is the sort of thing I have been looking for. Thanks",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i41edk9",
                    "author": "paddyspubkey",
                    "score": 1,
                    "created_utc": 1649514865.0,
                    "response": "Beautiful.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i41llvv",
                    "author": "eve_of_distraction",
                    "score": 1,
                    "created_utc": 1649517860.0,
                    "response": "I mean Gates, Munger and Buffett are not just ignorantly privileged people, they're egomaniacal power-hungry psychopaths who know exactly how privileged they are and want to keep it that way.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i40d9h6",
                    "author": "caahel",
                    "score": -1,
                    "created_utc": 1649490973.0,
                    "response": "Very racist undertones in this video against whites",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i410lin",
                            "author": "g1utt0ny",
                            "score": 2,
                            "created_utc": 1649508205.0,
                            "response": "for what? for not including black billionaires who are against bitcoin?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i41gz5z",
                                    "author": "caahel",
                                    "score": 0,
                                    "created_utc": 1649515964.0,
                                    "response": "Every single clip in that video is \"white bad, nonwhite victim\"",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i4224n0",
                                            "author": "g1utt0ny",
                                            "score": 1,
                                            "created_utc": 1649524514.0,
                                            "response": "Read the title.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i3zou75",
                    "author": "PsychoSmurfx",
                    "score": -1,
                    "created_utc": 1649474904.0,
                    "response": "My worry is that without corporations spending $millions to run expensive (yet profitable) bitcoin farms, the whole system would fall apart. To be truly a solution for the poor, and truly decentralized, a change needs to be made there? I’m hoping for an honest discussion, not a religious (maxi) smack down.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i40b5i6",
                            "author": "CallingVoid",
                            "score": 3,
                            "created_utc": 1649489350.0,
                            "response": "It is actually a good thing, it means that the network is secured by real world costs. In order to attack bitcoin and make the network worthless for the poor, you'd first need to be willing to source (difficult) purchase (extremely expensive) and run the miners (also expensive). You would then have to sacrafice steady, almost guanateed profits on an attack that will ultimately probably fail (bitcoin has survived these attacks before).\n\nMiners should be seen as independent security contractors for bitcoin. They are rewarded to keep the network secure. The decentralisation of BTC is the business of node runners.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i42aioi",
                                    "author": "PsychoSmurfx",
                                    "score": 1,
                                    "created_utc": 1649527891.0,
                                    "response": "I really appreciate these points. I don’t mean do be all doom and gloom, but there is at least some risk of another world war right now. (Please don’t turn this thread political). What happens if instead of spending the capital to create new mines, the strategy is simply to disable the current $multimillion mines? In their absence, would every day people be able to take up that slack (IE affordability) without big negative ramifications to the network? Speed, security, etc.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i42hb21",
                                            "author": "CallingVoid",
                                            "score": 2,
                                            "created_utc": 1649530706.0,
                                            "response": "It would be a hit to network security of course because ASICS are just so efficient at turning energy into hashes. If ASICS become targets for malicious actors. Difficulty adjusts as required, so if ASICS get taken out then we can GPU mine until ASICS come back. If all GPUs get taken we can use CPUs, if there are no CPUs, GPUs and no ASICs left functioning in the world then I guess we've got bigger problems than bitcoin.\n\nIf ASICS are turned by a malicious actor to actively attack Bitcoin (in some kind of extremely clever, coordinated attack) then the nuclear option is to change the hashing algorithm from SHA256 and turn all bitcoin ASICS into expensive, ugly bricks. But that is a last resort.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i42w7dq",
                                                    "author": "PsychoSmurfx",
                                                    "score": 1,
                                                    "created_utc": 1649537148.0,
                                                    "response": "Thank you for you input. Much appreciated. That has helped clear things up for me.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i40p77g",
                            "author": "theSerotoninSqueeze",
                            "score": 1,
                            "created_utc": 1649500611.0,
                            "response": "The network could run on a single crusty computer from 2012 just fine if all other computers in the network were no longer mining or running a node.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i42901c",
                                    "author": "PsychoSmurfx",
                                    "score": 0,
                                    "created_utc": 1649527276.0,
                                    "response": "But at this point it isn’t. It runs by a means that without the rich, the poor can’t utilize the network. Is there something that can be done about that?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i43k6kr",
                                            "author": "theSerotoninSqueeze",
                                            "score": 1,
                                            "created_utc": 1649547864.0,
                                            "response": "The “poor” as you put, don’t need to mine Bitcoin to use the network. The network doesn’t care where you’re from or what your economic background is, it still exists to serve you. All that is needed is a node to record transactions. And running a node isn’t the same as mining. Cost almost nothing to build a node.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i44vano",
                                                    "author": "PsychoSmurfx",
                                                    "score": 1,
                                                    "created_utc": 1649572728.0,
                                                    "response": "If $million dollar mines are not needed, then why do they exist?",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i414fiq",
                    "author": "Geoknysis",
                    "score": 0,
                    "created_utc": 1649510243.0,
                    "response": "Lol, wtf was this?\n\nOkay let me check my financial privilege...\n\n*opens BTC wallet*\n\n*confirms BTC still there*\n\nMy ancestors fought for what I have now. You see that as 'privilege' but it's really the product of smart intergenerational decisions.\n\nIt's not our problem your ancestors chose to fuck monkeys, rape and pillage endlessly instead of actually build something for your society. It's now obviously up to you in the generational lineage to make better decisions going forward.\n\nUnfortunately all you made so far is a shitty cartoon blaming smarter and more successful generational lineages for the shortcomings of your own.\n\nIf you really do want to make a difference in your impoverished community, stop lashing out at others and projecting blame and hate. Start working with them and you'll find there are lots of financially 'privileged' people willing to share the fruits of their ancestors to help fix the shit decisions of yours.\n\nWould you consider people who have access to medicine to be medically 'privileged'? Medical knowledge comes from hard work, applied intellect, and coordination amongst society members. Plenty of organizations work to share medical as well as financial assistance to those more needy.\n\nYour use of the word 'privileged' is misguided and inappropriate as is the case for all lamesteam media brainwashed NPCs. Stop hating and start collaborating.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "urlkfz",
            "title": "古巨基 Leo Ku feat. 黃子華《子華說》[Official MV]",
            "url": "https://youtu.be/Hk_P6rfg_aU",
            "author": "n_n-v_v-z_z",
            "created_utc": 1652791255.0,
            "score": 1,
            "num_comments": 0,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "urlbu8",
            "title": "First Bitcoin meetup for nation states",
            "url": "https://i.redd.it/15d9eh7451091.jpg",
            "author": "CoinCorner_Sam",
            "created_utc": 1652790472.0,
            "score": 85,
            "num_comments": 12,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8xuj9l",
                    "author": "DesmondNav",
                    "score": 1,
                    "created_utc": 1652791690.0,
                    "response": "lmao Europe and North America late to the innovation party, as always",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8xvqrm",
                            "author": "kytheon",
                            "score": 1,
                            "created_utc": 1652792322.0,
                            "response": "smash that regulation button",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8xxl96",
                            "author": "MuchTemperature6776",
                            "score": 1,
                            "created_utc": 1652793253.0,
                            "response": "Because they don’t like things they can’t control",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8xtf57",
                    "author": "GannicusXIII",
                    "score": 1,
                    "created_utc": 1652791099.0,
                    "response": "This is the way",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8xxbzh",
                    "author": "DomComm",
                    "score": 1,
                    "created_utc": 1652793123.0,
                    "response": "If all these countries jump in it would create FOMO among nations then next stop $1 Million BTC",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8xwp2r",
                    "author": "Bones22ff",
                    "score": 1,
                    "created_utc": 1652792801.0,
                    "response": "Statist nonsense 👎we don't need any politicians to get involved",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8y0lbu",
                            "author": "ShiftyDM",
                            "score": 1,
                            "created_utc": 1652794714.0,
                            "response": "These people are just trying to get out from under the US dollar dominance. We don't need them. They need us.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8xt5lm",
                    "author": "kitastrophae",
                    "score": 1,
                    "created_utc": 1652790955.0,
                    "response": "That’s a lot of bankers.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8y0lgf",
                    "author": "KualaLJ",
                    "score": 1,
                    "created_utc": 1652794715.0,
                    "response": "WTF is wrong with this sub? \n\nWe don’t want or need government involvement and least of all 3rd world corrupt governments. This not a good thing long term.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8y0pdm",
                    "author": "Robin2Fast2Furious",
                    "score": 1,
                    "created_utc": 1652794768.0,
                    "response": "Bitcoin community: regulations bad.\nAlso bitcoin community:",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8xyy76",
                    "author": "hyperinflationUSA",
                    "score": 1,
                    "created_utc": 1652793920.0,
                    "response": "Based",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8xzv82",
                    "author": "snowdropvivi",
                    "score": 1,
                    "created_utc": 1652794366.0,
                    "response": "well damn, look at all those people that could fck up btc anytime",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}