{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "urza3b",
            "title": "StoneX Executes first Bitcoin Swap",
            "url": "https://blockworks.co/stonex-executes-first-bitcoin-swap-as-firm-looks-to-grow-crypto-dealings/",
            "author": "randsack",
            "created_utc": 1652829830.0,
            "score": 2,
            "num_comments": 4,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i90c84j",
                    "author": "WritingFun8769",
                    "score": 1,
                    "created_utc": 1652830051.0,
                    "response": "ah yes, this won’t end badly 🙃\n\n“A subsidiary, StoneX Markets, made the cash-settled swaps — derivatives contracts that exchange two financial instruments at a predetermined time — available to clients earlier this month, a company executive told Blockworks.”",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i90cjik",
                    "author": "coinfeeds-bot",
                    "score": 1,
                    "created_utc": 1652830203.0,
                    "response": "tldr; Derivatives specialist StoneX Group has pulled off its first US dollar-denominated bitcoin swap. StoneX Markets made the cash-settled swaps available to clients earlier this month. The move is the first step in building out an institutional-grade crypto book, StoneX's global head of institutional foreign exchange trading Eric Donovan said.\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i90f3l0",
                    "author": "llewsor",
                    "score": 1,
                    "created_utc": 1652831441.0,
                    "response": "interesting bUt bItCOrn Is sLoW aNd OLd",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i90fw8j",
                    "author": "Mallardshead",
                    "score": 1,
                    "created_utc": 1652831832.0,
                    "response": "So basically a centralized version of Bisq, or Bisq for institutions.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "urzgc0",
            "title": "Follow The Money #1 - Bitcoin in El Salvador",
            "url": "https://youtu.be/ig3UN1GYmY8",
            "author": "btc_iota_xmr",
            "created_utc": 1652830379.0,
            "score": 5,
            "num_comments": 7,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i90hxrm",
                    "author": "nowuknoimpaperthin",
                    "score": 2,
                    "created_utc": 1652832826.0,
                    "response": "\"Bitcoin isn't the goal.. Like, it is a tool.\"\n\nI think this is something to take note of and always keep in mind. That is what money is afterall. Money is just a tool.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i90i43q",
                    "author": "btc_iota_xmr",
                    "score": 1,
                    "created_utc": 1652832913.0,
                    "response": "Peter McCormack from the podcast 'What Bitcoin Did' travels around El Salvador, discusses the bitcoin law with protestors, meets with a community rehab facility, and in his second interview with Bukele asks him straight up if he's a dictator.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i90mr8y",
                            "author": "LadyMillennialFalcon",
                            "score": 1,
                            "created_utc": 1652835088.0,
                            "response": "He is lol",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i90pdyj",
                    "author": "Nada_Lives",
                    "score": 1,
                    "created_utc": 1652836330.0,
                    "response": "This one is worth watching.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i90rylt",
                    "author": "oldskoolr",
                    "score": 1,
                    "created_utc": 1652837538.0,
                    "response": "I like McCormack.\n\nHe's a great interviewer of people he agrees/disagrees with.\n\nEven if he does post some dub shit on Twitter from time to time.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i90sni2",
                    "author": "Keith_Kong",
                    "score": 1,
                    "created_utc": 1652837865.0,
                    "response": "**Great film but...** the revisit interview with Bukele was underwhelming to say the least. Rather than focus on the Dictatorship claim generically, why not revisit the specific claims that he snuck the Bitcoin bill through the courts there? What gave him the leverage to do this? Why did he feel he needed to do this?\n\nI can see that the broader criticisms are largely misunderstanding what is meant by \"requiring merchants to accept Bitcoin\" given they aren't being fined for technical limitations and don't even have to hold the Bitcoin if they don't want to (convert it instantly to dollars).\n\n**I would have appreciated more REAL skepticism on these points**. That said, I understand that an interview with someone like Bukele is not a completely open conversation. This is true for any president or leader. Still, it felt like more could have been said.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i90k4kr",
                    "author": "RobbyMcRobbertons",
                    "score": 0,
                    "created_utc": 1652833849.0,
                    "response": "El Salvador will be even more in ruins soon becuz of their idiot dictator…",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "urz8uk",
            "title": "Mempool collapse",
            "url": "https://imgur.com/a/fZ7zOGF",
            "author": "nlflint",
            "created_utc": 1652829719.0,
            "score": 0,
            "num_comments": 6,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i90gruy",
                    "author": "zsyjxh8q7b8i",
                    "score": 4,
                    "created_utc": 1652832261.0,
                    "response": "Working as intended. Volatility has subsided so people aren’t moving coins as much to sell them. Nothing to see here, move along.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i913lc5",
                            "author": "CryptoCrumbSniffer",
                            "score": 1,
                            "created_utc": 1652843154.0,
                            "response": "The mempool spike wasn't even caused by people rushing to move coins. It was Binance consolidating a bunch of legacy address UTXOs.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i90lgrs",
                    "author": "Nada_Lives",
                    "score": 3,
                    "created_utc": 1652834485.0,
                    "response": "Collapse? Everything's a crisis these days.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i913g0g",
                            "author": "cheerful_afternoon",
                            "score": 1,
                            "created_utc": 1652843077.0,
                            "response": "I know ! What's next ? Price volatility crash ?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i915ef4",
                    "author": "polloponzi",
                    "score": 1,
                    "created_utc": 1652844086.0,
                    "response": "You need to refresh: [https://mempool.space/](https://mempool.space/) ... it already processed everything, fees are back to 1 sat/byte",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i918q74",
                    "author": "masterxbtc",
                    "score": 1,
                    "created_utc": 1652845922.0,
                    "response": "Sweet, 1 sat/vB transactions again!",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "urz5oj",
            "title": "Yuval Noah Harari’s skepticism of bitcoin/blockchain technology",
            "url": "https://www.reddit.com/r/Bitcoin/comments/urz5oj/yuval_noah_hararis_skepticism_of/",
            "author": "BlueberryDefender",
            "created_utc": 1652829453.0,
            "score": 9,
            "num_comments": 11,
            "subreddit": "Bitcoin",
            "selftext": "I was listening to Harari on the Sam Harris podcast (ep 276, March 22, 2022, about 52min in, for anyone interested) and am having trouble reconciling what he said on the podcast to my interpretation of his thoughts on money, in his ‘Sapiens’ book. It’s been a while since I’ve read it, but regarding money, he goes through some of the history, how it’s not much more than a religion (requiring inter subjective belief), and how we moved from grains, to gold, to fiat etc. I would have thought bitcoin would be the natural extension of that list, as Harari seems to believe value is subjective, but his podcast interview did not support it. \n\nIn the podcast, he states that he’s not sure that blockchain technology eliminates trust, as we would still need human institutions to set up, interpret, and monitor. I might chalk this up to his lack of understanding of bitcoin’s decentralization and its differentiation from other cryptos. Harari goes on and says that the financial history of the world is about moving from ‘currencies of distrust’ to ‘currencies of trust’. The example he brings up is ancient Mesopotamia and how trading grain was the original currency. We did not need to ‘trust’ in the grain’s value, as we can simply eat it and knows its inherent value. \n\nHarari says blockchain technology is an attempt of going back to once again not trusting people, but simply to trust technology instead. He says as a historian, he’s skeptical of this attempt to take humans out of the loop. \n\nI can see his points being more applicable to the non-bitcoin cryptos, which have founders. I should mention, he also makes the comparison to the Talmud, which is supposed to be the definitive text for biblical interpretations for Jews, and how Rabbis are still required to interpret the interpretation (kind of like alt coins).  \n\nI’ve read his books and hold him as a great thinker. In Homo Deus he tries to give some insights into the future’s technologies. But not sure how he’s missing the mark with bitcoin. \n\nThoughts?",
            "stickied": false,
            "comments": [
                {
                    "id": "i90j4hd",
                    "author": "wkw3",
                    "score": 4,
                    "created_utc": 1652833382.0,
                    "response": "Bitcoin is trustless in the sense that its precise workings are freely published and auditable. The places where Bitcoin fails are exactly the places where humans enter the loop, exchanges, market manipulators (also exchanges), scammers, hackers, etc...\n\nThe technology itself is what I trust and every year that it remains accurate, available, and unforgeable, is more trust I put into it.\n\nI also trust the human motivations around Bitcoin. I trust the core devs to test like billions of dollars are riding on it. I trust hackers to target it incessantly, which proves its robustness. I trust the media to bad mouth it due to their owner's incentives. I trust politicians to fail to understand it.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i91dejt",
                            "author": "BlueberryDefender",
                            "score": 1,
                            "created_utc": 1652848756.0,
                            "response": "That's a good way of looking at it.  \n\nI'm not sure if this is exactly what you meant, but the way I'm framing it now is:  the protocol itself, the transparent self-auditing open ledger requires no trust.  But for anything to have value (including bitcoin), it would still require that people trust it to have value.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i91e6d0",
                                    "author": "0x1a3c3e7",
                                    "score": 1,
                                    "created_utc": 1652849263.0,
                                    "response": "If texting has value, so does Bitcoin.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i90ncqz",
                    "author": "tails_42",
                    "score": 2,
                    "created_utc": 1652835374.0,
                    "response": "52 minutes? I see a [36 minute episode](https://www.youtube.com/watch?v=vTqOk19itfM)",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i90vko3",
                            "author": "BlueberryDefender",
                            "score": 1,
                            "created_utc": 1652839240.0,
                            "response": "Hmm that video might not include the Q&A that took place afterwards. There were viewer questions that were asked and directed at Harari. The full interview is 1hr 11mins.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i90wkub",
                                    "author": "tails_42",
                                    "score": 2,
                                    "created_utc": 1652839718.0,
                                    "response": "Do you have a link or is it paid subscriber content?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i911xmq",
                                            "author": "BlueberryDefender",
                                            "score": 1,
                                            "created_utc": 1652842309.0,
                                            "response": "I have a subscription to Sam Harris’ content",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i90ii59",
                    "author": "TaleRecursion",
                    "score": 4,
                    "created_utc": 1652833102.0,
                    "response": "Yuval Harari is a [WEF stooge](https://www.weforum.org/people/yuval-noah-harari). You can't expect a self-professed globalist not to have a bias against decentralization which goes in the exact opposite direction philosophically.\n\nAs the saying goes, it is difficult to get a man to understand something, when his salary depends upon his not understanding it.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i91jgu1",
                            "author": "Jazz-Noir",
                            "score": 1,
                            "created_utc": 1652853011.0,
                            "response": "Isn’t he supposed to own nothing and be happy about it though?  😂",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i90iu83",
                    "author": "theneworld",
                    "score": 2,
                    "created_utc": 1652833254.0,
                    "response": "Bitcoin is not about trust, it's about violence minimization. The money printers, the central planners, printing money because they have monopoly on violence, not because we \"trust\" them. This is rationalized trust, rationalized slavery. \n\nThey force us to do something and we do it because we are afraid of negative consequences. We are afraid of being kidnapped by some thugs. This is how modern civilization operates, under the threat of violence. Not because we trust them. Because we are afraid of them.\n\nInstead of admitting that fear is the main motivating factor behind out actions, as slaves would admit, we take the coward's way out, rationalize our fear by having this pretend democracy, once in a few years we choose our slave masters. This is the definition of illusion of control. True slavery is honest, we are dishonest slaves, engaged in self-deception. \n\nIf we hate freedom so much, if we hate personal responsibility, if we desire central planners to tell us what to to do, let’s cut the bullshit and collectively admit it and embrace absolute global dictatorship, absolute dictatorship, as in  God made flesh who decides what is right and what is wrong, and there is no one on the planet to undermine their authority. And by the way that the best shot we got to solve man-made climate change and save humanity, so there is that. \n\nGod decides there will be no consumption of animal products anymore, bans dirty energy sources and moves towards clean renewable energy globally. Essentially solves the problem of climate change and secures our future. The price? Stop pretending that we are free, accept honest slavery.  HAHAHA",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i91nkva",
                    "author": "Wonderingbye",
                    "score": 1,
                    "created_utc": 1652856270.0,
                    "response": "“Moving from currencies of distrust to currencies of trust.”  Some would argue the best “currency of trust” is the money that requires no trust.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}