{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uy5yr7",
            "title": "How to stack more SATs? staking, yield blah blah",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uy5yr7/how_to_stack_more_sats_staking_yield_blah_blah/",
            "author": "rohilaltro",
            "created_utc": 1653566366.0,
            "score": 32,
            "num_comments": 28,
            "subreddit": "Bitcoin",
            "selftext": "I have seen many people asking how to increase your sats? And they are trying to go through this staking, yield path. I fell staking is a \"scam\" in its very nature and is almost as legacy bonds with government. And we are seeing how it is turning out for us. So much misery around all of us. \n\nThe way I see you can get more SATS is:\nBy selling your expertise or service that you are good at. \n\nThat's how you  will store your value of your time and effort at that very moment, for future utility. \n\nYou want more btc, scale up your personal skills, learn new things and sell them for more btc. \n\nAccording to me this should be mindset. \n\nI draw these conclusions from what I have seen in gold:\n\nYou want more gold, sell your skills for gold. It was being done for centuries. \n\nNo one paid out gold for storing your gold as far as I know.",
            "stickied": false,
            "comments": [
                {
                    "id": "ia29hg3",
                    "author": "fverdeja",
                    "score": 21,
                    "created_utc": 1653571622.0,
                    "response": "The real proof of work",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia2n1rd",
                            "author": "rohilaltro",
                            "score": 8,
                            "created_utc": 1653577425.0,
                            "response": "Very well said. \n\nYou do hard work and get a hard money obtained from real effort!!",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "ia47lgr",
                            "author": "wattumofficial",
                            "score": 2,
                            "created_utc": 1653600518.0,
                            "response": "Miners always be stacking",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia3et8e",
                    "author": "Trifusi0n",
                    "score": 8,
                    "created_utc": 1653588472.0,
                    "response": "You can’t stake Bitcoin, it’s not proof of stake, it’s proof of work. The word you’re looking for is lending not staking.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia3fax1",
                            "author": "rohilaltro",
                            "score": -7,
                            "created_utc": 1653588673.0,
                            "response": "Dude, there are ways to stake token based on btc. wbtc, renbtc etc etc.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia3fs4a",
                                    "author": "Trifusi0n",
                                    "score": 8,
                                    "created_utc": 1653588868.0,
                                    "response": "None of them are staking, they’re either lending or yield farming, ect. Staking is the act of securing a network by staking coins, you can’t do that with Bitcoin.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "ia4qpgz",
                                    "author": "Anonymouslystraight",
                                    "score": 1,
                                    "created_utc": 1653609383.0,
                                    "response": "Dude it’s called lending not staking there’s a difference.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia2ho02",
                    "author": "Black_Labs_Matter69",
                    "score": 20,
                    "created_utc": 1653575197.0,
                    "response": "Just. Buy. Bitcoin. Move. To. Cold. Wallet. Then take a dump and walk your dog. Easy",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia35nnf",
                    "author": "5liveR",
                    "score": 5,
                    "created_utc": 1653584803.0,
                    "response": "the best staking is securing your sats properly. The network effect will do the rest",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia3e9m0",
                    "author": "PumpkinSpice2Nice",
                    "score": 4,
                    "created_utc": 1653588250.0,
                    "response": "I won’t stake my Btc because that means trusting someone else with my coins.  I’m happy doing some DCA every month and forgoing the staking for peace of mind.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia3exkw",
                            "author": "Trifusi0n",
                            "score": 4,
                            "created_utc": 1653588521.0,
                            "response": "You can’t stake Bitcoin, it’s not proof of stake. The word you and OP are looking for is lending, not staking.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia3m74w",
                                    "author": "PumpkinSpice2Nice",
                                    "score": 1,
                                    "created_utc": 1653591491.0,
                                    "response": "I know although some businesses online advertise it as such.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia22z8g",
                    "author": "mpem___",
                    "score": 10,
                    "created_utc": 1653568358.0,
                    "response": "How to stack more SATs? Get job, from every salary take few percent and buy bitcoin. Move it to cold storage. It's that simple.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia2385o",
                            "author": "rohilaltro",
                            "score": 2,
                            "created_utc": 1653568490.0,
                            "response": "Yupz. Or sell your expertise, goods etc etc!!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia32m8r",
                    "author": "escape1979uk",
                    "score": 3,
                    "created_utc": 1653583616.0,
                    "response": "\"The way I see you can get more SATS is: By selling your expertise or service that you are good at.\"\n\nOr to paraphrase, get a job and buy sats... It's not rocket surgery\n\nIt's not like you have to work in and around the crypto space and get paid in BTC.\n\nJust buy sats from any other revenue stream.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia3ipjx",
                    "author": "Fit-Boomer",
                    "score": 3,
                    "created_utc": 1653590063.0,
                    "response": "You mean loaning it at 20% interest has possible downside?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia2ptuw",
                    "author": "SirSkittles111",
                    "score": 2,
                    "created_utc": 1653578557.0,
                    "response": "Getting interest on your btc may be a scam to you, it does not mean it is unreasonable for others like myself. I do stack sats, i also have an amount gaining yield that if in the highly unlikely event it is lost it will not be too disastrous. oH bUt yOu'Re AlLoWiNg PeOplE tO sHorT iT, who cares, when the price dumps we all celebrate cheaper prices and more sats, allow them to short it to oblivion it doesnt matter to me because i'm not looking a month ahead, not a year, atleast 10 years ahead. \n\nThe mentality should be leave people do whatever they want.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia2w1kd",
                            "author": "reggie_crypto",
                            "score": 1,
                            "created_utc": 1653581044.0,
                            "response": "This is exactly right. People should be free to use the assets they own according to their risk appetite. Bitcoin is pristine collateral and so it can work hard for you. The cold storage only crowd is dogmatic and ignorant of how this ecosystem is evolving.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "ia3m9xu",
                            "author": "halt_spell",
                            "score": 1,
                            "created_utc": 1653591523.0,
                            "response": "> The mentality should be leave people do whatever they want.\n\nNobody in this thread is calling for legislation to make it illegal to lend your Bitcoin. But we'll continue to tell people it's a bad idea and you should too. It's extremely risky and counter productive. You may be benefitting from it but you know full well if a bunch of less experienced people started to do the same 1) you would make less money and 2) they would lose their investment.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia472nd",
                                    "author": "SirSkittles111",
                                    "score": 1,
                                    "created_utc": 1653600288.0,
                                    "response": ">Nobody in this thread is calling for legislation to make it illegal to lend your Bitcoin.\n\nAnd neither was i. I was only responding to this point:\n \n>>OP: According to me this should be mindset.\n\n___\n___\n\n> But we'll continue to tell people it's a bad idea and you should too.\n\nWhy should i tell people what to do with their coins? I accept my risk of losing lent out coins as much as i accept the risk of losing my wallet. Seems to me like far more bitcoin has been lost when people take control and use their own wallets when compared to those using exchanges and what not, does that mean we should stop using cold storage because of the risk? No. So leave people who want to earn a yield alone, isnt the main point of btc all about the freedom?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "ia3mxia",
                            "author": "fireballx777",
                            "score": 1,
                            "created_utc": 1653591792.0,
                            "response": "I agree about people shorting your coins -- it doesn't matter in the long run.  The bigger issue, though, is the risk.  People are getting double-digit yields because they're taking on enormous counterparty risk.  If whomever you loaned your Bitcoin to decides to not return them... what recourse do you have?  It's the \"not your keys, not your coin\" thing, with an increased risk factor of not only the coins being on an exchange (where at least they nominally belong to you), but being lent out.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia45xu3",
                                    "author": "SirSkittles111",
                                    "score": 1,
                                    "created_utc": 1653599794.0,
                                    "response": ">People are getting double-digit yields because they're taking on enormous counterparty risk.\n\nNobody is doing double digit yields on ***bitcoin***, atleast not that I've seen... if there are CeFi companies doing it then sign me up\n\n>. If whomever you loaned your Bitcoin to decides to not return them... what recourse do you have?\n\nI accept the risk i am taking and i am controlling said risk by only putting in an amount i am comfortable with losing. Just as people say only buy what you can afford to lose, only lend what you can afford to lose",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "ia40b2t",
                            "author": "nomorefappening",
                            "score": 1,
                            "created_utc": 1653597379.0,
                            "response": "Agreed. It’s my own Bitcoin and I know the risks of putting it on a platform but I enjoy my high yield. I won’t go crying when I lose my Bitcoin but I don’t need people telling me either.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia42mae",
                    "author": "skxch",
                    "score": 1,
                    "created_utc": 1653598356.0,
                    "response": "Sell your expertise or service that you are good at to earn more sats?  \nIt's almost like.... Bitcoin is..... money!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia46h1q",
                    "author": "JerryLeeDog",
                    "score": 1,
                    "created_utc": 1653600028.0,
                    "response": "I learned how to pay my CCs off using the Fold BTC debit Card. I've made 100k sats in about 3 weeks so far. It's all free too, because before I was just paying my CCs off directly from my bank account. This is just simply routing my money thru the card. \n\nNow that we figured out how to use PayPal Bill Pay to pay mortgages, leases, utilities and all kinds of stuff we didn't think we can use a CC for, having a Fold card has been a home run \n\nCombined with my various CCs cash back value, I've been getting between 3%-9%+ of value back on every single purchase made. Highly recommend",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia4l66i",
                    "author": "Patxi1_618",
                    "score": 1,
                    "created_utc": 1653606718.0,
                    "response": "Check out the Fold card to stack more sats on everyday purchases /rent/ bills etc. Highly recommend .",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia2v22w",
                    "author": "Magnus_Effect_Kalsu",
                    "score": 0,
                    "created_utc": 1653580653.0,
                    "response": "You can use lolli when shopping and earn some sats back, or use the Gemini CC for 3-2-1% back.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uy5x2x",
            "title": "Is it just me, or y'all feel the same way?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uy5x2x/is_it_just_me_or_yall_feel_the_same_way/",
            "author": "BTC_Deepfuckvalue",
            "created_utc": 1653566193.0,
            "score": 25,
            "num_comments": 52,
            "subreddit": "Bitcoin",
            "selftext": "Everytime I hear Dylan Leclair, Jeff Booth, Parker Lewis, or Safidean Ammous on a podcast I immediately smash buy a couple hundred USD into BTC.",
            "stickied": false,
            "comments": [
                {
                    "id": "ia23bma",
                    "author": "TearsforFears77",
                    "score": 19,
                    "created_utc": 1653568541.0,
                    "response": "And Michael Saylor!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia2562x",
                            "author": "BTC_Deepfuckvalue",
                            "score": 6,
                            "created_utc": 1653569513.0,
                            "response": "For sure! Also Lyn Alden, Preston Pysh, feel like I'm forgetting many more",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia2k2xy",
                                    "author": "Romsel87",
                                    "score": 8,
                                    "created_utc": 1653576204.0,
                                    "response": "You're forgetting Jack Mallers.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia2g1n6",
                    "author": "1quickmr",
                    "score": 10,
                    "created_utc": 1653574519.0,
                    "response": "Jeff booth is a great listen on the “what Bitcoin did podcast”\n\nEvery time I wanna smash the buy button",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia2he5g",
                            "author": "BTC_Deepfuckvalue",
                            "score": 6,
                            "created_utc": 1653575081.0,
                            "response": "Yes and highly recommend his book \"The Price of Tomorrow\"",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia2w0dq",
                    "author": "Charming-Meringue-68",
                    "score": 5,
                    "created_utc": 1653581031.0,
                    "response": "Also Saylor, Foss, Pysh",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia2gxr1",
                    "author": "ScamJustice",
                    "score": 4,
                    "created_utc": 1653574892.0,
                    "response": "Booth, Saylor, Greg Foss. They get me more hype for the future of Bitcoin",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia2hxed",
                            "author": "BTC_Deepfuckvalue",
                            "score": 2,
                            "created_utc": 1653575306.0,
                            "response": "Yep 👍 Greg Foss hasn't been mentioned yet. He has great perspective on sovereign debt and credit default risk/pricing. Happy to be buying BTC while it's still a \"rounding error\" 🤣 in terms of sovereign default risk.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "ia63bwq",
                            "author": "huhehaote56",
                            "score": 1,
                            "created_utc": 1653637977.0,
                            "response": "That's right and big credit goes to this people who are constantly promoting Bitcoin.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia3x7hl",
                    "author": "0xbarbarossa",
                    "score": 4,
                    "created_utc": 1653596066.0,
                    "response": "Usually I listen to his products while I commute   https://aantonop.com/",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia6maih",
                            "author": "xjx4060",
                            "score": 1,
                            "created_utc": 1653653094.0,
                            "response": "Thank you for sharing it I will definitely like to give it a try and if it is good enough for the new people then I will share it with my friends who are willing to get involved with Bitcoin.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia4s4it",
                    "author": "wifesdontsuck",
                    "score": 3,
                    "created_utc": 1653610084.0,
                    "response": "Safidean is my new favorite",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia6akq1",
                    "author": "That-Ad1539",
                    "score": 2,
                    "created_utc": 1653644508.0,
                    "response": "Booth is a moron",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia1zl8u",
                    "author": "Friendly_Bag_4772",
                    "score": 5,
                    "created_utc": 1653566424.0,
                    "response": "Just you",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia20acq",
                            "author": "BTC_Deepfuckvalue",
                            "score": 4,
                            "created_utc": 1653566839.0,
                            "response": "Good to know I'm still front running",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia1zre1",
                    "author": "Dormage",
                    "score": 2,
                    "created_utc": 1653566525.0,
                    "response": "Who are these people?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia22mrb",
                            "author": "bobbyv137",
                            "score": 3,
                            "created_utc": 1653568168.0,
                            "response": "Saifedean Ammous featured on Jordan Peterson’s YouTube channel - they discussed Bitcoin for a couple hours. It’s a good watch/listen.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia2ja8l",
                                    "author": "King-Donkey-Kong",
                                    "score": -12,
                                    "created_utc": 1653575877.0,
                                    "response": "Jordan Peterson is a loser.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia4bbpy",
                                            "author": "kidcoodie",
                                            "score": 1,
                                            "created_utc": 1653602161.0,
                                            "response": "I agree. I can’t stand Jordan Peterson. Hes one of those people who acts & thinks like he’s a genius, but when you break down what he’s saying, you soon realize he’s a bumbling moron with a cartoon character voice\n\nHe’s also a little baby, who cries when he gets called out for his shitty takes. He just deleted his twitter or left I believe, because he made some dumbass tweet body shaming someone, and understandably got pushback.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia4gcng",
                                                    "author": "BitcoinUser263895",
                                                    "score": 1,
                                                    "created_utc": 1653604443.0,
                                                    "response": "> Hes one of those people who acts & thinks like he’s a genius\n\n*\"All the cadences of a well reasoned argument with none of the substance.\"*\n\nHe plays a character for stupid people.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "ia4gfcy",
                                                            "author": "kidcoodie",
                                                            "score": 1,
                                                            "created_utc": 1653604477.0,
                                                            "response": "The amount of people that eat up and regurgitate what he spews actually concerns me.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "ia4gy80",
                                                                    "author": "BitcoinUser263895",
                                                                    "score": 1,
                                                                    "created_utc": 1653604721.0,
                                                                    "response": "I liked watching him pretend he was realising how Bitcoin resulted in energy market arbitrage in real-time. He put on this big act where each sentence he delivered like it was a fresh thought he was having in that moment.\n\nThen immediately in the footsteps of him \"Being orange pilled in real-time\". He has a whole talking-head Bitcoin social media business launched and running, complete with an endless stream of interviews and social media posts by various paid outlets.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "ia4hrs2",
                                                                            "author": "kidcoodie",
                                                                            "score": 1,
                                                                            "created_utc": 1653605104.0,
                                                                            "response": "Yes, he is certainly a grifter that uses his status to give the impression of intelligence.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "ia1zu6b",
                            "author": "BTC_Deepfuckvalue",
                            "score": -2,
                            "created_utc": 1653566571.0,
                            "response": "If you don't know, you should seriously find out",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia1zyyl",
                                    "author": "Dormage",
                                    "score": 2,
                                    "created_utc": 1653566650.0,
                                    "response": "They arent some youtube shillers I hope. Will check.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia205hm",
                                            "author": "BTC_Deepfuckvalue",
                                            "score": 3,
                                            "created_utc": 1653566757.0,
                                            "response": "Not at all. Quality folks with very interesting perspectives on current global events and bitcoin",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "ia3lfbs",
                            "author": "horsecyack",
                            "score": 1,
                            "created_utc": 1653591175.0,
                            "response": "Please leave",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "ia4g93t",
                            "author": "BitcoinUser263895",
                            "score": 1,
                            "created_utc": 1653604399.0,
                            "response": "Talking-heads farming Bitcoiners for social media engagement.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia39reg",
                    "author": "EasyToe5460",
                    "score": 2,
                    "created_utc": 1653586435.0,
                    "response": "It’s not about the price it’s about getting to that full coin for me",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia6c3lv",
                            "author": "JJFxy",
                            "score": 1,
                            "created_utc": 1653645832.0,
                            "response": "That's right and there are many people who are willing to psychologically acquire the entire Bitcoin and it is really a good goal.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia42yl9",
                    "author": "TheChildOfChange",
                    "score": 2,
                    "created_utc": 1653598504.0,
                    "response": "Yeah those podcasts are really expensive lately",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia69o43",
                            "author": "astrodog4231",
                            "score": 2,
                            "created_utc": 1653643687.0,
                            "response": "That's right and I can understand the hidden sarcasm of this comment.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia3hsgf",
                    "author": "OpticallyMosache",
                    "score": 1,
                    "created_utc": 1653589684.0,
                    "response": "I haven't gotten the hype from Safidean Ammous, even though I wished I would. He seems to make points that are easily refuted but doesn't seem to address it. Kind of over-simplifies things.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia3jcbr",
                            "author": "BTC_Deepfuckvalue",
                            "score": 8,
                            "created_utc": 1653590322.0,
                            "response": "His two books The Bitcoin Standard and The Fiat Standard are fundamental to understanding Bitcoin IMO.\n\nHowever, I can see what you are saying, he's definitely not a hype personality.\n\nAs an Engineer, I understand his vibe. You don't have to hype technology that is grounded in fundamental economics and thermodynamics, you just observe how it affects everything it touches in the world in awe, like gravity, aerodynamics, or calculus - no need to hype it when it just works",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia3k0bx",
                                    "author": "OpticallyMosache",
                                    "score": 2,
                                    "created_utc": 1653590595.0,
                                    "response": "I totally agree on your points. I'm not saying he's lacking in all areas. He's a pioneer! My issues come from when he's explaining Austrian economics and the damage it's done to our society. I agree with him to an extent but he makes black/white statements without addressing the nuance.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia3lpnz",
                                            "author": "BTC_Deepfuckvalue",
                                            "score": 3,
                                            "created_utc": 1653591291.0,
                                            "response": "It's all about the nuance, especially in today's society where everyone just wants to pick sides and bicker. \n\nThe only thing I would offer in his defence is that sometimes the existing system uses the nuance to distract and misinform. Sometimes we need shockingly stark statements to snap us out of the matrix and investigate the kernels of truth for ourselves in the matter. \n\nI don't agree with everything he says, but more often than not he is pulling on a thread of truth, buried beneath a pile of fiat.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "ia4gcj1",
                    "author": "mrluxrius",
                    "score": 1,
                    "created_utc": 1653604442.0,
                    "response": "you guys still have dry powder?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia4hk45",
                            "author": "BTC_Deepfuckvalue",
                            "score": 1,
                            "created_utc": 1653605004.0,
                            "response": "I sell my engineering consulting services to people who regularly give me more dry powder",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia6murm",
                    "author": "NYKNYb",
                    "score": 1,
                    "created_utc": 1653653431.0,
                    "response": "Imagine still having fiat",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia6ni74",
                            "author": "BTC_Deepfuckvalue",
                            "score": 1,
                            "created_utc": 1653653814.0,
                            "response": "Holy shit lol I wouldn't be able to sleep at night",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia2j7ce",
                    "author": "King-Donkey-Kong",
                    "score": -7,
                    "created_utc": 1653575842.0,
                    "response": "I don’t even know who those people are. Is this an advertisement? It won’t work. I don’t care.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia2qbzh",
                            "author": "BTC_Deepfuckvalue",
                            "score": 4,
                            "created_utc": 1653578759.0,
                            "response": "Thought leaders. If u don't care, I don't have time to explain.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia4g5ju",
                                    "author": "BitcoinUser263895",
                                    "score": 1,
                                    "created_utc": 1653604352.0,
                                    "response": "> Thought leaders.\n\nPundits, talking-heads.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia4h64f",
                                            "author": "BTC_Deepfuckvalue",
                                            "score": 1,
                                            "created_utc": 1653604823.0,
                                            "response": "Just Bitcoin plebs like the rest of us",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia4hq1k",
                                                    "author": "BitcoinUser263895",
                                                    "score": 1,
                                                    "created_utc": 1653605081.0,
                                                    "response": "Yeah, totally not people in business. They're just talking for fun. ;)",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "ia57brh",
                                    "author": "Belmont_the_IV",
                                    "score": 1,
                                    "created_utc": 1653617499.0,
                                    "response": "Echo chamber*",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "ia2s533",
                                    "author": "King-Donkey-Kong",
                                    "score": -6,
                                    "created_utc": 1653579491.0,
                                    "response": "More like a bunch nobodies.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}