{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ukludh",
            "title": "Singapore Restaurants Accept Bitcoin Despite Government Opposition",
            "url": "https://bobosandwojaks.com/singapore-restaurants-accept-bitcoin-despite-government-opposition/",
            "author": "Tejas_LiMan",
            "created_utc": 1651955874.0,
            "score": 9,
            "num_comments": 1,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uka2x2",
            "title": "What’s the best way to buy and send BTC without ID verification? I know cashapp you can buy but can’t send without ID. Thanks",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uka2x2/whats_the_best_way_to_buy_and_send_btc_without_id/",
            "author": "rwradomski82",
            "created_utc": 1651917594.0,
            "score": 3,
            "num_comments": 18,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i7nz8yo",
                    "author": "solomonsatoshi",
                    "score": 4,
                    "created_utc": 1651922700.0,
                    "response": "[bisq.network](https://bisq.network)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7o5mlh",
                    "author": "igadjeed",
                    "score": 3,
                    "created_utc": 1651926892.0,
                    "response": "> buy\n\nBuy Bitcoin from your friends, in person, for cash\n\n> send\n\nUse your own wallet. An exchange account is not a wallet. CashApp is not a wallet",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7o2g54",
                    "author": "DudeIncogneto",
                    "score": 3,
                    "created_utc": 1651924910.0,
                    "response": "hodlhodl, bisq, azteco bitcoin vouchers",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ukl8mg",
            "title": "Bitcoin is up 10× from March 2020 lows. Many stocks are below March 2020 lows",
            "url": "https://www.reddit.com/r/Bitcoin/comments/ukl8mg/bitcoin_is_up_10_from_march_2020_lows_many_stocks/",
            "author": "KAX1107",
            "created_utc": 1651953980.0,
            "score": 154,
            "num_comments": 35,
            "subreddit": "Bitcoin",
            "selftext": "Bitcoin didn't fail as inflation hedge. Bitcoin is the leading signal. Do you realise how lucky we are to be living in this time when the world is yet to get its head around the superiority of perfectly engineered money over human manipulated money? Don't get distracted by short term noise. It comes from two kinds of people. Those who fear bitcoin and those who want your bitcoin cheap.",
            "stickied": false,
            "comments": [
                {
                    "id": "i7qdgn6",
                    "author": "ChrimsonChin988",
                    "score": 30,
                    "created_utc": 1651964089.0,
                    "response": "We're gonna get fked for the next 1.5-2 years is my estimate.\n\nI wonder how long they're going to keep up the 'were really gonna raise interest rates a lot' spiel.\n\nEntire financial system leveraged to the tits, government debts 100%+ there's no freakin way they raise interest rates above 2.5-3%. That's probably already going to blow shit up in combination with reducing fed balance sheet.\n\nClown world. I'm gonna keep stacking, I don't care they can keep their worthless fiat currencies. They will need something to wipe their tears in the coming decade.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7qf7p4",
                            "author": "ihateduckface",
                            "score": 10,
                            "created_utc": 1651964961.0,
                            "response": "I think that’s when Bitcoin finally breaks away from the stock market",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i7qyb1j",
                            "author": "dupleVe",
                            "score": 7,
                            "created_utc": 1651974878.0,
                            "response": "Yep, keep in mind while you’re buying sats with USD someone else is buying them with euros, or yen, or whatever currency they use in the Central African Republic, everyone is trading their failing fiat for the hardest asset in existence, BTC is inevitable",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7q1czu",
                    "author": "Fun_Square_8737",
                    "score": 35,
                    "created_utc": 1651958329.0,
                    "response": "Bro why are so many people hating on Bitcoin ? Are they jealous ? Does it disrupt their safety net ? Make them feel scared? Lots of people giving me shit on Reddit today about Bitcoin. Talking about how it’s designed to fail, not real money. Then when you tell them fiat currency isn’t real either they get upset. Somehow liking Bitcoin gets associated with being a conspiracy theorist or something . I don’t even know bro wtf do you think people are tripping about ?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7q67q4",
                            "author": "plague_rattt",
                            "score": 8,
                            "created_utc": 1651960623.0,
                            "response": "People only believe what they are told to believe. Why do you think conspiracy theorists are batting a 900 the last 2 years?\n??",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7qs6vr",
                    "author": "Imthedeadofwinter",
                    "score": 5,
                    "created_utc": 1651971673.0,
                    "response": "this fact actually scares me, it can simply continue to drop more with all of that space",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7pzgz7",
                    "author": "ndgoLiberty",
                    "score": 6,
                    "created_utc": 1651957470.0,
                    "response": "Few understand this.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7rl64o",
                    "author": "ManyArtichoke",
                    "score": 4,
                    "created_utc": 1651987791.0,
                    "response": "Most stocks are well above their March 2020 lows. The S&P500 was at 2,200 in March of 2020. It's currently around 4,100.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7rwdwi",
                            "author": "clintron_abc",
                            "score": 4,
                            "created_utc": 1651996614.0,
                            "response": "don't talk any truth in this sub, you'll get downvoted",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7pz5lz",
                    "author": "Reverend_James",
                    "score": 3,
                    "created_utc": 1651957328.0,
                    "response": "Yes, but... it just crashed from the local high last week.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7q23sj",
                            "author": "dadlif3",
                            "score": 15,
                            "created_utc": 1651958662.0,
                            "response": "Lol. That's most people's attention span.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7ptvx2",
                    "author": "ReedB04",
                    "score": 3,
                    "created_utc": 1651954968.0,
                    "response": "Not quite 10x but I get your point.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7q8gir",
                            "author": "SomeBrokeChump",
                            "score": 14,
                            "created_utc": 1651961677.0,
                            "response": "Were you not around in March 2020? The low of March 2020 was $3,600.\n\nhttps://www.forbes.com/sites/investor/2020/03/13/bitcoin-crash-2020/",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "ukpdna",
            "title": "Harvard CS says to me yesterday with a condescending smile: No not really, there's not much to bitcoin, it lacks any of the complexity we see in cutting edge computer science; blockchains they're slow, expensive, and difficult to maintain things; I struggle to notice any technological innovation.",
            "url": "https://www.reddit.com/r/Bitcoin/comments/ukpdna/harvard_cs_says_to_me_yesterday_with_a/",
            "author": "Mallardshead",
            "created_utc": 1651966890.0,
            "score": 74,
            "num_comments": 133,
            "subreddit": "Bitcoin",
            "selftext": "**Mallardshead**: If you look directionally at our human past, you'll notice a dominant recurring theme with complexity, which is this: you'll notice the greatest inventions and ideas of all time were stupefyingly simple: fire, the wheel, the compass, pasteurization, printing press, electricity, Uber, etcetera. Things so simple that most people laughed, were too smart for, seeing right through their artless folly. How can for example, simply heating something save millions of lives and give onto the study of microbe science as Luis Pasteur discovered with pasteurization? Why is that a world altering discovery? Humans have a tendency to go out looking for complexity, and this I believe is called *complexity bias*, which sounds unique, in that the majority of cognitive biases exist to save mental energy, but really it is, in fact, another mental shortcut, one that makes me quite confident that bitcoin the network has exploited unrecognized simplicities, the telltale sign of technological treasure.\n\n**Harvard CS**: Ok, I'm listening.\n\nConclusion:\n\nThis orange 💊 will be one of my finest moments (still work to do), because the highest rung I've gotten so far is a Director of Philanthropy at a mid-size charity some of you might know. This CS is a rung above that because of what she represents. There's not much higher to climb though, because beyond this would be fortune 1000 territory and Peter Schiff. Finna leave those balls for the designated hitters.\n\n*P.S.*\n\n*I also believe self-custody has turned into a complexity bias. It's gotten ridiculous. Dabbling in Shamir Secrets, SeedXor, multisig schemes, substitution cyphers, FediMint, STOP! So ridiculous we now have this full-blown L1 fork called BIP119 that promises to fix it once and for all. STOP! Memorize your damn seed and back it up.*",
            "stickied": false,
            "comments": [
                {
                    "id": "i7rp2bb",
                    "author": "autodidactic67",
                    "score": 33,
                    "created_utc": 1651990672.0,
                    "response": "30 years ago my teacher here in germany had a saying: \"Good technology has to be as simple as possible and only as complex as needed\".",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7sntt5",
                            "author": "SaasSalesRep",
                            "score": 11,
                            "created_utc": 1652017177.0,
                            "response": "But bitcoin and Blockchain is the least simple concept - how is it simple?",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i7rpr4m",
                            "author": "Mallardshead",
                            "score": 3,
                            "created_utc": 1651991212.0,
                            "response": "🎯",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7qtby8",
                    "author": "thefullmcnulty",
                    "score": 28,
                    "created_utc": 1651972269.0,
                    "response": "“Simplicity is the ultimate sophistication.” -Leonardo Da Vinci\n\nThere is a reason this quote comes from a prolific inventor / engineer / artist / mathematician / scientist. Simplicity in a functional and durable solution is extremely hard to achieve. Simplicity is not a bug but a feature.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7r5qx7",
                            "author": "zack907",
                            "score": 7,
                            "created_utc": 1651978867.0,
                            "response": "I can’t remember the author but the following quote has stuck with me for decades since hearing it. “Sorry for the long letter, I didn’t have time to make it more concise” It took place back when the only long distance communication was letters. A college professor told us about it as part of a lesson explaining why the less words you use to make a point the better.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7rt0md",
                                    "author": "thefullmcnulty",
                                    "score": 6,
                                    "created_utc": 1651993818.0,
                                    "response": "I work on this continually. \n\nHigh-quality distillations fire me up like few other things. Listening to exceptionally educated / experienced / intelligent people speak on areas of expertise is a life-changing form of data compression.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i7qrvkb",
                    "author": "ndgoLiberty",
                    "score": 70,
                    "created_utc": 1651971513.0,
                    "response": "They are slow, expensive, and not particularly scalable.\n\nBut they are the absolute only way to create uncensorable, decentralized money.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7r273n",
                            "author": "mantits-",
                            "score": 11,
                            "created_utc": 1651976957.0,
                            "response": "Currently.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7r8zz4",
                                    "author": "ndgoLiberty",
                                    "score": 17,
                                    "created_utc": 1651980653.0,
                                    "response": "Lightning isn’t a blockchain. And Fast blockchains aren’t decentralized or secure. So I don’t see what you mean.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i7rp8dm",
                                            "author": "GoatsePoster",
                                            "score": 8,
                                            "created_utc": 1651990802.0,
                                            "response": "one reading:  some undiscovered, superior technology is allowed by the laws of Nature but hasn't been invented yet.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i7s504l",
                                                    "author": "ndgoLiberty",
                                                    "score": 3,
                                                    "created_utc": 1652004266.0,
                                                    "response": "Yes. That or there is a limit to blockchains and we’ll just have to wait a really freaking long time for the improvement.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i7ruloy",
                            "author": "newplayerentered",
                            "score": 3,
                            "created_utc": 1651995127.0,
                            "response": "Unless 51% of users actually agree to discriminate against the 49% minority. Where have I seen this happen..... Oh wait the real life.\n\nI'm confident some problems will be solved by block chains. I'm also confident it's not a world altering god sent next chapter in human evolution.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7rw4nw",
                                    "author": "irgeorge",
                                    "score": 7,
                                    "created_utc": 1651996398.0,
                                    "response": "Even in this scenario, a 51% attack can only affect transactions in the mempool waiting to be included in blocks. All other coins not being transacted outside that ~10 minute window would be safe.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i7s0dly",
                                            "author": "ndgoLiberty",
                                            "score": 7,
                                            "created_utc": 1652000105.0,
                                            "response": "correct. for an attacker to have any meaningful effect they'd have to maintain 51% hashrate for days if not weeks.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i7s2ieo",
                                    "author": "johnisonpills",
                                    "score": 3,
                                    "created_utc": 1652002015.0,
                                    "response": "Tbh as a programmer i might be biased but i think its along the lines of invention of the wheel",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i7r1wcx",
                            "author": "WaterMySucculents",
                            "score": 3,
                            "created_utc": 1651976796.0,
                            "response": "Yea but no one here is looking to use it as money. They are looking to get return on their investment.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7r2ob5",
                                    "author": "JSkeezTheGreat",
                                    "score": 13,
                                    "created_utc": 1651977215.0,
                                    "response": "That's where you're wrong.. many people who actually understand the value proposition, myself included,  live on a BTC standard and have no intention of selling back for FIAT..",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i7re3tp",
                                    "author": "Mallardshead",
                                    "score": 10,
                                    "created_utc": 1651983497.0,
                                    "response": "Remember that commodities are collateral, and collateral is money. I think the world is starting to understand this with the Ukraine situation. I've taken innumerable low-interest fiat loans against my bitcoin before. We also have bitcoin mortgage business just now popping up, and Goldman Sachs just made a bitcoin-backed loan to Coinbase. Bitcoin is in the long, difficult, and organic process of absorbing the world's trust (and thus value). Many blockchain projects try to skip this step. When it's absorbed enough, the confidence curve (and thus volatility) will flatten. It's early in its monetization phase. With that said, the medium of exchange layer (Lightning Network) might sharpen the blade's other side faster than we think if it keeps growing parabolically.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i7rtgm4",
                                            "author": "5liveR",
                                            "score": 5,
                                            "created_utc": 1651994188.0,
                                            "response": "great point of view. thanks",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i7r8zgm",
                                    "author": "halt_spell",
                                    "score": 5,
                                    "created_utc": 1651980645.0,
                                    "response": "I use it as money.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i7rsq0d",
                    "author": "Bitcoin__Hodler",
                    "score": 5,
                    "created_utc": 1651993576.0,
                    "response": ">blockchains they're slow, expensive, and difficult to maintain things;\n\non point!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7r5fln",
                    "author": "Even-Home-9126",
                    "score": 13,
                    "created_utc": 1651978693.0,
                    "response": "Every good love song is so simple you kick yourself for not writing it first",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7rb8zu",
                            "author": "Mallardshead",
                            "score": 5,
                            "created_utc": 1651981863.0,
                            "response": "🤣 Yup.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7rz2fb",
                    "author": "trilli0nn",
                    "score": 4,
                    "created_utc": 1651998962.0,
                    "response": "Just because there are increaingly more options for self-custody doesn’t make it more complex. The simpler options are still available. You seem to fail to recognize that not everyone has the same needs.\n\nSelf-custody using a phone wallet for modest amounts and a hardware wallet for larger amounts is simple and will do for most. Memorizing the seed is not advisable — human memory is not suitable for storing random information for longer periods.\n\nAlso, you forgot to mention to the Harvard CS that most inventions are often a cleverly engineered solution built on top of existing technologies, Bitcoin included. This is why most inventions don’t seem complex —  most of its constituents had already been invented.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7rnub3",
                    "author": "MonsieurReynard",
                    "score": 3,
                    "created_utc": 1651989725.0,
                    "response": "What is a \"Harvard CS?\" \n\nA professor? A graduate student? A sophomore CS major?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7rru14",
                    "author": "bitcoin_islander",
                    "score": 3,
                    "created_utc": 1651992854.0,
                    "response": "Is this a BIP119 propaganda post?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7qv8bd",
                    "author": "sheltojb",
                    "score": 8,
                    "created_utc": 1651973264.0,
                    "response": "Cash dollar bills require no memorizing of seeds or backing them up.  Let's talk about this complexity bias thing.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7qzzt0",
                            "author": "Mallardshead",
                            "score": 4,
                            "created_utc": 1651975783.0,
                            "response": "Memorizing your seed is a once in a lifetime requirement. People spend more time listening to and memorizing the lyrics of disposable pop songs than their financial sovereignty. It's probably the coldest act of self-sovereignty there is, bonding bitcoin to your person as language; I wonder what the First Amendment will have to say about that in the future. Obviously you then back it up (I prefer multiple hard wallets), but beyond language, every other option gets more complex creating more vectors to lose access to your bitcoin, never improving the security of a 24-word seed and passphrase used properly. You look at 99% of cases where people lose access to their bitcoin, and memorizing their seed would've avoided it all, not the opposite, where they forgot a memorized seed. \n\nMultisig is necessary for businesses and other various applications. Not for individuals. It's ridiculous in fact.\n\nPaper dollars on the other hand don't require any proof of work. All paper dollars eventually return to their intrinsic value: ZERO.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7rxxwq",
                                    "author": "trilli0nn",
                                    "score": 10,
                                    "created_utc": 1651997971.0,
                                    "response": ">\tMemorizing your seed \n\nThat’s reckless and ill advise. People who try this will forget and lose their coin. It’s also not a once in a lifetime requirement either because without rehearsing the seed frequently I’d expect 99% to forget their seed within a year.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i7rz5lc",
                                            "author": "Mallardshead",
                                            "score": 3,
                                            "created_utc": 1651999041.0,
                                            "response": "I said memorize your seed and **back it up.** I once watched a whale lose his bitcoin because a flood took his house and his backups along with it. I once watched a friend have cops show up to his bank with a warrant and gas tools. They didn't seize his bitcoin, but they never returned his metal backups or hard wallet. Bitcoin gone. This whole *the mind will magically forget and there's Alzheimer's and bike accidents, etc,* is the like the people that talk about abortion and immediately ponder the .001% of cases involving rape. Memorize the seed. Back it up. That's it. We should also teach people to create their own personal seeds (poetry or personal story) based on the BIP39 wordlist. Like a custom tattoo for the brain . Instead we have ever increasing technical complexity and forks because that's apparently making third parties money.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i7rzy2a",
                                                    "author": "trilli0nn",
                                                    "score": 3,
                                                    "created_utc": 1651999727.0,
                                                    "response": ">\ta whale lose his bitcoin because a flood took his house and his backups along with it. I once watched a friend have cops show up to his bank with a warrant and gas tools. They didn’t seize his bitcoin, but they never returned his metal backups or hard wallet.\n\nThe real problem in these cases is having only one physical copy of the seed or multiple ones but stores at the same location. A fire is all it takes to lose the seed. The obvious solution is to store the seed in multiple locations, not to memorize the seed.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i7s0eun",
                                                            "author": "Mallardshead",
                                                            "score": 4,
                                                            "created_utc": 1652000136.0,
                                                            "response": "Stop trying to add more and more complexity and justify not doing the most basic act of self sovereignty. Now we have multiple hidden locations, holes here, safes there, and other bullshit. Memorize your seed. Back it up. That's it.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i7rkmtt",
                                    "author": "Technical_Emu_8567",
                                    "score": 4,
                                    "created_utc": 1651987421.0,
                                    "response": "I beg to differ. Multisig is a brilliant solution for individuals too.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i7rm9vf",
                                            "author": "Mallardshead",
                                            "score": 3,
                                            "created_utc": 1651988577.0,
                                            "response": "In limited scenarios yes. But most don't need it.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i7s2hum",
                                    "author": "MonsieurReynard",
                                    "score": 3,
                                    "created_utc": 1652002002.0,
                                    "response": "Show me when the US dollar was ever worth less than a dollar. 🤣",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i7rgjlv",
                    "author": "bigldk10",
                    "score": 7,
                    "created_utc": 1651984871.0,
                    "response": "Cracks me up reading all these high falutin ideas on the complexity or lack thereof in BTC, or any crypto for that matter. Seems to me the idea that there may… MAY, be a way to have a better say in ones own financial life? Works for me. I got in 7 months ago. And Im in my SIXTIES :) Maybe I’ll make some money… maybe my grandkids will…",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7sva64",
                    "author": "PensAndCoffee",
                    "score": 4,
                    "created_utc": 1652020825.0,
                    "response": "/r/thathappened",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7rffv9",
                    "author": "OrbitalNode",
                    "score": 4,
                    "created_utc": 1651984267.0,
                    "response": "> I also believe self-custody has turned into a complexity bias.\n\nYou sound like someone who thinks they will live forever.  You do not sound like someone who has thought a lot about passing on your wealth in a will, after you die.\n\nBIP119 makes bitcoins more secure for people and institutions that  need security.  It helps them self-custody their own coins rather than giving them to a trusted custodian.  It helps them set up a scheme with a lawyer that can give control to their heirs after they die, without risking the lawyer taking it all in the meantime.  Money is only valuable to you when it is valuable to other people, so you should appreciate some of their concerns.  \n\nOf course people can memorize seeds.  If you don't need better security than that, then congratulations your privacy plan is working.  But if someone doxxes you as a bitcoiner, and the $5-wrench-wielding thugs know where you live, then you will want better security.  Even if no one will ever dox you, think of all the millions who had to go through amlkyc to get coins, because mining economics were not in their favor.  They are mostly doxxed already, and are more likely to need better self-custody options.\n\nWhen other people decide they need bitcoins, you don't fault them for the reason why, right?  So, why be so against some bitcoiners who want better custody options?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7rngob",
                            "author": "Mallardshead",
                            "score": 4,
                            "created_utc": 1651989435.0,
                            "response": "I've thought plenty of my own viability—mind and body—and already have a plan in place, which doesn't involve lawyers or probate courts. BIP119 is a nightmare for fungibility, and those voting *pro* don't have a good understanding of derivatives and what those can do in the meatspace when L1 has spending conditions. They also believe that mainstream bitcoin use will involve the majority of people transacting with self-custodial wallets/hardware. \n\nI'm currently investing an exploit with BIP119 and it relates to MIT's [supposedly abandoned] ChainAnchor.  \n\nYou said \"better security\", and I'm unaware of 24-word seeds/passphrases being broken. BIP119 introduces security exploits off-chain. A $5 wrench? What exactly does BIP119 solve that a hard wallet duress PIN doesn't in that case? \n\nI think you've been enticed by talk of smart contracts and other bullshit that DLC's, Taproot scripting, and HTLC's will easily achieve. You're not talking by the way to some ersatz newb without an excellent command of this stuff.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7sl1og",
                                    "author": "OrbitalNode",
                                    "score": 8,
                                    "created_utc": 1652015715.0,
                                    "response": "> I've thought plenty of my own viability—mind and body—and already have a plan in place, which doesn't involve lawyers or probate courts.\n\nNice.  Presumably you would not force that plan on other people though, right?\n\n> BIP119 is a nightmare for fungibility, and those voting pro don't have a good understanding of derivatives and what those can do in the meatspace when L1 has spending conditions. They also believe that mainstream bitcoin use will involve the majority of people transacting with self-custodial wallets/hardware.\n\nCool, we have shifted the goalposts.  First we didn't need self-custody, but now that's okay and you have specific other complaints.  I am here to learn, and I'm happy that you are willing to engage.\n\n> nightmare for fungibility\n\nI can't see what the fungibility problem is.  You do know that I can't attach a covenant to your address, right?  That's a *recursive covenant*, and nobody thinks that BIP119 has any conceivable flaw allowing recursive covenants.  Only the person generating their addresses can define conditions in a BIP119 payout tree.  You can also use it inside Taproot transactions and have a cooperative payout when that makes sense, allowing the same herd privacy that Taproot allows.\n\n> derivatives\n \nThe two main uses for BIP119 are:\n\n  * self-custody vaults; and \n\n  * scaling & privacy via pooled UTXOs.  \n\nLinks to detailed explanations below.\nDerivatives operate using an external oracle and can't help with those use cases.\n\n> majority of people transacting with self-custodial wallets/hardware\n\nThat's a total [straw man](https://en.wikipedia.org/wiki/Straw_man).  Nobody claims that BIP119 makes external custodians completely go away.  \n\nIt makes bitcoins more useful to people:\n\n* that have self-custody needs different from yours, since as a result some of them will not give up on security and use a custodian; and  \n\n* who need to use [scaling and privacy pools](https://bitcoinmagazine.com/culture/building-on-taproot-payment-pools-could-be-bitcoins-next-layer-two-protocol), because the pools can be bigger with BIP119 than with other techniques, due to interactivity requirements.\n\n> I'm currently investing an exploit with BIP119 and it relates to MIT's [supposedly abandoned] ChainAnchor.\n\nThat's awesome and I hope you can tell us what is going on.  You know you can win a 5.5 bitcoin bounty if it's a showstopper!  \n\nIt also has nothing to do with your original complaints.  I'm judging it as total and complete [red herring](https://en.wikipedia.org/wiki/Red_herring)...\n\n...But I wouldn't if you told me some specifics.  Then I could judge it as right or wrong.  I would like to hear anything that you know, besides \"ChainAnchor\", because I don't see how BIP119 enables the the attack.  (Should the attack be possible without BIP119, then that would also be a red herring.)  If you can change my mind I would be very grateful.\n\n> You said \"better security\", and I'm unaware of 24-word seeds/passphrases being broken.\n\nOf course the simple cryptography is as advertised. You say you have your seed backed up and you're not splitting it with Shamir, so then if you are ever going to give these bitcoins to people you love, after you exit this plane of existence, you will have a physical object that other people can find and exploit.\n\nThe whole point of self-custody features is to improve your defense by removing that attack point.  Like I said earlier, if you don't want it, then cool.  But if I do want it, and I have clear reasons that it can help millions of people making slightly different choices than you, then you gotta show me how it increases some risk for you and your setup.\n\n> BIP119 introduces security exploits off-chain.\n\nFUD, my friend.   You are giving no clue whatsoever to your claim.\n\n> A $5 wrench? What exactly does BIP119 solve that a hard wallet duress PIN doesn't in that case?\n\nSomeone [asked a similar question](/r/Bitcoin/comments/ti2x6a/how_does_multisig_protect_you_against_the_5/i1bose0/) a month ago.  BIP119 allows similar options, but **even more advanced**, so I will quote myself:\n\n>>You have to apply iterated rounds to the game theory.\n>>\n>> Multisig protects you in the following ways:\n>>\n>>* criminals learn (before they attack you) that people with multisig are expensive to attack, because they have to not only multiply their risk of getting caught times the number of signers, but also kidnap and coerce multiple signers at once, so that you do not warn the next signer;\n>>\n>>* you can prove your use of multisig by revealing the script, so that you can encourage de-escalation;\n>>\n>>* wallets that always use multisig advertise their difficulty to all attackers at once.\n\nOkay back to discussion.\n\n> I think you've been enticed by talk of smart contracts and other bullshit that DLC's, Taproot scripting, and HTLC's will easily achieve.\n\nHave you looked at some of the code proving what can be done with BIP119?  [This vault feature](https://github.com/jamesob/simple-ctv-vault#why-ctv) definitely cannot be done without a consensus change to Bitcoin.  Obviously regular users wouldn't engage with it like this.  In our shared future, vaults will be a wallet feature that is mostly hidden.\n\nBIP119 is the simplest change possible to do this, and the other possible consensus changes do not even have their BIPs finished, so they are years away.  People do make decisions about whether to hand their bitcoins to custodians, and without wallet developers building better options, we'll lose years of people to custodians.  Their loss of privacy will then make your transactions easier to extract using the blockchain analysis.  You should care about this.\n\n> You're not talking by the way to some ersatz newb without an excellent command of this stuff.\n\nI appreciate a real conversation.  So many people have picked sides based on what their favorite luminaries said on Youtube or Twitter.\n\n**tldr**:\n\n  * you haven't shown how BIP119 harms anyone\n\n  * you haven't acknowledged that many people want self-custody options different from your choices\n\n  * you might be confused about recusive covenants versus non-recursive covenants\n\n  * you have shifted the goalposts to FUD\n\n  * i have shown in specific ways how self-custody can be improved, and why you want that for others\n\n  * BIP119 offers the best scaling and privacy pools, allowing more people to make transactions in a future where even settling a LN channel is too expensive for most people.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i7r4c04",
                    "author": "friendly_stranger_69",
                    "score": 4,
                    "created_utc": 1651978105.0,
                    "response": "This is cringe. Dunning-Kruger much? Imagine being this smug while the asset you’re defending has been tanking for 6 months. The Harvard CS is right on the money btw",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7rbkb8",
                            "author": "Mallardshead",
                            "score": 11,
                            "created_utc": 1651982042.0,
                            "response": "Isn't it up 700% in the last 15 months? I mean I've been guilty of cherry-picking too, but when the USD's purchasing power has collapsed 99.9% in only 13 years against an asset, and $35k not that long ago was considered a monstrous bubble the likes of which we've never seen, and now $35k is a low point and collapse, your logic breaks down.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i7rn41s",
                            "author": "MonsieurReynard",
                            "score": 8,
                            "created_utc": 1651989177.0,
                            "response": "Of course you first have to believe OP is telling the truth and actually had a debate with a \"Harvard CS\" person. Whatever that even means. To fall for it, you're expected not to think too hard or know anything about CS as a field or universities as places full of different  kinds of people. \n\nWas this a professor? A grad student? A former undegrad CS major? Irrelevant to the story. Only the \"Harvard\" part is essential to the rhetorical flourish. It could be a 19 year old kid in his first year of a CS major. Or not.  But OP hopes you picture a professor in a tweed jacket smoking a pipe and \"condescendingly\" looking down their nose at the clowns on Reddit. \n\nSuch a person does not exist. \n\nI always wonder this: if Bitcoin or crypto or blockchain is really the sure technology of the future, why do you need or even want to convince or proselytize other people to believe it or invest in it? Wouldn't you want to keep it to yourself and hoard the massive guaranteed future profits you'll make?\n\nTLDR I don't believe a word of the OP. It's a just so story. All con jobs require such stories to fleece their marks by making them feel smarter than other people -- in this case supposedly people with fancy Ivy League credentials. Who likely do not exist. \n\nI've seen about as much \"computer science\" knowledge on crypto subs over the years as I expect I'd see at ComicCon.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7rolwn",
                                    "author": "effetsdesoir",
                                    "score": 5,
                                    "created_utc": 1651990314.0,
                                    "response": "Or if it was the technology of the future, surely it would be used somewhere already or being adopted by companies? Ask any CS (programmer, professor etc.) and they will tell why blockchain isn’t a good solution for almost any problem.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i7r9tbx",
                            "author": "timcurrysaccent",
                            "score": 6,
                            "created_utc": 1651981091.0,
                            "response": "I love reading the Bitcoin reddit account for the crazy evangelism and Bitcoiners all telling each other how right they all are. This is another breathtaking example.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7rc200",
                                    "author": "Mallardshead",
                                    "score": 7,
                                    "created_utc": 1651982321.0,
                                    "response": "Changes to society don't come from the majority or the center, they come from the poles. Think of christianity when it was a radical jewish sect, or Copernicus, or vegans, or trans, or rap coming out of the late 80s. You think if they would've said, \"Yes we understand, sorry, we'll keep it in our basements from now on,\" anything would've come of them? No. The intransigent minority. And careful using religions as a comparison, because those have outlasted empires.\n\nHave an upvote on me for the try though. 🍻",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i7r0tj2",
                    "author": "OrangeHODLr",
                    "score": 4,
                    "created_utc": 1651976224.0,
                    "response": "Interesting my experience with Ivy Leaguers they are all lazy and narcissistic.  Like I’d never actually hire one if I wanted to get actual work done.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7s2t79",
                            "author": "MonsieurReynard",
                            "score": 7,
                            "created_utc": 1652002296.0,
                            "response": "OP says they went to Fordham. \n\nTuition at Fordham is $1000 more a year than Harvard. \n\nWhy do  I doubt you're ever in a position to \"hire\" any \"Ivy Leaguers\" anyway, two days on Reddit shilling BTC as it crashes tells me you don't hire anyone. \n\nAnyway this \"Ivy leaguer\" OP tells us about clearly does not exist. Read on... he claims it's an \"acquaintance of a friend,\" and a woman tenured professor of CS At Harvard.\n\nThere are 5 women tenured profs of CS on the Harvard faculty. None of them work on blockchain bullshit. OP made this story up. You confirmed the bias OP hopes would sell his story. By making his imaginary foil a \"condescending Ivy Leaguer,\" he played to your stereotype. \n\nLol",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7r5q9t",
                    "author": "tiderolling",
                    "score": 3,
                    "created_utc": 1651978858.0,
                    "response": "Sometimes people are so smart they are stupid af",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uknbw0",
            "title": "Neft Vodka supports the Bitcoin Economy",
            "url": "https://i.redd.it/enhwazrrk4y81.jpg",
            "author": "Nice_Category",
            "created_utc": 1651960411.0,
            "score": 44,
            "num_comments": 13,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i7qfq4r",
                    "author": "NiceDoctorBeam",
                    "score": 3,
                    "created_utc": 1651965220.0,
                    "response": "Can't miss it w/ that packaging.  If I see it, I'll try it.  If it's decent, I'll keep buying it.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uklzk6",
            "title": "The “dead person HODL” from Bitcoin: Everything Divided by 21 Million.",
            "url": "https://i.redd.it/les1t2oq84y81.jpg",
            "author": "thadiusb",
            "created_utc": 1651956319.0,
            "score": 50,
            "num_comments": 20,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i7q2nvy",
                    "author": "podiepie",
                    "score": 10,
                    "created_utc": 1651958922.0,
                    "response": "dead men tell no seed phrases.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7qtf5v",
                    "author": "road22",
                    "score": 12,
                    "created_utc": 1651972316.0,
                    "response": "As long as Bitcoin buyers leave their coins on the exchanges, there is no limit of 21 million Bitcoin.\n\nYears ago, at the first of every year, there was a push by Trace Meyer for everyone to pull their coins off the exchanges and BTC would rise up in price.\n\nNow I think the exchanges have become too powerful and shut that move down.\n\nGET YOUR FUCKING COINS OFF THE FUCKING EXCHANGES.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7pxh51",
                    "author": "OrangeHODLr",
                    "score": 10,
                    "created_utc": 1651956569.0,
                    "response": "Dead men tell no seed phrases.  At least not until unfrozen.  Imagine if Walt Disney held crypto.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7qf2yk",
                    "author": "Mallardshead",
                    "score": 5,
                    "created_utc": 1651964893.0,
                    "response": "Cryogenic freezing unfortunately does not preserve memory. Every organism that they've frozen and brought back heretofore preserves no memory.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7qjeud",
                    "author": "Ok_Economics1981",
                    "score": 3,
                    "created_utc": 1651967072.0,
                    "response": "nobody memorices the 12/24/25 words",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7rwkg6",
                            "author": "irgeorge",
                            "score": 3,
                            "created_utc": 1651996774.0,
                            "response": "Right. Sure it sounds cool but it’s so ridiculously unpredictable, now factor in that stress affects memory recall — try to imagine how calm you’ll be when you absolutely need to remember that phrase.\n\nThe only time I can imagine it being useful are for extremely short amounts of time, like a refugee crossing a border with their life savings.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "uklsod",
            "title": "The SEC is preparing for an increasingly risky marketplace for cryptocurrencies and other digital assets that are considered to be securities. Curiously, Bitcoin was not mentioned in their latest press release. Holding shitcoins might become even riskier.",
            "url": "https://www.btctimes.com/news/sec-doubles-staff-to-monitor-cryptocurrency-activity",
            "author": "CoinCorner_Sam",
            "created_utc": 1651955722.0,
            "score": 41,
            "num_comments": 11,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i7q0deb",
                    "author": "paperraincoat",
                    "score": 10,
                    "created_utc": 1651957879.0,
                    "response": "It's only a matter of time until basically 'everything but Bitcoin' gets regulated as a security. It's pretty straightforward, the SEC has used the [Howey test](https://www.investopedia.com/terms/h/howey-test.asp) since 1946, and after even a cursory read, altcoins definitely qualify: \n\n\n>Under the Howey Test, an investment contract exists if there is an \"investment of money in a common enterprise with a reasonable expectation of profits to be derived from the efforts of others.\" \n\n\nIt's also the reason you saw the whole crypto ICO market dry up as soon as there were rumblings of the SEC stepping in. Nobody wanted to get dragged into court for spinning up yet another altcoin and rug-pulling all the 'investors'.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7s95wb",
                            "author": "biba8163",
                            "score": 5,
                            "created_utc": 1652007829.0,
                            "response": "What crypto projects have done is create issuance of shares, sell it to the public collecting money with the understanding that team issued and sold these shares is going to build a network enterprise that will result in profit for investors.   The fact that they call it a cryptocurrency instead of shares and that there is a disclaimer that the investor has no rights, does not mean that it is not a security.  It has all the properties of security with the additional loophole that investors get scammed because they have no rights, projects operate opaquely, the project's team is not answerable to investors and can abandon the project when they've collected enough money or lose interest.  The last 5 years has confirmed that almost every one of these projects are either scams or at best hyped money grabs.  It's mind boggling that the SEC did nothing to prevent the bamboozling of investors to hundreds of these crypto projects on U.S. exchanges while at the same time rejecting multiple Bitcoin ETF submissions, which addressed prior SEC concerns, under the guise of protecting retail investors.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7q28ih",
                    "author": "red_pill_rage",
                    "score": 3,
                    "created_utc": 1651958722.0,
                    "response": "This whole \"protection\" is no difference than how they \"protect\" retail investors in the stock market.  We are about to head into an economic catastrophe partly because the criminals on Wallstreet have been doing their thing unabated while the SEC look the other way while collecting their fees.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7pwy9v",
                    "author": "Micksar",
                    "score": 4,
                    "created_utc": 1651956341.0,
                    "response": "The writing has been on the wall for some time now. The SEC considers Bitcoin a commodity. Everything else will be considered a security, once the dust settles.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ukl1xm",
            "title": "Multisig questions",
            "url": "https://www.reddit.com/r/Bitcoin/comments/ukl1xm/multisig_questions/",
            "author": "1MillionUSD",
            "created_utc": 1651953431.0,
            "score": 7,
            "num_comments": 6,
            "subreddit": "Bitcoin",
            "selftext": "Hello dear Bitcoiners!\n\nI have questions for the multisig experts and hope that somebody can help me:\n\n&#x200B;\n\n1. Lets suppose we have 5 keys (A, B, C, D, E). Is it possible to create a multisig address with the following payout structure: A and B have to sign plus one of the others (C, D, E). So something like a 3 of 5 but with the limitation that A and B must be part of the singning process? If this is possible, is there a name for this kind of multisig? Does anybody know where to find more information about this?\n2. I heard that it is possible to create a multisig address where the numer of needed keys decays over time. Eg a 5 of 5 where every year one key less is needed. Does anybody know where to find more information about this?\n\n&#x200B;\n\nThank you!",
            "stickied": false,
            "comments": [
                {
                    "id": "i7qgobg",
                    "author": "opreturn_net",
                    "score": 6,
                    "created_utc": 1651965694.0,
                    "response": "Both scenarios are possible using advanced scripting. I don't think any wallet really supports this functionality at the moment, so you'd have to build the addresses and sign transactions manually or code the software yourself.\n\nIn the first example, you'd want the redeemscript to have a 2 of 2 multisigverify script as well as a 1 of 3 multisig script. It would look something like this:\n\n    OP_2\n    <pubkey1><pubkey2>\n    OP_2\n    OP_CHECKMULTISIGVERIFY\n    OP_1\n    <pubkey3><pubkey4><pubkey5>\n    OP_3\n    OP_CHECKMULTISIG\n\nThe second example would be even more complex, but possible with nested IF/THEN timelock multisigs. It might look like this:\n\n    OP_IF\n    OP_IF\n    OP_IF\n    OP_IF\n    \n    OP_1\n    <5 years> OP_CHECKSEQUENCEVERIFY OP_DROP\n    <pubkey1><pubkey2><pubkey3><pubkey4><pubkey5> OP_5 OP_CHECKMULTISIG\n    \n    OP_ELSE\n    OP_2\n    <4 years> OP_CHECKSEQUENCEVERIFY OP_DROP\n    <pubkey1><pubkey2><pubkey3><pubkey4><pubkey5> OP_5 OP_CHECKMULTISIG\n    OP_ENDIF\n    \n    OP_ELSE\n    OP_3\n    <3 years> OP_CHECKSEQUENCEVERIFY OP_DROP\n    <pubkey1><pubkey2><pubkey3><pubkey4><pubkey5> OP_5 OP_CHECKMULTISIG OP_ENDIF\n    \n    OP_ELSE\n    OP_4\n    <2 years> OP_CHECKSEQUENCEVERIFY OP_DROP\n    <pubkey1><pubkey2><pubkey3><pubkey4><pubkey5> OP_5 OP_CHECKMULTISIG OP_ENDIF\n    \n    OP_ELSE\n    OP_5\n    <1 years> OP_CHECKSEQUENCEVERIFY OP_DROP\n    <pubkey1><pubkey2><pubkey3><pubkey4><pubkey5> OP_5 OP_CHECKMULTISIG\n    OP_ENDIF\n\n\\*Note this script probably needs to be debugged, I'm sure it might need correction. But it's the general idea, where increasing timepoints will use a fewer number of signatures.\n\nTo get started, I would read up on advanced bitcoin scripts: [https://github.com/bitcoinbook/bitcoinbook/blob/develop/ch07.asciidoc](https://github.com/bitcoinbook/bitcoinbook/blob/develop/ch07.asciidoc)",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7qeby9",
                    "author": "bitcoin_barry",
                    "score": 3,
                    "created_utc": 1651964516.0,
                    "response": "1. No, but with script addresses you can do that. Mutlisig is a very specific script, and there are a few variants of multisig, but they all assume N-of-M or M-of-M, and don't discriminate by the keys themselves.\n\n2. Yes, but I don't know of any wallets today that help you do it. This would also be a script address where the script has the decay described within it.\n\nAll of this is possible, but requires a deep understanding of Bitcoin, and/or a willingness to develop, and test the idea. Often, once created, a script like this would end up on one or two wallets until it is considered tested long enough to be safe and suddenly it will be available on many wallets.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}