{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ux47mb",
            "title": "Bitcoin and crypto 'worth nothing'? Move on! BTC aka diamonds and gold are scarce. Only 18 million BTC in total exist. So its and will be even more scarce then gold and diamonds...",
            "url": "https://www.reddit.com/r/Bitcoin/comments/ux47mb/bitcoin_and_crypto_worth_nothing_move_on_btc_aka/",
            "author": "jibberdidee",
            "created_utc": 1653435566.0,
            "score": 6,
            "num_comments": 64,
            "subreddit": "Bitcoin",
            "selftext": "Gold is also worth nothintg 'its just a yellow stone'.\n\nStocks are also worth nothing its just paper.\n\nMoney is also worth nothing. Ok; You can get its value at your local central bank in gold\n\nBut you can also get your BTC value in USDT paid always. So it is worth its price in Dollars.\n\nSo quite stupid  to say crypto is worth nothing!\n\nIts only humans that give gold, money, and crypto 'its worth.'\n\nBut diamonds and gold are rare. And Bitcoin is rare. Only 18 mln (21 mln!)  will exist. They have almost been mined all. So it can or will become more scarce then gold and diamonds.\n\nMoney is printed every day by governments because they can not budget and can not handle money and can not lead a country and do not save money just spend and spend so they cause and create inflation also.\n\nSo money is not scarce if you print it every day..\n\nBut crypto and money need each other and will live together! Money is ok. Governments are ok; it is as good as it gets.\n\nNew things (crypto) arrive because humans want to make things (aka money) and the experience better!\n\nThe Dollar is winning to be the world currency just because of crypto. Because the biggest used stablecoins are in Dollar.\n\nCrypto has a lot of functions. U can pay with it more and more even at te biggest airline this week.\n\nAt a Swiss bank you can deposit and Withdrawl USDT in the news today. And u can use crypto to gain interest on it. And it has use case a lot of times (settlement of fiat) and smart contracts on it. Crypto is creating Defi; independant financials institutions. Since the banks screwed up in 2008 and we the hard working people had to save them. And You can lend it. You can get a loan. It creates so much jobs and website makers, marketing, nwes, advertisments, devs, new financia products , new institutions meetings all over the world festivals, it creatse an immense economic wave and will get bigger.\n\nIn europe each person paid 13000 euro  to save the banks in some countries\n\nMoney at a bank cost money you have to pay your bank and they control your money and you have to pay interest. It is also in fact not your keys not your coins at banks. If a bank fails you get back only 100.000 dollar max.\n\nIn a fully regulated financial market all the banks did not know where they invested in (and those products were even regulated products!!) So the regulated market with regukated products was worth nothing. And we saved them and we were fed up with them.\n\nBut we do not say you are bad and we atre better; we forgive you but will not forget.\n\nWe are only building better things for us ....\n\nCrypto and BTC are here to stay",
            "stickied": false,
            "comments": [
                {
                    "id": "i9vfbvw",
                    "author": "comfyggs",
                    "score": 15,
                    "created_utc": 1653436909.0,
                    "response": "Diamonds are not scarce at all. Complete farce. Bitcoin is more scarce.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9vfzg0",
                            "author": "Ok_Aerie3546",
                            "score": 9,
                            "created_utc": 1653437225.0,
                            "response": "Yeah diamonds are artifically kept scarce by thier suppliers. They wouldnt be expensive if it was a free market.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9xw9h4",
                                    "author": "ericfor4",
                                    "score": 2,
                                    "created_utc": 1653490096.0,
                                    "response": "You are right and it is not the case with Bitcoin or any other cryptocurrency out there.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9z08d8",
                                            "author": "Asum_chum",
                                            "score": 1,
                                            "created_utc": 1653505828.0,
                                            "response": "You are wrong. There are only 21,000,000 bitcoin but there are a gorganzillion shitcoins.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9volxc",
                            "author": "castorfromtheva",
                            "score": 3,
                            "created_utc": 1653441347.0,
                            "response": "BTC is *predictably* scarce. While diamonds and gold are not. Not on earth. And who knows what the next passin f%ckn asteroid is up to drop us, lol? For sure no further BTC, that's crystal clear.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9vpqvy",
                                    "author": "comfyggs",
                                    "score": 2,
                                    "created_utc": 1653441883.0,
                                    "response": "asteroid / planet mining next. BTC is 21m till infinity.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9vu0rj",
                                            "author": "Hectic-Mind",
                                            "score": 1,
                                            "created_utc": 1653443898.0,
                                            "response": "Imagine space x gets to Mars and finds out that it's a gold mine lmao.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia0jhcj",
                                                    "author": "wwwalera",
                                                    "score": 5,
                                                    "created_utc": 1653530231.0,
                                                    "response": "I think that they are planning to do something much bigger than that and they are not going to get anything from the mars at least as of now.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "ia0unc7",
                                            "author": "chujia",
                                            "score": 1,
                                            "created_utc": 1653535655.0,
                                            "response": "I am not sure if anyone is going to do that but yes there are some people who are trying solar mining.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9vqo6g",
                                    "author": "Zealousideal_Leg_630",
                                    "score": 2,
                                    "created_utc": 1653442329.0,
                                    "response": "My left nut is predictably scarce too.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9vqx1r",
                                            "author": "castorfromtheva",
                                            "score": 2,
                                            "created_utc": 1653442446.0,
                                            "response": "There is no (growing) demand for your left nut though. So bon appetite.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia0rzeu",
                                                    "author": "rekboh",
                                                    "score": 1,
                                                    "created_utc": 1653534267.0,
                                                    "response": "That's right and that's why it is important for him to take care of it.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9vvonq",
                                            "author": "Inside_Travel6514",
                                            "score": 1,
                                            "created_utc": 1653444676.0,
                                            "response": "Mine was too but I lost that sucker in a bet. Be careful friend...guard it well.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "ia026c0",
                                            "author": "felixbitslite",
                                            "score": 1,
                                            "created_utc": 1653522155.0,
                                            "response": "I think you will have to make good health to improve the strength of your left nut.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "ia0iikc",
                                    "author": "Rvender13",
                                    "score": 1,
                                    "created_utc": 1653529774.0,
                                    "response": "I think that Bitcoin is self diminishing asset and that's why it is going to get more scare over the period of time.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9zpjun",
                            "author": "shihuiqing",
                            "score": 2,
                            "created_utc": 1653516326.0,
                            "response": "That's right and even there are some Laboratories starting to produce a best quality diamond in the lab.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9zpraw",
                                    "author": "comfyggs",
                                    "score": 1,
                                    "created_utc": 1653516417.0,
                                    "response": "correct. indistinguishable from the genuine article. science and technology caught up.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9vqm8w",
                            "author": "Zealousideal_Leg_630",
                            "score": 1,
                            "created_utc": 1653442303.0,
                            "response": "Except for all the other cryptos here today and gone tomorrow.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9vj0ck",
                    "author": "Keith_Kong",
                    "score": 5,
                    "created_utc": 1653438690.0,
                    "response": "I get you but...\n\n>Gold is also worth nothintg 'its just a yellow stone'.\n\nNo, gold has real utility in computer chips, jewelry, and more. However, there is a HUGE monetary premium on it because of the history of banks using it as their measurement of scarcity for issuing currency. That is no longer the case so as we continue the trend of demonetizing gold it's been difficult for gold to maintain its value against inflation regardless of its actual utility value.\n\n>Money is also worth nothing. Ok; You can get its value at your local central bank in gold\n\nAgain, banks no longer do this. Money (fiat) is not even pretending to be backed by gold anymore. Buy yes it's worthless over time due to the complex debasing of currency taking place with the Federal Reserve and Treasury relationship.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9yz9bu",
                            "author": "bezzobrazer",
                            "score": 1,
                            "created_utc": 1653505434.0,
                            "response": "Things are still in the transformation phase and that's why it is difficult to predict the future of it but the central banking system is surely going to get replaced with something better like cryptocurrency.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9yzlfq",
                                    "author": "Keith_Kong",
                                    "score": 1,
                                    "created_utc": 1653505570.0,
                                    "response": "Agreed, I'm a Bitcoiner through and through.\n\nI was just pointing out some of the factually inaccurate statements in this rant post.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9vj8wn",
                            "author": "jibberdidee",
                            "score": 0,
                            "created_utc": 1653438806.0,
                            "response": "yes gold also has use case and diamonds youre right",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9z4tw3",
                                    "author": "blslb",
                                    "score": 4,
                                    "created_utc": 1653507689.0,
                                    "response": "I think it is only used for ornament purpose and other than that it is not getting the value from any external factor.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9vjgv4",
                                    "author": "Girafferage",
                                    "score": 2,
                                    "created_utc": 1653438910.0,
                                    "response": "Also stocks aren't just paper. They are a part of a company. You benefit for a company doing well by making solid business decisions.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia0qmnj",
                                            "author": "LIAM_WATSON2003",
                                            "score": 1,
                                            "created_utc": 1653533593.0,
                                            "response": "It is just the share in the share of the company and there is nothing more than that so it is not the actual benefit for the holders.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9vd6n6",
                    "author": "bkroot",
                    "score": 8,
                    "created_utc": 1653435891.0,
                    "response": "I’m with you but.. just because something is scarce it’s not automatically worth anything.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9wp618",
                            "author": "MrQ01",
                            "score": 1,
                            "created_utc": 1653462388.0,
                            "response": "If its \"rarity\", then I'd agree. But scarcity (in economic terms certainly) is when supply cannot meet demand, so the value is already implied.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9wqcc2",
                                    "author": "bkroot",
                                    "score": 1,
                                    "created_utc": 1653463368.0,
                                    "response": "You’re right, sorry! Let’s call it rarity than :)",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia0sbyp",
                                            "author": "woaidc",
                                            "score": 1,
                                            "created_utc": 1653534443.0,
                                            "response": "That's right and Bitcoin is a part of that rare thing which is going to get more value over the period of time.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9zur7j",
                                    "author": "Sanyok774",
                                    "score": 1,
                                    "created_utc": 1653518673.0,
                                    "response": "It should also offers some value to the users and then only people will start acquiring it in the more quantity and the law of demand and supply will come into the picture.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9y0yrk",
                            "author": "jcag3",
                            "score": 1,
                            "created_utc": 1653492011.0,
                            "response": "I totally agree but if something is useful like Bitcoin then it becomes valuable because people start investing in it.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9y1hl7",
                                    "author": "bkroot",
                                    "score": 1,
                                    "created_utc": 1653492216.0,
                                    "response": "Is it useful right now? \nIs it user friendly? \nIs it understandable for the wide masses?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9vrkr3",
                            "author": "castorfromtheva",
                            "score": 0,
                            "created_utc": 1653442754.0,
                            "response": "Right. Of course there also has to be demand. At best growing, just like it is with bitcoin.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9vdoid",
                    "author": "solomonsatoshi",
                    "score": 3,
                    "created_utc": 1653436127.0,
                    "response": "All money is but a human construct. But an important one. One that enables trade and exchange more easily across time and space.\n\nBitcoin is the only form of money with a strictly and exactly limited total issuance - the first and only such currency ever. It is the only one native to the internet and free of human controlling interests with vested interest and ability to debase it at the expense of all other users.\n\nFiat currencies are imposed, by force, by nation states and their accomplice/sponsors the bankers and are created via debt obligations over citizens.\n\nUntil Bitcoin there were few alternatives to the state imposed monopoly that is fiat money- now with Bitcoin there is a choice- you will not be compelled to adopt and should only adopt Bitcoin if you wish to...acknowledging there are risks involved since the fiat debt slavery cartel will seek to obstruct your freedom of choice and escape from their very profitable system of fiat debt slavery.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9z6fq9",
                            "author": "valeevvv",
                            "score": 1,
                            "created_utc": 1653508326.0,
                            "response": "Cryptocurrency is giving us more advantages as compared to that of traditional Fiat currency and that's why people are going to use it more in the future.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9vdnq6",
                    "author": "ridiculid",
                    "score": 2,
                    "created_utc": 1653436117.0,
                    "response": "I only have one green shirt in my closet and 5 blue ones, that automatically means someone will pay more for it ?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9vdvb3",
                            "author": "jibberdidee",
                            "score": 0,
                            "created_utc": 1653436216.0,
                            "response": "no because you ca get green shirts everywhere its not scarce",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9vvcym",
                                    "author": "dragonitanair",
                                    "score": 1,
                                    "created_utc": 1653444519.0,
                                    "response": "So does that mean my green shirt that I've peed on it is scarce because no one will ever have one beside me?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9vwp1l",
                                            "author": "jibberdidee",
                                            "score": 1,
                                            "created_utc": 1653445161.0,
                                            "response": "no i guess everyboy can buy a green shirt and pee on it. \n\nmy point was that IMF said (in a show orso) that btc has no value/ crypto. so with that they kinda say money does have value and a stock and gold etc.and btc not.  I pointed out that in fact it all has no value (paper/stone/electronic asset) only we give it value at 'trade markets' . \n\nand besides that a lot of crypto has a lot of other functions like smart contracts / -besides its value -which also makes it special.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9y3cnt",
                                                    "author": "gulevnick",
                                                    "score": 2,
                                                    "created_utc": 1653492962.0,
                                                    "response": "That's right and that's why it is important to have the unique characteristics associated with the product or service and then only people will be willing to pay the more price.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i9vz4e6",
                                                    "author": "dragonitanair",
                                                    "score": 1,
                                                    "created_utc": 1653446302.0,
                                                    "response": ">no i guess everyboy can buy a green shirt and pee on it.\n\nbut no one can have the one with my pee. It's one of a kind.\n\nThe same as bitcoin and millions of other crypto. It's scarce but the value is decided by the people that want to buy it instead of having intrinsic value",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9w03zz",
                                                            "author": "jibberdidee",
                                                            "score": 1,
                                                            "created_utc": 1653446778.0,
                                                            "response": "So in fact were stuck now with -money gold stocks crypto- without any itrinsic value of itself and a green shirt peed on. LoL",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "ia0t3cc",
                                                                    "author": "kevinscheetz",
                                                                    "score": 1,
                                                                    "created_utc": 1653534830.0,
                                                                    "response": "We have seen that anything is possible in Crypto space because some random NFTs have fetched more than millions.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "i9z4ndt",
                                                            "author": "dolfcao",
                                                            "score": 1,
                                                            "created_utc": 1653507617.0,
                                                            "response": "If people are purchasing something then they have the full right to do anything with it.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i9z2zan",
                                            "author": "bitecom79",
                                            "score": 1,
                                            "created_utc": 1653506939.0,
                                            "response": "If you are coming up with something unique then it will be the unique commodity in the world.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "ia0vc1c",
                            "author": "ralph_ka2014",
                            "score": 1,
                            "created_utc": 1653536031.0,
                            "response": "There are some other factors which are also affecting the demand and the price for the supply of it. I don't think that it is going to work in your case.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9vhf1k",
                    "author": "ikkatop",
                    "score": 2,
                    "created_utc": 1653437925.0,
                    "response": "So nobodies going to pull the dude up on the 18 million figure? \n\n21 million max, so I'll have to assume he's discounted the figure due to lost keys and such; but the given figure for that ( bandied about for the last 5 years at least ) is 4 million.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9vhwk5",
                            "author": "jibberdidee",
                            "score": 0,
                            "created_utc": 1653438157.0,
                            "response": "thnx was not aware !",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9vk3lm",
                                    "author": "ikkatop",
                                    "score": 2,
                                    "created_utc": 1653439210.0,
                                    "response": "You didn't know about the 21 million max for BTC ? \nIt's one of the most fundamental basic facts of BTC;  how could got _not_ know?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9vkcbm",
                                            "author": "jibberdidee",
                                            "score": 0,
                                            "created_utc": 1653439321.0,
                                            "response": "I got stuck with my mind in 2018 when the 18 million was mined i guess!",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9vl6ph",
                    "author": "Ok_Economics1981",
                    "score": 1,
                    "created_utc": 1653439722.0,
                    "response": "after 14 years, finally someone detected that bitcoin is trackeable, so your neighbour can know if you are rich or not\n\nthey will ring your house asking for money and you wont be able to say \" i dont have sorry \"\n\nhow dare you satoshi, you didnt think about it?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9vms4s",
                            "author": "BackInTheDay23",
                            "score": 1,
                            "created_utc": 1653440478.0,
                            "response": "How would they know which address is mine?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9vuaz2",
                                    "author": "1025scrap",
                                    "score": 1,
                                    "created_utc": 1653444033.0,
                                    "response": "They wouldn’t if you have your own node.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9vndag",
                    "author": "Expert-Hamster-3146",
                    "score": 1,
                    "created_utc": 1653440752.0,
                    "response": "Fyi diamonds are worthless and gold reserves just keep popping up all over the place",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9vp006",
                            "author": "jibberdidee",
                            "score": 1,
                            "created_utc": 1653441534.0,
                            "response": "haha funny;  its just that regulators should not talk bad about new positive developments where they have failed so far a lot themselves.;better build than critisize\n\nIn history new things always win from the old stuff. Crypto has challenges and can bring a lot of good. they should work along more and think with it and help shape it in a good way\n\nBut i know governments and USA are more crypto friendely now.. and they all wanne get in crypto at nice prices and will",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9vqjcw",
                    "author": "Zealousideal_Leg_630",
                    "score": 1,
                    "created_utc": 1653442263.0,
                    "response": "The difference is you can create as many types of crypto as you can imagine. How about Bitcoin 2.0? Sure, you can do that. And what about gold 2.0? Nope. Can't do it. Same can't be said for gold and diamonds.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9vqqm7",
                    "author": "Zealousideal_Leg_630",
                    "score": 1,
                    "created_utc": 1653442362.0,
                    "response": "Anyone here want an NFT of my left nut? It's scarce, just like bitcoin.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9vrpnw",
                    "author": "bri8985",
                    "score": 1,
                    "created_utc": 1653442819.0,
                    "response": "I painted a water color and it’s scarce because I’m not going to do another like it. It’s therefore more scarce than BTC. \n\nSee how the scarcity argument doesn’t work?\n\nAlso don’t go around saying gold and stocks aren’t worth anything because it makes everyone else just completely discount the rest of what you are saying. One has a lot of utility and thousands of years as a good store of value and the other represents ownership of a company which has revenues and assets. \n\nAlso units of BTC have nothing to do with units of gold.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9vzqa0",
                            "author": "solomonsatoshi",
                            "score": 1,
                            "created_utc": 1653446593.0,
                            "response": "Your watercolour is not easily divisible, transmissible or accepted widely.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9xg229",
                    "author": "NYKNYb",
                    "score": 1,
                    "created_utc": 1653482748.0,
                    "response": "\"Stocks are also worth nothing its just paper.\"\r  \n\r  \nYou've got that part right.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9y8rsh",
                    "author": "Informal_Fishing5729",
                    "score": 1,
                    "created_utc": 1653495088.0,
                    "response": "Nice one, now go and convince the markets",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9yfxsd",
                    "author": "Electronic_Range_982",
                    "score": 1,
                    "created_utc": 1653497870.0,
                    "response": "Bitcoin is only as good as the electronic wallet that carries it. One major power outage and you're done",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}