{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uyqroj",
            "title": "Binance Web Wallet Hacked",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/uyqroj/binance_web_wallet_hacked/",
            "author": "Gopi_2209",
            "created_utc": 1653628366.0,
            "score": 0,
            "num_comments": 20,
            "subreddit": "BitcoinBeginners",
            "selftext": "I lost my 70$ from the Binance wallet which was transferred to another address.  \nIs that lost forever, can't I do anything?   \n\n\nIs this the harsh truth of cryptos?",
            "stickied": false,
            "comments": [
                {
                    "id": "ia6osq1",
                    "author": "olliecampbell",
                    "score": 3,
                    "created_utc": 1653654551.0,
                    "response": "So that we can learn, do you know how it was done?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia5r00a",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653628366.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia5r016",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653628367.0,
                    "response": "For trading related topics, there is also /r/bitcointrading\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia5r01h",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653628367.0,
                    "response": "FYI Binance withdrawal fees are very high for BTC, our FAQ has a list of suggested exchanges, with their corresponding withdrawal fees. https://www.reddit.com/r/BitcoinBeginners/comments/g42ijd/faq_for_beginners/\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia5rb39",
                    "author": "BTCMachineElf",
                    "score": 1,
                    "created_utc": 1653628584.0,
                    "response": "Be thankful it was only $70, and in the future protect your bitcoin by using a bitcoin-only open source phone wallet like Blockstream Green or Blue Wallet (phones are safer than PCs), or better yet buy a hardware wallet (Trezor or Coldcard).\n\nAnd just stick to bitcoin. The more you mess around with defi bs, the more likely this stuff is to happen.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia66nq0",
                            "author": "Gopi_2209",
                            "score": 1,
                            "created_utc": 1653640949.0,
                            "response": "Yeah, I was about to invest more in the dip, but now first trezor. Lesson learned for lifetime.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "ia5z137",
                    "author": "CoinCorner_Sam",
                    "score": 1,
                    "created_utc": 1653634263.0,
                    "response": "Bitcoin transactions are irreversible. Once sent, the coin is gone. Some scammers, sending you DMs, might try to convince you otherwise, hoping you'll send them some money. **Ignore them**. If there's a way, somebody will mention it here, in the open.\n\nFor the future, install an open source, non custodial Bitcoin wallet on your phone, write down the backup seed words and never use a web wallet again, please. Typing the seed words or any kind of password on a device, connected to the internet, is probably the reason why your coin is gone. BlueWallet or Muun are easy to use and I have personally used them both without any issue.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia62mcp",
                    "author": "bitusher",
                    "score": 1,
                    "created_utc": 1653637339.0,
                    "response": "Binance should be avoided for these reasons –\n\n1)\tThey have an absurd withdraw fee of 0.0005 BTC where other exchanges have free withdrawals\n\n2) They try and trick/scam users into selling their btc for a coupon token they control with confusing withdrawal options\n\n3) They are being sued right now for fraudulent activity and illegal securities and market manipulation and might become another MtGox\n\n4) Their original site binance.com allowed for little to no verification upfront but they have been and continue to freeze accounts after the fact which is very dishonest behavior\n\n5) Their partner site binance.us has low liquidity compared to the original site but if you are in the USA that's all you can use. The CEO of that site just stepped down\n\n6) many  banks have stopped transfers to them in the UK and other countries due to fraud investigations\n\n7) They are fighting multiple class action lawsuits due to their fraud and illegal securities\nSome examples -\nhttps://www.rosenlegal.com/cases-1839.html\nhttps://www.scribd.com/document/455203877/Lee-et-al-vs-Binance\n\n8) They are mostly dependent into the tether ponzi scheme that will likely implode in the future. Binance, other than tether, holds the biggest USDT reserves thus making it the primary exchange effected when this Ponzi implodes and stopping most of its incoming liquidity. Tether and other stable coins will be increasingly targeted by regulators due to concerns of money laundering and capital flight.\n\n9)\tThey are mostly used to trade shitcoins but with supporting so many sketchy projects that increases ones attack surface from a technical layer because any bug or exploit can lead to loss of funds\n\n10) Binance “smart chain” is run exclusively on their own personal servers thus when the company goes defunct or arrests are made these may stop functioning and all tokens and wallets they control (trust) will have problems \n\n\n\n11) Binance is known to use their leverage tokens and trade against their clients and manipulate the market for their personal gain \n\n\n12) Binance operates without a proper license in multiple countries, more and more news is coming out about regulators in those countries specifically saying that Binance is operating illegally. This means it's easy for governments can make Binance Insolvent placing my funds at risk. Binance is not officially registered in any country and does not pay taxes making them a target for regulators.\n\n\n https://twitter.com/franciskim_co/status/1423658703174082567\nFurther reading on new risks and regulatory concerns -\nhttps://www.reddit.com/r/BitcoinBeginners/comments/p12oz0/best_way_to_dca/h8anlfq/\n\n13) They openly lie about their wallet being open source - https://trustwallet.com/developer/ when it is not open source\n\nhttps://walletscrutiny.com/android/com.wallet.crypto.trustapp/\n\nhttps://walletscrutiny.com/iphone/com.sixdays.trust/\n\nas you cannot test and build the binaries from source. The lie is built upon the ignorance of many that are unaware that almost all software you use is dependent upon some open source repositories/libraries/dependencies but unless we can peer review 100% of the source code and build the binaries from the source we cannot verify if any intentional or unintentional exploits or backdoors exist in the software.\n\nThis means that at best you have a wallet that is slightly better than using a custodian because you have access to the private keys that you could restore your coins in a separate wallet if their full nodes that support this light client is offline but there might be privacy leaks or exploits and backdoors that allow them or outsiders to steal your coins.\n\nWhat is the point in using cryptocurrency if you ultimately need to have faith in a single company or developer ? This undermines many of the security assumptions of cryptocurrencies.\n\n14) Incompetence by leaving 1 billion dollars worth of unconfirmed transactions for more than a year causing huge loses and frozen accounts\n\nhttps://www.coindesk.com/business/2021/11/12/binance-freezes-doge-withdrawals-as-users-report-being-asked-to-return-coins-they-dont-have/\n\nhttps://www.binance.com/en/support/announcement/7602e2790f3c444d8d6ed47d6954bcef",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia668mh",
                    "author": "Natalialam",
                    "score": 1,
                    "created_utc": 1653640571.0,
                    "response": "wow",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia7ygr6",
                    "author": "igadjeed",
                    "score": 1,
                    "created_utc": 1653674469.0,
                    "response": "Binance does not have a Web wallet  \nAn exchange account is not a wallet\n\n> can't I do anything?\n\nContact Binance",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "iaciw61",
                    "author": "ColdFusion3456",
                    "score": 1,
                    "created_utc": 1653767415.0,
                    "response": "If you still need someone to trace the funds send me the public addresses for the wallet I can take a look at it for free pro bono. I know it's been awhile though.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}