{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uremq7",
            "title": "Question about deflation and stacking Sats. Honest feedback about a shower thought.",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/uremq7/question_about_deflation_and_stacking_sats_honest/",
            "author": "AmbitiousBuck",
            "created_utc": 1652762540.0,
            "score": 5,
            "num_comments": 16,
            "subreddit": "BitcoinBeginners",
            "selftext": "So I love Bitcoin. I believe in Bitcoin. I have a percentage of my portfolio in Bitcoin. I continue to DCA and stack my sats. \n\nI’m having trouble phrasing this so bear with me. \n\nIf we always want to have as much Bitcoin as possible, doesn’t that discourage us to use/spend/sell our Bitcoin? \n\nWe will always want to hold onto the scarce item. As it increases in value due in part to the scarcity.\n\nHelp me understand, I can’t see us using Bitcoin as a reserve currency in the future. Owners will never want to spend the Bitcoin that will increase in value. We will hoard it.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8wtzxn",
                    "author": "MuchTemperature6776",
                    "score": 3,
                    "created_utc": 1652763546.0,
                    "response": "As it becomes more adopted and the more halvings it goes through, the less volatile it becomes even tho the worth will increase a lot.\n\nHowever it’ll still increase in value as it becomes more scarce.\n\nThat is no different than how it used to be when fiat money was backed by gold however.\n\nWhen you’re buying something you don’t worry about whether you should wait a week because your money might be worth more or the item might be worth less. You’ll make the purchase regardless.\n\nIt’s a very long and slow process and most likely won’t happen for a couple decades, that’s why you should hodl, because sometime in the future or at the very least your off springs future it might not be as volatile anymore and will resemble a much more stable asset or at the given time currency.\n\nRemember Bitcoin is still very young, as we’re only in the third of like 30 halvings.\n\nIf you look at the history of gold then it has been just as volatile as Bitcoin is now. However gold is fairly stable now that it has become really scarce.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8wy1ui",
                            "author": "AmbitiousBuck",
                            "score": 2,
                            "created_utc": 1652766438.0,
                            "response": "Thank you for answering the question. I appreciate the response. \n\nI think I’m just skipping or missing steps. How does the few (holders of bitcoin) large quantities of bitcoin get dispersed to the late people the billions of people who need to get bitcoin in the event it is a reserve currency. What ever capacity of the ~21 billion.\n\nMaybe there are things I still need to understand about a creation of a currency transforming to a reserve currency. Sorry for any incompetence.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8x0dou",
                                    "author": "MuchTemperature6776",
                                    "score": 5,
                                    "created_utc": 1652768238.0,
                                    "response": "Because Bitcoin has enough decimals that even if 1 btc was worth 1 billion then you could still buy a cup of coffee with sats.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8y31w6",
                                            "author": "comfyggs",
                                            "score": 1,
                                            "created_utc": 1652795846.0,
                                            "response": "That’d mean 1 Sat = $10. Cup of coffee probably 2-3 sats per cup by then.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8y43eh",
                                                    "author": "MuchTemperature6776",
                                                    "score": 2,
                                                    "created_utc": 1652796314.0,
                                                    "response": "Already some places here that sells coffee for that price.\n\nTotally insane.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8y6iss",
                                                            "author": "comfyggs",
                                                            "score": 1,
                                                            "created_utc": 1652797368.0,
                                                            "response": "That’s expensive coffee! What’s even crazier is, 10,000 sats ($3.07 at todays prices) would be worth $100,000 at those numbers. Maybe by 2049.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8wshuu",
                    "author": "AutoModerator",
                    "score": 2,
                    "created_utc": 1652762541.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8wvpsp",
                    "author": "SaggeeDot",
                    "score": 2,
                    "created_utc": 1652764731.0,
                    "response": "I never have and never will sell BTC",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8xevgv",
                            "author": "BTCMachineElf",
                            "score": 5,
                            "created_utc": 1652781129.0,
                            "response": "So you plan on taking your private keys with you when you die? The btc community thanks you for your donation.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8xepik",
                    "author": "BTCMachineElf",
                    "score": 1,
                    "created_utc": 1652780987.0,
                    "response": "Once you start thinking along these lines, the ultimate conclusion is, why keep any fiat at all? \n\nSpend and replace or put some of your fiat spending money in btc and spend it as it goes up.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8za75p",
                    "author": "Donkeydonkeydonk",
                    "score": 1,
                    "created_utc": 1652813627.0,
                    "response": ">discourage us to use/spend/sell our Bitcoin? \n\nNo because shit happens.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8zva5u",
                    "author": "igadjeed",
                    "score": 1,
                    "created_utc": 1652822360.0,
                    "response": "There are very few real hoarders, and the supply of Bitcoin is huge, more than enough that being \"deflationary\" is irrelevant. Bitcoin scarcity is a myth\n\n> can’t see us using Bitcoin as a reserve currency\n\nThat's true, because of more fundamental limitations in Bitcoin's design, not because of coin liquidity",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ures4g",
            "title": "Is cashapp a good place to buy bitcoin and do my business on or should I look into a wallet?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/ures4g/is_cashapp_a_good_place_to_buy_bitcoin_and_do_my/",
            "author": "Thesupersaiyanz",
            "created_utc": 1652763135.0,
            "score": 4,
            "num_comments": 15,
            "subreddit": "BitcoinBeginners",
            "selftext": "Comment below. I’m still new to bitcoin and don’t understand how or what I’m doing but I’m very interested",
            "stickied": false,
            "comments": [
                {
                    "id": "i8wtunv",
                    "author": "Silverping",
                    "score": 4,
                    "created_utc": 1652763447.0,
                    "response": "Cashapp is a good place to start buying... Once you get more educated you can move it later to wallet.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8wv1ej",
                            "author": "Thesupersaiyanz",
                            "score": 1,
                            "created_utc": 1652764254.0,
                            "response": "I downloaded coinbase but I’m not setting it up until I understand hot wallets a bit more.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8xcm9h",
                                    "author": "MuchTemperature6776",
                                    "score": 2,
                                    "created_utc": 1652779098.0,
                                    "response": "Hot means it’s stored with someone else, cold means it’s stored with yourself (usually offline.) and then there’s the hybrid type like Muun which is like a mix between the two.\n\nPros of cold wallets is security, cons is inconvenience.\nPros of hot wallets is convenience, cons is security.\n\nHybrid wallets gives a little bit of both and generally has enough security that you don’t really need a cold wallet as long as you’re security oriented yourself.\n\nIt might still be a good idea to invest in a cold wallet that you can use for long term storage, but having a hybrid wallet at the same time for the convenience of coins that you might not just store long term (ex. if you buy things online etc.)\n\nIt’s a fairly easy concept to grasp.\n\nHow I use it all is that I basically buy coins on an exchange and then immediately sends them to my wallet. It’s a very easy process and takes no time and it’s really convenient with ex. Coinbase. It’s like five clicks and you just copy the wallet address from your wallet and paste it when you’re sending. It’s just as easy as doing a bank transfer, might even be easier when comparing international transfers.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8wv79r",
                    "author": "BTCMachineElf",
                    "score": 3,
                    "created_utc": 1652764368.0,
                    "response": "Use cashapp as a fiat on/offramp. Withdraw and do bitcoin transactions from a wallet.\n\nFor a few thousand $, an open source phone wallet is fine (blockstream green, bluewallet). More than that, buy a coldcard.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8wvky5",
                            "author": "Thesupersaiyanz",
                            "score": 1,
                            "created_utc": 1652764636.0,
                            "response": "When you say use it as a on/off ramp what do you mean?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8wvqta",
                                    "author": "BTCMachineElf",
                                    "score": 3,
                                    "created_utc": 1652764750.0,
                                    "response": "Just for exchanging fiat (government money) for bitcoin and vise versa, as the need arises.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8y1tnl",
                    "author": "never-give-up-every1",
                    "score": 2,
                    "created_utc": 1652795288.0,
                    "response": "Use Netcoin, it also has reading material for you to learn more about crypto.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ynbck",
                    "author": "azraelle_178",
                    "score": 2,
                    "created_utc": 1652804395.0,
                    "response": "Haven't tried cashapp before but I do buy btc on Netcoins. It's much easier there and has fair fees. You won't spend too much on the fees once you buy, sell or trade big amounts. You should try it though.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8wtea0",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1652763135.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8x0edn",
                    "author": "Lost-Explorer",
                    "score": 1,
                    "created_utc": 1652768253.0,
                    "response": "I’ve used cashapp for a few years since it is one of the few places I can purchase BTC in Hawaii. Fees can be lower elsewhere if you have options but it is as simple as it gets and very convenient. When the amount of BTC I have in cashapp reaches a decent size I transfer to cold storage",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}