{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uwufjg",
            "title": "Why is there a GBTC premium?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/uwufjg/why_is_there_a_gbtc_premium/",
            "author": "PeleMaradona",
            "created_utc": 1653408707.0,
            "score": 5,
            "num_comments": 12,
            "subreddit": "BitcoinBeginners",
            "selftext": "I understand that the GBTC premium refers to the difference in value of the assets held by the trust against the market price of those holdings.\n\nBy if GBTC holds bitcoin, then is there a difference in value between the assets the hold and the market price of their holdings?",
            "stickied": false,
            "comments": [
                {
                    "id": "i9toxzv",
                    "author": "OpticallyMosache",
                    "score": 5,
                    "created_utc": 1653410018.0,
                    "response": "An investor is buying GBTC as shares of a Trust that is holding BTC. The market cap of the Trust is different than the market cap of the BTC it owns. You're not buying a 1:1 stake of the BTC. So when the demand for shares decreases and GBTC doesn't sell the equivalent BTC out of the Trust, there is a disparity. Currently the disparity represents a discount. The BTC equivalent of the shares you own is higher. So you're getting more exposure to BTC for less.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9tr8t6",
                            "author": "PeleMaradona",
                            "score": 2,
                            "created_utc": 1653410951.0,
                            "response": "> So when the demand for shares decreases and GBTC doesn't sell the equivalent BTC out of the Trust, there is a disparity.\n\nThanks for the reply . A few questions:\n\n1. Why is the market cap of the Trust different than the market cap of the BTC it owns?\n2. Why would GBTC  sell BTC when the demand for GBTC shares decreases?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9tt5cs",
                                    "author": "OpticallyMosache",
                                    "score": 1,
                                    "created_utc": 1653411730.0,
                                    "response": "The shares don't represent an allocation of the total BTC in the trust. It's more like buying shares of a company's stock. The market is pricing the value rather than BTC pricing the value.\n\nGBTC sells and buys BTC based on the demand. They have tried to minimize the amount of the discount and premium in the past. They want each share to be closer to the equal amount of BTC.\n\nIt's a good time to buy when there's a big discount.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9vwsg4",
                                            "author": "sos755",
                                            "score": 1,
                                            "created_utc": 1653445205.0,
                                            "response": "> GBTC sells and buys BTC based on the demand. They have tried to minimize the amount of the discount and premium in the past. \n\nThat is wrong. GBTC cannot trade the BTC held by the trust. They can only issue shares for BTC deposited into the trust.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i9vw4dk",
                                    "author": "sos755",
                                    "score": 1,
                                    "created_utc": 1653444884.0,
                                    "response": ">Why is the market cap of the Trust different than the market cap of the BTC it owns?\n\nThe value of the shares depends supply and demand of the shares and is the result of trading in the market. The value of the BTC held by the trust is just the value of the BTC held by the trust.\n\n&#x200B;\n\n>Why would GBTC sell BTC when the demand for GBTC shares decreases?\n\nGBTC cannot trade the BTC held by the trust. They can only issue shares for BTC deposited into the trust.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9trtg0",
                            "author": "Redline65",
                            "score": 2,
                            "created_utc": 1653411186.0,
                            "response": "Where can you find the discount (or premium)? It seems like when I bought into GBTC and bitcoin was around 30K I was paying $29/share. Now bitcoin is around 30K and it's \\~$19/share. It's absolutely terrible what's happened to it. I guess I bought in when there was a heavy premium.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9v0b4b",
                                    "author": "Shadowsfury",
                                    "score": 1,
                                    "created_utc": 1653429954.0,
                                    "response": "More like the discount has gotten worse\n\nI've been tossing and turning on whether to buy in myself and hope for the discount to disappear",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i9vb5xy",
                                    "author": "LunaGuardian",
                                    "score": 1,
                                    "created_utc": 1653434946.0,
                                    "response": "There's some [sites](https://ycharts.com/companies/GBTC/discount_or_premium_to_nav) that show charts for GBTC premium/discount to NAV. I calculate it myself in excel, where Grayscale has the current [BTC per share on their site](https://grayscale.com/products/grayscale-bitcoin-trust/) (which gradually goes down 2% per year for their management fee) \n\n((GBTC price / BTC per share) minus BTC price ) / BTC price. \n\nCurrently at a 32% discount.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9umhfc",
                    "author": "jmg000",
                    "score": 2,
                    "created_utc": 1653423991.0,
                    "response": "It’s at a discount.  GBTC hasn’t been at a premium for over a year.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9tlpji",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653408707.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9vsecu",
                    "author": "desiderata_minter",
                    "score": 1,
                    "created_utc": 1653443135.0,
                    "response": "If you like BTC now, you'd be a fool to buy anything OTHER than GBTC, unless you're trying to dodge the IRS, in which case GBTC is the exact wrong way to play it. Other reasons to dislike GBTC include distrust of the trust documentation and hacking potential (similar to what exists for metals ETFs).",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9vumm8",
                    "author": "sos755",
                    "score": 1,
                    "created_utc": 1653444182.0,
                    "response": "TL;DR: **GBTC has a one-way peg with BTC. This one-way peg makes it difficult to maintain a premium, but easy to maintain a discount.**\n\nThe peg works like this:\n\nOther than trading shares in the market, investors can also obtain shares directly by depositing bitcoins into the trust. This becomes an arbitrage opportunity when there is a premium. An investor can deposit bitcoins to obtain newly issued shares and then turn around and sell the shares for a premium.\n\nFor example, if the price of a bitcoin is $30k and the share premium is 10%, then an investor could deposit 1 BTC and receive shares in the trust that are worth $33k (because of the premium). The shares can be sold and the money used to buy 1.1 BTC.\n\nNote that the increasing supply of shares due to new shares being issued causes the premium to fall.\n\nNow, here is the important point -- the shares of the trust cannot be redeemed for the bitcoins in the trust. It is a one-way peg.\n\nIf the shares could be redeemed for bitcoins, then an investor could buy shares at a discount and redeem them for the full amount of bitcoins.\n\nFor example, if the price of a bitcoin is $30k and the share discount is 30%, and shares could be redeemed, then an investor could buy $21k worth of shares and redeem them for BTC worth $30k (because of the discount).\n\nThe reduced supply of shares due to the redemption would cause the discount to fall. However, because this redemption is not possible, the discount remains.\n\nTurning GBTC into an ETF would allow a two-way peg that would keep the premium or discount close to 0.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}