{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uusqt6",
            "title": "Daily 207% inflation. At least my country was first at something",
            "url": "https://i.redd.it/1qzwxvubev091.png",
            "author": "Roal101",
            "created_utc": 1653156927.0,
            "score": 1,
            "num_comments": 0,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uust4m",
            "title": "Some Proposals By Saylor & Saifedean are Worrying",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uust4m/some_proposals_by_saylor_saifedean_are_worrying/",
            "author": "samdane7777",
            "created_utc": 1653157118.0,
            "score": 0,
            "num_comments": 12,
            "subreddit": "Bitcoin",
            "selftext": "We need to talk about the future of smart contracts and apps, dapps so forth with Bitcoin.\n\nThis is not 2017, technology is rapidly changing. The ability to do things with agnostic zk rollups and layer 3 solutions is going to allow a lot of things to be done with lightning channels. The most advanced on the cusp things are by far using lightning and final settlements via bitcoin\n\nThis would allow bitcoin to be used as a global encryption utility to give finality to say the existence of a social media account, someones speech, someone's writing, political opinions, their art and expression and so forth. Mind you, this is not easy or here yet with bitcoin, this is the most advanced stuff firmly in the realm of Clairo, Clarity, Rust programming, Zk Rollups and so forth. To do this with only bitcoin is not simple or easy. Historically everything was focused around making a new \\[redacted\\] and being robbed by Venture capital. No ecosystem interchangiability, no fungibility, no composability, just endless scams.\n\nThat gets us to Saylor and Saifedean and their political positions, and US Financial Laws.\n\nHow are you going to protect the speech, expression, writing, and social media of 168 countries, and 8 billion people \\*from their own government\\* much less our government the absolute imperialist monetary  colonialism financial regulations of US Law.\n\nThere is only one way to do that, and it is highly composable client side software that\n\n1) uses Bitcoin to settle and prove finality, to pay for global omniprescent storage. If someone's writing and posts exist on one server or one computer, some nation state will censor or seize it.\n\n2) Is fully anonymous to prevent state persecution\n\n3) Uses bitcoin to prevent duplication, fraud, plagiarism, and impersonation, the finality of identity, similar to a public PGP signature.\n\nWhile what I mentioned may sound totally sane and intuitive, the fully anonymous part is what G20 states, Fatf, and US Law and EU Law are hyper hostile towards and are fighting tooth and nail. I cannot begin to explain to you how hard they are working behind the scenes to prevent this, to censor the entire internet, with the EU now proposing a law to do CLIENT SIDE scanning of all posts and speech. Truly an Orwellian totalitarian state.\n\nSo this brings me to this point. \n\nIf Saylor and Saifedean are aiding and abetting the SEC out of political spite, and cooperating with US Financial Surveillance laws and ultimately promoting and defending EU and US and even other G20 States,\n\n**\\******How are you going to protect the speech and expression of 8 billion people,*** **if these so called bitcoin thought heros promote KYC compliance on every single company or development team, how can you create an ecosystem culture that defends the human race from state political persecution if you enable a culture of defending the SEC, CFTC, FSOC, DOJ, DHS, and other US and EU financial regulators?\\***",
            "stickied": false,
            "comments": [
                {
                    "id": "i9h8bq2",
                    "author": "BITCOIN_FLIGHT_CLUB",
                    "score": 8,
                    "created_utc": 1653158436.0,
                    "response": "Lol. Bitcoin is fine just the way it is. \n\nIt doesn’t need any “new” features.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9hau7p",
                    "author": "NiceDoctorBeam",
                    "score": 5,
                    "created_utc": 1653159660.0,
                    "response": "I would rather have my money do one thing, but do it better than any other money.  \n\nKYC only applies to fiat currencies.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9habi9",
                    "author": "caploves1019",
                    "score": 4,
                    "created_utc": 1653159409.0,
                    "response": "Saidedean laid out the need for the lightningnetwork in the Bitcoin Standard pretty well 5yrs ago and reiterated in the Fiat Standard more recently. Not sure what you're so bent out about?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9i0b86",
                    "author": "hosseamin",
                    "score": 2,
                    "created_utc": 1653172474.0,
                    "response": "> *****How are you going to protect the speech and expression of 8 billion people, if these so called bitcoin thought heros promote KYC compliance on every single company or development team, how can you create an ecosystem culture that defends the human race from state political persecution if you enable a culture of defending the SEC, CFTC, FSOC, DOJ, DHS, and other US and EU financial regulators?*\n\nThey won't. Saylor is begging for protection from the SEC. Saifedean is for monarchy. Bitcoin (BTC) in 2022 is not comparable to bitcoin pre 2017.\nAll they care about is number go up.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9ktkd8",
                            "author": "samdane7777",
                            "score": 1,
                            "created_utc": 1653236303.0,
                            "response": "this guy gets it",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9hmw33",
                    "author": "wkw3",
                    "score": 1,
                    "created_utc": 1653165602.0,
                    "response": "This post is all over the place. What does Bitcoin have to do with \"smart\" contracts or venture capital's \"web3\"? What does EU surveillance have to do with KYC? WTF does Rust programming have to do with Bitcoin at all?\n\nBitcoin does what it set it to do perfectly well. I do wish that the payjoin BIP was implemented, but I understand the hesitancy. You may not like it, but the government has the authority to regulate exchanges and always has.\n\nBitcoin was never designed to be an encrypted, uncensorable web platform and I'm not sure why you think it should.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9japh8",
                            "author": "Aromatic-Teach-1266",
                            "score": 1,
                            "created_utc": 1653200065.0,
                            "response": "I truly don’t think that there will be any payjoin BIP implementation until the day we ha an robust functioning totally decentralized exchange. Do you think that is possible?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9ks35w",
                                    "author": "po00on",
                                    "score": 1,
                                    "created_utc": 1653235658.0,
                                    "response": ">I truly don’t think that there will be any payjoin BIP implementation until the day we ha an robust functioning totally decentralized exchange\n\nWhy do you think that ?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9h8419",
                    "author": "igadjeed",
                    "score": 0,
                    "created_utc": 1653158334.0,
                    "response": "> Uses bitcoin to prevent duplication, fraud, plagiarism, and impersonation, the finality of identity\n\nBitcoin is an on-line payment system. Those other things are ridiculous fantasies",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9hbh1c",
                            "author": "caploves1019",
                            "score": 0,
                            "created_utc": 1653159961.0,
                            "response": "Except fraud when it comes to printing fraudulent fake currency. No fake bitcoins mingling within the BTC in circulation.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9h9i7o",
                    "author": "solomonsatoshi",
                    "score": 1,
                    "created_utc": 1653159010.0,
                    "response": "Are you proposing to abandon all government oversight of financial transactions?\n\nI would settle, for now at least, with the option to adopt a monetary system free of state-banker issuance and as much as possible, sanction... ie Bitcoin.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9knql8",
                    "author": "po00on",
                    "score": 1,
                    "created_utc": 1653233782.0,
                    "response": "Safedean doesn't promote KYC.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}