{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uxjale",
            "title": "bitcoin bearish prediction to 20k",
            "url": "https://i.redd.it/5tsv2erlzm191.png",
            "author": "Kostasmag",
            "created_utc": 1653490850.0,
            "score": 1,
            "num_comments": 0,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uxj3nf",
            "title": "Staking BTC?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uxj3nf/staking_btc/",
            "author": "Dawg_Thats_Crazy",
            "created_utc": 1653490299.0,
            "score": 0,
            "num_comments": 21,
            "subreddit": "Bitcoin",
            "selftext": "“Not your keys, not your coin”.\nI know that part, but at the same time I would love to keep staking more, is there a reliable way you guys keep staking BTC with some sort of earn?",
            "stickied": false,
            "comments": [
                {
                    "id": "i9y3lea",
                    "author": "NiceDoctorBeam",
                    "score": 5,
                    "created_utc": 1653493058.0,
                    "response": "Fools and their money are soon parted.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9xy89a",
                    "author": "cookmanager",
                    "score": 3,
                    "created_utc": 1653490895.0,
                    "response": "Why not invest your btc in a profitable venture that runs on btc, rather than lending your bitcoin to borrowers who will short sell it into the market driving the value of your btc downward?  Or worst case, hold on to your bitcoin and use it for necessities.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9y0lpn",
                    "author": "caploves1019",
                    "score": 3,
                    "created_utc": 1653491865.0,
                    "response": "The entire premise of the question revolves around a failed fiat system. Banks know they can make more money off more money. They charge 20% on loans while providing you 0.02% interest for letting them leverage your money for those loans. When they fail to invest properly, they default but instead of collapsing, the central government bails them out.\n\nAll related to money printer go brrrrrrr.\n\nIf money printer stopped printing, they would have to be more responsible with your money. So as it should be, you work, you get paid, your labor holds its value, you buy things you need/want but your savings is protected. Unfortunately with fiat that's not the case. Your labor is worth less every minute that passes after you get paid. So banks pay you a sliver of a portion they're baking off debt to others to incentivise you not to immediately spend your inflating garbage currency. Bitcoin fixes this. You can literally just set it and forget and watch while everything else gets more expensive yet Bitcoin buying power offsets those other expenses over time.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9y1yfx",
                    "author": "MrQ01",
                    "score": 3,
                    "created_utc": 1653492407.0,
                    "response": ">is there a **reliable** way you guys keep staking BTC with some sort of earn?\n\nYou're not staking Bitcoin. You're lending Bitcoin, and usually for lent-out cryptocurrencies aren't insured - you're not lending for \"reliability\" because of the risk you are incurring from losing your Bitcoin.\n\nRather than directly mentioning services, I'd advise you to look through the market so that you get a good idea of the average APY, and then make a decision. But again by lending out your BTC, you should accept the fact that you could lose that Bitcoin",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9y17bj",
                    "author": "Tiggsweld",
                    "score": 2,
                    "created_utc": 1653492103.0,
                    "response": "You guys need to know that when you \"stake\" for a % APY , those coins are lent out and Bitcoin is shorted.  This is how Bitcoin is shorted.  It is the absolute worst thing you can do.  \n\nThis is how BTC has fallen for all these weeks.  It's not like institutions are slowly selling their stack off.  They borrow from \"lending\" platforms like Blockfi, nexo, Celsius etc etc and short the market.   So your losing much much more than you are gaining with the shitty APY.\n\nThe whole \"not your keys thing\" is secondary .",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9y2p0o",
                            "author": "laziruss",
                            "score": 1,
                            "created_utc": 1653492703.0,
                            "response": "Actually did not know that’s how lending out BTC works but now that I’ve read it, it makes total sense",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9y5zmi",
                                    "author": "Tiggsweld",
                                    "score": 3,
                                    "created_utc": 1653493999.0,
                                    "response": "Exactly, there really is no other reason to \"borrow\" Bitcoin.  But they word it to retail customers as a \"lending platform\".  So people fall right into it hoping to gain a little extra.  This is exactly why Bitcoin has been held down so long.  Could you imagine the price if it couldn't be shorted ?  If it was only a buy and sell option ? When they short , they short big.  They borrow in bulk.   This is why you see those crazy instant drops out of nowhere.  They see that there isn't much in the order book, or \"buying pressure\", then sell tons of coins all at once. \n\nPlease spread the word.  Those APY paying platforms do not have our best interest , they bank on the fees ,  obviously don't give a shit a out the price.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9yasag",
                    "author": "blkFTMbottompig",
                    "score": 2,
                    "created_utc": 1653495873.0,
                    "response": "With everything happening I removed my bitcoin over 5k worth from Celsius even though I was grandfathered into rewards.\n\nThe best way I passively stack BTC is through my CB card. I’ve made $350 in free BTC and I’ve only had it for 4 months.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9xz0lc",
                    "author": "extrastone",
                    "score": 4,
                    "created_utc": 1653491217.0,
                    "response": "Let's talk about credit risk.  Whenever you stake (it used to be called lend) your coins, you need to be sure that whoever is using your coins is going to send them back to you at the prescribed time.  Often, they may not.\n\nNow let's actually think about why we hold bitcoin.  It's not because the number goes up.  It's because everything else is so terrible.  When the number really starts going up, it will be a sign that everything else has become atrociously terrible.  At that time I don't think your borrower is going to be so kind as to return your coins before he goes bankrupt.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9y4yn9",
                    "author": "slvbtc",
                    "score": 1,
                    "created_utc": 1653493595.0,
                    "response": "Try something called UST they have a risk free 20% yield.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9y6awz",
                            "author": "Tiggsweld",
                            "score": 1,
                            "created_utc": 1653494123.0,
                            "response": "USDD is was paying 60% and also paying 30% risk free.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9ykdhg",
                    "author": "WaYYne169",
                    "score": 1,
                    "created_utc": 1653499590.0,
                    "response": "You can run a lightning node and earn some sats for routing",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ywbgw",
                    "author": "Boodsie",
                    "score": 1,
                    "created_utc": 1653504270.0,
                    "response": "how did you find bitcoin",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9yy53o",
                    "author": "SmoothGoing",
                    "score": 1,
                    "created_utc": 1653504988.0,
                    "response": "Bitcoin cannot be staked.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "ia13e45",
                    "author": "coinjaf",
                    "score": 1,
                    "created_utc": 1653540999.0,
                    "response": "\"you're an idiot if...\"\n\n\"yeah, I know, but I want to be an idiot.\"",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9y08pd",
                    "author": "Amoci",
                    "score": -2,
                    "created_utc": 1653491717.0,
                    "response": "There’s a great tool available in Reddit called “search”",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uxj5sd",
            "title": "Finland 🇫🇮 is adopting bitcoin and Lightning ⚡ one business at a time thanks to LN-Kassa, a special Lightning consultancy and Breez Point-of-Sale.",
            "url": "https://medium.com/breez-technology/lightning-in-the-wild-a-budding-ecosystem-in-finland-8b0f971ebe4f",
            "author": "king-only",
            "created_utc": 1653490473.0,
            "score": 114,
            "num_comments": 10,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9yi2gv",
                    "author": "Inner_Cryptographer6",
                    "score": 9,
                    "created_utc": 1653498699.0,
                    "response": "Vielä kun saatais verotus kuntoon. \n\nIf could also get taxation right.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "ia003ke",
                            "author": "feanarosurion",
                            "score": 1,
                            "created_utc": 1653521165.0,
                            "response": "30% isn't good? I thought it was maybe good.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "ia1cgjh",
                                    "author": "Inner_Cryptographer6",
                                    "score": 4,
                                    "created_utc": 1653547803.0,
                                    "response": "30-34% makes us one of the worst countries in the world when it comes to taxes.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "ia1cylg",
                                            "author": "IntheShadeofSpruces",
                                            "score": 6,
                                            "created_utc": 1653548219.0,
                                            "response": "Another Finn here. \n\nEvery use of bitcoin is a taxable event. No-one will want the hassle. I hope the technology spreads, but I do not see it used in this legal situation.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "ia1doje",
                                                    "author": "feanarosurion",
                                                    "score": 1,
                                                    "created_utc": 1653548806.0,
                                                    "response": "Not used for payment, no. But you can still HODL. That's a use on its own.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "ia1lb7w",
                                                    "author": "coffee_for_dinner",
                                                    "score": 1,
                                                    "created_utc": 1653555578.0,
                                                    "response": "Ergh that is terrible. I live in the UK but have been thinking of returning to Finland in the future, but I've also been stacking bitcoin while here. I have wondered what the deal would be if I ever wanted to use BTC in Finland... I guess I'll have to just hold forever and hope that one day I can use it as collateral for loans instead.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "ia1dn0v",
                                            "author": "feanarosurion",
                                            "score": 1,
                                            "created_utc": 1653548771.0,
                                            "response": "Yeah I was being quite sarcastic.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9xy11f",
                    "author": "coinfeeds-bot",
                    "score": 6,
                    "created_utc": 1653490815.0,
                    "response": "tldr; Finland’s LN-Kassa is a Lightning consultancy specializing in onboarding small businesses to the network. The company is building and strengthening the network for all of us in the process, and they get paid for it. Lightning in the Wild is the kind of thing that gives you hope for humanity.\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9yy0fb",
                    "author": "tylerbeefish",
                    "score": 3,
                    "created_utc": 1653504938.0,
                    "response": "So a small consultancy group represents “Finland?”",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}