{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uu72c2",
            "title": "What are the rewards of/incentives to mine $BTC?",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/uu72c2/what_are_the_rewards_ofincentives_to_mine_btc/",
            "author": "SwurveMan",
            "created_utc": 1653078857.0,
            "score": 2,
            "num_comments": 20,
            "subreddit": "BitcoinBeginners",
            "selftext": "If you solve these complex puzzles, what are your rewards of doing such things? Are transaction fees beneficial to the miner as well?",
            "stickied": false,
            "comments": [
                {
                    "id": "i9dmo27",
                    "author": "DudeIncogneto",
                    "score": 3,
                    "created_utc": 1653081896.0,
                    "response": "6.25 bitcoin + transaction fees",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9dhez8",
                    "author": "bitusher",
                    "score": 2,
                    "created_utc": 1653079480.0,
                    "response": "Incentives =\n\n1) Money \n\nBlock reward = coinbase reward (inflation) + transaction fees \n\ninflation ends around the year 2140 with a slow transition to transaction fees making up most of the reward \n\n2) Miners are also Bitcoin users so have an incentive to secure the network to guard their savings",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9dxsgz",
                    "author": "igadjeed",
                    "score": 2,
                    "created_utc": 1653087197.0,
                    "response": "The miner's puzzle is not complex. It is trivial. The mining work is hard because of the number of guesses required to discover a valid block. The work in each guess is a simple algorithm",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9dg19e",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653078857.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9qzaga",
                    "author": "bitcoin_barry",
                    "score": 1,
                    "created_utc": 1653351892.0,
                    "response": "The amount of BTC a miner receives should be worth more than the cost of mining.\n\nA business will use capital to invest in mining if they believe that BTC will produce profit in the future, this is of course a risk that all businesses make with any and all business ideas, but this is the case when a miner might mine Bitcoin for a loss; they are making a loss now to learn on the job with the goal of becoming profitable in the near future.\n\nAfter some time, either capital dries up, or the miner identifies that they are unable to make profit and they stop mining or change something (i.e. location) to address the problem.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}