{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uqcsca",
            "title": "The problem is clear: lack of values",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uqcsca/the_problem_is_clear_lack_of_values/",
            "author": "2xfun",
            "created_utc": 1652640912.0,
            "score": 40,
            "num_comments": 50,
            "subreddit": "Bitcoin",
            "selftext": "I'm sad about society in general. Sometimes I feel like we are going backwards in time. The majority of society is chasing instant gratification and ignoring what really matters: fundamentals. And it's getting worse and worse.\nSince 1913 we destroyed the fundamental property of fiat (scarcity) the consequence of that was taxes and slavery ( debt ) all over the world. Now we have an option to get out of that mindset but all i see is people talking about fiat, doing everything to get more fiat, even though fiat is a bucket full of holes ( losing 20% a year in value ). \nI blame out education system and social media. We need to start teaching our kids critical thinking again. Enough rambling: 1btc = 1btc.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8q96vd",
                    "author": "myironcity",
                    "score": 28,
                    "created_utc": 1652641993.0,
                    "response": "“Hard times create strong men. Strong men create good times. Good times create weak men. And, weak men create hard times.”\nG. Michael Hopf",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8qx3ct",
                            "author": "Degree0",
                            "score": 4,
                            "created_utc": 1652652483.0,
                            "response": "Intelligent men create robots   \n\\-Yi Long Musk",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8rjue0",
                            "author": "AnotherDoctorGonzo",
                            "score": 1,
                            "created_utc": 1652663407.0,
                            "response": "God creates dinosaurs, God destroys dinosaurs. God creates man, man destroys God, man creates dinosaurs.\n\nI also know quotes.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8rkdyv",
                                    "author": "myironcity",
                                    "score": 1,
                                    "created_utc": 1652663661.0,
                                    "response": "Dinosaurs eat man..... Woman inherits the earth",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8qpwi8",
                            "author": "ANordWithASword",
                            "score": 5,
                            "created_utc": 1652649345.0,
                            "response": "And we are in the “good times create weak men” phase, stepping into the last phase. Imo",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8qukwm",
                                    "author": "DatBuridansAss",
                                    "score": 16,
                                    "created_utc": 1652651371.0,
                                    "response": "The good times already created the weak men, and those weak men are in power.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8rng6f",
                                            "author": "Captain_Canuck97",
                                            "score": 1,
                                            "created_utc": 1652665056.0,
                                            "response": "That means I'm gonna be strong man 💪",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8qap5b",
                    "author": "solomonsatoshi",
                    "score": 7,
                    "created_utc": 1652642666.0,
                    "response": "Well said but more than three generations under fiat has fundamentally changed society and habits. \n\nA fiat debt slavery monetary system lacking integrity has created a society, culture and mindset reflecting that debasement.\n\nBitcoin has only just begun to provide a more equitable alternative but the process of changing the mindset of fiat will take time.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8rirzf",
                            "author": "Keith_Kong",
                            "score": 1,
                            "created_utc": 1652662915.0,
                            "response": "That’s really the entire framing of my thesis on the volatility of Bitcoin. The financial state of most individuals under the fiat system combined with the short term profit mindset of the fiat investment world makes Bitcoin volatility inevitable.\n\nIt simply cannot grow as fast as people want it to because the outcome of it growing results in people being able to finally buy that house or upgrade their life in the basic ways we should be able to but cannot seem to afford on work alone.\n\nThis combined with institutions taking profit to secure their yearly or even quarterly return stats causes these massive cycles. Bitcoin cannot escape the boom and bust until it actually becomes the base layer for value in the economy.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8q9qen",
                    "author": "NiceDoctorBeam",
                    "score": 9,
                    "created_utc": 1652642237.0,
                    "response": "Bitcoin is still just barely getting started.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8r6nar",
                            "author": "TheChoosey1",
                            "score": 9,
                            "created_utc": 1652657019.0,
                            "response": "In ten years some teenager will look up at you and marvel that you got BTC under $1 million per coin. Then he'll stab you, but for that one shining moment you'll get the best feeling you've ever felt: being right.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8rbhy3",
                                    "author": "apexisalonelyplace",
                                    "score": 3,
                                    "created_utc": 1652659430.0,
                                    "response": "This shit is hard",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8rbkk7",
                                            "author": "TheChoosey1",
                                            "score": 2,
                                            "created_utc": 1652659466.0,
                                            "response": "I'm already at home, so I have no choice but to go hard.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i8ri8be",
                                    "author": "Independent-Snow-129",
                                    "score": 2,
                                    "created_utc": 1652662685.0,
                                    "response": "\"Then I'll fly like a Dragonfly and gain bonus wisdom in the next timeline\" jokes on the stabber !",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8r6top",
                    "author": "Redhead_Empire",
                    "score": 2,
                    "created_utc": 1652657105.0,
                    "response": "Get stronger. Don’t take shit. Invest and create a family name worth living for",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8r8xzd",
                    "author": "sescobreezy727",
                    "score": 2,
                    "created_utc": 1652658155.0,
                    "response": "As soon as you stop hearing sir and ma’am the rest is sure to follow.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8q7rhz",
                    "author": "Nada_Lives",
                    "score": 3,
                    "created_utc": 1652641356.0,
                    "response": "If it weren't for our sensitive leaders, enforcing equity among all peoples...\n\n/s",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8qcyso",
                            "author": "solomonsatoshi",
                            "score": 1,
                            "created_utc": 1652643681.0,
                            "response": "Exactly, while they are mostly in truth puppets to and enablers of the fiat debt slavery cartel!",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8rm0f6",
                            "author": "aed38",
                            "score": 1,
                            "created_utc": 1652664409.0,
                            "response": "Our \"leaders\" want us all to have the same equity: zero.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8qeys2",
                    "author": "po00on",
                    "score": 3,
                    "created_utc": 1652644572.0,
                    "response": "> I blame out education system and social media\n\nPeople blaming others, instead of taking personal responsiblity, is a large reason why we are where we are ....",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8qjxae",
                            "author": "Vinnypaperhands",
                            "score": 3,
                            "created_utc": 1652646756.0,
                            "response": "I don't think that's what op is getting at. He's not blaming them, more so disappointed In the education system and social media. Social media for getting the younger generation and some adults hooked on instant gratification And the education system for utterly failing and lieing to us. in the us we were taught bullshit keynesian economics and were told to go into debt and go to school to get a good job. Didn't tell us how the fiat system worked or cared to teach us about saving. It was don't worry kids. Go to school and get a good job and you'll have a house with a white picket fence before you know. They never told us they were in the process of slaughtering that dream",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8qwlwr",
                                    "author": "po00on",
                                    "score": 2,
                                    "created_utc": 1652652266.0,
                                    "response": "it's your responsiblity to educate yourself, not somebody elses.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8r3y3e",
                                            "author": "Vinnypaperhands",
                                            "score": 3,
                                            "created_utc": 1652655701.0,
                                            "response": "Yes, correct. You can also be disappointed in things",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8qe83j",
                    "author": "uncontrollableop",
                    "score": 2,
                    "created_utc": 1652644243.0,
                    "response": "you're confusing different values for a lack of values (presumably the values you prefer). everyone is driven by ideology. even someone who rejects every ideology they encounter is therefore a slave to his regime.     \n\n\"we\" don't need to teach all children any such things. \"we\" need to stop forcing government schooling on children which is inherently corrupting and leads to this obsession with the phrase \"we need to [do something]\".  the only reason other people are so much of your concern is because our political system, which is forced upon us by a violent gang, requires us to have opinions on every matter relating to the spending of 1/2 of everyone's income (income which has been stolen from us at gunpoint).  so the system is designed to create huge conflicts (political unity after all is just another way of saying global war), which they use as further evidence that *we* need *them* to fix it.    \n\nthe govt is not us.  nor do they represent us. those who claim they do are hive mind npcs, completely ineffectual drones sleepwalking through life.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8qojhf",
                            "author": "LemonKnuckles",
                            "score": 2,
                            "created_utc": 1652648740.0,
                            "response": "“Everything in nature is perfectly real including consciousness, there’s absolutely nothing to worry about. Not only have the chains of the Law been broken, they never existed; demons never guarded the stars, the Empire never got started, Eros never grew a beard.\nNo, listen, what happened was this: they lied to you, sold you ideas of good & evil, gave you distrust of your body & shame for your prophethood of chaos, invented words of disgust for your molecular love, mesmerized you with inattention, bored you with civilization & all its usurious emotions.\nThere is no becoming, no revolution, no struggle, no path; already you’re the monarch of your own skin — your inviolable freedom waits to be completed only by the love of other monarchs: a politics of dream, urgent as the blueness of sky.\nTo shed all the illusory rights & hesitations of history demands the economy of some legendary Stone Age — shamans not priests, bards not lords, hunters not police, gatherers of paleolithic laziness, gentle as blood, going naked for a sign or painted as birds, poised on the wave of explicit presence, the clockless nowever.\nAgents of chaos cast burning glances at anything or anyone capable of bearing witness to their condition, their fever of lux et voluptas. I am awake only in what I love & desire to the point of terror — everything else is just shrouded furniture, quotidian anaesthesia, shit-for-brains, sub-reptilian ennui of totalitarian regimes, banal censorship & useless pain.”",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8qrfa1",
                            "author": "solomonsatoshi",
                            "score": 2,
                            "created_utc": 1652650006.0,
                            "response": "You want to live without government? Really? See how that goes for you- nobody stopping you from relocating to Somalia. Until the need for government is removed we are all to some extent the government to the extent we accept and enable them.\n\nI disagree with the extent to which governments have misused fiat debt based monetary powers and see Bitcoin as enabling change to a fairer system which will require a higher degree of accountability from governments but there is no valid case to say government is no longer required or that we are not all to some extent responsible for whatever state our government is in. The price of freedom is constant vigilance.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8q9gdg",
                    "author": "Deathstaroperatorguy",
                    "score": 2,
                    "created_utc": 1652642113.0,
                    "response": "How people are not freaking out how high gas has become is blowing me away. Mess with me, but don’t mess with my money. Why are there not riots in the streets over this?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8qd9un",
                            "author": "solomonsatoshi",
                            "score": 3,
                            "created_utc": 1652643815.0,
                            "response": "Because Putin and his criminal creeping fascism is worse than high gas prices.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8qsc6w",
                                    "author": "Perfect_Orgsm",
                                    "score": 3,
                                    "created_utc": 1652650403.0,
                                    "response": "Yeah, don't waste a good crisis, keep the peoples interest occupied elsewhere.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8qtllb",
                                            "author": "solomonsatoshi",
                                            "score": 1,
                                            "created_utc": 1652650944.0,
                                            "response": "Don't let the facts get in the way of your argument.\n\nNot saying there are not problems other than Putin, but war criminal Putins invasion of Ukraine is largely responsible for the high oil prices currently and I want Putin gone and am prepared to pay higher gas prices to achieve that.\n\nhttps://www.newyorker.com/news/daily-comment/russia-and-china-unveil-a-pact-against-america-and-the-west",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8qvwdv",
                                                    "author": "Perfect_Orgsm",
                                                    "score": 2,
                                                    "created_utc": 1652651956.0,
                                                    "response": "Not saying the war isn't happening, but the inflation we are experiencing was set in motion long before the war broke out. But Putin is a nice scapegoat so the people won't look inwards and realize it's mostly because of bad managment and trickery.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8rbrza",
                                                            "author": "solomonsatoshi",
                                                            "score": 0,
                                                            "created_utc": 1652659570.0,
                                                            "response": "IMO its a bit of both- rising fuel prices are definitely largely down to the war criminal Putin. He must go.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8qez55",
                            "author": "NumberWonTwice",
                            "score": -8,
                            "created_utc": 1652644576.0,
                            "response": "Because democrats control all the branches of government, last I checked they are the ones who pay people to protest…wouldn’t be very wise of them",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8qj6ik",
                                    "author": "2xfun",
                                    "score": 8,
                                    "created_utc": 1652646430.0,
                                    "response": "Don't make this a political discussion. I'm apolitical.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8qk9gm",
                                            "author": "NumberWonTwice",
                                            "score": 1,
                                            "created_utc": 1652646902.0,
                                            "response": "It’s a straightforward answer, he asked why there aren’t riots in the streets…",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8qvo3q",
                                                    "author": "solomonsatoshi",
                                                    "score": 1,
                                                    "created_utc": 1652651857.0,
                                                    "response": "Bipartisan and wider popular support for funding Ukraines defense against Putins aggression would suggest you are barking up the wrong tree here.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8qw9d7",
                                                            "author": "NumberWonTwice",
                                                            "score": 2,
                                                            "created_utc": 1652652112.0,
                                                            "response": "40 billion in defense expenditures for a non nato country.  I’m not saying it’s not important…but the high gas prices were here before that conflict began.  And what tree am I barking up? I answered a question pertaining to riots over gas prices.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8rjczf",
                            "author": "AndthenIwould",
                            "score": 1,
                            "created_utc": 1652663178.0,
                            "response": "Because we've had high gas prices like this before.  Several times.  Katrina Hurricane in 2005, then the housing market crash in 2008 sent gas prices sky high for a while.  This isn't new.  We just had a decade to forget.  Then gas prices crashed during the pandemic to under a dollar in many places.  We get spoiled and then overreact when the pendulum swings the other way, which it always does.  Prices will come down again at some point.  It's not any one leader's fault.  It's a combination of many things.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8qo3qw",
                    "author": "ForcedLoginIsFacism",
                    "score": 1,
                    "created_utc": 1652648551.0,
                    "response": "This is true for everything from society over academia to industry and economy.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8r29cy",
                    "author": "Spiritualsensations",
                    "score": 1,
                    "created_utc": 1652654886.0,
                    "response": "What are your values sir?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8r2ac0",
                    "author": "squareOfTwo",
                    "score": 1,
                    "created_utc": 1652654899.0,
                    "response": "I blame missing education and human stupidity and a low time horizon (I need it now'ism).",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8r9h6y",
                    "author": "Used-Astronaut6720",
                    "score": 1,
                    "created_utc": 1652658419.0,
                    "response": "Solid schizo post op",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8rncdd",
                    "author": "budjuice",
                    "score": 1,
                    "created_utc": 1652665009.0,
                    "response": "Never look to social media for non sensational, non tribal sentiment. It’s a giant echo chamber. My favourite repeating quote in this sub is “no one knows shit about fuck”",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8rp20e",
                    "author": "heyhihowyahdurn",
                    "score": 1,
                    "created_utc": 1652665792.0,
                    "response": "Time will always remove the lower quality",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8qygv6",
                    "author": "BitcoinUser263895",
                    "score": -1,
                    "created_utc": 1652653102.0,
                    "response": "> I'm sad about society in general. Sometimes I feel like we are going backwards in time. \n\nOh please. This reads like some Christian who has spent a lifetime oppressing people complaining about the local kids skateboarding too much.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8r6ent",
                    "author": "VPNApe",
                    "score": 0,
                    "created_utc": 1652656903.0,
                    "response": "The root of society's problems is that humans are just inherently shitty creatures. The education didn't just turn to shit by itself, it was intentional. Nothing is inherently wrong with social media, it's people that developed shit like cancel culture.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}