{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uv96cg",
            "title": "This is what MicroStratergy's new CFO said about their BTC holdings",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/uv96cg/this_is_what_microstratergys_new_cfo_said_about/",
            "author": "Gwen765",
            "created_utc": 1653219380.0,
            "score": 26,
            "num_comments": 4,
            "subreddit": "BitcoinBeginners",
            "selftext": "MicroStrategy, the world's biggest publicly listed business intelligence company, reported a non-cash digital asset impairment charge of $170.1 million in the first quarter of 2022, up from the previous quarter.\n\n The corporation had to pay $146.6 million in digital asset impairment costs in the fourth quarter of 2021.\n\nAccording to standard accounting principles, the worth of digital assets, including cryptocurrencies, should indeed be recorded at the cost price and only changed if their value decreases. On the contrary, if the price of a digital asset rises, the capital value does not change unless the company sells it. The price of Bitcoin or any other digital asset has fallen below the price it was purchased, resulting in digital asset impairment.\n\nSince July, Bitcoin has been on a five-day fall, bringing its price to its lowest point.\n\n Other currencies, such as Threedium, Metaloop, MetaTokyo Faith Tribe, and others, have suffered comparable losses due to the economic downturn.\n\nAccording to Kang, MicroStrategy had not been pressured to sell by any stakeholders, demonstrating that investors are united behind the firm and its bitcoin strategy. While Kang stated that the firm checks the price of bitcoin daily, he refused to comment on future bitcoin acquisitions.\n\n\"Most of the other recent volatility was definitely around several activity outside of bitcoin,\" Kang said.\n\n \"From a market standpoint, we keep an eye on it, but there's nothing fundamental about bitcoin that we feel poses a threat to our approach.\"",
            "stickied": false,
            "comments": [
                {
                    "id": "i9jz54l",
                    "author": "nueve",
                    "score": 2,
                    "created_utc": 1653221071.0,
                    "response": "> Since July, Bitcoin has been on a five-day fall, bringing its price to its lowest point.\n\nWha?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9jwrnr",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1653219380.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9jxfp4",
                    "author": "Outrageous_Depth_202",
                    "score": 1,
                    "created_utc": 1653219868.0,
                    "response": "👍🏻👍🏻",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9jz36q",
                    "author": "Greenery_Financial",
                    "score": 1,
                    "created_utc": 1653221035.0,
                    "response": ">According to Kang, MicroStrategy had not been pressured to sell by any stakeholders\n\nThe only reason people give micro strategy debt or invest in the company is because they own bitcoin, why would they be pressured to sell?\n\n The entire selling point of micro strategy is bitcoin with leverage available in taxable accounts, disguised as a publicly traded company.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}