{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": 3,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uiicjc",
            "title": "Let’s go! Break that 40k mark BTC! Let’s see some profitable days in the future too!",
            "url": "https://i.redd.it/g61iqihgcjx81.gif",
            "author": "SkitzWeb",
            "created_utc": 1651703319.0,
            "score": 30,
            "num_comments": 7,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i7crxix",
                    "author": "Keith_Kong",
                    "score": 4,
                    "created_utc": 1651704632.0,
                    "response": "Honestly I’m going to be pretty bummed if we don’t at least come down to check 30k. Been in DCA mode for a couple months but I’d love to see at least a few of my limit orders go through.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uighfc",
            "title": "Recent Twitter post from CAR President, Faustin-Archange Touadéra",
            "url": "https://mobile.twitter.com/FA_Touadera/status/1521945076133511169",
            "author": "dragger2k",
            "created_utc": 1651698053.0,
            "score": 13,
            "num_comments": 1,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uidxip",
            "title": "Gold is a great way to preserve wealth, but it is hard to move around. You do need some kind of alternative and Bitcoin fits the bill",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uidxip/gold_is_a_great_way_to_preserve_wealth_but_it_is/",
            "author": "PowellCerys",
            "created_utc": 1651691015.0,
            "score": 17,
            "num_comments": 10,
            "subreddit": "Bitcoin",
            "selftext": " Gold is a great way to preserve [**wealth**](https://graciousquotes.com/wealth/), but it is hard to move around. You do need some kind of alternative and **Bitcoin** fits the bill",
            "stickied": false,
            "comments": [
                {
                    "id": "i7bvk7x",
                    "author": "MrQ01",
                    "score": 3,
                    "created_utc": 1651691794.0,
                    "response": "Who is this post aimed towards?",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uicu1y",
            "title": "The internet was designed so information and communication could survive a nuclear event via its geographically decentralized servers. So if nuclear war ever does break out; don’t worry about ₿Itcoin. Worry about yourself surviving so you can still access Bitcoin’s internet network after it does",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uicu1y/the_internet_was_designed_so_information_and/",
            "author": "Future-PeterSchiff",
            "created_utc": 1651688000.0,
            "score": 18,
            "num_comments": 14,
            "subreddit": "Bitcoin",
            "selftext": "It’s astoundingly hilarious to me that people don’t know the internet was literally invented so information and communication could survive via its multiple geographically decentralized servers in the event of a nuclear holocaust. [Bitcoin is a peer to peer internet payment network.](https://en.m.wikipedia.org/wiki/Bitcoin_network#:~:text=The%20bitcoin%20network%20is%20a,using%20bitcoin%20cryptocurrency%20wallet%20software)\n\nProofs the internet was invented to survive a nuclear holocaust:\n\nhttps://www.wired.co.uk/article/h-bomb-and-the-internet\n\nhttps://www.rand.org/about/history/baran.html\n\n**₿**[itcoin nodes and miners are literally in nuclear bunkers today and have been in them for some years now](https://www.forbes.com/sites/jasperhamill/2013/11/05/this-swiss-cryptocurrency-trader-will-store-your-bitcoin-in-a-nuclear-bunker/).\n\nHell, [we even have them in space thanks to blockstream’s satellites](https://blockstream.com/satellite/#:~:text=Blockstream%20Satellite%20broadcasts%20the%20Bitcoin,an%20opportunity%20to%20use%20Bitcoin.). \n\nSo if nuclear war breaks out, don’t worry about internet networks like Bitcoin, instead worry about how you’ll survive it so you can still be alive to access and use your Bitcoin during and after it.\n\nAlso, a little story for everyone to consider. In 1997 my dad had $40k worth of Microsoft and other tech stocks. He panic sold it for $20k after uncle Sam took the other half of it with their short term capital gains tax cut of the profit. He did that because of this “scary event” that was supposed to happen called “Y2K”. That $40k worth of tech stocks would be worth $2.7 million today. \n\nWould’ve been enough for me and my siblings to afford college. Enough to live off the interest with 6 figures a year. \nInstead, he panic sold it to the same rich people who were pushing the Y2K story, all so they could scare him into selling his blue chip tech stocks to them for way cheaper than they expected the stocks would be worth in the future. \nWhich they were right about, because I run those numbers in my head every day, and for more than half a decade now remembering that story has allowed me to HODL into life changing stacks, instead of panic selling like so many of my friends and family did who started this journey with me, but panic FUDed out after a tiny bit of fud they saw which was funded by the same people buying their Bitcoin from them for cheap, just like my dad who panic sold his life changing tech stocks for cheap to the same people pushing the Y2K narrative",
            "stickied": false,
            "comments": [
                {
                    "id": "i7c7jiq",
                    "author": "WreckingBaldo",
                    "score": 3,
                    "created_utc": 1651696448.0,
                    "response": "Ppl are thinking about this way too much. Op is just pointing out BTC can survive. \n\nChill out ppl",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7bsx4f",
                    "author": "Mallardshead",
                    "score": 4,
                    "created_utc": 1651690749.0,
                    "response": "If a nuclear war breaks out then BTC will be the very last of your concerns",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uieiym",
            "title": "Bitcoin Miner Marathon Digital Eyes 199,000 Miners, Holds over 9,000 BTC",
            "url": "https://bitcoinmagazine.com/business/bitcoin-miner-marathon-digital-eyes-199000-miners-holds-over-9000-btc",
            "author": "Internet_Finds",
            "created_utc": 1651692680.0,
            "score": 8,
            "num_comments": 2,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uijbp9",
            "title": "I made a tutorial for the Ronin Dojo Tanto - TLDW; Robust hardware, made to connect as a backend for your Samourai wallet for 24/7 whirlpool mixes. Privacy and device quality are priority, more difficult than Umbrel, but pretty looking UI.",
            "url": "https://youtube.com/watch?v=hI9ozPq1GlQ&feature=share",
            "author": "benperrin117",
            "created_utc": 1651706083.0,
            "score": 3,
            "num_comments": 0,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "ui4y8o",
            "title": "Bitcoin Mining Ban: Albany, NY - May 2, 2022 - interviews/activism",
            "url": "https://youtu.be/BDncQ81bX-M",
            "author": "EtherHobbes",
            "created_utc": 1651665668.0,
            "score": 3,
            "num_comments": 4,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uib9j6",
            "title": "MicroStrategy Takes $170M Q1 Impairment Charge on Bitcoin Holdings | Decrypt",
            "url": "https://decrypt.co/99439/microstrategy-takes-170m-q1-impairment-charge-on-bitcoin-holdings",
            "author": "sandygws",
            "created_utc": 1651683738.0,
            "score": 3,
            "num_comments": 5,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i7bc059",
                    "author": "Reverend_Renegade",
                    "score": 3,
                    "created_utc": 1651684167.0,
                    "response": "IF, BTC falls to $21k",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7c6c33",
                            "author": "tradone",
                            "score": 3,
                            "created_utc": 1651695981.0,
                            "response": "I will sell my liver for this price.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "uifv0y",
            "title": "An alternative to BISQ",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uifv0y/an_alternative_to_bisq/",
            "author": "0delta",
            "created_utc": 1651696325.0,
            "score": 4,
            "num_comments": 1,
            "subreddit": "Bitcoin",
            "selftext": "I'd like to share information about an open code Telegram bot that allows trading Bitcoin for fiat p2p via the Lightning Network: https://github.com/grunch/p2plnbot\n\nIt does not require trusting any third party. The bot is managing an escrow account automatically. It is very fast and the fees are minimal.\n\nFeel free to try it at https://t.me/molnexchange",
            "stickied": false,
            "comments": [
                {
                    "id": "i7ct6eq",
                    "author": "uncontrollableop",
                    "score": 4,
                    "created_utc": 1651705191.0,
                    "response": "fiat require trusting a 3rd party. and so does escrow. you're lying.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "ub2dmf",
            "title": "does holdıng your prıvate keys ın usb too bad?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/ub2dmf/does_holdıng_your_prıvate_keys_ın_usb_too_bad/",
            "author": "Alektra004",
            "created_utc": 1650828840.0,
            "score": 3,
            "num_comments": 36,
            "subreddit": "Bitcoin",
            "selftext": "I always tend to hold my all password in folders, not only my 24 private key, but normal passwords as well.\n\nAfter starting investing btc and getting ledger, ı setup my prıvate key ın paper, and hıde ıt very well, but ı also put ın usb and store ıt there as well for more securıty (backups)\n\nI repaıred my laptop, and ım plannıng to check my all passwords from my laptop from now on (laptop ıs offlıne, aswell) but of course, ı had to connect my usb to my computer multıple tımes due to lookıng my other passwords ( ı have a very bad memory of rememberıng accounts )\n\nIs thıs mıght be a securıty leak to consıder? ı dont use anythıng suspecıous on my computer, ı havent downloaded anythıng except bınance, ledger, steam/dıscords etc. the things i do on my computer is very regular, ı dont thınk there mıght be any securıty leak to puttıng my usb ın my computer to look some passwords for some seconds.\n\nStill, people are said too many times to not store your passwords on online. I am considering is this might be too much problem for me in the future? I got no photo, not a password folder ın my computer currently, my passwords are only stored ın my usb stıck, and now ım plannıng to look them from my offlıne laptop from now on.\n\nAny thoughts? how do you guys save your passwords?",
            "stickied": false,
            "comments": [
                {
                    "id": "i61dy8t",
                    "author": "Appropriate_Bug7466",
                    "score": 9,
                    "created_utc": 1650828935.0,
                    "response": "Never type your seed into any computer (besides maybe a hardware wallet).",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i61zf8n",
                    "author": "BitcoinUser263895",
                    "score": 4,
                    "created_utc": 1650838131.0,
                    "response": "Doesn't matter if you disconnect from the internet.\n\nIf the machine has **EVER** been connected to the internet then it is to be considered compromised.\n\nYou're inserting a USB drive with all your secrets into a machine you can't possibly trust.\n\n* Immediately stop using unencrypted storage for your passwords. Use a password manager like normal people.\n* Don't store your mnemonic seed phrase on anything which goes anywhere near anything which has touched the internet.\n\n>  ı dont thınk there mıght be any securıty leak to puttıng my usb ın my computer to look some passwords for some seconds.\n\nYou are absolutely unequivocally mistaken.\n\n> not a password folder ın my computer currently, my passwords are only stored ın my usb stıck\n\n\"My passwords are only sometimes in an folder on my computer\"",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i61i7ze",
                    "author": "-SPRENGMEISTER-",
                    "score": 3,
                    "created_utc": 1650830755.0,
                    "response": "Never type your seed into any device that was, currently is or will at some point be connected to the internet. If you did that, move your coins to a new wallet. Write your seed on paper and/or, even better, have steel backups.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uild1p",
            "title": "Who's paying attention to r/superstonk?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uild1p/whos_paying_attention_to_rsuperstonk/",
            "author": "vict_r",
            "created_utc": 1651712267.0,
            "score": 5,
            "num_comments": 6,
            "subreddit": "Bitcoin",
            "selftext": "They've been slowly realizing they need btc for the past year.... But they still believe they can \"trick\" the tricksters instead of just not playing their game.\nI think we're a few months before they start coming for btc... especially if the squeeze happens (which is hard to happen cuz system is rigged)..\nWhat do you think?",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uieoxf",
            "title": "California Governor Signs Executive Order Encouraging Bitcoin And Crypto Businesses",
            "url": "https://bitcoinmagazine.com/markets/california-governor-signs-executive-order-encouraging-bitcoin-and-crypto-businesses",
            "author": "Internet_Finds",
            "created_utc": 1651693117.0,
            "score": 148,
            "num_comments": 36,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i7c4lm4",
                    "author": "coinfeeds-bot",
                    "score": 9,
                    "created_utc": 1651695303.0,
                    "response": "tldr; California Governor Gavin Newsom signed an executive order today to create a regulatory framework for companies operating in bitcoin and other cryptocurrencies. The EO combines a multitude of regulatory agencies set to define regulatory practices throughout a public process based on feedback from stakeholders. The order also initiates the creation of a workforce pathway for those hoping to enter the cryptocurrency space.\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7d5f7x",
                    "author": "DM_ME_UR_SATS",
                    "score": 28,
                    "created_utc": 1651710692.0,
                    "response": "So many people in here triggered by the very mention of California. Grow up. \n\nI’m just happy that CA isn’t openly hostile to Bitcoin like New York. This is a positive signal.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7d8tx2",
                            "author": "SkepticalDreams",
                            "score": 8,
                            "created_utc": 1651712204.0,
                            "response": "Too many children in here.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i7dnx6f",
                            "author": "LoneWolfSpartan",
                            "score": 3,
                            "created_utc": 1651719093.0,
                            "response": "Same I'm happy whenever there is adoption",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i7e4j9d",
                            "author": "summertime_taco",
                            "score": 3,
                            "created_utc": 1651728485.0,
                            "response": "Or like texas, one of the few states which has outright outlawed earning platforms even to accredited investors.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i7ddedn",
                            "author": "immutable_truth",
                            "score": 3,
                            "created_utc": 1651714229.0,
                            "response": "“SToP mAKinG biTcOiN PoLItIcAL”\n\nDemocrat doesn’t something to support crypto…\n\n“BlUe MaN baD”",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7dixes",
                    "author": "JerryLeeDog",
                    "score": 18,
                    "created_utc": 1651716734.0,
                    "response": "Just here to see all the tears when CA gets brought up\n\nTook a job offer in SD 2 years ago at age 36. Holy F best decision of my life. Beautiful every damn day here 🤷‍♂️ still feels like a vaca",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7e1onb",
                            "author": "nodedude7",
                            "score": 6,
                            "created_utc": 1651726577.0,
                            "response": "Tupac didn't make the song Indiana Love... Just saying haha",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i7dsdxq",
                            "author": "ubring",
                            "score": 6,
                            "created_utc": 1651721341.0,
                            "response": "Yep. Lived in SoCal for 10 years. Best weather, no pollution, light traffic. City had top 5 lowest crime rate in the US. So wonderful to be there.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i7dvmmd",
                            "author": "Hefty_Jicama",
                            "score": 6,
                            "created_utc": 1651723050.0,
                            "response": "San Diego is an awesome city. I hope it stays that way and doesn’t go to the way of other west coast cities",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7e1rnc",
                    "author": "Cats_n_Porn",
                    "score": 5,
                    "created_utc": 1651726632.0,
                    "response": "Everyone talking shit would be on their knees sucking a Republican governor's cock if DeSantis or Abbot signed something like this. Y'all are just jelly.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uici89",
            "title": "Pleaese don't implement unclear BIPs",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uici89/pleaese_dont_implement_unclear_bips/",
            "author": "Lazy-Substance-5161",
            "created_utc": 1651687121.0,
            "score": 104,
            "num_comments": 98,
            "subreddit": "Bitcoin",
            "selftext": "I don't know exactly what's going on. Pleaese be honest. How many of you know what BIP119 exactly does? Probably very few. We just hear warnings everywhere. I thought i knew some things about bitcoin. But today i learned that i can't even vote against that update with my node. I don't even know what that update does, and i even can't tell you exactly after reading about it. All I can do right now, as far as my understanding goes, is raising my voice against that update, simply because of the fact that i  can not tell what it exactly does and what risks it implies. PLEASE don't implement something unclear to most of us.",
            "stickied": false,
            "comments": [
                {
                    "id": "i7d1162",
                    "author": "_thatbitchcarole_",
                    "score": 15,
                    "created_utc": 1651708737.0,
                    "response": "Why can’t the advantages of BIP119 be replicated on a second layer instead of a Bitcoin core update?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7dl3w2",
                            "author": "smartfbrankings",
                            "score": 9,
                            "created_utc": 1651717760.0,
                            "response": "It won't boost Jeremy's fragile ego.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i7dyr26",
                            "author": "lerkmore",
                            "score": 3,
                            "created_utc": 1651724770.0,
                            "response": "Because you would likely need to trust a federation (or similar) to enforce something like CTV.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7bkuwt",
                    "author": "Head_Eye_4198",
                    "score": 17,
                    "created_utc": 1651687595.0,
                    "response": "Who are you telling not to implement any BIPs that you don't understand? \n\nA BIP requires consensus among the bitcoin developers and bitcoin node operators in order to be implemented.\n\nDo you understand BIP141? Do you understand BIP341? Both of these were implemented. \n\nDo you understand any of the BIPs?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7c6772",
                            "author": "comfyggs",
                            "score": 38,
                            "created_utc": 1651695927.0,
                            "response": "I wrote a comment on another thread: https://www.reddit.com/r/Bitcoin/comments/uhyq6p/comment/i7aye20/  \nThe problem with BIP-119 is the method of deployment as it affects consensus. Effectively Miners and Developers would be given a greater possibility to collude with each other while node operators are left out. Why? Because its a speedy trial (like taproot was) as opposed to USAF (user activated soft fork) And the implementation of a MASF (Miner activated soft fork)  \nProponents of BIP-119 will argue that MASF mimimizes risk of consensus failure in cooperative scenario while UASF incentivizes cooperation in adversarial scenario.  \nHowever, this method of consensus is flawed. Introducing new changes to a soft fork via Miner Signaling shift consensus towards the miners and devs and away from pleb Node operators. You wont be able to “vote with your node” so to speak because it’s a speedy trial. The Devs asked the Miners and the Miners agreed. From that point they see no need for UASF.  \nBitcoin should not adopt a culture of rapidly accepting more features nobody was asking for. This is the the wish of just a few people. Not all. One Developer made the initial proposal.  \nThe big red flag is how fast and aggressively this is trying to be pushed out while changing the consensus methods. After Taproot and it’s speedy trial, some people did realise that this consensus method might not be good for the future of the network.  \nThere is NO urgency or problem that needs to be solved by this or in this manner. If you can point one out please do so.  \nUpdates to the code should be for efficiency and security of the network. Not adding complexity.  \nSpeedy Trial is an attack Vector  \nAny soft fork activated via Bitcoin Core is an attack vector  \nTomer Strolight writes: “This is a crucial point to understand. Anyone giving miners an activation path in Bitcoin Core that excludes users is taking control of Bitcoin. Doesn't matter if they're doing it for safety or ease. It's better to risk a bumpy activation than exclude users in consensus changes.”  \nThat’s my 2c. Flame away.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7cy8ni",
                                    "author": "Head_Eye_4198",
                                    "score": 5,
                                    "created_utc": 1651707489.0,
                                    "response": "Speedy Trial is not a part of BIP119. BIP119 just states that using Speedy Trial is a possibility. BIP119 also states \"Should another method become favored by the wider Bitcoin comminity, that might be used instead.\" But no activation method has been chosen for BIP119 and an activation method is not even a part of BIP119.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i7dl3ux",
                                            "author": "whitslack",
                                            "score": 9,
                                            "created_utc": 1651717760.0,
                                            "response": ">But no activation method has been chosen for BIP119 and an activation method is not even a part of BIP119. \n\nThis is true. However, the author of BIP119 is proposing and promoting a Speedy Trial activation. This is concerning.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i7bldlc",
                            "author": "Lazy-Substance-5161",
                            "score": 15,
                            "created_utc": 1651687799.0,
                            "response": "No. I do not. But i hope that some people do. And right now, there are a lot of warnings that I did not hear on BIP 141, BIP 341. Why do we hear a lot of warnings? As someone who does not understand it exactly, it is because it is unclear even for someone who knows about that stuff. Please clarify if i am wrong.\n\nedit: and please tell me what i can do increase my knowledge about this. I am currently reading 'Mastering Bitcoin' to get somewhere to be able to talk about it",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7bmjms",
                                    "author": "WritingFun8769",
                                    "score": 30,
                                    "created_utc": 1651688258.0,
                                    "response": "we’re hearing warnings because while some bips like taproot were developed over years and gained strong consensus, the author of bip-119 is trying to push it through rapidly.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i7bmrhf",
                                            "author": "Lazy-Substance-5161",
                                            "score": 28,
                                            "created_utc": 1651688345.0,
                                            "response": "And that is the problem. Updates are irreversible, we NEED time to gain strong consensus on something. PLEASE don't implement unclear BIPs!",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i7bmvpz",
                                    "author": "Head_Eye_4198",
                                    "score": 9,
                                    "created_utc": 1651688391.0,
                                    "response": ">Why do we hear a lot of warnings?\n\nBecause the community has grown and idiots are repeating retards. None of those people understand BIP119 either.\n\nBIP119 needs more review. It may not be the right choice. But it also may be the right choice. It needs more review, we need more time, and we need to consider other options.\n\nBut we shouldn't stop improving bitcoin just because you don't understand any of the bitcoin improvement proposals.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i7br0q0",
                                            "author": "mossgathering",
                                            "score": 21,
                                            "created_utc": 1651690010.0,
                                            "response": ">BIP119 needs more review. It may not be the right choice. But it also may be the right choice. It needs more review, we need more time, and we need to consider other options.\n\nI think that's the point OP was trying to make.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i7d0603",
                                                    "author": "PRMan99",
                                                    "score": 5,
                                                    "created_utc": 1651708353.0,
                                                    "response": "But how else would he feel smug calling people idiots and retards while repeating exactly what they said?",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i7e0yu7",
                                            "author": "TenshiS",
                                            "score": 4,
                                            "created_utc": 1651726119.0,
                                            "response": "Lol, claiming people raising warnings are idiots, then goes ahead and raises warning that it needs more review.\n\nThat's just what every other idiot wants too, and that's good. It needs more review.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i7c6o2r",
                                    "author": "comfyggs",
                                    "score": 4,
                                    "created_utc": 1651696112.0,
                                    "response": "Read up and make your own mind up. Make your voice herd. Write to the Bitcoin Core Dev team. Write to the Dev who made the initial proposal, Jeremy Rubin https://github.com/JeremyRubin  \nAnd the contributors to the proposal,  \nhttps://github.com/bitcoin/bips/blob/master/bip-0119.mediawiki  \nI’m not upgrading my node until the future of consensus is clear.  \nJoin the opponents to BIP-0119 on social media and anyway you can.  \nhttps://twitter.com/bitcoinerrorlog  \nhttps://twitter.com/francispouliot\\_/status/1521548193636495364  \nhttps://twitter.com/tomerstrolight  \nDo not sit idle and allow the “potential” of possible bad actors changing things till they break consensus.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i7cg5mc",
                                    "author": "Neinfu",
                                    "score": 3,
                                    "created_utc": 1651699819.0,
                                    "response": "To get some ideas of possible benefits of BIP 119 you can check out https://utxos.org\n\nFor some potential dangers and downsides checkout these videos by Andreas M. Antonopoulos\nhttps://youtu.be/yO5BwXFyCIQ\nhttps://youtu.be/vAE5fOZ2Luw",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i7bq0sf",
                            "author": "Nada_Lives",
                            "score": 6,
                            "created_utc": 1651689618.0,
                            "response": "I'm sure that BIP119 is well-documented publicly somewhere. But for all the discussion it's been getting recently, you'd think that someone would tell us *where* so we can come to our own flawed opinions.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7bq0tj",
                    "author": "SmoothGoing",
                    "score": 9,
                    "created_utc": 1651689619.0,
                    "response": "Best you can do is run your node without upgrading it. If it's still getting blocks you're good. Once it stops getting blocks and you're forked off maybe then you can read the bips.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7ccyc0",
                    "author": "RonPaulWasR1ght",
                    "score": 7,
                    "created_utc": 1651698542.0,
                    "response": "Let's discuss the BIP itself.  From what I've heard, there are constraints that it allows you to place on the UTXO's when they are sent, such as restricting the recipient from sending them to anything other than certain specified wallet IDs, for example.  Stuff like that.  My concern is, that aspect of the BIP will cause a loss of fungibility amongst the Bitcoin itself, and I would not want to see that.  Also unclear what happens if such UTXO's are CoinJoined later.  \n\nI just...don't like it until we learn more about it.  No rush.  Bitcoin is working fine and will still be there, let's take our time.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7d6bt5",
                            "author": "ethereumfail",
                            "score": 3,
                            "created_utc": 1651711095.0,
                            "response": "it does just 1 thing - it sets ALL of exact transactions that can spend that utxo, that's it. you have to know ALL those exact transactions ahead of time to derive the script and then the address. someone sending to that address has to agree that those conditions are OK before doing it. it's incredibly restrictive to be the absolute bare minimum covenant proposal to be as simple as possible to understand and use to appease people.\n\nthere are no such things as wallets or wallet ids as far as the blockchain or op codes are concerned\n\nif you do not agree to a covenant, don't send. agreeing to send to an address you don't fully control, like that needs a cosignature from NSA for every spend, is on user. before you call something \\*your\\* coins you should know what the rules/script of that address is. every single op code and script's job is to restrict how it can be spent which is what makes things secure, not restrict fungibility.\n\nthe moment you send coins to another address, that means another script that derives to that address, that's it, it's controlled by that other script now\n\nwe have known about this BIP for 2 years, there was literally AMA on this subreddit 2 years ago about this BIP.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7bsamw",
                    "author": "creatiiive7",
                    "score": 4,
                    "created_utc": 1651690506.0,
                    "response": "I should run a node :/",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7bsuz7",
                            "author": "Lazy-Substance-5161",
                            "score": 3,
                            "created_utc": 1651690726.0,
                            "response": "You should! But effectively i thought i had some sort of 'voice' with my node besides syncing the blockchain. Turns out i can't do anything against BIP119. I'm still pretty new but hey, i think a lot of people think they can signal approvals/denials for updates - but they can't. I still don't understand cthe consensus. Right now it seems the consensus consists of sentiment between devs and general sentiment. But who can decide effectively? I thought i can with my node. But i can't. Please help.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7bwtvg",
                                    "author": "DlLDO_BAGGlNZ",
                                    "score": 9,
                                    "created_utc": 1651692288.0,
                                    "response": "You get to choose what bitcoin software that you want to run when you're running your own node. You can choose not to run a version of the bitcoin software that has implemented BIP119. But BIP119 isn't even going to get merged into Bitcoin Core. So I don't know what you're worried about. It seems that a bunch of people got you all worked up over nothing. Jeremy Rubin said that he isn't going to release his own client. And not very many people would run it even if he did.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i7csd2f",
                    "author": "MrRGnome",
                    "score": 8,
                    "created_utc": 1651704827.0,
                    "response": "The BIP is perfectly clear. Have you tried reading it?\n\nI say this as someone who isn't entirely onboard with CTV - the lot of you are embarrassing. It seems the vast majority of the users here would rather operate on fear and speculation than literacy. We've even got shitcoiner assholes like Andreas spreading misinformation because he - like all influencers - also refuses to read the BIP.\n\nWe will never be self sovereign protocol users if you don't START READING THE TECHNICAL INFORMATION. READ. THE. BIP.\n\nhttps://github.com/bitcoin/bips/blob/master/bip-0119.mediawiki\n\nAnd please, lets also separate the BIP from any given activation method. They aren't the same thing.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7da70o",
                            "author": "fasulo_",
                            "score": 3,
                            "created_utc": 1651712796.0,
                            "response": "To be fair, I don’t know *how* to read",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7cbjc6",
                    "author": "Independent-Snow-129",
                    "score": 4,
                    "created_utc": 1651697997.0,
                    "response": "In bitcoin, you connect to which ever version of the software you like to.  It is backward compatible.  I'm not a high level programmer/reviewer but I still try to review on my own the BIP's and see If there's anything alarming.\n\nHere's the alarming/questionable aspects :\n\n\\-Not backward compatible\n\n\\-spend script unavailable\n\n\\- Could remove the p2p aspect\n\n\\-RIPEMD160 removed ( relying only on sha256)\n\n\\- securities risk\n\n\\-BSD License clause-3 ( Bitcoin white paper has the MIT License)\n\n(\"These two licenses are very similar, with the key exception of the BSD 3’s non-endorsement clause, which prohibits promotion of any derived work using the name of the license or its authors. In addition, the language of the MIT License is simpler and shorter\").",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uigzyw",
            "title": "Bitcoin wave by Yellow AKA @ICOffenderII",
            "url": "https://v.redd.it/19h6pm801jx81",
            "author": "CoinCorner_Sam",
            "created_utc": 1651699492.0,
            "score": 43,
            "num_comments": 9,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i7d0w29",
                    "author": "patoshinakamoto",
                    "score": 5,
                    "created_utc": 1651708674.0,
                    "response": "Beautiful!\n\nBut Bloved????",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7cwlzx",
                    "author": "fasulo_",
                    "score": 4,
                    "created_utc": 1651706756.0,
                    "response": "Maybe the symbol for Bitcoin shouldn’t be something crashing",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uidma6",
            "title": "FUCK BANKS",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uidma6/fuck_banks/",
            "author": "slvbtc",
            "created_utc": 1651690177.0,
            "score": 40,
            "num_comments": 15,
            "subreddit": "Bitcoin",
            "selftext": "More specifically fuck financial intermediaries!\n\nFinance is just as important to human civilization as language! Free speech and free finance are the same thing!",
            "stickied": false,
            "comments": [
                {
                    "id": "i7c0z99",
                    "author": "Nappingspider",
                    "score": 7,
                    "created_utc": 1651693895.0,
                    "response": "Is where I go to deposit my fucks.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uicndq",
            "title": "Binance given green light for France operation with creation of 250 jobs",
            "url": "https://www.cityam.com/binance-given-green-light-for-france-operation-with-creation-of-250-jobs/",
            "author": "EVERWILDOUTDOORS",
            "created_utc": 1651687492.0,
            "score": 16,
            "num_comments": 2,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": []
        },
        {
            "id": "uifmzk",
            "title": "Are Coinjoins risky?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uifmzk/are_coinjoins_risky/",
            "author": "Zil82Leilt1O",
            "created_utc": 1651695691.0,
            "score": 3,
            "num_comments": 14,
            "subreddit": "Bitcoin",
            "selftext": "I'd like to explore anonnymizing my Bitcoin. It has been purchased through KYC exchanges up to this point. How risky is it to coinjoin. Just for example let's say I have 0.4 Bitcoin. If I coinjoin and need to sell will I have any problems using a standard exchange like Kraken, Coinbase, or Gemini.",
            "stickied": false,
            "comments": [
                {
                    "id": "i7c64dm",
                    "author": "DudeIncogneto",
                    "score": 5,
                    "created_utc": 1651695896.0,
                    "response": "Use a trustless one, Sparrow on desktop, Samourai on android or Joinmarket if you have the technical ability. Exchanges generally look back 1 hop and I don't believe any of those three exchanges blacklist coinjoined utxos",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7c7fuk",
                    "author": "sepharose",
                    "score": 3,
                    "created_utc": 1651696410.0,
                    "response": "Not risky in the aspect that coinjoin coordinators cannot steal your coins. If you're concerned about sending to an exchange that may blacklist coinjoined outputs, you may have to send coins to your own addresses a couple times to put the coinjoin several hops back before sending to an exchange.",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uijimr",
            "title": "Bitstamp BLOCKED my account because I'm from Russia!?",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uijimr/bitstamp_blocked_my_account_because_im_from_russia/",
            "author": "jb64w",
            "created_utc": 1651706717.0,
            "score": 508,
            "num_comments": 607,
            "subreddit": "Bitcoin",
            "selftext": " Sorry if I posted in the wrong section, but I don't know where else to post. I already wrote in the Bitstamp thread, but the post was blocked without comments.\n\nSo 2 weeks ago I saw that my account is blocked, they don't let me trade and also withdraw my funds. I wrote to their support and here is their reply - \" in the light of the current events in Ukraine and the consequent regulatory directives, we’ve been required to disable your account’s deposit, trading and withdrawal options\"\n\nI asked for an official notice that all Russian citizens should be blocked, without the possibility of withdrawal.\n\nI am a simple person, not connected in any way and not supporting the war in Ukraine. I created an account in 2019, verified it, confirmed the legal origin of the funds.\n\nAnd now the exchange just wants to appropriate my money, referring to what is happening in Ukraine.\n\n[u/BitStampOfficial](https://www.reddit.com/u/BitStampOfficial/) I ask you to provide legal notice on what basis you completely blocked my account, as well as many other accounts from Russia.\n\nWhy is no other exchange taking measures like yours?? Two weeks later, your support team cannot give me an answer, but is just playing for time. **TICKET #BIT-1438832**\n\nI really hope that you are mistaken and the reliability of the oldest European stock exchange is beyond doubt.\n\n&#x200B;\n\nhttps://preview.redd.it/nkj7hoefmjx81.jpg?width=1580&format=pjpg&auto=webp&s=a8059f5d04b1912fb2709cd586cfff2c814c05c0",
            "stickied": false,
            "comments": [
                {
                    "id": "i7cwzz8",
                    "author": "apppppppbcppppppa-dc",
                    "score": 658,
                    "created_utc": 1651706929.0,
                    "response": "Always remember folks: not your keys, not your coins!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7fyljq",
                            "author": "tskinz201",
                            "score": 12,
                            "created_utc": 1651767844.0,
                            "response": "Not your monkeys not your circus",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i7dt10u",
                            "author": "Icy_Letter_6636",
                            "score": 37,
                            "created_utc": 1651721673.0,
                            "response": "came to say this too!",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i7d6m04",
                            "author": "L0ckeandDemosthenes",
                            "score": 21,
                            "created_utc": 1651711220.0,
                            "response": "Came to say this.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7ev0ix",
                                    "author": "tookthisusersoucant",
                                    "score": 18,
                                    "created_utc": 1651749835.0,
                                    "response": "Then you're an arse.\n\nIt's true, but there's no need to gloat. At least offer something useful or consoling with it.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i7eziic",
                                            "author": "DivineFlamingo",
                                            "score": 8,
                                            "created_utc": 1651752572.0,
                                            "response": "Nah not really. If you want sunshine and rainbows go outside.  The world doesn’t need to cater to your need for special treatment.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i7f0jh1",
                                                    "author": "alan-the-all-seeing",
                                                    "score": 29,
                                                    "created_utc": 1651753152.0,
                                                    "response": "‘special treatment’?\n\nnot gloating and enjoying someone’s misfortune is special treatment?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i7fos7g",
                                                            "author": "ShortBusDoorGunner",
                                                            "score": 11,
                                                            "created_utc": 1651763995.0,
                                                            "response": "These people remind me of the idiots on videogame forums that go into a 'Boss XXX keeps kicking my ass! Help!' forum just to say 'I don't understand the problem. I beat Boss XXX with a toothpick and wet Kleenex'.\n\nCompletely unhelpful chest thumping.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i7dx8ga",
                    "author": "donaudelta",
                    "score": 111,
                    "created_utc": 1651723921.0,
                    "response": "Dear OP, many have stated in the past that those centralized exchanges are almost banks. They comply with government regulations. Next time choose carefully. Crypto was meant to be money P2P. You did trade and expected gains. That's what ppl do on exchanges, usually. You'll recover, maybe. Be informed. Don't be sheep. Setup cold wallets. Keep your crypto on them. Read the news. DYOR.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7eh1yi",
                            "author": "Lucky-Fee2388",
                            "score": 24,
                            "created_utc": 1651738468.0,
                            "response": ">Dear OP, many have stated in the past that those centralized exchanges are ~~almost~~ **worse than** banks.\n\nTIFIFY!  :)",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7ehkdj",
                                    "author": "huckingfoes",
                                    "score": 13,
                                    "created_utc": 1651738932.0,
                                    "response": "100% correct",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i7fqlv1",
                            "author": "Humble_Inflation1466",
                            "score": 3,
                            "created_utc": 1651764714.0,
                            "response": "Generally Bitcoin exchanges are under more scrutinity than banks, since regulators are taking extra huge piss on them. Banks are way less likely to freeze your accounts etc, as regulators are used to them,",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7d9fiq",
                    "author": "drinkingkindasucks",
                    "score": 85,
                    "created_utc": 1651712460.0,
                    "response": "Every time I tell people to get their coins off the exchange, people call me paranoid.\n\nThis is why. Exchanges are all risk and no upside.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7dtyrr",
                            "author": "laughncow",
                            "score": 21,
                            "created_utc": 1651722164.0,
                            "response": "For sure people think we are the lunatic and think no one would ever take their coins lol until they do .  Just like people don’t fight for privacy",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i7e9tuc",
                            "author": "huewutm8",
                            "score": 5,
                            "created_utc": 1651732354.0,
                            "response": "All risk and no reward is totally incorrect.  I don't trust exchanges,  been around the crypto scene since mnt gox. I buy and take off the exchange asap. My best buddy who makes in a week what I do in a year,  has made more than I'm worth in rewards.  Their is risk and reward keeping on exchanges",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7edreo",
                                    "author": "Trifusi0n",
                                    "score": 6,
                                    "created_utc": 1651735550.0,
                                    "response": "Yes, exactly this. Some exchanges (definitely not all) can get you some yield by lending out your coins. You can debate the pros and cons of this all day, but you can’t deny that being paid additional Bitcoin is definitely an upside.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i7ee1hv",
                    "author": "bigLeafTree",
                    "score": 42,
                    "created_utc": 1651735790.0,
                    "response": "Not trying to blame you and obviously your funds shouldn't be locked, but I am curious on why you didnt withdraw when you could. That Russians were going to be sanctioned was announced weeks before it happened. I guess you have low balances and you didnt mind at that time?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7eze37",
                            "author": "jb64w",
                            "score": 22,
                            "created_utc": 1651752500.0,
                            "response": "Balance is very significant for me. No other exchange has introduced such measures. I thought that if this is a European exchange, then they must comply with the laws. Their website says that they will warn about restrictions, but they did not. It looks like they are just taking advantage of the situation to take my money.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7fqkk3",
                                    "author": "Rokey76",
                                    "score": 16,
                                    "created_utc": 1651764699.0,
                                    "response": "Yeah, if it is a European exchange your money has been sanctioned by the EU. They are following the laws that they wrote. Your coins will be there when the sanctions are lifted, so maybe 10 years?  \n\n\nhttps://www.reuters.com/business/finance/eu-targets-crypto-wallets-latest-round-russia-sanctions-2022-04-08/",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i7g1k4z",
                                            "author": "Demrezel",
                                            "score": 14,
                                            "created_utc": 1651769281.0,
                                            "response": "The EU is just helping you HODL... very long term",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i7f845t",
                                    "author": "hammertime1278",
                                    "score": 6,
                                    "created_utc": 1651756968.0,
                                    "response": "I'm sorry for you. Bitstamp is one of the most shitty exchanges I know.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i7fa96k",
                                            "author": "phlogistonical",
                                            "score": 6,
                                            "created_utc": 1651757951.0,
                                            "response": "It is also one of the oldest and I think they deserve some credit for not having been hacked in all this time.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i7frtq2",
                                                    "author": "devak414",
                                                    "score": 3,
                                                    "created_utc": 1651765196.0,
                                                    "response": "Bitstamp was in 2015, hacked for about 5million USD.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i7dxqf1",
                    "author": "orbofdeception",
                    "score": 95,
                    "created_utc": 1651724198.0,
                    "response": "WAR WHAT IS IT GOOD FOR? ABSOLUTELY NOTHING",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7eh05d",
                            "author": "I_Has_A_Hat",
                            "score": 58,
                            "created_utc": 1651738423.0,
                            "response": ">WAR WHAT IS IT GOOD FOR? \n\nSTIMULATING WEAPONS MANUFACTURING BASED INDUSTRY AND FUNNELING BILLIONS OF DOLLARS TO OLIGARCHS AT THE EXPENSE OF THE COMMON MAN!\n\nHUH!\n\nGOOD GOD!",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i7eex73",
                            "author": "NckyDC",
                            "score": 11,
                            "created_utc": 1651736554.0,
                            "response": "Say it again",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i7e8i9f",
                            "author": "blinkgendary182",
                            "score": 6,
                            "created_utc": 1651731342.0,
                            "response": "Elaine!!",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i7ee67j",
                            "author": "gaymerRaver",
                            "score": 20,
                            "created_utc": 1651735905.0,
                            "response": "Unfortunately they need to blame their government. I don’t sympathise. Coming onto Reddit, as if anyone here can do anything.    \n      \nMove to a country that isn’t Russia if you want to use Western services.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7eez24",
                                    "author": "Ok_Barracuda_6080",
                                    "score": 6,
                                    "created_utc": 1651736601.0,
                                    "response": "Why does he wants to use eu exchange services? He can use Chinese exchange if he wants. \nThere are ton of them. \n\nBlaming other country is like, Biden blaming Russians cause of inflation.\nEverybody did their choice.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i7ei7rw",
                                            "author": "RUSSIAN_FSB_BLYAT",
                                            "score": 17,
                                            "created_utc": 1651739529.0,
                                            "response": "He’s saying they still have his money and won’t let him withdraw it. They stole is money essentially.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i7ek6zy",
                                                    "author": "Ok_Barracuda_6080",
                                                    "score": 3,
                                                    "created_utc": 1651741305.0,
                                                    "response": "Im saying; everybody knew what EU or US can do (possibility to ban Russian holders). And this guy, left his savings in a foreign exchange!!! ( guys, don’t leave money in exchanges!!! )\nNow he knows. Will be smarter.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i7enl3n",
                    "author": "jesseb0rn",
                    "score": 31,
                    "created_utc": 1651744280.0,
                    "response": "Its called sanctions",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7czzls",
                    "author": "peterisnothere",
                    "score": 87,
                    "created_utc": 1651708272.0,
                    "response": "Judging by their sub-reddit, lots of people have problems with their funds frozen and in their case it's not even related to Russia or Russian citizenship. Everyone should probably avoid using their company's services.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7eewz4",
                            "author": "sgtslaughterTV",
                            "score": 17,
                            "created_utc": 1651736548.0,
                            "response": "There's a devil's advocate within me that says a lot of those posts are from people pretending they've done nothing wrong or people who believe they've done nothing wrong but somehow became implicated in illegal activity like mules.                 \n\nI'm not saying that's **everyone** in that subreddit though. I never worked at a centralized exchange before.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i7ek2kg",
                            "author": "NYKNYb",
                            "score": 5,
                            "created_utc": 1651741202.0,
                            "response": "> their funds\n\nNot their keys, not their funds. Literally.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7czxrj",
                    "author": "Nada_Lives",
                    "score": 100,
                    "created_utc": 1651708249.0,
                    "response": "I imagine everything about Russia is now blocked. War is hell. It's not the people's fault, but you (and Ukraine) are the ones who suffer.\n\nIt is not Bitcoin that is blocked, or affected. It is your Bitstamp account that is blocked. Bitstamp is not a part of Bitcoin, but rather an exchange franchised  by the FED.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7eo7uy",
                            "author": "danger89",
                            "score": 11,
                            "created_utc": 1651744814.0,
                            "response": "It's the fault of leaders /politic.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i7ed7i7",
                            "author": "manygatos",
                            "score": 4,
                            "created_utc": 1651735078.0,
                            "response": "Anyone in Russia with a Xbox or PlayStation care to comment on digital games they purchased & download? Do they even work these days ?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7edzuq",
                                    "author": "leonidbkh",
                                    "score": 6,
                                    "created_utc": 1651735751.0,
                                    "response": "You can download, but can’t buy anything on PS",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i7efqxv",
                            "author": "Arrival117",
                            "score": 9,
                            "created_utc": 1651737291.0,
                            "response": "This war has mass support among Russian citizens. It is a war of the people, not the government. The people want it. \n\nUkrainians suffer, Russians steal and rape.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7ehbwp",
                                    "author": "object57",
                                    "score": 12,
                                    "created_utc": 1651738721.0,
                                    "response": "It is literally a criminal offense to tell you're against a war. Of course in phone surveys everyone will support the war.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i7eiw64",
                                            "author": "Arrival117",
                                            "score": 26,
                                            "created_utc": 1651740136.0,
                                            "response": "I am from Poland. I know Russians who live here. They are all for the war. \r  \nAccording to you, the Russians who organized marches in Berlin and few other places in support of the war, driving around with \"Z\" painted on their cars, are they also afraid of being accused, if they don't even live in their own country?",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i7f4tg5",
                                            "author": "Etovia",
                                            "score": 4,
                                            "created_utc": 1651755375.0,
                                            "response": "> It is literally a criminal offense to tell you're against a war.\n\nit seems that in private calls intercepted by hackers etc, regular Russian people are very \"supportive\" of the invasion.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i7fmrwo",
                                    "author": "dakota-plaza",
                                    "score": 5,
                                    "created_utc": 1651763187.0,
                                    "response": "That's true.\n\nI am from Russia, but lucky to have dual citizenship. My goal after leaving Russia is to renounce russian citizenship because I know what the majority of Russians are.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i7ehwfv",
                                    "author": "jajabor7414",
                                    "score": 3,
                                    "created_utc": 1651739239.0,
                                    "response": "steal what from a poor country ? cringe models ?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i7eiro9",
                                            "author": "Arrival117",
                                            "score": 6,
                                            "created_utc": 1651740026.0,
                                            "response": "Russia is even poorer, so they steal whatever they can. Washing machines, phones, televisions, even toilet seats.\r  \nThe standard of living of the average Ukrainian is 10x higher than the average Russian.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i7eqrop",
                                                    "author": "cyberspace-_-",
                                                    "score": 9,
                                                    "created_utc": 1651746854.0,
                                                    "response": "Oh yeah, the standard of living of the average Ukrainian is booming at the moment.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i7ey746",
                                                    "author": "jajabor7414",
                                                    "score": 9,
                                                    "created_utc": 1651751807.0,
                                                    "response": ">The standard of living of the average Ukrainian is 10x higher than the average Russian.\n\nsomeone smoke meth today",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i7efhbe",
                    "author": "aereyy",
                    "score": 5,
                    "created_utc": 1651737050.0,
                    "response": "Its unlucky to hear that, but since you dont have it on private wallet i think there is nothing you can do imo. Its part of anti-war politics :/",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7d1yj0",
                    "author": "kryptonite-uc",
                    "score": 52,
                    "created_utc": 1651709147.0,
                    "response": "Umm I’m sorry but what did you expect? Bitcoin wasn’t created with the intention of people storing crypto on centralized exchanges. You shouldn’t store large amounts of funds there. I doubt there is little legal action that would result in a quick resolution that you could take.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7d33k4",
                            "author": "LoneWolfSpartan",
                            "score": 19,
                            "created_utc": 1651709667.0,
                            "response": "Transfer all my crypto to my ledger ASAP",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7e22sy",
                                    "author": "ShoelessMoose",
                                    "score": 6,
                                    "created_utc": 1651726833.0,
                                    "response": "Done, anything else?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i7e65a8",
                    "author": "RobinHood553",
                    "score": 36,
                    "created_utc": 1651729609.0,
                    "response": "Not your keys, not your coins.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7exjrg",
                            "author": "TheUnstoppableBTC",
                            "score": 8,
                            "created_utc": 1651751418.0,
                            "response": "Lost count of how many times this simple message has been berated, mocked and ignored on this very sub. \n\nDisregard it at your peril. Nobody ever seems to see it coming.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7eztry",
                                    "author": "PrognosticalSon",
                                    "score": 3,
                                    "created_utc": 1651752752.0,
                                    "response": "It won't happen to me mentality",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i7de3ai",
                    "author": "forthetendies",
                    "score": 25,
                    "created_utc": 1651714545.0,
                    "response": "I want to say I feel sorry for people who bitch about exchanges STEALING from them. However if you have been on the BTC train since 2019. You where 100% warned. Don’t store bitcoin on exchanges! PERIOD!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7dzxj5",
                            "author": "MuchTemperature6776",
                            "score": 13,
                            "created_utc": 1651725478.0,
                            "response": "I only buy from exchanges and then send it to my wallet instantly after.\n\nI would never trust them to hold my money.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7e6skv",
                                    "author": "ElephantsAreHeavy",
                                    "score": 3,
                                    "created_utc": 1651730072.0,
                                    "response": "Ditto",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i7ecvdi",
                    "author": "P13453D0nt84nM3",
                    "score": 25,
                    "created_utc": 1651734797.0,
                    "response": "Perhaps go and protest to your government about what your people are doing. I’m glad their putting the pressure on you all. It’s your country, do something.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7g2aae",
                            "author": "omgcoin",
                            "score": 4,
                            "created_utc": 1651769597.0,
                            "response": "> **your country**\n\nStatist buffoons who has absolutely no idea where Bitcoin is coming from (crypto anarchy).\n\nCollectivists like you are unable to see the difference between CBDC and Bitcoin.\n\nDo you even realise that the very existence of Bitcoin is a solution to failed democratic nation state? (if it wasn't a failure, then you should stick with democratically elected fiat system and shit like that)",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7efzgs",
                    "author": "james-escrow",
                    "score": 18,
                    "created_utc": 1651737502.0,
                    "response": "In russia they say not your vodka not your drink 😂",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7emxwa",
                            "author": "inevitable_username",
                            "score": 6,
                            "created_utc": 1651743733.0,
                            "response": "*not your vodka, not your headache",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7e2z1u",
                    "author": "skywardsmiles",
                    "score": 13,
                    "created_utc": 1651727424.0,
                    "response": "They kept bugging me every week to re-enable and re-KYC my account which I opened in 2014, even pestering me with a $25 gift for the time and effort. No thanks. I'm sticking to that golden rule: not your keys, not your coins.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7ekfps",
                    "author": "7ootles",
                    "score": 31,
                    "created_utc": 1651741515.0,
                    "response": "So write to Putin and tell him to stop the war.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7exg6o",
                            "author": "samsteiner",
                            "score": 14,
                            "created_utc": 1651751358.0,
                            "response": "This. The “simple people\" are also co-responsible for their leaders and this war. Complain to Putin, not Reddit.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7feuif",
                                    "author": "bfire123",
                                    "score": 4,
                                    "created_utc": 1651759958.0,
                                    "response": "Exactly. \n\nYou are not allowed to be apolitcal in a time of unjust politics.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i7dnn7f",
                    "author": "Character_Body_2810",
                    "score": 47,
                    "created_utc": 1651718966.0,
                    "response": "They want you to get pissed off and overthrow Putin. We would really appreciate it if you did. Kill Putin get your bitcoin back. Good deal?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7edf98",
                            "author": "james3douglas",
                            "score": 7,
                            "created_utc": 1651735257.0,
                            "response": "HAHA, i would love to listen this from their customer team support.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i7e9hwl",
                            "author": "vikarti_anatra",
                            "score": 6,
                            "created_utc": 1651732092.0,
                            "response": "So you say if he kills Putin and provide his head he will get his bitcoins back without any additional conditions on him or Russia?(Conditions like surrender Ukraine/Crimea, limit size of Russian army, sell gas at prices EU want,etc)?\n\nI somehow don't think that's likely.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7eq24z",
                                    "author": "mattferg222",
                                    "score": 7,
                                    "created_utc": 1651746302.0,
                                    "response": "Surrender Ukraine/Crimea? You mean remove occupying forces from internationally recognised Ukraine?",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i7e9kdh",
                                    "author": "Character_Body_2810",
                                    "score": 5,
                                    "created_utc": 1651732145.0,
                                    "response": "It’s certainly worth a try. Honestly if he did it personally I’m sure he would get even more bitcoin than he had to start with.\n\nEdit:shit I would donate a few sats to the guy who presented putins head on a platter",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i7egq28",
                            "author": "bbasara007",
                            "score": 4,
                            "created_utc": 1651738168.0,
                            "response": "for what? invading another nation? How many nations has america and the west invaded the past 20 years and left in catastrophe?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7eofin",
                                    "author": "AU_is_better",
                                    "score": 3,
                                    "created_utc": 1651744986.0,
                                    "response": "How many have been forcibly made a part of the United States?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i7d2sc8",
                    "author": "LoneWolfSpartan",
                    "score": 17,
                    "created_utc": 1651709527.0,
                    "response": "This is why you get a wallet",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7e0r8f",
                    "author": "Public-Gap4804",
                    "score": 8,
                    "created_utc": 1651725988.0,
                    "response": "Buy and withdraw to cold wallet. Make it a tradition.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7ek1b9",
                    "author": "NYKNYb",
                    "score": 3,
                    "created_utc": 1651741171.0,
                    "response": "It sucks for you but seriously, NYKNYC.\n\nHow does hodling in cold storage look now? Not too bad I bet.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7f22ba",
                    "author": "Cricketdogeorgy",
                    "score": 3,
                    "created_utc": 1651753974.0,
                    "response": "When are people gonna learn not to keep crypto on exchanges",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7f7k9p",
                    "author": "stalkmyusername",
                    "score": 3,
                    "created_utc": 1651756713.0,
                    "response": "Well your mistake was being russian\n\n&#x200B;\n\n/s",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7fcb2n",
                    "author": "iamjide91",
                    "score": 3,
                    "created_utc": 1651758865.0,
                    "response": "I'm sorry mate. Shit happens with these exchanges. It can be very annoying. I hope it gets resolved soon.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7fdmqg",
                    "author": "cubic81",
                    "score": 3,
                    "created_utc": 1651759437.0,
                    "response": "Binance did the same with Russian oligarch accounts. If you ain’t one, courage!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7ejku7",
                    "author": "cannabinero",
                    "score": 9,
                    "created_utc": 1651740759.0,
                    "response": "The moment the world started to start the embargo and punish the russian civilians, you should have known. Not your keys, not your coins.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7dqqne",
                    "author": "escap0",
                    "score": 14,
                    "created_utc": 1651720489.0,
                    "response": "Your account and the crypto in it still belongs to you.  They just lifted your ability to use it because of sanctions.  Once sanctions are lifted you will be back in business.  The key words in that statement are: “regulatory partners”. aka, the government.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7edqyk",
                            "author": "maxcoiner",
                            "score": 15,
                            "created_utc": 1651735539.0,
                            "response": "Once sanctions are *lifted*? \n\nCuba would like to have a word with you, sir.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i7eez4s",
                            "author": "nikolaikov",
                            "score": 4,
                            "created_utc": 1651736603.0,
                            "response": "Yes, this is the OP account and the crypto in this also belongs to him, but what if he was a trader and want to do that,\n\nHe will not able to do that, this is why i would say use any good wallet rather than the exchanges.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7f9xps",
                    "author": "UncleJulian",
                    "score": 6,
                    "created_utc": 1651757804.0,
                    "response": "Unfortunately, the people of Russia will be paying for their leaders actions :(.  Sorry OP",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7e3mzb",
                    "author": "Bloodsport121",
                    "score": 19,
                    "created_utc": 1651727871.0,
                    "response": "you do bear some responsibility for Putin remaining in power.\n\nyou are from Russia. Russia is committing war crimes. Russians should suffer for what their economy, military, and geopolitics has brought on the people of Ukraine.\n\nI agree that you are personally innocent and not a criminal but you as part of the russian collective should not be able to threaten nuclear war and commit crimes on humanity while still accessing the rest of the world's services and goods.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7e6w3v",
                            "author": "Sasha-Starets",
                            "score": 6,
                            "created_utc": 1651730144.0,
                            "response": "Should American citizens collectively suffer for what America did in Iraq and elsewhere? Collective punishment is the thinking of racists.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7eac9v",
                                    "author": "adamsky1997",
                                    "score": 3,
                                    "created_utc": 1651732752.0,
                                    "response": "They already do. Take a trip to Iran, hun",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i7dctw4",
                    "author": "ShinTsuki08",
                    "score": 12,
                    "created_utc": 1651713973.0,
                    "response": "War frequently involves the suspension of the usual legal rights and due process.\n\nThe violence of the war may be far from you, but the effects of it are on your doorstep.  The loss of things you hold dear, unfortunately such is war.  Financial things are not the lost things to lament the most.  You may even get access back in a few years.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7ec8ld",
                    "author": "IWantToBeSimplyMe",
                    "score": 14,
                    "created_utc": 1651734268.0,
                    "response": "Sanctions, bitch!! Don’t let your fucking president be an asshat.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7eup0w",
                            "author": "StuzaTheGreat",
                            "score": 4,
                            "created_utc": 1651749627.0,
                            "response": "\"asshat\", I think, is a bit... polite?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7ehqpl",
                    "author": "rundown03",
                    "score": 10,
                    "created_utc": 1651739095.0,
                    "response": "There are sanctions for a reason. Maybe you all will know now what's really going on and how the world thinks of Russia right now. Just means that it's hurting you and working as intended.  \n\n\n\\#sorrynotsorry",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7dosvu",
                    "author": "RatRaceRunner",
                    "score": 23,
                    "created_utc": 1651719513.0,
                    "response": "Take it up with Putin. It's up to your government to resolve this. Are they acting now in your best interest?\n\nAnd you'd have the exact same issue trying to move fiat in traditional international bank accounts to/from your Russian account(s) right now as well.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7eqr9z",
                            "author": "lestatgyry",
                            "score": 3,
                            "created_utc": 1651746845.0,
                            "response": "Putin more focus in winning the war rather than the crypto portfolio.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7dw4ar",
                    "author": "that1rowdyracer",
                    "score": 13,
                    "created_utc": 1651723313.0,
                    "response": "NGL that's funny AF. Did you not think you're country getting sanctions wasn't going to impact you?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7djm8x",
                    "author": "Life_Airline_6767",
                    "score": 9,
                    "created_utc": 1651717059.0,
                    "response": "Yes that’s the sanctions. \nEvery large company has canceled services in Russia due to the slaughtering of innocent civilians. That is what caused the war. How much money did you have in account?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7dwost",
                    "author": "Al-Bundy-607",
                    "score": 8,
                    "created_utc": 1651723618.0,
                    "response": "Three months when war started, new sanctions every week and you didn’t get a message?\nAsk for Vlad what to do, he seems like ok guy👎",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7dx2tv",
                            "author": "LineOwn8201",
                            "score": 3,
                            "created_utc": 1651723836.0,
                            "response": "Очень странный спикер, он же вкурсе что нехера хранить бабки на бирже, боже мой. Жёсткий сад и если честно, так ему и надо.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7dprts",
                    "author": "Theironchurch",
                    "score": 11,
                    "created_utc": 1651719996.0,
                    "response": "That's the point of sanctions... and public pressure.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7e6prr",
                    "author": "wen_mars",
                    "score": 5,
                    "created_utc": 1651730015.0,
                    "response": "You are collateral damage in a war you didn't ask for. As much as it sucks for you, it sucks a lot more for Ukrainians who had their houses destroyed and family members raped/murdered/abducted. The sooner the war ends and Putin is hanged/impaled/waterboarded, the sooner you will get your money back.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7ebnqm",
                    "author": "cryptohacker_media",
                    "score": 4,
                    "created_utc": 1651733808.0,
                    "response": "Firstly, most people here are quite right - you should have chosen a cold wallet, or at least a non-custodial wallet. Crypto exchanges are only good for buying and selling, not keeping your tokens. Because if you don't own keys, you don't own crypto.\n\nBut the second thing is the sanctions against Russia are supposed to show Russians that they have made some bad choices in the past. Having bloody Putin as their leader is a direct way to hell. And you can soon end up losing much more that just your BTC.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7dsjc5",
                    "author": "CashMaster76",
                    "score": 11,
                    "created_utc": 1651721419.0,
                    "response": "Time to take to the streets and oust your government.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7e8mha",
                            "author": "the-jade-rabbit",
                            "score": 3,
                            "created_utc": 1651731429.0,
                            "response": "Time for you to go and fight for Ukraine. Do you think you are exempt just because you didn't happen to be born there? Otherwise you're a hypocrite for suggesting OP takes a similar action.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7f30fr",
                    "author": "GingerSnapBiscuit",
                    "score": 3,
                    "created_utc": 1651754469.0,
                    "response": "Due to the sanctions against your cou try at the moment it's possible that them letting you withdraw your funds would be a breach of international law.\n\nI know I wouldn't chance it if I were in charge of the wallet.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7ebt93",
                    "author": "badjano",
                    "score": 6,
                    "created_utc": 1651733931.0,
                    "response": "Kinda off topic, but who did you vote for last election?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7e45kw",
                    "author": "Lord_DF",
                    "score": 4,
                    "created_utc": 1651728218.0,
                    "response": "Da. They did.\n\n\"I'm a simple person.\"\n\nJudging from the political decisions, many of your comrades are.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7de8ca",
                    "author": "Justspeakingfacts",
                    "score": 7,
                    "created_utc": 1651714609.0,
                    "response": "Provide legal notice lmao? Who do you think you are?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7dif0l",
                            "author": "SaratogaChase",
                            "score": 9,
                            "created_utc": 1651716497.0,
                            "response": "Russian",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7dnt0o",
                    "author": "SkeeterBeaver",
                    "score": 5,
                    "created_utc": 1651719041.0,
                    "response": "Better call Putin and tell him to get his shit together so you can get your rubles!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7e0o4k",
                    "author": "dunnolol123",
                    "score": 7,
                    "created_utc": 1651725934.0,
                    "response": "Have you been living under a rock lmao? If you're Russian you're getting blocked on everything right now. \n\nMaybe committing war crimes isn't the best idea. Also doesn't help that the guy committing them has an approval rating afterward of 86% from its citizens.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7e9dud",
                            "author": "Character_Body_2810",
                            "score": 3,
                            "created_utc": 1651732006.0,
                            "response": "Agreed. Get that approval rating down, then you can access the worlds services again",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7drflu",
                    "author": "Crypto_bro999",
                    "score": 5,
                    "created_utc": 1651720843.0,
                    "response": "What the fuck guys. I hate these fucking platforms. The whole idea of bitcoin is freedom. That's why I only use bitfinex cos they don't support all these blocks.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7e0klv",
                    "author": "TalesfromtheCrypt138",
                    "score": 6,
                    "created_utc": 1651725873.0,
                    "response": "Jesus Christ. Sorry dude. Our world is upside down and ran by clowns.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7dv456",
                    "author": "CaptnBlast3d",
                    "score": 4,
                    "created_utc": 1651722771.0,
                    "response": "AS THEY SHOULD",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7e24m2",
                            "author": "SabreToothGaming",
                            "score": 3,
                            "created_utc": 1651726866.0,
                            "response": "Why? Why should every day citizens lose their savings because of something political and economic oligarchs decided on? You just think the general populace should suffer because of government decisions? Are you for or against decentralisation at this point? Your comment indicates the latter.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7e96yb",
                    "author": "Careanon",
                    "score": 5,
                    "created_utc": 1651731856.0,
                    "response": "I feel bad for you. I’m grief stricken about what’s happening in Ukraine as well and bet there’s no way any individual citizen from ANY country including Russia feels good about it. BUT we are not the people behind the scenes, making decisions and trust me- there’s a TON of crap they’re not telling us like the TRUTH in this and every war. It’s the 1% “Elites” running the world‼️ The greed of $ is the root of all evil! Just sayin- this sounds real Fishy 🐡🐟🐠 so maybe you can find a specialist in banking law or can seek help from your countries’ attorney general or equivalent? Best of luck to you friend.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7cz7qy",
                    "author": "peterisnothere",
                    "score": 5,
                    "created_utc": 1651707922.0,
                    "response": "I guess stealing is ok now. It's not even legal probably, since I doubt you are listed in the sanctions.  This is pure discrimination based on ethnicity and citizenship.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7dpq3k",
                    "author": "cubeeless",
                    "score": 3,
                    "created_utc": 1651719971.0,
                    "response": "This is messed up. NYKNYC.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7ejcav",
                    "author": "BlackHatSlacker",
                    "score": 3,
                    "created_utc": 1651740543.0,
                    "response": "Are you actually Russian? If so blame Putin not Bitstamp. His actions affected Russians not involved in his war? Good.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7f0p65",
                            "author": "jb64w",
                            "score": 3,
                            "created_utc": 1651753239.0,
                            "response": "I agree with you. I, like many residents of Russia, do not support this war, but no one asked us whether we want it or not. And from the fact that I go out into the street with a protest, nothing will change, since there are two policemen for one person. I will be imprisoned for 15 days and will be fined. We have a police state and a lot of money is spent both on protection from outside and from our own citizens.  \nBut in this case, Bitstamp still violates the law in my opinion, because they do not make official statements.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7dts2a",
                    "author": "anajoy666",
                    "score": 4,
                    "created_utc": 1651722068.0,
                    "response": "Didn’t you get the memo? Being born within arbitrary geographical boundaries means you are personally responsible for anything an extremely powerful person also born within the same boundaries does.\n\nEDIT: thanks for the awards frens!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7doul9",
                    "author": "PoopShootBlood",
                    "score": 4,
                    "created_utc": 1651719537.0,
                    "response": "BitStamp are thief’s. \nThey have used an invasion as a reason to take your money and keep your crypto. \nBoycott BitStamp, I will not use them",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7d9f4v",
                    "author": "Geoknysis",
                    "score": 4,
                    "created_utc": 1651712455.0,
                    "response": "Fuck corpos disrupting the lives of ordinary citizens just to virtue-signal the latest 'thing'.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7d0tkv",
                    "author": "JimBloc",
                    "score": 3,
                    "created_utc": 1651708645.0,
                    "response": "Sorry to say its the way the west works, we punish the people, not the leaders, but really its all about weakening your country as a whole, so you can not help others,  or intervent to help any other country that stands up to Western expansion.\nIm sorry to say your fucked, russiaphobia is running high in Europe, UK. Free press is gone, so they can freeze anything they want.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7f1r1x",
                            "author": "rewrite-and-repeat",
                            "score": 4,
                            "created_utc": 1651753809.0,
                            "response": "\"Russiaphobia\" aka common sense based on historic experience with anything russian related.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7ecizs",
                    "author": "solomonsatoshi",
                    "score": 3,
                    "created_utc": 1651734507.0,
                    "response": "Not your keys not your Bitcoin.\n\nBully boy loser Putin needs to go.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7da87y",
                    "author": "E-renter",
                    "score": 3,
                    "created_utc": 1651712810.0,
                    "response": "> here is their reply - \" in the light of the current events in Ukraine and the consequent regulatory directives, we’ve been required to disable your account’s deposit, trading and withdrawal options\"\n\nThe woke liberal West steals other nation's foreign assets, then cries \"blackmail\" when Russia wants to be paid for their resources in their own currency so as to avoid more theft. That is the childish stupidity of the West, a toddler would understand the fallacy. In Canada they even approved seizing funds of Russian INDIVIDUALS living in Canada and guilty of no crime. This is Trudeau's version of freedom, and his loyal lapdog Jagmeet Singh and gleeful henchwoman Chrystia Freeland. Looks like Bitstamp got right on board, maybe it helps balance their fractional reserve to support the \"sanctions\". Americans and Canadians by and large support this shit. But don't seize a BIPOC/trans or you are a racist fuck! Welcome to woke liberalism, aka, fascism.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7e22v3",
                    "author": "Zenb0y",
                    "score": 4,
                    "created_utc": 1651726834.0,
                    "response": "This is awful!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7e38cq",
                    "author": "glutenfreeunicorn",
                    "score": 3,
                    "created_utc": 1651727596.0,
                    "response": "You lost control over your crypto for the time being, not your crypto permanently, big difference. Meanwhile, people in Ukraine, some of whom cared about politics as little as you do, have lost their homes and their lives. War sucks and these sanctions are being put up in order to make it stop.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7e5zjf",
                    "author": "zippygang",
                    "score": 4,
                    "created_utc": 1651729498.0,
                    "response": "A lot of ukrainians who also dont want nothing to do with war will still get killed. Russia as a whole needs to be punished.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7ekqft",
                    "author": "AbeAlrighty",
                    "score": 3,
                    "created_utc": 1651741783.0,
                    "response": "I’m happy this is happening to you. No such thing as an innocent Russian anymore. After your country kicked me from Ukraine and your country’s super high approval of the war. Go protest the war in Red Square and then you will have my sympathy. Nobody cares about you",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7f03sv",
                    "author": "Put-Alert",
                    "score": 3,
                    "created_utc": 1651752911.0,
                    "response": "I was warned weeks ago my stock exchange was haulting service in Russia.   Sorry you are in the fall out but your country obviously deserves this and needs it.  They didn't warn you and give you time to remove assets?  They may not even by law be allowed to help you, even if they want to now.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7dzziz",
                    "author": "SkavensWhiteRaven",
                    "score": 3,
                    "created_utc": 1651725512.0,
                    "response": "Putting your name and ticket number is a mistake.\n\nDel this post.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7em2jc",
                    "author": "Swansaknight",
                    "score": 3,
                    "created_utc": 1651742969.0,
                    "response": "“Fuck Russia” - the entire world",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7enzbr",
                    "author": "akhavr",
                    "score": 3,
                    "created_utc": 1651744611.0,
                    "response": "You have our deepest concern, from the entire bomb shelter in Kyiv.\n\nРусскій ваєний карабєль, іді нахуй!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7dwmpf",
                    "author": "squeezeseason",
                    "score": 3,
                    "created_utc": 1651723586.0,
                    "response": "Sorry bro, but everybody is told they have to hate russia (including corporations) or they're not politically correct or that they are bad person right now. In the USA I think we banned all russian stocks on our stock market for now.\n\n&#x200B;\n\nIronically all of the people in the USA that were \"End war in the middle east! It's not our business!\" are now \"Support Ukraine, send them money - why aren't we helping, etc\". Just something you will unfortunately have to deal with for a while probably.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7e9ibc",
                            "author": "Character_Body_2810",
                            "score": 4,
                            "created_utc": 1651732100.0,
                            "response": "This is a pretty straight forward act of aggression. Totally unjustified, the US is wrong a lot too but it’s rarely this cut and dry. The media has an agenda yes but just as often the obviously real situation is actually a real situation.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "uig3b6",
            "title": "Forked over 380,000 BTC to to the US government to reduce sentence from 40 to 10 years",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uig3b6/forked_over_380000_btc_to_to_the_us_government_to/",
            "author": "Cussi2021",
            "created_utc": 1651696970.0,
            "score": 1462,
            "num_comments": 206,
            "subreddit": "Bitcoin",
            "selftext": "By 2013, Slomp had made 380,000 Bitcoin, valued at €3 million (£2.6 million) at the time. According to court documents, he sold about 104 kilograms of MDMA, 566,000 ecstasy pills, four kilograms of cocaine and “substantial quantities” of amphetamine, LSD, weed, ketamine and Xanax on the dark web website \"Silk Road\". He was sentenced to 40 years in prison, but got a reduction after handing over his Bitcoin stash. People often remind him they could be worth billions now, but he always thought his freedom was more important. “What’s the use of having a few hundred million euros if you’re in prison?” he said.\n\nBTC current price 39,800 x 380,000 = 15.1 billion \n\nCouple of questions here...\n\nWhat does the US do with that BTC?\nAnd would you sacrifice 30 years for 15 billion?",
            "stickied": false,
            "comments": [
                {
                    "id": "i7cm3sd",
                    "author": "Boss-Lumberjack",
                    "score": 410,
                    "created_utc": 1651702165.0,
                    "response": "Time is infinitely more valuable than money.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7e96ue",
                            "author": "fuzzytradr",
                            "score": 44,
                            "created_utc": 1651731853.0,
                            "response": "Ross Ulbricht concurs",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7g49re",
                                    "author": "ThrowAwaydntopnddins",
                                    "score": 3,
                                    "created_utc": 1651770403.0,
                                    "response": "i'm sure 15 billion can buy him enough favor now to get out of jail anyway. He should've kept the coins and bought his way out. \n\nOnce you're a billionaire you don't buy lawyers, you buy politicians, senators, governors, presidents and purchase their clemency and pardons. It would cost you a lot less than 380 thousand Bitcoin today. Could've probably gotten Trump to do it with a $10 million dollar donation to his charity, or about 263 Bitcoin. Hell, they were selling those pardons to friends for mere half a million dollar donations to their charity.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i7eoj35",
                            "author": "No_Discipline_7488",
                            "score": 61,
                            "created_utc": 1651745068.0,
                            "response": "First of all drugs should be legal.  The hypocrisy is fucking jaw dropping of the \"personal responsibility\" \"liberty and freedom loving culture warriors\" on the conservative right who always make it their business and always push big government to have a say on what you do with your body and what you do in the bedroom.  Fuck those asinine hypocritical bastards.  \n\nThis Bitcoin should be returned immediately and it's these corrupt politicians that should be the ones spending 40 years in federal prison for the crime of subverting democracy, liberty, and freedom.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i7e828i",
                            "author": "NearbyTurnover",
                            "score": 12,
                            "created_utc": 1651731007.0,
                            "response": "So that makes the money I got from working pretty fucking valuable. Taking that money by force is then slavery.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i7dcljf",
                            "author": "Isabela_Grace",
                            "score": 14,
                            "created_utc": 1651713870.0,
                            "response": "I’d give it to my gf, daughter, family… I’d sacrifice my time for theirs.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7egtqs",
                                    "author": "bbasara007",
                                    "score": 9,
                                    "created_utc": 1651738260.0,
                                    "response": "and then ur gf/daughter/family can suffer for 30 years knowing their loved one is in prison? you think the money wil make them feel better?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i7ekf41",
                                            "author": "Brummelhummel",
                                            "score": 8,
                                            "created_utc": 1651741500.0,
                                            "response": "Lets rephrase:\n\nI'd rather sit 30 years in prison knowing i have to do fuck all to have 15 billion in 30 years than work my ass off day by day to not even get close to that same amount in the same 30 years.\n\n\nI think my wife can understand how much better it would be for the family to sit this one out.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i7ep7nn",
                                                    "author": "IlIllIIIlIIl",
                                                    "score": 15,
                                                    "created_utc": 1651745629.0,
                                                    "response": "you my guy are delusional. 30 fucking years behind bars? if you survive that u missed so much time, im not sure if your wife would wait all that time",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i7ewb0m",
                                                            "author": "timbulance",
                                                            "score": 13,
                                                            "created_utc": 1651750663.0,
                                                            "response": "No amount of money is worth rotting in prison for 30 years.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i7dww5t",
                                    "author": "Hefty_Jicama",
                                    "score": 29,
                                    "created_utc": 1651723734.0,
                                    "response": "My wife wouldn’t allow me to do that. She’s rather have me than the money. Also my kids would be better off with me than the money. Hollywood has a lot of money and they are out of their minds",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i7ds1xf",
                                    "author": "squeezeseason",
                                    "score": 11,
                                    "created_utc": 1651721164.0,
                                    "response": "Somehow I doubt that",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i7ccq5d",
                    "author": "OldMercenary",
                    "score": 70,
                    "created_utc": 1651698450.0,
                    "response": "Like he said, what's the point of having all that money if you're spending the rest of your life in prison",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7cc3ue",
                    "author": "SmoothGoing",
                    "score": 36,
                    "created_utc": 1651698214.0,
                    "response": "USG auctions it off. Money is no good when you're too old to enjoy any of it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7e1q9x",
                    "author": "BendPutrid6237",
                    "score": 128,
                    "created_utc": 1651726607.0,
                    "response": "It looks like he's been released from prison and he's in excellent shape: u/DaLyon92x\n\nhttps://mslomp.fitbudd.com/packs",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7e78hf",
                            "author": "simplelifestyle",
                            "score": 33,
                            "created_utc": 1651730397.0,
                            "response": "Interesting! He did 7 years. This post is from 20 days ago:\n\n> It hurt on the day that I had to give it up. It was millions then (would be over a billion today), but I've never experienced 'living' like that, because once was I comfortably in the couple hundred K already, further increase of the number on my screen, didn't really mean much. Since I gave it up, I have been getting updated on the BTC price on almost a daily basis. Now it's also a sort of relief, because how I was already paranoid out of my mind with a million plus, I couldn't imagine what life is like with a billion plus.\n\nhttps://old.reddit.com/r/onions/comments/rbzhvc/supertrips_the_pablo_escobar_of_silkroad_did_7/i4qazy3/?context=3",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7f0eii",
                                    "author": "ThatOneTimeItWorked",
                                    "score": 5,
                                    "created_utc": 1651753076.0,
                                    "response": "That’s a good, honest perspective. The reality of that wealth would be stressful. A stress I’d gladly consider, but a stress none the less",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i7d3i3s",
                    "author": "thehalvo",
                    "score": 10,
                    "created_utc": 1651709846.0,
                    "response": "380,000 is the BTC that they know about",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7c9ex1",
                    "author": "rdogg320",
                    "score": 37,
                    "created_utc": 1651697189.0,
                    "response": "No because all the money in the world doesn’t give me back the 30 years i lose in a prison",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7eec62",
                            "author": "90265sbsbsbwtf",
                            "score": 7,
                            "created_utc": 1651736045.0,
                            "response": "Unless you can afford to build time travel machine when you get released",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7ex0xi",
                                    "author": "rdogg320",
                                    "score": 4,
                                    "created_utc": 1651751103.0,
                                    "response": "ayo this mf spittin",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i7cct7t",
                    "author": "Evening-Letter-2728",
                    "score": 67,
                    "created_utc": 1651698485.0,
                    "response": "So Free Ross Ulbright. He agreed to make no claim on 70,000 BTC  that were likely his. Ross is serving 2 x life sentences plus 40 years, without the possibility of parole.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7efhek",
                            "author": "CryptoCrackLord",
                            "score": 5,
                            "created_utc": 1651737051.0,
                            "response": "Just curious, did you see the details of the Ross Ulbricht case? I was very Ross sided before. But when I saw the details about how he was conducting himself….I completely changed on that.\n\nHe was trying to hire hitmen to have unhappy vendors killed and whatnot. He made payments to make it happen. We don’t know if those vendors actually were killed, they could never be identified. But the person/people he hired to kill claimed they had carried out the deed.\n\nThe thing is I don’t think this part of the story is common knowledge to people who are really into the pro Ross part of it.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7ejyce",
                                    "author": "Evening-Letter-2728",
                                    "score": 9,
                                    "created_utc": 1651741097.0,
                                    "response": "Yeah it's slightly more complex than that. It's too much to come to a definitive account of events in a Reddit post, but suffice to say there were multiple levels of allegation, counter allegation, and intrigue around the alleged murder. Which may or may not have happened after all.\n\n[https://news.bitcoin.com/silk-road-fake-murder-mystery-may-be-solved/](https://news.bitcoin.com/silk-road-fake-murder-mystery-may-be-solved/)",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i7fm9zb",
                                    "author": "statoshi",
                                    "score": 3,
                                    "created_utc": 1651762986.0,
                                    "response": "He was being blackmailed by corrupt federal agents; the \"hitmen\" were also corrupt federal agents who staged fake hits. The whole thing was a sham, which is why it was never brought up in court.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i7ca9wa",
                    "author": "NiceDoctorBeam",
                    "score": 24,
                    "created_utc": 1651697504.0,
                    "response": "> 104 kilograms of MDMA, 566,000 ecstasy pills, four kilograms of cocaine and “substantial quantities” of amphetamine, LSD, weed, ketamine and Xanax\n\n\nNow Goldman Sachs wants to hire him.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7chc2i",
                            "author": "adamsky1997",
                            "score": 15,
                            "created_utc": 1651700290.0,
                            "response": "4kg of coke... those are rookie numbers!!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7chpa0",
                                    "author": "SirSkittles111",
                                    "score": 6,
                                    "created_utc": 1651700426.0,
                                    "response": "Really surprised how little that was compared to the rest, something aint adding up lol",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i7dixqp",
                                            "author": "ccrider92",
                                            "score": 3,
                                            "created_utc": 1651716738.0,
                                            "response": "After looking at the quantities, I would say it’s because he’s “low level” dealer.  Probably sold coke by the gram on the Silk Road.  Also, Europe is known for being one of the number one producers of MDMA.  I would say 60% of his business was only MDMA/XTC, which he got dirt cheap.  The other 40% of product was probably stuff he procured,  a notch or two down the ladder so at lower profit margins, and later sold in personal amounts.  $3 million isn’t a lot when it comes to high level drug dealers.  Not knocking the guy, just giving my impression of the situation.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i7d269k",
                                    "author": "Markmanus",
                                    "score": 10,
                                    "created_utc": 1651709244.0,
                                    "response": "\"look officer, we found 200 kilo cocain in those bags...\"\n\"you mean 100 kilo?\"",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i7e2ane",
                                            "author": "TenshiS",
                                            "score": 6,
                                            "created_utc": 1651726976.0,
                                            "response": "That's what I said, 50 kilo",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i7eavu2",
                                                    "author": "Brew-Drink-Repeat",
                                                    "score": 3,
                                                    "created_utc": 1651733187.0,
                                                    "response": "Just a baggie of weed you say?",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i7dageh",
                    "author": "Argyrus777",
                    "score": 11,
                    "created_utc": 1651712913.0,
                    "response": "I’ll renegotiate 379,000 BTC for 11 year sentence 😛",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7cpvcb",
                    "author": "bertleturtleson",
                    "score": 5,
                    "created_utc": 1651703741.0,
                    "response": "Are we talking about real prison or the prison that rich people go to?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7dlsfj",
                    "author": "Bisquick_in_da_MGM",
                    "score": 5,
                    "created_utc": 1651718081.0,
                    "response": "And just like that, the US has the most BTC in the world.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7cip3r",
                    "author": "SourerDiesel",
                    "score": 6,
                    "created_utc": 1651700812.0,
                    "response": "> What does the US do with that BTC? \n\nI think they HODL it as \"evidence in an ongoing criminal investigation.\"  \n\nIt's a convenient way for the U.S. gov to cover their ass in case BTC becomes the next reserve currency without using tax dollars to actually buy BTC and without actually putting BTC in the treasury (which would show a lack of faith in the dollar and meet heavy resistance from BTC's political opposition).  Calling it \"evidence in an investigation\" gives them cover so people don't get the wrong ideas.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7e9qpm",
                            "author": "ask_for_pgp",
                            "score": 3,
                            "created_utc": 1651732284.0,
                            "response": "no. they sold it off",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "uih1m1",
            "title": "IMF is concerned by Bitcoin adoption by Central African Republic",
            "url": "https://www.bloomberg.com/news/articles/2022-05-04/bitcoin-adoption-by-central-african-republic-a-concern-imf-says",
            "author": "polloponzi",
            "created_utc": 1651699625.0,
            "score": 345,
            "num_comments": 118,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i7dqhud",
                    "author": "EuphoricBasil1",
                    "score": 89,
                    "created_utc": 1651720366.0,
                    "response": "They aren’t concerned about the people of CAR using it, they are concerned about the CAR acquiring BTC as a reserve asset to back their local currency, rather than using US treasuries as they and other countries have done in the past decades. \n\nBTC will appreciate in value over time due to its scarcity, making their reserves more valuable. US treasuries will depreciate as the USA exports its inflation to the rest of the world. \n\nAs more countries admit to holding BTC, it becomes more suitable for settlement of sovereign debts between nations. Goodbye USD. \n\nIf I was working for the IMF I’d be fuckin’ terrified",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7e8lzi",
                            "author": "IBurnWitches",
                            "score": 8,
                            "created_utc": 1651731419.0,
                            "response": "> to back their local currency\n\nCAR doesn't even control their own currency, they use the https://en.wikipedia.org/wiki/Central_African_CFA_franc",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7e8my4",
                                    "author": "WikiSummarizerBot",
                                    "score": 7,
                                    "created_utc": 1651731439.0,
                                    "response": "**[Central African CFA franc](https://en.wikipedia.org/wiki/Central_African_CFA_franc)** \n \n >The Central African CFA franc (French: franc CFA or simply franc, ISO 4217 code: XAF) is the currency of six independent states in Central Africa: Cameroon, Central African Republic, Chad, Republic of the Congo, Equatorial Guinea and Gabon. These six countries have a combined population of 55. 2 million people (as of 2020), and a combined GDP of US$113. 322 billion (as of 2020).\n \n^([ )[^(F.A.Q)](https://www.reddit.com/r/WikiSummarizer/wiki/index#wiki_f.a.q)^( | )[^(Opt Out)](https://reddit.com/message/compose?to=WikiSummarizerBot&message=OptOut&subject=OptOut)^( | )[^(Opt Out Of Subreddit)](https://np.reddit.com/r/Bitcoin/about/banned)^( | )[^(GitHub)](https://github.com/Sujal-7/WikiSummarizerBot)^( ] Downvote to remove | v1.5)",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i7f0xdj",
                                    "author": "stryker7314",
                                    "score": 5,
                                    "created_utc": 1651753364.0,
                                    "response": "Until now",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i7chkbk",
                    "author": "NiceDoctorBeam",
                    "score": 132,
                    "created_utc": 1651700376.0,
                    "response": "Good!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7dvct9",
                            "author": "IRightReelGud",
                            "score": 83,
                            "created_utc": 1651722902.0,
                            "response": "Every country that the IMF regularly fucks is now considering Bitcoin adoption.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7em6fx",
                                    "author": "myusernamem",
                                    "score": 14,
                                    "created_utc": 1651743068.0,
                                    "response": "Yeah because those countries are also thinking about future and they don't need to listen lecture from IMF, for whatever they are doing inside countries, these adoption are not going to harm anyone in future",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i7fvcwt",
                                            "author": "litetrading",
                                            "score": 3,
                                            "created_utc": 1651766575.0,
                                            "response": "I agree, IMF cannot do anything to crypto except creating FUD which is their natural job, this adoption will increase because of privacy concern among users, Bitcoin provides privacy as well",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i7f4gtq",
                                    "author": "Traditional_Boot4004",
                                    "score": 3,
                                    "created_utc": 1651755200.0,
                                    "response": "You meant… US, not IMF",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i7e7se9",
                            "author": "mumu456",
                            "score": 12,
                            "created_utc": 1651730798.0,
                            "response": "I am also happy after watching their fear towards Bitcoin, it's good to see that government is getting fear from Bitcoin which is totally decentralised and we don't need government backing for Bitcoin",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7fb86y",
                                    "author": "NiceDoctorBeam",
                                    "score": 3,
                                    "created_utc": 1651758388.0,
                                    "response": "Yes.  Still, as you drill deeper, you find that IMF is not \"government\", nor are central banks.  \n\nThe world is run by criminal bankers.  Governments/politicians are subservient to those bankers.\n\nPolitics/elections: just a big shit-show where the people pretend to pick politicians, but the politicians are mostly owned and operated by the banksters.  I picture it as a fat cat banker with two puppets, one on each hand, doing a puppet show, making the left puppet \"oppose\" the right puppt - end the end, the banker gets re-elected.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i7elva4",
                            "author": "Constant-Ad9398",
                            "score": 3,
                            "created_utc": 1651742787.0,
                            "response": "Yeah they should be",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7cfva6",
                    "author": "polloponzi",
                    "score": 40,
                    "created_utc": 1651699704.0,
                    "response": "Non paywall link: https://archive.ph/BVHqO",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7e7hul",
                            "author": "oj808oj",
                            "score": 3,
                            "created_utc": 1651730587.0,
                            "response": "thank you",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7dq79x",
                    "author": "Intelligent-Fly-1737",
                    "score": 31,
                    "created_utc": 1651720215.0,
                    "response": "They should be concerned.  First El Salvador and now Central African Republic adopt Bitcoin.  Like small pebbles at the start of the avalanche.  Goodbye IMF.  Not gonna miss you.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7eh76c",
                            "author": "assinuss",
                            "score": 3,
                            "created_utc": 1651738600.0,
                            "response": "No one is going to miss IMF,most of the countries will come further to adopt Bitcoin, let's see how it goes in future because crypto is the future of all people and decentralisation is going to work for us in the future Market",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i7f4ayg",
                            "author": "WeakLiberal",
                            "score": 3,
                            "created_utc": 1651755119.0,
                            "response": "Bitcoin only makes up 2% of El Salvador's budget\n yet the IMF is punishing them for \"gambling\"",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7cvszn",
                    "author": "HeatSeekingPanther",
                    "score": 28,
                    "created_utc": 1651706376.0,
                    "response": "Cry Harder",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7d7bw4",
                    "author": "irisuniverse",
                    "score": 102,
                    "created_utc": 1651711543.0,
                    "response": "I fucking love bitcoin. They cannot do SHIT about it for the first time in their weasely little lives, they found something they cannot stop. Fuck the IMF, enslaving developing countries for decades.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7g1geh",
                            "author": "soraxxviii",
                            "score": 3,
                            "created_utc": 1651769234.0,
                            "response": "Yes, IMF is literally hampering the development of these nations, it's all about the perception of IMF, how they see other countries, IMF is going to have bad reputation in future because of their decision",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7dbjwn",
                    "author": "johnsmit1214",
                    "score": 58,
                    "created_utc": 1651713403.0,
                    "response": "The IMF can lick my asshole.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7dwzup",
                            "author": "mrdotkom",
                            "score": 4,
                            "created_utc": 1651723792.0,
                            "response": "Our assholes*",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i7dm7fu",
                            "author": "idontspellcheckb46am",
                            "score": 10,
                            "created_utc": 1651718282.0,
                            "response": "They will actually refuse if you are African.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7db4xw",
                    "author": "1800smellya",
                    "score": 16,
                    "created_utc": 1651713214.0,
                    "response": "I’m concerned about the IMF and the money printer",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7crszp",
                    "author": "charlespax",
                    "score": 11,
                    "created_utc": 1651704577.0,
                    "response": "Good, they should be fucking terrified!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7dhpun",
                    "author": "JerryLeeDog",
                    "score": 9,
                    "created_utc": 1651716182.0,
                    "response": "Glad to hear it. \n\nPretty f#ckin sure they will be concerned with every country's decision to adopt BTC from here out. As the should be. \n\nStrap in beeches, you're going to hate the next 10 years",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7divvd",
                    "author": "Flimsy_Card8028",
                    "score": 10,
                    "created_utc": 1651716714.0,
                    "response": "The only reason I can think of for the IMF to be concerned is the CAR might be able pay all their debts so the IMF cannot collect any more yearly interest.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7cr9lc",
                    "author": "adamsky1997",
                    "score": 21,
                    "created_utc": 1651704344.0,
                    "response": "Name one good thing IMF has ever done for ordinary people, in the long run...",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7ct1ty",
                            "author": "Unhappy-Grapefruit88",
                            "score": 13,
                            "created_utc": 1651705134.0,
                            "response": "Welll…. Um… so… I think this one time they… um…",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7dqt38",
                    "author": "Scodo",
                    "score": 7,
                    "created_utc": 1651720522.0,
                    "response": "Working as intended.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7csg9x",
                    "author": "Stereo-Gito",
                    "score": 22,
                    "created_utc": 1651704866.0,
                    "response": "Get fucked IMF",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7d9q39",
                            "author": "Geoknysis",
                            "score": 4,
                            "created_utc": 1651712587.0,
                            "response": "AND rekt!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7d0njy",
                    "author": "saucedonkey",
                    "score": 6,
                    "created_utc": 1651708572.0,
                    "response": "Bitcoin isn’t concerned with the IMF. Perhaps if they consider that money isn’t exclusively fiat they’d have an easier go of it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7dqts8",
                    "author": "DatBuridansAss",
                    "score": 4,
                    "created_utc": 1651720533.0,
                    "response": "I aM Fucked",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7dt5z3",
                    "author": "Eadweard85",
                    "score": 3,
                    "created_utc": 1651721745.0,
                    "response": "How dare they put their own people before the international banking establishment?!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7e5wmz",
                    "author": "Hot_Meaning_5261",
                    "score": 4,
                    "created_utc": 1651729440.0,
                    "response": "Imf go to hell",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7cqjz8",
                    "author": "reggie_crypto",
                    "score": 7,
                    "created_utc": 1651704037.0,
                    "response": "Lol major transparency and economic policy problems. No kidding.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7dd6vy",
                    "author": "snyper-101",
                    "score": 3,
                    "created_utc": 1651714134.0,
                    "response": "Oh are they now?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7df1wk",
                    "author": "WaYYne169",
                    "score": 3,
                    "created_utc": 1651714977.0,
                    "response": "Where are the arguments IMF???",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7dvhlq",
                    "author": "Hefty_Jicama",
                    "score": 3,
                    "created_utc": 1651722973.0,
                    "response": "People are murdered when they are a simple inconvenience",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7e6cy5",
                    "author": "Lord_DF",
                    "score": 3,
                    "created_utc": 1651729760.0,
                    "response": "IMF is a gang of mobsters and can foad.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7e7ey4",
                    "author": "quangtrung12573",
                    "score": 3,
                    "created_utc": 1651730527.0,
                    "response": "IMF is trying it's best to make countries against Bitcoin, they did same with EL Salvador, they were also concerned when El Salvador adopted Bitcoin as legal tender, but now we don't need government recognition in order to get Bitcoin as a legal tender in countries",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7ebu2z",
                    "author": "Fizzifish",
                    "score": 3,
                    "created_utc": 1651733951.0,
                    "response": "Also news: water is wet",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7er8ui",
                    "author": "FI_fighter",
                    "score": 3,
                    "created_utc": 1651747211.0,
                    "response": "How did I miss that CAR adopted Bitcoin as legal tender?! It’s like mass media isn’t paying close attention to it anymore, a good time to accumulate then!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7ercqh",
                    "author": "AncapHodl",
                    "score": 3,
                    "created_utc": 1651747290.0,
                    "response": "I'm concerned by everything the IMF says and does. So I guess we're even.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7crgz2",
                    "author": "acegarrettjuan",
                    "score": 5,
                    "created_utc": 1651704432.0,
                    "response": "Of ‘uckin course they are",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7cul54",
                    "author": "cryptometav",
                    "score": 4,
                    "created_utc": 1651705822.0,
                    "response": "They're going to have to accept it eventually. It's just such a shame they'll be late to the party, instead of early to it.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7d5dz3",
                            "author": "knut11",
                            "score": 13,
                            "created_utc": 1651710676.0,
                            "response": "Bitcoin makes IMF obsolete. They are likely to never accept it.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                }
            ]
        },
        {
            "id": "uiehd9",
            "title": "Bitcoin jumps above $40,000 briefly, as Fed chair Jerome Powell said the central bank is not actively considering 75 basis point hike - MarketWatch",
            "url": "https://www.marketwatch.com/story/bitcoin-jumps-towards-40000-as-fed-chair-jerome-powell-said-the-central-bank-is-not-actively-considering-75-basis-point-hike-2022-05-04?mod=mw_latestnews",
            "author": "simplelifestyle",
            "created_utc": 1651692564.0,
            "score": 114,
            "num_comments": 41,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i7c47bw",
                    "author": "CryptoKeeper808",
                    "score": 20,
                    "created_utc": 1651695148.0,
                    "response": "A day of green, so nice to see this again!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7c8ega",
                            "author": "aliensmadeus",
                            "score": 15,
                            "created_utc": 1651696791.0,
                            "response": "good to see after weeks of \"fifty shades of red\"",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7c4lux",
                    "author": "coinfeeds-bot",
                    "score": 7,
                    "created_utc": 1651695306.0,
                    "response": "tldr; Bitcoin briefly jumped above $40,000, a psychological level, as the Federal Reserve Chairman Jerome Powell spoke Wednesday. Powell said the Fed is not actively considering a 75 basis point rate hike but the \"broad sense in the committee is that 50 bps should be on the table at next meetings.\"\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7c3kfm",
                    "author": "civilian411",
                    "score": 14,
                    "created_utc": 1651694896.0,
                    "response": "Let’s wait for earnings reports before we pop the champagne.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7ccww0",
                            "author": "Buy_More_Bitcoin",
                            "score": 3,
                            "created_utc": 1651698525.0,
                            "response": "When would that be?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7clxsy",
                                    "author": "CaptainAntwat",
                                    "score": 10,
                                    "created_utc": 1651702096.0,
                                    "response": "2024",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i7cmirq",
                                            "author": "similus",
                                            "score": 9,
                                            "created_utc": 1651702338.0,
                                            "response": "Earnings cut in half!",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i7d7ur4",
                                                    "author": "cubeeless",
                                                    "score": 3,
                                                    "created_utc": 1651711778.0,
                                                    "response": "No, from the point of the Bitcoin CEO, expenses are cut in half.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i7c1ujl",
                    "author": "s3k2p7s9m8b5",
                    "score": 32,
                    "created_utc": 1651694233.0,
                    "response": "My god, these comments here, people doesn't have the slightest education on economics or how the markets work.\n\nBitcoin, or anything else, doesn't exist in a vacuum. Everything is tied or related to each other.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7din40",
                            "author": "Socialists-Suck",
                            "score": 17,
                            "created_utc": 1651716603.0,
                            "response": "In fairness 90% of economists don’t understand economics either.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7dmqvi",
                                    "author": "idontspellcheckb46am",
                                    "score": 5,
                                    "created_utc": 1651718539.0,
                                    "response": "It's actually more like 60% but I'm not going to hold it against you.  They're like TV Weatherman.  It'll rain tomorrow and if not, whattayagonna do about it? huh?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i7dxgc9",
                                            "author": "TenshiS",
                                            "score": 5,
                                            "created_utc": 1651724042.0,
                                            "response": "It's actually 100%, but I'm not gonna hold it against you. No big name economist is able to time a bubble, a crash or an inflation. And the Keynsian monetary policy model is probably the one causing these exaggerated boom and bust cycles",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i7bzg91",
                    "author": "SonicPearl1974",
                    "score": 3,
                    "created_utc": 1651693303.0,
                    "response": "So Bitcoin is tied to the fed and the US markets….sweet!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7cuqm5",
                            "author": "justinbro430",
                            "score": 11,
                            "created_utc": 1651705890.0,
                            "response": "Jfc the US dollar is tied to the fed and the US\n\nAnd you're looking at how many USD it takes to buy a BTC.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i7d70pd",
                            "author": "trufin2038",
                            "score": 7,
                            "created_utc": 1651711403.0,
                            "response": "I have to notice that is an extremely stupid sentiment. Offensively stupid. The dollar is just one currency, that's all. It's not the universal definition of value.\n\nThe dollar is tied to the fed. If you are asking how many bitcoins you can buy with a dollar, that is in fact controlled by the fed, because they can manipulate the dollar.\n\nThe dollar is and has been in a total free fall, and that is the feds prerogative. It has nothing to do with bitcoin.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i7c0nhn",
                            "author": "simplelifestyle",
                            "score": 14,
                            "created_utc": 1651693769.0,
                            "response": "You didn't know that?\n\nEverything is relative to everything else.\n\nThe more the dollar gets devalued/printed to infinity, the more of them you need to buy stocks, gold, gasoline, houses, cars, groceries, Bitcoin, etc.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i7c8ha4",
                                    "author": "DudeWhatThe",
                                    "score": 9,
                                    "created_utc": 1651696821.0,
                                    "response": "The longer you wait, the worse this problem gets.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "id": "uij1q5",
            "title": "Califonria Governer Signs Executive Order on Crypto, Exploring Potential For \"New Companies, New Jobs, and New Opportunities\"...",
            "url": "https://www.globalcryptopress.com/2022/05/califonria-governer-signs-executive.html?=headline",
            "author": "Negatiesign80",
            "created_utc": 1651705295.0,
            "score": 54,
            "num_comments": 6,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i7db0sw",
                    "author": "CreativeBoredom",
                    "score": 10,
                    "created_utc": 1651713163.0,
                    "response": "He means \"new taxes \"",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7cti3n",
                    "author": "coinfeeds-bot",
                    "score": 3,
                    "created_utc": 1651705331.0,
                    "response": "tldr; California has become the first state in the US to publicly begin investigating how to broadly adapt to bitcoin and similar advances. Governor Gavin Newsom signed an executive order directing state agencies to work in coordination with the federal government to develop regulations for digital currency trading. A similar order was signed by President Joe Biden in March.\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR.*",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uif5jf",
            "title": "My book about Bitcoin (Core) development, soft forks, eclipse attacks, reproducible builds, etc",
            "url": "https://btcwip.com",
            "author": "provoost",
            "created_utc": 1651694394.0,
            "score": 116,
            "num_comments": 30,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i7q9ft5",
                    "author": "affenstunde",
                    "score": 7,
                    "created_utc": 1651962132.0,
                    "response": "Thank you Sjors and Aaron for the (more technical) podcasts! Wasn’t aware of it, started following it last week. I was listening to BNR Cryptocast (Herbert) in which you told about the release of your book.\n\nBought your book this week and started reading it today. Already learned some interesting things about addresses and nodes in the first few chapters!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7dws7g",
                    "author": "Pritz524",
                    "score": 6,
                    "created_utc": 1651723671.0,
                    "response": "Thank you so much for this. Do you accept LN tips?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7emp08",
                            "author": "provoost",
                            "score": 10,
                            "created_utc": 1651743520.0,
                            "response": "I added a tip jar at the bottom of the site. It's [bolt12](https://bolt12.org) only, but i'm working on LNURL support.\n\nUpdate: added a [Lightning Address](https://lightningaddress.com), which looks like an email address and uses LNURL under the hood. I was too lazy to self host it though (BitRefill has a semi-hidden feature to generate such an address).",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7nyudn",
                    "author": "coinjaf",
                    "score": 15,
                    "created_utc": 1651922404.0,
                    "response": "Highly recommended. Clearly knows what he's talking about and skilled explainer.\n\nAlso known as one of the hosts on a very interesting technical Bitcoin podcast with Aaron van Wirdum: https://bitcoin.nl/podcast/bitcoin-explained-the-technical-side-of-bitcoin",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7dobg0",
                    "author": "RoyYourWorkingBoy",
                    "score": 4,
                    "created_utc": 1651719276.0,
                    "response": "Anywhere I can sample a few pages?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i7eaft5",
                            "author": "TheGreatMuffin",
                            "score": 3,
                            "created_utc": 1651732829.0,
                            "response": "There's a link to a preview (table of contents + few pages from the 1st chapter) in the OP link",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i7pwttj",
                    "author": "MuchTemperature6776",
                    "score": 3,
                    "created_utc": 1651956287.0,
                    "response": "Your website keeps zooming in and out for me",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7rrn1o",
                    "author": "handsome_latino",
                    "score": 3,
                    "created_utc": 1651992696.0,
                    "response": "I read part of your sample chapter. It's great. I tried ordering through Amazon but on checkout, it said it wouldn't be delivered to my country (Asia) even though it did let me put it inside the cart. Never seen this happen yet.\n\nSent you a small tip instead, but would hope it can be shipped at some point!",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uih0lg",
            "title": "OP thinks it’s all a conspiracy by ‘’People who create Bitcoin’’",
            "url": "https://i.redd.it/hs5px8581jx81.jpg",
            "author": "louisbrunet",
            "created_utc": 1651699541.0,
            "score": 3,
            "num_comments": 20,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i7cgeu0",
                    "author": "GloUpFuced",
                    "score": 5,
                    "created_utc": 1651699924.0,
                    "response": "Ricky Sanchez is the man behind the coin",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7cgk54",
                    "author": "Amichateur",
                    "score": 4,
                    "created_utc": 1651699984.0,
                    "response": "Why care about what a lost and utterly confused mind writes?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i7cgtaq",
                    "author": "llewsor",
                    "score": 3,
                    "created_utc": 1651700087.0,
                    "response": "r/tooktoomuch",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}