{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uqn9kf",
            "title": "This message is for those with FUD",
            "url": "https://www.reddit.com/r/Bitcoin/comments/uqn9kf/this_message_is_for_those_with_fud/",
            "author": "customsolitaires",
            "created_utc": 1652674030.0,
            "score": 6,
            "num_comments": 6,
            "subreddit": "Bitcoin",
            "selftext": "1. This bear market has happened before and BTC was able to climb back up to higher ATH multiple times.\n\n2. The future is bright for BTC, money will start flowing back into it after the next halving, be patient.\n\n3. When I cannot put $100 I put $50, when I cannot put $50, I put $25, when I cannot put $25, I put $10, when I cannot put $10 I put $5.\n\n4. I do not think of my BTC in dollars, I think of it as percentage or Satoshis (very important, has helped me immensely)\n\n5. Whenever I think it will be hard for it to get back to ATH I just remember the rate of adoption and the supply and also remember that with every halving supply gets cut in half.\n\nThis is not financial advise and I only invest what I can afford to lose.",
            "stickied": false,
            "comments": [
                {
                    "id": "i8s542y",
                    "author": "Wallee1702",
                    "score": 5,
                    "created_utc": 1652674201.0,
                    "response": "I dont know why everyone is freaking out. I've been waiting for this bear market for awhile. Price doesn't matter if your in it for the next few decades.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8s5b1m",
                            "author": "customsolitaires",
                            "score": 2,
                            "created_utc": 1652674321.0,
                            "response": "Exactly, this is an opportunity to accumulate more for less.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8s6a1o",
                    "author": "wwmore11",
                    "score": 1,
                    "created_utc": 1652674916.0,
                    "response": "These personal consolation prize journal entries are getting a little tired. If you’re here to worry about ATH and the fiat price, which clearly you are or you wouldn’t post about it, then sell next time and take profit. If you’re here to speculate on crypto, then figure out what bitcoin can offer the world and talk about it. And no, that’s not likely hyperbitcoinization of the global financial system in any fast order or digital gold. It needs to be utility based and actually used for something, so what is it?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8s6ekv",
                            "author": "customsolitaires",
                            "score": 3,
                            "created_utc": 1652674992.0,
                            "response": "If you feel my comment breaks any community rules please report it. Thank you.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8saqo9",
                                    "author": "wwmore11",
                                    "score": 1,
                                    "created_utc": 1652677744.0,
                                    "response": "You didn’t break any rules, nor am I reporting anything lol. I’m making a point. What are you here for? You want fiat based ATH and wealth in fiat? You want wealth in bitcoin? What can you use bitcoin for today? Do you buy things with bitcoin? What is the point of it really? I’m just trying to understand the cope mechanism posts. Self reassurance maybe, but reassurance of what exactly?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8ujm8p",
                                            "author": "customsolitaires",
                                            "score": 1,
                                            "created_utc": 1652724395.0,
                                            "response": "I want to help those who want to sell to have reasons not to sell and hold it, if they sell in the bear market they will not be able to spend it in the future in exchange for services/products. You are not considering that we need everyone holding it together",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "id": "uqn87r",
            "title": "BREAKING: President Nayib Bukele Announces 44 Countries To Meet In El Salvador To Discuss Bitcoin",
            "url": "https://bitcoinmagazine.com/markets/el-salvador-president-nayib-bukele-announces-countries-to-discuss-bitcoin",
            "author": "_CypherIO",
            "created_utc": 1652673897.0,
            "score": 2323,
            "num_comments": 418,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i8sdu9p",
                    "author": "llewsor",
                    "score": 299,
                    "created_utc": 1652679893.0,
                    "response": "g20 vs b45 nations",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8shgj4",
                            "author": "ForcedLoginIsFacism",
                            "score": 57,
                            "created_utc": 1652682641.0,
                            "response": "That’ll be hillarious. As long as they dont get nukes (yeah really) by the G19",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8twd2y",
                                    "author": "Effective-Strength90",
                                    "score": 28,
                                    "created_utc": 1652715118.0,
                                    "response": "I feel like bitcoin is a bit like a financial nuclear bomb.  The perfect storm could happen and almost overnight multiple countries declare bitcoin as their currency.  Countries and their leaders don't like being bullied by banks either.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8txg3d",
                                            "author": "frugaleringenieur",
                                            "score": 10,
                                            "created_utc": 1652715563.0,
                                            "response": "> Countries and their leaders don't like being bullied by banks either.\n\nThere are countries where their leaders like it to bully other countries in the command of banks (and their owner families).",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8txrez",
                                                    "author": "Effective-Strength90",
                                                    "score": 1,
                                                    "created_utc": 1652715689.0,
                                                    "response": "Sure, bullies don't like to be bullied.  When you bully a bully they have a tendency to want revenge.  This makes them more apt to take risks to get their way.  Bullying starts wars.  What I'm saying is bitcoin can be used as a weapon.  Think David vs. Goliath.  If the right opportunity presents itself clearly enough to the right people bitcoin could become a very big problem for traditional banks.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8tz29z",
                                                            "author": "frugaleringenieur",
                                                            "score": 2,
                                                            "created_utc": 1652716222.0,
                                                            "response": "> could become a very big problem for traditional banks.\n\nIt already is, they currently just try to find a way through manipulation, politics or financial oppression out of it. If that will fail (it will), the violence will start from them.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i8tzzg4",
                                            "author": "S118gryghost",
                                            "score": 1,
                                            "created_utc": 1652716595.0,
                                            "response": "So instead of banks supplying funds? \n\nA private individual would?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8u1fqb",
                                                    "author": "Effective-Strength90",
                                                    "score": 2,
                                                    "created_utc": 1652717181.0,
                                                    "response": "I don't know.  I can't see into the future.  Bitcoin is mostly speculation.  My speculation is a rapid free fall into bitcoin at some point.  I think of bitcoin as a short on the  current system.  My bet is the bankers don't listen to anyone.  They think they are untouchable.  They dont negotiate.  They always win, etc.  They are the world's biggest bullies.  Everybody pretty much hates them and would love to see them get bullied for once.  Being obtuse assholes will eventually reap an obtuse reward.  Bitcoin would be that obtuse reward in my opinion.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i8v1290",
                                            "author": "Hughski",
                                            "score": 1,
                                            "created_utc": 1652731486.0,
                                            "response": "Why would a country need to though - they have their own currencies as is.\n\nCan see countries putting reserves in BTC though",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i8u2k2a",
                                    "author": "saphrano",
                                    "score": -7,
                                    "created_utc": 1652717638.0,
                                    "response": "I believe El Salvador bought the top now there trying to convince other Countries to buy there bags. lol haaa .",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8uidjp",
                                            "author": "PRMan99",
                                            "score": -2,
                                            "created_utc": 1652723909.0,
                                            "response": "Why is this downvoted?\n\nIt's certainly a possibility.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8ulsbj",
                                                    "author": "Tonyman121",
                                                    "score": -2,
                                                    "created_utc": 1652725259.0,
                                                    "response": "It's a certainty.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8tbwg1",
                            "author": "seancollinhawkins",
                            "score": 7,
                            "created_utc": 1652705899.0,
                            "response": "20 minutes ago,  I couldn't have told you what the G20 was if my life depended on it.\n\n~~I'd heard a few times before some conspiratorial bullshit about the world's most powerful and richest men/women meeting up once a year to discuss how they would brainwash the masses via the media in order to secure elections, retain their wealth, etc...~~\n\n~~Is the G20 the elite group that that conspiracy refers to?~~  Has the G20 accomplished anything noteworthy? During times of high global tension,  how are issues resolved when a large majority of G20 nations have conflicting interests?\n\nAlso, what do I need to do in order to sit in at the next meeting? I'd really like to speak to a manager about the current oil prices and maybe the possibility of getting a refund on my recent stock market investments",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8tc5jf",
                                    "author": "Slapshot382",
                                    "score": 16,
                                    "created_utc": 1652706028.0,
                                    "response": "No this is the builderberg group you’re referring to. Maybe also the WEF.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8td2k1",
                                            "author": "pap1324",
                                            "score": -1,
                                            "created_utc": 1652706499.0,
                                            "response": "No what hes refering to is the WTO, bilderberger hold no real power and the WEF is a symbolic meaning",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8tlg15",
                                                    "author": "seancollinhawkins",
                                                    "score": 1,
                                                    "created_utc": 1652710490.0,
                                                    "response": "I couldn't have named you an organization specifically, but I can assure you that the WTO wasn't the one.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i8uvl45",
                                                    "author": "Slapshot382",
                                                    "score": 1,
                                                    "created_utc": 1652729258.0,
                                                    "response": "What is the WEF symbolic of then? I thought it was the World Economic Forum and literally had the Great Reset guy wanting to steer global society into their specific purpose by 2030?",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i8tgmr4",
                                            "author": "seancollinhawkins",
                                            "score": 1,
                                            "created_utc": 1652708270.0,
                                            "response": "Oh wow... suppose it could be either one of (or both of) these. Not sure I want to fall down that rabbit hole tbh",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i8v48rd",
                                            "author": "Amichateur",
                                            "score": 1,
                                            "created_utc": 1652732790.0,
                                            "response": "> builderberg group\n\nbilderberg (ger.) = pictures mountain (engl.)",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i8txnc3",
                                    "author": "frugaleringenieur",
                                    "score": 5,
                                    "created_utc": 1652715644.0,
                                    "response": "They are just very real, very not conspirational created and very communicative publicly https://en.wikipedia.org/wiki/G20\n\nAlso regarding your very real happening group events that noone is sure about what actually is talked over there: https://en.wikipedia.org/wiki/Bilderberg_meeting (the attendences list is hillarious suspicious), Davos annual meeting https://en.wikipedia.org/wiki/World_Economic_Forum",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8tdrp1",
                                    "author": "Explodicle",
                                    "score": 5,
                                    "created_utc": 1652706861.0,
                                    "response": "Every time I point out one of the conspiracies Bitcoin avoids, people are all like \"That's not a conspiracy! It's supposed to work that way, they're just _not supposed to care_ what the public wants. Have you tried voting lesser evil?\"",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8tgiiz",
                                    "author": "Thecrawsome",
                                    "score": 2,
                                    "created_utc": 1652708212.0,
                                    "response": "All you did was ask questions. How incredulous.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8tjhx8",
                                    "author": "tom1018",
                                    "score": 2,
                                    "created_utc": 1652709610.0,
                                    "response": "> I'd heard a few times before some conspiratorial bullshit about the world's most powerful and richest men/women meeting up once a year to discuss how they would brainwash the masses via the media in order to secure elections, retain their wealth, etc...\n\nI believe what you were referring to here is the Davos conference.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8trpid",
                                            "author": "seancollinhawkins",
                                            "score": 0,
                                            "created_utc": 1652713181.0,
                                            "response": "Maybe? I've gotten a few responses, but all with different answers. If there was truly one elite group of individuals that held power over world wide media consumption, we'd either:\n\nA) know exactly what organization it was because they'd repeatedly promote themselves as being such.  (Because they'd have the power to do so)\n\nOr\n\nB) have no fuckin clue what organization it was because they'd have Fort Knox level security over their anonymity. (Because they'd have full control over information distribution)\n\nOption A clearly isn't the answer, so Option B must be. But Option B leaves us only with hypotheticals. Which chalks this all up to conspirital bullshit\n\n(This doesn't mean that i think that such an organization doesn't exist. It just means that I think it'd be impossible to know whether one did or didnt.)\n\nBut this was in no way meant to be the focus of my original comment lol",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i8us044",
                                    "author": "horsecyack",
                                    "score": 2,
                                    "created_utc": 1652727778.0,
                                    "response": "How did you do the line crossthrough? Horsey checking out",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8ut9te",
                                            "author": "seancollinhawkins",
                                            "score": 2,
                                            "created_utc": 1652728308.0,
                                            "response": "Insert  (~~) before and after what you want to cross through:\n\n~  ~horsey checking in (dont put a space between the tildes and itll work)~ ~\n\n[reddit formatting post tells you all you need to know](https://www.reddit.com/r/raerth/comments/cw70q/reddit_comment_formatting/?utm_medium=android_app&utm_source=share)",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8uzy7r",
                                                    "author": "horsecyack",
                                                    "score": 1,
                                                    "created_utc": 1652731030.0,
                                                    "response": "Thanks ~~rock solid horsey~~",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8v0yci",
                                                            "author": "seancollinhawkins",
                                                            "score": 1,
                                                            "created_utc": 1652731442.0,
                                                            "response": "Rock solid horsey? Fuckin why am I laughing at that 😂",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8tm2vy",
                            "author": "Stardust8356",
                            "score": 1,
                            "created_utc": 1652710773.0,
                            "response": "the hell is b45 nations?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8tqksz",
                                    "author": "PilotTim",
                                    "score": 3,
                                    "created_utc": 1652712706.0,
                                    "response": "BTC 44 countries plus El Salvador. Something he just made up.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8u2rtt",
                            "author": "lilliewillie31",
                            "score": 1,
                            "created_utc": 1652717725.0,
                            "response": "He has succeeded in making El Salvador adopt Bitcoin as legal tender -- first country to do it. \n\nAnd now he's convening central banks, financial institutions and countries to discuss Bitcoin. Nayib Bukele is doing well .",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8ulgv1",
                                    "author": "cedarapple",
                                    "score": 1,
                                    "created_utc": 1652725134.0,
                                    "response": "It sounds like he's looking for bagholders.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8ur7f4",
                            "author": "hashgraph9",
                            "score": 1,
                            "created_utc": 1652727456.0,
                            "response": "breaking news:  b45 nations gathered today to rescue the fiat20 nations.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8us7qd",
                                    "author": "llewsor",
                                    "score": 1,
                                    "created_utc": 1652727867.0,
                                    "response": "bahaha dude that would be amazing",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8s9wy2",
                    "author": "coinfeeds-bot",
                    "score": 129,
                    "created_utc": 1652677214.0,
                    "response": "tldr; El Salvador President Nayib Bukele announced that 32 central banks and 12 financial authorities from 44 countries will meet on Monday to discuss Bitcoin. The meeting will discuss financial inclusion, digital economy, banking the unbanked, and El Salvador’s Bitcoin rollout. The Central Bank of Rwanda, Nepal Rastra Bank, and the National Bank of Nepal will also be attending.\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR.*",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8tzuf9",
                            "author": "0002843",
                            "score": 3,
                            "created_utc": 1652716538.0,
                            "response": "Honestly only countries with weak currency would benefit from adopting Bitcoin to overthrow the mainstream currencies.\n\n But if ALL the developing countries come together, it might actually work.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8ueiz7",
                                    "author": "infii123",
                                    "score": 3,
                                    "created_utc": 1652722398.0,
                                    "response": "Why exactly do you think that?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8up9ok",
                                            "author": "WhatTheHomePod",
                                            "score": 3,
                                            "created_utc": 1652726662.0,
                                            "response": "It’s not only countries with a weak currency, but also us taking away the powers of bankers, cause with everything happening is nothing but based on policy, however in the short term countries with a weak currency could benefit because of this; since bitcoin cannot be manipulated like fiat can.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8v1zf8",
                                                    "author": "Hughski",
                                                    "score": 1,
                                                    "created_utc": 1652731869.0,
                                                    "response": "Why would you think countries wouldn’t want the power to manipulate their own currencies??",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i8v4tj4",
                                    "author": "Character_Body_2810",
                                    "score": 1,
                                    "created_utc": 1652733029.0,
                                    "response": "But after they did, bitcoin would then be strong enough that countries with stronger currencies would benefit from switching at that point",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8sbzny",
                    "author": "sogladatwork",
                    "score": 248,
                    "created_utc": 1652678577.0,
                    "response": "A year ago, just the headline would have sent bitcoin into the stratosphere. Our little coin is all grown up now (tear).",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8t99wq",
                            "author": "backafterdeleting",
                            "score": 28,
                            "created_utc": 1652704497.0,
                            "response": "Bitcoin doesn't go up or down based on news like this.\n\nedit: \"it used to\". No it didn't.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8tkh7k",
                                    "author": "ChineseFood_Desu",
                                    "score": 28,
                                    "created_utc": 1652710056.0,
                                    "response": "Back in 2016, this shit would have ripped bitcoin to the ISS.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8ueoao",
                                            "author": "infii123",
                                            "score": 0,
                                            "created_utc": 1652722457.0,
                                            "response": "I don't think so. Everybody would have laughed and no one really would have cared about what El Salvador is doing.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i8ta9of",
                                    "author": "sogladatwork",
                                    "score": 16,
                                    "created_utc": 1652705038.0,
                                    "response": "Not anymore.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8tlnoz",
                                    "author": "SirSkittles111",
                                    "score": 6,
                                    "created_utc": 1652710583.0,
                                    "response": "It used to, but people dont care that much anymore about its news",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8tnz01",
                                    "author": "phranco_phoney",
                                    "score": 3,
                                    "created_utc": 1652711596.0,
                                    "response": "Oh, heck, did it ever used to, though!",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8ugbvc",
                                    "author": "manginahunter",
                                    "score": 1,
                                    "created_utc": 1652723109.0,
                                    "response": "Or the market want some real action not just talk. In short the market became more mature.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8uip1q",
                                    "author": "PRMan99",
                                    "score": 1,
                                    "created_utc": 1652724032.0,
                                    "response": "News doesn't matter.  When people in these countries start trying to buy bitcoin, there won't be enough to go around and the price will skyrocket.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8v5g3k",
                                    "author": "Character_Body_2810",
                                    "score": 1,
                                    "created_utc": 1652733289.0,
                                    "response": "Bitcoin will follow its cycle and then the narrative is built around that cycle. If this had come out 2 years ago then the natural upswing after the halving would have been attributed to this by idiots in the media",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8stgkd",
                            "author": "NYKNYb",
                            "score": 29,
                            "created_utc": 1652693108.0,
                            "response": "Bitcoin is being strapped to rockets right now with news like that.\n\nAs soon as confidence returns and we're in a bull market, it's moon mission and beyond.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8tstch",
                                    "author": "Lithuanian_Minister",
                                    "score": 6,
                                    "created_utc": 1652713637.0,
                                    "response": "Lol this certainly sounds like a well informed opinion",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8twklk",
                                            "author": "NYKNYb",
                                            "score": 3,
                                            "created_utc": 1652715204.0,
                                            "response": "Well we're all (or at least some of us) taking a bet here on Bitcoin being a more valuable and desirable system in the future.\n\nI'm having a hard time seeing developments like that as bad news.\n\nEverything is not reflected in price in real time because this is not how markets work. But it the long run, narrative and fundamentals do matter.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8uttst",
                                                    "author": "Independent-Custard3",
                                                    "score": 1,
                                                    "created_utc": 1652728538.0,
                                                    "response": "Too bad this is actual fake news",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i8v5m4m",
                                    "author": "Character_Body_2810",
                                    "score": 1,
                                    "created_utc": 1652733358.0,
                                    "response": "The bull market will come with the next halving, and when it does the media will point to 2 years of stories like this all at once as explanation",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8sngax",
                            "author": "The_Judicaetor",
                            "score": 10,
                            "created_utc": 1652687637.0,
                            "response": "😥",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8soar2",
                            "author": "preciousbodyparts",
                            "score": 6,
                            "created_utc": 1652688379.0,
                            "response": "🥲",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8t0c87",
                            "author": "ubuntuba",
                            "score": 2,
                            "created_utc": 1652698863.0,
                            "response": "🥹",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8tczvo",
                            "author": "ArchiMode25",
                            "score": 3,
                            "created_utc": 1652706460.0,
                            "response": "Something like this is said everytime \"big news\" comes out and each time it happens the price barely moves. I don't think this is anything new.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8thkrq",
                                    "author": "sogladatwork",
                                    "score": 5,
                                    "created_utc": 1652708714.0,
                                    "response": "Tell me you haven’t been in bitcoin for a year without telling me you haven’t been in bitcoin for a year. \n\nMember when Tesla put bitcoin on the books? I member.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8tqyl1",
                                            "author": "ArchiMode25",
                                            "score": 3,
                                            "created_utc": 1652712866.0,
                                            "response": "Is this sarcasm or are you making fun of your own post? Tesla announced in the heat of a bull run, Feb 2021. Even without the announcement bitcoin would have had a great 2021. It had already broken ATH at that point.\n\nDo you remember:\nInstitutional money coming into crypto?\nThat was Q4 2017 before market crash.\n\nSamsung announced Bitcoin app with Galaxy s10?\nBitmain to build $500M mining farm in Texas?\nThat was 2018 during a market crash of 80-99% depending on the crypto.\n\nJP Morgan announcing crypto support of various kinds?\nFacebook announcing crypto platform?\nThat was 2019 again during crypto bear market.\n\nNone of that \"big\" news made a positive impact on price. In fact prices continued to drop during those times.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i8uowwr",
                                            "author": "Affectionate_Net1177",
                                            "score": 1,
                                            "created_utc": 1652726517.0,
                                            "response": "Member when reddit was gonna use crypto? Then they abandoned it. I do. The entire GDP of El Salvador is less than a bottom barrel S&P 500 company stock. 😂😂",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i8trjzm",
                                    "author": "Separate-Sentence-91",
                                    "score": 1,
                                    "created_utc": 1652713117.0,
                                    "response": "That's a good thing. Gold didn't fluctuate in price back when Kings sacraficed it to the Gods.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8trrmk",
                                            "author": "ArchiMode25",
                                            "score": 3,
                                            "created_utc": 1652713205.0,
                                            "response": "Agreed. Never said it was a bad thing. Just stating that the price not moving much upward due to positive news is nothing new.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8tsre8",
                                                    "author": "Separate-Sentence-91",
                                                    "score": 1,
                                                    "created_utc": 1652713615.0,
                                                    "response": "Yeah, it's making me more excited about BTC as a Standard! All other altcoins are treated like securities, and probably always will. BTC has been running without admin for 12 years and has reached the points when Sovereign states are considering allocating funds to buying it.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i8v5vzr",
                                    "author": "Character_Body_2810",
                                    "score": 1,
                                    "created_utc": 1652733471.0,
                                    "response": "It’s drips and drops over years until the bucket fills up. It’s good news, but it’s not going to cancel the bear market just like that. That only ends when the whales who have been trading bitcoin since 50 bucks say it does. And they say it ends at the halving.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8tkcc9",
                            "author": "AdeptnessForsaken606",
                            "score": -6,
                            "created_utc": 1652709995.0,
                            "response": "Why does this have so many upvotes? Literally nothing has changed about the fundamentals of BTC in the last year.\n\nEven the El Salvador adoption was just a little bump in the chart. \n\nAnd don't forget how BTC tanked to 3k with the rest of the market in March 2020.\n\nThe only thing that has changes is r/Bitcoin has become completely inundated with amateur ass noob buyers who constantly spew this weird, almost religious nonsense about BTC.\n\nSometimes I think r/Bitcoin should be renamed to r/looneyBin.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8u2tga",
                            "author": "geneerinen21",
                            "score": 1,
                            "created_utc": 1652717743.0,
                            "response": "Nayib Bukele is determined to keep pushing Bitcoin adoption.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8s8g8g",
                    "author": "ymgve",
                    "score": 127,
                    "created_utc": 1652676278.0,
                    "response": "Wake me when the 44 countries themselves are announcing they are going to the meeting",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8suwej",
                            "author": "monxas",
                            "score": 23,
                            "created_utc": 1652694426.0,
                            "response": "The fact that they explicitly mention Rwanda and Nepal in the article shows the type of nations that will attend. Still, this is a promising step.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8t58ly",
                                    "author": "52576078",
                                    "score": 47,
                                    "created_utc": 1652702113.0,
                                    "response": "It was always going to be the poorest countries that go first, those are the ones with nothing to lose. Do you really think Australia or UK are going to be first?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8ti5m3",
                                            "author": "edweeen",
                                            "score": 19,
                                            "created_utc": 1652708984.0,
                                            "response": "Exactly. It’s a shot at leveling the world order.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8v2i1c",
                                                    "author": "Hughski",
                                                    "score": 1,
                                                    "created_utc": 1652732076.0,
                                                    "response": "Even if these countries went Bitcoin only it wouldn’t help them lol.\n\nIf anything it would quite likely fuck then up with their currency going up and down like a yo-yo \n\nIf the countries invested a reserve into BitCoin it would probably helped them long term though",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i8v0qts",
                                                    "author": "smulfragPL",
                                                    "score": 1,
                                                    "created_utc": 1652731355.0,
                                                    "response": "you are insane",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i8t7v6b",
                                            "author": "sl479",
                                            "score": -17,
                                            "created_utc": 1652703691.0,
                                            "response": "If the technology was good, then yes. Unfortunately Bitcoin has some major flaws that mean it’s long term prospects are poor.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8t9lpd",
                                                    "author": "ipcoffeepot",
                                                    "score": 16,
                                                    "created_utc": 1652704679.0,
                                                    "response": "The tech has nothing to do with it. No country with control over its own currency will be anywhere near the front of the line.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i8taaof",
                                                    "author": "52576078",
                                                    "score": 11,
                                                    "created_utc": 1652705053.0,
                                                    "response": "Oh really? Tell me more about these flaws. Sounds interesting!",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8tex1i",
                                                            "author": "sl479",
                                                            "score": -3,
                                                            "created_utc": 1652707429.0,
                                                            "response": "Lack of use cases, energy inefficiency. See the remarks by SBF in the FT today",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8tkuhe",
                                                                    "author": "52576078",
                                                                    "score": 5,
                                                                    "created_utc": 1652710222.0,
                                                                    "response": "Bitcoin has some pretty amazing use cases - take a listen to Alex Gladstein on Lex Fridman podcast",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                },
                                                                {
                                                                    "id": "i8tq0bo",
                                                                    "author": "maybelea",
                                                                    "score": 2,
                                                                    "created_utc": 1652712465.0,
                                                                    "response": "you know .. if 44 countries considered bitcoin sovereign currency and allowed taxes to be paid in BTC within their borders, that's a hell of a lot of use case... \n\nbut sure keep going with that tired line",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i8trsq2",
                                                                            "author": "sl479",
                                                                            "score": -2,
                                                                            "created_utc": 1652713217.0,
                                                                            "response": "That’s a hell of an if :)",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i8ts2pr",
                                                                                    "author": "maybelea",
                                                                                    "score": 4,
                                                                                    "created_utc": 1652713329.0,
                                                                                    "response": "either you didn't know el salvador already does or you don't consider them worthy of acknowledgement insofar as the discussion of use case for bitcoin",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i8u6hf3",
                                                                                            "author": "sl479",
                                                                                            "score": 1,
                                                                                            "created_utc": 1652719212.0,
                                                                                            "response": "El Salvador is only one country?",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "id": "i8tifsf",
                                                                    "author": "jsavag",
                                                                    "score": -3,
                                                                    "created_utc": 1652709118.0,
                                                                    "response": "You are 100% right but we are in an echo chamber. Unpopular opinion = FUD",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "i8tmgte",
                                                            "author": "mtndewaddict",
                                                            "score": 0,
                                                            "created_utc": 1652710939.0,
                                                            "response": "The fact that sharing my BTC address for someone to send me funds opens up my entire BTC funds to them. BTC is not cash as cash is private and not linked to a person. The blockchain being so open is the reason I prefer privacy focused coins.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8tph67",
                                                                    "author": "52576078",
                                                                    "score": 2,
                                                                    "created_utc": 1652712237.0,
                                                                    "response": "This was true years ago but hasn't been true for quite a while now.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i8tqh29",
                                                                            "author": "mtndewaddict",
                                                                            "score": 0,
                                                                            "created_utc": 1652712662.0,
                                                                            "response": "Bitcoin is no longer a public ledger? When did that change.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i8u53ts",
                                                                                    "author": "52576078",
                                                                                    "score": 1,
                                                                                    "created_utc": 1652718663.0,
                                                                                    "response": "Any decent wallet will automatically use a new address for every transaction. https://en.bitcoin.it/Privacy#Avoiding_address_reuse",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i8u8wdn",
                                                                                            "author": "mtndewaddict",
                                                                                            "score": 0,
                                                                                            "created_utc": 1652720159.0,
                                                                                            "response": "It's styled like a wiki but that whole section reads more like an opinion piece and confirms what I've said above. Address reuse is a problem still and it's on the end user to use correctly instead of stealth addresses being built directly to the protocol. Privacy is an issue bitcoin still doesn't adequately address which other coins do.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i8t2snc",
                                    "author": "anonymouscitizen2",
                                    "score": 74,
                                    "created_utc": 1652700547.0,
                                    "response": "The downtrodden nations are exactly the ones who need Bitcoin. They’ve been exploited for centuries by Western Hegemonies",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8t7pli",
                                            "author": "SeatAny1577",
                                            "score": 5,
                                            "created_utc": 1652703603.0,
                                            "response": "Ya. The us certainly exploits nepal",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8tlaxc",
                                                    "author": "s_josh_f",
                                                    "score": 5,
                                                    "created_utc": 1652710425.0,
                                                    "response": "If they had oil, you bet we'd find a way to be involved over there--for decades and decades of endless wars. But I'm sure that if you looked hard enough, you'd find some instance of US corporate or government interference.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8ufyk7",
                                                            "author": "d-redze",
                                                            "score": 1,
                                                            "created_utc": 1652722964.0,
                                                            "response": "Any place that uses USDs is used by the US.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i8tq8ll",
                                                    "author": "AvoidMyRange",
                                                    "score": 8,
                                                    "created_utc": 1652712563.0,
                                                    "response": "That'd be China, same shit really.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i8u49sz",
                                                    "author": "CipherPolAigis0",
                                                    "score": 1,
                                                    "created_utc": 1652718326.0,
                                                    "response": "As an Indian, I would say that we do indeed walk over Nepal.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i8v0hj6",
                                            "author": "Pezotecom",
                                            "score": 1,
                                            "created_utc": 1652731250.0,
                                            "response": "Just Hegemonies.    \n\nUSSR/China/USA/UE have been fucking everyone for centuries.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i8t1529",
                                    "author": "manginahunter",
                                    "score": 5,
                                    "created_utc": 1652699427.0,
                                    "response": "Better than nothing. The West is still caught in their hegemonic views...",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8us9ec",
                                    "author": "horsecyack",
                                    "score": 1,
                                    "created_utc": 1652727885.0,
                                    "response": "They’ll be arriving by horse, leaving by learjet",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8uzxe3",
                                    "author": "ZZ3xhZz",
                                    "score": 1,
                                    "created_utc": 1652731021.0,
                                    "response": "The countries that need it the most",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8u20ba",
                            "author": "prior242",
                            "score": 2,
                            "created_utc": 1652717414.0,
                            "response": "Sounds scary. Don’t let them get him on the CBDC path.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8u0orn",
                    "author": "FrivolerFridolin",
                    "score": 9,
                    "created_utc": 1652716878.0,
                    "response": "Hyperbitcoinization is comming",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8u6s2n",
                    "author": "Disgruntled_AnCap",
                    "score": 27,
                    "created_utc": 1652719324.0,
                    "response": "I don't want to rain on anyone's party here, I now live in El Salvador and love everything Nayib is doing, but just a quick reality check:\n\nThis is a regular meeting of the Alliance for Financial Inclusion (an organization founded under an initiative of the Bill & Melinda Gates foundation, for the record..), which rotates between member countries and just so happens to be hosted in El Salvador this year - I'm sure they'll mention Bitcoin, but AFAIK that's not why it's happening in SV, and at least some of the member countries definitely aren't friendly to Bitcoin.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8v4vu2",
                            "author": "GurkenZorro",
                            "score": 1,
                            "created_utc": 1652733056.0,
                            "response": "Thanks for pointing this out.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8sjf03",
                    "author": "ScamJustice",
                    "score": 90,
                    "created_utc": 1652684204.0,
                    "response": "USA overplayed its hand by weaponizing the dollar against russia, iran etc. Now countries are looking for a better money that can't be fucked with",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8t1i24",
                            "author": "manginahunter",
                            "score": 19,
                            "created_utc": 1652699682.0,
                            "response": "This (get my upvote) I wrote the exact same thinking in one of my message earlier. Sanctions aftermath and rule of law breaking by blocking/freezing normal Russian citizens properties even if they have nothing to do with Putin and his war.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8t6jc5",
                                    "author": "Kick_Out_The_Jams",
                                    "score": 1,
                                    "created_utc": 1652702899.0,
                                    "response": "Somebody is gonna have to pay for the damage they are doing every day to the innocents in Ukraine, who also had nothing to do with war.\n\nI dunno if Russia would be able to afford it even if they were seriously trying.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8tfhlo",
                                            "author": "Explodicle",
                                            "score": -2,
                                            "created_utc": 1652707712.0,
                                            "response": "The CIA first got involved in Bitcoin in 2011. In a bitcoin world, the USA will weaponize money in different ways. Hopefully, directing those weapons more directly at tyrants will be an improvement.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8uj2a2",
                                                    "author": "PRMan99",
                                                    "score": 2,
                                                    "created_utc": 1652724175.0,
                                                    "response": "I assure you that no government agency even knew or cared about bitcoin in 2011.",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i8uo7dz",
                                                    "author": "RotgutFeng",
                                                    "score": 0,
                                                    "created_utc": 1652726232.0,
                                                    "response": "Satoshi Nakamoto translates to Central Intelligence",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i8tfal7",
                                    "author": "erratikBandit",
                                    "score": 1,
                                    "created_utc": 1652707616.0,
                                    "response": "How is anyone \"rule of law breaking\"? Any country that imposes sanctions does so through their Congress, by passing laws. They literally write the laws. How can they be breaking the rule of law by writing it?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8u3e4v",
                                            "author": "dont_you_love_me",
                                            "score": 1,
                                            "created_utc": 1652717974.0,
                                            "response": "Laws have different meanings to different groups of people. If one group declares something against the law, while another group calls it lawful, the people from the perspective of an action breaking the law will claim that the opposing party “broke the law” since not doing so would invalidate their own laws and make them worthless. The law from your perspective has to be enforced otherwise it holds no weight and your local people, who the laws are meant to dominate, won’t respect your proclamations. And then your people eat you alive.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i8ud1kg",
                                            "author": "manginahunter",
                                            "score": 1,
                                            "created_utc": 1652721805.0,
                                            "response": "They are breaking their own laws by doing that especially that they are not at official war with Russia. They are already breaking discrimination laws by doing so. Sanctions are for the most part illegal.  So yeah the West is breaking the rule of law and confidence in their institution. The flight of capital to other jurisdiction and BTC will prove that in the future.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i8uixov",
                                    "author": "PRMan99",
                                    "score": 1,
                                    "created_utc": 1652724124.0,
                                    "response": "That will go down as the worst move in US foreign policy history.\n\nAnd Biden will go down as the worst president in US history.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8u05nc",
                            "author": "Julian1820",
                            "score": 2,
                            "created_utc": 1652716665.0,
                            "response": "Hoping I get a list of banks, curious if RBA and the Fed will be in attendance .",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8t3pim",
                            "author": "jl2l",
                            "score": 4,
                            "created_utc": 1652701144.0,
                            "response": "Lol",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8ujbln",
                                    "author": "Marokiii",
                                    "score": 3,
                                    "created_utc": 1652724277.0,
                                    "response": "I guess we should have gone to war then.  Because there are 3 options when it came to the Russia invasion of ukraine;\n\n1. Do nothing and continue on with business as usual.\n2. Economic sanction(which require having some measure of control over financial markets)\n3. Global war.\n\nI don't think anyone would be happy with options 1 or 3. That leaves us with option 2.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8t7xsi",
                            "author": "sl479",
                            "score": 1,
                            "created_utc": 1652703733.0,
                            "response": "Better money wouldnt fall in value like this Bitcoin has though. The search for a better alternative goes on!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8t9s09",
                                    "author": "EpsilonCru",
                                    "score": 7,
                                    "created_utc": 1652704776.0,
                                    "response": "You're thinking of Bitcoin's value in fiat terms, so you have no idea about its value.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8teyfc",
                                            "author": "sl479",
                                            "score": 8,
                                            "created_utc": 1652707449.0,
                                            "response": "Well yes, a lot of my liabilities are based in fiat currencies",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8to53p",
                                                    "author": "BigDeezerrr",
                                                    "score": 1,
                                                    "created_utc": 1652711668.0,
                                                    "response": "If fiat is the measuring stick then everything will look volatile in comparison. What if it's fiat that is fluctuating?\n\nBitcoin is still young and in price discovery mode. Adoption worldwide has come a long way but still has a long ways to go.  Once it gets a market cap similar to gold I suspect it won't look very volatile at all",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i8tfndz",
                                    "author": "Explodicle",
                                    "score": 2,
                                    "created_utc": 1652707789.0,
                                    "response": "Maybe you'd prefer a stablecoin.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8ttwq0",
                                            "author": "ride_the_LN",
                                            "score": 1,
                                            "created_utc": 1652714097.0,
                                            "response": "I know of a cheap one!",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8uo1lm",
                                                    "author": "jason_abacabb",
                                                    "score": 1,
                                                    "created_utc": 1652726167.0,
                                                    "response": "That one has been reclassified to not-so-stablecoin.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8ushuo",
                                                            "author": "iamjusthonest",
                                                            "score": 1,
                                                            "created_utc": 1652727981.0,
                                                            "response": "It is stably going down.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i8tmfre",
                                    "author": "s_josh_f",
                                    "score": 1,
                                    "created_utc": 1652710926.0,
                                    "response": "Yeah, bitcoin goes up and it goes down. It's volatile. But over long periods of time, no one loses money in bitcoin. This is far better than the alternative of holding fiat, where you are guaranteed to lose purchasing power over time.\n\nDo the search that you suggested yourself: no other asset has outperformed bitcoin over the last decade. No other asset is decentralized, permissionless, or censorship-resistant to the degree that bitcoin is. \n\nAs adoption picks up, the volatility will decrease; my guess is that we're going to see adoption grow much more quickly over the next few years.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8s78qc",
                    "author": "Roik9",
                    "score": 75,
                    "created_utc": 1652675522.0,
                    "response": "This is huuge!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8skz7a",
                            "author": "SouthTippBass",
                            "score": 16,
                            "created_utc": 1652685497.0,
                            "response": "Only if true...",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8sr45r",
                            "author": "BitcoinReminder_com",
                            "score": 8,
                            "created_utc": 1652690953.0,
                            "response": "True if huuge!",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8stqo6",
                            "author": "chelminers",
                            "score": 8,
                            "created_utc": 1652693366.0,
                            "response": "Don't include USA Banks!! Your better off without them, I'm an American trust me!!",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8st2jn",
                            "author": "The_Estranger_0001",
                            "score": 1,
                            "created_utc": 1652692751.0,
                            "response": "Truly huuuuge!",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8sxcdq",
                            "author": "nestaa13",
                            "score": 1,
                            "created_utc": 1652696521.0,
                            "response": "Hugely true",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8sf6g2",
                    "author": "Lolfcklol",
                    "score": 35,
                    "created_utc": 1652680880.0,
                    "response": "“It took 12 years for the first country to adopt Bitcoin, around 8 months for the second, and if Panama’s president signs their recent Bitcoin bill into law, then they will be the third only about a month after the second.”",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8smij8",
                            "author": "OtherDetective",
                            "score": 10,
                            "created_utc": 1652686820.0,
                            "response": "When I read that part I was like WOW, IT'S HAPPENING. We are about to hit the exponential curve!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8sn7uj",
                                    "author": "Lolfcklol",
                                    "score": 6,
                                    "created_utc": 1652687424.0,
                                    "response": "Same. Was a very nice feeling reading this paragraph.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8uky4s",
                                    "author": "Sillyfiremans",
                                    "score": 1,
                                    "created_utc": 1652724926.0,
                                    "response": "I sure hope so, but let's keep expectations tempered (a ridiculous request, I know).  Those three countries have a GDP equal to about the budget surplus of California this year . . . not California's GDP, their surplus!  I am hopeful that this is the beginning of mass state level adoption, but you need a big player to eventually sign on for this to happen.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8uliuk",
                                            "author": "OtherDetective",
                                            "score": 1,
                                            "created_utc": 1652725156.0,
                                            "response": "Do you see more of the future? These low GDP markets adopt Bitcoin, then 3 years later their treasure doubles/triples/quadruple due to the value of BTC rising, as their economies flourish and the big economies tank adoption for all countries will be necessary.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8ult5q",
                                                    "author": "Sillyfiremans",
                                                    "score": 1,
                                                    "created_utc": 1652725269.0,
                                                    "response": "It's a possibility . . . one I hope happens.  I also think it is equally possible that bitcoin continues down until the next halvening and the people in those countries suffer immeasurably because of it.  Nobody knows for sure.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8shj8s",
                            "author": "ForcedLoginIsFacism",
                            "score": 2,
                            "created_utc": 1652682701.0,
                            "response": "I doubt it goes that wuickly for Pan, though",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8u1oo8",
                                    "author": "Lizeriusz",
                                    "score": 0,
                                    "created_utc": 1652717283.0,
                                    "response": "This is how it is spoken, Mr. President Bukele, the opposition attacks... \n\nyou continue, the people are with you.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8u1v9r",
                            "author": "pipi100981",
                            "score": 1,
                            "created_utc": 1652717358.0,
                            "response": "Please don't involve Bank of America, it's very good for him.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8uddad",
                            "author": "ILikePracticalGifts",
                            "score": 1,
                            "created_utc": 1652721935.0,
                            "response": "What was the second?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8u99rh",
                    "author": "GenocidSurvivor2Moon",
                    "score": 5,
                    "created_utc": 1652720304.0,
                    "response": "Good to hear my country Rwanda will be there 👍🏿. Rwanda is building a strong innovative tech hub in Kigali, Bitcoin would a great addition.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8v4ckg",
                            "author": "LayPessimist",
                            "score": 1,
                            "created_utc": 1652732835.0,
                            "response": "Rwanda to the moon!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8sf1mv",
                    "author": "mbrochh",
                    "score": 13,
                    "created_utc": 1652680788.0,
                    "response": "D O M I N O E S",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8u23h6",
                            "author": "dbihosting",
                            "score": 2,
                            "created_utc": 1652717450.0,
                            "response": "If you look at the participants, most of them are victims of the old monetary system (read: monetary slavery) for a long time.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8s7y2v",
                    "author": "thadiusb",
                    "score": 49,
                    "created_utc": 1652675966.0,
                    "response": "Even if just half of those countries adopt after tomorrow that's a huge deal.\n\nMy guess Max Keiser is gonna be there lol.\n\nIMF is probably puking right now.\n\nGradually... Gradually. Suddenly.\n\nEdit: Just a side thought… but if Bukele, “the Marketer” sells these nations and central banks, appropriately, on Bitcoin, then I think we will see some of them act quickly as Bitcoin is at a great price right now.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8seh7z",
                            "author": "obi_wan_baracus",
                            "score": 43,
                            "created_utc": 1652680362.0,
                            "response": "Even if ONE did it would be huge",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8u2pm5",
                                    "author": "ccw12333",
                                    "score": 4,
                                    "created_utc": 1652717700.0,
                                    "response": "Ups... Argentina not on the list... oh, is true, the IMF won't let them... hahahahaha!",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8uj7us",
                                            "author": "PRMan99",
                                            "score": 1,
                                            "created_utc": 1652724237.0,
                                            "response": "Yep. They were banned by IMF in order to extend their loans.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8sh82y",
                            "author": "Business_Smile",
                            "score": 18,
                            "created_utc": 1652682456.0,
                            "response": "Nations don't do quickly just because the price is down",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8staow",
                                    "author": "The_Estranger_0001",
                                    "score": 13,
                                    "created_utc": 1652692953.0,
                                    "response": "Well, developed countries with built system and bureaucracy don’t, but in that 44, some may FOMO. And they actually don’t have to do much, just buy 100 Bitcoins for their reserve will send a huge message.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8t6s3t",
                                            "author": "outdatedrhombus",
                                            "score": 5,
                                            "created_utc": 1652703050.0,
                                            "response": "I love that people think nation states should operate like retail punters.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8t7z90",
                                                    "author": "The_Estranger_0001",
                                                    "score": 6,
                                                    "created_utc": 1652703757.0,
                                                    "response": "Many retail punters are financially better than quite a few of these countries lol",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8siacv",
                            "author": "Lurked_Emerging",
                            "score": 12,
                            "created_utc": 1652683298.0,
                            "response": "Bukele is setting himself up to be a bitcoin sweetheart history will remember. It makes sense he'd be pushing bitcoin so much but these are some incredible results. The speed this could imply global adoption is going to accelerate by could burn everyone's eyebrows off, if the 44 join in the next 2 years it'd imply the vast majority of the world will adopt bitcoin in 10 years more or less.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8u279j",
                                    "author": "MotionDimension",
                                    "score": 2,
                                    "created_utc": 1652717492.0,
                                    "response": "It makes sense that all the developing countries would attend this .\n\nBut I’d be interested to know the benefits of BTC (to the country not individuals) over a country’s own CBDC.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8umgk9",
                                            "author": "Lurked_Emerging",
                                            "score": 1,
                                            "created_utc": 1652725529.0,
                                            "response": "CBDCs are little different from fiat. Basically fiat 2.0 so developing countries that don't have their own currency now won't have a cbdc.\n\nCBDCs main utility it controlling and observing their people's financial activity as part of a wider system so of less utility anyway to countries looking to get richer and escape control of global central banks.\n\nBitcoin as a currency is decentralised and cannot be controlled so countries without their own currency can adopt it with peace of mind for their own finances and their citizens and global central banks won't be able to freeze their economies.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8so65u",
                            "author": "Petr1951",
                            "score": 6,
                            "created_utc": 1652688267.0,
                            "response": "CIA spooks, WEF fud-factories & IMF saboteurs too, I'm gonna guess. How good is border control?",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8t82by",
                            "author": "sl479",
                            "score": 1,
                            "created_utc": 1652703807.0,
                            "response": "Mate that isn’t gonna happen. You delusional?",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8tass7",
                            "author": "ramblerandgambler",
                            "score": 1,
                            "created_utc": 1652705320.0,
                            "response": "> Even if just half \n\nI think you need to adjust your expectations",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8sqii9",
                    "author": "Futhamucker1",
                    "score": 9,
                    "created_utc": 1652690409.0,
                    "response": "He put Central Bank of Jordan down twice, and I only count 32 countries 🤔",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8uov31",
                            "author": "RotgutFeng",
                            "score": 1,
                            "created_utc": 1652726497.0,
                            "response": "Little known fact Jordan has two central banks",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8sc7zs",
                    "author": "obi_wan_baracus",
                    "score": 15,
                    "created_utc": 1652678740.0,
                    "response": "That’s like a quarter of all countries in the world. I am skeptical. Need verification",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8st44b",
                            "author": "The_Estranger_0001",
                            "score": 9,
                            "created_utc": 1652692791.0,
                            "response": "He tweeted it, with the list of countries.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8ssaz2",
                            "author": "itisworking1",
                            "score": 9,
                            "created_utc": 1652692041.0,
                            "response": "Why would the president of el Salvador lie about this though?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8stq7k",
                                    "author": "PokeyTifu99",
                                    "score": -7,
                                    "created_utc": 1652693355.0,
                                    "response": "because he has an obscene amount of money wrapped up in crypto and needs the market to go back up to cash out. Just my guess though",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8sxiqy",
                                            "author": "Salt-Traffic59",
                                            "score": 17,
                                            "created_utc": 1652696668.0,
                                            "response": "Cash out? For dollars? LOL",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i8sugd5",
                                            "author": "itisworking1",
                                            "score": 9,
                                            "created_utc": 1652694021.0,
                                            "response": "He wouldn't lie about something that can be so easily verified by 44 other countries. There's plenty of other stuff he could lie about that wouldn't be challenged",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8t6pqd",
                                                    "author": "outdatedrhombus",
                                                    "score": -4,
                                                    "created_utc": 1652703009.0,
                                                    "response": "44 other countries might be going to El Salvador. But 44 other countries are not going for the primary purpose of discussing bitcoin. Sorry to burst your bubble",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8tcyoo",
                                                            "author": "itisworking1",
                                                            "score": 6,
                                                            "created_utc": 1652706443.0,
                                                            "response": "😂 please share, as you clearly have inside info",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "i8tkao2",
                                                            "author": "dj_destroyer",
                                                            "score": 1,
                                                            "created_utc": 1652709975.0,
                                                            "response": "Conjecture.",
                                                            "depth": 6,
                                                            "comments": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i8tnydh",
                                            "author": "BuyRackTurk",
                                            "score": 2,
                                            "created_utc": 1652711589.0,
                                            "response": "> and needs the market to go back up to cash out. \n\nLol, why would anyone ever do that ??\n\nYou think people are lining up to trade away the most scarce and reliable asset on the planet for some toilet paper grade IOU's from a banana republic being run by an undead dementia patient ?",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                },
                                {
                                    "id": "i8us6kp",
                                    "author": "chickunsendwich",
                                    "score": -1,
                                    "created_utc": 1652727854.0,
                                    "response": "The president of El Salvador is an influencer-turned-dictator. His entire presidency and pre-presidential existence has been rooted in lies and false hype.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8v4bqr",
                                            "author": "itisworking1",
                                            "score": 1,
                                            "created_utc": 1652732825.0,
                                            "response": "Cry harder",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8v1phe",
                            "author": "legendone80",
                            "score": 1,
                            "created_utc": 1652731754.0,
                            "response": "I look forward to your updates about this. \n\nWay to lead not only El Salvador, but the world into the next financial system.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8srml4",
                    "author": "Generationhodl",
                    "score": 3,
                    "created_utc": 1652691432.0,
                    "response": "Hm, lets wait for more sources. But I guess a lot of the \"poor\" countries will adopt bitcoin step by step. May take some time but I think in the long run they will benefit from it. \n\nAs always, its just a patience game, keep on stacking and have a long timeframe like 10 years and more. I don't think that bitcoin will make huge price jumps upwards this year, but if we will stay in the 20k-30k $ Range it would be huge for the upcoming halving and bullrun.\n\nWith rising inflation and rising prices for food, gas and renting I think bitcoin will be one of the few chances to build up wealth over the next years. Hell I'm not even sure if I want to buy property in my country longterm... I fear that there will be a smiliar house pricing bubble like in america.. I really would like to have some nice property outside of a big city but with all the prices rising and interest rates rising I'm not sure if I would like to have a debt of like 400k € for the next 30 years..",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8slul4",
                    "author": "s3k2p7s9m8b5",
                    "score": 15,
                    "created_utc": 1652686232.0,
                    "response": "He is a great President, he just announced this also:\n\nhttps://twitter.com/nayibbukele/status/1525946444645113857\n\nTranslation:\n\n>  \"Tomorrow we start delivering tablets to 100% of children studying from 1st to 3rd grade in all our public schools. And in 45 days, we will finish delivering laptops to 100% of children and young people studying from 4th grade to high school.\"",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8sznol",
                            "author": "Funkymonks6",
                            "score": 6,
                            "created_utc": 1652698359.0,
                            "response": "Yah... the coolest dictator out there..",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8t52ye",
                                    "author": "gorilla--",
                                    "score": 7,
                                    "created_utc": 1652702015.0,
                                    "response": "Ehh, if you want to see a dictator in Central America, you start in Nicaragua.\n\nThe rest are probably just regular corrupt or stupid, like much of the world.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8t3kbr",
                            "author": "Plenty_Flounder1447",
                            "score": 1,
                            "created_utc": 1652701052.0,
                            "response": "because giving free shit is easier than creating quality jobs",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8t7so0",
                                    "author": "j4_jjjj",
                                    "score": 1,
                                    "created_utc": 1652703651.0,
                                    "response": "Who cares about job creation? This aint the stock market.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8t8des",
                                            "author": "Plenty_Flounder1447",
                                            "score": 2,
                                            "created_utc": 1652703985.0,
                                            "response": "are you dumb?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8t8f6u",
                                                    "author": "j4_jjjj",
                                                    "score": 1,
                                                    "created_utc": 1652704015.0,
                                                    "response": "Quite the opposite, actually.\n\nWould you like to discuss or just name call?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8t8jz3",
                                                            "author": "Plenty_Flounder1447",
                                                            "score": -5,
                                                            "created_utc": 1652704091.0,
                                                            "response": "your reply makes no sense",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8t8lw8",
                                                                    "author": "j4_jjjj",
                                                                    "score": 6,
                                                                    "created_utc": 1652704122.0,
                                                                    "response": "\"Are you dumb?\"",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i8udlkk",
                                            "author": "ILikePracticalGifts",
                                            "score": 0,
                                            "created_utc": 1652722027.0,
                                            "response": "Wait the fuck? What does job creation have to do with the stock market?",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8t80sm",
                            "author": "sl479",
                            "score": 1,
                            "created_utc": 1652703782.0,
                            "response": "He’s quite corrupt and dodgy",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8udc0r",
                            "author": "Chin900",
                            "score": 1,
                            "created_utc": 1652721921.0,
                            "response": "Bro is also out there arresting people who have suspicious tattoos.  Love what he does for Bitcoin but outside of that… glad he’s not my prez",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8s524r",
                    "author": "EvaUnit_03",
                    "score": 12,
                    "created_utc": 1652674166.0,
                    "response": "We need to make sure the first picture they see in the meeting is Marge holding bitcoin with El salvador as her face saying they just think its neat.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8u6eae",
                            "author": "cryptkings",
                            "score": 1,
                            "created_utc": 1652719177.0,
                            "response": "Praying for President Bukele and those who have put this historical effort together.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8sj9zx",
                    "author": "s3k2p7s9m8b5",
                    "score": 7,
                    "created_utc": 1652684089.0,
                    "response": "Let's get this to the front page of Reddit!\n\nThis post should have tens of thousands of upvotes.\n\nMODS: Please sticky it!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8u08dz",
                            "author": "loolery",
                            "score": 2,
                            "created_utc": 1652716696.0,
                            "response": "Consistency and persistence of orange pilling will prove successful. \n\nHats off to Nayib Bukele for leading the charge for Bitcoin adoption.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8s6vwj",
                    "author": "Marcion_Sinope",
                    "score": 10,
                    "created_utc": 1652675292.0,
                    "response": "Chad move.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8u1nik",
                            "author": "shaman84",
                            "score": 4,
                            "created_utc": 1652717269.0,
                            "response": "Countries across the world finally have options of what to use for currency inside their borders for the first time in over 100+ years.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8udviy",
                                    "author": "ILikePracticalGifts",
                                    "score": 2,
                                    "created_utc": 1652722139.0,
                                    "response": "What in Sam hell are you talking about? 🤣\n\nThey can create/adopt whatever currency they want.",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8v5390",
                                    "author": "Hughski",
                                    "score": 1,
                                    "created_utc": 1652733141.0,
                                    "response": "Lmao wtf",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8s7xsh",
                    "author": "IndianaGeoff",
                    "score": 10,
                    "created_utc": 1652675961.0,
                    "response": "I wonder if they will discuss having balanced budgets?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8stqkx",
                            "author": "DatBuridansAss",
                            "score": 13,
                            "created_utc": 1652693364.0,
                            "response": "Just as Bitcoin lowers time preference on an individual level, it will do the same on a national fiscal level. You come for the gains and cool technology, but if you hang around Bitcoin long enough you end up becoming frugal and financially disciplined. Any country that adopts a Bitcoin standard will be required to maintain a reasonably balanced budget if they want to keep the lights on. \n\nThe reason the US will be one of the last countries to officially join the Bitcoin Standard is they are addicted to their printing press. It gives them godlike power and they aren't going to give that up lightly. These smaller nations have nothing to lose and everything to gain by plugging in to Bitcoin now while it's early.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8t73vk",
                                    "author": "outdatedrhombus",
                                    "score": -4,
                                    "created_utc": 1652703249.0,
                                    "response": "Running a fiscal deficit isn't a bad thing. Nation states are not analogous to individual households - requiring all nations to run balanced budgets essentially every year would be an economic disaster",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8t7jns",
                                            "author": "DatBuridansAss",
                                            "score": 9,
                                            "created_utc": 1652703510.0,
                                            "response": "Said the Keynesian",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8t7tjf",
                                                    "author": "outdatedrhombus",
                                                    "score": -2,
                                                    "created_utc": 1652703665.0,
                                                    "response": "....and every other school of economics bar one dead end backwater",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8t8bbe",
                                                            "author": "DatBuridansAss",
                                                            "score": 5,
                                                            "created_utc": 1652703951.0,
                                                            "response": "Which happens also to be the one that Bitcoin is heavily based upon.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8t9gjy",
                                                                    "author": "outdatedrhombus",
                                                                    "score": -1,
                                                                    "created_utc": 1652704600.0,
                                                                    "response": "Bitcoin is silent about economics, most of this sub Reddit however seem to believe that the school of economic thought which has been dead for around a century and which has been one of the least influential is how we should organise the world. \n\nAbout the only thing going for it is that it's easy to understand, so I guess it's not a huge surprise",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i8tanl2",
                                                                            "author": "DatBuridansAss",
                                                                            "score": 4,
                                                                            "created_utc": 1652705245.0,
                                                                            "response": "The supply cap disagrees",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i8tctsp",
                                                                                    "author": "outdatedrhombus",
                                                                                    "score": 2,
                                                                                    "created_utc": 1652706372.0,
                                                                                    "response": "Austrian economists believe that the monetary supply should grow at the same pace as production and they also aren't fussed about inflation, they are concerned that inflation creates distortion through different goods increases in price at variable rates.\n\nBut now we've strayed onto monetary policy when the initial critique I made was about your view of fiscal policy",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i8tej6k",
                                                                                            "author": "DatBuridansAss",
                                                                                            "score": 4,
                                                                                            "created_utc": 1652707241.0,
                                                                                            "response": "Austrians believe that any amount of money is equally sufficient for an economy. There is no need for it to grow along with the economy. Read Salerno, Hulsmann, Rothbard, or Mises for reference. \n\nFiscal and monetary policy are intimately related, since the only way to realistically finance deficit spending in the long term is with an inflationary money supply. You need a central bank to be the buyer of last resort for the scheme to work. \n\nIn a Bitcoin world, where we are postulating that a digital currency modeled on economic dead end backwater theories of the 19th century will somehow have become the reserve currency of the world, governments will not be able to inflate their money supply to buy their own debts anymore, or at least doing so will carry risks similar to those faced by central banks under the gold standard.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "i8tkor5",
                                                            "author": "SunnyDayShadowboxer",
                                                            "score": 2,
                                                            "created_utc": 1652710149.0,
                                                            "response": "Just because a large majority hold a perpetuate the belief in some model that doesn't make that model the truth or best option available. Not arguing one way or the other, just saying.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8ts961",
                                                                    "author": "outdatedrhombus",
                                                                    "score": 1,
                                                                    "created_utc": 1652713405.0,
                                                                    "response": "To be clear I'm not calling it a dead end backwater because no one believes in it. I call it that because they (intentionally) have no economic models which can be tested. It's essentially economics by common sense which sounds great - but the world is way more complex than our simple monkey minds could imagine. If there was validity to the model they would have predictions and test them, they fact that they don't speaks volumes.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i8ttlwn",
                                                                            "author": "SunnyDayShadowboxer",
                                                                            "score": 1,
                                                                            "created_utc": 1652713971.0,
                                                                            "response": "I'd also point out that our simple monkey minds can't seem to resist the power of the printing press/coin clipping/debasement (call it whatever you want) which historically leads to the same outcome without fail.",
                                                                            "depth": 8,
                                                                            "comments": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8symhj",
                            "author": "Gamerpassword",
                            "score": 1,
                            "created_utc": 1652697562.0,
                            "response": "Ye that would be nice. They agree to buy a certain amount over time until it hits a threshold, until it is kind of stable.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8uw01w",
                            "author": "karabaster",
                            "score": 1,
                            "created_utc": 1652729430.0,
                            "response": "As long as this is not for the central bank digital curency  ( central bank) means centralised.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8sc2ls",
                    "author": "E-renter",
                    "score": 8,
                    "created_utc": 1652678635.0,
                    "response": "WOW. When central banks get fomo, look out above!! It's coming soon.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8spg0a",
                            "author": "PuggyPugg",
                            "score": 1,
                            "created_utc": 1652689431.0,
                            "response": "Banking to the unbanked is the treasure whom never the traditional bank pay attention before.\n\nBut the bankers just they're starting to realize how huge it's the market an how many opportunities could have there.\n\nNow is the time to invest before to late my good felas .",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8scocb",
                    "author": "maininshadow",
                    "score": 6,
                    "created_utc": 1652679064.0,
                    "response": "1, 2, 44: Slowly then suddenly.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8u0yxe",
                            "author": "juntilo",
                            "score": 1,
                            "created_utc": 1652716992.0,
                            "response": "Two countries made Bitcoin a legal tender, 193 more to go. We could do this .",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8si372",
                    "author": "III1IIIIIII1IIIIII1I",
                    "score": 7,
                    "created_utc": 1652683146.0,
                    "response": "The list of nations attending reads like an excerpt from this classic song: https://youtu.be/V1508wboZXk",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8sjikr",
                            "author": "s3k2p7s9m8b5",
                            "score": 2,
                            "created_utc": 1652684286.0,
                            "response": "Or this one:\n\n(Unstoppable!!!)\n\nhttps://www.youtube.com/watch?v=nU7dxkIz1Vs\n\nFirst slowly... then suddenly!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8u07yz",
                                    "author": "stawros74",
                                    "score": 1,
                                    "created_utc": 1652716691.0,
                                    "response": "He is taking the lead in defining new financial rules for an honest and inclusive global economic model .",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8spmnw",
                    "author": "milkonyourmustache",
                    "score": 6,
                    "created_utc": 1652689602.0,
                    "response": "Game theory. Only a matter of time.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8u38d6",
                    "author": "bailianjiao",
                    "score": 3,
                    "created_utc": 1652717911.0,
                    "response": "Even if they get rid of him, Nayib Bukele will be remembered as one of the most influential people of remembered history!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8v4pl4",
                            "author": "LayPessimist",
                            "score": 1,
                            "created_utc": 1652732984.0,
                            "response": "You can perhaps kill the man, but you will never kill the ideas.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8sr18o",
                    "author": "CryptoBlobbie",
                    "score": 2,
                    "created_utc": 1652690883.0,
                    "response": "Anyone found a source from the named nations confirming attendance yet?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ttq51",
                    "author": "rhaphazard",
                    "score": 2,
                    "created_utc": 1652714020.0,
                    "response": "Truly fulfilling the mission of decentralized finance.\n\nIt always starts with the small players while the establishment sits on their laurels.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8uwnhp",
                    "author": "InterPool_sbn",
                    "score": 2,
                    "created_utc": 1652729696.0,
                    "response": "Now THAT is actual quality leadership!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8v40jr",
                            "author": "LayPessimist",
                            "score": 1,
                            "created_utc": 1652732697.0,
                            "response": "If only our politicians were half the leader he is.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8v29y4",
                    "author": "infopocalypse",
                    "score": 1,
                    "created_utc": 1652731987.0,
                    "response": "In other news: The World Bank and IMF are \"Deeply concerned\".",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8sb6bt",
                    "author": "jc1890",
                    "score": 6,
                    "created_utc": 1652678033.0,
                    "response": "But I thought people were already planning the funeral of El Salvador due to the BTC draw down? Hmmm....",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8so2iy",
                            "author": "losh11",
                            "score": 4,
                            "created_utc": 1652688180.0,
                            "response": "I think Bitcoin is only 2% of their reserves. The economic problems they're having isn't due to Bitcoin.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8so611",
                                    "author": "jc1890",
                                    "score": 2,
                                    "created_utc": 1652688264.0,
                                    "response": "Absolutely. It’s a reference to the funny shitposts on here recently",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8shz4n",
                            "author": "Snow75",
                            "score": 3,
                            "created_utc": 1652683054.0,
                            "response": "Nobody uses Bitcoin here.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8si0vc",
                                    "author": "jc1890",
                                    "score": 1,
                                    "created_utc": 1652683093.0,
                                    "response": "I was just there, that’s not true lol",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8siac0",
                                            "author": "Snow75",
                                            "score": 7,
                                            "created_utc": 1652683297.0,
                                            "response": "And I live here.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8sibqz",
                                                    "author": "jc1890",
                                                    "score": -4,
                                                    "created_utc": 1652683329.0,
                                                    "response": "And your point? Lol",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8sikj6",
                                                            "author": "Snow75",
                                                            "score": 1,
                                                            "created_utc": 1652683524.0,
                                                            "response": "It’s hard to collapse an economy with something that doesn’t exist.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8sirjc",
                                                                    "author": "jc1890",
                                                                    "score": 4,
                                                                    "created_utc": 1652683679.0,
                                                                    "response": "Bruh, lol you don’t detect sarcasm well do you?\n\nNot to mention, you don’t pay attention to Bitcoin City and the bonds too I assume.\n\nAlso, don’t say absolute statements like nobody uses it here because I saw it with my own eyes. I visited El Salvador because I am curious and almost every local I’ve met likes how it’s going. Met a few OG bitcoiners too. 🙂",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i8sjaf1",
                                                                            "author": "Snow75",
                                                                            "score": 11,
                                                                            "created_utc": 1652684099.0,
                                                                            "response": "Who do you think is more familiar with the country? A foreigner who went to a turistic area or someone who lives here?\n\nSalvadorans don’t use Bitcoin, nowadays, drunkards use the roof over the atms to sleep, and thanks to massive scams, citizens are permanently locked out from using the state sponsored app, which is the only one you can use with those atms.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i8sjk0t",
                                                                                    "author": "jc1890",
                                                                                    "score": -1,
                                                                                    "created_utc": 1652684319.0,
                                                                                    "response": "You may be right about those things but that does not mean they’re mutually exclusive. You’re one data point as far as I am concerned and like the stories and the people I’ve met there ALSO live in El Salvador.\n\nThe common theme from the opinions I’ve heard is that things are getting better but it won’t happen overnight. Also, you’re aware that you can just not use the state-sponsored wallet, right?",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i8sjnmh",
                                                                                            "author": "Snow75",
                                                                                            "score": 0,
                                                                                            "created_utc": 1652684401.0,
                                                                                            "response": "A ver, demostralo\n\nAnd no, you can’t use anything but the state sponsored wallet. Nobody has any other form of Bitcoin wallet here.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        },
                                                                                        {
                                                                                            "id": "i8t3w6t",
                                                                                            "author": "jl2l",
                                                                                            "score": 0,
                                                                                            "created_utc": 1652701260.0,
                                                                                            "response": "You're a fucking shill and a retard.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8u1dtv",
                            "author": "MD14620",
                            "score": 1,
                            "created_utc": 1652717160.0,
                            "response": "People should read more about the Bitcoin Halving, it is coming, it will be massive, prepare accordingly .",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8s547c",
                    "author": "BigDeezerrr",
                    "score": 2,
                    "created_utc": 1652674203.0,
                    "response": "China is attending according to that map???",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8s7dzo",
                            "author": "Jabberjunky",
                            "score": 11,
                            "created_utc": 1652675615.0,
                            "response": "There is china likes bitcoin again news.....I figure you cannot have china fud without it so yeah.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8s7u0j",
                                    "author": "BigDeezerrr",
                                    "score": 4,
                                    "created_utc": 1652675897.0,
                                    "response": "That's rich. China holding a boom box over their head outside claiming they've changed",
                                    "depth": 3,
                                    "comments": []
                                },
                                {
                                    "id": "i8tl0ji",
                                    "author": "tom1018",
                                    "score": 1,
                                    "created_utc": 1652710297.0,
                                    "response": "Can't ban something again until you unban it. 🤷‍♂️",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8sgllx",
                    "author": "DagiUr",
                    "score": 7,
                    "created_utc": 1652681967.0,
                    "response": "fuck countries :D we are 1 big country called earth",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8t1p73",
                            "author": "manginahunter",
                            "score": 2,
                            "created_utc": 1652699818.0,
                            "response": "Most people still believe in the admiralty/law of sea system we live in. With \"countries\" and \"flags\" even if they are all fictitious legal entities...",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8t3oqr",
                            "author": "Melmokz",
                            "score": 2,
                            "created_utc": 1652701130.0,
                            "response": "This comment hurts.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8t457l",
                            "author": "kellnoidiii",
                            "score": 2,
                            "created_utc": 1652701420.0,
                            "response": "People describing geo-political nation-states and bro out here high as hell like \"we live on the same object in space\"",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8snwly",
                            "author": "itsmehali",
                            "score": 1,
                            "created_utc": 1652688040.0,
                            "response": "Well maybe you think, but not others.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8u0wj9",
                            "author": "airofgone",
                            "score": 1,
                            "created_utc": 1652716966.0,
                            "response": "Gradually, then suddenly. Love to see El Salvador spearheading worldwide bitcoin adoption .",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8ue2kj",
                            "author": "ILikePracticalGifts",
                            "score": 1,
                            "created_utc": 1652722217.0,
                            "response": "This is a great way to cease to exist",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8ujm9h",
                            "author": "PRMan99",
                            "score": 1,
                            "created_utc": 1652724395.0,
                            "response": "Is DagiUr the Antichrist?",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8s7d81",
                    "author": "RobertConnelly1",
                    "score": 3,
                    "created_utc": 1652675602.0,
                    "response": "😎😎😎😎😎",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8sqtf4",
                            "author": "yoderjr8940",
                            "score": 1,
                            "created_utc": 1652690682.0,
                            "response": "Good to see all these countries come together as a sign of unity & resistance towards the authoritarian regimes across the world.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8t7asv",
                                    "author": "outdatedrhombus",
                                    "score": 1,
                                    "created_utc": 1652703363.0,
                                    "response": "I assume this is sarcasm. If so, well played",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8saklz",
                    "author": "DiamondHandsDarrell",
                    "score": 3,
                    "created_utc": 1652677631.0,
                    "response": "Get those tendies warm! 😍",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8u18vi",
                            "author": "ailovebtc",
                            "score": 1,
                            "created_utc": 1652717104.0,
                            "response": "See, this is why we need more outreach and communication from central banks! \n\nThis is a great example of cooperation between central banks and helps to build a better understanding between them.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8sgq5t",
                    "author": "JunoKat",
                    "score": 2,
                    "created_utc": 1652682061.0,
                    "response": "Gradually and then suddenly!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8uo2j1",
                            "author": "zhouka888",
                            "score": 1,
                            "created_utc": 1652726178.0,
                            "response": "Keep up the good work. It will pays off one day soon...Us in the Crypto world believe in you. Ayibobo.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8sriqj",
                    "author": "Pin_ups",
                    "score": 2,
                    "created_utc": 1652691330.0,
                    "response": "Good, use nuclear energy for Bitcoin instead of weapons. Uranium can be extracted from stones now and south America are full of it.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8svl4r",
                    "author": "Mr_Again",
                    "score": 3,
                    "created_utc": 1652695037.0,
                    "response": "Lot's of people celebrating this news here, it's odd to see. El Salvador might have to default on its sovereign debt due to bitcoin's recent fall. El Salvador is actually a disaster story for bitcoin right now. Moody's has just downgraded salvadorian debt to \"junk\" level, which means the only people they can go to to help them are the IMF, who are insisting that the get rid of bitcoin as legal tender. Will be interesting to see this play out but it's very much not a rocket ships to the moon situation.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8sotbc",
                    "author": "MIP_PL",
                    "score": 1,
                    "created_utc": 1652688855.0,
                    "response": "I hope CIA does not decide to bring “democracy” to those countries.   \n\n\n\\*wink, wink\\*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ssig2",
                    "author": "Hugepenis1",
                    "score": 2,
                    "created_utc": 1652692234.0,
                    "response": "President Biden pooped his pants",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8t6ygn",
                            "author": "thejokertoker05",
                            "score": 3,
                            "created_utc": 1652703158.0,
                            "response": "Again...",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8t62e6",
                    "author": "Tatzdan1492",
                    "score": 2,
                    "created_utc": 1652702613.0,
                    "response": "[well...](https://twitter.com/mxgxw_gamma/status/1526063709054967808?t=Vx5V2ZViWa1JB88zDzWyIw&s=19)",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8ug56s",
                            "author": "lemmingstyle",
                            "score": 2,
                            "created_utc": 1652723037.0,
                            "response": "seems to me like he is not lying, maybe a bit misleading.\nHe doesnt say in his tweet, that they meet to discuss bitcoin.      \nHe says one of the talking points is the \"bitcoin rollout and its benefits in his country.\"      \nwith this in his announcement the other stuff sounds bitcoin related aswell, which makes this maybe misleading. In general tho it seems just like the event you linked. So a bit of both maybe",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8tveet",
                            "author": "dragonitanair",
                            "score": -1,
                            "created_utc": 1652714719.0,
                            "response": "fuck you from bursting the bubble. We need more FIAT to get into BTC",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8u4cyg",
                                    "author": "Tatzdan1492",
                                    "score": 2,
                                    "created_utc": 1652718361.0,
                                    "response": "what?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8sltp9",
                    "author": "savagefishstick",
                    "score": 0,
                    "created_utc": 1652686210.0,
                    "response": "BREAKING!! Look what just BROKE OUT! AAHH!! HEALINES!!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8t5lrp",
                    "author": "FanInternational9315",
                    "score": 1,
                    "created_utc": 1652702338.0,
                    "response": "A couple questions… 1) is this fake news or is it accurate, and 2) is it 44 sensible states which would be meeting or would it be 44 of the poorest states",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8ugijf",
                            "author": "tildes",
                            "score": 2,
                            "created_utc": 1652723183.0,
                            "response": "https://www.reddit.com/r/CryptoCurrency/comments/uqt866/the_president_of_el_salvador_has_said_44_central/i8tx5uv",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8uhuzh",
                                    "author": "FanInternational9315",
                                    "score": 2,
                                    "created_utc": 1652723709.0,
                                    "response": "Thank you for that",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8tlgnn",
                    "author": "clickworker2019",
                    "score": 1,
                    "created_utc": 1652710498.0,
                    "response": "Anyone thinking this will save bitcoin is delusional.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8toar1",
                            "author": "_CypherIO",
                            "score": 1,
                            "created_utc": 1652711736.0,
                            "response": "Save Bitcoin from what?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8trvnp",
                                    "author": "clickworker2019",
                                    "score": 0,
                                    "created_utc": 1652713249.0,
                                    "response": "From crashing further.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8ttzcz",
                                            "author": "_CypherIO",
                                            "score": 2,
                                            "created_utc": 1652714128.0,
                                            "response": "OK you are talking about the short term price action.\n\nWell, as far as know, that's extremely difficult if not impossible to predict. However, the long term price trend is clearly showing a strong uptrend. If you really want to get the big picture here, you should look at Bitcoin price chart and check the price action since his creation in 2009. Even at the current price, it has outperformed any other kind of investments (stocks, index, commodities, gold, silver, etc.).",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8u6ldl",
                                                    "author": "clickworker2019",
                                                    "score": 2,
                                                    "created_utc": 1652719252.0,
                                                    "response": "I hope you're right. I will keep holding anyway.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8tvimu",
                    "author": "GilgameshSmesh",
                    "score": 0,
                    "created_utc": 1652714768.0,
                    "response": "This guy is a fucking moron.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8v4sv5",
                            "author": "LayPessimist",
                            "score": 1,
                            "created_utc": 1652733022.0,
                            "response": "Only morons say such things without any argument.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8smjn3",
                    "author": "sylsau",
                    "score": 1,
                    "created_utc": 1652686844.0,
                    "response": "More and more countries are interested in adopting Bitcoin as their official currency, as El Salvador has done. Not much is missing to take the plunge. This type of meeting will clarify things and make some people take the plunge, no doubt.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8smkj6",
                    "author": "beloboi",
                    "score": 1,
                    "created_utc": 1652686865.0,
                    "response": "maybe he sent an invitation to 44 other countries. that does not mean, that anyone follows ..",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8stg05",
                    "author": "The_Estranger_0001",
                    "score": 1,
                    "created_utc": 1652693092.0,
                    "response": "If 43 more countries buying Bitcoin in their national reserve, I guess it can kill SEC’s nonsense for delaying spot ETF.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8shlcn",
                    "author": "MalaysianinPerth",
                    "score": 1,
                    "created_utc": 1652682747.0,
                    "response": "Buy the dip",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8u0g8z",
                            "author": "serega28rus",
                            "score": 1,
                            "created_utc": 1652716785.0,
                            "response": "Finally the world needs to respect a global currency and buy the dip.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8srhc1",
                    "author": "JohnRandomJohn",
                    "score": 1,
                    "created_utc": 1652691294.0,
                    "response": "So now it begins",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ti31v",
                    "author": "Mostofyouareidiots",
                    "score": 1,
                    "created_utc": 1652708952.0,
                    "response": "I downvote everything with \"BREAKING\" in the title",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8tkezb",
                    "author": "basedisciple",
                    "score": 1,
                    "created_utc": 1652710028.0,
                    "response": "This is some anime shit right here. Huge battle in the next decades will be fought. #TeamBitcoin",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8u4xqr",
                            "author": "EvaUnit_03",
                            "score": 2,
                            "created_utc": 1652718594.0,
                            "response": "if bitcoin can put my brain inside of a robot with the strength of 5 gorillas, im in. or maybe a tiger bot...\n\n[no no no, a giant sexy barbobot!](https://www.youtube.com/watch?v=RZzBplqfDdU)",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8suhac",
                    "author": "Scorpusen",
                    "score": -1,
                    "created_utc": 1652694042.0,
                    "response": "Can anyone explain to me how I am supposed to buy some milk when this is implemented... When the transactions are limited to 2k per block and the fees are higher than my monthly budget? (Bitcoin specifically since we are on this sub)",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8swsj0",
                            "author": "magneticman245",
                            "score": 7,
                            "created_utc": 1652696073.0,
                            "response": "Use the lightning network",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8sz9dm",
                                    "author": "Scorpusen",
                                    "score": 0,
                                    "created_utc": 1652698057.0,
                                    "response": "Sounds like a treat. When the mother of five has to get a hold of some btc she has to also research lighting network and suitable wallet that supports it. \n\nCrypto was created by a genious, and the subsequent development has been evolved out of this complex system and equelly complex form of currency by similar geniouses. It needs to be easy and safe to adopt by billions of people, many who cannot even read or write. Much less have the academic intelligence evolved, or the time to spare to give a damn. \n\nNot hating btw, just stating what I believe is what needs to be addressed asap if crypto (btc (on another layer)) is to really get adopted by the world. Because this is the final goal, right?",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i8tcy4n",
                                            "author": "MegaSuperSaiyan",
                                            "score": 3,
                                            "created_utc": 1652706435.0,
                                            "response": "In the case of El Salvador the government rolled out their own lightning wallet and gave everyone some (like $20?) free BTC. Supposedly they plan to roll out tech education programs to help people get informed as well. \n\nTheir rollout was pretty trash tbh. The government run lightning wallet had tons of issues with liquidity and identity theft, and the education programs are so far non-existent afaik. There are other lightning wallets that worked/are working perfectly fine in El Salvador though (I think strike might be an example) and people that knew enough to not trust a government controlled app had a mostly smooth experience. \n\nPeople have the option to hold their money in dollars and convert to Bitcoin when transacting if they want to avoid the volatility as well.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i8szsye",
                                            "author": "magneticman245",
                                            "score": 5,
                                            "created_utc": 1652698471.0,
                                            "response": "Yeah right now it's not the simplest system to use for most people, but there was a time when the internet was in the same situation. Sending an email used to be more difficult than sending a bitcoin transaction. Innovation is happening every day and things will only get easier over time.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i8t1ce9",
                                                    "author": "Scorpusen",
                                                    "score": 1,
                                                    "created_utc": 1652699569.0,
                                                    "response": "Hope so. I'm putting my money on the line for it. \n\nHowever I am conflicted as to what spread my crypto portfolio should have. Atm I am 50/50 BTC/alts (with most promising wp's). However countries seems to be not interested in alts, only BTC. What is your (personal) take on this conundrum?",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i8t6s13",
                                                            "author": "magneticman245",
                                                            "score": 5,
                                                            "created_utc": 1652703049.0,
                                                            "response": "Personally I see bitcoin from a sound money perspective, and I don't believe any altcoins offer a sound monetary policy that can compete with bitcoin's. No other coin is as decentralised as bitcoin which means bitcoin is the least likely to have its qualities changed, and because bitcoin is the most adopted cryptocurrency, it is the most secure (highest hashrate) and has the most technical innovation. \n\nI used to invest in altcoins but don't see the point anymore outside of the gambling aspect.",
                                                            "depth": 6,
                                                            "comments": []
                                                        },
                                                        {
                                                            "id": "i8tdll3",
                                                            "author": "MegaSuperSaiyan",
                                                            "score": 3,
                                                            "created_utc": 1652706775.0,
                                                            "response": "Countries are not interested in altcoins because they do not provide anything of value to them. They are just as compromised as fiat currency but with more volatility and less historical backing. \n\nBitcoin is incorruptible hard money with a revolutionary new form of consensus-based governance and truly decentralized ownership. This is something you want to know about if you’re a country without control of your own economy, especially if another country is already taking the risk of going first.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i8thk3m",
                                                                    "author": "Scorpusen",
                                                                    "score": 1,
                                                                    "created_utc": 1652708705.0,
                                                                    "response": "I see. So using lighting network will solve the issues of block size and limits. How about the difficulty mining? Won't the increased difficulty eventually make the pow come to a halt? Thereby halting the network? Or do you see countries running the asic miners to keep the network up just to be able to perform transactions? \n\nAlso when you halve the network, doesn't this halve anything on the lighting network? Say 200 years from now, will it be sustainable?\n\nAsking for a friend (aka me)",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i8tisls",
                                                                            "author": "MegaSuperSaiyan",
                                                                            "score": 2,
                                                                            "created_utc": 1652709284.0,
                                                                            "response": "A lot of these questions are still up in the air to a certain extent, which is why there’s large risk to being an early adopter and other countries are so eager to see how things work out for El Salvador. But so far things are going about as well as could possibly be expected. \n\nThe lightning networks still has limitations related to liquidity, security, onboarding, self-custody, etc. None of the issues are fundamentally unsolvable afaik, but they limit how quickly the necessary infrastructure can be set up. \n\nDifficulty-adjustments and mining centralization over the long term are the biggest remaining obstacles for Bitcoin IMO. These rely purely on theoretical game-theory that has no real precedent, so it’s incredibly hard to say how it’ll play out. So far though, it has worked brilliantly as intended to incentivize honest use and maintain consensus despite strong external forces for the contrary.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i8tly11",
                                                                                    "author": "Scorpusen",
                                                                                    "score": 2,
                                                                                    "created_utc": 1652710714.0,
                                                                                    "response": "Thank you for your brilliant reply. \n\nI guess in summary: We'll just have to invest what we can afford to loose and try to follow the development as closely as we can. \n\nAt this point though, crypto will be adopted at some point. Maybe in another similar form, but it is too late to go back. Like you said, we are in the earliest stage of this form of currency. The experience of getting to be in on this exciting era of currency development is beyond words.\n\nBonus question: What kind of wallet do you use? I have put all mine into one that only supports L1, non lighting. But it is a decentralized wallet, so I have my own keys. I prefer it that way seeing as the community struggles with exploits to certain exchanges.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i8tuuqm",
                                                                                            "author": "MegaSuperSaiyan",
                                                                                            "score": 2,
                                                                                            "created_utc": 1652714490.0,
                                                                                            "response": "Yes, I think we can be confident we will see wide-scale adoption at some point by now, but the impacts of this are too large to be predictable yet IMO. \n\nI keep most of my “savings” in cold storage and currently have a few thousand sats in a Muun lightning wallet that I haven’t found a use for. I’m still deciding if I trust that they’re actually non-custodial though.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "id": "i8uy7vs",
                                            "author": "BigDeezerrr",
                                            "score": 1,
                                            "created_utc": 1652730327.0,
                                            "response": "There needs to be some more work done to make the system easier to use. I'm sure they could create a lightning card that is similar looking to a credit card that the mother of five can just swipe. You could then move small amounts to the lightning wallet connected to the card and just use it like a wallet. \n\nI've seen BTC compared the the early days of the internet when you needed a phone line and it was pretty confusing to connect and use. I am hopefully we can make it as easy to use as the internet on your phone one day.",
                                            "depth": 4,
                                            "comments": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i8t4vew",
                            "author": "GrindingWit",
                            "score": 2,
                            "created_utc": 1652701883.0,
                            "response": "Lightening",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8t56t9",
                            "author": "_CypherIO",
                            "score": 3,
                            "created_utc": 1652702083.0,
                            "response": "> Can anyone explain to me how I am supposed to buy some milk when this is implemented... \n\nYou should look at the lightning network.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8sjqyf",
                    "author": "Hodl2",
                    "score": -3,
                    "created_utc": 1652684470.0,
                    "response": "BREAKING: BREAKING: has made it to Reddit and it's BREAKING: my brain!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8s7bbw",
                    "author": "ryanryans425",
                    "score": -15,
                    "created_utc": 1652675569.0,
                    "response": "He’s trying to sucker other countries into taking his bags",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8s7zts",
                            "author": "RadManSpliff",
                            "score": 4,
                            "created_utc": 1652675996.0,
                            "response": "Early movers advantage",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8s7qxf",
                            "author": "kenny_3000",
                            "score": 1,
                            "created_utc": 1652675843.0,
                            "response": "Chad move",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8u5csw",
                                    "author": "Toxic1292",
                                    "score": 1,
                                    "created_utc": 1652718765.0,
                                    "response": "Game Theory is a beautiful thing to watch unfold in real time. \n\nGrateful to be alive to witness the mainstreamification of Bitcoin.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8sgshp",
                    "author": "PenileElephantiasis",
                    "score": -4,
                    "created_utc": 1652682112.0,
                    "response": "Probably there to discuss ways for El Salvador to avoid defaulting on its debt next month.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8u0ofx",
                            "author": "davidreimann",
                            "score": 1,
                            "created_utc": 1652716874.0,
                            "response": "Another big step for humanity. Thank you sir!\n\nAnd remind them all it's Bitcoin only, altcoins get you REKT .",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8so6ts",
                            "author": "losh11",
                            "score": -1,
                            "created_utc": 1652688284.0,
                            "response": "buy their bonds?",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8sooyk",
                                    "author": "Professional-Tea2397",
                                    "score": 1,
                                    "created_utc": 1652688744.0,
                                    "response": "the \"volcano\" bonds were pulled because there wasn't enough demand",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8snxfl",
                    "author": "itsmehali",
                    "score": -4,
                    "created_utc": 1652688058.0,
                    "response": "All this countries are 3rd world poor countries tho...",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8sxhu7",
                            "author": "celestialhopper",
                            "score": 3,
                            "created_utc": 1652696647.0,
                            "response": "They are exactly who need it the most.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8sxqcc",
                            "author": "Alternative_Week3023",
                            "score": 2,
                            "created_utc": 1652696842.0,
                            "response": "Hence, suggest you trying to read up on what IMF does and how it, together with developed nations such as US and EU, to use their currencies (USD / EURO) to enslave developing nations ( dollarised nations) in perpetual monetary slavery! No difference from China: Belt and Road Initiative.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8t3b9u",
                    "author": "HenryHenderson",
                    "score": 0,
                    "created_utc": 1652700889.0,
                    "response": "Come on, this is just hopium bullshit. Bukele has a vested interest, the list of countries sounds like a compilation of corrupt failed financial groups around the world and just because one or two officials from each of those nations are going for a jolly boys outing pissup on their taxpayers funded behalf, doesn't mean anything.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8t4sy4",
                    "author": "dmv1975",
                    "score": 0,
                    "created_utc": 1652701841.0,
                    "response": "BREAKING",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8tykzh",
                    "author": "fsuinvestr",
                    "score": 0,
                    "created_utc": 1652716027.0,
                    "response": "Aaaand Bitcoin goes down 2000$",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8sc23c",
                    "author": "manbrrrpig",
                    "score": -8,
                    "created_utc": 1652678625.0,
                    "response": "Seems dangerous. IMF could make a move when they’re all together. Or crash the price during the meeting.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8scgeg",
                            "author": "imslagger",
                            "score": 7,
                            "created_utc": 1652678907.0,
                            "response": "Wat",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8sdqde",
                                    "author": "vengefulspirit99",
                                    "score": 9,
                                    "created_utc": 1652679814.0,
                                    "response": "There's a lot of conspiracy guys on this sub. Btc attracts a lot of gold bug people.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i8sfwri",
                            "author": "NearbyTurnover",
                            "score": 4,
                            "created_utc": 1652681430.0,
                            "response": "IMF is pure cancer, but too set in their ways to try something like that. And if so, word would get out somehow and they would be squeezed.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8shovd",
                            "author": "Business_Smile",
                            "score": 2,
                            "created_utc": 1652682825.0,
                            "response": "This isn't an action movie 😀",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8sqpf0",
                            "author": "dolfcao",
                            "score": 1,
                            "created_utc": 1652690580.0,
                            "response": "Red pill them all by sending them all 7 Satoshi then have them add more to it themselves & spend it among each other.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8shkmg",
                            "author": "ForcedLoginIsFacism",
                            "score": -1,
                            "created_utc": 1652682731.0,
                            "response": "IMF would like to start WWIII in before",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8t3ker",
                    "author": "RogueR1",
                    "score": -1,
                    "created_utc": 1652701053.0,
                    "response": "Doesn't mean shit if it's tiny Latin American countries. We need a few big players and we good",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8tiw27",
                            "author": "edweeen",
                            "score": 2,
                            "created_utc": 1652709328.0,
                            "response": "Rome wasn’t built in a day. Take a step back and see how far we’ve come.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8t5m09",
                    "author": "bredaredhead",
                    "score": -1,
                    "created_utc": 1652702342.0,
                    "response": "Because they lost so much capital?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ue8ga",
                    "author": "noetus",
                    "score": -1,
                    "created_utc": 1652722282.0,
                    "response": "Nothing like trying to look like less of a fool by getting other fools to join you.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8sgyqq",
                    "author": "DirtyMami",
                    "score": 1,
                    "created_utc": 1652682249.0,
                    "response": "So why isn't btc pumping?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8u94h5",
                            "author": "Stevegrig",
                            "score": 4,
                            "created_utc": 1652720246.0,
                            "response": "I have a bad feeling some sort of natural disaster is going to come rolling through .",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8snt4r",
                            "author": "Jaseur",
                            "score": 1,
                            "created_utc": 1652687956.0,
                            "response": "The bear doesn't care.",
                            "depth": 2,
                            "comments": []
                        },
                        {
                            "id": "i8ueb8a",
                            "author": "ILikePracticalGifts",
                            "score": 1,
                            "created_utc": 1652722313.0,
                            "response": "wen lambo???",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8siywh",
                    "author": "simplelifestyle",
                    "score": 1,
                    "created_utc": 1652683839.0,
                    "response": "This is awesome!\n\n[Bitcoin is Unstoppable!](https://www.youtube.com/watch?v=nU7dxkIz1Vs)",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8ujbrq",
                            "author": "petkovst",
                            "score": 1,
                            "created_utc": 1652724279.0,
                            "response": "It's worth noting the 44 countries have the combined GDP of New York city or even perhaps less so don't expect a moon any time soon!",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8t0u7y",
                    "author": "manginahunter",
                    "score": 1,
                    "created_utc": 1652699213.0,
                    "response": "Wow for real ? Look like some countries really want to get out of that US lead NWO.\n\n\"Sanctions\" and the lose of confidence it triggered aftermath ?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8t7o30",
                    "author": "Aliel1",
                    "score": 1,
                    "created_utc": 1652703579.0,
                    "response": "the reverie!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8tp6xe",
                    "author": "Expensive-Emu-9676",
                    "score": 1,
                    "created_utc": 1652712116.0,
                    "response": "Centralized Banks talking about Decentralize Bitcoin seriously?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8tynjw",
                    "author": "hemzer",
                    "score": 1,
                    "created_utc": 1652716054.0,
                    "response": "Any day Id take news like this .....vs organizations constantly demonizing nations that have resources to plunder or too powerful and needs to be to vanquished",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8u0g55",
                    "author": "bogrigol",
                    "score": 1,
                    "created_utc": 1652716784.0,
                    "response": "Government officials? Private sector reps? Retail investors? Is this just another BYC conference?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8u3y3v",
                            "author": "EvaUnit_03",
                            "score": 1,
                            "created_utc": 1652718197.0,
                            "response": "But its sexier because it has its own planned city instead of just a convention hall..",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8u2j8d",
                    "author": "hantageo",
                    "score": 1,
                    "created_utc": 1652717628.0,
                    "response": "Awesome. He should all mega buy the dip tomorrow and short squeeze the bitcoin enemies.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8u4jbk",
                    "author": "SwanEnvironmental794",
                    "score": 1,
                    "created_utc": 1652718433.0,
                    "response": "Isn’t there only supposed to be 25 million in existence with no more being produced.  How could this replace billions of dollars and other countries Fiat currencies.  I don’t know anything about BTC as you can tell, and don’t own any, but ask purely for education purposes.",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8ue8n6",
                            "author": "reggie_crypto",
                            "score": 1,
                            "created_utc": 1652722284.0,
                            "response": "It's simple division. The value captured by the Bitcoin network divided by 21 million gives the price per Bitcoin.\n\nEach Bitcoin can be divided to 8 decimal places (12 on the lightning network).\n\nThere is no problem with running out of supply, the value just increases.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8u57uf",
                    "author": "LastRecognition4151",
                    "score": 1,
                    "created_utc": 1652718709.0,
                    "response": "This is huge !",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8u6f83",
                    "author": "ShadowFire139",
                    "score": 1,
                    "created_utc": 1652719188.0,
                    "response": "And what are the goals and meaning of this meeting?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ui2k9",
                    "author": "Cryptzadi",
                    "score": 1,
                    "created_utc": 1652723791.0,
                    "response": "Go BTC!",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8uizpq",
                    "author": "mrcluezo",
                    "score": 1,
                    "created_utc": 1652724147.0,
                    "response": "IMF has entered the chat.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8uk19n",
                    "author": "jt7855",
                    "score": 1,
                    "created_utc": 1652724561.0,
                    "response": "The most effective way to curtail freedoms of a population is through money.  Those that support fiat money wittingly or unwittingly support the curtailments of freedoms.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8upmwi",
                    "author": "PunchingAgreenbush",
                    "score": 1,
                    "created_utc": 1652726813.0,
                    "response": "so the circus?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8uq7wy",
                    "author": "fiercygoat",
                    "score": 1,
                    "created_utc": 1652727050.0,
                    "response": "This is massive",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ustwr",
                    "author": "hissing_viking",
                    "score": 1,
                    "created_utc": 1652728121.0,
                    "response": "I think he is worried about the price as tanking so needs more sovereign pumpers",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8utm4i",
                    "author": "admiralCeres",
                    "score": 1,
                    "created_utc": 1652728449.0,
                    "response": "Any news from the event? Is there a livestream? Thanks",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8v4zg9",
                    "author": "LayPessimist",
                    "score": 1,
                    "created_utc": 1652733098.0,
                    "response": "Lots of IMF lemmings in this thread. Lol.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8v64iu",
                    "author": "pazsworld",
                    "score": 1,
                    "created_utc": 1652733570.0,
                    "response": "This could either way.... The last week debacle might scare them into submission",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8sfe3c",
                    "author": "Itchy_Project5926",
                    "score": -2,
                    "created_utc": 1652681037.0,
                    "response": "BIG circle jerk!",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8sswvb",
                            "author": "lag0255",
                            "score": 1,
                            "created_utc": 1652692603.0,
                            "response": "Nice it’s the best deal that can you do for our country. My president",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i8uqwcw",
                    "author": "Eroq2600",
                    "score": -3,
                    "created_utc": 1652727330.0,
                    "response": "Nayib Bukele is a thug that doesn't even control his own country. If diplomats meet up in 🇸🇻, then they should get their heads checked...",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8usfpb",
                            "author": "chickunsendwich",
                            "score": 0,
                            "created_utc": 1652727957.0,
                            "response": "Bukele, perhaps the most cringe dictator on the face of the planet, is a hero to the bitcoin community so prepare for downvotes.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8v48to",
                                    "author": "LayPessimist",
                                    "score": 1,
                                    "created_utc": 1652732791.0,
                                    "response": "You guys are thugs for making claims about a man unknown to you.\n\nAll you ever \"know\" about him is acquired through corrupted, unreliable and/or biased media channels.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8shl6f",
                    "author": "kingofthejaffacakes",
                    "score": -6,
                    "created_utc": 1652682743.0,
                    "response": "Wah wah, but he deleted his laser eyes and mentions of bitcoin from his profile wah wah. Bitcoin is dead.\n\nEdit: sarcasm people. Was \"wah wah\" not a good enough clue that I was impersonating the people who constantly whine about el Salvador buying bitcoin?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i8v040o",
                            "author": "al77862",
                            "score": 1,
                            "created_utc": 1652731096.0,
                            "response": "This is a very positive development! Sad that South Africa isn't on the list.\n\n South Africa should have used some of it's extensive mineral reserves including gold to buy Bitcoin",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i8v0bf2",
                                    "author": "kingofthejaffacakes",
                                    "score": 1,
                                    "created_utc": 1652731182.0,
                                    "response": "It definitely is. I'm delighted.\n\nHence I was being sarcastic in my downvoted, and clearly misunderstood, post.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i8sr95d",
                    "author": "Officailpaul1",
                    "score": -9,
                    "created_utc": 1652691082.0,
                    "response": "Hey there, how're you doing today? It's awesome having you here, I'm Schuman Paula and I'd love to share with you our Bitcoin Avalon S9 Anti miner network were you'll be able to earn additional 85% of your investment funds in 24hours with well secured mining wallet.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8sx4tq",
                    "author": "Rushmaster27",
                    "score": -3,
                    "created_utc": 1652696357.0,
                    "response": "At this point, I'm tired of roller coaster rides. I'm glad if I get my invested money back and can live in peace again. HAHAHAHHA",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8sstv9",
                    "author": "yongting1992",
                    "score": 0,
                    "created_utc": 1652692527.0,
                    "response": "Alt Headline: countries get together to define rules for \"decentralized\" finance .",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8suk4k",
                    "author": "Dry-Cardiologist2187",
                    "score": 0,
                    "created_utc": 1652694112.0,
                    "response": "IMF doesn't like that. but I guess a lot of these countries can't pay back these predatory loans so yolo.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8svsgw",
                    "author": "Noob313373",
                    "score": 0,
                    "created_utc": 1652695215.0,
                    "response": "Bitcoin is good for less economic strong countries.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8tjhpk",
                    "author": "Familiar_Hotel_5269",
                    "score": 0,
                    "created_utc": 1652709608.0,
                    "response": "Would be shocked if nothing came out of this",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8u0nbd",
                    "author": "geelucke",
                    "score": 0,
                    "created_utc": 1652716861.0,
                    "response": "Yes I too would like to change the world currency order by picking the most illiquid crypto currency. \n\nSounds like the biggest ad for continuing to use the USD.",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}