{
    "subreddit": "BitcoinBeginners",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "ur34nt",
            "title": "Can Mining Pools Jeopardize the Safety of the Network",
            "url": "https://www.reddit.com/r/BitcoinBeginners/comments/ur34nt/can_mining_pools_jeopardize_the_safety_of_the/",
            "author": "Short-Pizza-7433",
            "created_utc": 1652727221.0,
            "score": 1,
            "num_comments": 6,
            "subreddit": "BitcoinBeginners",
            "selftext": "Hi, I've been recently studying more about btc and started wondering about mining pools.\n\nIf a mining pool becomes big enough, they might be able to predict the likelihood of success on mining the next block, right?\n\nCan that be a problem? What could an ill-intentioned actor do if they knew for sure they would get the next block?\n\nIf the misdeed is successful, how can the network realize it happened and defend itself from it?",
            "stickied": false,
            "comments": [
                {
                    "id": "i8uqmuz",
                    "author": "AutoModerator",
                    "score": 1,
                    "created_utc": 1652727221.0,
                    "response": "WassaWassaWassup! Scam Alert! Scammers are particularly active on this sub. They operate via private messages and private chat. If you receive private messages, be extremely careful. Use the **report** link to report any suspicious private message to Reddit.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BitcoinBeginners) if you have any questions or concerns.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8ur8gk",
                    "author": "Upset-Fig-8292",
                    "score": 1,
                    "created_utc": 1652727468.0,
                    "response": "would like a little more in-depth discussion on picking a pool and recommended protections for pools that seem a little sketch",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i8w74ck",
                    "author": "Narmotur",
                    "score": 1,
                    "created_utc": 1652750724.0,
                    "response": "If you are talking about a 51% attack, all they can do is roll back transactions (send a transaction where another pool mines it and then release their heavier chain where the transaction never happened, undoing the transaction), or prevent any other pool from mining blocks (and thus preventing any transactions they want from happening).",
                    "depth": 1,
                    "comments": []
                }
            ]
        }
    ]
}