{
    "subreddit": "Bitcoin",
    "limit": 1000,
    "minimum_score": -5000,
    "sorting_options": [
        "hot",
        "top",
        "new"
    ],
    "posts": [
        {
            "id": "uvc37g",
            "title": "El Salvador Has Shown 44 Countries How Bitcoin Can Bank the Unbanked and Give Them a Better Future. No doubt many of these countries will seize the Bitcoin opportunity in the future. Just a matter of time.",
            "url": "https://inbitcoinwetrust.substack.com/p/el-salvador-has-shown-44-countries",
            "author": "sylsau",
            "created_utc": 1653229738.0,
            "score": 136,
            "num_comments": 55,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9kftk4",
                    "author": "NiceDoctorBeam",
                    "score": 9,
                    "created_utc": 1653230219.0,
                    "response": "Would you rather be the head of a mouse, or the tail of a lion?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9m05ox",
                            "author": "rogerbcashver",
                            "score": 2,
                            "created_utc": 1653255224.0,
                            "response": "Head of a mouse, easily",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9me3q1",
                                    "author": "NiceDoctorBeam",
                                    "score": 2,
                                    "created_utc": 1653262165.0,
                                    "response": "Fellow mouse here.",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9l193t",
                            "author": "Bedroom-Eastern",
                            "score": 2,
                            "created_utc": 1653239465.0,
                            "response": "Whats the meaning of this saying? Im curious",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9n3wzz",
                                    "author": "himtnboy",
                                    "score": 1,
                                    "created_utc": 1653275527.0,
                                    "response": "Would you rather be the small guy taking risks alone or with a few compadres or in the safety of the masses but you take little risk for little reward?",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9kgw0a",
                    "author": "coinfeeds-bot",
                    "score": 4,
                    "created_utc": 1653230713.0,
                    "response": "tldr; El Salvador's President Nayib Bukele recently announced that 32 central banks and 12 financial authorities, the equivalent of 44 countries, were going to meet in El Salvador on May 16th 2022. The meeting was a summit organized by AFI, the Alliance for Financial Inclusion, a Malaysian organization. The purpose of the gathering was to discuss the best ways to ensure greater banking inclusion.\n\n*This summary is auto generated by a bot and not meant to replace reading the original article. As always, DYOR.*",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ldmwc",
                    "author": "SimplyTrolling2234",
                    "score": 8,
                    "created_utc": 1653244885.0,
                    "response": "No doubt? I have some doubts",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9kg1zo",
                    "author": "hairyscrotes",
                    "score": 3,
                    "created_utc": 1653230327.0,
                    "response": "I guess the question is does the gen pop of El Salvador use BTC or not",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9l33qq",
                            "author": "Snow75",
                            "score": 8,
                            "created_utc": 1653240252.0,
                            "response": "You’re welcome to ask in r/elsalvador\n\nThe answer is nobody uses Bitcoin.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9lbujh",
                                    "author": "SourerDiesel",
                                    "score": 6,
                                    "created_utc": 1653244073.0,
                                    "response": "Very few of them use it for savings and fewer still for payments, but many use lightning network for remittances without even being aware they're using bitcoin under the hood.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9ltlw5",
                                            "author": "lDanceLikeThis",
                                            "score": 9,
                                            "created_utc": 1653252187.0,
                                            "response": "in other words, ask a Salvadorian if they use packet switched networks and they'll say NO. Eventhough most have cell phones and that does use it.\nThey don't know and don't care, but they'll use it. \nSo many hoping for a failure in El Salvador; so sad.",
                                            "depth": 4,
                                            "comments": []
                                        },
                                        {
                                            "id": "i9lt7fl",
                                            "author": "Snow75",
                                            "score": 1,
                                            "created_utc": 1653252003.0,
                                            "response": "Do you have any data to backup that?",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9nohz3",
                                                    "author": "infopocalypse",
                                                    "score": 1,
                                                    "created_utc": 1653289558.0,
                                                    "response": "let me pull up the I hope El Salvador fails survey.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "id": "i9linjh",
                                    "author": "OtherDetective",
                                    "score": 2,
                                    "created_utc": 1653247156.0,
                                    "response": "The question should be asked yearly. The adoption rates are clearly rising.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9mnzyy",
                                            "author": "Malecite",
                                            "score": 1,
                                            "created_utc": 1653267374.0,
                                            "response": "This year the adoption rate for chivo was like 0 percent, they are not clearly rising and 61% of the population quit using the platform immediately after transferring out the free money",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9mtzhb",
                                                    "author": "Correct-Log5525",
                                                    "score": 3,
                                                    "created_utc": 1653270383.0,
                                                    "response": "If you think the adoption rate of Bitcoin is 0% then you may want to reassess, it clearly is not.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9mz3pg",
                                                            "author": "Malecite",
                                                            "score": 1,
                                                            "created_utc": 1653272994.0,
                                                            "response": "The adoption of chivo wallet in El Salvador has been close to zero according to several different articles, I never said bitcoin although you can make the logical assumption.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9n0e6a",
                                                                    "author": "Correct-Log5525",
                                                                    "score": 3,
                                                                    "created_utc": 1653273655.0,
                                                                    "response": "\"According to several articles\". And yet, the people who have been on the ground there at El Zonte and San Salvador say that everywhere they go people are paying for goods and services in Bitcoin.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9n1ap4",
                                                                            "author": "Malecite",
                                                                            "score": 1,
                                                                            "created_utc": 1653274127.0,
                                                                            "response": "So a survey from El Salvadors own economic ministry holds no weight? But random second hand descriptions of a very small portion of the economic activity of an entire country persuades you? Okay.\n\nThe same survey indicated 86% of businesses have never transacted in bitcoin, other interviews with people who represent those businesses indicate they want absolutely nothing to do with bitcoin.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i9n34up",
                                                                                    "author": "Correct-Log5525",
                                                                                    "score": 2,
                                                                                    "created_utc": 1653275101.0,
                                                                                    "response": "Link the survey that says 86% of El Salvadoran businesses have never used lightning network for a transaction",
                                                                                    "depth": 9,
                                                                                    "comments": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i9mp6t0",
                                                    "author": "OtherDetective",
                                                    "score": 1,
                                                    "created_utc": 1653267983.0,
                                                    "response": "So 40% is still using, and adoption rate is much greater than 0%, I don’t know where you get your numbers, but fool, look at yourself in the mirror, El Salvador is the first country to take on Bitcoin as an official money in the history of ever, 12 years after Bitcoin was first invented. The FIRST country. And we know where it goes from here, many other countries will join, and those countries will be able to easily trade with each other, etc. \nYou probably didn’t read the news about El Salvador recently, check it out, the development is real. Anyway think however you want to think, I’m going to hold my bag in case this thing takes off. Let’s see who’s right buddy.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9mpy32",
                                                            "author": "Malecite",
                                                            "score": 0,
                                                            "created_utc": 1653268379.0,
                                                            "response": "It's funny how levelling any kind of criticism always gets this kind of personal visceral response lol. You pack your bags man I'm sure the El Salvadorans arr jealous, a recent survey showed only 10% of those interviewed even understood what crypto currency was and why it would even matter to them.\n\nHere's one of several articles discussing this btw.\n\nhttps://www.bnnbloomberg.ca/bitcoin-struggles-to-take-root-in-el-salvador-survey-finds-1.1757159\n\nOh sorry its 20% not 40% my mistake.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9mqxcs",
                                                                    "author": "OtherDetective",
                                                                    "score": 1,
                                                                    "created_utc": 1653268872.0,
                                                                    "response": "Well, I mean the ultimate end of any debate is future developments. I see the future, and I’m just trying to help you. I believe I’m right, and I’m saying find whatever is true to you. I believe in Bitcoin on so many levels, and if you don’t that’s cool. \n\nDon’t playa hate me because my frontal lobes are beautiful.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "id": "i9non74",
                                                    "author": "infopocalypse",
                                                    "score": 1,
                                                    "created_utc": 1653289682.0,
                                                    "response": "Use of Chivo has nothing to do with adoption. switching from chivo to a self custody wallet would signal a greater understanding.",
                                                    "depth": 5,
                                                    "comments": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9limeu",
                            "author": "Dormage",
                            "score": 3,
                            "created_utc": 1653247142.0,
                            "response": "They dont. There is no need for it. They never had a problem with payment rails. USD works just fine.\nAs for financial independence, thats a different story.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9mcb7c",
                                    "author": "FigTreeMike",
                                    "score": 2,
                                    "created_utc": 1653261230.0,
                                    "response": "Western Union costs upwards of 50% of remittance.  Lightning Network costs essentially 0.  These things take time to develop.  Give it 5-10 years before you see real change.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9mcig3",
                                            "author": "Dormage",
                                            "score": 0,
                                            "created_utc": 1653261335.0,
                                            "response": "There is very little need for such services compared to the velocity of payments.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9mu2y5",
                                                    "author": "Correct-Log5525",
                                                    "score": 3,
                                                    "created_utc": 1653270432.0,
                                                    "response": "If you can send money to a family member for free of for a 20% fee what would you do?",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i9msesr",
                                                    "author": "FigTreeMike",
                                                    "score": 1,
                                                    "created_utc": 1653269607.0,
                                                    "response": "very little need of what?",
                                                    "depth": 5,
                                                    "comments": []
                                                },
                                                {
                                                    "id": "i9npkkh",
                                                    "author": "infopocalypse",
                                                    "score": 0,
                                                    "created_utc": 1653290469.0,
                                                    "response": "lightning is the greatest velocity. speed of light.",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9nq2b4",
                                                            "author": "Dormage",
                                                            "score": -2,
                                                            "created_utc": 1653290902.0,
                                                            "response": "Velocity in this case is a measure of activity on the network. How many transactions are being processed not the capability of the network.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9nq7tx",
                                                                    "author": "infopocalypse",
                                                                    "score": 1,
                                                                    "created_utc": 1653291039.0,
                                                                    "response": "I'm confused to what your ultimate  point is. Is WU not necessary? Is btc not necessary? Number of transactions by either is fluid and can change.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9nqx7a",
                                                                            "author": "Dormage",
                                                                            "score": 1,
                                                                            "created_utc": 1653291683.0,
                                                                            "response": "My point is, the people of El Salvador are not using Bitcoin because it does not solve any of their problems. They have been using mastercard and visa for payments and it works well. So most of the velocity(transactions) happen there and it works well. Bitcoin on the other hand introduces a lot of friction for dilivering a solution to a problem which the is already solved.\n\nSo again, Bitcoin is not being used as a payment system. It should be used as a store of value is this is something Bitcoin is uniquely capable at. There is no other harder asset then Bitcoin.\n\nI never expected adoption of BTC as a payment network would thrive in El Salvador or any other country.",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i9nsbey",
                                                                                    "author": "infopocalypse",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653292981.0,
                                                                                    "response": "You can't send remittance with visa/Mc. It won't help them against inflation or a failing currency. It won't bank the unranked. I mean you are way off on this",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i9nswqv",
                                                                                            "author": "Dormage",
                                                                                            "score": 2,
                                                                                            "created_utc": 1653293543.0,
                                                                                            "response": "We are talking about the same thing. Im just saying we should not expect them to use Bitcoin for things that are already solved. Bitcoin is not better then visa or mastercard at processing payments. It is siutable for remittance(which is a fraction of money velocity) and store of value. I did not know there were unbanked in El Salvador, i think this is more of an issue in Africa and some parts of Asia.\n\nBut end of the day, the videos and posts here attempt to show how much Bitcoin is being used for payments where in fact it is not. \n\nThey should be using Bitcoin for what it is, a non custodial store of value.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "id": "i9nsvr8",
                                                                                    "author": "RottenPlankton",
                                                                                    "score": 1,
                                                                                    "created_utc": 1653293517.0,
                                                                                    "response": ">They have been using mastercard and visa for payments and it works well. \n\nYou are absolutely wrong. Only about 7% of the citizens of El Salvador have a credit card and only around 30% of them even have a bank account.",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i9nt0co",
                                                                                            "author": "Dormage",
                                                                                            "score": 1,
                                                                                            "created_utc": 1653293639.0,
                                                                                            "response": "I did not know that, that can be something Bitcoin can address. Is there a reason why they do not? Is it that they do not have a need for it, or is it lack of access to banking services?",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "id": "i9kznmc",
                            "author": "DonOregano",
                            "score": 2,
                            "created_utc": 1653238811.0,
                            "response": "I'd say the question is whether they will be using it in 5 years. We are still in the gradually phase, and will likely be there for a few years still.\n\nChanging the habits of a population takes time!",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9mu91v",
                                    "author": "Correct-Log5525",
                                    "score": 1,
                                    "created_utc": 1653270519.0,
                                    "response": "This is the truth..  it's like declaring the internet wasn't being adopted in the early days just because the infrastructure was being built out and improved upon..  now look at it 25 years later",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        },
                        {
                            "id": "i9noex6",
                            "author": "infopocalypse",
                            "score": 1,
                            "created_utc": 1653289487.0,
                            "response": "adoption of new tech takes time. Think of how long it took for people to be familiar with email. The announcement that they would was only 8 months ago. This stuff takes time.  But they will be ahead of the curve.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9l1a8i",
                    "author": "Spl00ky",
                    "score": 3,
                    "created_utc": 1653239478.0,
                    "response": "Ya put your lifesavings into bitcoin and then watch it implode because some clown running a stablcoin manipulates the market",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9mubv9",
                            "author": "Correct-Log5525",
                            "score": 2,
                            "created_utc": 1653270559.0,
                            "response": "Implode?!  I'm up over 1,000% and up over 700% since Covid started",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9moydk",
                    "author": "Malecite",
                    "score": 1,
                    "created_utc": 1653267868.0,
                    "response": "The article states the members got together to discuss \"banking inclusion\", it also states that there was no discussion about making bitcoin a legal currency, so why is this even noteworthy?\n\nAs far as banking inclusion goes, M-Pesa already fulfils the role that crypto would play and uses dumb phones and an extremely simple architecture. After watching El Salvador basically ignore crypto with 86% of businesses not having processed a single bitcoin transaction, why are we so excited that 3rd world countries would choose to adopt bitcoin?",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9munno",
                            "author": "Correct-Log5525",
                            "score": 2,
                            "created_utc": 1653270720.0,
                            "response": "Dude, if you can't see how this is newsworthy then you are just super biased.  They literally had over 100 central bankers from 44 countries download Bitcoin wallets, use them to transact for several days and had seminars discussing the El Salvador rollout steps and it's impact on tourism and domestic financial inclusion...",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9ncppv",
                    "author": "BlockChainR3volution",
                    "score": 0,
                    "created_utc": 1653280747.0,
                    "response": "Can we  literally stop glamorizing El Salvador🙄🙄 literally has am economy in shambles. Highest crime, gang violence rate. Hence why ppl keep leaving. But they are the future 🙄🙄 do u guys not see how they are screwing their own people over for these headlines that will go nowhere 🙄. Just stop",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9nt0kn",
                            "author": "NearbyTurnover",
                            "score": 1,
                            "created_utc": 1653293645.0,
                            "response": "> Can we literally stop glamorizing El Salvador\n\nNo.",
                            "depth": 2,
                            "comments": []
                        }
                    ]
                },
                {
                    "id": "i9m4bzu",
                    "author": "Noob313373",
                    "score": 1,
                    "created_utc": 1653257208.0,
                    "response": "He paid in btc, buy food for btc = btc stable",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9m580s",
                    "author": "BitcoinUser263895",
                    "score": 1,
                    "created_utc": 1653257645.0,
                    "response": "I liked it better when you took a 3 second break from posting blogspam.",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9m5hh1",
                    "author": "MinecraftMongol",
                    "score": 1,
                    "created_utc": 1653257774.0,
                    "response": "Is there any list of those 44 countries? Like which ones?",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9ngi2a",
                    "author": "Sea_Conversation2799",
                    "score": 1,
                    "created_utc": 1653283337.0,
                    "response": "Maybe if this happened in the bull market. Humans are really short term thinkers. Especially when it's something they aren't knowledgeable enough on to give the benifit of the doubt.  I still hear people say crypto has crashed and they are glad they never got in.  That's basically all most people need to know. In a few years when some sequence of events or natural cycles restart they will consider it again at the top before deciding they were geniuses for not buying because it crashed from 300k to 100k.  \n\nBut that you think these non Bitcoin people will be convinced in the current market conditions and by a kind of half failed expiriment in El Salvador... Sorry man. It's not the right time yet",
                    "depth": 1,
                    "comments": []
                },
                {
                    "id": "i9noz1t",
                    "author": "MartinCavallo",
                    "score": 1,
                    "created_utc": 1653289963.0,
                    "response": "I have doubts, things could bog down into wait-and-see and/or be a rash of CBDC attempts promising more aspects of BTC such as zero or capped inflation",
                    "depth": 1,
                    "comments": []
                }
            ]
        },
        {
            "id": "uvbydj",
            "title": "Inflation is a disease",
            "url": "https://www.youtube.com/watch?v=q9b5ZO7uOIg",
            "author": "Straight-Lynx-3309",
            "created_utc": 1653229304.0,
            "score": 35,
            "num_comments": 20,
            "subreddit": "Bitcoin",
            "selftext": "",
            "stickied": false,
            "comments": [
                {
                    "id": "i9ke9k1",
                    "author": "Darksylum1982",
                    "score": 6,
                    "created_utc": 1653229494.0,
                    "response": "A legend sharing words of wisdom",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9klxv8",
                            "author": "davidcwilliams",
                            "score": 3,
                            "created_utc": 1653232982.0,
                            "response": "He was the best.",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9m88mu",
                                    "author": "CHA05-R31GN5",
                                    "score": 0,
                                    "created_utc": 1653259143.0,
                                    "response": "You realize that Friedman was pro-corporate and thought they should conduct business in shareholder interests to minimize losses to profit margins. Even if, that may benefit society or employees more than the select few. Which was the original purpose of being incorporated. But, that's been thrown out the window quite often to seek out short term increased gains for shareholder value through layoffs, increased part-time employees or contracted employees, more expensive or reduction to benefits, cheaper products at the expense of longevity, useless production of goods that add little value, outsourcing, anti-union busting, etc.\n\nThe purpose of a corporation is to conduct a lawful, ethical, profitable and sustainable business in order to create value over the long-term, which requires consideration of the stakeholders that are critical to its success (shareholders, employees, customers, suppliers, creditors and communities), as determined by the corporation and the board of directors using its business judgment and with regular engagement with shareholders, who are essential partners in supporting the corporation’s pursuit of this mission.",
                                    "depth": 3,
                                    "comments": [
                                        {
                                            "id": "i9mnp06",
                                            "author": "davidcwilliams",
                                            "score": 2,
                                            "created_utc": 1653267221.0,
                                            "response": "I’ve watched/listened to hours of him speaking, and never came across what you’re describing. If what you’re saying is true, I would disagree with him on corporations, but not companies.",
                                            "depth": 4,
                                            "comments": [
                                                {
                                                    "id": "i9mo0q1",
                                                    "author": "CHA05-R31GN5",
                                                    "score": 1,
                                                    "created_utc": 1653267385.0,
                                                    "response": "Read upon his “Shareholder Value” arguments. I don’t believe your hours would count as thorough. Here’s a wiki. But, search for more related to it.\n\nhttps://en.m.wikipedia.org/wiki/Friedman_doctrine",
                                                    "depth": 5,
                                                    "comments": [
                                                        {
                                                            "id": "i9mreue",
                                                            "author": "davidcwilliams",
                                                            "score": 3,
                                                            "created_utc": 1653269117.0,
                                                            "response": ">\tthe social responsibility of business is to increase its profits\n\nYeah I agree with this 100%. \n\n>\tThe Friedman doctrine has been very influential in the corporate world from the 1980s to the 2000s, but has attracted criticism, particularly since the financial crisis of 2007–2008 (caused by various financial institutions which engaged in excessive risk for profit maximization, causing the bubble and collapse of the American real estate market and triggered the crisis throughout the wider global economy).\n\nThis fails to address the government’s role.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9mt3yt",
                                                                    "author": "CHA05-R31GN5",
                                                                    "score": 1,
                                                                    "created_utc": 1653269951.0,
                                                                    "response": "The government's role is to hold business accountable for environmental impact, value to the communities need for fair trade in the marketplace by not monopolizing that industry, contributions to the expenditures for helping to maintain the community they profit from, and so on. Except, that's not where we are at or even moving towards. In its current form, it's just constant financial corruptive deals which benefit only a few. The government is now just an added cost to doing business for allowing them to operate more freely at the expense of stability within communities. You see it with corporations coming into small towns. Without giving my location, then I've seen it first hand with Walmart and TSC which eventually drove out the local grocer and hardware store. No longer after over 30 years of being there because of not being able to compete.\n\nNow, you can make any excuses you want but that was allowed by the local government who pocketed something in return and so they are to blame as well. And you can make the excuse of \"people can boycott\"...but come on. We know socially that's not going to happen because of already low net worth and so the opportunity to save \"a little bit more\" is targeted by these corporations who can operate on losses for far longer than any small business can. So, the social responsibility of the business to the community wasn't even a concern. It was always profit seeking at all costs and it was allowed by the government who are also paid for. Another example of many that leads our Federal government in Crony Capitalism.",
                                                                    "depth": 7,
                                                                    "comments": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "id": "i9moaba",
                                                            "author": "davidcwilliams",
                                                            "score": 2,
                                                            "created_utc": 1653267527.0,
                                                            "response": "Yeah wasn’t claiming my hours were thorough, was claiming that I am a fan.",
                                                            "depth": 6,
                                                            "comments": [
                                                                {
                                                                    "id": "i9mp3f3",
                                                                    "author": "CHA05-R31GN5",
                                                                    "score": 0,
                                                                    "created_utc": 1653267935.0,
                                                                    "response": "Well, that's on you. I'm not a fan of most anyone. Kind of ridiculous to believe someone is infallible when you are starstruck. I respect them and their opinions. I'll even hold that they are considered truths until I come across something to refute it. Thus far, this was the only argument that he had which simply said that a business only had a social responsibility to shareholders which I believe is wrong. Of course, I've not read all or even a good portion of his work. Business has a social responsibility to the community and their government to operate in their best interests while profit seeking. Otherwise, you get the Crony Capitalism that we have today in the US.",
                                                                    "depth": 7,
                                                                    "comments": [
                                                                        {
                                                                            "id": "i9msyve",
                                                                            "author": "davidcwilliams",
                                                                            "score": 2,
                                                                            "created_utc": 1653269884.0,
                                                                            "response": "So your argument is ‘people should be better’?",
                                                                            "depth": 8,
                                                                            "comments": [
                                                                                {
                                                                                    "id": "i9mteh2",
                                                                                    "author": "CHA05-R31GN5",
                                                                                    "score": 0,
                                                                                    "created_utc": 1653270091.0,
                                                                                    "response": "I don't know where you're going with your reply of \"people should be better\". It's vague and I can't relate it to what I've already said. Sure, people should always be better. Why shouldn't they?",
                                                                                    "depth": 9,
                                                                                    "comments": [
                                                                                        {
                                                                                            "id": "i9n703h",
                                                                                            "author": "davidcwilliams",
                                                                                            "score": 2,
                                                                                            "created_utc": 1653277218.0,
                                                                                            "response": "Because they never will be. People will always act in their own self-interest. Modeling systems that account for this is our best bet. Not to expect people to act unselfishly.",
                                                                                            "depth": 10,
                                                                                            "comments": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "id": "i9l0wkz",
                    "author": "Spl00ky",
                    "score": -2,
                    "created_utc": 1653239319.0,
                    "response": "Great and yet bitcoin is collapsing despite inflations levels we haven't seen in 40 years",
                    "depth": 1,
                    "comments": [
                        {
                            "id": "i9niuon",
                            "author": "davidcwilliams",
                            "score": 4,
                            "created_utc": 1653285046.0,
                            "response": "> bitcoin is collapsing\n\nlol k\n\nhttps://imgur.com/a/MErfLbl",
                            "depth": 2,
                            "comments": [
                                {
                                    "id": "i9oy37v",
                                    "author": "Spl00ky",
                                    "score": 1,
                                    "created_utc": 1653319413.0,
                                    "response": "\\>Inflation at highest levels in 40 years\n\n\\>Bitcoin down 50% from ATH",
                                    "depth": 3,
                                    "comments": []
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}